
Функция Cancel_Return(IncomingSettings)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Cancel_Return", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. Cancel_Return");
	ЗаписьЖурналаРегистрации("Web-сервис Cancel_Return", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. Cancel_Return: " 
	             + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings));

	Результат = ОтменитьВозврат(IncomingSettings); 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Cancel_Return", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. Cancel_Return " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат Результат;
	
КонецФункции

Функция ОтменитьВозврат(Настройки)
	
	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitReturnFromPortal.ПространствоИмен, "RS_Cancel_Return");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitReturnFromPortal.ПространствоИмен, "Out_Cancel_Return");
	СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
	
	Заявка = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(Настройки.IDDOC));
	
	Если не значениеЗаполнено(Заявка) тогда
		
		СтрокаВозврата.MSG = "В базе УТ не найдена заявка на возврат";
		СтрокаВозврата.RESULT = 1;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);			
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;
	
	РеализацияПринадлежитДругомуКонтрагенту = Ложь;
	ПроверятьПоКодуМДМ = СтрДлина(Настройки.KONTRAGENT_) = 36;
	
	Если ПроверятьПоКодуМДМ Тогда
		РеализацияПринадлежитДругомуКонтрагенту = Заявка.Реализация.Контрагент.КодМДМ <> Настройки.KONTRAGENT_;
	Иначе
		РеализацияПринадлежитДругомуКонтрагенту = СокрЛП(Заявка.Реализация.Контрагент.IDАварда) <> СокрЛП(Настройки.KONTRAGENT_);	
	КонецЕсли;
	
	Если РеализацияПринадлежитДругомуКонтрагенту Тогда
		
		СтрокаВозврата.MSG = "В базе УТ отличается контрагент в заявке на возврат";
		СтрокаВозврата.RESULT = 1;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);			

		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;
	
	ДокЗаявка = Заявка.ПолучитьОбъект();
	ДокЗаявка.Статус = "Отменен";
	
	Для каждого строка из ДокЗаявка.Товары Цикл
		Строка.Статус = "Отменен";
	КонецЦикла;
	
	Попытка
		ДокЗаявка.Записать();
	Исключение
		
		СтрокаВозврата.MSG = "Ошибка при записи документа в базу";
		СтрокаВозврата.RESULT = 1;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);			

		Возврат РезультатДляВозвратаПорталу;
		
	КонецПопытки ;
	
	СтрокаВозврата.RESULT = 0;
	РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);			
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции