
Функция getDocs(Incom)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис GetDocs", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. Result");
	
	Результат = getDocs_(Incom);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис GetDocs", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. Result " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат Результат;
	
КонецФункции

Функция getDocs_(Параметры)
	
	//получаем входящие параметры
	Дата	  = Дата(Параметры.Doc_Date);
	ИДДок	  = Параметры.Doc_ID;
	Формат    = Параметры.Format;  	
	Тип       = Параметры.TypeDoc;
	ИДКонтр   = Параметры.Kontr_ID;
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.getDocs.ПространствоИмен, "RS_getDocs");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.getDocs.ПространствоИмен, "Out_getDocs");  
	НетДокумента = Ложь;
	
	Если НЕ ВРег(Тип) = "RETURN" Тогда
		
		ДокСФ = Документы.СчетФактураВыданный.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДок));
		
		Если ЗначениеЗаполнено(ДокСФ) тогда
			ДокОбъект = ДокСФ.ДокументыОснования[0].ДокументОснование.ПолучитьОбъект();
		Иначе
			НетДокумента = Истина;
		КонецЕсли;
		
		Если НетДокумента тогда
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Status = 1;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			Возврат	РезультатДляВозвратаПорталу;	
			
		КонецЕсли;
		
		Если ВРег(Тип) = "ORDER" тогда
			ПечатныеФормы = НовыйСчет(ДокОбъект);
		ИначеЕсли ВРег(Тип) = "UPD" тогда
			ПечатныеФормы = ПечатьУниверсальногоПередаточногоДокумента(ДокОбъект);
		Иначе
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Status = 2;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			Возврат	РезультатДляВозвратаПорталу;			
			
		КонецЕсли;
		
		НазваниеДокумента = ОбщегоНазначения.СформироватьЗаголовокДокумента(?(ВРег(Тип) = "ORDER", ДокОбъект.Ссылка, ДокСФ), ?(ВРег(Тип) = "ORDER", "Счет", "УПД"));
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, "/", "-");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, ".", "");
		
		Если ВРег(Формат) = "PDF" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".pdf";
			ПечатныеФормы.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		ИначеЕсли ВРег(Формат) = "XLS" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".xls";
			ПечатныеФормы.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		Иначе
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Status = 2;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			Возврат	РезультатДляВозвратаПорталу;	
			
		КонецЕсли;
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
		СтрокаВозврата.Status = 0;
		СтрокаВозврата.DocFile = Рез;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		
	ИначеЕсли ВРег(Тип) = "RETURN" Тогда 
		
		Формат = "PDF";
		ДокВозврат = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДок));
		
		Если ЗначениеЗаполнено(ДокВозврат) тогда
			ДокОбъект = ДокВозврат.ПолучитьОбъект();
		Иначе
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Status = 1;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			Возврат	РезультатДляВозвратаПорталу;
			
		КонецЕсли; 
		
		ТаблДокВозврат = Новый ТабличныйДокумент;
		ТаблДокВозврат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТаблДокВозврат.АвтоМасштаб = Истина;
		
		//Формируем письмо-претензию
		ПечатнаяФормаВозврат  = ПечатьВозврата(ДокОбъект);
		ТаблДокВозврат.Вывести(ПечатнаяФормаВозврат);
		ТаблДокВозврат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Формируем заявлениен на возврат для розничных или возврат
		Если ДокОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда	
			ПечатнаяФормаПисьмо = ПечатьЗаявлениеНаВозвратФизЛица(ДокОбъект); 
		Иначе
			ПечатнаяФормаПисьмо =  ПечатьПретензии(ДокОбъект);
		КонецЕсли;
		
		ВремТабДок = Новый ТабличныйДокумент;
		ОбластьЯчеек = ВремТабДок.Вывести(ПечатнаяФормаПисьмо);		
		ОбластьЯчеек.СоздатьФорматСтрок();
		ТаблДокВозврат.Вывести(ВремТабДок);	
		
		НазваниеДокумента = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект.Ссылка, "Заявка на возврат");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, "/", "-");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, ".", ""); 
		
		Если ВРег(Формат) = "PDF" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".pdf";
			ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		ИначеЕсли ВРег(Формат) = "XLS" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".xls";
			ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		Иначе
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Status = 2;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			Возврат	РезультатДляВозвратаПорталу;	
			
		КонецЕсли;
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
		СтрокаВозврата.Status = 0;
		СтрокаВозврата.DocFile = Рез;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		
	Иначе
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
		СтрокаВозврата.Status = 1;
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		Возврат	РезультатДляВозвратаПорталу; 		
		
	КонецЕсли;
	
	Возврат	РезультатДляВозвратаПорталу;	

КонецФункции

Функция ПечатьУниверсальногоПередаточногоДокумента(Док)
		
		ДанныеДокумента = Новый Структура();
		ДанныеДокумента.Вставить("ДокументСсылка",    				Док.Ссылка);
		ДанныеДокумента.Вставить("Номер",             				Док.Номер);
		ДанныеДокумента.Вставить("Дата",              				Док.Дата);
		ДанныеДокумента.Вставить("Ссылка", 			  				Документы.СчетФактураВыданный.ПустаяСсылка());
		ДанныеДокумента.Вставить("ДокументОснование", 				Док.Ссылка);
		ДанныеДокумента.Вставить("Организация",   	  				Док.Организация);
		ДанныеДокумента.Вставить("Контрагент", 		  				Док.Контрагент);
		ДанныеДокумента.Вставить("ДоговорКонтрагента", 		  		Док.ДоговорКонтрагента);
		ДанныеДокумента.Вставить("Руководитель", 	  				Док.ОтпускРазрешил);
		ДанныеДокумента.Вставить("ГлавныйБухгалтер",  				Неопределено);
		ДанныеДокумента.Вставить("ВалютаРегламентированногоУчета",  глЗначениеПеременной("ВалютаРегламентированногоУчета"));
		ДанныеДокумента.Вставить("Подразделение", 	  				Док.Подразделение);
		
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.ДоговорКонтрагента, "ВидДоговора");
		ПередачаНаРеализациюПоКомиссии = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		ДанныеДокумента.Вставить("ПередачаНаРеализациюПоКомиссии",  ПередачаНаРеализациюПоКомиссии);
		
		СчетФактураТребуется = УчетНДС.ОпределитьСчетФактураТребуется(Док);
		
		СтруктураОтбораСчетаФактуры = Новый Структура;
		СтруктураОтбораСчетаФактуры.Вставить("ПометкаУдаления", Ложь);
		
		Возврат ПечатьУниверсальногоПередаточногоДокумента1(ДанныеДокумента, СчетФактураТребуется, СтруктураОтбораСчетаФактуры);
		
	КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция ПечатьУниверсальногоПередаточногоДокумента1(ДанныеДокумента, СчетФактураТребуется, СтруктураОтбораСчетаФактуры = Неопределено, ТабДокумент = Неопределено) Экспорт
	
	Если СтруктураОтбораСчетаФактуры = Неопределено Тогда
		СчетФактура = учетндс.НайтиПодчиненныйСчетФактуру(ДанныеДокумента.ДокументСсылка, "СчетФактураВыданный");
	Иначе
		СчетФактура = учетндс.НайтиПодчиненныйСчетФактуру(ДанныеДокумента.ДокументСсылка, "СчетФактураВыданный", СтруктураОтбораСчетаФактуры);
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда
		
		ТабДокумент = Новый ТабличныйДокумент;
		// Устанавливаем параметры печати и колонтитулы
		ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху 			= 12;
		ТабДокумент.ПолеСлева  			= 0;
		ТабДокумент.ПолеСнизу  			= 0;
		ТабДокумент.ПолеСправа 			= 0;
		ТабДокумент.АвтоМасштаб 		= Истина;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетФактура) ИЛИ СчетФактураТребуется Тогда
		
		// УПД печатается из документа счет-фактура
		Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'По документу ""%1"" не выписан счет-фактура или он помечен на удаление!'"), ДанныеДокумента.ДокументСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
			
		КонецЕсли;
		
		РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СчетФактура, "Дата, ВидСчетаФактуры, Исправление,НомерИсправления,
			|СчетФактураБезНДС, КППКонтрагента");
		ДанныеДокумента.Вставить("Ссылка", 					СчетФактура); 
		ДанныеДокумента.Вставить("Дата", 					РеквизитыСФ.Дата);
		ДанныеДокумента.Вставить("ВидСчетаФактуры", 		РеквизитыСФ.ВидСчетаФактуры);
		ДанныеДокумента.Вставить("Исправление", 	 		РеквизитыСФ.Исправление);
		ДанныеДокумента.Вставить("НомерИсправления", 		РеквизитыСФ.НомерИсправления);
		ДанныеДокумента.Вставить("СчетФактураБезНДС", 		РеквизитыСФ.СчетФактураБезНДС);
		ДанныеДокумента.Вставить("КППКонтрагента", 	 		РеквизитыСФ.КППКонтрагента);
		
		СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
		ДанныеДляПечати = СчетФактураОбъект.ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(ДанныеДокумента);
		
		Если ДанныеДляПечати = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ДанныеДокумента.Свойство("ДатаОтгрузкиПередачи") Тогда
			ДанныеДляПечати.Вставить("ДатаОтгрузкиПередачи", ДанныеДокумента.ДатаОтгрузкиПередачи);
		КонецЕсли;

		ПечатьУниверсальногоПередаточногоДокумента2(ДанныеДляПечати, ТабДокумент);
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	возврат неопределено;
КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция ПечатьУниверсальногоПередаточногоДокумента2(ДанныеДляПечати, ТабДокумент = Неопределено) Экспорт
	
	//+Гавриленков В. 25.03.2026 #UT10-5782
	Если ДанныеДляПечати.Дата >= Дата(2026,4,1) Тогда
		
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент26");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
	
	//-Гавриленков В. 25.03.2026 #UT10-5782
	//+Белов А. 22.12.2025 #UT10-5600
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2026,1,1) Тогда
		
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент1096_2026");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
	
	//-Белов А. 22.12.2025 #UT10-5600
	//+Гавриленков В. 26.09.2024 #UT10-4795 Добавлен УниверсальныйПередаточныйДокумент1096  		
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2024,10,1) Тогда 
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент1096");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2021, 07, 1) Тогда
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент534");
	ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры >= Дата(2017,10,1) Тогда
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент981");
	Иначе
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	УчетНДС.ВывестиПодвалУниверсальногоПередаточногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция НовыйСчет(Док) Экспорт 
	
	ТабДокумент  = Новый ТабличныйДокумент;
	Макет = Док.ПолучитьМакет("СчетЗаказ");
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Док.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.ОтпускПроизвел,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов,
	|	РеализацияТоваровУслуг.КратностьВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
	
	// 	Если Тип = "Счет" Тогда
	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
	
	Банк       = СведенияОПоставщике.Банк;
	БИК        = ?(ЗначениеЗаполнено(Банк),Банк.Код, "");
	КоррСчет   = ?(ЗначениеЗаполнено(Банк),Банк.КоррСчет, "");
	ГородБанка = ?(ЗначениеЗаполнено(Банк),Банк.Город, "");
	НомерСчета = СведенияОПоставщике.НомерСчета;
	
	ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
	ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
	ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
	ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
	ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
	ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
	ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
	
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения) Тогда
		ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ТекстПоставщик = "Поставщик:";
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");

	Если Константы.База.Получить() = Перечисления.НазваниеБазы.Тула Тогда 
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата)
		, "ПолноеНаименование,ФактическийАдрес,");
		
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	КонецЕсли;      
	
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);

	ОбластьМакета.Параметры.ТекстПокупатель = "Покупатель:";
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузополучатель, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,");
	ТабДокумент.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	//
	Всего = 0;			
	ВсегоНДС = 0;			
	
	Для каждого ТекСтр Из Док.Товары Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.НомерСтроки =   ТекСтр.НомерСтроки;
		ОбластьМакета.Параметры.Товар =   ТекСтр.Номенклатура.НаименованиеПолное;
		ОбластьМакета.Параметры.Количество =  ТекСтр.Количество;
		ОбластьМакета.Параметры.ЕдиницаИзмерения = ТекСтр.ЕдиницаИзмерения;
		ОбластьМакета.Параметры.Цена =   ТекСтр.Цена;
		ОбластьМакета.Параметры.ТоварРодитель = ТекСтр.Номенклатура.Родитель;
		ОбластьМакета.Параметры.КодПроизводителя = ТекСтр.Номенклатура.КодПроизводителя;
		ОбластьМакета.Параметры.Сумма = ?(Док.СуммаВключаетНДС, ТекСтр.Сумма,ТекСтр.Сумма+ТекСтр.СуммаНДС);
		
		ТабДокумент.Вывести(ОбластьМакета);
		Всего = Всего + ТекСтр.Сумма;			
		ВсегоНДС = ВсегоНДС + ТекСтр.СуммаНДС;		
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("НДС");
	ОбластьМакета.Параметры.Всего = Всего;
	ОбластьМакета.Параметры.НДС = ?(Док.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
	ОбластьМакета.Параметры.ВсегоНДС = ВсегоНДС;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	Сумма	 = ?(Док.СуммаВключаетНДС, Док.Товары.Итог("Сумма"), Док.Товары.Итог("Сумма") + Док.Товары.Итог("СуммаНДС"));
	
	СуммаКПрописи = Сумма; 
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + Док.Товары.Количество()
	+ ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Организация, Шапка.Дата,);
	
	Руководитель = Руководители.Руководитель;
	ДолжностьРуководителя = Руководители.РуководительДолжность;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	Если НЕ ЗначениеЗаполнено(Док.Ответственный.ФизЛицо) Тогда
		ФИООтветственный = Док.Ответственный.Наименование;
	Иначе
		
		ФамилияИмяОтчествоФизЛица      	 = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Док.Ответственный.ФизЛицо, Шапка.Дата);
		ФамилияИмяОтчествоОтветственного = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
		ФИООтветственный         		 = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоОтветственного);
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ФИООтветственный = ФИООтветственный;
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСлева = 1;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьПретензии(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("ПретензияПортал");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.ИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.Контрагент.КПП = """"
	|				ИЛИ ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.КПП
	|	КОНЕЦ КАК КПП,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Комментарий КАК ТекстКомментарий,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.НаименованиеПолное КАК Контрагент,
	|	ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Реализация.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ПромОбъект.Реализация, "СчетФактураВыданный"); 
		
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			
			НомерУПД = СчетФактура.Номер;
			ДатаУПД = СчетФактура.Дата;
			
		Иначе
			
			НомерУПД = ВыборкаШапка.Реализация.Номер;
			ДатаУПД = ВыборкаШапка.Реализация.Дата;
			
		КонецЕсли;
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);		     
		Обл.Параметры.ТекстДоговор = "В рамках договора" + ?(ВыборкаШапка.ЛицевойСчет, " оферты", " поставки") + " с " + ВыборкаШапка.ОрганизацияНаименование + " ИНН/КПП " +
		ВыборкаШапка.ОрганизацияИНН + "/" + ВыборкаШапка.ОрганизацияКПП + " по УПД № " + НомерУПД +
		" от " + Формат(ДатаУПД, "ДФ=dd.MM.yyyy") + " нами были получены следующие позиции: "; 
		ТабДокумент.Вывести(Обл);
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ИтогоСумма = 0;
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		ТабДокумент.Вывести(Обл);
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ТекстКомментарий = "";
	ТабДокумент.Вывести(Обл);
	
	Для Сч = 1 По 60 - ТабДокумент.ВысотаТаблицы Цикл
		
		Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Низ");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ВремяПечати = ТекущаяДата();
	ТабДокумент.Вывести(Обл); 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьВозврата(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("Возврат");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ЗаявкаНаВозврат.Реализация.Контрагент КАК Поставщик,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.ИНН КАК ИНН,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.КПП КАК КПП,
	|	КонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Реализация.Номер,
	|	ЗаявкаНаВозврат.Реализация.Дата,
	|	ЗаявкаНаВозврат.Реализация.Грузополучатель КАК филиал,
	|	ЗаявкаНаВозврат.Комментарий КАК Примечание,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК СФНомер,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, """") КАК СФДата
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданный.ДокументОснование = ЗаявкаНаВозврат.Реализация
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	РеализацияНомер = "";
	РеализацияДата = "";
	ТипВозврата = "";
	ВозвратТовара = "";
	
	ЗапросШапкаРекламация = Новый Запрос;
	ЗапросШапкаРекламация.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втТипПервойСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаВозвратТовары.Тип) КАК ТипВозвратаКоличествоРазличных,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втКоличествоТипов
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКоличествоТипов.ТипВозвратаКоличествоРазличных,
	|	втТипПервойСтроки.Тип
	|ИЗ
	|	втТипПервойСтроки КАК втТипПервойСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКоличествоТипов КАК втКоличествоТипов
	|		ПО втТипПервойСтроки.Ссылка = втКоличествоТипов.Ссылка";
	
	ЗапросШапкаРекламация.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапкаРекламация = ЗапросШапкаРекламация.Выполнить().Выбрать();
	
	Если ВыборкаШапкаРекламация.Следующий() и ВыборкаШапкаРекламация.ТипВозвратаКоличествоРазличных = 1 И ВыборкаШапкаРекламация.Тип = "Рекламация" Тогда
		
		ТипВозврата = "Возврат брака";
		ВозвратТовара = "Рекламация покупателя";
		
	Иначе
		
		ТипВозврата = "Возврат";
		ВозвратТовара = "Возврат товара";
		
	КонецЕсли; 
	
	Если ПромОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда
		ВозвратТовара = ВозвратТовара + " " + "(розн)";
	ИначеЕсли ПромОбъект.Реализация.ДоговорКонтрагента.ЛицевойСчет Тогда 
		ВозвратТовара = ВозвратТовара + " " + "(лиц.сч.)";
	КонецЕсли;
	
	Если ВыборкаШапка.Следующий() Тогда
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);
		Обл.Параметры.ВремяПечати = ТекущаяДата();
		Обл.Параметры.Возврат = ТипВозврата;
		Обл.Параметры.ВозвратТовара = ВозвратТовара;
		
		Если ВыборкаШапка.СФНомер = "" Тогда 
			
			РеализацияНомер = ВыборкаШапка.РеализацияНомер;
			РеализацияДата = ВыборкаШапка.РеализацияДата;
			
		Иначе
			
			РеализацияНомер = ВыборкаШапка.СФНомер;
			РеализацияДата = ВыборкаШапка.СФДата;
			
		КонецЕсли;
		
		ИмяРисункаШК = "D1";
		КоличествоМиллиметровВПикселе = 0.26;
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Обл.Рисунки[ИмяРисункаШК].Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Обл.Рисунки[ИмяРисункаШК].Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ПромОбъект.Ссылка)));
		ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    9);
		
		Обл.Рисунки[ИмяРисункаШК].Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ТабДокумент.Вывести(Обл);
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель,
	|	1 КАК Коэффициент,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		Обл.Параметры.Реализация = РеализацияНомер + " от " + Формат(РеализацияДата, "ДФ=dd.MM.yyyy"); 
		Обл.Параметры.ПредставлениеТовара = ВыборкаТЧ.КодПроизводителя + " " + ВыборкаТЧ.Наименование;
		ИтогоКоличество = ИтогоКоличество + ВыборкаТЧ.Количество;
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Количество = ИтогоКоличество;
	Обл.Параметры.Сумма = ИтогоСумма;
	ТабДокумент.Вывести(Обл);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДанныеЧекаНаПечать(ДокОбъект)  Экспорт
	
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("НомерЧека");
	ТаблицаЧеков.Колонки.Добавить("ДатаЧека"); 
	
	ТекстВозврат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация
	|ПОМЕСТИТЬ ВтРеализация
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализация КАК ВтРеализация
	|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = ВтРеализация.Реализация
	|			И (ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Аннулирован = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.НомерЧекаККМ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Дата
	|ИЗ
	|	ВтРеализация КАК ВтРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|		ПО ВтРеализация.Реализация = ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом
	|			И (ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации)";  
	
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);  
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если Не ЗначениеЗаполнено(Выборка.НомерЧекаККМ) Тогда
			Продолжить;
		КонецЕсли;  
		
		НовСтрока = ТаблицаЧеков.Добавить();
		НовСтрока.НомерЧека = СокрЛП(Выборка.НомерЧекаККМ);
		НовСтрока.ДатаЧека = Формат(Выборка.Дата, "ДЛФ=DD"); 
		
	КонецЦикла;
	
	Возврат ТаблицаЧеков;
	
КонецФункции

Функция  ПечатьЗаявлениеНаВозвратФизЛица(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозвратПортал";
	Макет = ПромОбъект.ПолучитьМакет("ЗаявлениеНаВозвратФизЛицаПортал");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	СведенияОбОрганизации  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ПромОбъект.Реализация.Организация,ПромОбъект.Дата,, ПромОбъект.Реализация.Организация.ОсновнойБанковскийСчет); 
	ОбластьШапка.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.Представление;
	ОбластьШапка.Параметры.АдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННКПП = СведенияОбОрганизации.ИНН+"/"+СведенияОбОрганизации.КПП;
	ОбластьШапка.Параметры.РасчетныйСчет = "Р/с "+СведенияОбОрганизации.НомерСчета;
	ОбластьШапка.Параметры.НаименованиеБанка = СведенияОбОрганизации.Банк;
	ОбластьШапка.Параметры.БикБанка = "БИК "+СведенияОбОрганизации.БИК;
	ОбластьШапка.Параметры.КоррСчет = "К/с "+СведенияОбОрганизации.КоррСчет;
	
	Если НЕ СведенияОбОрганизации.Банк = "" Тогда 
		ОбластьШапка.Параметры.ТелефонБанка = ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк.Телефоны), "Тел." + СведенияОбОрганизации.Банк.Телефоны, "");
	КонецЕсли;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(ПромОбъект.Реализация.Организация, ПромОбъект.Дата,);
	ОбластьШапка.Параметры.ФИОДиректора = ?(ЗначениеЗаполнено(Руководители.РуководительВДательномПлатеже), Руководители.РуководительВДательномПлатеже, Руководители.Руководитель);
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	ОбластьСтроки.Параметры.ДатаРеализации = Формат(ПромОбъект.Реализация.Дата,"ДЛФ=DD");
	ПромСтрокаТовары = "";
	
	Для Каждого СтрокаТовары Из ПромОбъект.Товары Цикл
		ПромСтрокаТовары = ПромСтрокаТовары + ?(СокрЛП(ПромСтрокаТовары) = "", "", Символы.ПС) + СокрЛП(СтрокаТовары.Номенклатура.Наименование) 
		            + " " + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + " " + СокрЛП(СтрокаТовары.Номенклатура.Родитель) + " - " + СтрокаТовары.Количество + " шт.";
	КонецЦикла;
	
	СуммаПоДокументу = ПромОбъект.Товары.Итог("Сумма");
	ОбластьСтроки.Параметры.СуммаВозврата = Формат(СуммаПоДокументу,"ЧДЦ=2; ЧРД=,; ЧГ=") + " руб. (" 
	             + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаПоДокументу, ПромОбъект.Реализация.ВалютаДокумента) + ")";
	ОбластьСтроки.Параметры.СписокТоваров = ПромСтрокаТовары;  
	ТабДокумент.Вывести(ОбластьСтроки);
	
	ТаблицаЧеков = ПолучитьДанныеЧекаНаПечать(ПромОбъект);  
	
	Если ТаблицаЧеков.Количество() = 0 Тогда
		
		ОбластьЧек = Макет.ПолучитьОбласть("ОбластьЧек"); 
		ОбластьЧек.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
		ТабДокумент.Вывести(ОбластьЧек);
		
	Иначе     
		
		ОбластьЧекиШапка = Макет.ПолучитьОбласть("ОбластьЧекиШапка");
		ТабДокумент.Вывести(ОбластьЧекиШапка);
		
		Для Каждого СтрокаЧек Из ТаблицаЧеков Цикл
			
			ОбластьЧеки = Макет.ПолучитьОбласть("ОбластьЧеки");
			ОбластьЧеки.Параметры.Заполнить(СтрокаЧек);
			ОбластьЧеки.Параметры.ТипОснования = "кассовый чек №";
			ТабДокумент.Вывести(ОбластьЧеки);
			
		КонецЦикла;
		
	КонецЕсли;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
	ТабДокумент.Вывести(ОбластьПодвал); 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;

КонецФункции
