
Функция ПолучитьТекстЗапросаПоКодамМаркировки() Экспорт	
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРасхожденияКМ.Номенклатура,
	|	ТаблицаРасхожденияКМ.КодМаркировки,
	|	ТаблицаРасхожденияКМ.Недостача,
	|	ТаблицаРасхожденияКМ.Излишек
	|ПОМЕСТИТЬ ВТ_РасхожденияКМ
	|ИЗ
	|	&ТаблицаРасхожденияКМ КАК ТаблицаРасхожденияКМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.КодМаркировки,
	|	МАКСИМУМ(ВложенныйЗапрос.Передано) КАК Передано,
	|	МАКСИМУМ(ВложенныйЗапрос.Недостача) КАК Недостача,
	|	МАКСИМУМ(ВложенныйЗапрос.Излишек) КАК Излишек
	|ПОМЕСТИТЬ ВТ_Сводная
	|ИЗ
	|	(ВЫБРАТЬ
	|		РеализацияТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура КАК Номенклатура,
	|		РеализацияТоваровУслугКодыМаркировки.КодМаркировки КАК КодМаркировки,
	|		ИСТИНА КАК Передано,
	|		ЛОЖЬ КАК Недостача,
	|		ЛОЖЬ КАК Излишек
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.КодыМаркировки КАК РеализацияТоваровУслугКодыМаркировки
	|	ГДЕ
	|		РеализацияТоваровУслугКодыМаркировки.Ссылка = &ДокументОснование
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_РасхожденияКМ.Номенклатура,
	|		ВТ_РасхожденияКМ.КодМаркировки,
	|		ВЫБОР
	|			КОГДА ВТ_РасхожденияКМ.Недостача
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ,
	|		ВТ_РасхожденияКМ.Недостача,
	|		ВТ_РасхожденияКМ.Излишек
	|	ИЗ
	|		ВТ_РасхожденияКМ КАК ВТ_РасхожденияКМ) КАК ВложенныйЗапрос
	|ГДЕ
	|	(&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ ВложенныйЗапрос.Номенклатура = &Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.КодМаркировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сводная.Номенклатура КАК Номенклатура,
	|	ВТ_Сводная.КодМаркировки КАК КодМаркировки,
	|	ВТ_Сводная.Передано,
	|	ВТ_Сводная.Недостача КАК Недостача,
	|	ВТ_Сводная.Излишек КАК Излишек,
	|	ВЫБОР
	|		КОГДА ВТ_Сводная.Передано
	|				И НЕ ВТ_Сводная.Недостача
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принято,
	|	ВЫБОР
	|		КОГДА ВТ_Сводная.Недостача
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА ВТ_Сводная.Излишек
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИзлишек,
	|	ВЫБОР
	|		КОГДА ВТ_Сводная.Передано
	|				И НЕ ВТ_Сводная.Недостача
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПринято,
	|	ВЫБОР
	|		КОГДА ВТ_Сводная.Передано
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПередано
	|ИЗ
	|	ВТ_Сводная КАК ВТ_Сводная
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Принято УБЫВ,
	|	Недостача УБЫВ,
	|	Излишек УБЫВ,
	|	КодМаркировки
	|АВТОУПОРЯДОЧИВАНИЕ";	
	
	Возврат ТекстЗапроса;

КонецФункции