Процедура КорректировкаРезервов() Экспорт
	
	//+Сёмин Р. 13.11.2025 #UT10-5422
	//выделил в отдельную функцию ПолучитьДанныеПоРезервамЗаказовПокупателей ниже 
	//ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"ВЫБРАТЬ
	//	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	МАКСИМУМ(ВЫБОР
	//	|			КОГДА ЗаказыПокупателейОстатки.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя
	//	|				ТОГДА ВЫБОР
	//	|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|							ТОГДА ВЫБОР
	//	|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
	//	|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|								КОНЕЦ
	//	|						ИНАЧЕ ВЫБОР
	//	|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
	//	|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
	//	|							КОНЕЦ
	//	|					КОНЕЦ
	//	|			КОГДА &ЧислоДней <> 0
	//	|				ТОГДА ВЫБОР
	//	|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	//	|							ТОГДА ВЫБОР
	//	|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
	//	|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, &ЧислоДней)
	//	|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, &ЧислоДней)
	//	|								КОНЕЦ
	//	|						ИНАЧЕ ВЫБОР
	//	|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
	//	|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, &ЧислоДней)
	//	|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, &ЧислоДней)
	//	|							КОНЕЦ
	//	|					КОНЕЦ
	//	|			ИНАЧЕ &Дата
	//	|		КОНЕЦ) КАК ОкончаниеРезерва,
	//	|	МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)) КАК ДатаРезерва
	//	|ПОМЕСТИТЬ ТаблицаРезервов
	//	|ИЗ
	//	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ) КАК ЗаказыПокупателейОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ) КАК ТоварыВСборкеОстатки
	//	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
	//	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , ) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
	//	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва
	//	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура
	//	|ГДЕ
	//	|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
	//	|	И ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
	//	|	И ТоварыВСборкеОстатки.СобраноОстаток ЕСТЬ NULL
	//	|	И ТоварыВСборкеОстатки.КСборкеОстаток ЕСТЬ NULL
	//	|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//	|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата > &ДатаНач
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ЗаказыПокупателейОстатки.ЗаказПокупателя
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТаблицаРезервов.ЗаказПокупателя КАК ЗаказПокупателя,
	//	|	ТаблицаРезервов.ОкончаниеРезерва КАК ОкончаниеРезерва
	//	|ИЗ
	//	|	ТаблицаРезервов КАК ТаблицаРезервов
	//	|ГДЕ
	//	|	ТаблицаРезервов.ОкончаниеРезерва < &Дата
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	ОкончаниеРезерва";
	//
	//Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	//Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата(), -3));
	//Запрос.УстановитьПараметр("ЧислоДней", ЧислоДней);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	
	РезультатПакетаЗапросов = ПолучитьДанныеПоРезервамЗаказовПокупателей();
	РезультатЗапроса = РезультатПакетаЗапросов[1];
	//-Сёмин Р. 13.11.2025 #UT10-5422
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 		
		
		ОбщаяТаблица = Новый ТабличныйДокумент;
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокОбъект = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
			ДокОбъект.Заполнить(Выборка.ЗаказПокупателя);
			ДокОбъект.КорректировкаГМИзСтороннегоФилиала = Выборка.ЗаказПокупателя.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала;
			ДокОбъект.Комментарий = "Создан регламентным заданием по корректировке резервов " + Формат(ТекущаяДата(), "ДЛФ=DT") + "";
			
			Для Каждого Стр Из ДокОбъект.Товары Цикл
				Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ИстекСрокРезервирования; 
			КонецЦикла;
			
			ДокОбъект.Дата = ТекущаяДата();
			
			Если ДокОбъект.Товары.Количество() Тогда
				
				Попытка
					
					ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
				Исключение
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеПоРезервамЗаказовПокупателей(ЗаказПокупателя = Неопределено) Экспорт
	//+Сёмин Р. 12.11.2025 #UT10-5422
	
	ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказыПокупателейОстатки.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя
		|				ТОГДА ВЫБОР
		|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, ЗаказыПокупателейОстатки.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОГДА &ЧислоДней <> 0
		|				ТОГДА ВЫБОР
		|						КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|							ТОГДА ВЫБОР
		|									КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)
		|										ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата, ДЕНЬ, &ЧислоДней)
		|									ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата), ДЕНЬ, &ЧислоДней)
		|								КОНЕЦ
		|						ИНАЧЕ ВЫБОР
		|								КОГДА ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки >= ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки)
		|									ТОГДА ДОБАВИТЬКДАТЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ, &ЧислоДней)
		|								ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.ДатаОтгрузки), ДЕНЬ, &ЧислоДней)
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ &Дата
		|		КОНЕЦ) КАК ОкончаниеРезерва,
		|	МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстаткиИОбороты.Период, ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата)) КАК ДатаРезерва
		|ПОМЕСТИТЬ ТаблицаРезервов
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(, #УсловиеЗаказыПокупателейОстатки) КАК ЗаказыПокупателейОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, #УсловиеТоварыВСборкеОстатки) КАК ТоварыВСборкеОстатки
		|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , #УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
		|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва
		|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура
		|ГДЕ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
		|	И ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток > 0
		|	И ТоварыВСборкеОстатки.СобраноОстаток ЕСТЬ NULL
		|	И ТоварыВСборкеОстатки.КСборкеОстаток ЕСТЬ NULL
		|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
		|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата > &ДатаНач
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезервов.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТаблицаРезервов.ОкончаниеРезерва КАК ОкончаниеРезерва
		|ИЗ
		|	ТаблицаРезервов КАК ТаблицаРезервов
		|ГДЕ
		|	ТаблицаРезервов.ОкончаниеРезерва < &Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОкончаниеРезерва
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаРезервов.ЗаказПокупателя,
		|	ТаблицаРезервов.ОкончаниеРезерва,
		|	ТаблицаРезервов.ДатаРезерва
		|ИЗ
		|	ТаблицаРезервов КАК ТаблицаРезервов";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата(), -3));
	Запрос.УстановитьПараметр("ЧислоДней", ЧислоДней);
	
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗаказыПокупателейОстатки", "ЗаказПокупателя = &ЗаказПокупателя");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВСборкеОстатки", "ЗаказПокупателя = &ЗаказПокупателя");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты", "ДокументРезерва = &ЗаказПокупателя");
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
		
	Иначе
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеЗаказыПокупателейОстатки", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВСборкеОстатки", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#УсловиеТоварыВРезервеНаСкладахОстаткиИОбороты", "");
		
	КонецЕсли;
	
	РезультатПакетаЗапросов = Запрос.ВыполнитьПакет();
	
	Возврат РезультатПакетаЗапросов;
	
	//-Сёмин Р. 12.11.2025 #UT10-5422
КонецФункции

Функция ПолучитьДанныеПоРезервуЗаказаНеИзРегистра(ЗаказПокупателя) Экспорт
	
	//+Сёмин Р.И. 06.03.2026 #UT10-5726
	ЧислоДней = Константы.ЧислоДнейРезерва.Получить();
	ДатаРезерва = НачалоДня(ТекущаяДата());
	
	Если ЗаказПокупателя.ДоговорКонтрагента.ДержатьРезервБезОплатыОграниченноеВремя Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗаказПокупателя.ДатаОтгрузки) Тогда
			ДатаРезерва = ЗаказПокупателя.Дата + ЗаказПокупателя.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты * 60 * 60 * 24;
		Иначе
			ДатаРезерва = ЗаказПокупателя.ДатаОтгрузки + ЗаказПокупателя.ДоговорКонтрагента.ЧислоДнейРезерваБезОплаты * 60 * 60 * 24;
		КонецЕсли;
		
	ИначеЕсли ЧислоДней <> 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗаказПокупателя.ДатаОтгрузки) Тогда
			ДатаРезерва = ЗаказПокупателя.Дата + ЧислоДней * 60 * 60 * 24;
		Иначе
			ДатаРезерва = ЗаказПокупателя.ДатаОтгрузки + ЧислоДней * 60 * 60 * 24;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДатаРезерва;
	//-Сёмин Р.И. 06.03.2026 #UT10-5726
	
КонецФункции
