
Функция TransmitOrderFromPortal(Header,Lines)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис TransmitOrderFromPortal_2020", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. TransmitOrderFromPortal");
	ЗаписьЖурналаРегистрации("Web-сервис TransmitOrderFromPortal_2020", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. TransmitOrderFromPortal: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Header) + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Lines)); 

	OrderID = Число(Header.OrderID);	
	
	Если ЗначениеЗаполнено(OrderID) Тогда
		
		ЕстьЗаказСOrderID = Документы.ЗаказПокупателя.НайтиПоРеквизиту("IDЗаказаПортал", OrderID);
		
		Если НЕ ЕстьЗаказСOrderID.Пустая() Тогда
			
			//Создаем объект для возврата
			ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitOrderFromPortal.ПространствоИмен, "OutForPortal");
			РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
			
			//Создаем строку ответа
			ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitOrderFromPortal.ПространствоИмен, "OutLine");
			СтрокаВозврата			    = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			
			СтрокаВозврата.OrderNumber  = ЕстьЗаказСOrderID.Номер;	
			СтрокаВозврата.Status       = "0";
			РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис TransmitOrderFromPortal_2020", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. TransmitOrderFromPortal " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат РезультатДляВозвратаПорталу; 
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Результат = МСКWEB.ПолучитьЗаказыСПортала(Header,Lines); 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис TransmitOrderFromPortal_2020", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. TransmitOrderFromPortal " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

