Процедура ОбработкаДокументов_ЗаявкаНаВозврат() Экспорт 
	
	НачПериода = НачалоДня(ТекущаяДата() - 2678400);
	КонПериода = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозврат.Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаявкиНа
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаВозврат.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ЗаявкаНаВозврат.Статус = &НаСогласования
	|	И ЗаявкаНаВозврат.Проведен = ЛОЖЬ
	|	И ЗаявкаНаВозврат.Реализация.Грузополучатель.НеCогласовыватьАвтоматомЗаявкиНаВозврат = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ ВТ_ЗаявкиНаВозвратРекламация
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаявкиНа.Ссылка
	|			ИЗ
	|				ВТ_ЗаявкиНа КАК ВТ_ЗаявкиНа)
	|	И ЗаявкаНаВозвратТовары.Тип <> &ТипВозврат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ЗаявкиНа.Ссылка
	|			ИЗ
	|				ВТ_ЗаявкиНа КАК ВТ_ЗаявкиНа)
	|	И НЕ ЗаявкаНаВозвратТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ЗаявкиНаВозвратРекламация.Ссылка
	|				ИЗ
	|					ВТ_ЗаявкиНаВозвратРекламация КАК ВТ_ЗаявкиНаВозвратРекламация)
	|	И ЗаявкаНаВозвратТовары.Тип = &ТипВозврат";
	
	Запрос.УстановитьПараметр("Дата1", НачПериода);
	Запрос.УстановитьПараметр("Дата2", КонПериода);
	Запрос.УстановитьПараметр("НаСогласования", "На согласовании");
	Запрос.УстановитьПараметр("ТипВозврат", "Возврат");
		
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  

		Попытка
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			
			Для каждого ТекСтр Из Об.Товары Цикл
				ТекСтр.Статус = "Согласован";
			КонецЦикла; 
			
			Об.Статус = "Согласован";
			Об.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
		Исключение
			ЗаписьЖурналаРегистрации("Регламентное :Изменить реквизит в документе ""Задание на возврат""", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;	

КонецПроцедуры
