
Процедура ПриКопировании(ОбъектКопирования)
	
	АРМКладовщика = Ложь;
	РегламентноеЗадание = Ложь;
	ДатаВыполнения = Дата(1, 1, 1);
	
	ДокумПеремФактМеньшеПлана = Документы.ПеремещениеТовараПоЯчейкам.ПустаяСсылка();
	ДокумПеремФактБольшеПлана = Документы.ПеремещениеТовараПоЯчейкам.ПустаяСсылка();
	ДокументРазмещенияПоЯчейкам = Документы.РазмещениеПоЯчейкам.ПустаяСсылка();
	ДокумПеремФактБольшеПланаРасхожНомен = Документы.ПеремещениеТовараПоЯчейкам.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Инвентаризация
	Движения.Инвентаризация.Записывать = Истина;
	Движения.Инвентаризация.Очистить();
	
	Для Каждого ТекСтрокаИнвентаризируемыеЯчейки Из ИнвентаризируемыеЯчейки Цикл
		
		Движение = Движения.Инвентаризация.Добавить();
		Движение.ДатаСоздания = Дата;
		Движение.ДатаЗавершения = ДатаВыполнения;
		Движение.РегламентноеЗадание = РегламентноеЗадание;
		Движение.Ячейка = ТекСтрокаИнвентаризируемыеЯчейки.ЯчейкаДляИнвентаризации;
		
	КонецЦикла;

КонецПроцедуры


