
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция проверяет соответствие переданного имени той конфигурации, в которой работает подсистема уведомлений
//
// Параметры
//    ИмяДляПроверки - Строка - условное сокращение конфигурации (возможные значения: "УПП", "УТ10", "УП", "УТ11")
//
// Возвращаемое значение
//    Истина, если проверка успешна, Ложь в противном случае
//
Функция ЭтоКонфигурация(ИмяДляПроверки = Неопределено) Экспорт
	
	ИмяКонфигурации = Метаданные.КраткаяИнформация;
	Если ИмяДляПроверки = "УПП" Тогда
		Если Найти(ИмяКонфигурации, "Управление производственным предприятием") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "КА1" Тогда
		Если Найти(ИмяКонфигурации, "Комплексная автоматизация, редакция 1") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "УТ10" Тогда
		Если Найти(ИмяКонфигурации, "Управление торговлей")
			И Найти(ИмяКонфигурации, "10") Тогда
			Возврат Истина;
		ИначеЕсли Найти(ИмяКонфигурации, "Управление торговым предприятием для Украины") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "УП" Тогда
		Если Найти(ИмяКонфигурации, "Управление предприятием") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "КА2" Тогда
		Если Найти(ИмяКонфигурации, "Комплексная автоматизация 2") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "УТ11" Тогда
		Если Найти(ИмяКонфигурации, "Управление торговлей")
			И Найти(ИмяКонфигурации, "11") Тогда
			Возврат Истина;
		ИначеЕсли Найти(ИмяКонфигурации, "Управление торговлей для Украины")
			И Найти(ИмяКонфигурации, "3") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "УТ11CRM" Тогда
		Если Найти(ИмяКонфигурации, "Управление торговлей и взаимоотношениями с клиентами (CRM)")
			И Найти(ИмяКонфигурации, "2") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "Розница" Тогда
		Если Найти(ИмяКонфигурации, "Розница")
			И Найти(ИмяКонфигурации, "2") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = "ЗУП" Тогда
		Если Найти(ИмяКонфигурации, "Зарплата и управление персоналом")
			И Найти(ИмяКонфигурации, "3") Тогда
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли ИмяДляПроверки = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Найти(ИмяКонфигурации, ИмяДляПроверки);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Определяет версию подсистемы УТ (или другую конфигурацию)
//
// Возвращаемое значение - Строка - Одно из значений:
//    10 - УТ10.3
//    11 - УТ11
//    "" - неизвестная конфигурация
//
Функция ВерсияУТ() Экспорт
	
	Если ЭтоКонфигурация("УПП") Или ЭтоКонфигурация("УТ10") Или ЭтоКонфигурация("КА1") Тогда
		ВерсияУТ = "10";
	ИначеЕсли ЭтоКонфигурация("УП") ИЛИ ЭтоКонфигурация("УТ11") Или ЭтоКонфигурация("КА2") Или ЭтоКонфигурация("УТ11CRM") Тогда
		ВерсияУТ = "11";
	ИначеЕсли ЭтоКонфигурация("Бухгалтерия") Тогда
		Если ЭтоКонфигурация("1.6") Тогда
			ВерсияУТ = "Бухгалтерия_1.6";
		ИначеЕсли ЭтоКонфигурация("3.0") Тогда
			ВерсияУТ = "Бухгалтерия_3.0";
		КонецЕсли;
	ИначеЕсли ЭтоКонфигурация("Розница") Тогда
		ВерсияУТ = "Розница";
	ИначеЕсли ЭтоКонфигурация("ЗУП") Тогда
		ВерсияУТ = "ЗУП";
	Иначе
		ВерсияУТ = "";
	КонецЕсли;
	
	Возврат ВерсияУТ;
	
КонецФункции

// Функция проверяет, запущена ли платформа 8.3. Дополнительно проверяется, включен ли режим совместимости
//
// Параметры
//    ПроверятьРежимСовместимости - Булево - дополнительная проверка на работу платформы в режиме совместимости
//
Функция Платформа83(ПроверятьРежимСовместимости = Ложь) Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат (Лев(СистемнаяИнформация.ВерсияПриложения, 3) = "8.3"
		И (Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.НеИспользовать
			Или Не ПроверятьРежимСовместимости));
	
КонецФункции

// Осуществляет проверку настроек для отправки почты, СМС, напоминаний
// Записывает результаты проверки в переданные параметры
//
// Параметры:
//    ПочтаНастроена - Булево - признак настройки учетной записи
//    СМСДоступны - Булево - используется стандартная подсистема отправки смс
//    СМСНастроены - Булево - признак настройки СМС
//    НапоминанияДоступны - Булево - есть возможность создания напоминаний
//    РассылкиНастроены - Булево - признак настройки интеграции с сервисом рассылок
//
Процедура ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены = Ложь) Экспорт
	
	ВерсияУТ = ВерсияУТ();
	
	НастройкиУведомлений = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки();
	
	// Проверка настройки почты
	ПочтаНастроена = Ложь;
	
	УчетнаяЗаписьУказываетсяВручную = Истина;
	ИмяСправочника = "УчетныеЗаписиЭлектроннойПочты";
	МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
	Если МетаданныеСправочника <> Неопределено
		И Не Найти(МетаданныеСправочника.Представление(), НСтр("ru = 'не используется'")) Тогда
		УчетнаяЗаписьУказываетсяВручную = Ложь;
	КонецЕсли;
	
	Если УчетнаяЗаписьУказываетсяВручную Тогда
		Если НастройкиУведомлений.Свойство("НастройкиУчетнойЗаписи") Тогда
			ПочтаНастроена = ЗначениеЗаполнено(НастройкиУведомлений.НастройкиУчетнойЗаписи.Пользователь);
		КонецЕсли;
	Иначе
		Если НастройкиУведомлений.Свойство("СистемнаяУчетнаяЗапись") Тогда
			Если МетаданныеСправочника <> Неопределено
				И ТипЗнч(НастройкиУведомлений.СистемнаяУчетнаяЗапись) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
				ПочтаНастроена = ЗначениеЗаполнено(НастройкиУведомлений.СистемнаяУчетнаяЗапись);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Проверка доступности и настройки смс
	СМСДоступны = Ложь;
	СМСНастроены = Ложь;
	
	ПодсистемаБСП = Метаданные.Подсистемы.Найти("СтандартныеПодсистемы");
	Если ПодсистемаБСП <> Неопределено Тогда
		СМСДоступны = (ПодсистемаБСП.Подсистемы.Найти("ОтправкаSMS") <> Неопределено);
	КонецЕсли;
	
	Если СМСДоступны Тогда
		Попытка
			Выполнить("СМСНастроены = ОтправкаSMS.НастройкаОтправкиSMSВыполнена();");
		Исключение
		КонецПопытки;
	Иначе
		СМСНастроены = НастройкиУведомлений.Свойство("НастройкиСМС")
			И НастройкиУведомлений.НастройкиСМС.Свойство("ПровайдерСМС") И ЗначениеЗаполнено(НастройкиУведомлений.НастройкиСМС.ПровайдерСМС)
			И НастройкиУведомлений.НастройкиСМС.Свойство("ЛогинСМС") И ЗначениеЗаполнено(НастройкиУведомлений.НастройкиСМС.ЛогинСМС)
			И НастройкиУведомлений.НастройкиСМС.Свойство("ПарольСМС") И ЗначениеЗаполнено(НастройкиУведомлений.НастройкиСМС.ПарольСМС);
	КонецЕсли;
	
	// Проверка доступности напоминаний
	НапоминанияДоступны = Ложь;
	
	Если ВерсияУТ = "11" Или ВерсияУТ = "10" Или ВерсияУТ = "Розница" Или ВерсияУТ = "ЗУП" Тогда
		НапоминанияДоступны = Истина;
	// поищем БСП
	ИначеЕсли Метаданные.РегистрыСведений.Найти("НапоминанияПользователя") <> Неопределено Тогда
		НапоминанияДоступны = Истина;
	// остаются задачи
	ИначеЕсли Метаданные.Задачи.Найти("ЗадачиПользователя") <> Неопределено Тогда
		НапоминанияДоступны = Истина;
	КонецЕсли;
	
	// Проверка настройки рассылок
	РассылкиНастроены = НастройкиУведомлений.Свойство("ПодключенСервисПочтовойРассылки")
		И НастройкиУведомлений.ПодключенСервисПочтовойРассылки;
	
КонецПроцедуры

// Контактная информация

// Возвращает адрес эл. почты адресата, выбирая его из контактной информации
//
// Параметры:
//    Адресат - СправочникСсылка - Ссылка на пользователя, или контрагента
//
// Возвращаемое значение - Строка с адресом эл. почты, Неопределено
//
Функция АдресЭлПочты(Адресат) Экспорт
	
	ВерсияПодсистемыУТ = ВерсияУТ();
	
	Если ВерсияПодсистемыУТ = "10" Тогда
		Адрес = "";
		Попытка
			Выполнить("Адрес = УправлениеЭлектроннойПочтой.ОпределитьАдресПолучателя(Адресат)");
		Исключение
			Адрес = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить адрес эл. почты по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		
	ИначеЕсли ВерсияПодсистемыУТ = "11" Или ВерсияПодсистемыУТ = "Бухгалтерия_3.0" Или ВерсияПодсистемыУТ = "ЗУП" Тогда
		МассивСтруктурАдресов = "";
		Попытка
			Выполнить("МассивСтруктурАдресов = ВзаимодействияВызовСервера.ПолучитьАдресаЭлектроннойПочтыКонтакта(Адресат)");
		Исключение
			МассивСтруктурАдресов = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить адрес эл. почты по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		Если ТипЗнч(МассивСтруктурАдресов) = Тип("Массив") И МассивСтруктурАдресов.Количество() > 0 Тогда
			Адрес = МассивСтруктурАдресов[0].АдресЭП;
		Иначе
			Адрес = "";
		КонецЕсли;
		
	ИначеЕсли ВерсияПодсистемыУТ = "Розница" Тогда
		Адрес = "";
		Попытка
			ТипКонтактнойИнформации = Неопределено;
			Выполнить("ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты");
			
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Адресат);
			
			КонтактнаяИнформацияОбъекта = Неопределено;
			Выполнить("КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипКонтактнойИнформации)");
			
			Если КонтактнаяИнформацияОбъекта <> Неопределено И КонтактнаяИнформацияОбъекта.Количество() Тогда
				Адрес = КонтактнаяИнформацияОбъекта[0].Представление;
			КонецЕсли;
			
		Исключение
			Адрес = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить адрес эл. почты по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		
	ИначеЕсли ВерсияПодсистемыУТ = "Бухгалтерия_1.6" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Представление,
		|	КонтактнаяИнформация.ЗначениеПоУмолчанию
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|";
		
		Попытка
		
			Запрос.УстановитьПараметр("Объект", Адресат);
			
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			
			Адрес = "";
			ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
			Если ТаблицаЗапроса.Количество() > 0 Тогда
				СтрокаПоУмолчанию = ТаблицаЗапроса.Найти(Истина, "ЗначениеПоУмолчанию");
				Если СтрокаПоУмолчанию <> Неопределено Тогда
					Адрес = СтрокаПоУмолчанию.Представление;
				Иначе
					Адрес = ТаблицаЗапроса[0].Представление;
				КонецЕсли;
			КонецЕсли;
			
		Исключение
			Адрес = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить адрес эл. почты по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		
	Иначе
		Адрес = "";
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(Адрес), Неопределено, Адрес);
	
КонецФункции

// Возвращает телефонный номер адресата, выбирая его из контактной информации
//
// Параметры:
//    Адресат - СправочникСсылка - Ссылка на пользователя, или контрагента
//
// Возвращаемое значение - Строка с номером телефона, Неопределено
//
Функция ПолучитьНомерТелефона(Адресат) Экспорт
	
	ВерсияПодсистемыУТ = ПЛ_УведомленияОСОбытиях.ВерсияУТ();
	
	Если ВерсияПодсистемыУТ = "10" Тогда
		Адрес = "";
		Попытка
			Адрес = ПолучитьТелефонИзКонтактнойИнформацииУТ10(Адресат);
		Исключение
			Адрес = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить номер телефона по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		
	ИначеЕсли ВерсияПодсистемыУТ = "11" Или ВерсияПодсистемыУТ = "ЗУП" Тогда
		СтрокаКИ = "";
		ПредставлениеАдресата = "";
		Попытка
			Выполнить("ВзаимодействияВызовСервера.ПолучитьПредставлениеИВсюКонтактнуюИнформациюКонтакта(
				|Адресат,
				|ПредставлениеАдресата,
				|СтрокаКИ,
				|Перечисления.ТипыКонтактнойИнформации.Телефон)");
		Исключение
			СтрокаКИ = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить номер телефона по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		Если ЗначениеЗаполнено(СтрокаКИ) Тогда
			Адрес = СтрокаКИ;
		Иначе
			Адрес = "";
		КонецЕсли;
		
	ИначеЕсли ВерсияПодсистемыУТ = "Розница" Тогда
		Адрес = "";
		Попытка
			ТипКонтактнойИнформации = Неопределено;
			Выполнить("ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон");
			
			МассивОбъектов = Новый Массив;
			МассивОбъектов.Добавить(Адресат);
			
			КонтактнаяИнформацияОбъекта = Неопределено;
			Выполнить("КонтактнаяИнформацияОбъекта = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов, ТипКонтактнойИнформации)");
			
			Если КонтактнаяИнформацияОбъекта <> Неопределено И КонтактнаяИнформацияОбъекта.Количество() Тогда
				Адрес = КонтактнаяИнформацияОбъекта[0].Представление;
			КонецЕсли;
			
		Исключение
			Адрес = "";
			ТекстСообщения = НСтр("ru = 'Не удалось определить номер телефона по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,
				Адресат.Метаданные(),
				Адресат,
				ТекстСообщения);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(Адрес), Неопределено, Адрес);
	
КонецФункции

// Функция находит значение телефона в контакной информации
//
// Параметры:
//  Объект - СправочникСсылка, объект контактной информации
//
// Возвращаемое значение
//  Строка - представление найденного телефона
//
Функция ПолучитьТелефонИзКонтактнойИнформацииУТ10(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|";
	
	Запрос.УстановитьПараметр("Объект", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;

КонецФункции

// Возвращает таблицу, содержащую контактную информацию нескольких объектов
//
// Параметры:
//    Адресаты - Массив - Владельцы контактной информации
//    ТипКИ - Строка - Тип контактной информации: "АдресЭлектроннойПочты" или "НомерТелефона"
//
// Возвращаемое значение:
//  ТаблицаЗначений -  таблица с контактной информацией объектов, содержащая колонки:
//    * Ссылки           - Ссылка - Владелец контактной информации
//    * Вид              - СправочникСсылка.ВидыКонтактнойИнформации - Вид контактной информации
//    * Тип              - ПеречислениеСсылка.ТипыКонтактнойИнформации - Тип контактной информации
//    * Представление    - Строка - Представление контактной информации
//
Функция КонтактнаяИнформация(Адресаты, ТипКИ = Неопределено, ВидыКИ = Неопределено) Экспорт
	
	ВерсияПодсистемыУТ = ВерсияУТ();
	ТаблицаКонтактнойИнформации = Неопределено;
	
	Если ВерсияПодсистемыУТ = "11" Или ВерсияПодсистемыУТ = "Бухгалтерия_3.0" Или ВерсияПодсистемыУТ = "Розница" Или ВерсияПодсистемыУТ = "ЗУП" Тогда
		
		Попытка
			ТипыКИ = Новый Массив;
			МодульКонтактнаяИнформация = ОбщийМодуль("УправлениеКонтактнойИнформацией");
			Если МодульКонтактнаяИнформация <> Неопределено Тогда
				Если ТипКИ = "АдресЭлектроннойПочты" Тогда
					Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);");
				ИначеЕсли ТипКИ = "НомерТелефона" Тогда
					Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);");
				Иначе
					Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);");
					Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);");
				КонецЕсли;
				ТаблицаКонтактнойИнформации = МодульКонтактнаяИнформация.КонтактнаяИнформацияОбъектов(Адресаты, ТипыКИ, ВидыКИ);
			КонецЕсли;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось получить контактную информацию адресатов по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
		КонецПопытки;
		
	ИначеЕсли ВерсияПодсистемыУТ = "10" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Объект         КАК Объект,
		|	КонтактнаяИнформация.Вид            КАК Вид,
		|	КонтактнаяИнформация.Тип            КАК Тип,
		|	КонтактнаяИнформация.Представление  КАК Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В (&Адресаты)
		|	И КонтактнаяИнформация.Тип В (&ТипыКИ)
		|";
		
		ТипыКИ = Новый Массив;
		Если ТипКИ = "АдресЭлектроннойПочты" Тогда
			Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);");
		ИначеЕсли ТипКИ = "НомерТелефона" Тогда
			Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);");
		Иначе
			Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);");
			Выполнить("ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Адресаты", Адресаты);
		Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
		
		ТаблицаКонтактнойИнформации = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат ТаблицаКонтактнойИнформации;
	
КонецФункции

// Компоновка

// Выполняет запрос по переданной схеме компоновки. Условие считается выполненным, если результат запроса не пустой
// В качестве параметра в схему компоновки передается значение источника события
//
// Параметры
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип значения источника события
//    Источник - ДокументСсылка, СправочникСсылка, РегистрСведенийНаборЗаписей - значение источника события
//    АдресСхемы - Строка - адрес во временном хранилище для схемы компоновки данных, содержащей запрос условия
//    АдресНастроек - Строка - адрес во временном хранилище для настроек схемы компоновки данных, содержащей запрос условия
//
// Возвращаемое значение
//    Истина, если условие пройдено, Ложь, если не пройдено
//
Функция ПроверитьУсловие(ТипИсточника, Источник, АдресСхемы, АдресНастроек) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	КомпоновщикНастроекДляОтборов = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДляОтборов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроекДляОтборов.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	// Отборы набора записей регистра
	Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Если ТипЗнч(Источник) = Тип("Структура") Тогда
			Для Каждого Элемент ИЗ Источник Цикл
				ЭлементОтбора = КомпоновщикНастроекДляОтборов.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
				ЭлементОтбора.Использование = Истина;
			КонецЦикла;
		Иначе
			Для Каждого Элемент ИЗ Источник.Отбор Цикл
				ЭлементОтбора = КомпоновщикНастроекДляОтборов.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Имя);
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
				ЭлементОтбора.Использование = Элемент.Использование;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	КомпоновщикНастроекДляОтборов.Восстановить();
	
	// Получим запрос из макета компоновки
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекДляОтборов.ПолучитьНастройки());
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных[0].Запрос);
	
	// Установим параметры запроса
	ОписаниеПараметровЗапроса = Запрос.НайтиПараметры();
	Для Каждого ОписаниеПараметраЗапроса ИЗ ОписаниеПараметровЗапроса Цикл
		Если ОписаниеПараметраЗапроса.Имя = "Источник" Тогда
			Запрос.УстановитьПараметр("Источник", Источник);
		Иначе
			Запрос.УстановитьПараметр(ОписаниеПараметраЗапроса.Имя, МакетКомпоновкиДанных.ЗначенияПараметров[ОписаниеПараметраЗапроса.Имя].Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Заполняет тексты шаблонов значениями, полученными в результате компоновки данных
// В качестве параметра в схему компоновки передается значение источника события
//
// Параметры
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип значения источника события
//    Источник - ДокументСсылка, СправочникСсылка, РегистрСведенийНаборЗаписей - значение источника события
//    АдресСхемы - Строка - адрес во временном хранилище для схемы компоновки данных, содержащей данные для заполнения шаблонов
//    АдресНастроек - Строка - адрес во временном хранилище для настроек схемы компоновки данных, содержащей данные для заполнения шаблонов
//    Шаблон1 - Строка - шаблон темы сообщения, в который будут подставлены данные компоновки
//    Шаблон2 - Строка - шаблон текста сообщения, в который будут подставлены данные компоновки
//
Процедура ТекстыПоШаблонам(
	ТипИсточника, Источник,
	АдресСхемы, АдресНастроек,
	ТаблицыМакета, ОбычныйТекст,
	Шаблон1 = "", Шаблон2 = "") Экспорт
	
	ТаблицыШаблонов = ТаблицыМакета.Скопировать();
	Для каждого СтрокаТаблицыШаблонов Из ТаблицыШаблонов Цикл
		СтрокаТаблицыШаблонов.Имя = СтрЗаменить(СтрокаТаблицыШаблонов.Имя, " ", "");
	КонецЦикла;
	
	Шаблон = Шаблон1 + " " + Шаблон2;
	СоответствиеРеквизитов = РеквизитыШаблонаСообщения(Шаблон);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	// Добавим поля выбора
	ВыбранныеПоляКД = КомпоновщикНастроек.Настройки.Выбор;
	Для каждого Поле Из СоответствиеРеквизитов Цикл
		ПолеКД = Новый ПолеКомпоновкиДанных(Поле.Значение);
		ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКД.Поле = ПолеКД;
	КонецЦикла;
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Источник");
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = Источник;
	КонецЕсли;
	
	// Отборы набора записей регистра
	Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Для каждого Элемент из Источник Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
			ЭлементОтбора.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаОбработки = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаОбработки);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	КоличествоСтрок = ТаблицаОбработки.Количество();
	
	Для Каждого Реквизит Из СоответствиеРеквизитов Цикл
		
		Если Найти(Реквизит.Ключ, "Таблицы") Тогда // это макет
			
			Попытка
				ЗначениеРеквизита = "";
				НазваниеТаблицы = СтрЗаменить(Реквизит.Ключ, "Таблицы", "");
				ТаблицаШаблона = ТаблицыШаблонов.Найти(НазваниеТаблицы, "Имя");
				Если ТаблицаШаблона <> Неопределено Тогда
					ЗначениеРеквизита = ПолучитьТаблицуВВидеТекста(
						ТипИсточника,
						Источник,
						АдресСхемы,
						ТаблицаШаблона.АдресНастроек,
						ОбычныйТекст);
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
		ИначеЕсли КоличествоСтрок Тогда
			
			Попытка
				ЗначениеРеквизита = "";
				Если КоличествоСтрок = 1 Тогда
					
					ЗначениеРеквизита = ТаблицаОбработки[0][Реквизит.Ключ];
					
					Если ТипЗнч(ЗначениеРеквизита) = Тип("Дата") Тогда
						ЗначениеРеквизита = Формат(ЗначениеРеквизита, "ДЛФ=Д");
					Иначе
						ЗначениеРеквизита = Строка(ЗначениеРеквизита);
					КонецЕсли;
					
				Иначе
					ВремТаблица = ТаблицаОбработки.Скопировать(, Реквизит.Ключ);
					ВремТаблица.Свернуть(Реквизит.Ключ);
					Для каждого СтрокаВыборки Из ВремТаблица Цикл
						
						ВремЗначение = СтрокаВыборки[Реквизит.Ключ];
						Если ТипЗнч(ВремЗначение) = Тип("Дата") Тогда
							ВремЗначение = Формат(ВремЗначение, "ДЛФ=Д");
						Иначе
							ВремЗначение = Строка(ВремЗначение);
						КонецЕсли;
						
						ЗначениеРеквизита = ЗначениеРеквизита + ВремЗначение + ", ";
					КонецЦикла;
					ЗначениеРеквизита = Лев(ЗначениеРеквизита, СтрДлина(ЗначениеРеквизита) - 2);
				КонецЕсли;
			Исключение
				Продолжить;
			КонецПопытки;
		КонецЕсли;
		
		Шаблон1 = СтрЗаменить(Шаблон1, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
		Шаблон2 = СтрЗаменить(Шаблон2, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
		
	КонецЦикла;
	
	Шаблон1 = СокрЛП(Шаблон1);
	Шаблон2 = СокрЛП(Шаблон2);
	
КонецПроцедуры

// Дополняет содержащую адресатов таблицу текстами по шаблонам
// Тексты формируются с учетом значений адресатов
//
// Параметры
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип значения источника события
//    Источник - ДокументСсылка, СправочникСсылка, РегистрСведенийНаборЗаписей - значение источника события
//    АдресСхемы - Строка - адрес во временном хранилище для схемы компоновки данных, содержащей данные для заполнения шаблонов
//    АдресНастроек - Строка - адрес во временном хранилище для настроек схемы компоновки данных, содержащей данные для заполнения шаблонов
//    Шаблон1 - Строка - шаблон темы сообщения, в который будут подставлены данные компоновки
//    Шаблон2 - Строка - шаблон текста сообщения, в который будут подставлены данные компоновки
//    ТаблицаАдресатов - ТаблицаЗначений - таблица, содержащая обязательные поля: Адресат - Ссылка, Строка; Тема - Строка, Текст - Строка
//
Процедура ДополнитьТаблицуАдресатовТекстамиПоШаблонам(
	ТипИсточника, Источник,
	АдресСхемы, АдресНастроек,
	ТаблицыМакета, ОбычныйТекст,
	Шаблон1 = "", Шаблон2 = "",
	ТаблицаАдресатов, ПоляВыбораАдресатов) Экспорт
	
	ТаблицыШаблонов = ТаблицыМакета.Скопировать();
	Для каждого СтрокаТаблицыШаблонов Из ТаблицыШаблонов Цикл
		СтрокаТаблицыШаблонов.Имя = СтрЗаменить(СтрокаТаблицыШаблонов.Имя, " ", "");
	КонецЦикла;
	
	Шаблон = Шаблон1 + " " + Шаблон2;
	СоответствиеРеквизитов = РеквизитыШаблонаСообщения(Шаблон);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	Если СхемаКомпоновкиДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	// Добавим поля выбора
	ВыбранныеПоляКД = КомпоновщикНастроек.Настройки.Выбор;
	Для каждого Поле Из СоответствиеРеквизитов Цикл
		ПолеКД = Новый ПолеКомпоновкиДанных(Поле.Значение);
		ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКД.Поле = ПолеКД;
	КонецЦикла;
	
	Для каждого Поле Из ПоляВыбораАдресатов Цикл
		ВыбранноеПолеКД = ВыбранныеПоляКД.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ВыбранноеПолеКД.Поле = Поле;
	КонецЦикла;
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Источник");
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = Источник;
	КонецЕсли;
	
	// Отборы набора записей регистра
	Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Для каждого Элемент из Источник Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
			ЭлементОтбора.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ТаблицаОбработки = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаОбработки);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	СтрокиКУдалению = Новый Массив;
	
	Для Каждого СтрокаТаблицы из ТаблицаАдресатов Цикл
		
		ВремШаблон1 = Шаблон1;
		ВремШаблон2 = Шаблон2;
		
		ВремТаблица = ТаблицаОбработки.Скопировать();
		ТаблицаАдресата = ТаблицаОбработки.СкопироватьКолонки();
		
		// Выделение части результирующей таблицы, относящейся к текущему адресату
		Пока ВремТаблица.Найти(СтрокаТаблицы.Адресат) <> Неопределено Цикл
			ВремСтрока = ВремТаблица.Найти(СтрокаТаблицы.Адресат);
			СтрокаАдресата = ТаблицаАдресата.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаАдресата, ВремСтрока);
			ВремТаблица.Удалить(ВремСтрока);
		КонецЦикла;
		
		КоличествоСтрок = ТаблицаАдресата.Количество();
		Если КоличествоСтрок Тогда
			
			Для Каждого Реквизит Из СоответствиеРеквизитов Цикл
				
				Если Найти(Реквизит.Ключ, "Таблицы") Тогда // это макет
				
					Попытка
						ЗначениеРеквизита = "";
						НазваниеТаблицы = СтрЗаменить(Реквизит.Ключ, "Таблицы", "");
						ТаблицаШаблона = ТаблицыШаблонов.Найти(НазваниеТаблицы, "Имя");
						Если ТаблицаШаблона <> Неопределено Тогда
							ЗначениеРеквизита = ПолучитьТаблицуВВидеТекста(
								ТипИсточника,
								Источник,
								АдресСхемы,
								ТаблицаШаблона.АдресНастроек,
								ОбычныйТекст,
								ПоляВыбораАдресатов,
								СтрокаТаблицы.Адресат);
						КонецЕсли;
						
						ВремШаблон1 = СтрЗаменить(ВремШаблон1, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
						ВремШаблон2 = СтрЗаменить(ВремШаблон2, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
					Исключение
						Продолжить;
					КонецПопытки;
				Иначе
					Попытка
						ЗначениеРеквизита = "";
						Если КоличествоСтрок = 1 Тогда
							
							ЗначениеРеквизита = ТаблицаАдресата[0][Реквизит.Ключ];
							
							Если ТипЗнч(ЗначениеРеквизита) = Тип("Дата") Тогда
								ЗначениеРеквизита = Формат(ЗначениеРеквизита, "ДЛФ=Д");
							Иначе
								ЗначениеРеквизита = Строка(ЗначениеРеквизита);
							КонецЕсли;
							
						Иначе
							ВремТаблица = ТаблицаАдресата.Скопировать(, Реквизит.Ключ);
							ВремТаблица.Свернуть(Реквизит.Ключ);
							Для каждого СтрокаВыборки из ВремТаблица Цикл
								
								ВремЗначение = СтрокаВыборки[Реквизит.Ключ];
								Если ТипЗнч(ВремЗначение) = Тип("Дата") Тогда
									ВремЗначение = Формат(ВремЗначение, "ДЛФ=Д");
								Иначе
									ВремЗначение = Строка(ВремЗначение);
								КонецЕсли;
								
								ЗначениеРеквизита = ЗначениеРеквизита + ВремЗначение + ", ";
							КонецЦикла;
							ЗначениеРеквизита = Лев(ЗначениеРеквизита, СтрДлина(ЗначениеРеквизита) - 2);
						КонецЕсли;
						
						ВремШаблон1 = СтрЗаменить(ВремШаблон1, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
						ВремШаблон2 = СтрЗаменить(ВремШаблон2, "%%" + Реквизит.Значение + "%%", ЗначениеРеквизита);
					Исключение
						Продолжить;
					КонецПопытки;
				КонецЕсли;
			КонецЦикла;
		Иначе
			СтрокиКУдалению.Добавить(СтрокаТаблицы);
		КонецЕсли;
		
		СтрокаТаблицы.Тема = СокрЛП(ВремШаблон1);
		СтрокаТаблицы.Текст = СокрЛП(ВремШаблон2);
		
	КонецЦикла;
	
	Для каждого УдаляемаяСтрока Из СтрокиКУдалению Цикл
		ТаблицаАдресатов.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив адресатов согласно выбранным полям в схеме компоновки данных
// В качестве параметра в схему компоновки передается значение источника события
//
// Параметры
//    ТипИсточника - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - тип значения источника события
//    Источник - ДокументСсылка, СправочникСсылка, РегистрСведенийНаборЗаписей - значение источника события
//    АдресСхемы - Строка - адрес во временном хранилище для схемы компоновки данных, содержащей данные для получения адресатов
//    АдресНастроек - Строка - адрес во временном хранилище для настроек схемы компоновки данных, содержащей данные для получения адресатов
//    ПоляВыбора - Массив - массив полей выбора СКД
//
// Возвращаемое значение
//    Массив, содержащий значения выбранных адресатов
//
Функция ПолучитьСписокАдресатов(ТипИсточника, Источник, АдресСхемы, АдресНастроек, ПоляВыбора = Неопределено) Экспорт
	
	СписокАдресатов = Новый Массив;
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Источник");
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = Источник;
	КонецЕсли;
	
	// Отборы набора записей регистра
	Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Для каждого Элемент из Источник Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение   = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ВидСравнения    = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение  = Элемент.Значение;
			ЭлементОтбора.Использование   = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	Если ТипЗнч(ПоляВыбора) = Тип("Массив") Тогда
		Для каждого ЭлементВыбора Из КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
			ПоляВыбора.Добавить(ЭлементВыбора.Поле);
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.ОтображатьПроцентВывода = Истина;
	ТаблицаОбработки = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаОбработки);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Для каждого Колонка из ТаблицаОбработки.Колонки Цикл
		Для каждого Строка из ТаблицаОбработки Цикл
			СписокАдресатов.Добавить(Строка[Колонка.Имя]);
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокАдресатов;
	
КонецФункции

// Компоновка служебные

// Формирует и возвращает схему компоновки данных на основании текста запроса
//
// Параметры:
//  ТекстЗапроса - текст запроса для источника данных схемы компоновки
//
// Возвращаемое значение:
//  Схема компоновки данных
//
Функция СхемаКомпоновкиДанныхДляЗапроса(ТекстЗапроса) Экспорт
	
	СхемаКомпоновки = Новый СхемаКомпоновкиДанных();
	
	Источник = СхемаКомпоновки.ИсточникиДанных.Добавить();
	Источник.Имя = "Источник1";
	Источник.СтрокаСоединения = "";
	Источник.ТипИсточникаДанных = "local";
	
	НаборДанных = СхемаКомпоновки.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Запрос = ТекстЗапроса;
	НаборДанных.Имя = "НаборДанных";
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	НаборДанных.ИсточникДанных = "Источник1";
	
	// Добавим группировку
	Настройки = СхемаКомпоновки.НастройкиПоУмолчанию;
	Группировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	Поле = Группировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	
	Возврат СхемаКомпоновки;
	
КонецФункции

// Восстанавливает схему компоновки данных из адреса источника, копирует ее и помещает по адресу приемнику
//
// Параметры
//    АдресПриемник - Строка - адрес во временном хранилище, по которому располагается исходная схема компоновки
//    АдресИсточник - Строка - адрес во временном хранилище, по которому будет располагаться копия схемы компоновки
//
Процедура СкопироватьСхемуКомпоновкиДанных(АдресПриемник, АдресИсточник) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресИсточник);
	
	Если ТипЗнч(СхемаКомпоновкиДанных) = Тип("СхемаКомпоновкиДанных") Тогда
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(СхемаКомпоновкиДанных));
	Иначе
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресПриемник) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресПриемник);
	Иначе
		АдресПриемник = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Инициализирует компоновщик настроек схемой компоновки и загружает в него настройки компоновки
//
// Параметры
//    КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - инициализируемый компоновщик настроек
//    АдресСхемыКомпоновкиДанных - Строка - адрес во временном хранилище, по которому расположена схема компоновки данных
//    АдресНастроекКомпоновкиДанных - Строка - адрес во временном хранилище, по которому расположены настройки компоновки данных
//
Процедура ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных = Неопределено) Экспорт
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	Если ЗначениеЗаполнено(АдресНастроекКомпоновкиДанных) Тогда
		НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиДанных);
	КонецЕсли;
	
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Исключение
	КонецПопытки;
	
	Если ЗначениеЗаполнено(АдресНастроекКомпоновкиДанных)
		И НастройкиКомпоновкиДанных <> Неопределено Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры

// Помещает настройки, заданные в компоновщике настроек, в настройки по умолчанию схемы компоновки данных
//
// Параметры
//    КомпоновщикНастроек - КомпоновщикНастроекКомпоновкиДанных - компоновщик настроек, настройки которого будут помещены в схему компоновки
//    АдресСхемыКомпоновкиДанных - Строка - адрес во временном хранилище, по которому расположена схема компоновки данных
//
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных) Экспорт
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	ОчиститьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	СкопироватьНастройкиКомпоновкиДанных(СхемаКомпоновкиДанных.НастройкиПоУмолчанию, КомпоновщикНастроек.ПолучитьНастройки());
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

// Пытается добавить текущего пользователя в качестве вычисляемого поля
//
// Параметры
//    СхемаКомпоновки - СхемаКомпоновкиДанных - модифицируемая СКД
//
Процедура ДобавитьВКомпоновкуПолеТекущийПользователь(СхемаКомпоновки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИмяСправочника = "Пользователи";
	МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
	ЕстьСправочникПользователей = (МетаданныеСправочника <> Неопределено);
	
	Если ЕстьСправочникПользователей Тогда
		
		Пользователь = Неопределено;
		Попытка
			Выполнить("Пользователь = Пользователи.ТекущийПользователь();");
		Исключение
			Пользователь = Неопределено;
		КонецПопытки;
		
		Если Пользователь <> Неопределено Тогда
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(Тип("СправочникСсылка." + ИмяСправочника));
			
			Если СхемаКомпоновки.ВычисляемыеПоля.Найти("ТекущийПользователь") = Неопределено Тогда
				ВычисляемоеПоле = СхемаКомпоновки.ВычисляемыеПоля.Добавить();
				ВычисляемоеПоле.Выражение    = "Пользователи.ТекущийПользователь()";
				ВычисляемоеПоле.ПутьКДанным  = "ТекущийПользователь";
				ВычисляемоеПоле.Заголовок    = НСтр("ru = 'Текущий пользователь'");
				ВычисляемоеПоле.ТипЗначения  = Новый ОписаниеТипов(МассивТипов);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обновление

// Выполняет обновление данных подсистемы уведомлений:
//  - обновляет значение версии в настройках;
//  - выполняет обработчики обновления, предназначенные для перехода на новую версию.
//
// Возвращаемое значение
//    Структура, содержащая:
//     - признак первого запуска подсистемы;
//     - признак изменения версии подсистемы;
//     - структуру, описывающую новую версию, содержащую номер версии вида "1.2.3" и ее вес, вычисляемый как 1 * 10000 + 2 * 100 + 3.
//
Функция ВыполнитьОбновление() Экспорт
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	
	// Обновление конфигурации
	
	// Пока не автоматизировано
	
	// Обновление информационной базы
	ВерсияИБ = НастройкиУведомленийМенеджер.ПолучитьНастройку("Версия");
	Если ВерсияИБ = Неопределено Тогда
		ВерсияИБ = Новый Структура("НомерВерсии, Вес", "0.0.0.0", 0);
	КонецЕсли;
	ВерсияМетаданных = ТекущаяВерсияПодсистемыУведомлений();
	
	ЭтоПервыйЗапуск = (ВерсияИБ.НомерВерсии = "0.0.0.0");
	
	Если ЭтоПервыйЗапуск Тогда
		Справочники.ПЛ_События.ЗаполнитьПреднастроенныеСобытия();
		НастройкиУведомленийМенеджер.ЗаполнитьНастройкиЗначениямиПоУмолчанию();
	КонецЕсли;
	
	ЕстьИзменениеВерсии = Не ЭтоПервыйЗапуск И (ВерсияИБ.НомерВерсии <> ВерсияМетаданных.НомерВерсии);
	
	Если ЕстьИзменениеВерсии Тогда
		
		ОбработчикиОбновления = ТаблицаОбработчиковОбновления();
		ОбработчикиОбновления.Сортировать("Вес");
		
		Попытка
		
			ВесТекущейВерсии = ВерсияИБ.Вес;
			Для каждого Обработчик из ОбработчикиОбновления Цикл
				Если Обработчик.Вес > ВесТекущейВерсии Тогда
				
					Выполнить Обработчик.Процедура + "();";
				
				КонецЕсли;
			КонецЦикла;
		
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Если ЭтоПервыйЗапуск Или ЕстьИзменениеВерсии Тогда
		НастройкиУведомленийМенеджер.СохранитьНастройку("Версия", ВерсияМетаданных);
	КонецЕсли;
	
	РезультатОбновления = Новый Структура;
	РезультатОбновления.Вставить("ЭтоПервыйЗапуск",       ЭтоПервыйЗапуск);
	РезультатОбновления.Вставить("ЕстьИзменениеВерсии",   ЕстьИзменениеВерсии);
	РезультатОбновления.Вставить("Версия",                ВерсияИБ);
	РезультатОбновления.Вставить("ТекущаяВерсия",         ВерсияМетаданных.НомерВерсии);
	
	Возврат РезультатОбновления;
	
КонецФункции

// Возвращает табличный документ, заполненный описанием произошедших изменений в конфигурации в связи с обновлением на новую версию
//
// Параметры
//    ПараметрыОбновления - Структура - структура, содержащая признаки первого запуска, наличия изменения версии, веса версии, с которой произошло обновление
//
// Возвращаемое значение
//    Табличный документ с информацией об изменениях
//
Функция ДокументОписаниеИзменений(ПараметрыОбновления) Экспорт
	
	МакетОписаниеИзменений = Справочники.ПЛ_УведомленияОСобытиях.ПолучитьМакет("ОписаниеИзменений");
	
	ДокументОписаниеИзменений = Новый ТабличныйДокумент();
	
	ВыводитьВсеВерсии = Ложь;
	ПараметрыОбновления.Свойство("ВыводитьВсеВерсии", ВыводитьВсеВерсии);
	
	Если ПараметрыОбновления.ЭтоПервыйЗапуск Тогда
		ВывестиОписаниеИзменений("1.0.0.0", ДокументОписаниеИзменений, МакетОписаниеИзменений);
		Возврат ДокументОписаниеИзменений;
	КонецЕсли;
	
	Если ПараметрыОбновления.ЕстьИзменениеВерсии Тогда
		
		ВесПредыдущейВерсии = ПараметрыОбновления.ВесПредыдущейВерсии;
		
		// Выведем описание только "новых" версий (на которые обновились)
		ТаблицаВерсий = Новый ТаблицаЗначений();
		ТаблицаВерсий.Колонки.Добавить("Версия");
		ТаблицаВерсий.Колонки.Добавить("Вес");
		
		ИдентификаторОбласти = "Версия";
		ДлинаИдентификатора = СтрДлина(ИдентификаторОбласти);
		
		Для Каждого Область Из МакетОписаниеИзменений.Области Цикл
			Если Лев(Область.Имя, ДлинаИдентификатора) = ИдентификаторОбласти Тогда
				
				НомерВерсииОписания = Сред(Область.Имя, ДлинаИдентификатора + 1);
				НомерВерсииОписания = СтрЗаменить(НомерВерсииОписания, "_", ".");
				
				ВесВерсииОписания = ВесВерсии(НомерВерсииОписания);
				ВыводитьВерсию = (ВесВерсииОписания > ВесПредыдущейВерсии);
				
				Если ВыводитьВерсию Тогда
					ОписаниеВерсии = ТаблицаВерсий.Добавить();
					ОписаниеВерсии.Версия = НомерВерсииОписания;
					ОписаниеВерсии.Вес = ВесВерсииОписания;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ ВыводитьВсеВерсии Тогда
			ОбластьТекущаяВерсия = МакетОписаниеИзменений.ПолучитьОбласть("Текущая_Версия");
			ОбластьТекущаяВерсия.Параметры.ТекущаяВерсия = "Произведено обновление подсистемы ""Уведомления о событиях"" до версии " + ПараметрыОбновления.ТекущаяВерсия;
			ДокументОписаниеИзменений.Вывести(ОбластьТекущаяВерсия);
			ДокументОписаниеИзменений.Вывести(МакетОписаниеИзменений.ПолучитьОбласть("Отступ"));
		КонецЕсли;
		
		ТаблицаВерсий.Сортировать("Вес Убыв");
		
		Для Каждого ОписаниеВерсии Из ТаблицаВерсий Цикл
			ВывестиОписаниеИзменений(ОписаниеВерсии.Версия, ДокументОписаниеИзменений, МакетОписаниеИзменений);
		КонецЦикла;
		
		Если ВыводитьВсеВерсии Тогда
			ВывестиОписаниеИзменений("1.0.0.0", ДокументОписаниеИзменений, МакетОписаниеИзменений);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДокументОписаниеИзменений;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ РЕГЛАМЕТНЫХ ЗАДАНИЙ

// Обработчик регламентного задания ПЛ_УведомленияПоРегламентнымПроверкам. Выполняет регламентную проверку наступления события
//
// Параметры
//    Событие - СправочникСсылка.ПЛ_События - обрабатываемое событие регламентной проверки
//    Уведомление - СправочникСсылка.ПЛ_УведомленияОСобытиях - Уведомление, которое необходимо выполнить
//    АдресРезультата - Строка - Адрес временного хранилища для помещения результата
//
Процедура УведомленияПоРегламентнымПроверкам(Событие, Уведомление = Неопределено, АдресРезультата = "") Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"), УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	РучнойЗапуск = ЭтоАдресВременногоХранилища(АдресРезультата);
	
	// Проверка того, что использование подсистемы включено
	СтрокаСоединенияРабочейБазы = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройку("СтрокаСоединенияРабочейБазы");
	Если СтрокаСоединенияРабочейБазы <> ВРег(СтрокаСоединенияИнформационнойБазы()) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСобытий = Новый Массив;
	МассивСобытий.Добавить(Событие);
	
	ИсточникСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие).ИсточникСобытия;
	
	МассивУведомлений = Неопределено;
	Если ЗначениеЗаполнено(Уведомление) Тогда
		МассивУведомлений = Новый Массив;
		МассивУведомлений.Добавить(Уведомление);
	КонецЕсли;
	
	Результат = Неопределено;
	
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Запуск обработки событий");	
	ОбработатьСобытияДляУведомления(
		МассивСобытий,
		ИсточникСобытия,
		"",
		МассивУведомлений,
		Результат);
		
	Если Не РучнойЗапуск Тогда
		
		Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка И ЗначениеЗаполнено(Уведомление) Тогда
			
			Если Результат <> Неопределено Тогда
				Если Результат.ОтправленныеСообщения.Количество() Тогда
				
					Для каждого ОтправленноеСообщение Из Результат.ОтправленныеСообщения Цикл
						Если ОтправленноеСообщение.Уведомление = Уведомление Тогда
							УведомлениеОбъект = Уведомление.ПолучитьОбъект();
							УведомлениеОбъект.ДатаОтправки = ТекущаяДатаСеанса();
							Если ОтправленноеСообщение.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
								Если ОтправленноеСообщение.Свойство("ИдентификаторСообщения") И ОтправленноеСообщение.ИдентификаторСообщения <> Неопределено Тогда
									УведомлениеОбъект.Статус = 2;
									УведомлениеОбъект.ИдентификаторСообщения = ОтправленноеСообщение.ИдентификаторСообщения;
								КонецЕсли;
							Иначе
								УведомлениеОбъект.Статус = 2;
							КонецЕсли;
							УведомлениеОбъект.Записать();
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОДПИСКИ НА СОБЫТИЯ ОБЪЕКТОВ

// Обработчик подписки на событие ПЛ_ПриПроведенииДокументовДляУведомлений. Выполняет обработку события проведения документов
//
Процедура ПриЗаписиДокументовДляУведомленийПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не Источник.Проведен Тогда
		ОбработатьСобытиеПодписки("ИсточникЗаписьДокумента", Источник.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки на событие ПЛ_ПриПроведенииДокументовДляУведомлений. Выполняет обработку события проведения документов
//
Процедура ПриПроведенииДокументовДляУведомленийОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ОбработатьСобытиеПодписки("ИсточникДокумент", Источник.Ссылка);
	
КонецПроцедуры

// Обработчик подписки на событие ПЛ_ПриЗаписиСправочниковДляУведомлений. Выполняет обработку события записи справочника
//
Процедура ПриЗаписиСправочниковДляУведомленийПриЗаписи(Источник, Отказ) Экспорт
	
	ОбработатьСобытиеПодписки("ИсточникСправочник", Источник.Ссылка);
	
КонецПроцедуры

// Обработчик подписки на событие ПЛ_ПриЗаписиСведенийДляУведомлений. Выполняет обработку записи набора в регистр сведений
//
Процедура ПриЗаписиСведенийДляУведомленийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если НЕ Источник.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСобытиеПодписки("ИсточникРегистрСведений", Источник);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ РАССЫЛКИ СООБЩЕНИЙ

// "Точка входа" для обработчиков подписок на события.
// Если элементов справочника События, связанных с произошедшим в системе событием не нашлось, происходит возврат из процедуры.
// Здесь вызывается общая для всех подписок процедура обработки событий. В файловом режиме выполняется непосредственно, в клиент-серверном - в фоновом задании.
//
Процедура ОбработатьСобытиеПодписки(ТипОбъекта, Источник)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверка того, что использование подсистемы включено
	//СтрокаСоединенияРабочейБазы = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройку("СтрокаСоединенияРабочейБазы");
	СтрокаСоединенияРабочейБазы = ОбщегоНазначенияПовтИсп.ПолучитьСтрокуСоединения();
	Если СтрокаСоединенияРабочейБазы <> ВРег(СтрокаСоединенияИнформационнойБазы()) И Не ЭтоФайловаяИБ() Тогда
		Возврат;
	КонецЕсли;
	
	ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий[ТипОбъекта];
	
	// Получим список событий
	МассивСобытий = Справочники.ПЛ_События.СобытияПоИсточнику(ТипОбъекта, Источник);
	Если МассивСобытий = Неопределено Тогда
		Возврат;
	ИначеЕсли МассивСобытий.Количество() Тогда
		
		Если ТипОбъекта = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда // В фоновое задание набор записей не передается
			Отбор = Новый Структура;
			Для каждого Элемент из Источник.Отбор Цикл
				Отбор.Вставить(Элемент.Имя, Элемент.Значение);
			КонецЦИкла;
			Источник = Отбор;
		КонецЕсли;
		
		Если ЭтоФайловаяИБ() Тогда
			ОбработатьСобытияДляУведомления(МассивСобытий, ТипОбъекта, Источник);
		Иначе
			ПараметрыФоновогоЗадания = Новый Массив;
			ПараметрыФоновогоЗадания.Добавить(МассивСобытий);
			ПараметрыФоновогоЗадания.Добавить(ТипОбъекта);
			ПараметрыФоновогоЗадания.Добавить(Источник);
			
			ФоновыеЗадания.Выполнить(
				"ПЛ_УведомленияОСобытиях.ОбработатьСобытияДляУведомления",
				ПараметрыФоновогоЗадания,,
				"Отправка уведомлений о событиях");
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
Конецпроцедуры

// Процедура обработки наступления событий, общая для всех. Осуществляет необходимые для отправки уведомлений действия
//
// Параметры
//    МассивСобытий - Массив - массив, содержащий все элементы справочника События, подписанные на событие системы
//    ТипОбъекта - ПеречислениеСсылка.ПЛ_ИсточникиСобытий - документ, справочник, или регистр сведений
//    Источник - ДокументыСсылка, СправочникСсылка, РегистрСведенийНаборЗаписей - ссылка на объект, с которым произошло событие
//    Уведомление - СправочникСсылка.ПЛ_УведомленияОСобытиях - Уведомление, которое необходимо выполнить
//    Результаты - Массив - В параметр помещаются результаты обработки событий
//
Процедура ОбработатьСобытияДляУведомления(МассивСобытий, ТипОбъекта, Источник, МассивУведомлений = Неопределено, Результат = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Новый Структура("ОтправленныеСообщения, ОписаниеОшибки", Новый Массив, "");
	
	НастройкиУведомлений = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки();
	
	// Получим список уведомлений, связанных с событиями
	ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получим список уведомлений, связанных с событиями");	
	ВыборкаУведомлений = Справочники.ПЛ_УведомленияОСобытиях.УведомленияПоСобытиям(МассивСобытий, ТипОбъекта, Источник, МассивУведомлений);
	
	Если ВыборкаУведомлений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем сообщения
	Сообщения = Новый Массив;
	СообщенияСервисРассылки = Новый Массив;
	СообщенияСМС = Новый Массив;
	Напоминания = Новый Массив;
	
	Для каждого Уведомление из ВыборкаУведомлений Цикл
		
		// Проверка наличия дублей сообщения
		Если Уведомление.КонтрольПовторнойОтправки Тогда
			
			ПроверкаУникальностиСообщения = ИнициализироватьСтруктуруПроверкиУникальности();
			ЗаполнитьЗначенияСвойств(ПроверкаУникальностиСообщения, Уведомление);
			ПроверкаУникальностиСообщения.Вставить("Источник", Источник);
			
			АдресатыКОтправке = Новый Массив;
			Для каждого СтрокаАдрестата Из Уведомление.АдресатыРасширенно Цикл
				ПроверкаУникальностиСообщения.Вставить("Адресат", СтрокаАдрестата.Адресат);
				ПроверкаУникальностиСообщения.Вставить("Адрес", СтрокаАдрестата.Адрес);
				Если РегистрыСведений.ПЛ_Уведомления.СообщениеУникально(ПроверкаУникальностиСообщения) Тогда
					АдресатыКОтправке.Добавить(СтрокаАдрестата);
				КонецЕсли;
			КонецЦикла;
			
			Уведомление.АдресатыРасширенно = АдресатыКОтправке;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Готовимся к отправке писем");	
		
		Если Уведомление.АдресатыРасширенно.Количество() Тогда
			
			Если Уведомление.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта Тогда
				
				Сообщение = Новый Структура;
				Сообщение.Вставить("Уведомление", Уведомление);
				Сообщение.Вставить("ПочтовоеСообщение", СформироватьПочтовоеСообщение(Уведомление));
				
				Сообщения.Добавить(Сообщение);
				
			ИначеЕсли Уведомление.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
				
				СообщенияСервисРассылки.Добавить(Уведомление);
				
			ИначеЕсли Уведомление.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
				
				НомераПолучателей = Новый Массив;
				Для каждого СтруктураАдресата Из Уведомление.АдресатыРасширенно Цикл
					НомераПолучателей.Добавить(СтруктураАдресата.Адрес);
				КонецЦикла;
				
				Сообщение = Новый Структура;
				Сообщение.Вставить("Уведомление", Уведомление);
				Сообщение.Вставить("НомераПолучателей", НомераПолучателей);
				Сообщение.Вставить("Текст", Уведомление.Текст);
				
				СообщенияСМС.Добавить(Сообщение);
				
			ИначеЕсли Уведомление.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение Тогда
				
				МассивПользователей = Новый Массив;
				Для каждого СтруктураАдресата Из Уведомление.АдресатыРасширенно Цикл
					МассивПользователей.Добавить(СтруктураАдресата.Адресат);
				КонецЦикла;
				
				Сообщение = Новый Структура;
				Сообщение.Вставить("Уведомление", Уведомление);
				Сообщение.Вставить("Источник", Источник);
				Сообщение.Вставить("Пользователи", МассивПользователей);
				Сообщение.Вставить("Тема", Уведомление.Тема);
				Сообщение.Вставить("Текст", Уведомление.Текст);
				
				Напоминания.Добавить(Сообщение);
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Запись в РС об отправке писем");	
			РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Уведомление, Источник);
		КонецЕсли;
	КонецЦикла;
	
	ПочтаНастроена = Ложь; СМСДоступны = Ложь; СМСНастроены = Ложь; НапоминанияДоступны = Ложь; РассылкиНастроены = Ложь;
	ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены);
	
	// Почтовые сообщения
	Если Сообщения.Количество() Тогда
		
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получаем УЗ почты: начало");	
		Если ПочтаНастроена Тогда
			
			Если Метаданные.Справочники.Найти("УчетныеЗаписиЭлектроннойПочты") <> Неопределено
				И ТипЗнч(НастройкиУведомлений.СистемнаяУчетнаяЗапись) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты")
				И Не Найти(Метаданные.Справочники.Найти("УчетныеЗаписиЭлектроннойПочты").Представление(), НСтр("ru = 'не используется'")) Тогда
				
				УчетнаяЗапись = НастройкиУведомлений.СистемнаяУчетнаяЗапись;
			Иначе
				УчетнаяЗапись = НастройкиУведомлений.НастройкиУчетнойЗаписи;
			КонецЕсли;
			ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Получаем УЗ почты: окончание");	
			
			Если НастройкиУведомлений.СохранятьЭлектронныеПисьма Тогда
				СохранитьПочтовыеСообщения(Сообщения, Источник, УчетнаяЗапись, Результат);
			Иначе
				Профиль = ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
				ОтправитьПочтовыеСообщения(Сообщения, Источник, УчетнаяЗапись, Профиль, Результат);
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось отправить электронное письмо по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", НСтр("ru = 'не настроены параметры отправки электронной почты'"));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
	// Сервис рассылки
	Если СообщенияСервисРассылки.Количество() Тогда
		
		Если РассылкиНастроены Тогда
			ОтправитьПочтовыеСообщенияЧерезСервис(СообщенияСервисРассылки, Результат);
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось отправить электронное письмо по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", НСтр("ru = 'не настроены параметры подключения к сервису рассылки почты'"));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// СМС
	Если СообщенияСМС.Количество() Тогда
		Если СМСНастроены И Платформа83() Тогда
			Если НастройкиУведомлений.НастройкиСМС.СохранятьСообщенияСМС Тогда
				Для каждого Сообщение из СообщенияСМС Цикл
					СохранитьСМС(Сообщение, Источник, НастройкиУведомлений.НастройкиСМС, Результат);
				КонецЦикла;
			Иначе
				Для каждого Сообщение из СообщенияСМС Цикл
					ОтправитьСМС(Сообщение, Источник, НастройкиУведомлений.НастройкиСМС, СМСДоступны, Результат);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ТекстСообщения = НСтр("ru = 'Не удалось отправить СМС по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", НСтр("ru = 'не заполнены настройки отправки СМС'"));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	// Напоминания
	Если Напоминания.Количество() Тогда
		ВидНапоминаний = ПодсистемаНапоминаний();
		Если ЗначениеЗаполнено(ВидНапоминаний) Тогда
			Для каждого Сообщение из Напоминания Цикл
				СоздатьНапоминание(Сообщение, Источник, ВидНапоминаний, Результат);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обновление

// Возвращает текущую версию подсистемы уведомлений. Редактируется при выпуске новых версий
//
// Возвращаемое значение
//    Структура, содержащая номер новой версии в формате "1.2.3" и ее вес, равный 1 * 10000 + 2 * 100 + 3.
//
Функция ТекущаяВерсияПодсистемыУведомлений()
	
	НомерВерсии = "2.0.1.16";
	Вес = ВесВерсии(НомерВерсии);
	
	Возврат Новый Структура("НомерВерсии, Вес", СокрЛП(НомерВерсии), Вес);
	
КонецФункции

// Возвращает таблицу, содержащую названия процедур обработчиков для различных версий подсистемы
//
Функция ТаблицаОбработчиковОбновления()
	
	ТаблицаОбработчиков = Новый ТаблицаЗначений();
	ТаблицаОбработчиков.Колонки.Добавить("Версия", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(0)));
	ТаблицаОбработчиков.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10)));
	ТаблицаОбработчиков.Колонки.Добавить("Процедура", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(0)));
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.0.2.0";
	Обработчик.Процедура = "ДобавитьНастройкиСоединенияСРабочейБазой";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.0.5.1";
	Обработчик.Процедура = "УстановитьСпособУведомленияПоЭлПочте";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.0.5.4";
	Обработчик.Процедура = "ДобавитьНастройкиСМС";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.0.6.3";
	Обработчик.Процедура = "СоздатьПреднастроенныеСобытия1_0_6_3";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.0.6.8";
	Обработчик.Процедура = "ДобавитьНастройкиSSL";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.1.1.1";
	Обработчик.Процедура = "ДобавитьПолеТекущийПользователь";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.1.1.1";
	Обработчик.Процедура = "УстановитьСпособОтдельноКаждомуДляНапоминаний";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.2.1.1";
	Обработчик.Процедура = "РасширитьНастройкиСМС";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "1.2.1.3";
	Обработчик.Процедура = "УстановитьФильтрПоАдресатам";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.1";
	Обработчик.Процедура = "ДобавитьНастройкиПочтовойРассылки";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.2";
	Обработчик.Процедура = "ДобавитьНастройкиСохраненияСообщений";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.4";
	Обработчик.Процедура = "ДобавитьНастройкиОткрытияНовойФормыУведомлений";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.5";
	Обработчик.Процедура = "ПеренестиФлагВключенияИзСобытийВУведомления";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.12";
	Обработчик.Процедура = "ЗаменитьТегиВШаблонах";
	
	Обработчик = ТаблицаОбработчиков.Добавить();
	Обработчик.Версия    = "2.0.1.14";
	Обработчик.Процедура = "ПроверитьНастройкиКодаСтраны";
	
	Для каждого СтрокаОбработчика Из ТаблицаОбработчиков Цикл
		СтрокаОбработчика.Вес = ВесВерсии(СтрокаОбработчика.Версия);
	КонецЦикла;
	
	Возврат ТаблицаОбработчиков;
	
КонецФункции

// Вывести в табличный документ описания изменений в указанной версии
//
// Параметры
//   НомерВерсии – Строка - номер версии, для которого выводится описание изменений
//   ДокументОписаниеИзменений - табличный документ, в который выводится описание изменений
//   МакетОписаниеОбновлений - макет, содержащий описания изменений для всех версий
//
Процедура ВывестиОписаниеИзменений(Знач НомерВерсии, ДокументОписаниеИзменений, МакетОписаниеИзменений)
	
	Номер = СтрЗаменить(НомерВерсии, ".", "_");
	
	Если МакетОписаниеИзменений.Области.Найти("Шапка" + Номер) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументОписаниеИзменений.Вывести(МакетОписаниеИзменений.ПолучитьОбласть("Шапка" + Номер));
	ДокументОписаниеИзменений.НачатьГруппуСтрок("Версия" + Номер);
	ДокументОписаниеИзменений.Вывести(МакетОписаниеИзменений.ПолучитьОбласть("Версия" + Номер));
	ДокументОписаниеИзменений.ЗакончитьГруппуСтрок();
	ДокументОписаниеИзменений.Вывести(МакетОписаниеИзменений.ПолучитьОбласть("Отступ"));
	
КонецПроцедуры

// Почта

// Возвращает заполненный настройками учетной записи почтовый профиль интернет
//
Функция ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись)
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	ВерсияПодсистемыУТ = ВерсияУТ();
	
	Если ТипЗнч(УчетнаяЗапись) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Профиль, УчетнаяЗапись);
		Если УчетнаяЗапись.ТребуетсяSMTPАутентификация Тогда
			Профиль.АутентификацияSMTP  = СпособSMTPАутентификации.ПоУмолчанию;
			Профиль.ПользовательSMTP    = УчетнаяЗапись.Пользователь;
			Профиль.ПарольSMTP          = УчетнаяЗапись.Пароль;
		Иначе
			Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
			Профиль.ПарольSMTP         = "";
			Профиль.ПользовательSMTP   = "";
		КонецЕсли;
	Иначе
		Если ВерсияПодсистемыУТ = "10" Тогда
			
			Если Метаданные.ОбщиеМодули.Найти("ЭлектроннаяПочта") <> Неопределено Тогда
				
				Попытка
					Выполнить("Профиль = ЭлектроннаяПочта.СформироватьИнтернетПрофиль(УчетнаяЗапись,,, Ложь)");
				Исключение
					ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,
						УчетнаяЗапись.Метаданные(),
						УчетнаяЗапись,
						ТекстСообщения);
				КонецПопытки;
				
			ИначеЕсли Метаданные.ОбщиеМодули.Найти("УправлениеЭлектроннойПочтой") <> Неопределено Тогда
				
				Попытка
					Выполнить("Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись)");
				Исключение
					ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,
						УчетнаяЗапись.Метаданные(),
						УчетнаяЗапись,
						ТекстСообщения);
				КонецПопытки;
			КонецЕсли;
			
			//<<Макарова
			// -- у нас нет реквизита ИспользоватьЗащищенноеСоединениеДляИсходящейПочты
			//Попытка
			//	Если Платформа83() И Не Профиль.ИспользоватьSSLSMTP Тогда
			//		Выполнить("Профиль.ИспользоватьSSLSMTP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, ""ИспользоватьЗащищенноеСоединениеДляИсходящейПочты"")");
			//	КонецЕсли;
			//Исключение
			//	ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
			//	ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			//	ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			//		УровеньЖурналаРегистрации.Предупреждение,
			//		УчетнаяЗапись.Метаданные(),
			//		УчетнаяЗапись,
			//		ТекстСообщения);
			//КонецПопытки;
			//Макарова >>
			
		ИначеЕсли ВерсияПодсистемыУТ = "11" Или ВерсияПодсистемыУТ = "Бухгалтерия_3.0" Или ВерсияПодсистемыУТ = "Розница" Или ВерсияПодсистемыУТ = "ЗУП" Тогда
			
			ВерсияБСП = ВерсияБСП();
			Если ВерсияБСП <> Неопределено Тогда
				
				Если ВесВерсии(ВерсияБСП) >= ВесВерсии("2.1.0.0") Тогда
					
					Попытка
						Выполнить("Профиль = РаботаСПочтовымиСообщениямиСлужебный.ИнтернетПочтовыйПрофиль(УчетнаяЗапись)");
					Исключение
						ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
							УровеньЖурналаРегистрации.Предупреждение,
							УчетнаяЗапись.Метаданные(),
							УчетнаяЗапись,
							ТекстСообщения);
					КонецПопытки;
					
				ИначеЕсли ВесВерсии(ВерсияБСП) >= ВесВерсии("2.0.0.0") Тогда
					
					Попытка
						Выполнить("Профиль = ЭлектроннаяПочта.СформироватьИнтернетПрофиль(УчетнаяЗапись)");
					Исключение
						ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
						ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
							УровеньЖурналаРегистрации.Предупреждение,
							УчетнаяЗапись.Метаданные(),
							УчетнаяЗапись,
							ТекстСообщения);
					КонецПопытки;
				
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Попытка
				
				Пароль = Неопределено;
				ФормироватьSMTPПрофиль = Истина;
				
				НастройкиСоединения = ЗначенияРеквизитовОбъекта(
					УчетнаяЗапись,
					"Логин,
					|Пароль,
					|ВремяОжиданияСервера,
					|SMTPСервер,
					|ПортSMTP,
					|ТребуетсяSMTPАутентификация,
					|ЛогинSMTP,
					|ПарольSMTP");
				
				Профиль.Пользователь = НастройкиСоединения.Логин;
				Если НастройкиСоединения.ВремяОжиданияСервера > 0 Тогда
					Профиль.ВремяОжидания = НастройкиСоединения.ВремяОжиданияСервера;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Пароль) Тогда
					Профиль.Пароль = Пароль;
				Иначе
					Профиль.Пароль = НастройкиСоединения.Пароль;
				КонецЕсли;
				
				Если Платформа83() Тогда
					Выполнить("Профиль.ИспользоватьSSLSMTP = Истина;");
				КонецЕсли;
				
				Если ФормироватьSMTPПрофиль Тогда
					Профиль.АдресСервераSMTP = НастройкиСоединения.SMTPСервер;
					Профиль.ПортSMTP         = НастройкиСоединения.ПортSMTP;
					
					Если НастройкиСоединения.ТребуетсяSMTPАутентификация Тогда
						Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
						Профиль.ПользовательSMTP   = НастройкиСоединения.ЛогинSMTP;
						Профиль.ПарольSMTP         = НастройкиСоединения.ПарольSMTP;
					Иначе
						Профиль.АутентификацияSMTP = СпособSMTPАутентификации.БезАутентификации;
						Профиль.ПользовательSMTP   = "";
						Профиль.ПарольSMTP         = "";
					КонецЕсли;
				КонецЕсли;
				
			Исключение
				ТекстСообщения = НСтр("ru = 'Не удалось сформировать интернет почтовый профиль по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,
					УчетнаяЗапись.Метаданные(),
					УчетнаяЗапись,
					ТекстСообщения);
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Профиль;

КонецФункции

// Возвращает подготовленное почтовое сообщение интернет
//
Функция СформироватьПочтовоеСообщение(Уведомление)
	
	Если Уведомление.ОбычныйТекст Тогда
		ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
	Иначе
		ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	КонецЕсли;
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	
	Если Уведомление.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.СкрытыеКопии Тогда
		ИмяСписка = "СлепыеКопии";
	Иначе
		ИмяСписка = "Получатели";
	КонецЕсли;
	
	Для каждого СтруктураАдресата Из Уведомление.АдресатыРасширенно Цикл
		Сообщение[ИмяСписка].Добавить(СтруктураАдресата.Адрес);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Уведомление.ОбратныйАдрес) Тогда
		Сообщение.ОбратныйАдрес.Добавить(Уведомление.ОбратныйАдрес);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Уведомление.ИмяОтправителя) Тогда
		Сообщение.ИмяОтправителя = Уведомление.ИмяОтправителя;
	КонецЕсли;
	
	Сообщение.Тема = Уведомление.Тема;
	
	ТекстСообщения = Уведомление.Текст;
	Сообщение.Тексты.Добавить(ТекстСообщения, ТипТекста);
	
	Если Уведомление.ТаблицаВложений <> Неопределено Тогда
		Для Каждого СтрокаВложения Из Уведомление.ТаблицаВложений Цикл
			ДанныеВложения = СтрокаВложения.Вложение.Получить();
			Если ДанныеВложения <> Неопределено Тогда
				Вложение = Сообщение.Вложения.Добавить(ДанныеВложения, СтрокаВложения.Идентификатор);
				Вложение.Идентификатор = СтрокаВложения.Идентификатор;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Уведомление.ПечатныеФормы <> Неопределено Тогда
		Для каждого ПечатнаяФорма из Уведомление.ПечатныеФормы Цикл
			Если ПечатнаяФорма.ДвоичныеДанные <> Неопределено Тогда
				Вложение = Сообщение.Вложения.Добавить(ПечатнаяФорма.ДвоичныеДанные, ПечатнаяФорма.ИмяФайла);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Уведомление.ПрисоединенныеФайлы <> Неопределено Тогда
		Для каждого ПрисоединенныйФайл из Уведомление.ПрисоединенныеФайлы Цикл
			ДанныеПрисоединенногоФайла = ПрисоединенныйФайл.Вложение.Получить();
			Если ДанныеПрисоединенногоФайла <> Неопределено Тогда
				Вложение = Сообщение.Вложения.Добавить(ДанныеПрисоединенногоФайла, ПрисоединенныйФайл.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Сообщение.ОбработатьТексты();
	
	Возврат Сообщение;
	
КонецФункции

// Осуществляет отправку почтового сообщения интернет при помощи указанной учетной записи
//
Процедура ОтправитьПочтовыеСообщения(Сообщения, Источник, УчетнаяЗапись, Профиль, Результат)
	
	Если ТипЗнч(УчетнаяЗапись) = Тип("Структура") Тогда
		Отправитель = УчетнаяЗапись.Пользователь;
	Иначе
		Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	КонецЕсли;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Подключаемся к почте: начало");	
		Почта.Подключиться(Профиль);
		
		Для каждого ЭлементМассива Из Сообщения Цикл
			
			Отправлено = Ложь;
			
			ПочтовоеСообщение = ЭлементМассива.ПочтовоеСообщение;
			ПочтовоеСообщение.Отправитель = Отправитель;
			
			Попытка
				
				ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Отправляем письмо: начало");	
				Почта.Послать(ПочтовоеСообщение);
				ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Отправляем письмо: окончание");	
				Отправлено = Истина;
				
			Исключение
				
				ТекстСообщения = НСтр("ru = 'Не удалось отправить электронное письмо по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,,,
					ТекстСообщения);
					
				Отправлено = Ложь;
				Результат.ОписаниеОшибки = ТекстСообщения;
				
			КонецПопытки;
			
			Если Отправлено Тогда
				РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(ЭлементМассива.Уведомление, Источник, Истина);
				Результат.ОтправленныеСообщения.Добавить(ЭлементМассива.Уведомление);
			КонецЕсли;
		КонецЦикла;
		
		Почта.Отключиться();
		ЗаписьЖурналаРегистрации("ПЛ_УведомленияПоРегламентнымПроверкам",,,,"Отключились от почты: окончание");	
		
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось отправить электронные письма по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстСообщения);
			
		Результат.ОписаниеОшибки = ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

// Сохраняет почтовые сообщения в документах конфигурации
//
Процедура СохранитьПочтовыеСообщения(Сообщения, Источник, УчетнаяЗапись, Результат)
	
	ВерсияУТ = ВерсияУТ();
	
	Если ВерсияУТ = "11" Или ВерсияУТ = "ЗУП" Тогда
	
		ОписаниеОшибки = "";
		ИдентификаторСообщения = "";
		
		Попытка
		
			Для каждого ЭлементМассива Из Сообщения Цикл
				
				Сообщение = ЭлементМассива.ПочтовоеСообщение;
				
				Письмо = Неопределено;
				Выполнить("Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент()");
				
				Для каждого Получатель Из Сообщение.Получатели Цикл
					НовыйПолучатель = Письмо.ПолучателиПисьма.Добавить();
					НовыйПолучатель.Адрес         = Получатель.Адрес;
					НовыйПолучатель.Представление = Получатель.ОтображаемоеИмя;
				КонецЦикла;
				
				Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
					НовыйПолучатель = Письмо.ПолучателиСкрытыхКопий.Добавить();
					НовыйПолучатель.Адрес         = Получатель.Адрес;
					НовыйПолучатель.Представление = Получатель.ОтображаемоеИмя;
				КонецЦикла;
				
				Если Письмо.ПолучателиПисьма.Количество() = 0 И Письмо.ПолучателиСкрытыхКопий.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				
				Выполнить("Письмо.Автор         = Пользователи.ТекущийПользователь()");
				Выполнить("Письмо.Ответственный = Пользователи.ТекущийПользователь()");
				Письмо.Дата                     = ТекущаяДатаСеанса();
				Выполнить("Письмо.Важность = Перечисления.ВариантыВажностиВзаимодействия.Обычная");
				Письмо.Кодировка                = "UTF-8";
				Письмо.УчетнаяЗапись            = УчетнаяЗапись;
				
				Письмо.ОтправительПредставление = Сообщение.ИмяОтправителя;
				
				Выполнить("Письмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее");
				Выполнить("Письмо.ТипТекста = ?(Сообщение.Тексты[0].ТипТекста = ТипТекстаПочтовогоСообщения.HTML,
					|Перечисления.ТипыТекстовЭлектронныхПисем.HTML,
					|Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст)");
				
				Письмо.Тема                     = Сообщение.Тема;
				
				Если Сообщение.Тексты[0].ТипТекста = ТипТекстаПочтовогоСообщения.HTML Тогда
					Письмо.ТекстHTML = Сообщение.Тексты[0].Текст;
					Выполнить("Письмо.Текст = Взаимодействия.ПолучитьОбычныйТекстИзHTML(Письмо.ТекстHTML)");
				Иначе
					Письмо.Текст = Сообщение.Тексты[0].Текст;
				КонецЕсли;
				
				Выполнить("Письмо.СписокПолучателейПисьма = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(Письмо.ПолучателиПисьма, Ложь)");
				Выполнить("Письмо.СписокПолучателейСкрытыхКопий = ВзаимодействияКлиентСервер.ПолучитьПредставлениеСпискаАдресатов(Письмо.ПолучателиСкрытыхКопий, Ложь)");
				
				Письмо.Записать();
				
				Для каждого Вложение Из Сообщение.Вложения Цикл
					АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Вложение.Данные);
					ПрисоединенныйФайл = Неопределено;
					Выполнить("ПрисоединенныйФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
						|Письмо.Ссылка, АдресВременногоХранилища, Вложение.Идентификатор, 0)");
					ПрисоединенныйФайлОбъект = ПрисоединенныйФайл.ПолучитьОбъект();
					ПрисоединенныйФайлОбъект.ИДФайлаЭлектронногоПисьма = Вложение.Идентификатор;
					ПрисоединенныйФайлОбъект.Записать();
				КонецЦикла;
				
				РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(ЭлементМассива.Уведомление, Источник, Истина);
				Результат.ОтправленныеСообщения.Добавить(ЭлементМассива.Уведомление);
			КонецЦикла;
			
			Реквизиты = Неопределено;
			Выполнить("Реквизиты = ВзаимодействияКлиентСервер.СтруктураРеквизитовВзаимодействияДляЗаписи(, Письмо.Ссылка, Истина)");
			Выполнить("ВзаимодействияВызовСервера.ЗаписьРегистрРеквизитыВзаимодействия(Письмо.Ссылка, Реквизиты)");
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось создать электронные письма по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
				
			Результат.ОписаниеОшибки = ТекстСообщения;
		КонецПопытки;
		
	ИначеЕсли ВерсияУТ = "10" Тогда
		
		Попытка
			
			Для каждого ЭлементМассива Из Сообщения Цикл
				
				Сообщение = ЭлементМассива.ПочтовоеСообщение;
				
				Письмо = Неопределено;
				Выполнить("Письмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент()");
				
				Для каждого Получатель Из Сообщение.Получатели Цикл
					НовыйПолучатель = Письмо.КомуТЧ.Добавить();
					НовыйПолучатель.АдресЭлектроннойПочты  = Получатель.Адрес;
					НовыйПолучатель.Представление          = Получатель.ОтображаемоеИмя;
					
					Если Не ПустаяСтрока(Письмо.Кому) Тогда
						Письмо.Кому = Письмо.Кому + ", ";
					КонецЕсли;
						
					Если ПустаяСтрока(Получатель.ОтображаемоеИмя) Тогда
						Письмо.Кому = Письмо.Кому + Получатель.Адрес;
					Иначе
						Письмо.Кому = Письмо.Кому + Получатель.ОтображаемоеИмя + " <" + Получатель.Адрес + ">";
					КонецЕсли;
				КонецЦикла;
				
				Для каждого Получатель Из Сообщение.СлепыеКопии Цикл
					НовыйПолучатель = Письмо.СкрытыеКопииТЧ.Добавить();
					НовыйПолучатель.АдресЭлектроннойПочты  = Получатель.Адрес;
					НовыйПолучатель.Представление          = Получатель.ОтображаемоеИмя;
				КонецЦикла;
				
				Если Письмо.КомуТЧ.Количество() = 0 И Письмо.СкрытыеКопииТЧ.Количество() = 0 Тогда
					Возврат;
				КонецЕсли;
				
				Выполнить("Письмо.Ответственный = Пользователи.ТекущийПользователь()");
				Письмо.Дата                     = ТекущаяДатаСеанса();
				Письмо.КодировкаПисьма          = "UTF-8";
				Письмо.УчетнаяЗапись            = УчетнаяЗапись;
				
				Письмо.ОтправительИмя           = Сообщение.ИмяОтправителя;
				Письмо.ОтправительПредставление = Сообщение.ИмяОтправителя;
				
				Выполнить("Письмо.СтатусПисьма = Перечисления.СтатусыПисем.Исходящее");
				Выполнить("Письмо.ВидТекстаПисьма = ?(Сообщение.Тексты[0].ТипТекста = ТипТекстаПочтовогоСообщения.HTML,
					|Перечисления.ВидыТекстовЭлектронныхПисем.HTMLСКартинками,
					|Перечисления.ТипыТекстовЭлектронныхПисем.Текст)");
				
				Письмо.Тема                     = Сообщение.Тема;
				Письмо.Предмет                  = "";
				Письмо.ТекстПисьма              = Сообщение.Тексты[0].Текст;
				
				Письмо.ЕстьВложения = Сообщение.Вложения.Количество();
				
				Для каждого Вложение Из Сообщение.Вложения Цикл
					Если ЗначениеЗаполнено(Вложение.Идентификатор) Тогда
						Картинка = Новый Картинка(Вложение.Данные);
						ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Строка(Картинка.Формат()));
						Картинка.Записать(ИмяВременногоФайла);
						Письмо.ТекстПисьма = СтрЗаменить(Письмо.ТекстПисьма, "cid:" + Вложение.Идентификатор, "file://" + ИмяВременногоФайла);
					КонецЕсли;
				КонецЦикла;
				
				Письмо.Записать();
				
				Для каждого Вложение Из Сообщение.Вложения Цикл
					
					Если ЗначениеЗаполнено(Вложение.Идентификатор) Тогда
						Продолжить;
					КонецЕсли;
					
					ПрисоединенныйФайл = Неопределено;
					Выполнить("ПрисоединенныйФайл = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент()");
					ПрисоединенныйФайл.Объект = Письмо.Ссылка;
					ПрисоединенныйФайл.ИмяФайла = Вложение.ИмяФайла;
					ПрисоединенныйФайл.Хранилище = Новый ХранилищеЗначения(Вложение.Данные);
					ПрисоединенныйФайл.Записать();
				КонецЦикла;
				
				РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(ЭлементМассива.Уведомление, Источник, Истина);
				Результат.ОтправленныеСообщения.Добавить(ЭлементМассива.Уведомление);
			КонецЦикла;
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось создать электронные письма по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
				
			Результат.ОписаниеОшибки = ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Осуществляет отправку почтового сообщения через сервис рассылки
//
Процедура ОтправитьПочтовыеСообщенияЧерезСервис(Сообщения, Результат)
	
	Результат = ПЛ_Рассылки.ОтправитьСообщения(Сообщения);
	
	Если Результат <> Неопределено Тогда
		Если Результат.ОтправленныеСообщения.Количество() Тогда
			
			Для каждого Сообщение Из Сообщения Цикл
				Для каждого ОтправленноеСообщение Из Результат.ОтправленныеСообщения Цикл
					
					Если ОтправленноеСообщение.Уведомление = Сообщение.Уведомление Тогда
						Если ОтправленноеСообщение.ИдентификаторСообщения <> Неопределено Тогда
							РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Сообщение, "", Истина);
						КонецЕсли;
					КонецЕсли;
					
				КонецЦикла;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// СМС

Процедура ОтправитьСМС(Сообщение, Источник, НастройкиСМС, СМСДоступны, Результат)
	
	Результат = "";
	
	Если СМСДоступны Тогда
		
		Попытка
			Выполнить("Результат = ОтправкаSMS.ОтправитьSMS(Сообщение.НомераПолучателей, Сообщение.Текст, НастройкиСМС.ИмяОтправителяСМС);");
			
			Если Результат <> Неопределено Тогда
				Если Не ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
					РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Сообщение.Уведомление, Источник, Истина);
					Результат.ОтправленныеСообщения.Добавить(Сообщение.Уведомление);
				Иначе
					ТекстСообщения = НСтр("ru = 'Не удалось отправить SMS по причине: %Причина%'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", Результат.ОписаниеОшибки);
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,,,
						ТекстСообщения);
						
					Результат.ОписаниеОшибки = ТекстСообщения;
				КонецЕсли;
			КонецЕсли;
		Исключение
		
			ТекстСообщения = НСтр("ru = 'Не удалось отправить SMS по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
				
			Результат.ОписаниеОшибки = ТекстСообщения;
		КонецПопытки;
	Иначе
		
		Попытка
			Результат = ПЛ_ОтправкаСМС.ОтправитьСМС(Сообщение, НастройкиСМС);
			Если Результат <> Неопределено Тогда
				РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Сообщение.Уведомление, Источник, Истина);
				Результат.ОтправленныеСообщения.Добавить(Сообщение.Уведомление);
			Иначе
				ТекстСообщения = НСтр("ru = 'Не удалось отправить SMS по причине: %Причина%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", Результат.ОписаниеОшибки);
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,,,
					ТекстСообщения);
					
				Результат.ОписаниеОшибки = ТекстСообщения;
			КонецЕсли;
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось отправить SMS по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
				
			Результат.ОписаниеОшибки = ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура СохранитьСМС(Сообщение, Источник, НастройкиСМС, Результат)
	
	Попытка
		
		СообщениеСМС = Неопределено;
		Выполнить("СообщениеСМС = Документы.СообщениеSMS.СоздатьДокумент()");
		
		Для каждого СтрокаАдресата Из Сообщение.Уведомление.АдресатыРасширенно Цикл
			НоваяСтрока = СообщениеСМС.Адресаты.Добавить();
			НоваяСтрока.Контакт               = СтрокаАдресата.Адресат;
			НоваяСтрока.ПредставлениеКонтакта = Строка(СтрокаАдресата.Адресат);
			НоваяСтрока.КакСвязаться          = СтрокаАдресата.Адрес;
			НоваяСтрока.НомерДляОтправки      = ФорматироватьНомер(СтрокаАдресата.Адрес);
			Выполнить("НоваяСтрока.СостояниеСообщения = Перечисления.СостоянияСообщенияSMS.Исходящее");
		КонецЦикла;
		
		СообщениеСМС.ТекстСообщения = Сообщение.Текст;
		СообщениеСМС.Дата           = ТекущаяДатаСеанса();
		Выполнить("СообщениеСМС.Ответственный = Пользователи.ТекущийПользователь()");
		СообщениеСМС.Записать();
		
		РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Сообщение.Уведомление, Источник, Истина);
		Результат.ОтправленныеСообщения.Добавить(Сообщение.Уведомление);
		
	Исключение
		
		ТекстСообщения = НСтр("ru = 'Не удалось создать сообщение SMS по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТекстСообщения);
			
		Результат.ОписаниеОшибки = ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

Функция ФорматироватьНомер(Номер)
	
	Результат = "";
	ДопустимыеСимволы = "1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер,Позиция,1);
		Если Найти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Напоминания

Процедура СоздатьНапоминание(Сообщение, Источник, ВидНапоминаний, Результат)
	
	Для каждого Адресат из Сообщение.Пользователи Цикл
		
		Попытка
			
			ДатаНапоминания = ТекущаяДата();
			
			Если ВидНапоминаний = "БСП" Тогда
				
				ВремяНапоминания = ТекущаяДата();
				
				ЗаписьРегистра = "";
				Выполнить("ЗаписьРегистра = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();");
				
				Если ТипЗнч(ЗаписьРегистра.Пользователь) = ТипЗнч(Адресат) Тогда
					
					ЗаписьРегистра.Пользователь               = Адресат;
					ЗаписьРегистра.ВремяСобытия               = ВремяНапоминания;
					ЗаписьРегистра.Источник                   = Сообщение.Источник;
					ЗаписьРегистра.СрокНапоминания            = ВремяНапоминания;
					ЗаписьРегистра.ИнтервалВремениНапоминания = 0;
				
					ЗаписьРегистра.Описание                 = Лев(СокрЛП(Сообщение.Текст), 255);
					Выполнить("ЗаписьРегистра.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;");
				
					ЗаписьРегистра.Записать();
				КонецЕсли;
				
			ИначеЕсли ВидНапоминаний = "CRM" Тогда
				
				ЗаписьРегистра = "";
				Выполнить("ЗаписьРегистра = РегистрыСведений.CRM_Напоминания.СоздатьМенеджерЗаписи();");
				
				ЗаписьРегистра.Пользователь             = Адресат;
				ЗаписьРегистра.Активность               = Истина;
				ЗаписьРегистра.РеальнаяДатаОповещения   = ДатаНапоминания;
				ЗаписьРегистра.Автор                    = Адресат;
				ЗаписьРегистра.Объект                   = Сообщение.Источник;
				
				ЗаписьРегистра.ТипПериода               = "00";
				ЗаписьРегистра.УдалитьПоИстеченииСрока  = Истина;
				
				ЗаписьРегистра.ДатаНачала               = ДатаНапоминания;
				ЗаписьРегистра.ДатаОповещения           = ДатаНапоминания;
				ЗаписьРегистра.Тема                     = Сообщение.Тема;
				ЗаписьРегистра.Описание                 = Сообщение.Текст;
				
				ЗаписьРегистра.Записать();
				
			ИначеЕсли ВидНапоминаний = "События" Тогда
				
				ДокументСобытие = "";
				Выполнить("ДокументСобытие = Документы.Событие.СоздатьДокумент();");
				
				ДокументСобытие.Дата                    = ДатаНапоминания;
				
				Выполнить("ДокументСобытие.ВидСобытия = Перечисления.ВидыСобытий.Прочее;");
				Выполнить("ДокументСобытие.СостояниеСобытия = Перечисления.СостоянияСобытий.Запланировано;");
				
				ДокументСобытие.Ответственный           = Адресат;
				ДокументСобытие.Основание               = Сообщение.Источник;
				
				ДокументСобытие.ОписаниеСобытия         = Сообщение.Тема;
				ДокументСобытие.СодержаниеСобытия       = Сообщение.Текст;
				
				ДокументСобытие.НапомнитьОСобытии       = Истина;
				ДокументСобытие.НачалоСобытия           = ДатаНапоминания;
				ДокументСобытие.ОкончаниеСобытия        = ДатаНапоминания;
				
				ДокументСобытие.Записать(РежимЗаписиДокумента.Проведение);
				
			ИначеЕсли ВидНапоминаний = "Задачи" Тогда
				
				НоваяЗадача = "";
				Выполнить("НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();");
				НоваяЗадача.Дата                        = ТекущаяДата();
				НоваяЗадача.Наименование                = Сообщение.Тема;
				НоваяЗадача.Описание                    = Сообщение.Текст;
				НоваяЗадача.ПамятнаяДата                = Истина;
				НоваяЗадача.Исполнитель                 = Адресат;
				НоваяЗадача.Инициатор                   = Адресат;
				НоваяЗадача.СрокИсполнения              = ДатаНапоминания;
				НоваяЗадача.Оповещение                  = Истина;
				НоваяЗадача.СрокОповещения              = ДатаНапоминания;
				НоваяЗадача.Объект                      = Сообщение.Источник;
				
				НоваяЗадача.Записать();
				
			КонецЕсли;
			
			РегистрыСведений.ПЛ_Уведомления.СделатьЗаписьОбОтправкеУведомления(Сообщение.Уведомление, Источник, Истина);
			Результат.ОтправленныеСообщения.Добавить(Сообщение.Уведомление);
			
		Исключение
			
			ТекстСообщения = НСтр("ru = 'Не удалось создать напоминание пользователю по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
				УровеньЖурналаРегистрации.Предупреждение,,,
				ТекстСообщения);
				
			Результат.ОписаниеОшибки = ТекстСообщения;
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// Шаблоны

// Выбирает из шаблона текста все переменные и возвращает соответствие
//
Функция РеквизитыШаблонаСообщения(Знач Текст)
	
	МассивРеквизитов = Новый Массив;
	
	НачПоз = Найти(Текст, "%%");
	Пока НачПоз > 0 Цикл
		Текст = Сред(Текст, НачПоз + 2);
		КонПоз = Найти(Текст, "%%");
		Если КонПоз > 0 Тогда
			Реквизит = Лев(Текст, КонПоз - 1);
			Если МассивРеквизитов.Найти(Реквизит) = Неопределено Тогда
				МассивРеквизитов.Добавить(Реквизит);
			КонецЕсли;
			Текст = Сред(Текст, КонПоз + 2);
		КонецЕсли;
		НачПоз = Найти(Текст, "%%");
	КонецЦикла;
	
	СоответствиеРеквизитов = Новый Соответствие;
	Для каждого Реквизит из МассивРеквизитов Цикл
		Ключ = Реквизит;
		Ключ = СтрЗаменить(Ключ, ".", "");
		Ключ = СтрЗаменить(Ключ, " ", "");
		Ключ = СтрЗаменить(Ключ, "[", "_");
		Ключ = СтрЗаменить(Ключ, "]", "_");
		Ключ = СтрЗаменить(Ключ, "(", "_");
		Ключ = СтрЗаменить(Ключ, ")", "_");
		СоответствиеРеквизитов.Вставить(Ключ, Реквизит);
	КонецЦикла;
	
	Возврат СоответствиеРеквизитов;
	
КонецФункции

// Формирует табличный документ по СКД таблицы и преобразует его в текстовый формат
//
Функция ПолучитьТаблицуВВидеТекста(ТипИсточника, Источник, АдресСхемы, АдресНастроек, ОбычныйТекст, ПоляВыбораАдресатов = Неопределено, Адресат = Неопределено)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемы);
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	
	НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	
	ПолеПараметр = Новый ПараметрКомпоновкиДанных("Источник");
	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПолеПараметр);
	Если ЗначениеПараметра <> Неопределено Тогда
		ЗначениеПараметра.Использование = Истина;
		ЗначениеПараметра.Значение      = Источник;
	КонецЕсли;
	
	Если ПоляВыбораАдресатов <> Неопределено И Адресат <> Неопределено Тогда
		
		ГруппаОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		
		Для каждого Поле Из ПоляВыбораАдресатов Цикл
			ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Поле;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Адресат;
			ЭлементОтбора.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
	
	// Отборы набора записей регистра
	Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений Тогда
		Для каждого Элемент из Источник Цикл
			ЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение = Элемент.Значение;
			ЭлементОтбора.Использование = Истина;
		КонецЦикла;
	КонецЕсли;
	
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,,);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,, Истина);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Если ОбычныйТекст Тогда
		ТипФайла = ТипФайлаТабличногоДокумента.TXT;
	Иначе
		ТипФайла = ТипФайлаТабличногоДокумента.HTML4;
	КонецЕсли;
	
	ВременныйФайл = ПолучитьИмяВременногоФайла();
	ДокументРезультат.Записать(ВременныйФайл, ТипФайла);
	
	ВременныйТекстовыйДокумент = Новый ТекстовыйДокумент;
	ВременныйТекстовыйДокумент.Прочитать(ВременныйФайл);
	
	УдалитьФайлы(ВременныйФайл);
	
	ТекстТаблицы = ВременныйТекстовыйДокумент.ПолучитьТекст();
	
	Возврат ТекстТаблицы;
	
КонецФункции

// Компоновка

// Очищает все элементы настройки компоновки данных из объекта
// Параметры:
//	Настройки - настройки КД
//
Процедура ОчиститьНастройкиКомпоновкиДанных(Настройки)
	
	Если ТипЗнч(Настройки) <> Тип("НастройкиКомпоновкиДанных") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого Параметр Из Настройки.ПараметрыДанных.Элементы Цикл
		Параметр.Значение = Неопределено;
		Параметр.Использование = ложь;
	КонецЦикла;
	
	Для каждого Параметр Из Настройки.ПараметрыВывода.Элементы Цикл
		Параметр.Использование = ложь;
	КонецЦикла;
	
	Настройки.Отбор.Элементы.Очистить();
	
КонецПроцедуры

// Копирует настройки компоновки данных
//
// Параметры:
//	НастройкиПриемник	- коллекция настроек КД, куда копируются настройки
//	НастройкиИсточник	- коллекция настроек КД, откуда копируются настройки
//
Процедура СкопироватьНастройкиКомпоновкиДанных(НастройкиПриемник, НастройкиИсточник) Экспорт
	
	Если НастройкиИсточник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НастройкиПриемник) = Тип("НастройкиКомпоновкиДанных") Тогда
		
		Для каждого Параметр Из НастройкиИсточник.ПараметрыДанных.Элементы Цикл
			ЗначениеПараметра = НастройкиПриемник.ПараметрыДанных.НайтиЗначениеПараметра(Параметр.Параметр);
			Если ЗначениеПараметра <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЗначениеПараметра, Параметр);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементОтбора из НастройкиИсточник.Отбор.Элементы Цикл
			Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
				ДобавитьЭлементВОтбор(НастройкиПриемник.Отбор, ЭлементОтбора);
			Иначе
				ДобавитьГруппуЭлементовВОтбор(НастройкиПриемник.Отбор, ЭлементОтбора);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЭлементВОтбор(ОтборПриемник, ЭлементОтбора, СтрокаПоиска = Неопределено, СтрокаЗамены = Неопределено)
	
	НовыйЭлемент = ОтборПриемник.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементОтбора);
	
	Если СтрокаПоиска <> Неопределено
		И СтрокаЗамены <> Неопределено Тогда
		СтрокаУсловия = Строка(НовыйЭлемент.ЛевоеЗначение);
		СтрокаУсловия = СтрЗаменить(СтрокаУсловия, СтрокаПоиска, СтрокаЗамены);
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(СтрокаУсловия);
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьГруппуЭлементовВОтбор(ОтборПриемник, ГруппаЭлементов, СтрокаПоиска = Неопределено, СтрокаЗамены = Неопределено)
	
	НоваяГруппа = ОтборПриемник.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НоваяГруппа, ГруппаЭлементов);
	
	Для Каждого ЭлементОтбора из ГруппаЭлементов.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ДобавитьЭлементВОтбор(НоваяГруппа, ЭлементОтбора, СтрокаПоиска, СтрокаЗамены);
		Иначе
			ДобавитьГруппуЭлементовВОтбор(НоваяГруппа, ЭлементОтбора, СтрокаПоиска, СтрокаЗамены);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Прочее

// Возвращает набор полей структуры проверки уникальности сообщений
//
Функция ИнициализироватьСтруктуруПроверкиУникальности()
	
	Возврат Новый Структура(
		"Уведомление,
		|Источник,
		|СпособДоставки,
		|Тема,
		|Текст,
		|Адресат,
		|КонтрольнаяСумма
		|");
	
КонецФункции

// Вычисляет и возвращает числовой вес версии подсистемы
//
Функция ВесВерсии(Знач Версия)
	
	РазрядыВерсии = РазложитьСтрокуВМассивПодстрок(Версия);
	
	Возврат 0
		+ Число(РазрядыВерсии[0]) * 1000000
		+ Число(РазрядыВерсии[1]) * 10000
		+ Число(РазрядыВерсии[2]) * 100
		+ Число(РазрядыВерсии[3]) * 1;
	
КонецФункции

// Разбивает строку на несколько строк по разделителю. Разделитель может иметь любую длину
//
// Параметры:
//  Строка                 - Строка - текст с разделителями;
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ;
//
// Возвращаемое значение: массив строк
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ".")
	
	Результат = Новый Массив;
	
	Позиция = Найти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если НЕ ПустаяСтрока(Подстрока) Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(Строка) Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтрокаИзМассиваПодстрок(Массив, Разделитель = ",", СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = "";
	
	Для Индекс = 0 По Массив.ВГраница() Цикл
		Подстрока = Массив[Индекс];
		
		Если СокращатьНепечатаемыеСимволы Тогда
			Подстрока = СокрЛП(Подстрока);
		КонецЕсли;
		
		Если ТипЗнч(Подстрока) <> Тип("Строка") Тогда
			Подстрока = Строка(Подстрока);
		КонецЕсли;
		
		Если Индекс > 0 Тогда
			Результат = Результат + Разделитель;
		КонецЕсли;
		
		Результат = Результат + Подстрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПодставитьПараметрыВСтроку(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено) Экспорт
	
	ИспользоватьАльтернативныйАлгоритм = 
		Найти(Параметр1, "%")
		Или Найти(Параметр2, "%")
		Или Найти(Параметр3, "%")
		Или Найти(Параметр4, "%")
		Или Найти(Параметр5, "%")
		Или Найти(Параметр6, "%")
		Или Найти(Параметр7, "%")
		Или Найти(Параметр8, "%")
		Или Найти(Параметр9, "%");
		
	Если ИспользоватьАльтернативныйАлгоритм Тогда
		СтрокаПодстановки = ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(СтрокаПодстановки, Параметр1,
			Параметр2, Параметр3, Параметр4, Параметр5, Параметр6, Параметр7, Параметр8, Параметр9);
	Иначе
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%1", Параметр1);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%2", Параметр2);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%3", Параметр3);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%4", Параметр4);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%5", Параметр5);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%6", Параметр6);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%7", Параметр7);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%8", Параметр8);
		СтрокаПодстановки = СтрЗаменить(СтрокаПодстановки, "%9", Параметр9);
	КонецЕсли;
	
	Возврат СтрокаПодстановки;
КонецФункции

Функция ПодставитьПараметрыВСтрокуАльтернативныйАлгоритм(Знач СтрокаПодстановки,
	Знач Параметр1, Знач Параметр2 = Неопределено, Знач Параметр3 = Неопределено,
	Знач Параметр4 = Неопределено, Знач Параметр5 = Неопределено, Знач Параметр6 = Неопределено,
	Знач Параметр7 = Неопределено, Знач Параметр8 = Неопределено, Знач Параметр9 = Неопределено)
	
	Результат = "";
	Позиция = Найти(СтрокаПодстановки, "%");
	Пока Позиция > 0 Цикл 
		Результат = Результат + Лев(СтрокаПодстановки, Позиция - 1);
		СимволПослеПроцента = Сред(СтрокаПодстановки, Позиция + 1, 1);
		ПодставляемыйПараметр = "";
		Если СимволПослеПроцента = "1" Тогда
			ПодставляемыйПараметр =  Параметр1;
		ИначеЕсли СимволПослеПроцента = "2" Тогда
			ПодставляемыйПараметр =  Параметр2;
		ИначеЕсли СимволПослеПроцента = "3" Тогда
			ПодставляемыйПараметр =  Параметр3;
		ИначеЕсли СимволПослеПроцента = "4" Тогда
			ПодставляемыйПараметр =  Параметр4;
		ИначеЕсли СимволПослеПроцента = "5" Тогда
			ПодставляемыйПараметр =  Параметр5;
		ИначеЕсли СимволПослеПроцента = "6" Тогда
			ПодставляемыйПараметр =  Параметр6;
		ИначеЕсли СимволПослеПроцента = "7" Тогда
			ПодставляемыйПараметр =  Параметр7
		ИначеЕсли СимволПослеПроцента = "8" Тогда
			ПодставляемыйПараметр =  Параметр8;
		ИначеЕсли СимволПослеПроцента = "9" Тогда
			ПодставляемыйПараметр =  Параметр9;
		КонецЕсли;
		Если ПодставляемыйПараметр = "" Тогда
			Результат = Результат + "%";
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 1);
		Иначе
			Результат = Результат + ПодставляемыйПараметр;
			СтрокаПодстановки = Сред(СтрокаПодстановки, Позиция + 2);
		КонецЕсли;
		Позиция = Найти(СтрокаПодстановки, "%");
	КонецЦикла;
	Результат = Результат + СтрокаПодстановки;
	
	Возврат Результат;
КонецФункции

// Получает расширение для имени переданного файла
//
// Параметры:
//    ИмяФайла - Строка - Имя файла
//
// Возвращаемое значение:
//    Строка - Расширение
//
Функция ИмяФайлаБезРасширения(Знач ИмяФайла) Экспорт
	
	ИмяФайлаБезРасширения = "";
	МассивСтрок = РазложитьСтрокуВМассивПодстрок(ИмяФайла, ".");
	Если МассивСтрок.Количество() > 1 Тогда
		ИмяФайлаБезРасширения = МассивСтрок[0];
	КонецЕсли;
	
	Возврат ИмяФайлаБезРасширения;
	
КонецФункции

// Возвращает структуру, содержащую значения реквизитов прочитанные из информационной базы
// по ссылке на объект.
// 
//  Если доступа к одному из реквизитов нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
// 
// Параметры:
//  Ссылка    - Ссылка на объект - элемент справочника, документ, ...
//
//  Реквизиты - Строка - имена реквизитов, перечисленные через запятую, в формате
//              требований к свойствам структуры.
//              Например, "Код, Наименование, Родитель".
//            - Структура, ФиксированнаяСтруктура - в качестве ключа передается
//              псевдоним поля для возвращаемой структуры с результатом, а в качестве
//              значения (опционально) фактическое имя поля в таблице.
//              Если значение не определено, то имя поля берется из ключа.
//            - Массив, ФиксированныйМассив - имена реквизитов в формате требований
//              к свойствам структуры.
//
// Возвращаемое значение:
//  Структура - содержит имена (ключи) и значения затребованных реквизитов.
//              Если строка затребованных реквизитов пуста, то возвращается пустая структура
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты) Экспорт
	
	Если ТипЗнч(Реквизиты) = Тип("Строка") Тогда
		Если ПустаяСтрока(Реквизиты) Тогда
			Возврат Новый Структура;
		КонецЕсли;
		
		СтруктураРеквизитов = Новый Структура(Реквизиты);
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Структура")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированнаяСтруктура") Тогда
		
		СтруктураРеквизитов = Реквизиты;
		
	ИначеЕсли ТипЗнч(Реквизиты) = Тип("Массив")
		ИЛИ ТипЗнч(Реквизиты) = Тип("ФиксированныйМассив") Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для каждого Реквизит Из Реквизиты Цикл
			СтруктураРеквизитов.Вставить(Реквизит);
		КонецЦикла;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстПолей = "";
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		
		ИмяПоля   = ?(ЗначениеЗаполнено(КлючИЗначение.Значение),
			СокрЛП(КлючИЗначение.Значение),
			СокрЛП(КлючИЗначение.Ключ));
		
		Псевдоним = СокрЛП(КлючИЗначение.Ключ);
		
		ТекстПолей  = ТекстПолей + ?(ПустаяСтрока(ТекстПолей), "", ",") + "
		|	" + ИмяПоля + " КАК " + Псевдоним;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|" + ТекстПолей + "
	|ИЗ
	|	" + Ссылка.Метаданные().ПолноеИмя() + " КАК ПсевдонимЗаданнойТаблицы
	|ГДЕ
	|	ПсевдонимЗаданнойТаблицы.Ссылка = &Ссылка
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура;
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		Результат.Вставить(КлючИЗначение.Ключ);
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;
	
КонецФункции

// Возвращает значение реквизита, прочитанного из информационной базы по ссылке на объект.
// 
//  Если доступа к реквизиту нет, возникнет исключение прав доступа.
//  Если необходимо зачитать реквизит независимо от прав текущего пользователя,
//  то следует использовать предварительный переход в привилегированный режим.
//
// Функция не предназначена для получения значений реквизитов пустых ссылок.
// 
// Параметры:
//  Ссылка       - ссылка на объект, - элемент справочника, документ, ...
//  ИмяРеквизита - Строка, например, "Код".
// 
// Возвращаемое значение:
//  Произвольный    - зависит от типа значения прочитанного реквизита.
// 
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита) Экспорт
	
	Результат = ЗначенияРеквизитовОбъекта(Ссылка, ИмяРеквизита);
	Возврат Результат[СтрЗаменить(ИмяРеквизита, ".", "")];
	
КонецФункции

// Определяет, является ли запущенная информационная база файловой
//
Функция ЭтоФайловаяИБ()
	
	Возврат Найти(Врег(СтрокаСоединенияИнформационнойБазы()), "FILE=") = 1;
	
КонецФункции

// Возвращает название доступной подсистемы напоминаний
//
Функция ПодсистемаНапоминаний()
	
	Если ЭтоКонфигурация("УПП") Или ЭтоКонфигурация("КА1") Тогда
		ВерсияУТ = "10УПП";
	ИначеЕсли ЭтоКонфигурация("УТ10") Тогда
		ВерсияУТ = "10УТ";
	ИначеЕсли ЭтоКонфигурация("УП") Или ЭтоКонфигурация("УТ11") Или ЭтоКонфигурация("УТ11CRM")
		Или ЭтоКонфигурация("КА2") Или ЭтоКонфигурация("Розница") Или ЭтоКонфигурация("ЗУП") Тогда
		ВерсияУТ = "11";
	Иначе
		ВерсияУТ = "";
	КонецЕсли;
	
	ВидНапоминаний = "";
	
	Если ВерсияУТ = "11" Тогда // есть поддержка БСП
		ВидНапоминаний = "БСП";
		
	ИначеЕсли ВерсияУТ = "10УПП" Тогда // поищем, вдруг есть CRM
		Если ЭтоКонфигурация("CRM") Тогда
			ВидНапоминаний = "CRM";
			
		Иначе // будем использовать документы "Событие"
			ВидНапоминаний = "События";
			
		КонецЕсли;
	ИначеЕсли ВерсияУТ = "10УТ" Тогда // поищем, вдруг есть CRM
		Если ЭтоКонфигурация("CRM") Тогда
			ВидНапоминаний = "CRM";
			
		Иначе // будем использовать документы "Задача"
			ВидНапоминаний = "Задачи";
			
		КонецЕсли;
	// поищем БСП
	ИначеЕсли Метаданные.РегистрыСведений.Найти("НапоминанияПользователя") <> Неопределено Тогда
			ВидНапоминаний = "БСП";
			
	// остаются задачи
	ИначеЕсли Метаданные.Задачи.Найти("ЗадачиПользователя") <> Неопределено Тогда
			ВидНапоминаний = "Задачи";
			
	КонецЕсли;
	
	Возврат ВидНапоминаний;
	
КонецФункции

// Возвращает номер текущей версии БСП
//
Функция ВерсияБСП()
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВерсииПодсистем.Версия
		|ИЗ
		|	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
		|ГДЕ
		|	ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы";
		
		Запрос.УстановитьПараметр("ИмяПодсистемы", "СтандартныеПодсистемы");
		ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
		Версия = "";
		Если ТаблицаЗначений.Количество() > 0 Тогда
			Версия = СокрЛП(ТаблицаЗначений[0].Версия);
		КонецЕсли;
		
		Возврат Версия;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Возвращает ссылку на общий модуль по имени
//
// Параметры:
//    Имя - Строка - имя общего модуля
//
// Возвращаемое значение:
//    ОбщийМодуль
//
Функция ОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение ПодставитьПараметрыВСтроку(НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Обработчики обновления

// 1.0.2

// Добавляет в настройки подсистемы строку соединения с рабочей ИБ, чтобы исключить отправку уведомлений в копиях базы
//
Процедура ДобавитьНастройкиСоединенияСРабочейБазой()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	НастройкиУведомленийМенеджер.СохранитьНастройку("СтрокаСоединенияРабочейБазы", ВРег(СтрокаСоединенияИнформационнойБазы()));
	
КонецПроцедуры

// 1.0.5

// Устанавливает у существующих уведомлений признак отправки по электронной почте
//
Процедура УстановитьСпособУведомленияПоЭлПочте()
	
	Выборка = Справочники.ПЛ_УведомленияОСобытиях.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.ЭлПочта = Истина;
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в настройки подсистемы параметры СМС
//
Процедура ДобавитьНастройкиСМС()
	
	НастройкиСМС = Новый Структура("ИмяОтправителяСМС", "");
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиСМС", НастройкиСМС);
	
КонецПроцедуры

// 1.0.6

// Создает преднастроенные события версии 1_0_6_3
//
Процедура СоздатьПреднастроенныеСобытия1_0_6_3()
	
	ВерсияПодсистемыУТ = ВерсияУТ();
	
	ГруппаПреднастроенные = Справочники.ПЛ_События.НайтиПоНаименованию(НСтр("ru = 'Преднастроенные'"), Истина);
	
	Если НЕ ЗначениеЗаполнено(ГруппаПреднастроенные)
		И (ВерсияПодсистемыУТ = "10" Или ВерсияПодсистемыУТ = "11") Тогда
		ГруппаПреднастроенные = Справочники.ПЛ_События.СоздатьГруппу();
		ГруппаПреднастроенные.Наименование = НСтр("ru = 'Преднастроенные'");
		ГруппаПреднастроенные.Записать();
		ГруппаПреднастроенные = ГруппаПреднастроенные.Ссылка;
	КонецЕсли;
	
	НаименованиеСобытия = "";
	Если ВерсияПодсистемыУТ = "10" Тогда
		НаименованиеСобытия = НСтр("ru = 'Оплата по заказу'");
	ИначеЕсли ВерсияПодсистемыУТ = "11" Тогда
		НаименованиеСобытия = НСтр("ru = 'Оплата по графику'");
	КонецЕсли;
	
	Ссылка = Справочники.ПЛ_События.НайтиПоНаименованию(НаименованиеСобытия, Истина);
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Попытка
			
			Если ВерсияПодсистемыУТ = "10" Тогда
				
				Объект = Справочники.ПЛ_События.ОплатаПоЗаказуУТ10(НаименованиеСобытия);
				Объект.Родитель = ГруппаПреднастроенные;
				Объект.Записать();
				
			ИначеЕсли ВерсияПодсистемыУТ = "11" Тогда
				
				Объект = Справочники.ПЛ_События.ОплатаПоГрафикуУТ11(НаименованиеСобытия);
				Объект.Родитель = ГруппаПреднастроенные;
				Объект.Записать();
				
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в настройки подсистемы признак использования SSL для учетной записи эл. почты
//
Процедура ДобавитьНастройкиSSL()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	
	НастройкиУчетнойЗаписи = НастройкиУведомленийМенеджер.ПолучитьНастройку("НастройкиУчетнойЗаписи");
	НастройкиУчетнойЗаписи.Вставить("ИспользоватьSSLSMTP", Истина);
	НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиУчетнойЗаписи", НастройкиУчетнойЗаписи);
	
КонецПроцедуры

// 1.1.1

// В СКД уведомлений добавляет вычисляемое поле ТекущийПользователь
//
Процедура ДобавитьПолеТекущийПользователь()
	
	ВыборкаУведомлений = Справочники.ПЛ_УведомленияОСобытиях.Выбрать();
	Пока ВыборкаУведомлений.Следующий() Цикл
		
		Если Не ВыборкаУведомлений.ЭтоГруппа Тогда
			
			Уведомление = ВыборкаУведомлений.ПолучитьОбъект();
			ИсточникСобытия = ЗначениеРеквизитаОбъекта(Уведомление.Событие, "ИсточникСобытия");
			Если ИсточникСобытия <> Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
				И ИсточникСобытия <> Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
				
				СхемаКомпоновки = Уведомление.СхемаШаблонаТекстовСообщения.Получить();
				Если СхемаКомпоновки <> Неопределено Тогда
					ДобавитьВКомпоновкуПолеТекущийПользователь(СхемаКомпоновки);
					Уведомление.СхемаШаблонаТекстовСообщения = Новый ХранилищеЗначения(СхемаКомпоновки);
					Уведомление.Записать();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Возможны только индивидуальные напоминания
//
Процедура УстановитьСпособОтдельноКаждомуДляНапоминаний()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПЛ_УведомленияОСобытиях КАК ДанныеСправочника
	|ГДЕ
	|	ДанныеСправочника.Напоминание
	|	И ДанныеСправочника.ДелениеПоАдресатам <> ЗНАЧЕНИЕ(Перечисление.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому)
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому;
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// 1.2.1

// Расширяет настройки СМС
//
Процедура РасширитьНастройкиСМС()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	
	НастройкиСМС = НастройкиУведомленийМенеджер.ПолучитьНастройку("НастройкиСМС");
	НастройкиСМС.Вставить("ПровайдерСМС");
	НастройкиСМС.Вставить("ЛогинСМС", "");
	НастройкиСМС.Вставить("ПарольСМС", "");
	НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиСМС", НастройкиСМС);
	
КонецПроцедуры

// Устанавливает в уведомлениях фильтрацию по адресатам
//
Процедура УстановитьФильтрПоАдресатам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПЛ_УведомленияОСобытиях КАК ДанныеСправочника
	|ГДЕ
	|	НЕ ДанныеСправочника.ФильтрПоАдресатам
	|	И ДанныеСправочника.ДелениеПоАдресатам = ЗНАЧЕНИЕ(Перечисление.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому)
	|	И ДанныеСправочника.ЭлПочта
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ФильтрПоАдресатам = Истина;
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// 2.0.1

// Добавляет в настройки подсистемы параметры почтовой рассылки
//
Процедура ДобавитьНастройкиПочтовойРассылки()
	
	НастройкиСервисаПочтовойРассылки = Новый Структура;
	НастройкиСервисаПочтовойРассылки.Вставить("СервисПочтовойРассылки", Неопределено);
	НастройкиСервисаПочтовойРассылки.Вставить("ЛогинПочтовойРассылки", "");
	НастройкиСервисаПочтовойРассылки.Вставить("ПарольПочтовойРассылки", "");
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	НастройкиУведомленийМенеджер.СохранитьНастройку("ПодключенСервисПочтовойРассылки", Ложь);
	НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиСервисаПочтовойРассылки", НастройкиСервисаПочтовойРассылки);
	
КонецПроцедуры

// Добавляет в настройки подсистемы сохрание почтовых и СМС сообщений
//
Процедура ДобавитьНастройкиСохраненияСообщений()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	
	НастройкиУведомленийМенеджер.СохранитьНастройку("СохранятьЭлектронныеПисьма", Ложь);
	
	НастройкиСМС = НастройкиУведомленийМенеджер.ПолучитьНастройку("НастройкиСМС");
	НастройкиСМС.Вставить("СохранятьСообщенияСМС", Ложь);
	НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиСМС", НастройкиСМС);
	
КонецПроцедуры

// Добавляет настройку сохранения текущей формы списка уведомлений
//
Процедура ДобавитьНастройкиОткрытияНовойФормыУведомлений()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	НастройкиУведомленийМенеджер.СохранитьНастройку("НоваяФормаУведомлений", Истина);
	
КонецПроцедуры

// Управление активностью отправки сообщений переностится в уведомления
//
Процедура ПеренестиФлагВключенияИзСобытийВУведомления()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.Событие.УдалитьАктивно КАК Статус
	|ИЗ
	|	Справочник.ПЛ_УведомленияОСобытиях КАК ДанныеСправочника
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Статус = 1;
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Теги "[" и "]" заменяет на "%%"
//
Процедура ЗаменитьТегиВШаблонах()
	
	Выборка = Справочники.ПЛ_УведомленияОСобытиях.Выбрать();
	Пока Выборка.Следующий() Цикл
		СправочникОбъект = Выборка.ПолучитьОбъект();
		СправочникОбъект.ТекстСообщения = СтрЗаменить(СправочникОбъект.ТекстСообщения, "[", "%%");
		СправочникОбъект.ТекстСообщения = СтрЗаменить(СправочникОбъект.ТекстСообщения, "]", "%%");
		СправочникОбъект.Наименование = СтрЗаменить(СправочникОбъект.Наименование, "[", "%%");
		СправочникОбъект.Наименование = СтрЗаменить(СправочникОбъект.Наименование, "]", "%%");
		СправочникОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Проверяет наличие настройки кода страны и добавляет настройку, если ее нет
//
Процедура ПроверитьНастройкиКодаСтраны()
	
	НастройкиУведомленийМенеджер = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения();
	
	НастройкиСМС = НастройкиУведомленийМенеджер.ПолучитьНастройку("НастройкиСМС");
	Если НастройкиСМС <> Неопределено И ТипЗнч(НастройкиСМС) = Тип("Структура") И Не НастройкиСМС.Свойство("ТелефонныйКодСтраны") Тогда
		НастройкиСМС.Вставить("ТелефонныйКодСтраны", "");
		НастройкиУведомленийМенеджер.СохранитьНастройку("НастройкиСМС", НастройкиСМС);
	КонецЕсли;
	
КонецПроцедуры

