
#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВопроса(ТекстВопроса, ОписаниеОповещения)

	ПараметрыФормыВопроса = Новый Структура("ТекстВопроса", ТекстВопроса);
	ФормаВопроса = ПолучитьФорму(ПолучитьПутьКОбработке() + "ФормаВопроса", ПараметрыФормыВопроса, ЭтаФорма);
	ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВопроса.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции
&НаСервере
Функция ПолучитьПутьКОбработке()	
	ПутьКФормам = ПолучитьОбъектОбработки().Метаданные().ПолноеИмя() + ".Форма.";	
	Возврат ПутьКФормам;
КонецФункции
&НаКлиенте
Функция ПолучитьОбщийМодульКлиента()
	Возврат ПолучитьФорму(ПолучитьПутьКОбработке() + "ОбщийМодульКлиент");	
КонецФункции

&НаСервере
Процедура ВывестиУведомлениеПользователю(Знач ТекстСообщенияПользователю)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	ПолучитьОбъектОбработки().ДобавитьВЖурнал(ТекстСообщенияПользователю, "Модуль формы");
КонецПроцедуры

#КонецОбласти

#Область КриптоПровайдер

&НаКлиенте
Функция ПодписатьДокументЭП(ИмяВременногоФайла, ПарольКСертификату)
	Возврат ПолучитьОбщийМодульКлиента().ПодписатьДокументЭП(КриптоПровайдер, Объект.ОтпечатокСертификата, ИмяВременногоФайла, ПарольКСертификату);
КонецФункции
&НаКлиенте
Функция ПроверитьПодписьДокумента(ЗначениеПодписи, Подпись)
	Возврат ПолучитьОбщийМодульКлиента().ПроверитьПодписьДокумента(КриптоПровайдер, Объект.ОтпечатокСертификата, ЗначениеПодписи, Подпись);
КонецФункции
&НаСервере
Функция ПолучитьСписокКриптоПровайдеровWindows()
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокКриптоПровайдеров();
КонецФункции
&НаКлиенте
Функция ПолучитьСписокСертификатов()
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСписокСертификатов(КриптоПровайдер);
КонецФункции
&НаКлиенте
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСертификатПоОтпечатку(КриптоПровайдер, Отпечаток);
КонецФункции
&НаКлиенте
Функция СформироватьИмяПоСертификату(Сертификат)
	Возврат ПолучитьОбщийМодульКлиента().СформироватьИмяПоСертификату(Сертификат);	
КонецФункции
&НаСервере
Функция ПолучитьСписокДоступныхСертификатов(МассивОтпечатков)
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокДоступныхСертификатов(МассивОтпечатков, Объект.HostAddress);
КонецФункции

#КонецОбласти




&НаСервере
Функция ВойтиНаСервере()
	
	Попытка
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ПараметрыВозврата = ОбработкаОбъект.АвторизацияПоЛогинуИПаролю(Объект.HostAddress, Объект.Login, Объект.Password);
		Если ПараметрыВозврата.ОшибкаАвторизации Тогда
			Возврат ПараметрыВозврата;
		КонецЕсли;
		ПараметрыВозврата = ОбработкаОбъект.ЗакончитьПроцессАвторизации(ПараметрыВозврата);
		
		Если ОбработкаОбъект.Организация.Пустая() Тогда
			
			ПараметрыВозврата.ТекстОшибки = "Не найдена организация в 1С " + ПараметрыВозврата.ИмяОрганизации + ", ИНН: " + ПараметрыВозврата.ИНН + ", ОГРН:" + ПараметрыВозврата.ОГРН;
			ПараметрыВозврата.ОшибкаАвторизации = Истина;
			ОбработкаОбъект.ЗаписатьЖурналВФайл();
			Возврат ПараметрыВозврата;
			
		Иначе			
			ПараметрыВозврата.Организация = ОбработкаОбъект.Организация;	
		КонецЕсли;
			
		
	Исключение
		ПараметрыВозврата = Новый Структура;
		ПараметрыВозврата.Вставить("ОшибкаАвторизации",Истина);
		ПараметрыВозврата.Вставить("ТекстОшибки", ОписаниеОшибки() );
		ПараметрыВозврата.Вставить("HostAddress", Объект.HostAddress);
		ПараметрыВозврата.Вставить("Login", Объект.Login);
		ОбработкаОбъект.ЗаписатьЖурналВФайл();
		Возврат ПараметрыВозврата;
				
	КонецПопытки;
	ОбработкаОбъект.ЗаписатьЖурналВФайл();	
	Возврат ПараметрыВозврата;
	
КонецФункции

&НаКлиенте
Процедура Войти(Команда)
	
	ПараметрыФормы = ВойтиНаСервере();
	
	Если ЗначениеЗаполнено(ПараметрыФормы.ТекстОшибки) Тогда
		ПоказатьОповещениеПользователя("Ошибка авторизации",,ПараметрыФормы.ТекстОшибки);
	КонецЕсли;
	Попытка
		ПараметрыФормы.Вставить("ПоследняяКоманда", ПоследняяКоманда);
		ПараметрыФормы.Вставить("ВерсияСервера", Объект.ВерсияСервера);
		Оповестить("ОкноАвторизацииНаСервисе",ПараметрыФормы);
	Исключение
	КонецПопытки;
	
	Если НЕ ПараметрыФормы.ОшибкаАвторизации Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Функция ВойтиПоСертификатуНаСервере(ДанныеДляАвторизации)
	Попытка
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ПараметрыВозврата = ОбработкаОбъект.АвторизацияПоСертификату(Объект.HostAddress, ДанныеДляАвторизации);
		Если ПараметрыВозврата.ОшибкаАвторизации Тогда
			ОбработкаОбъект.ЗаписатьЖурналВФайл();
			Возврат ПараметрыВозврата;
		КонецЕсли;
				
	Исключение
		ПараметрыВозврата = Новый Структура;
		ПараметрыВозврата.Вставить("ОшибкаАвторизации",Истина);
		ПараметрыВозврата.Вставить("ТекстОшибки", ОписаниеОшибки() );
		ПараметрыВозврата.Вставить("HostAddress", Объект.HostAddress);
		ПараметрыВозврата.Вставить("Login", Объект.Login);
		ОбработкаОбъект.ЗаписатьЖурналВФайл();
		Возврат ПараметрыВозврата;
				
	КонецПопытки;
	ОбработкаОбъект.ЗаписатьЖурналВФайл();	
	Возврат ПараметрыВозврата;

КонецФункции
&НаСервере
Функция ЗакончитьАвторизациюНаСервере(Знач ПараметрыВозврата)
	Попытка
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		ПараметрыВозврата = ОбработкаОбъект.ЗакончитьПроцессАвторизации(ПараметрыВозврата);
		ЗначениеВДанныеФормы(ОбработкаОбъект, Объект);
		Если ОбработкаОбъект.Организация = Неопределено ИЛИ ОбработкаОбъект.Организация.Пустая() Тогда
			
			ПараметрыВозврата.ТекстОшибки = "Не найдена организация в 1С " + ПараметрыВозврата.ИмяОрганизации 
											+ ", ИНН: " + ПараметрыВозврата.ИНН 
											+ ", КПП:" + ПараметрыВозврата.КПП
											+ ", ОГРН:" + ПараметрыВозврата.ОГРН;
			ПараметрыВозврата.ОшибкаАвторизации = Истина;
			ОбработкаОбъект.ЗаписатьЖурналВФайл();
			Возврат ПараметрыВозврата;
			
		Иначе			
			ПараметрыВозврата.Организация = ОбработкаОбъект.Организация;
		КонецЕсли;
		
	Исключение
		ПараметрыВозврата = Новый Структура;
		ПараметрыВозврата.Вставить("ОшибкаАвторизации",Истина);
		ПараметрыВозврата.Вставить("ТекстОшибки", ОписаниеОшибки() );
		ПараметрыВозврата.Вставить("HostAddress", Объект.HostAddress);
		ПараметрыВозврата.Вставить("Login", Объект.Login);
		ОбработкаОбъект.ЗаписатьЖурналВФайл();
		Возврат ПараметрыВозврата;	
	КонецПопытки;
	ОбработкаОбъект.ЗаписатьЖурналВФайл();	
	Возврат ПараметрыВозврата;

	
КонецФункции

&НаКлиенте
Процедура ВойтиПоСертификату(Команда)
	Если СертификатПользователя = Неопределено Тогда
		Сообщить("Не выбран сертификат!");
		Возврат;
	КонецЕсли;		
	ОписаниеОповещения = Новый ОписаниеОповещения("ВойтиПоСертификатуЗавершение", ЭтаФорма);
	ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ВойтиПоСертификатуЗавершение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	ПарольКСертификату = СтрокаПароля;
	Объект.СессионныйПароль = ПарольКСертификату;
	
	ДанныеДляАвторизации = Новый Структура;
	ДанныеДляАвторизации.Вставить("thumbprint", СтрЗаменить(Строка(СертификатПользователя), " ", "") );
	СтрокаСерийника = СтрЗаменить(Строка(ПолучитьСертификатПоОтпечатку(СертификатПользователя).СерийныйНомер), " ", ""); 
	ДанныеДляАвторизации.Вставить("serialNumber", СтрокаСерийника );
	ПараметрыФормы = ВойтиПоСертификатуНаСервере(ДанныеДляАвторизации);
	Если ПараметрыФормы.ОшибкаАвторизации И Найти(ПараметрыФормы.ТекстОшибки, "151") Тогда //пробуем закодировать в dec
		ДанныеДляАвторизации.Вставить("serialNumber", HexToDec(СтрокаСерийника) );
		ПараметрыФормы = ВойтиПоСертификатуНаСервере(ДанныеДляАвторизации);
	КонецЕсли;
	Если ПараметрыФормы.Свойство("ЗашифрованныйТокен") Тогда
		Объект.ТокенАвторизации = РасшифроватьТокен(ПараметрыФормы);
		ПараметрыФормы = ЗакончитьАвторизациюНаСервере(ПараметрыФормы);
	КонецЕсли;
	ПараметрыФормы.Вставить("ОтпечатокСертификата", СертификатПользователя);
	ПараметрыФормы.Вставить("КриптоПровайдер", КриптоПровайдер);
	
	ПараметрыФормы.Вставить("HostAddress", Объект.HostAddress);
	ПараметрыФормы.Вставить("Login", "");
	ПараметрыФормы.Вставить("ВерсияСервера", Объект.ВерсияСервера);
	ПараметрыФормы.Вставить("СессионныйПароль", Объект.СессионныйПароль);

	
	Если ЗначениеЗаполнено(ПараметрыФормы.ТекстОшибки) Тогда
		ПоказатьОповещениеПользователя("Ошибка авторизации",,ПараметрыФормы.ТекстОшибки);
	КонецЕсли;
	Попытка
		ПараметрыФормы.Вставить("ПоследняяКоманда", ПоследняяКоманда);
		Оповестить("ОкноАвторизацииНаСервисе",ПараметрыФормы);
	Исключение
	КонецПопытки;
	
	Если НЕ ПараметрыФормы.ОшибкаАвторизации Тогда
		ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
		
	ПараметрыФормы = Новый Структура();	
	ПараметрыФормы.Вставить("ОшибкаАвторизации", Истина);
	ПараметрыФормы.Вставить("HostAddress", Объект.HostAddress);
	ПараметрыФормы.Вставить("Login", Объект.Login);
	ПараметрыФормы.Вставить("ВерсияСервера", Объект.ВерсияСервера);
	
	Оповестить("ОкноАвторизацииНаСервисе", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	Объект.HostAddress 	= Параметры.HostAddress;
	Объект.Login 		= Параметры.Login;
	Объект.Password 	= Параметры.Password;
	ПоследняяКоманда	= Параметры.ПоследняяКоманда;
	Объект.ВерсияСервера = Параметры.ВерсияСервера;
	СписокПровайдеров = ПолучитьСписокКриптоПровайдеровWindows();
	Для Каждого Провайдер Из СписокПровайдеров Цикл
		Элементы.КриптоПровайдер.СписокВыбора.Добавить(Провайдер.Значение, Провайдер.Представление);
	КонецЦикла;
	Если Параметры.Свойство("КриптоПровайдер") Тогда
		КриптоПровайдер 	= Параметры.КриптоПровайдер;
	Иначе
		КриптоПровайдер = 75;
	КонецЕсли;
	Если Объект.ВерсияСервера = 4 Тогда
		Элементы.ГруппаАвторизацияПоСертификату.Доступность = Ложь;	
	Иначе
		Элементы.ГруппаАвторизацияПоСертификату.Доступность = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСпособыАвторизацииПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя = "ГруппаАвторизацияПоСертификату" Тогда
		Элементы.ВойтиПоСертификату.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.Войти.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Белов ОбновитьСписокСертификатов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСертификатов(Команда = Неопределено)
	Элементы.Сертификат.СписокВыбора.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.HostAddress) Тогда
		Возврат;
	КонецЕсли;
		СписокСертификатов = ПолучитьСписокСертификатов();
		МассивОтпечатков = Новый Массив;
		Для Каждого Серт Из СписокСертификатов Цикл
			МассивОтпечатков.Добавить(СтрЗаменить(Строка(Серт.Значение), " ", "") );
		КонецЦикла;
		СписокДоступныхОтпечатков = ПолучитьСписокДоступныхСертификатов(МассивОтпечатков);
		Если СписокДоступныхОтпечатков = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Для Каждого Серт Из СписокСертификатов Цикл
			Если СписокДоступныхОтпечатков.Найти(СтрЗаменить(Строка(Серт.Значение), " ", "") ) <> Неопределено Тогда
				Элементы.Сертификат.СписокВыбора.Добавить(Серт.Значение, СформироватьИмяПоСертификату(Серт.Представление) );
			КонецЕсли;
		КонецЦикла;
		Если Элементы.Сертификат.СписокВыбора.Количество() = 0 Тогда
			Элементы.Сертификат.Доступность = Ложь;
			Элементы.ОтсутствуютДокументы.Видимость = Истина;
			Элементы.ВойтиПоСертификату.Доступность = Ложь;
		Иначе
			Элементы.Сертификат.Доступность = Истина;
			Элементы.ОтсутствуютДокументы.Видимость = Ложь;
			Элементы.ВойтиПоСертификату.Доступность = Истина;
		КонецЕсли;

	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПодписатьМагическуюФразу()
	//Возврат CreateSign(СертификатПользователя, "please give me a sign");
	#Если НЕ ВебКлиент Тогда
		СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
		Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	
		Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольКСертификату;
		Менеджер.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.ВключатьСертификатСубъекта;
		Если СертификатПользователя = Неопределено Тогда
			Сообщить("Не выбран сертификат!");
			Возврат "";
		КонецЕсли;
		Попытка
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.ДобавитьСтроку("please give me a sign");
			ТекстовыйДокумент.Записать(ИмяВременногоФайла);
			ДвоичныеДанныеПодписи = Менеджер.Подписать(ИмяВременногоФайла, ПолучитьСертификатПоОтпечатку(СертификатПользователя) );
			УдалитьФайлы(ИмяВременногоФайла);
		Исключение
			УдалитьФайлы(ИмяВременногоФайла);
			Сообщить(ИнформацияОбОшибке().Причина.Описание );
			Возврат "";
		КонецПопытки;
		Возврат Base64Строка(ДвоичныеДанныеПодписи);
	#Иначе
		Возврат "";
	#КонецЕсли	
КонецФункции

&НаКлиенте
Функция РасшифроватьТокен(ПараметрыФормы)
	#Если НЕ ВебКлиент Тогда
    СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
	Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольКСертификату;
	
	Если СертификатПользователя = Неопределено Тогда
		Сообщить("Не выбран сертификат!");
		Возврат "";
	КонецЕсли;
	Попытка
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
		ДвоичныеДанныеТокена = Base64Значение(ПараметрыФормы.ЗашифрованныйТокен);
		ДанныеТокена = Менеджер.Расшифровать(ДвоичныеДанныеТокена);
		ДанныеТокена.Записать(ИмяВременногоФайла);
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
		ДанныеТокена = ТекстовыйДокумент.ПолучитьТекст();
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		УдалитьФайлы(ИмяВременногоФайла);
		Сообщить(ИнформацияОбОшибке().Причина.Описание );
		Возврат "";
	КонецПопытки;
	Возврат ДанныеТокена;
	#КонецЕсли
КонецФункции


// Функция переводит шестнадцатеричное число в десятичное
// Параметры: _Hex     - Строка              - Шестнадцатеричное число
// Возвращаемое значение: Строка   - Десятичное число
//
Function HexToDec(Знач _Hex)
	Base = 16;
	_Hex = TrimAll(_Hex);
	GreatPow = StrLen(_Hex) - 1;
	Result = 0;
	symbolCount = 1;
	While GreatPow >=0 Do
		_HexSymbol = Mid(_Hex, symbolCount, 1);
		HexValue = Find("0123456789ABCDEF", _HexSymbol) - 1;
		Result = Result + HexValue * POW(Base, GreatPow);
		GreatPow = GreatPow - 1;
		symbolCount = symbolCount + 1;
	EndDo;   
	Return StrReplace(String(Result), Chars.NBSp, "");
EndFunction // HexToDec()   

&НаКлиенте
Процедура ВерсияСервераПриИзменении(Элемент)
	Если Объект.ВерсияСервера = 4 Тогда
		Элементы.ГруппаАвторизацияПоСертификату.Доступность = Ложь;	
	Иначе
		Элементы.ГруппаАвторизацияПоСертификату.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРегистрации(Команда = Неопределено)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("HostAddress", Объект.HostAddress);
	ПараметрыФормы.Вставить("КриптоПровайдер", КриптоПровайдер);
	ПараметрыФормы.Вставить("ВерсияСервера", Объект.ВерсияСервера);
	ОткрытьФорму(ПолучитьПутьКОбработке() + "ФормаРегистрации",ПараметрыФормы,ЭтаФорма,Истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
КонецПроцедуры

&НаКлиенте
Процедура HostAddressПриИзменении(Элемент)
	Если Прав(Объект.HostAddress, 1) <> "/" Тогда
		Объект.HostAddress = Объект.HostAddress + "/";
	КонецЕсли;
КонецПроцедуры
