Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

Процедура КонтрольОстатков(ДокументОбъект, Склад, Отказ, Заголовок) Экспорт
	
	//+Шульман А. 24.09.2025 #UT10-5433
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.КодМаркировки КАК ШтрихкодНоменклатуры
		|ПОМЕСТИТЬ ВТ_КодыДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КодыДокумента.ШтрихкодНоменклатуры,
		|	ВТ_КодыДокумента.ШтрихкодНоменклатуры.КодМаркировки КАК КодМаркировки,
		|	СУММА(ДвижениеКодовМаркировкиСУЗОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ДвижениеКодовМаркировкиСУЗОстатки.СобраноОстаток) КАК СобраноОстаток,
		|	СУММА(ДвижениеКодовМаркировкиСУЗОстатки.КСборкеОстаток) КАК КСборкеОстаток
		|ИЗ
		|	ВТ_КодыДокумента КАК ВТ_КодыДокумента
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеКодовМаркировкиСУЗ.Остатки(
		|				,
		|				(ВЫРАЗИТЬ(Склад КАК Справочник.Склады)) = &Склад
		|					ИЛИ Склад ССЫЛКА Документ.СборкаЗаказовПокупателя) КАК ДвижениеКодовМаркировкиСУЗОстатки
		|		ПО ВТ_КодыДокумента.ШтрихкодНоменклатуры = ДвижениеКодовМаркировкиСУЗОстатки.ШтрихкодНоменклатуры
		|ГДЕ
		|	(ДвижениеКодовМаркировкиСУЗОстатки.КоличествоОстаток <= 0
		|			ИЛИ ДвижениеКодовМаркировкиСУЗОстатки.КСборкеОстаток > 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КодыДокумента.ШтрихкодНоменклатуры";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);    
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.РеализацияТоваровУслуг", "Документ." + ДокументОбъект.Метаданные().Имя);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		Если Выборка.КоличествоОстаток <= 0 Тогда  
			
			Сообщить(Заголовок + ": код маркировки " + Выборка.КодМаркировки + " отсутствует на складе");
		    Отказ = Истина;
			
		КонецЕсли;
		
		Если Выборка.КСборкеОстаток > 0 Тогда  
			
			Сообщить(Заголовок + ": код маркировки " + Выборка.КодМаркировки + " находится на сборке заказа");
		    Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	//-Шульман А. 24.09.2025 #UT10-5433
	
КонецПроцедуры
