
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//+Сёмин Р.И. 20.04.2026 #UT10-5815
	УстановитьТНСвойствоТоварПередан();
	//-Сёмин Р.И. 20.04.2026 #UT10-5815
	
КонецПроцедуры

Процедура УстановитьТНСвойствоТоварПередан()
	
	//+Сёмин Р.И. 20.04.2026 #UT10-5815
	Если ТипЗнч(Реализация) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		
		МСКWEB.УстановитьЗначениеДопСвойства(
			Реализация,
			ПланыВидовХарактеристик.СвойстваОбъектов.ТоварПередан,
			Истина
		);
		
	КонецЕсли;
	//-Сёмин Р.И. 20.04.2026 #UT10-5815
	
КонецПроцедуры
