
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//Боев Антон
	Попытка
		Если ЗначениеЗаполнено(ЭтотОбъект.Отбор.Источник.Значение) И 
			ЭтотОбъект.Отбор.Источник.Значение = ПараметрыСеанса.УдаляемыйДокумент Тогда
			нзЭЧ = РегистрыСведений.ЭлектронныеЧекиККМ.СоздатьНаборЗаписей();
			нзЭЧ.Отбор.Источник.Значение = ЭтотОбъект.Отбор.Источник.Значение;
			нзЭЧ.Отбор.Источник.Использование = Истина;
			нзЭЧ.Прочитать();
			ЭтотОбъект.ДополнительныеСвойства.Вставить("нзЭЧ", нзЭЧ);
		КонецЕсли;
	Исключение
	КонецПопытки;
	//---
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	нзЭЧ = Неопределено;
	//Боев Антон
	Попытка
		Если ЭтотОбъект.ДополнительныеСвойства.Свойство("нзЭЧ", нзЭЧ) Тогда
			ПараметрыСеанса.УдаляемыйДокумент = Неопределено;
			нзЭЧ.Записать();
		КонецЕсли;
	Исключение
	КонецПопытки;
	//---
КонецПроцедуры
