
Функция PM_PAYMENTS_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_PAYMENTS_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_PAYMENTS_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PM_PAYMENTS_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_PAYMENTS_FOR_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings));
	
	Результат = МСКWEB.PM_PAYMENTS_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_PAYMENTS_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_PAYMENTS_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции
