
&НаСервере
Процедура КодМаркировкиСоЗнакамиПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектЭлемента = Объект.Ссылка.ПолучитьОбъект();
	ОбъектЭлемента.ПолныйКодМаркировки = Новый ХранилищеЗначения(КодМаркировкиСоЗнаками);

КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиСоЗнакамиПриИзменении(Элемент)
	КодМаркировкиСоЗнакамиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика 
	Попытка
		КодМаркировкиСоЗнаками = Объект.Ссылка.ПолныйКодМаркировки.Получить();
	Исключение 	
	Конецпопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 

	Попытка
		
		ПромКодМаркировкиСоЗнаками = СокрЛП(Объект.Ссылка.ПолныйКодМаркировки.Получить()); 
		КодМаркировкиСоЗнаками     = СтрЗаменить(ПромКодМаркировкиСоЗнаками , Символ(29) , "<GS>");
		
	Исключение		
	Конецпопытки;
//   ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика                                                 
	
	ПромКодМаркировкиСоЗнаками = СтрЗаменить(КодМаркировкиСоЗнаками  , "<GS>" , Символ(29));
	ТекущийОбъект.ПолныйКодМаркировки = Новый ХранилищеЗначения(ПромКодМаркировкиСоЗнаками);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда) 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
	МассивШК  = Новый Массив;
	ПолныйШтрихКод = Объект.Ссылка.ПолныйКодМаркировки.Получить(); 
	МассивШК.Добавить(?(ЗначениеЗаполнено(ПолныйШтрихКод),ПолныйШтрихКод,Объект.Ссылка.КодМаркировки));
	Справочники.ШтрихкодыНоменклатуры.ПечатьЭтикеткиМаркировки(МассивШК,"",Ложь); 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
КонецПроцедуры
