
&НаСервере
Процедура КодМаркировкиСоЗнакамиПриИзмененииНаСервере()
	// Вставить содержимое обработчика.  
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектЭлемента = Объект.Ссылка.ПолучитьОбъект();
	ОбъектЭлемента.ПолныйКодМаркировки = Новый ХранилищеЗначения(КодМаркировкиСоЗнаками);

КонецПроцедуры

&НаКлиенте
Процедура КодМаркировкиСоЗнакамиПриИзменении(Элемент)
	КодМаркировкиСоЗнакамиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Попытка
		КодМаркировкиСоЗнаками = Объект.Ссылка.ПолныйКодМаркировки.Получить();
	Исключение 	
	Конецпопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 

	Попытка
		
		ПромКодМаркировкиСоЗнаками = СокрЛП(Объект.Ссылка.ПолныйКодМаркировки.Получить()); 
		КодМаркировкиСоЗнаками     = СтрЗаменить(ПромКодМаркировкиСоЗнаками , Символ(29) , "<GS>");
		
	Исключение		
	Конецпопытки;
	
	//ПриОткрытииНаСервере();
	
	//+Сёмин Р.И. 22.09.2026 #UT10-6057
	УстановитьВидимостьЭлементов();
	//-Сёмин Р.И. 22.09.2026 #UT10-6057

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПромКодМаркировкиСоЗнаками = СтрЗаменить(КодМаркировкиСоЗнаками  , "<GS>" , Символ(29));
	ТекущийОбъект.ПолныйКодМаркировки = Новый ХранилищеЗначения(ПромКодМаркировкиСоЗнаками);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(Команда) 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
	МассивШК  = Новый Массив;
	ПолныйШтрихКод = Объект.Ссылка.ПолныйКодМаркировки.Получить(); 
	МассивШК.Добавить(?(ЗначениеЗаполнено(ПолныйШтрихКод),ПолныйШтрихКод,Объект.Ссылка.КодМаркировки));
	Справочники.ШтрихкодыНоменклатуры.ПечатьЭтикеткиМаркировки(МассивШК,"",Ложь); 
	//+Кабанов А.В. 31.07.2025 # UT10-5345
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементов() 

	//+Сёмин Р.И. 22.09.2026 #UT10-6057
	ТоварнаяГруппаЧЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Номенклатура, "ТоварнаяГруппаЧестногоЗнака");
	
	Если ЗначениеЗаполнено(ТоварнаяГруппаЧЗ) Тогда
		Элементы.МинимальнаяЕдиницаПотребления.Видимость = ТоварнаяГруппаЧЗ.ПеременныеХарактеристики;
	КонецЕсли;
	//-Сёмин Р.И. 22.09.2026 #UT10-6057

КонецПроцедуры