
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	УстановитьДоступность(); 
	
КонецПроцедуры

&НаСервере
Процедура СоздатьТРННаСервере()
		
	Документы.ЗаказЗаявка.СоздатьТРНПоЗаявке(Объект.Ссылка);	

КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВопросаСозданияТРН(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СоздатьТРННаСервере();	
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьТРН(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Сообщить("Сначала запишите документ");
		Возврат;
		
	КонецЕсли;      
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВопросаСозданияТРН", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите создать документы ТРН?",РежимДиалогаВопрос.ДаНет, 60); 
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненностиДокумента(Команда)
	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Объект.Ссылка);
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокКонтрагентовГрузоотправителей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИДбазы <> """"";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокОтбора = Новый СписокЗначений;          
	СписокОтбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокОтбора;
		
КонецФункции  

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  

	Если ТипЗнч(Объект.Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
				
		ФормаВыбора = Справочники.Контрагенты.ПолучитьФормуВыбора(); 
		ФормаВыбора.РежимВыбора = Истина; 
		
		ФормаВыбора.СправочникСписок.Отбор.ИДБазы.ВидСравнения  = ВидСравнения.НеРавно;
		ФормаВыбора.СправочникСписок.Отбор.ИДБазы.Значение      = "";
		ФормаВыбора.СправочникСписок.Отбор.ИДБазы.Использование = Истина;    
		
		ВыбЗначение = ФормаВыбора.ОткрытьМодально();		
		
		Если ЗначениеЗаполнено(ВыбЗначение) Тогда
			Объект.Организация = ВыбЗначение;	
		КонецЕсли; 
		
	ИначеЕсли ТипЗнч(Объект.Организация) = Тип("СправочникСсылка.Организации") Тогда
		
		ФормаВыбора = Справочники.Организации.ПолучитьФормуВыбора(); 
		ФормаВыбора.РежимВыбора = Истина; 
		
		ВыбЗначение = ФормаВыбора.ОткрытьМодально();		
		
		Если ЗначениеЗаполнено(ВыбЗначение) Тогда
			Объект.Организация = ВыбЗначение;	
		КонецЕсли;   
		
	Иначе 		
		
		Список = Новый СписокЗначений;
		Список.Добавить("Организации");
		Список.Добавить("Контрагенты");   
		
		Вид = ВыбратьИзМеню(Список);
		
		Если Вид.Значение = "Организации" Тогда
			Объект.Организация = Справочники.Организации.ПустаяСсылка();
		ИначеЕсли Вид.Значение = "Контрагенты" Тогда
			Объект.Организация = Справочники.Контрагенты.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ЗаданиеНаДоставкуПриИзменении(Элемент)      
	
	УстановитьВидимость();   
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаСтаницы.Видимость = Не ЗначениеЗаполнено(Объект.ЗаданиеНаДоставку)
	
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьДоступность()
	
	Если Не ЗначениеЗаполнено(Объект.ЗаданиеНаДоставку) Тогда
		Элементы.ТелефонКонтрагента.ТолькоПросмотр = ЗначениеЗаполнено(Объект.ТелефонКонтрагента) И ЗначениеЗаполнено(ПолучитьТелефонПоОбъекту(Объект.Контрагент));
	КонецЕсли;                                                           
	
КонецПроцедуры                 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ЗаданиеНаДоставку) 
		И ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		Тел = ПолучитьТелефонПоОбъекту(Объект.Контрагент);
		
		Если ЗначениеЗаполнено(Тел) Тогда
			Объект.ТелефонКонтрагента = Тел;	
		КонецЕсли;
		
		УстановитьДоступность();  
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТелефонПоОбъекту(ОбъектПолучения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Объект = &Объект";    	
	
	Запрос.УстановитьПараметр("Объект", ОбъектПолучения); 
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон); 
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;              
	
	Возврат "";
		
КонецФункции

&НаКлиенте
Процедура ГрузополучателиКонтрагентНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.Контрагенты.ПолучитьФормуВыбора(); 
	ФормаВыбора.РежимВыбора = Истина; 
	
	//ФормаВыбора.СправочникСписок.Отбор.ИНН.ВидСравнения  = ВидСравнения.Равно;
	//ФормаВыбора.СправочникСписок.Отбор.ИНН.Значение      = "";
	//ФормаВыбора.СправочникСписок.Отбор.ИНН.Использование = Истина; 
	
	ВыбЗначение = ФормаВыбора.ОткрытьМодально();		
	
	Если ЗначениеЗаполнено(ВыбЗначение) Тогда
		Организация = ВыбЗначение;	
	КонецЕсли; 
	
КонецПроцедуры      

&НаСервере
Функция ПолучитьСписокКонтрагентовВХолдинге()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Код
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.)
	|			И Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка";
		
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокОтбора = Новый СписокЗначений;          
	СписокОтбора.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Код"));
	
	Возврат СписокОтбора;
		
КонецФункции  


