#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Перем Компонента;
Перем КлючПотребителя;

////////////////////////////////////////////////////////////////////////
//

// Создает очередь и привязывает ее к очереди с заданным именем.
//
Процедура ПодписатьсяНаОчередь(Знач ИмяОчереди) Экспорт

	Компонента = ОчередьСообщений.ПолучитьЭкземплярКомпоненты();
	КлючПотребителя = Компонента.НачатьЧтение(ИмяОчереди, СтрокаСоединенияИнформационнойБазы(), Ложь);

КонецПроцедуры // ПодписатьсяНаОчередь()

// Получает одно сообщение из очереди
Функция ПолучитьСообщение(Данные, Знач Таймаут = -1, MessageID = "",   
    //+Шульман А. 21.11.2024 #UT10-4912 
	СвойстваСообщения = "")        
    //-Шульман А. 21.11.2024 #UT10-4912 
	Экспорт
	
	//+Шульман А. 21.11.2024 #UT10-4912 
	//Возврат Компонента.ПолучитьСообщение(КлючПотребителя, Данные, Таймаут, MessageID);
	Возврат Компонента.ПолучитьСообщение(КлючПотребителя, Данные, Таймаут, MessageID, СвойстваСообщения);
	//-Шульман А. 21.11.2024 #UT10-4912 

КонецФункции // ПолучитьСообщение()


// Сообщает серверу очередей, что обработка сообщения закончена 
// и его можно удалить из очереди.
//
Процедура СообщениеОбработано() Экспорт

	Компонента.ПодтвердитьСообщение();
	
КонецПроцедуры // СообщениеОбработано()

// Сообщает серверу очередей, что сообщение ошибочно и его надо удалить.
//
Процедура ОтклонитьСообщение(ПоставитьВОчередь = Ложь) Экспорт

	Компонента.ОтклонитьСообщение(ПоставитьВОчередь);

КонецПроцедуры

#КонецЕсли