
Функция PM_GET_ZP_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_GET_ZP_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_ZP_PORTAL");
		
	Результат = МСКWEB.PM_GET_ZP_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_GET_ZP_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_ZP_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции
