
Функция ПрименимоКОбъекту(СсылкаНаОбъект) Экспорт
	
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		ТипОбъекта = "Справочники";
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(СсылкаНаОбъект)) Тогда
		ТипОбъекта = "Документы";
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ИмяОбъекта = СсылкаНаОбъект.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыСВнешнимФайловымХранением.Использовать,
	|	ОбъектыСВнешнимФайловымХранением.Код
	|ИЗ
	|	Справочник.ОбъектыСВнешнимФайловымХранением КАК ОбъектыСВнешнимФайловымХранением
	|ГДЕ
	|	ОбъектыСВнешнимФайловымХранением.ТипОбъекта = &ТипОбъекта
	|	И ОбъектыСВнешнимФайловымХранением.ИмяОбъекта = &ИмяОбъекта";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() > 0  Тогда
		Возврат РезультатЗапроса.Использовать;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
	
КонецФункции