Функция ПолучитьПарноеЗначениеПеречисленияУТ10(Действие) Экспорт
	
	//+Макрушин Е. 11.02.2026 #UT10-5665
	//при перегрузке актов о расхождении обратно из УТ10 в УТ10 значение перечисления ВариантыДействийПоРасхождениямВАктеПослеОтгрузки 
	//приводится к ВариантыДействийПоРасхождениямВАктеПослеПриемки, т.к. на стороне УТ10 только ВариантыДействийПоРасхождениямВАктеПослеПриемки
	
	Результат = "";
		
	//недостача	
	Если Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется Тогда
		Результат = "ОформитьНедостачу";
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.НедостачаНеПризнана Тогда
		Результат = "НедостачаНеПризнана";
	//излишек	
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного Тогда
		Результат = "ОформитьПерепоставленное";
	ИначеЕсли Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПерепоставленноеДарится Тогда
		Результат = "ПерепоставленноеДарится";
	КонецЕсли;
		
	Возврат Результат;
	//-Макрушин Е. 11.02.2026 #UT10-5665
	
КонецФункции