
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ПроверитьПодключение(Сервис, Логин, Пароль = "") Экспорт
	
	Если Сервис = Перечисления.ПЛ_СервисыПочтовойРассылки.Sendsay Тогда
		
		Результат = ОткрытьСессию(Логин, Пароль);
		
		Соединение = Результат.Соединение;
		Сессия = Результат.Сессия;
		
		Если Сессия <> Неопределено Тогда
			ЗакрытьСессию(Соединение, Сессия);
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли Сервис = Перечисления.ПЛ_СервисыПочтовойРассылки.UniSender Тогда
		
		Соединение = Неопределено;
		
		Результат = ПолучитьСпискиРассылок(Соединение, Логин);
		Если Результат <> Неопределено Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОтправитьСообщения(Сообщения) Экспорт
	
	Настройки = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки().НастройкиСервисаПочтовойРассылки;
	
	Результат = Неопределено;
	
	Если Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Sendsay Тогда
		Результат = ОтправитьСообщенияСендсей(Сообщения, Настройки);
		
	ИначеЕсли Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.UniSender Тогда
		Результат = ОтправитьСообщенияУнисендер(Сообщения, Настройки);
		
	ИначеЕсли Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Mailchimp Тогда
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭкспортироватьПодписчиков(ПодписчикиОбъект, Адресаты) Экспорт
	
	Настройки = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки().НастройкиСервисаПочтовойРассылки;
	
	Результат = Неопределено;
	
	Если Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Sendsay Тогда
		Результат = ЭкспортироватьПодписчиковСендсей(ПодписчикиОбъект, Адресаты, Настройки);
		
	ИначеЕсли Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.UniSender Тогда
		Результат = ЭкспортироватьПодписчиковУнисендер(Адресаты, Неопределено, Настройки.ЛогинПочтовойРассылки);
		
	ИначеЕсли Настройки.СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.Mailchimp Тогда
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Запросы Sendsay

Функция ОтправитьСообщенияСендсей(Сообщения, Настройки)
	
	Результат = Новый Структура("ОтправленныеСообщения, ОписаниеОшибки", Новый Массив, "");
	
	Логин = Настройки.ЛогинПочтовойРассылки;
	Пароль = Настройки.ПарольПочтовойРассылки;
	
	Ответ = ОткрытьСессию(Логин, Пароль);
	
	Соединение = Ответ.Соединение;
	Сессия = Ответ.Сессия;
	
	Если Сессия = Неопределено Тогда
		Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось установить соединение с сервером Sendsay.'");
		Возврат Результат;
	КонецЕсли;
		
	Для каждого Сообщение Из Сообщения Цикл
		
		// Создание файлов - картинок
		КаталогУведомления = "/image/" + ИдентификаторПодписчика(Строка(Сообщение.Уведомление.УникальныйИдентификатор()));
		
		Для каждого СтрокаВложения Из Сообщение.ТаблицаВложений Цикл
			ПутьКФайлу = КаталогУведомления + "/" + СтрокаВложения.Имя;
			
			ТелоЗапроса = ЗапросСуществованиеФайла(ПутьКФайлу);
			Ответ = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
			
			Если Ответ <> Неопределено Тогда
			
				НайденныйФайл = Ответ.Получить("file");
				Если НайденныйФайл = Неопределено Тогда
					
					ТелоЗапроса = ЗапросСозданиеФайла(ПутьКФайлу, СтрокаВложения);
					Ответ = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
					
					Если Ответ <> Неопределено Тогда
						ПутьКфайлу = Ответ.Получить("url");
						Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "cid:" + СтрокаВложения.Идентификатор, ПутьКфайлу);
					КонецЕсли;
				Иначе
					Если ТипЗнч(НайденныйФайл) = Тип("Массив") И НайденныйФайл.Количество() Тогда
						
						ПутьКфайлу = НайденныйФайл[0].Получить("url");
						Сообщение.Текст = СтрЗаменить(Сообщение.Текст, "cid:" + СтрокаВложения.Идентификатор, ПутьКфайлу);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Сообщение.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда // Экспресс выпуск
			
			ВыполнитьЭкспортПодписчиковСендсей(Неопределено, Сообщение.АдресатыРасширенно, Соединение, Сессия);
			
			ТелоЗапроса = ЗапросСообщениеСендсейЭкспрессВыпуск(Сообщение);
			
		Иначе // Транзакция
			
			ТелоЗапроса = ЗапросСообщениеСендсейТранзакция(Сообщение);
			
		КонецЕсли;
		
		Ответ = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
		Если Ответ <> Неопределено Тогда
			
			Попытка
				Для каждого КлючИЗначение Из Ответ Цикл
					Если КлючИЗначение.Ключ = "track.id" Тогда
						Сообщение.ИдентификаторСообщения = Формат(КлючИЗначение.Значение, "ЧГ=");
						Результат.ОтправленныеСообщения.Добавить(Сообщение);
						Возврат Результат;
					КонецЕсли;
				КонецЦикла;
			Исключение
				ТекстОшибки = НСтр("ru = 'Не удалось получить идентификатор отправленного сообщения Sendsay.'");
				
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,,,
					ТекстОшибки);
					
				ЗакрытьСессию(Соединение, Сессия);
				Результат.ОписаниеОшибки = ТекстОшибки;
				Возврат Результат;
			КонецПопытки;
		Иначе
			ЗакрытьСессию(Соединение, Сессия);
			Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось отправить сообщения рассылки.'");
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	ЗакрытьСессию(Соединение, Сессия);
	
	Возврат Результат;
	
КонецФункции

Функция ОткрытьСессию(Логин, Пароль)
	
	Результат = Новый Структура("Соединение, Сессия");
	
	Соединение = Неопределено;
	
	ТелоЗапроса = ЗапросАвторизацияСендсей(Логин, Пароль);
	РезультатСоответствие = ОтправитьЗапросСендсей(ТелоЗапроса);
	
	Если РезультатСоответствие <> Неопределено Тогда
		Перенаправление = РезультатСоответствие.Получить("REDIRECT");
		Если Перенаправление <> Неопределено Тогда
			Соединение = Неопределено;
			РезультатСоответствие = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение,, Перенаправление);
		КонецЕсли;
		
		Результат.Вставить("Соединение", Соединение);
		Результат.Вставить("Сессия", РезультатСоответствие.Получить("session"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗакрытьСессию(Соединение, Сессия)
	
	ТелоЗапроса = ЗапросВыходСендсей();
	Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
	
	Возврат Результат;
	
КонецФункции

Функция ЭкспортироватьПодписчиковСендсей(ПодписчикиОбъект, Адресаты, Настройки)
	
	Логин = Настройки.ЛогинПочтовойРассылки;
	Пароль = Настройки.ПарольПочтовойРассылки;
	
	Результат = ОткрытьСессию(Логин, Пароль);
	
	Соединение = Результат.Соединение;
	Сессия = Результат.Сессия;
	
	Результат = Неопределено;
	
	Если Сессия <> Неопределено Тогда
		Результат = ВыполнитьЭкспортПодписчиковСендсей(ПодписчикиОбъект, Адресаты, Соединение, Сессия);
		ЗакрытьСессию(Соединение, Сессия);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЭкспортПодписчиковСендсей(ПодписчикиОбъект, Адресаты, Соединение, Сессия)
	
	Результат = Неопределено;
	
	Для каждого Подписчик Из Адресаты Цикл
		
		ТелоЗапроса = ЗапросСуществованиеПодписчика(Подписчик);
		Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
		
		Если Результат <> Неопределено Тогда
		
			ПодписчикНайден = Ложь;
			ЗаписьПодписчика = Результат.Получить("list");
			Если ЗаписьПодписчика <> Неопределено И ЗаписьПодписчика.Количество() Тогда
				Для каждого КлючИЗначение Из ЗаписьПодписчика Цикл
					Если КлючИЗначение.Значение = 1 Тогда
						ПодписчикНайден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если Не ПодписчикНайден Тогда
				ТелоЗапроса = ЗапросСозданиеПодписчика(Подписчик);
				Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
				
				Если ЗначениеЗаполнено(Подписчик.Идентификатор) Тогда
					ТелоЗапроса = ЗапросПрисоединениеИдентификатораПодписчика(Подписчик);
					Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПодписчикиОбъект <> Неопределено Тогда
		
		СоздатьНовуюГруппу = Истина;
		
		Если ЗначениеЗаполнено(ПодписчикиОбъект.КодГруппы) Тогда
			ТелоЗапроса = ЗапросСписокГруппПодписчиков();
			Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
			
			Если Результат <> Неопределено Тогда
				СписокГрупп = Результат.Получить("list");
				Если СписокГрупп <> Неопределено И СписокГрупп.Количество() Тогда
					Для каждого КлючИЗначение Из СписокГрупп Цикл
						Если КлючИЗначение.Получить("id") = ПодписчикиОбъект.КодГруппы Тогда
							СоздатьНовуюГруппу = Ложь;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоздатьНовуюГруппу Тогда
			ТелоЗапроса = ЗапросСозданиеГруппыПодписчиков(ПодписчикиОбъект.Наименование);
			Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
			
			Если Результат <> Неопределено Тогда
				ПодписчикиОбъект.КодГруппы = Результат.Получить("id");
			КонецЕсли;
		КонецЕсли;
		
		// Внести подписчиков в группу
		ТелоЗапроса = ЗапросРасширитьГруппуПодписчиков(ПодписчикиОбъект.КодГруппы, Адресаты);
		Результат = ОтправитьЗапросСендсей(ТелоЗапроса, Соединение, Сессия);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ЗапросАвторизацияСендсей(Логин, Пароль)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "login");
	Тело.Вставить("login", Логин);
	Тело.Вставить("passwd", Пароль);
	//Тело.Вставить("sublogin", "");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросВыходСендсей()
	
	Тело = Новый Структура;
	Тело.Вставить("action", "logout");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросНастройкиСендсей(Настройки = Неопределено)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "sys.settings.get");
	
	Если Настройки <> Неопределено Тогда
		
		
	КонецЕсли;
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеСендсейТранзакция(Сообщение)
	
	ТелоПисьма = Новый Структура;
	
	Если Сообщение.ОбычныйТекст Тогда
		ТелоПисьма.Вставить("text", Сообщение.Текст);
	Иначе
		ТелоПисьма.Вставить("html", Сообщение.Текст);
	КонецЕсли;
	
	Письмо = Новый Структура;
	Письмо.Вставить("subject", Сообщение.Тема);
	Письмо.Вставить("from__name", Сообщение.ИмяОтправителя);
	Письмо.Вставить("from__email", Сообщение.ОбратныйАдрес);
	Письмо.Вставить("reply__email", Сообщение.ОбратныйАдрес);
	Письмо.Вставить("message", ТелоПисьма);
	
	Вложения = Новый Массив;
	
	Если Сообщение.ПечатныеФормы <> Неопределено Тогда
		Для каждого ПечатнаяФорма Из Сообщение.ПечатныеФормы Цикл
			Если ПечатнаяФорма.ДвоичныеДанные <> Неопределено Тогда
				
				НовоеВложение = Новый Структура;
				НовоеВложение.Вставить("name", ПечатнаяФорма.ИмяФайла);
				НовоеВложение.Вставить("content", Base64Строка(ПечатнаяФорма.ДвоичныеДанные));
				НовоеВложение.Вставить("encoding", "base64");
				Вложения.Добавить(НовоеВложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Сообщение.ПрисоединенныеФайлы <> Неопределено Тогда
		Для каждого ПрисоединенныйФайл Из Сообщение.ПрисоединенныеФайлы Цикл
			ДанныеПрисоединенногоФайла = ПрисоединенныйФайл.Вложение.Получить();
			Если ДанныеПрисоединенногоФайла <> Неопределено Тогда
				
				НовоеВложение = Новый Структура;
				НовоеВложение.Вставить("name", ПрисоединенныйФайл.Имя);
				НовоеВложение.Вставить("content", Base64Строка(ДанныеПрисоединенногоФайла));
				НовоеВложение.Вставить("encoding", "base64");
				Вложения.Добавить(НовоеВложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Вложения.Количество() Тогда
		Письмо.Вставить("attaches", Вложения);
	КонецЕсли;
	
	Тело = Новый Структура;
	Тело.Вставить("action", "issue.send");
	Тело.Вставить("letter", Письмо);
	
	Тело.Вставить("group", "personal");
	Тело.Вставить("sendwhen", "now");
	Тело.Вставить("email", Сообщение.АдресатыРасширенно[0].Адрес);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеСендсейЭкспрессВыпуск(Сообщение)
	
	ТелоПисьма = Новый Структура;
	
	Если Сообщение.ОбычныйТекст Тогда
		ТелоПисьма.Вставить("text", Сообщение.Текст);
	Иначе
		ТелоПисьма.Вставить("html", Сообщение.Текст);
	КонецЕсли;
	
	Письмо = Новый Структура;
	Письмо.Вставить("subject", Сообщение.Тема);
	Письмо.Вставить("from__name", Сообщение.ИмяОтправителя);
	Письмо.Вставить("from__email", Сообщение.ОбратныйАдрес);
	Письмо.Вставить("reply__email", Сообщение.ОбратныйАдрес);
	Письмо.Вставить("message", ТелоПисьма);
	
	Вложения = Новый Массив;
	
	Если Сообщение.ПечатныеФормы <> Неопределено Тогда
		Для каждого ПечатнаяФорма Из Сообщение.ПечатныеФормы Цикл
			Если ПечатнаяФорма.ДвоичныеДанные <> Неопределено Тогда
				
				НовоеВложение = Новый Структура;
				НовоеВложение.Вставить("name", ПечатнаяФорма.ИмяФайла);
				НовоеВложение.Вставить("content", Base64Строка(ПечатнаяФорма.ДвоичныеДанные));
				НовоеВложение.Вставить("encoding", "base64");
				Вложения.Добавить(НовоеВложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Сообщение.ПрисоединенныеФайлы <> Неопределено Тогда
		Для каждого ПрисоединенныйФайл Из Сообщение.ПрисоединенныеФайлы Цикл
			ДанныеПрисоединенногоФайла = ПрисоединенныйФайл.Вложение.Получить();
			Если ДанныеПрисоединенногоФайла <> Неопределено Тогда
				
				НовоеВложение = Новый Структура;
				НовоеВложение.Вставить("name", ПрисоединенныйФайл.Имя);
				НовоеВложение.Вставить("content", Base64Строка(ДанныеПрисоединенногоФайла));
				НовоеВложение.Вставить("encoding", "base64");
				Вложения.Добавить(НовоеВложение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Вложения.Количество() Тогда
		Письмо.Вставить("attaches", Вложения);
	КонецЕсли;
	
	Тело = Новый Структура;
	Тело.Вставить("action", "issue.send");
	Тело.Вставить("letter", Письмо);
	
	СписокПолучателей = Новый Массив;
	
	Для каждого Подписчик Из Сообщение.АдресатыРасширенно Цикл
		
		АдресПолучателя = Новый Структура;
		АдресПолучателя.Вставить("email", Подписчик.Адрес);
		
		НовыйПолучатель = Новый Структура;
		НовыйПолучатель.Вставить("member", АдресПолучателя);
		
		СписокПолучателей.Добавить(НовыйПолучатель);
	КонецЦикла;
	
	Тело.Вставить("group", "masssending");
	Тело.Вставить("sendwhen", "now");
	Тело.Вставить("users__list", СписокПолучателей);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСуществованиеПодписчика(Подписчик)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "member.exists");
	Тело.Вставить("email", Подписчик.Адрес);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСозданиеПодписчика(Подписчик)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "member.set");
	Тело.Вставить("email", Подписчик.Адрес);
	Тело.Вставить("newbie__confirm", 0);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросПрисоединениеИдентификатораПодписчика(Подписчик)
	
	Ид = ИдентификаторПодписчика(Подписчик.Идентификатор);
	
	Тело = Новый Структура;
	Тело.Вставить("action", "member.head.attach");
	Тело.Вставить("email", Подписчик.Адрес);
	Тело.Вставить("head", Ид);
	Тело.Вставить("head_addr_type", "csid");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСписокГруппПодписчиков()
	
	Тело = Новый Структура;
	Тело.Вставить("action", "group.list");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСозданиеГруппыПодписчиков(НаименованиеСписка)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "group.create");
	Тело.Вставить("name", НаименованиеСписка);
	Тело.Вставить("type", "list");
	Тело.Вставить("addr_type", "email");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросРасширитьГруппуПодписчиков(КодГруппы, Адресаты)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "group.snapshot");
	
	Группа = Новый Структура;
	Группа.Вставить("id", КодГруппы);
	Группа.Вставить("clean", 1);
	
	Тело.Вставить("to", Группа);
	
	Подписчики = Новый Структура;
	Подписчики.Вставить("list", Адресаты.ВыгрузитьКолонку("Адрес"));
	
	Тело.Вставить("from", Подписчики);
	
	Возврат Тело;
	
КонецФункции


Функция ЗапросСписокДоступныхХранилищ()
	
	Тело = Новый Структура;
	Тело.Вставить("action", "rfs.list");
	Тело.Вставить("domain", "");
	Тело.Вставить("path", "/");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСуществованиеФайла(ПутьКФайлу)
	
	Тело = Новый Структура;
	Тело.Вставить("action", "rfs.list");
	Тело.Вставить("domain", "image");
	Тело.Вставить("path", ПутьКФайлу);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСозданиеФайла(ПутьКФайлу, ДанныеФайла)
	
	ДвоичныеДанныеФайла = ДанныеФайла.Вложение.Получить();
	
	Тело = Новый Структура;
	Тело.Вставить("action", "rfs.file.put");
	Тело.Вставить("domain", "image");
	Тело.Вставить("path", ПутьКФайлу);
	Тело.Вставить("data", Base64Строка(ДвоичныеДанныеФайла));
	Тело.Вставить("encoding", "base64");
	
	Возврат Тело;
	
КонецФункции


Функция ОтправитьЗапросСендсей(ТелоЗапроса, Соединение = Неопределено, Сессия = Неопределено, ИмяХоста = "")
	
	Если Сессия <> Неопределено Тогда
		ТелоЗапроса.Вставить("session", Сессия);
	КонецЕсли;
	
	ПараметрыЗапроса = ПараметрыЗапросаСендсей(JSONИзТела(ТелоЗапроса));
	
	Если Соединение = Неопределено Тогда
		
		ssl = Новый ЗащищенноеСоединениеOpenSSL(
			Новый СертификатКлиентаWindows(),
				Новый СертификатыУдостоверяющихЦентровWindows());
		
		АдресСервера = "api.sendsay.ru" + ИмяХоста;
		Соединение = Новый HTTPСоединение(АдресСервера,,,,,, ssl);
	КонецЕсли;
	
	ИмяФайлаЗапроса = СформироватьФайлДляPOSTЗапросаСендсей(ПараметрыЗапроса);
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("txt");
	
	ЗаголовокЗапроса = Новый Соответствие;
	ЗаголовокЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовокЗапроса.Вставить("Content-Length", XMLСтрока(РазмерФайла(ИмяФайлаЗапроса)));
	
	Соединение.ОтправитьДляОбработки(ИмяФайлаЗапроса,, ИмяФайлаОтвета, ЗаголовокЗапроса);
	
	УдалитьФайлы(ИмяФайлаЗапроса);
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	ОтветСервера = ЧтениеТекста.Прочитать();
	
	Результат = ПреобразоватьИзСтрокиJSONВСоответствие(ОтветСервера);
	
	Если Не УспехЗапроса(Результат, ОтветСервера, ПараметрыЗапроса.request) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция ПараметрыЗапросаСендсей(ТекстЗапроса)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("apiversion", 100);
	ПараметрыЗапроса.Вставить("json", 1);
	ПараметрыЗапроса.Вставить("request", ТекстЗапроса);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция СформироватьФайлДляPOSTЗапросаСендсей(ПараметрыЗапроса)
	
	СтрокаЗапроса = "";
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Если Не ПустаяСтрока(СтрокаЗапроса) Тогда
			СтрокаЗапроса = СтрокаЗапроса + "&";
		КонецЕсли;
		СтрокаЗапроса = СтрокаЗапроса + Параметр.Ключ + "=" + КодироватьСтроку(Параметр.Значение, СпособКодированияСтроки.КодировкаURL);
	КонецЦикла;
	
	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла("txt");
	
	ФайлЗапроса = Новый ЗаписьТекста(ИмяФайлаЗапроса, КодировкаТекста.ANSI);
	ФайлЗапроса.Записать(СтрокаЗапроса);
	ФайлЗапроса.Закрыть();
	
	Возврат ИмяФайлаЗапроса;
	
КонецФункции

// Запросы UniSender

Функция ПолучитьСпискиРассылок(Соединение, Ключ)
	
	Результат = Новый Структура;
	
	ПараметрыЗапроса = ЗапросПолучениеСписковРассылокУнисендер();
	Результат = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат.Получить("result");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СоздатьСписокРассылки(Событие, Соединение, Ключ)
	
	ПараметрыЗапроса = ЗапросСозданиеСпискаРассылкиУнисендер(Строка(Событие));
	Результат = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
	
	Если Результат <> Неопределено Тогда
		Результат = Результат.Получить("result");
		Если Результат <> Неопределено Тогда
			Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
				Возврат Результат.Получить("id");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОтправитьСообщенияУнисендер(Сообщения, Настройки)
	
	Результат = Новый Структура("ОтправленныеСообщения, ОписаниеОшибки", Новый Массив, "");
	
	Ключ = Настройки.ЛогинПочтовойРассылки;
	Если Не ЗначениеЗаполнено(Ключ) Тогда
		Результат.ОписаниеОшибки = НСтр("ru = 'Не заполнены настройки соединения с сервисом рассылки.'");
		Возврат Результат;
	КонецЕсли;
	
	Соединение = Неопределено;
	
	Для каждого Сообщение Из Сообщения Цикл
		
		СобытиеНайдено = Ложь;
		
		// Получим код подписки - группы рассылок
		КодПодписки = Справочники.ПЛ_События.РеквизитыСобытия(Сообщение.Событие).КодПодписки;
		Если Не ЗначениеЗаполнено(КодПодписки) Тогда
			СобытиеНайдено = Ложь;
		Иначе
			СпискиРассылок = ПолучитьСпискиРассылок(Соединение, Ключ);
			Если СпискиРассылок <> Неопределено Тогда
				Для каждого ЭлементСписка Из СпискиРассылок Цикл
					Код = ЭлементСписка.Получить("id");
					Если Код <> Неопределено И КодПодписки = Код Тогда
						СобытиеНайдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если Не СобытиеНайдено Тогда
			КодПодписки = СоздатьСписокРассылки(Сообщение.Событие, Соединение, Ключ);
			Если КодПодписки <> Неопределено Тогда
				ОбъектСобытие = Сообщение.Событие.ПолучитьОбъект();
				Попытка
					ОбъектСобытие.Заблокировать();
					ОбъектСобытие.КодПодписки = КодПодписки;
					ОбъектСобытие.Записать();
				Исключение
					Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось заблокировать для записи событие %1'");
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,,,
						ПЛ_УведомленияОСобытиях.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не удалось заблокировать для записи событие %1'"), Сообщение.Событие));
					Возврат Результат;
				КонецПопытки;
			Иначе
				Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось создать список рассылки.'");
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		
		Если Сообщение.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда // Экспресс выпуск
			
			РезультатЭкспорта = ЭкспортироватьПодписчиковУнисендер(Сообщение.АдресатыРасширенно, Соединение, Ключ);
			Если РезультатЭкспорта <> Неопределено Тогда
				ПодписатьНаРассылкуУнисендер(КодПодписки, Сообщение.АдресатыРасширенно, Соединение, Ключ);
			КонецЕсли;
			
			ПараметрыЗапроса = ЗапросСообщениеУнисендерРассылка(Сообщение, КодПодписки);
			Ответ = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
			
			Если Ответ <> Неопределено Тогда
				
				Попытка
					ИдСообщения = Ответ.Получить("result").Получить("message_id");
				Исключение
					ТекстОшибки = НСтр("ru = 'Не удалось получить идентификатор сообщения UniSender для отправки.'");
					
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,,,
						ТекстОшибки);
						
					Результат.ОписаниеОшибки = ТекстОшибки;
					Возврат Результат;
				КонецПопытки;
				
				ПараметрыЗапроса = ЗапросСообщениеУнисендерСоздатьКампанию(Сообщение, ИдСообщения);
				Ответ = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
				
				Если Ответ <> Неопределено Тогда
					
					Попытка
						ИдентификаторСообщения = Ответ.Получить("result").Получить("campaign_id");
						Сообщение.ИдентификаторСообщения = Формат(ИдентификаторСообщения, "ЧГ=");
						Результат.ОтправленныеСообщения.Добавить(Сообщение);
					Исключение
						ТекстОшибки = НСтр("ru = 'Не удалось получить идентификатор отправленного сообщения UniSender.'");
						
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
							УровеньЖурналаРегистрации.Предупреждение,,,
							ТекстОшибки);
							
						Результат.ОписаниеОшибки = ТекстОшибки;
						Возврат Результат;
					КонецПопытки;
					
				Иначе
					Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось отправить сообщения рассылки.'");
					Возврат Результат;
				КонецЕсли;
			Иначе
				Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось отправить сообщения рассылки.'");
				Возврат Результат;
			КонецЕсли;
			
			
		Иначе // Транзакция
			
			ПараметрыЗапроса = ЗапросСообщениеУнисендерТранзакция(Сообщение, КодПодписки);
			Ответ = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
			
			Если Ответ <> Неопределено Тогда
				ОтправленноеСообщение = Новый Структура("Уведомление", Сообщение.Уведомление);
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
			Иначе
				Результат.ОписаниеОшибки = НСтр("ru = 'Не удалось отправить уведомление.'");
				Возврат Результат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЭкспортироватьПодписчиковУнисендер(Адресаты, Соединение, Ключ)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		ПараметрыЗапроса = ЗапросСообщениеУнисендерЭкспортироватьПодписчиков(Адресаты);
		Результат = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодписатьНаРассылкуУнисендер(КодПодписки, Адресаты, Соединение, Ключ)
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(Ключ) Тогда
		Для каждого Подписчик Из Адресаты Цикл
			ПараметрыЗапроса = ЗапросСообщениеУнисендерПодписатьНаРассылку(КодПодписки, Подписчик.Адрес);
			Результат = ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение, Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ЗапросПолучениеСписковРассылокУнисендер()
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "getLists");
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСозданиеСпискаРассылкиУнисендер(Наименование)
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "createList");
	Тело.Вставить("title", Наименование);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеУнисендерСоздатьКампанию(Сообщение,  ИдСообщения)
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "createCampaign");
	
	Тело.Вставить("message_id", СтрЗаменить(Строка(ИдСообщения), Символ(160), ""));
	Тело.Вставить("track_read", 1);
	Тело.Вставить("track_links", 1);
	
	Контакты = "";
	Для каждого ЭлементМассива Из Сообщение.АдресатыРасширенно Цикл
		Контакты = Контакты + ЭлементМассива.Адрес + ", ";
	КонецЦикла;
	
	Тело.Вставить("contacts", Контакты);
	Тело.Вставить("defer", 1);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеУнисендерРассылка(Сообщение, КодПодписки)
	
	ТекстСообщения = Сообщение.Текст;
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "createEmailMessage");
	
	Тело.Вставить("sender_name", Сообщение.ИмяОтправителя);
	Тело.Вставить("sender_email", Сообщение.ОбратныйАдрес);
	Тело.Вставить("subject", Сообщение.Тема);
	Тело.Вставить("list_id", ЧислоСтрокой(КодПодписки));
	Тело.Вставить("generate_text", 1);
	Тело.Вставить("message_format", "raw_html");
	
	// Вложения
	Инд = 1;
	Если Сообщение.ПрисоединенныеФайлы <> Неопределено Тогда
		Для каждого ПрисоединенныйФайл Из Сообщение.ПрисоединенныеФайлы Цикл
			ДанныеПрисоединенногоФайла = ПрисоединенныйФайл.Вложение.Получить();
			Если ДанныеПрисоединенногоФайла <> Неопределено Тогда
				
				НовоеВложение = Новый Структура;
				НовоеВложение.Вставить("Имя", ПрисоединенныйФайл.Имя);
				НовоеВложение.Вставить("Данные", ДанныеПрисоединенногоФайла);
				Тело.Вставить("attachments" + Инд, НовоеВложение);
				Инд = Инд + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для каждого СтрокаВложения Из Сообщение.ТаблицаВложений Цикл
		ДанныеПрисоединенногоФайла = СтрокаВложения.Вложение.Получить();
		Если ДанныеПрисоединенногоФайла <> Неопределено Тогда
			
			НовоеВложение = Новый Структура;
			
			НовоеИмяФайла = СтрокаЛатиницей(СтрЗаменить(СтрокаВложения.Имя, ".", Строка(Инд) + "."));
			
			НовоеВложение.Вставить("Имя", НовоеИмяФайла);
			НовоеВложение.Вставить("Данные", ДанныеПрисоединенногоФайла);
			Тело.Вставить("attachments" + Инд, НовоеВложение);
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "cid:" + СтрокаВложения.Идентификатор, Строка(Инд) + "_" + НовоеИмяФайла);
			
			Инд = Инд + 1;
		КонецЕсли;
	КонецЦикла;
	
	Тело.Вставить("body", ТекстСообщения);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеУнисендерТранзакция(Сообщение, КодПодписки)
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "sendEmail");
	
	Инд = 0;
	Для каждого ЭлементМассива Из Сообщение.АдресатыРасширенно Цикл
		Тело.Вставить("email" + Инд, ЭлементМассива.Адрес);
		Инд = Инд + 1;
	КонецЦикла;
	
	Тело.Вставить("track_read", 1);
	Тело.Вставить("error_checking", 1);
	Тело.Вставить("sender_email", Сообщение.ОбратныйАдрес);
	Тело.Вставить("sender_name", Сообщение.ИмяОтправителя);
	Тело.Вставить("subject", Сообщение.Тема);
	Тело.Вставить("body", Сообщение.Текст);
	Тело.Вставить("list_id", ЧислоСтрокой(КодПодписки));
	
	// В sendEmail вложения почему-то не передаются - возвращает ошибку...
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеУнисендерЭкспортироватьПодписчиков(Адресаты)
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "importContacts");
	
	ИменаПолей = Новый Массив;
	СтруктураПолей = ИнициализироватьСтруктуруПолейПодписчикаУнисендер();
	Для каждого ЭлементСтруктуры Из СтруктураПолей Цикл
		ИменаПолей.Добавить(ЭлементСтруктуры.Ключ);
	КонецЦикла;
	
	Тело.Вставить("field_names", ИменаПолей);
	
	ДанныеПодписчиков = Новый Массив;
	Для каждого СтрокаАдресата Из Адресаты Цикл
		СтруктураАдресата = ИнициализироватьСтруктуруПолейПодписчикаУнисендер();
		СтруктураАдресата.Вставить("email", СтрокаАдресата.Адрес);
		СтруктураАдресата.Вставить("Name", Строка(СтрокаАдресата.Адресат));
		ДанныеПодписчиков.Добавить(СтруктураАдресата);
	КонецЦикла;
	
	Тело.Вставить("data", ДанныеПодписчиков);
	
	Возврат Тело;
	
КонецФункции

Функция ЗапросСообщениеУнисендерПодписатьНаРассылку(КодПодписки, АдресПодписчика)
	
	Тело = Новый Структура;
	Тело.Вставить("Запрос", "subscribe");
	
	Тело.Вставить("list_ids", ЧислоСтрокой(КодПодписки));
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("email", АдресПодписчика);
	Тело.Вставить("fields", СтруктураПолей);
	Тело.Вставить("double_optin", 1);
	
	Возврат Тело;
	
КонецФункции

Функция ИнициализироватьСтруктуруПолейПодписчикаУнисендер()
	
	СтруктураПолей = Новый Структура("email, Name");
	
	Возврат СтруктураПолей;
	
КонецФункции

Функция ДанныеФайлаСтрокой(ДанныеФайла)
	
	Результат = "";
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	ДанныеФайла.Записать(ИмяФайла);
	
	ПотокЧтения = Новый ЧтениеТекста(ИмяФайла,,,, Ложь);
	
	ТекущаяСтрока = ПотокЧтения.ПрочитатьСтроку();
	Результат = ТекущаяСтрока;
	Пока ТекущаяСтрока <> Неопределено Цикл
		
		Результат = Результат + Символы.ПС;
		ТекущаяСтрока = ПотокЧтения.ПрочитатьСтроку();
		Результат = Результат + ТекущаяСтрока;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьЗапросУнисендер(ПараметрыЗапроса, Соединение = Неопределено, Ключ)
	
	ПараметрыЗапроса.Вставить("api_key", Ключ);
	
	Если Соединение = Неопределено Тогда
		
		ssl = Новый ЗащищенноеСоединениеOpenSSL(
			Новый СертификатКлиентаWindows(),
				Новый СертификатыУдостоверяющихЦентровWindows());
		
		АдресСервера = "api.unisender.com/ru/api";
		Соединение = Новый HTTPСоединение(АдресСервера,,,,,, ssl);
	КонецЕсли;
	
	СтрокаЗапроса = СформироватьСтрокуДляPOSTЗапросаУнисендер(ПараметрыЗапроса);
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("txt");
	
	ЗаголовокЗапроса = Новый Соответствие;
	ЗаголовокЗапроса.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовокЗапроса.Вставить("Accept-Language", "ru");
	ЗаголовокЗапроса.Вставить("Accept-Charset", "utf-8");
	ЗаголовокЗапроса.Вставить("Content-Language", "ru");
	ЗаголовокЗапроса.Вставить("Content-Charset", "utf-8");
	
	HTTPЗапрос = Новый HTTPЗапрос("/" + ПараметрыЗапроса.Запрос + "?format=json", ЗаголовокЗапроса);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	
	Соединение.ОтправитьДляОбработки(HTTPЗапрос, ИмяФайлаОтвета);
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета, "UTF-8");
	ОтветСервера = ЧтениеТекста.Прочитать();
	
	Результат = ПреобразоватьИзСтрокиJSONВСоответствие(ОтветСервера);
	
	Если Не УспехЗапроса(Результат, ОтветСервера, ПараметрыЗапроса.Запрос) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции

Функция СформироватьСтрокуДляPOSTЗапросаУнисендер(ПараметрыЗапроса)
	
	ЭлементыСтрокиЗапроса = Новый Массив;
	
	СтрокаЗапроса = "";
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		
		Если Параметр.Ключ = "Запрос" Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрКлюч = Параметр.Ключ;
		ПараметрЗначение = Параметр.Значение;
		
		ПозАдреса = Найти(ПараметрКлюч, "email");
		Если ПозАдреса = 1 Тогда
			ПараметрКлюч = "email[" + Сред(Параметр.Ключ, 6) + "]";
		КонецЕсли;
		
		Кодировать = Ложь;
		ПозВложения = Найти(ПараметрКлюч, "attachments");
		Если ПозВложения = 1 Тогда
			ПараметрКлюч = "attachments[" + ПараметрЗначение.Имя + "]";
			ПараметрЗначение = ПолучитьСтрокуИзДвоичныхДанных(ПараметрЗначение.Данные, "ISO-8859-1");
			Кодировать = Истина;
		КонецЕсли;
		
		ПозПоляПодписчика = Найти(ПараметрКлюч, "fields");
		Если ПозПоляПодписчика = 1 Тогда
			Для каждого ЭлементСтруктурыПолей Из ПараметрЗначение Цикл
				ПараметрКлюч = "fields[" + ЭлементСтруктурыПолей.Ключ + "]";
				СтрокаЗапроса = ПараметрКлюч + "=" + КодироватьСтроку(ЭлементСтруктурыПолей.Значение, СпособКодированияСтроки.КодировкаURL);
				ЭлементыСтрокиЗапроса.Добавить(СтрокаЗапроса);
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		ПозПолейПодписчика = Найти(ПараметрКлюч, "field_names");
		Если ПозПолейПодписчика = 1 Тогда
			Инд = 0;
			Для каждого ЭлементСписка Из ПараметрЗначение Цикл
				ЭлементПараметрКлюч = ПараметрКлюч + "[" + Строка(Инд) + "]";
				СтрокаЗапроса = ЭлементПараметрКлюч + "=" + КодироватьСтроку(ЭлементСписка, СпособКодированияСтроки.КодировкаURL);
				ЭлементыСтрокиЗапроса.Добавить(СтрокаЗапроса);
				Инд = Инд + 1;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		ПозПолейДанныхПодписчика = Найти(ПараметрКлюч, "data");
		Если ПозПолейДанныхПодписчика = 1 Тогда
			СтруктураПолей = ПараметрыЗапроса["field_names"];
			Инд1 = 0;
			Для каждого ЭлементСписка Из ПараметрЗначение Цикл
				Инд2 = 0;
				Для каждого ЭлементСтруктурыПолей Из СтруктураПолей Цикл
					ЭлементПараметрКлюч = ПараметрКлюч + "[" + Строка(Инд1) + "]" + "[" + Строка(Инд2) + "]";
					СтрокаЗапроса = ЭлементПараметрКлюч + "=" + КодироватьСтроку(ЭлементСписка[ЭлементСтруктурыПолей], СпособКодированияСтроки.КодировкаURL);
					ЭлементыСтрокиЗапроса.Добавить(СтрокаЗапроса);
					Инд2 = Инд2 + 1;
				КонецЦикла;
				Инд1 = Инд1 + 1;
			КонецЦикла;
			Продолжить;
		КонецЕсли;
		
		Если Кодировать Тогда
			СтрокаЗапроса = ПараметрКлюч + "=" + КодироватьСтроку(ПараметрЗначение, СпособКодированияСтроки.КодировкаURL, "ISO-8859-1");
		Иначе
			СтрокаЗапроса = ПараметрКлюч + "=" + КодироватьСтроку(ПараметрЗначение, СпособКодированияСтроки.КодировкаURL);
		КонецЕсли;
		
		ЭлементыСтрокиЗапроса.Добавить(СтрокаЗапроса);
	КонецЦикла;
	
	Возврат ПЛ_УведомленияОСобытиях.СтрокаИзМассиваПодстрок(ЭлементыСтрокиЗапроса, "&");
	
КонецФункции

// Общие функции

Функция РазмерФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Размер();
	
КонецФункции
 
Функция ЧислоСтрокой(Аргумент)
	
	Возврат СтрЗаменить(Строка(Аргумент), Символ(160), "");
	
КонецФункции

Функция СтрокаЛатиницей(Знач Значение)
	
	Результат = "";
	
	Соответствие = СоответствиеНациональногоАлфавитаИЛатиницы();
	
	ПредыдущийСимвол = "";
	Для Позиция = 1 По СтрДлина(Значение) Цикл
		Символ = Сред(Значение, Позиция, 1);
		СимволЛатиницей = Соответствие[НРег(Символ)]; // Поиск соответствия без учета регистра.
		Если СимволЛатиницей = Неопределено Тогда
			// Другие символы остаются "как есть".
			СимволЛатиницей = Символ;
		Иначе
			Если Символ = ВРег(Символ) Тогда
				СимволЛатиницей = ТРег(СимволЛатиницей); // восстанавливаем регистр
			КонецЕсли;
		КонецЕсли;
		Результат = Результат + СимволЛатиницей;
		ПредыдущийСимвол = СимволЛатиницей;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СоответствиеНациональногоАлфавитаИЛатиницы()
	
	// Транслитерация, используемая в загранпаспортах 1997-2010.
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("а","a");
	Соответствие.Вставить("б","b");
	Соответствие.Вставить("в","v");
	Соответствие.Вставить("г","g");
	Соответствие.Вставить("д","d");
	Соответствие.Вставить("е","e");
	Соответствие.Вставить("ё","e");
	Соответствие.Вставить("ж","zh");
	Соответствие.Вставить("з","z");
	Соответствие.Вставить("и","i");
	Соответствие.Вставить("й","y");
	Соответствие.Вставить("к","k");
	Соответствие.Вставить("л","l");
	Соответствие.Вставить("м","m");
	Соответствие.Вставить("н","n");
	Соответствие.Вставить("о","o");
	Соответствие.Вставить("п","p");
	Соответствие.Вставить("р","r");
	Соответствие.Вставить("с","s");
	Соответствие.Вставить("т","t");
	Соответствие.Вставить("у","u");
	Соответствие.Вставить("ф","f");
	Соответствие.Вставить("х","kh");
	Соответствие.Вставить("ц","ts");
	Соответствие.Вставить("ч","ch");
	Соответствие.Вставить("ш","sh");
	Соответствие.Вставить("щ","shch");
	Соответствие.Вставить("ъ",""); // пропускается
	Соответствие.Вставить("ы","y");
	Соответствие.Вставить("ь",""); // пропускается
	Соответствие.Вставить("э","e");
	Соответствие.Вставить("ю","yu");
	Соответствие.Вставить("я","ya");
	
	Возврат Соответствие;
	
КонецФункции

Функция JSONИзТела(Тело)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Тело);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	СтрокаJSON = СтрЗаменить(СтрокаJSON, "__", ".");
	СтрокаJSON = СтрЗаменить(СтрокаJSON, "___", "-");
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция ИдентификаторПодписчика(Идентификатор)
	
	Возврат СтрЗаменить(Идентификатор, "-", "_");
	
КонецФункции

Функция ПреобразоватьИзСтрокиJSONВСоответствие(Строка)
	
	Результат = Неопределено;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Попытка
		ЧтениеJSON.УстановитьСтроку(Строка);
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция УспехЗапроса(РезультатСоответствие, ОтветСервера, ТелоЗапроса = "")
	
	Если РезультатСоответствие.Получить("errors") <> Неопределено
		Или РезультатСоответствие.Получить("error") <> Неопределено Тогда
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ТелоЗапроса + "
				|" + ОтветСервера);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции
