
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеИзменений.Очистить();
	ОписаниеИзменений.Вывести(ПЛ_УведомленияОСобытиях.ДокументОписаниеИзменений(Параметры));
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ОписаниеИзмененийВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ПриНажатииНаГиперссылкуВДокументеОписанияИзменений(Область);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПриНажатииНаГиперссылкуВДокументеОписанияИзменений(Область)
	
	Если Найти(Область.Имя, "ФормаНастройки") Тогда
		
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений");
		
	ИначеЕсли Найти(Область.Имя, "Сайт") Тогда
		
		ЗапуститьПриложение("http://program-line.ru");
		
	ИначеЕсли Найти(Область.Имя, "ЭлектронныйАдрес") Тогда
		
		ЗапуститьПриложение("mailto:support@program-line.ru");
		
	КонецЕсли;
	
КонецПроцедуры

