
Процедура ПриПроведенииТоварыОрганизацийМТОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ДатаПримененияПроведения = Константы.НовыйМеханизмПроведенияДокументовДляСверкиСБП.Получить();
	
	Если НЕ ЗначениеЗаполнено(ДатаПримененияПроведения) ИЛИ Источник.Дата < ДатаПримененияПроведения Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
	
		Если ЗначениеЗаполнено(Источник.ДоговорПоставщикаТОХ) Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
	НуженРасход = Ложь;
	НуженПриход = Ложь;
	
	Если ТипЗнч(Источник)= Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		
		СкладРасход = Источник.СкладОтправитель;
		СкладПриход = Источник.СкладПолучатель;
		НуженРасход = Истина;
		НуженПриход = Истина;
		
	ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(Источник)= Тип("ДокументОбъект.КорректировкаПоступления") Тогда
		
		СкладПриход = Источник.СкладОрдер;
		НуженПриход = Истина;
		
	ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.ОприходованиеТоваров") Тогда
		
		СкладПриход = Источник.Склад;
		НуженПриход = Истина;
		
	ИначеЕсли ТипЗнч(Источник)= Тип("ДокументОбъект.СписаниеТоваров") 
		ИЛИ ТипЗнч(Источник)= Тип("ДокументОбъект.ТребованиеНакладная")
		ИЛИ ТипЗнч(Источник)= Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(Источник)= Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		СкладРасход = Источник.Склад;
		НуженРасход = Истина;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник)= Тип("ДокументОбъект.ТребованиеНакладная") Тогда
		ТЧДокумента = Источник.Материалы
	Иначе
		ТЧДокумента = Источник.Товары
	КонецЕсли;
	
	НаборДвижений = Источник.Движения.ТоварыОрганизацийМТ;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	Если ТипЗнч(Источник)= Тип("ДокументОбъект.КорректировкаПоступления")
		ИЛИ ТипЗнч(Источник)= Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		
		Для Каждого СтрокаТовары Из ТЧДокумента Цикл
			
			Если СтрокаТовары.Количество - СтрокаТовары.КоличествоДоИзменения <> 0 Тогда
				
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
				СтрокаДвижений.Количество = СтрокаТовары.Количество - СтрокаТовары.КоличествоДоИзменения;
				
			КонецЕсли;
			
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТовары Из ТЧДокумента Цикл
			
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары);
			
		КонецЦикла;	
	КонецЕсли;
	
	ТаблицаДвижений.ЗаполнитьЗначения(Источник.Организация, "Организация");
	
	НаборДвижений.мПериод            = Источник.Дата;
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если НуженРасход Тогда
		
		ТаблицаДвижений.ЗаполнитьЗначения(СкладРасход, "Склад");
		
		Если Не Отказ Тогда
			Источник.Движения.ТоварыОрганизацийМТ.ВыполнитьРасход();
		КонецЕсли;
		
	КонецЕсли;
	
	Если НуженПриход Тогда
		
		ТаблицаДвижений.ЗаполнитьЗначения(СкладПриход, "Склад");
		
		Если Не Отказ Тогда
			Источник.Движения.ТоварыОрганизацийМТ.ВыполнитьПриход();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
