Процедура ПечатьЧека(Документ) Экспорт
	ФУ = Неопределено;
	
	Форма = Документ.ПолучитьФорму("ФормаДокумента");
	ПолучитьСерверТО().ПодключитьКлиента(Форма);

	Если Не РаботаСТорговымОборудованием.ПолучитьПроверитьПараметрыДляПробитияЧека(ФУ, Истина, Документ.Организация) Тогда
		Возврат;
	КонецЕсли;
		
	ОписаниеПКС = КассовыеСменыВызовСервера.ОписаниеПоследнейКассовойСмены(ФУ);
	Если ОписаниеПКС = Неопределено ИЛИ ОписаниеПКС.Статус = Перечисления.СтатусыКассовойСмены.Закрыта Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Кассовая смена не открыта");
		Возврат;
	КонецЕсли;

	ОбъектДрайвера = Неопределено;
	ОбработкаОбслуживания = Неопределено;
	ПолучитьСерверТО().ПолучитьОбъектДрайвера(ФУ, ОбработкаОбслуживания, ОбъектДрайвера);
	
	ОбработкаОбслуживания.ПолучитьПараметрыККТ(ОбъектДрайвера);
	ВерсияФормата = МенеджерОборудованияКлиентСервер.ВерсияФФД(ОбъектДрайвера.ВыходныеПараметры);
	
	ПараметрыЧека = МенеджерОборудованияКлиентСервер.ПараметрыОперацииФискализацииЧека();
	ПараметрыЧека.Вставить("ОписаниеПКС", ОписаниеПКС);
	МенеджерОборудованияВызовСервера.ПодготовитьДанныеДляФискализацииЧека(Документ.Ссылка, ПараметрыЧека, ВерсияФормата, 
		ПолучитьСерверТО().ПолучитьМодель(ФУ), Документ.ПринятоОт, Документ.Основание);
	
	ОшибкаТО = ОбработкаОбслуживания.ФискализироватьЧек(ОбъектДрайвера, ПараметрыЧека);
	Если ЗначениеЗаполнено(ОшибкаТО) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(ОбъектДрайвера.ОписаниеОшибки);
		Возврат;
		//Иначе
		//	ЭтотОбъект.НомерЧекаККМ = ОбъектДрайвера.ВыходныеПараметры[1];
		//	ЭтотОбъект.ККМ = ОписаниеПКС.КассаККМ;
		//	ЭтотОбъект.ТекстЭлектронногоЧека = ПараметрыЧека.ТекстЭлектронногоЧека;
	КонецЕсли;

	ПолучитьСерверТО().ОтключитьКлиента(Форма);


	
КонецПроцедуры

Процедура ПриОткрытии()
	ПодключитьОбработчикОжидания("ПечатьЧека", 10); 
КонецПроцедуры

Процедура ПечатьЧеков() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации("Печать чеков ККМ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1 *
	|ИЗ
	|	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|ГДЕ
	|	ОчередьПечатиККМ.Обработано = ЛОЖЬ
	|	И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.ОчередьПечатиККМ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
			
		РаботаСККМ.ПечатьЧека(Выборка.ДокументЧек);
		МЗ = РегистрыСведений.ОчередьПечатиККМ.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Обработано = Истина;
		МЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
