#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьДоступныйСпособВыпускаВОборот(ТоварнаяГруппаЧестногоЗнака, ДатаПроверки, ДопускаетсяМассивСпособов = Ложь) Экспорт
	
	//+Макрушин Е. 07.09.2026 #UT11-6036
	ДоступныйСпособ = Справочники.СпособыВыпускаВОборот.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТоварныеГруппыЧЗСпособыВыпускаВОборот.НомерСтроки,
	               |	ТоварныеГруппыЧЗСпособыВыпускаВОборот.СпособВыпускаВОборот
	               |ИЗ
	               |	Справочник.ТоварныеГруппыЧЗ.СпособыВыпускаВОборот КАК ТоварныеГруппыЧЗСпособыВыпускаВОборот
	               |ГДЕ
	               |	ТоварныеГруппыЧЗСпособыВыпускаВОборот.Ссылка = &ТоварнаяГруппаЧЗ
	               |	И ТоварныеГруппыЧЗСпособыВыпускаВОборот.ДатаНачала <= &ДатаПроверки
	               |	И (ТоварныеГруппыЧЗСпособыВыпускаВОборот.ДатаОкончания = &ПустаяДата
	               |			ИЛИ ТоварныеГруппыЧЗСпособыВыпускаВОборот.ДатаОкончания >= &ДатаПроверки)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТоварныеГруппыЧЗСпособыВыпускаВОборот.НомерСтроки
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТоварнаяГруппаЧЗ", ТоварнаяГруппаЧестногоЗнака);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаПроверки", НачалоДня(ДатаПроверки));
	
	тзСпособыВывода = Запрос.Выполнить().Выгрузить();
	
	Если ДопускаетсяМассивСпособов Тогда
		ДоступныйСпособ = тзСпособыВывода.ВыгрузитьКолонку("СпособВыпускаВОборот");
	ИначеЕсли тзСпособыВывода.Количество() = 1 Тогда
		ДоступныйСпособ = тзСпособыВывода[0].СпособВыпускаВОборот;
	КонецЕсли;
	
	Возврат ДоступныйСпособ;
	//-Макрушин Е. 10.08.2026 #UT11-6015
	
КонецФункции

#КонецЕсли