
Процедура УстановитьСтатусЗаказаПокупателя(ДанныхЗаписи)

	Попытка
		
		МенеджерЗаписи = РегистрыСведений.СтатусыЗаказаПокупателя.СоздатьМенеджерЗаписи(); 
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныхЗаписи);
		МенеджерЗаписи.Записать(); 
		
	Исключение
	КонецПопытки;

КонецПроцедуры	         

Процедура УдалитьЗаписиДокумента(ДокументЗаписи)

	Попытка
		
		НаборЗаписей = РегистрыСведений.СтатусыЗаказаПокупателя.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(ДокументЗаписи);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать(Истина);
		
	Исключение
	КонецПопытки;

КонецПроцедуры	

Процедура ДобавитьЗаписьСтатусаЗаказа(ДокументЗаписи, Отказ, ОтменаЗаписи = Ложь) Экспорт

	Если ОтменаЗаписи Тогда 
		УдалитьЗаписиДокумента(ДокументЗаписи.Ссылка);
	Иначе 	 
		
		Если ТипЗнч(ДокументЗаписи.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") И НЕ ЕстьРазличияЗаписей(ДокументЗаписи.Ссылка) Тогда  
			Возврат;
		КонецЕсли;
		
		УдалитьЗаписиДокумента(ДокументЗаписи.Ссылка);
		
		ТаблицаДвижения = ПолучитьТаблицуДвиженияСтатуса(ДокументЗаписи.Ссылка);
		
		Для Каждого СтрокаДвижения Из ТаблицаДвижения Цикл
			УстановитьСтатусЗаказаПокупателя(СтрокаДвижения);	
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры	

Функция ПолучитьТаблицуДвиженияСтатуса(ДокументДвижения)

	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаПоДокументу(ДокументДвижения);
	Запрос.Параметры.Вставить("ДокументДвижения", ДокументДвижения);
	
	ТаблицаДвижения = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДвижения;

КонецФункции	  

Функция ПолучитьТекстЗапросаПоДокументу(ДокументСсылка)

	ТекстЗапроса = "";

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказаПокупателя();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаРеализацияТоваровУслуг();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
		ТекстЗапроса = ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя();
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ГрузовоеМесто") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаГрузовоеМесто();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СборкаЗаказовПокупателя") Тогда 
		ТекстЗапроса = ПолучитьТекстЗапросаСборкаЗаказовПокупателя();		
	ИначеЕсли ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда  
		ТекстЗапроса = ПолучитьТекстЗапросаЗаказПоставщику();
	КонецЕсли;	
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаЗаказаПокупателя()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Ссылка КАК ЗаказПокупателя,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.ЗаказПокупателя КАК Документ,
	|	Значение(Перечисление.СостояниеЗаказаПокупателя.Заказан) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоЗаказано
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";      
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаРеализацияТоваровУслуг()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.Выполнен) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоВыполнено
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции	

Функция ПолучитьТекстЗапросаКорректировкаЗаказаПокупателя()

	ТекстЗапроса = "ВЫБРАТЬ
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	ТоварыДокумента.Ссылка КАК Документ,
	               |	ТоварыДокумента.Номенклатура,
	               |	ТоварыДокумента.Причина,
	               |	СУММА(ТоварыДокумента.Количество) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ТоварыДокумента
	               |ИЗ
	               |	Документ.КорректировкаЗаказаПокупателя.Товары КАК ТоварыДокумента
	               |ГДЕ
	               |	ТоварыДокумента.Ссылка = &ДокументДвижения
	               |	И (ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |			ИЛИ ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыДокумента.Ссылка.ЗаказПокупателя,
	               |	ТоварыДокумента.Ссылка,
	               |	ТоварыДокумента.Причина,
	               |	ТоварыДокумента.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя,
	               |	ВТ_ТоварыДокумента.Номенклатура,
	               |	ВТ_ТоварыДокумента.Документ КАК Документ,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |				ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ОтказПокупателя)
	               |			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ОтказПоставщика)
	               |		КОНЕЦ) КАК Статус,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	               |				ТОГДА ВТ_ТоварыДокумента.Количество * -1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоОтказКлиента,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_ТоварыДокумента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
	               |				ТОГДА ВТ_ТоварыДокумента.Количество * -1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК КоличествоОтказПоставщика
	               |ИЗ
	               |	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ТоварыДокумента.ЗаказПокупателя,
	               |	ВТ_ТоварыДокумента.Номенклатура,
	               |	ВТ_ТоварыДокумента.Документ";
	
	Возврат ТекстЗапроса;

КонецФункции                   

Функция ПолучитьТекстЗапросаГрузовоеМесто()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ГрузовоеМесто.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаДоставке)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаПодборе)
	|	КОНЕЦ КАК Статус,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_ТоварыДокумента.Количество
	|	КОНЕЦ КАК КоличествоКПогрузке,
	|	ВЫБОР
	|		КОГДА ВТ_ТоварыДокумента.Документ.Погружено
	|			ТОГДА ВТ_ТоварыДокумента.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличесвоНаДоставке
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаСборкаЗаказовПокупателя()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.НаПодборе) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоСобрано
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";	
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьТекстЗапросаЗаказПоставщику()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТоварыДокумента.Заказ КАК ЗаказПокупателя,
	|	ТоварыДокумента.Ссылка КАК Документ,
	|	ТоварыДокумента.Номенклатура,
	|	СУММА(ТоварыДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыДокумента
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Ссылка = &ДокументДвижения
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Заказ,
	|	ТоварыДокумента.Ссылка,
	|	ТоварыДокумента.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыДокумента.ЗаказПокупателя,
	|	ВТ_ТоварыДокумента.Номенклатура,
	|	ВТ_ТоварыДокумента.Документ КАК Документ,
	|	ЗНАЧЕНИЕ(Перечисление.СостояниеЗаказаПокупателя.ЗаказаноПоставщику) КАК Статус,
	|	ВТ_ТоварыДокумента.Количество КАК КоличествоОжидается
	|ИЗ
	|	ВТ_ТоварыДокумента КАК ВТ_ТоварыДокумента";     
	
	Возврат ТекстЗапроса;

КонецФункции

//Контроль изменения данные в документе

Функция ЕстьРазличияЗаписей(ДокументПроверки)  
	
	ТаблицаДокумента = ДокументПроверки.Товары.Выгрузить();
	ТаблицаДокумента.Свернуть("Номенклатура", "Количество");  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаказаПокупателя.Номенклатура,
	|	СУММА(СтатусыЗаказаПокупателя.КоличествоОжидается) КАК Количество
	|ИЗ
	|	РегистрСведений.СтатусыЗаказаПокупателя КАК СтатусыЗаказаПокупателя
	|ГДЕ
	|	СтатусыЗаказаПокупателя.Документ = &Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыЗаказаПокупателя.Номенклатура";
	
	Запрос.УстановитьПараметр("Документ", ДокументПроверки);
	
	ТаблицаСверки = Запрос.Выполнить().Выгрузить();

	ТаблицаРазличий = РазницаТаблицЗначений(ТаблицаДокумента, ТаблицаСверки);
	
	Возврат ТаблицаРазличий.Количество() > 0; 
	
КонецФункции

Функция РазницаТаблицЗначений(ТаблицаИсходная, ТаблицаСравнения)
	
    ВсеКолонки = "";  
	
    Для Каждого Колонка Из ТаблицаИсходная.Колонки Цикл 
        ВсеКолонки = ВсеКолонки + ", " + Колонка.Имя
	КонецЦикла;   
	
    ВсеКолонки = Сред(ВсеКолонки, 2);
    
    Таблица = ТаблицаСравнения.Скопировать();    
    
    Таблица.Колонки.Добавить("Знак", Новый ОписаниеТипов("Число"));
    
    Таблица.ЗаполнитьЗначения(1, "Знак");
    
	Для Каждого Строка Из ТаблицаИсходная Цикл 
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка); 
	КонецЦикла;
    
    Таблица.Колонки.Добавить("Счётчик");
    Таблица.ЗаполнитьЗначения(1, "Счётчик");
    
    Таблица.Свернуть(ВсеКолонки, "Знак, Счётчик");
    
    ТаблицаРазличий = Таблица.Скопировать(Новый Структура("Счётчик", 1), ВсеКолонки + ", Знак");
    ТаблицаРазличий.Сортировать("Номенклатура");
    
    Возврат ТаблицаРазличий;   
    
КонецФункции     

