Процедура ОтправкаПисем() Экспорт 
	//+ Глотов А.И. 21.10.2024 #UT10-4833
	
	//-Получение учетных записей-	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Возврат;  
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КатегорииОбъектов.Объект КАК Справочник.ФизическиеЛица) КАК ФизЛицо
	|ПОМЕСТИТЬ ФизЛица
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьОтчетПоМетрикамТОХ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизЛица.ФизЛицо,
	|	КонтактнаяИнформация.Представление КАК ЭлАдрес
	|ИЗ
	|	ФизЛица КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ФизЛица.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПолучателейПисьма = Запрос.Выполнить().Выгрузить();
	
	
	//-Формирование отчета-
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	//+Гавриленков В. 22.08.2025 #UT10-5394  
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней для отчета по остаткам ТОХ");
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", ТекущаяДата() - (60 * 60 * 24 * (?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 365))));
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", ТекущаяДата() - 60*60*24*365);
	//-Гавриленков В. 22.08.2025 #UT10-5394
	    
	ТабДок = Новый ТабличныйДокумент;
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;     
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;     
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);    
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
		   
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ТабДок);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
		
	КоличествоСтрокОтчета = ТабДок.ВысотаТаблицы - 6;	
	
	Если КоличествоСтрокОтчета <= 0 И Не Справочники.МТ_ПредопределенныеЗначения.РассылатьПустойОтчетПоМетрикам.Значение = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	
	//-Отправка писем-
	ИмяФайла = "МетрикиТОХ_" + Константы.База.Получить() + "_" + Формат(ТекущаяДата(),"ДФ=yyyy.MM.dd");
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ТабДок.Записать(ВременныйКаталог + ИмяФайла + ".XLSX", ТипФайлаТабличногоДокумента.XLSX);
	ТабДок.Записать(ВременныйКаталог + ИмяФайла + ".MXL", ТипФайлаТабличногоДокумента.MXL);

	Для Каждого ТекСтр Из ТаблицаПолучателейПисьма Цикл
			
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "МетрикиТОХ_" + Константы.База.Получить() + "_строк_" + КоличествоСтрокОтчета;
		
		МылоКонтрагента = ТекСтр.ЭлАдрес ;
					
		МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
		
		Для Каждого ТекАдрес Из МассивАдресов Цикл
			Сообщение.Получатели.Добавить(ТекАдрес); 
		КонецЦикла;
			
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Сообщение.Вложения.Добавить(ВременныйКаталог + ИмяФайла + ".XLSX", ТипФайлаТабличногоДокумента.XLSX);
		Сообщение.Вложения.Добавить(ВременныйКаталог + ИмяФайла + ".MXL", ТипФайлаТабличногоДокумента.MXL);
		
		Попытка
			
			Почта.Послать(Сообщение);
			Сообщение.Вложения.Очистить(); 
			ТекстСообщения = "Отправлено письмо " + ТекСтр.ФизЛицо + " на адрес " + МылоКонтрагента + " с отчетом по метрикам ТОХ";
			ЗаписьЖурналаРегистрации("Отправка электронной почты. Успешно", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);

		Исключение	  					
		КонецПопытки;
		
	КонецЦикла;
	
	Почта.Отключиться();
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение  		
	КонецПопытки;
	
	//- Глотов А.И. 21.10.2024 #UT10-4833
КонецПроцедуры
