
//////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Процедура позволяет конфигурации-потребителю событий зарегистрировать
// свои процедуры обработки сообщений в разрезе имен очередей
//
Процедура ПриРегистрацииОбработчиковСообщений(Знач Обработчики) Экспорт

	// Для регистрации обработчика необходимо использовать следующий код:
	//
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10KLG.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10KLG");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10RZN.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10RZN");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10SAM.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10SAM");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10TUL.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10TUL");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10VLD.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10VLD");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10YAR.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10YAR");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10MTZ.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10MTZ");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10KZN.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10KZN");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10VRN.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10VRN");
	 
	 
	 //Белов временный код
	ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10Test.data.bitmdm", "МСК.ОбработатьСообщениеИзОчередиUT10Test");
	 //Белов
	 
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10KLG.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10RZN.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10SAM.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10TUL.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10VLD.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10YAR.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10MTZ.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10KZN.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");
	 ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытия(Обработчики, "UT10VRN.internal.exchange", "МСК.ПринятьСообщениеПоВнутреннемуОбмену");

	 
	//
	// Метод обработчика должен параметры:
	//  - ТекстСообщения - Строка. тело принятого сообщения.
	//  - Отказ - Булево. Если признак Отказ будет установлен в Истина, то сообщение считается необработанным и останется в очереди сервера.

КонецПроцедуры

// Процедура позволяет конфигурации-потребителю событий зарегистрировать
// свои процедуры обработки сообщений в разрезе имен очередей
//
Процедура ПриРегистрацииОбработчиковСообщенийАсинх(Знач Обработчики) Экспорт

	// Для регистрации обработчика необходимо использовать следующий код:
	//
	// ПолучениеСообщенийСлужебный.ДобавитьОбработчикСобытияАсинх(Обработчики, "rmq.my_queue_name", "check", "МойОбщийМодуль.МойМетодОбработки");
	//
	// Метод обработчика должен параметры:
	//  - ТекстСообщения - Строка. тело принятого сообщения.
	//  - Отказ - Булево. Если признак Отказ будет установлен в Истина, то сообщение считается необработанным и останется в очереди сервера.
		
КонецПроцедуры
