Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект    - объект проводимого документа, 
//  ИмяТабличнойЧасти - строка, имя табличной части, которая проводится по регистру, 
//  СтруктураШапкиДокумента - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  Отказ             - флаг отказа в проведении,
//  Заголовок         - строка, заголовок сообщения об ошибке проведения.
//
Процедура КонтрольОстатков(ДокументОбъект, ТаблДвижений, СтруктураШапкиДокумента, Отказ, Заголовок) Экспорт
		//Запрос = Новый Запрос;
		//Запрос.УстановитьПараметр("МоментВремени", ДокументОбъект.МоментВремени());
		//Запрос.УстановитьПараметр("Товары", ТаблДвижений);
		//
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Товары.Номенклатура,
		//|	Товары.СерияНоменклатуры,
		//|	Товары.Количество
		//|ПОМЕСТИТЬ ТаблТовары
		//|ИЗ
		//|	&Товары КАК Товары
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТоварыНаСкладахОстатки.Номенклатура,
		//|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
		//|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокСклад,
		//|	СУММА(ЕСТЬNULL(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток, 0)) КАК ОстатокТОХ,
		//|	ТоварыНаСкладахОстатки.КоличествоОстаток
		//|ПОМЕСТИТЬ ТаблОстатки
		//|ИЗ
		//|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		//|			&Дата,
		//|			(Номенклатура, СерияНоменклатуры) В
		//|				(ВЫБРАТЬ
		//|					ТаблТовары.Номенклатура,
		//|					ТаблТовары.СерияНоменклатуры
		//|				ИЗ
		//|					ТаблТовары КАК ТаблТовары)) КАК ТоварыНаСкладахОстатки
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
		//|				&Дата,
		//|				(Номенклатура, СерияНоменклатуры) В
		//|					(ВЫБРАТЬ
		//|						ТаблТовары.Номенклатура,
		//|						ТаблТовары.СерияНоменклатуры
		//|					ИЗ
		//|						ТаблТовары КАК ТаблТовары)) КАК ТоварыОтветственногоХраненияОстатки
		//|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОтветственногоХраненияОстатки.Номенклатура
		//|			И ТоварыНаСкладахОстатки.СерияНоменклатуры = ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТоварыНаСкладахОстатки.Номенклатура,
		//|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
		//|	ТоварыНаСкладахОстатки.КоличествоОстаток
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТаблТовары.Номенклатура,
		//|	ТаблТовары.СерияНоменклатуры,
		//|	СУММА(ТаблТовары.Количество) КАК Количество,
		//|	СУММА(ТаблОстатки.ОстатокСклад) КАК ОстатокСклад,
		//|	СУММА(ТаблОстатки.ОстатокТОХ) КАК ОстатокТОХ,
		//|	СУММА(ТаблОстатки.ОстатокСклад - ТаблОстатки.ОстатокТОХ) КАК ОстатокСкладБезТОХ
		//|ПОМЕСТИТЬ ИтоговаяТаблица
		//|ИЗ
		//|	ТаблТовары КАК ТаблТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблОстатки КАК ТаблОстатки
		//|		ПО (ТаблОстатки.Номенклатура = ТаблТовары.Номенклатура)
		//|			И (ТаблОстатки.СерияНоменклатуры = ТаблТовары.СерияНоменклатуры)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТаблТовары.Номенклатура,
		//|	ТаблТовары.СерияНоменклатуры
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ИтоговаяТаблица.Номенклатура,
		//|	ИтоговаяТаблица.СерияНоменклатуры,
		//|	ИтоговаяТаблица.Количество КАК КоличествоВДокументе,
		//|	ВЫБОР
		//|		КОГДА ИтоговаяТаблица.ОстатокСкладБезТОХ >= ИтоговаяТаблица.Количество
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫБОР
		//|				КОГДА ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ > ИтоговаяТаблица.ОстатокТОХ
		//|					ТОГДА ИтоговаяТаблица.ОстатокТОХ
		//|				ИНАЧЕ ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ
		//|			КОНЕЦ
		//|	КОНЕЦ КАК Количество,
		//|	ИтоговаяТаблица.ОстатокСклад,
		//|	ИтоговаяТаблица.ОстатокТОХ,
		//|	ИтоговаяТаблица.ОстатокСкладБезТОХ
		//|ИЗ
		//|	ИтоговаяТаблица КАК ИтоговаяТаблица"
		//РезультатЗапроса = Запрос.Выполнить();
		//Выборка = РезультатЗапроса.Выбрать();
		//
		//Пока Выборка.Следующий() Цикл
		//	ОтказПроведения = Истина;
		//	СтрокаСообщения = "Остатка товара "+ Выборка.Номенклатура +" на складе "+ Выборка.Склад + " в ячейке "+ Выборка.Ячейка+" недостаточно.";
		//	УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, Выборка.Свободно , Выборка.Требуется, "", ОтказПроведения, Заголовок);
		//КонецЦикла;
	
	
	
КонецПроцедуры // КонтрольОстатков()
