
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		//ОбъектОтбора = ПолучитьСФПоОснованию(ПараметрКоманды);
		ОбъектОтбора = ПараметрКоманды;
	Иначе
		ОбъектОтбора = ПараметрКоманды;
	КонецЕсли;
	
	ЗначениеОтбора = Новый Структура("Объект", ОбъектОтбора);
	
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	ОткрытьФорму("РегистрСведений.ИсторияОбменовЭДО.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСФПоОснованию(Основание)
	
	ПараметрыОтбора = Новый Структура("Организация", Основание.Организация);
	СчетаФактуры = Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(Основание, ПараметрыОтбора);
	
	Если СчетаФактуры.Количество() > 0 Тогда
		Возврат СчетаФактуры[0].Ссылка;
	Иначе
		Возврат Основание;
	КонецЕсли;
	
КонецФункции
