
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)   
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда  
		
		Если НЕ Неактуально_КорректировкаСборки И ЗначениеЗаполнено(КорректировкаСборки) Тогда
			КорректировкаСборки = Документы.КорректировкаСборкиЗаказовПокупателя.ПустаяСсылка();
		КонецЕсли;	     
		
	КонецЕсли;	    

	Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда  
		
		Если ЭтоНовый() И ПустаяСтрока(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;   
		
		ШтрихкодГрузовогоМеста = Документы.ГрузовоеМесто.ПолучитьШтрихкодГрузоместа(ЭтотОбъект); 
		
	КонецЕсли;
	
КонецПроцедуры

