Функция СоздатьАктОРасхожденияхПослеОтгрузки(Параметры) Экспорт
	
	//+Макрушин Е. 09.02.2026 #UT10-5665
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис CreateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. СоздатьАктОРасхожденияхПослеОтгрузки");
	
	ПараметрыСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Параметры);
	
	РезультатСтруктура = СоздатьНовыйДокументАктОРасхожденияхПослеОтгрузки(ПараметрыСтруктура);
	
	РезультатВыполнения = МСКWEB.ДанныеВJSONХранилище(РезультатСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();    
	ЗаписьЖурналаРегистрации("Web-сервис CreateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. СоздатьАктОРасхожденияхПослеОтгрузки " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	//-Макрушин Е. 09.02.2026 #UT10-5665	
	
КонецФункции

Функция СоздатьНовыйДокументАктОРасхожденияхПослеОтгрузки(ПараметрыСтруктура) Экспорт
	
    ТекстОшибки = "";

	ВидАкта = "АктОРасхожденияхПослеОтгрузки";
	АктСсылка = Документы[ВидАкта].НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ПараметрыСтруктура.ГУИДДокумента);

	Если Не ЗначениеЗаполнено(АктСсылка)  Тогда
		
		ИсходныйДокумент = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.ГУИДПТУ));	
		ИсходныйДокументОбъект = ИсходныйДокумент.ПолучитьОбъект();
		
		Если ИсходныйДокументОбъект = Неопределено Тогда
			
			ТекстОшибки = "В УТ10 не найден документ Реализация товаров и услуг по ИД='" + ПараметрыСтруктура.ГУИДДокумента + "'";
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);				
			Возврат Результат;  
			
		КонецЕсли;
		
		Если ТипЗнч(ПараметрыСтруктура.ТабличнаяЧасть) = Тип("ХранилищеЗначения") Тогда
			ТаблТов = МСКWEB.ХранилищеJSONВСтруктуру(ПараметрыСтруктура.ТабличнаяЧасть);
		Иначе
			ТаблТов = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ПараметрыСтруктура.ТабличнаяЧасть);
		КонецЕсли;
		
		ТаблТов.Свернуть("Номенклатура, КомментарийМенеджера", "Количество");
		
		Если ТаблТов.Количество() = 0 Тогда
		
			ТекстОшибки = "Из УТ10 передана пустая табличная часть";
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);				
			Возврат Результат; 
			
		КонецЕсли;
			
		Для Каждого Строка Из ТаблТов Цикл
			Строка.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ",Строка.Номенклатура);
		КонецЦикла;			
			
		ДопПараметры = Новый Структура("ВебСервисУТ10, Комментарий, ДатаДокумента, НомерДокумента, IDСклада");
		ЗаполнитьЗначенияСвойств(ДопПараметры, ПараметрыСтруктура);
		ДопПараметры.Вставить("ВебСервисУТ10", Истина);
		ДопПараметры.Вставить("ИДДокументаВСмежнойБазе", ПараметрыСтруктура.ГУИДДокумента);
                      
		Если ПараметрыСтруктура.Свойство("РасхожденияКМ") Тогда
			
			Если ТипЗнч(ПараметрыСтруктура.РасхожденияКМ) = Тип("ХранилищеЗначения") Тогда
				ТаблРасхожденияКМ = МСКWEB.ХранилищеJSONВСтруктуру(ПараметрыСтруктура.РасхожденияКМ);
			Иначе
				ТаблРасхожденияКМ = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ПараметрыСтруктура.РасхожденияКМ);
			КонецЕсли;
			
			Для Каждого СтрокаРасхожденияКМ Из ТаблРасхожденияКМ Цикл
				
				СтрокаРасхожденияКМ.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаРасхожденияКМ.Номенклатура);
				СтрокаРасхожденияКМ.КодМаркировки = Справочники.ШтрихКодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", СтрокаРасхожденияКМ.КодМаркировки);
				
			КонецЦикла;

			ДопПараметры.Вставить("ТаблРасхожденияКМ", ТаблРасхожденияКМ);
			
		КонецЕсли;
			
	
		//Создаем акт
		Попытка
			
			АктСсылка = МСКWEB.СоздатьАктОРасхожденияхПослеОтгрузкиВебСервисУТ10(ИсходныйДокумент, ТаблТов, ДопПараметры);
			
			Если ЗначениеЗаполнено(АктСсылка) И Не АктСсылка.Проведен Тогда
				
				ТекстОшибки = "Ошибка при проведении документа, документ записан '"+Строка(АктСсылка)+"'"; 					
				
				Результат = СформироватьСтруктуруОтвета(ТекстОшибки);
				Возврат Результат;
				
			КонецЕсли; 
			
		Исключение
				
			ИнформацияОбОшибке = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = "Ошибка при создании документа " + ВидАкта + " на основании '"+Строка(ИсходныйДокумент)+"'" + Символы.ПС + ИнформацияОбОшибке;
			
			Результат = СформироватьСтруктуруОтвета(ТекстОшибки);
			Возврат Результат; 
			
		КонецПопытки;
			
	Иначе
		
		ТекстОшибки = "В УТ10 уже найден " + ВидАкта + " по реквизиту ИД документа в смежной базе='" + ПараметрыСтруктура.ГУИДДокумента + "'";
		
		Результат = СформироватьСтруктуруОтвета(ТекстОшибки);		
		Возврат Результат; 
		
	КонецЕсли;
		
	Результат = СформироватьСтруктуруОтвета();	
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ТекстОшибки = "") 
	
	Ответ = Новый Структура("Результат,ТекстОшибки");
	Ответ.Результат = ?(ЗначениеЗаполнено(ТекстОшибки), Ложь, Истина);
	Ответ.ТекстОшибки = ТекстОшибки;  
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Загрузка документа АктОРасхожденияхПослеОтгрузки через CreateVarianceAct", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка создании акта о расхождениях после отгрузки, CreateVarianceAct " + СокрЛП(ТекстОшибки));
	КонецЕсли; 	     
	
	Возврат Ответ; 	 
	
КонецФункции