/////////////////Обработка входящих сообщения Раббит//////////////////
Процедура ОбработатьСообщениеИзОчередиUT10KLG(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10KLG", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10RZN(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10RZN", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10SAM(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10SAM", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10TUL(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10TUL", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10VLD(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10VLD", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10YAR(ТекстСообщения, Отказ) Экспорт
	ОбработатьСообщениеИзОчереди("UT10YAR", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10MTZ(ТекстСообщения, Отказ) Экспорт
	
	ОбработатьСообщениеИзОчереди("UT10MTZ", ТекстСообщения, Отказ);
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10Test(ТекстСообщения, Отказ) Экспорт	
	//ОбработатьСообщениеИзОчереди("UT10KLG", ТекстСообщения, Отказ);
	ОбработатьСообщениеИзОчереди("UT10Test", ТекстСообщения, Отказ);	
КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10KZN(ТекстСообщения, Отказ) Экспорт
	
	ОбработатьСообщениеИзОчереди("UT10KZN", ТекстСообщения, Отказ);

КонецПроцедуры

Процедура ОбработатьСообщениеИзОчередиUT10VRN(ТекстСообщения, Отказ) Экспорт
	
	ОбработатьСообщениеИзОчереди("UT10VRN", ТекстСообщения, Отказ);

КонецПроцедуры

/////////////////Процедуры загрузки сообщений//////////////////
Процедура ОбработатьСообщениеИзОчереди(ИмяОчереди, ТекстСообщения, Отказ, КоличествоПопытокОбработки = 0) Экспорт
	
	Если Не ЗначениеЗаполнено(ИмяОчереди) Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 

	ЭтоСообщениеJSON = Найти(ТекстСообщения,"/json");    
	
	Если ЭтоСообщениеJSON Тогда
		
		СтрВидДокумента = Найти(ТекстСообщения, "ВидДокумента");
		
		Если СтрВидДокумента > 0 Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
			СообщениеJSON = ПрочитатьJSON(ЧтениеJSON);
			
			Если ТипЗнч(СообщениеJSON) = Тип("Массив") тогда
				
				СтруктураДокумента = СообщениеJSON[0];		
				ВидДокумента = СтруктураДокумента.ВидДокумента;
				ЗагрузитьДокументПоФабрике(СообщениеJSON, СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ);
				
			Иначе
				
				ВидДокумента = СообщениеJSON.ВидДокумента;
				ЗагрузитьДокументИзСтруктурыПоФабрике(СообщениеJSON, ВидДокумента, ИмяОчереди, Отказ, КоличествоПопытокОбработки);
				
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КодПрикладнойСистемы = ИмяОчереди;	
	Чтение = Новый ЧтениеXML;	
	Пар = Новый ПараметрыЧтенияXML(,,,,,,,,, Истина, Истина);	
	Чтение.УстановитьСтроку(ТекстСообщения, Пар);	
	Фабрика = ФабрикаXDTO.ПрочитатьXML(Чтение);		
	
	Если Фабрика.Свойства().Количество() > 0 Тогда
		
		ТипИмени = Фабрика.Свойства()[0].Имя;
		ИмяОбъектаМетаданныхИсточник = Сред(ТипИмени, Найти(ТипИмени, "_") + 1);
		
		Если ИмяОбъектаМетаданныхИсточник = "ЭквайринговыеТерминалы" Тогда
			ИмяОбъектаМетаданных = "ДоговорыЭквайринга";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ВидОплатыЧекаККМ" Тогда
			ИмяОбъектаМетаданных = "ВидыОплатЧекаККМ"
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "Филиалы" Тогда 
			ИмяОбъектаМетаданных = "Контрагенты";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "СхемыРаботы" Тогда 
			ИмяОбъектаМетаданных = "ТипыЦенНоменклатуры";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ФорматОтправки" Тогда 
			ИмяОбъектаМетаданных = "ФорматыОтправки";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ОтправлятьФорматСтруктурыСчетФактуры" Тогда 
			ИмяОбъектаМетаданных = "ФорматыСтруктуры";   
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ВидыДеятельностиПоКлассификацииПроизводителя" Тогда 
			ИмяОбъектаМетаданных = "ПрофильПроизводителя";   
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "КлассификаторДеталейАвтомобилей" Тогда 
			ИмяОбъектаМетаданных = "НоменклатурныеГруппы";   
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "УпаковкиЕдиницыИзмерения" Тогда 
			ИмяОбъектаМетаданных = "ЕдиницыИзмерения";   
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ШтрихКодыНоменклатуры" Тогда 
			ИмяОбъектаМетаданных = "Штрихкоды";   
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "БанковскиеСчетаКонтрагентов" Тогда 
			ИмяОбъектаМетаданных = "БанковскиеСчета"; 
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "КлассификаторБанковРФ" Тогда 
			ИмяОбъектаМетаданных = "Банки"; 
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "СторонниеСклады" Тогда
			
			Если НЕ Булево(Фабрика[ТипИмени].СтороннийСклад) Тогда
				ИмяОбъектаМетаданных = "Склады";
			Иначе
				ИмяОбъектаМетаданных = ИмяОбъектаМетаданныхИсточник;
			КонецЕсли;

		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "СтраныМира" Тогда 
			ИмяОбъектаМетаданных = "КлассификаторСтранМира";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ГруппыРассылок" Тогда 
			ИмяОбъектаМетаданных = "КатегорииОбъектов";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "ТоварныеГруппыЧестногоЗнака" Тогда 
			ИмяОбъектаМетаданных = "ТоварныеГруппыЧЗ";
		ИначеЕсли ИмяОбъектаМетаданныхИсточник = "КлассификаторОКПД2" Тогда 
			ИмяОбъектаМетаданных = "КодыОКПД2";
		Иначе
			ИмяОбъектаМетаданных = ИмяОбъектаМетаданныхИсточник;
		КонецЕсли;
		
		СправочникЗагрузки = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ИмяОбъектаМетаданных);
		
		Если Не ЗначениеЗаполнено(СправочникЗагрузки) ИЛИ НЕ СправочникЗагрузки.Загружать Тогда
			
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Справочник " 
			+ ИмяОбъектаМетаданных + " не настроен для загрузки в справочнике СправочникиЗагрузки. Сообщение отклонено.");
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		ФабрикаИмени = Фабрика[ТипИмени];
		
		Если ИмяОбъектаМетаданныхИсточник = "Филиалы" Тогда
			
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаИмени, "ФилиалКонтрагент", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда 				
				
				БылиОшибки = Ложь;
				
				Для Каждого Стр Из МассивСтрок Цикл
					
					ГУИДГоловногоКонтрагента = Стр.КонтрагентФилиала.GUID; 
					
					ГоловнойСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ГУИДГоловногоКонтрагента);
					
					Если ГоловнойСсылка = Справочники.Контрагенты.ПустаяСсылка() Тогда   						
						
						БылиОшибки = Истина;
						Продолжить;   					
						
					КонецЕсли;
					
					СпрОбъект = ПолучитьОбъектПоФабрике(ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы, Ложь);

					Если СпрОбъект = Неопределено ИЛИ СпрОбъект.Ссылка.Пустая() Тогда
						
						Если СокрЛП(Стр.КодАвардаФилиала) = "ОбъектXDTO" ИЛИ НЕ ЗначениеЗаполнено(СокрЛП(Стр.КодАвардаФилиала)) Тогда 						
							СпрОбъект = ПолучитьОбъектПоФабрике(ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы, Истина);
						Иначе
							
							СпрОбъект = ПолучитьКонтрагентаПоКодуАварды(Стр.КодАвардаФилиала);
							СпрОбъект.IDФилиала = Стр.КодАвардаФилиала;						
							
						КонецЕсли;
						
					Иначе
						
						Если НЕ СокрЛП(Стр.КодАвардаФилиала) = "ОбъектXDTO" И  ЗначениеЗаполнено(СокрЛП(Стр.КодАвардаФилиала)) Тогда 													
							СпрОбъект.IDФилиала = Стр.КодАвардаФилиала;						
						КонецЕсли;  						
						
					КонецЕсли;
					
					СпрОбъект.ГоловнойКонтрагент = ГоловнойСсылка;
					ЗаполнитьОбъектЗагрузки(СпрОбъект, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки);					

					Если ЗначениеЗаполнено(СпрОбъект.ГоловнойКонтрагент) И ЗначениеЗаполнено(СпрОбъект.МенеджерМСК) Тогда
						
						ГоловнойОбъект = ГоловнойСсылка.ПолучитьОбъект();
						ГоловнойОбъект.МенеджерМСК = СпрОбъект.МенеджерМСК;
						ГоловнойОбъект.ОбменДанными.Загрузка = Истина; 
						ГоловнойОбъект.Записать();
						
					КонецЕсли;					

					Если ЗначениеЗаполнено(СпрОбъект.ГоловнойКонтрагент) И СпрОбъект.ЦентрФинансовойОтветственности И СпрОбъект.МенеджерыПокупателя.Количество() > 0 Тогда
						
						ЕстьТПВГоловном = СпрОбъект.ГоловнойКонтрагент.МенеджерыПокупателя.Найти(СпрОбъект.МенеджерыПокупателя[0].МенеджерПокупателя);
						
						Если ЕстьТПВГоловном = Неопределено Тогда
							
							ОбъектГоловнойКонтрагент = СпрОбъект.ГоловнойКонтрагент.ПолучитьОбъект();
							ОбъектГоловнойКонтрагент.МенеджерыПокупателя.Очистить();
							НовыйМенеджер = ОбъектГоловнойКонтрагент.МенеджерыПокупателя.Добавить();
							ЗаполнитьЗначенияСвойств(НовыйМенеджер,СпрОбъект.МенеджерыПокупателя[0]);
							ОбъектГоловнойКонтрагент.ОсновнойМенеджерПокупателя = СпрОбъект.МенеджерыПокупателя[0].МенеджерПокупателя;
							ОбъектГоловнойКонтрагент.ОбменДанными.Загрузка = Истина;
							ОбъектГоловнойКонтрагент.Записать();
							
						КонецЕсли;
						
					КонецЕсли;

				КонецЦикла; 				
				
				Если БылиОшибки Тогда 					
					ВызватьИсключение "Не найден головной контрагент для филиала: " + ФабрикаИмени.Наименование;					
				КонецЕсли;
				
			Иначе
				
				ВызватьИсключение "Не найден головной контрагент для филиала: " + ФабрикаИмени.Наименование;
				
			КонецЕсли;
			
		Иначе			

			СправочникЗагрузики = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ИмяОбъектаМетаданных);			
			
			Если СправочникЗагрузики <> Неопределено И СправочникЗагрузики.ТипДанных = "Справочники"  Тогда
				
				Если ИмяОбъектаМетаданных = "ДоговорыКонтрагентов"  Тогда
					
					ПромОрганизация = Справочники.Организации.НайтиПоРеквизиту("КодМДМГоловнойОрганизации", СокрЛП(ФабрикаИмени.Организация.GUID));
					
					Если НЕ ЗначениеЗаполнено(ПромОрганизация) Тогда
						ВызватьИсключение "Не найдена организация для договора: " + ФабрикаИмени.Наименование+ " контрагента  "
						+ СокрЛП(Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаИмени.Владелец.GUID)).Наименование);
					КонецЕсли;	  
					
				ИначеЕсли  ИмяОбъектаМетаданных = "ПоставщикиТОХ" Тогда
					
					ПромОрганизация = Справочники.Организации.НайтиПоРеквизиту("КодМДМГоловнойОрганизации", СокрЛП(ФабрикаИмени.Организация.GUID));
					
					Если НЕ ЗначениеЗаполнено(ПромОрганизация) Тогда
						ВызватьИсключение "Поставщик ТОХ не принадлежит организации с кодом : " + СокрЛП(ФабрикаИмени.Организация.GUID);
					КонецЕсли;

				КонецЕсли;

				СпрОбъект = ПолучитьОбъектПоФабрике(ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы);   			
				ЗаполнитьОбъектЗагрузки(СпрОбъект, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки);
				
			ИначеЕсли СправочникЗагрузики <> Неопределено И СправочникЗагрузики.ТипДанных = "СправочникиМДМ" Тогда 	
				
				Если СправочникЗагрузки.ИмяСправочника = "Производители" Тогда     
					
					ЗаменяющийСправочник = "Номенклатура";
					ЭтоГруппа = Истина;      
					СпрОбъект = ПолучитьОбъектПоФабрике(ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы, , , ЭтоГруппа , ЗаменяющийСправочник );   			
					ЗаполнитьОбъектЗагрузки(СпрОбъект, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки, ЗаменяющийСправочник);	
					
				КонецЕсли; 
				
			ИначеЕсли СправочникЗагрузики <> Неопределено И СправочникЗагрузики.ТипДанных = "РегистрыСведений" Тогда 				

				РСЗапись = Неопределено;
				РСЗаписи = ПолучитьРегистрСведенийПоФабрике(РСЗапись, ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы);
				ЗаполнитьОбъектРегистраСведений(РСЗаписи, РСЗапись, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки );
				
			КонецЕсли; 
			
		КонецЕсли; 		
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработатьСообщениеJSON(Сообщение, Отказ) Экспорт
	
	ИмяОчереди = Сообщение.Подписка.ИмяОчереди;     
	ТекстСообщения = Сообщение.Данные;
	
	Если Не ЗначениеЗаполнено(ИмяОчереди) Тогда
		
		Отказ = Истина;      
		ЗаписьЖурналаРегистрации("ОбработатьСообщениеJSON", УровеньЖурналаРегистрации.Информация,, Сообщение, "Не заполнено имя очереди в подписке " + Сообщение.Подписка);
		Возврат;
		
	КонецЕсли; 
	
	ВидДокумента = Справочники.Р_ВходящиеСообщения.ПолучитьВидДокументаИзПараметров(Сообщение);  
	
	Если Найти(ВРЕГ(ТекстСообщения), "ID_EDI") > 0 Тогда
		
		ОбработатьСообщениеИзЭДО(Сообщение, ВидДокумента, Отказ);  
		Возврат;

	ИначеЕсли Маркировка.ЭтоОчередьПоМаркировке(ИмяОчереди)	Тогда
		
		Если ВидДокумента = "ПоступлениеТоваровУслуг" 			
			//+Макрушин Е. 27.02.2026 #UT10-5657
			ИЛИ ВидДокумента = "КорректировкаПоступления" Тогда
			//-Макрушин Е. 27.02.2026 #UT10-5657
			
			
			ОбработатьСообщениеИзЭДО(Сообщение, ВидДокумента, Отказ);
			Возврат;
		
		КонецЕсли;

		Маркировка.ОбработатьСообщениеПоМаркировке(Сообщение.Данные,Отказ,Сообщение.Подписка,Сообщение.Параметры,Сообщение);
		Возврат;
		
	ИначеЕсли МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) Тогда
		ВидДокумента = "УстановкаЦенНоменклатурыКонтрагентов";  
		
	ИначеЕсли МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) Тогда
		ВидДокумента = "УстановкаЦенНоменклатурыКонтрагентов"; 
		//+Белов А. 14.09.2026 #UT10-6038
	ИначеЕсли МСК.ЭтоОчередьУТ10ВУТ10(ИмяОчереди) Тогда
		//-Белов А. 14.09.2026 #UT10-6038	
	Иначе	
		
		Если Найти(ТекстСообщения, "/json") = 0 Тогда
			
			Отказ = Истина;      
			ЗаписьЖурналаРегистрации("ОбработатьСообщениеJSON", УровеньЖурналаРегистрации.Информация,, Сообщение, "Текст сообщения не содержит подстроку '/json'");
			Возврат;   
			
		КонецЕсли;
		
		СтрВидДокумента = Найти(ТекстСообщения, "ВидДокумента");    
		
		Если СтрВидДокумента = 0 Тогда
			
			Отказ = Истина;      
			ЗаписьЖурналаРегистрации("ОбработатьСообщениеJSON", УровеньЖурналаРегистрации.Информация,, Сообщение, "Не определен вид документа");
			Возврат;   
			
		КонецЕсли; 
	
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
		СообщениеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Если ТипЗнч(СообщениеJSON) = Тип("Массив") тогда
			
			СтруктураДокумента = СообщениеJSON[0];	
			
			Если СтруктураДокумента.Свойство("ВидДокумента") Тогда
				ВидДокумента = СтруктураДокумента.ВидДокумента;
			КонецЕсли;
			
			ЗагрузитьДокументПоФабрике(СообщениеJSON, СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ);
			
		Иначе
			
			Если СообщениеJSON.Свойство("ВидДокумента") Тогда
				ВидДокумента = СообщениеJSON.ВидДокумента;
			КонецЕсли;
			
			//+Шульман А. 02.07.2026 #UT10-5944
			СообщениеJSON.Вставить("КодСообщения", Сообщение.Код);  
			//-Шульман А. 02.07.2026 #UT10-5944
			ЗагрузитьДокументИзСтруктурыПоФабрике(СообщениеJSON, ВидДокумента, ИмяОчереди, Отказ, Сообщение.КоличествоПопытокПовторнойОбработки);  
			
		КонецЕсли;
		
		Справочники.Р_ВходящиеСообщения.ПометитьВходящееОбработанным(Сообщение);   
		
	Исключение
		
		ТекстОшибки = "Не удалось загрузить сообщение в " + ВидДокумента + ". " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(Сообщение, ТекстОшибки);		
		
	КонецПопытки;
	
КонецПроцедуры       

Процедура ОбработатьСообщениеИзЭДО(Сообщение, ВидДокумента, Отказ) Экспорт   
	
	ТекстСообщения = Сообщение.Данные;    
	
	Если ВидДокумента = "" Тогда
	
		Отказ = Истина;      
		ТекстОшибки = "Не удалось определить вид документа"; 
		Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(Сообщение, ТекстОшибки);	
		Возврат;
		
	КонецЕсли;    
	
	ТекстОшибки = "";
	
	Попытка
		
		Если ВидДокумента = "ПоступлениеТоваровУслуг" Тогда
			
			//+Шульман А. 26.03.2026 #UT10-5785 
			//ЗагрузитьПоступлениеТоваровУслугИзЭДО(ТекстСообщения, ТекстОшибки, Отказ);  
			ДокПТУ = ЗагрузитьПоступлениеТоваровУслугИзЭДО(ТекстСообщения, ТекстОшибки, Отказ, Сообщение);  
			//-Шульман А. 26.03.2026 #UT10-5785
			
			//+Шульман А. 25.02.2026 #UT10-5713       
			//Справочники.Р_ВходящиеСообщения.ПометитьВходящееОбработанным(Сообщение);   
			
			Если ПустаяСтрока(ТекстОшибки) Тогда
				Справочники.Р_ВходящиеСообщения.ПометитьВходящееОбработанным(Сообщение);
				
				//+Сёмин Р.И. 09.06.2026 #UT10-5900
			ИначеЕсли ЗначениеЗаполнено(Найти(ТекстОшибки, "#Пропустить_Сообщение#")) Тогда
				
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "#Пропустить_Сообщение#", "");
				Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуБезУстановкиПометок(Сообщение, ТекстОшибки);
				//-Сёмин Р.И. 09.06.2026 #UT10-5900
				
			Иначе		
				Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(Сообщение, ТекстОшибки);		
			КонецЕсли;     
			//-Шульман А. 25.02.2026 #UT10-5713

		//+Макрушин Е. 26.02.2026 #UT10-5657
		ИначеЕсли ВидДокумента = "КорректировкаПоступления" Тогда
				
			ЗагрузитьКорректировкуПоступленияИзЭДО(ТекстСообщения, ТекстОшибки, Отказ);   
			
			Если ПустаяСтрока(ТекстОшибки) Тогда
				Справочники.Р_ВходящиеСообщения.ПометитьВходящееОбработанным(Сообщение);   
			Иначе		
				Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(Сообщение, ТекстОшибки);		
			КонецЕсли;     

		//-Макрушин Е. 26.02.2026 #UT10-5657
		КонецЕсли;
		
	Исключение
		
		Если ПустаяСтрока(ТекстОшибки) Тогда
			ТекстОшибки = "Не удалось загрузить сообщение в " + ВидДокумента + ". " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		КонецЕсли;    
		
		Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(Сообщение, ТекстОшибки);		
		
	КонецПопытки;        
		
	//+Шульман А. 26.03.2026 #UT10-5785
	Если ВидДокумента = "ПоступлениеТоваровУслуг" И ЗначениеЗаполнено(ДокПТУ) Тогда  //+Белов А. 18.05.2026 #UT10-5856 - добавил проверку на заполненность ДокПТУ    
		AMQP_РаботаСДокументами.СоздатьИсходящееСообщениеПоИтогамЗагрузкиПТУ(Сообщение, ДокПТУ, ТекстОшибки);
	КонецЕсли;        
	//-Шульман А. 26.03.2026 #UT10-5785
	
КонецПроцедуры	

Процедура ЗагрузитьСообщениеИзУТ10(Сообщение, ВидДокумента, Отказ)
//+Белов А. 14.09.2026 #UT10-6038

//-Белов А. 14.09.2026 #UT10-6038		
КонецПроцедуры


Процедура ОбработатьРеквизитыФабрики(СпрОбъект, ИмяОбъектаМетаданных, ФабрикаСправочника, ИмяОчереди)
	
	Если ИмяОбъектаМетаданных = "ЭквайринговыеТерминалы" Тогда
		
		СпрОбъект.Эквайрер = СсылкаПоИдентификатору(Тип("СправочникСсылка.Контрагенты"), ФабрикаСправочника.Эквайер.GUID);
		СпрОбъект.ДоговорВзаиморасчетов = СсылкаПоИдентификатору(Тип("СправочникСсылка.ДоговорыКонтрагентов"), ФабрикаСправочника.ДоговорВзаиморасчетов.GUID);
		СпрОбъект.Касса = СсылкаПоИдентификатору(Тип("СправочникСсылка.Кассы"), ФабрикаСправочника.Касса.GUID);
		СпрОбъект.Номер = ФабрикаСправочника.Код;
		СпрОбъект.Пароль = ФабрикаСправочника.Пароль;
		СпрОбъект.ПометкаУдаления = XMLЗначение(Тип("Булево"), ФабрикаСправочника.ПометкаУдаления);
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
		СпрОбъект.ТарифыЗаРасчетноеОбслуживание.Очистить();
		
		Если ТипЗнч(ФабрикаСправочника.ТарифыЗаРасчетноеОбслуживание) = Тип("ОбъектXDTO") Тогда
			
			Если ТипЗнч(ФабрикаСправочника.ТарифыЗаРасчетноеОбслуживание.Строка) = Тип("СписокXDTO") Тогда
				Массив = ФабрикаСправочника.ТарифыЗаРасчетноеОбслуживание.Строка;
			Иначе
				
				Массив = Новый Массив;
				Массив.Добавить(ФабрикаСправочника.ТарифыЗаРасчетноеОбслуживание.Строка);
				
			КонецЕсли;   
			
			Для Каждого Строка Из Массив Цикл
				
				НоваяСтрока = СпрОбъект.ТарифыЗаРасчетноеОбслуживание.Добавить();
				НоваяСтрока.ПроцентТорговойУступки = XMLЗначение(Тип("Число"), Строка.ПроцентТорговойУступки);
				НоваяСтрока.ВидОплаты = СсылкаПоИдентификатору(Тип("СправочникСсылка.ВидыОплатЧекаККМ"), Строка.ВидОплаты.GUID);
				
			КонецЦикла;
			
		КонецЕсли;
		
		СпрОбъект.Касса = Справочники.Кассы.ПустаяСсылка();
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "КассыПодключенныеКТерминалу", "Строка");
		
		Для Каждого Строка Из МассивСтрок Цикл
			
			Если ТипЗнч(Строка.Касса) = Тип("ОбъектXDTO") И Строка.Касса.Свойства().Количество() > 0 И Строка.Касса.Свойства().Получить("GUID") <> Неопределено Тогда		
				
				Касса = Справочники.Кассы.НайтиПоРеквизиту("КодМДМ", Строка.Касса.GUID); 
				
				Если ЗначениеЗаполнено(Касса) Тогда
					
					СпрОбъект.Касса = Касса;
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИмяОбъектаМетаданных = "ВидОплатыЧекаККМ" Тогда
		
		СпрОбъект.ТипОплаты = СсылкаПоИдентификатору(Тип("ПеречислениеСсылка.ТипыОплатЧекаККМ"), ФабрикаСправочника.ТипОплаты.Перечисление);
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.ПометкаУдаления = ФабрикаСправочника.ПометкаУдаления;
		
	ИначеЕсли ИмяОбъектаМетаданных = "Валюты" Тогда
		
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Код = ФабрикаСправочника.Код;					
		
	ИначеЕсли ИмяОбъектаМетаданных = "Организации" Тогда
		
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		СпрОбъект.Наименование = ФабрикаСправочника.НаименованиеСокращенное;
		СпрОбъект.ИНН = ФабрикаСправочника.ИНН;
		СпрОбъект.КПП = ФабрикаСправочника.КПП;
		СпрОбъект.КодПоОКПО = ФабрикаСправочника.ОКПО;
		СпрОбъект.ОГРН = ФабрикаСправочника.ОГРН;
		СпрОбъект.КодПоОКАТО = ФабрикаСправочника.ОКАТО; 		
		СпрОбъект.СвидетельствоДатаВыдачи = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаРегистрации);		
		СпрОбъект.Префикс = ФабрикаСправочника.Префикс;
		СпрОбъект.КодИМНС = ФабрикаСправочника.КодИФНС;
		СпрОбъект.КодМДМГоловнойОрганизации = СокрЛП(ФабрикаСправочника.ГоловнаяОрганизация.GUID);
		
		ЗаполнитьРеквизитПоСоответствию(ФабрикаСправочника.ЮрФизЛицо, "GUID", СпрОбъект, "ЮрФизЛицо", ИмяОчереди);
		
		СпрОбъект.ОтражатьВРегламентированномУчете = ?(ФабрикаСправочника.ОтражатьВРегламентированномУчете = "true", Истина, Ложь);	
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ЮридическоеНаименованиеПодразделения") = Неопределено Тогда
			СпрОбъект.НаименованиеПодразделения = ФабрикаСправочника.ЮридическоеНаименованиеПодразделения; 
		КонецЕсли;			

	ИначеЕсли ИмяОбъектаМетаданных = "Контрагенты" Тогда
		
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		
		Если Булево(ФабрикаСправочника.НеЗагружатьИННвЦелевыеСистемы) <> Истина Тогда
			СпрОбъект.ИНН = ФабрикаСправочника.ИНН;
			СпрОбъект.КПП = ФабрикаСправочника.КПП;
		КонецЕсли;
		
		СпрОбъект.Комментарий = ФабрикаСправочника.Комментарий;
		
		СпрОбъект.КодМДМПартнера = ФабрикаСправочника.Партнер.GUID;
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;			
		
		Если СпрОбъект.ЭтоНовый() Тогда
			СпрОбъект.ГоловнойКонтрагент = СпрОбъект.ПолучитьСсылкуНового();
		Иначе
			СпрОбъект.ГоловнойКонтрагент = СпрОбъект.Ссылка;
		КонецЕсли;
		
		СпрОбъект.Покупатель = Булево(ФабрикаСправочника.Покупатель);
		СпрОбъект.Поставщик = Булево(ФабрикаСправочника.Поставщик);
		
		СпрОбъект.IDАварда = ФабрикаСправочника.КодАварда;
		СпрОбъект.IDФилиала = "";
		
		ЗаполнитьРеквизитПоСоответствию(ФабрикаСправочника.ЮрФизЛицо, "GUID", СпрОбъект, "ЮрФизЛицо", ИмяОчереди);
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "КонтактнаяИнформация", "Строка");
		ЗагрузитьКонтактнуюИнформацию(МассивСтрок, СпрОбъект, ИмяОчереди);
		
		СпрОбъект.AMQP_ПроверятьВзаиморасчетыЧерезБиллинг = ?(СпрОбъект.ЭтоНовый(), Булево(ФабрикаСправочника.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг), 
		ПроверятьВзаимоарасчетыЧерезБиллингКонтроль(СпрОбъект)); 
		
		Если ФабрикаСправочника.МетодКонтроляВзаиморасчетовЧерезБиллинг.Перечисление = "По каждому договору" Тогда
			СпрОбъект.AMQP_МетодКонтроляВзаиморасчетовЧерезБиллинг = Перечисления.МетодыКонтроляВзаиморасчетовЧерезБиллинг.ПоКаждомуДоговору;
		ИначеЕсли ФабрикаСправочника.МетодКонтроляВзаиморасчетовЧерезБиллинг.Перечисление = "По всем договорам контрагента" Тогда
			СпрОбъект.AMQP_МетодКонтроляВзаиморасчетовЧерезБиллинг = Перечисления.МетодыКонтроляВзаиморасчетовЧерезБиллинг.ПоВсемДоговорамКонтрагента;
		ИначеЕсли ФабрикаСправочника.МетодКонтроляВзаиморасчетовЧерезБиллинг.Перечисление = "По всем договорам в разрезе организаций" Тогда
			СпрОбъект.AMQP_МетодКонтроляВзаиморасчетовЧерезБиллинг = Перечисления.МетодыКонтроляВзаиморасчетовЧерезБиллинг.ПоВсемДоговорамВРазрезеОрганизаций;
		Иначе
			СпрОбъект.AMQP_МетодКонтроляВзаиморасчетовЧерезБиллинг = Перечисления.МетодыКонтроляВзаиморасчетовЧерезБиллинг.ПустаяСсылка();
		КонецЕсли;
		
		СпрОбъект.AMQP_ДатаНачалаВеденияВзаиморасчетовЧерезБиллинг = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаВеденияВзаиморасчетовЧерезБиллинг);
		СпрОбъект.AMQP_ОтправлятьДокументы = Булево(ФабрикаСправочника.ОтправлятьДокументыAMQP);
		СпрОбъект.НеОбъединятьЗаказы = Булево(ФабрикаСправочника.НеОбъединятьЗаказы);  
		//+Шульман А. 25.02.2026 #UT10-5712  
		СпрОбъект.ЗагружатьУПДОтКонтрагентаИзЭДО = Булево(ФабрикаСправочника.ЗагружатьУПДОтКонтрагентаИзЭДО);  
		//-Шульман А. 25.02.2026 #UT10-5712
		
		СпрОбъект.EMailЗаказ_КонтролироватьРасхождениеЦенВПроцентах = ФабрикаСправочника.EMailЗаказ_КонтролироватьРасхождениеЦенВПроцентах;
		
		Если НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "другое" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.Другое;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "рекомендации" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.Рекомендации;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "поиск в интернете" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.ПоискВИнтернете;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "регистрация с сайта" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.РегистрацияССайта;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "исходящий звонок" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.ИсходящийЗвонок;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "входящий звонок" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.ВходящийЗвонок;
		ИначеЕсли НРег(ФабрикаСправочника.ИсточникКонтакта.Перечисление) = "личное посещение" Тогда
			СпрОбъект.ИсточникКонтакта = Перечисления.ИсточникКонтакта.ЛичноеПосещение;
		КонецЕсли;    
		
		СпрОбъект.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом = Булево(ФабрикаСправочника.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом);
		
		СпрОбъект.ОтправлятьУПДЧерезЭДО = Булево(ФабрикаСправочника.ОтправлятьДокументыЧерезЭДО);
		СпрОбъект.ДатаНачалаОбменаЧерезЭДО = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаОбменаЭДО);
		СпрОбъект.БезналичныеПлатежиИзУТ11НеПереносятсяРегламентнымЗаданием = Булево(ФабрикаСправочника.БезналичныеПлатежиИзУТ11НеПереносятсяРегламентнымЗаданием);
		СпрОбъект.СамовывозУправленческий = Булево(ФабрикаСправочника.СамовывозУправленческий);

		Если НЕ ФабрикаСправочника.Свойства().Получить("ОплатаПоСчетам") = Неопределено Тогда 
			СпрОбъект.ОплатаПоСчетам = Булево(ФабрикаСправочника.ОплатаПоСчетам);
		КонецЕсли;
		
		СпрОбъект.ДатаНачалаОбменаВНовомФормате = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаОбменаВНовомФормате);
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("СтатусФНСКонтрагента") = Неопределено Тогда
			
			ЗаполнитьСвойствоПоПоискуКодаМДМ("СтатусыФНСКонтрагента", СпрОбъект, "СтатусФНСКонтрагента", ФабрикаСправочника.СтатусФНСКонтрагента);
			
			Если НЕ ЗначениеЗаполнено(СпрОбъект.СтатусФНСКонтрагента) И ЗначениеЗаполнено(ФабрикаСправочника.СтатусФНСКонтрагента.GUID) Тогда
				
				НовыйСтатусФНСКонтрагента = Справочники.СтатусыФНСКонтрагента.СоздатьЭлемент();
				НовыйСтатусФНСКонтрагента.ОбменДанными.Загрузка = Истина;
				НовыйСтатусФНСКонтрагента.КодМДМ = СокрЛП(ФабрикаСправочника.СтатусФНСКонтрагента.GUID);
				НовыйСтатусФНСКонтрагента.Записать();
				СпрОбъект.СтатусФНСКонтрагента = НовыйСтатусФНСКонтрагента.Ссылка;
				
			КонецЕсли;			
			
		КонецЕсли; 

		Если НЕ ФабрикаСправочника.Свойства().Получить("DS_контрагент_ID") = Неопределено Тогда
			СпрОбъект.DS_контрагент_ID = Число(ФабрикаСправочника.DS_контрагент_ID); 
		КонецЕсли;	

		Если НЕ ФабрикаСправочника.Свойства().Получить("DS_Подразделение_ID") = Неопределено Тогда
			СпрОбъект.DS_Подразделение_ID = Число(ФабрикаСправочника.DS_Подразделение_ID); 
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ВУКДВыводитьЮрАдрес") = Неопределено Тогда
			СпрОбъект.ВУКДВыводитьЮрАдрес = Булево(ФабрикаСправочника.ВУКДВыводитьЮрАдрес); 
		КонецЕсли;
		
	ИначеЕсли ИмяОбъектаМетаданных = "Филиалы" Тогда
		
		СпрОбъект.СкладКодМДМ = ФабрикаСправочника.СкладФилиала.GUID;
		СпрОбъект.ТранзитныйСкладКодМДМ = ФабрикаСправочника.СкладФилиалаТранзитный.GUID;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.IDАварда = "";		
		СпрОбъект.РасписаниеРаботыСтрокой = ФабрикаСправочника.РасписаниеРаботы;  
		
		//+Белов А. 01.09.2026 #UT10-6033
		СпрОбъект.ИДбазы = ФабрикаСправочника.ИДбазы;  
		//-Белов А. 01.09.2026 #UT10-6033
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "КонтактнаяИнформация", "Строка");
		ЗагрузитьКонтактнуюИнформацию(МассивСтрок, СпрОбъект, ИмяОчереди);
		
		Если НЕ СпрОбъект.Ссылка = Константы.ПолучательЭкспертизныхТоваров.Получить() Тогда
			
			ЗаполнитьСвойствоПоПоискуКодаМДМ("МаршрутыДоставки", СпрОбъект, "МаршрутДоставки", ФабрикаСправочника.МаршрутДоставки);
			
			СпрОбъект.ОчередиДоставки.Очистить();
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ОчередиДоставки", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для каждого Очередь Из МассивСтрок Цикл 				
					
					НоваяСтрока = СпрОбъект.ОчередиДоставки.Добавить();
					ЗаполнитьСвойствоПоПоискуКодаМДМ("ОчередьДоставки", НоваяСтрока, "Очередь", Очередь.ОчередьДоставки);				
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СпрОбъект.ПечатьТТН = Булево(ФабрикаСправочника.ПечататьТТН);
		СпрОбъект.МинимальнаяСуммаДоставки = ?(ФабрикаСправочника.МинимальнаяСуммаДоставки = "", 0, Число(ФабрикаСправочника.МинимальнаяСуммаДоставки));     		
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеГрузополучателя;
		СпрОбъект.ОтправлятьСчетПоПочте = Булево(ФабрикаСправочника.ОтправлятьСчетПоПочте);
		
		ФорматExcelЗначение = ФабрикаСправочника.ОтправлятьСчетПоПочтеФорматОтправки.Перечисление;
		СпрОбъект.ФорматExcelДляСчета = ?(ЗначениеЗаполнено(ФорматExcelЗначение), Перечисления.ФорматExcel[ФорматExcelЗначение], Неопределено);
		
		СпрОбъект.ОтправлятьСчетФактуруПоПочте = Булево(ФабрикаСправочника.ОтправлятьСчетФактуруПоПочте);
		
		ФорматExcelЗначение = ФабрикаСправочника.ОтправлятьСчетФактуруПоПочтеФорматОтправки.Перечисление;
		СпрОбъект.ФорматExcel = ?(ЗначениеЗаполнено(ФорматExcelЗначение), Перечисления.ФорматExcel[ФорматExcelЗначение], Неопределено);
		
		ВидСФЗначение = ФабрикаСправочника.ОтправлятьСчетФактуруПоПочтеСтруктура.Перечисление;
		СпрОбъект.ВидОтправляемойСФ = ?(ЗначениеЗаполнено(ВидСФЗначение), Перечисления.ВидСчетФактурыДляКонтрагента[ВидСФЗначение], Неопределено);
		
		СпрОбъект.ОтправлятьТорг12ПоПочте = Булево(ФабрикаСправочника.ОтправлятьТорг12ПоПочте);
		
		СпособДоставкиЗначение = ФабрикаСправочника.СпособДоставки.Перечисление;
		СпрОбъект.СпособДоставки = ?(ЗначениеЗаполнено(СпособДоставкиЗначение), Перечисления.СпособДоставки[СпособДоставкиЗначение], Неопределено);
		
		СпрОбъект.Павильон = ФабрикаСправочника.Павильон;  
		
		СпрОбъект.ВремяПриемкиТовара = ФабрикаСправочника.ВремяПриемкиТовара;
		
		СпрОбъект.НеСоздаватьСборкуВАвтоматическомРежимеПриСамовывозе = Булево(ФабрикаСправочника.НеСобиратьАвтоматическиПриСамовывозе);
		
		СпрОбъект.НеСоздаватьСборкуВАвтоматическомРежимеПриДоставке = Булево(ФабрикаСправочника.НеСобиратьАвтоматическиПриДоставке); 
		
		СпрОбъект.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Булево(ФабрикаСправочника.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала); 
		
		СпрОбъект.КПП = ФабрикаСправочника.КППДляПечати;

		СпрОбъект.ВидыДеятельности.Очистить();
		Значение = ФабрикаСправочника.ВидДеятельностиКонтрагента;
		
		Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() > 0 
		   И Значение.Свойства().Получить("GUID") <> Неопределено и Значение.GUID <> Неопределено Тогда	//т.е. значение в МДМ заполнено		
			
			НоваяСтрока = СпрОбъект.ВидыДеятельности.Добавить();
			ЗаполнитьСвойствоПоПоискуКодаМДМ("ВидыДеятельностиКонтрагентов", НоваяСтрока, "ВидДеятельности", Значение);
			
		КонецЕсли;
		
		Если СпрОбъект.ВидыДеятельности.Количество() > 0 И Не ЗначениеЗаполнено(СпрОбъект.ОсновнойВидДеятельности) Тогда
			СпрОбъект.ОсновнойВидДеятельности = СпрОбъект.ВидыДеятельности[0].ВидДеятельности; 
		КонецЕсли;

		СпрОбъект.ВидыДеятельностиДляПроизводителя.Очистить();
		Значение = ФабрикаСправочника.ВидДеятельностиПоКлассификацииПроизводителя;
		
		Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() > 0 
		   И Значение.Свойства().Получить("GUID") <> Неопределено и Значение.GUID <> Неопределено Тогда	//т.е. значение в МДМ заполнено		
			
			НоваяСтрока = СпрОбъект.ВидыДеятельностиДляПроизводителя.Добавить();
			ЗаполнитьСвойствоПоПоискуКодаМДМ("ПрофильПроизводителя", НоваяСтрока, "ВидДеятельности", Значение);
			
		КонецЕсли;		

		СпрОбъект.EMailЗаказ_АдресЭлПочты = ФабрикаСправочника.EMailЗаказ_АдресЭлПочты;
		СпрОбъект.EMailЗаказ_НомерПервойСтроки = ФабрикаСправочника.EMailЗаказ_НомерПервойСтроки;
		СпрОбъект.EMailЗаказ_СтруктураФайла.Очистить();
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "EMailЗаказ_СтруктураФайла", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НоваяСтрока = СпрОбъект.EMailЗаказ_СтруктураФайла.Добавить();
				ЗаполнитьСвойствоПоПоискуКодаМДМ("EMailЗаказ_ПоляExcel", НоваяСтрока, "ПолеExcel", Стр.ПолеExcel);
				НоваяСтрока.НомерКолонки = Число(Стр.НомерКолонки);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ТипыУпаковокДляКлиентов", СпрОбъект, "ТипУпаковки", ФабрикаСправочника.ТипУпаковки);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ТарифыДоставки", СпрОбъект, "ТарифыДоставки", ФабрикаСправочника.ТарифДоставки);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ФизическиеЛица", СпрОбъект, "МенеджерМСК", ФабрикаСправочника.ФизическоеЛицо);
		
		СпрОбъект.РассылатьПрайс = Булево(ФабрикаСправочника.РассылатьПрайс);
		СпрОбъект.МаксимальныйОстатокДляПрайса = ФабрикаСправочника.МаксимальныйОстатокДляПрайса;
		
		Если НРег(ФабрикаСправочника.ФорматФайлаПрайса.Перечисление) = ".xlsx" Тогда
			СпрОбъект.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLSx;
		ИначеЕсли НРег(ФабрикаСправочника.ФорматФайлаПрайса.Перечисление) = ".csv" Тогда
			СпрОбъект.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.CSV;
		ИначеЕсли НРег(ФабрикаСправочника.ФорматФайлаПрайса.Перечисление) = ".txt" Тогда
			СпрОбъект.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.TXT;
		ИначеЕсли НРег(ФабрикаСправочника.ФорматФайлаПрайса.Перечисление) = ".xls" Тогда
			СпрОбъект.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.XLS;
		Иначе
			СпрОбъект.ФорматФайлаПрайса = Перечисления.ТипыФайловРассылок.ПустаяСсылка();
		КонецЕсли;
		
		СпрОбъект.НеПосылатьУведомлениеОДолгах = Булево(ФабрикаСправочника.НеПосылатьУведомлениеОДолгах);
		СпрОбъект.ФТППортДляПрайса = ФабрикаСправочника.ФТППортДляПрайса;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ТипыЦенНоменклатуры", СпрОбъект, "ТипЦеныПрайса", ФабрикаСправочника.ТипЦеныПрайса);
		
		СпрОбъект.ФТПАдресДляПрайса = ФабрикаСправочника.ФТПАдресДляПрайса;
		СпрОбъект.ФТПЛогинДляПрайса = ФабрикаСправочника.ФТПЛогинДляПрайса;
		СпрОбъект.ФТППарольДляПрайса = ФабрикаСправочника.ФТППарольДляПрайса;
		СпрОбъект.ВыкладыватьПрайсНаФТП = Булево(ФабрикаСправочника.ВыкладыватьПрайсНаФТП);
		СпрОбъект.НеРассылатьПрайсыПоНоменклатуреВГруппеУценка = Булево(ФабрикаСправочника.НеРассылатьПрайсыПоНоменклатуреВГруппеУценка);
		СпрОбъект.МаксимальноеКоличествоПрайсовВДень = ФабрикаСправочника.МаксимальноеКоличествоПрайсовВДень;
		СпрОбъект.АрхивироватьПрайс = Булево(ФабрикаСправочника.АрхивироватьПрайс);		
		СпрОбъект.ОтправлятьСчетНаПредоплату    = Булево(ФабрикаСправочника.ОтправлятьСчетНаПредоплату);	
		СпрОбъект.ОбъединятьСчетаНаПредоплату = Булево(ФабрикаСправочника.ОбъединятьСчетаНаПредоплату);	
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ДоговорыКонтрагентов", СпрОбъект, "EMailЗаказ_Договор", ФабрикаСправочника.EMailЗаказ_Договор);
		
		СпрОбъект.Комментарий = СокрЛП(ФабрикаСправочника.Комментарий);
		СпрОбъект.ОтправлятьИнформациюОбОтказах = Булево(ФабрикаСправочника.ОтправлятьИнформациюОбОтказах);
		СпрОбъект.ПриоритетВМаршруте = ФабрикаСправочника.ПриоритетВМаршруте;
		
		Если ЗначениеЗаполнено(СокрЛП(ФабрикаСправочника.ГруппаКонтрагентов)) Тогда
			
			Попытка
				ЕстьГруппа = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(ФабрикаСправочника.ГруппаКонтрагентов)));
			Исключение
				ЕстьГруппа = Справочники.Контрагенты.ПустаяСсылка();
			КонецПопытки;
			
			Если ОбщегоНазначения.СсылкаСуществует(ЕстьГруппа) Тогда
				СпрОбъект.Родитель = ЕстьГруппа;
			КонецЕсли;
			
		КонецЕсли;
		
		СпрОбъект.РазделятьРТУПоМаркировке = Булево(ФабрикаСправочника.РазделятьРТУПоМаркировке);  
		СпрОбъект.НеОбъединятьЗаказы = Булево(ФабрикаСправочника.НеОбъединятьЗаказы);
		СпрОбъект.НеCогласовыватьАвтоматомЗаявкиНаВозврат = Булево(ФабрикаСправочника.НеСогласовыватьАвтоматомЗаявкиНаВозврат);
		
		Попытка
			
			СпрОбъект.МенеджерыПокупателя.Очистить();
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ОсновнойМенеджер", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для Каждого Стр Из МассивСтрок Цикл
					
					Если Стр.ФизическоеЛицо.Свойства().Получить("GUID") <> Неопределено Тогда
						
						ЕстьПользователь = ПолучитьПользователяПоФизЛицу(Стр.ФизическоеЛицо.GUID);
						
						Если НЕ ЕстьПользователь.Пустая() Тогда
							
							НоваяСтрока = СпрОбъект.МенеджерыПокупателя.Добавить();
							НоваяСтрока.МенеджерПокупателя        = ЕстьПользователь;
							НоваяСтрока.ДатаНачалаРаботыСФилиалом = ПреобразоватьДатуМДМ(Стр.ДатаНачалаРаботыСФилиалом);
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;				
				
				Если НЕ СпрОбъект.МенеджерыПокупателя.Количество() = 0 Тогда
					
					СпрОбъект.МенеджерыПокупателя.Сортировать("ДатаНачалаРаботыСФилиалом Убыв");
					СпрОбъект.ОсновнойМенеджерПокупателя = СпрОбъект.МенеджерыПокупателя[0].МенеджерПокупателя;
					
				КонецЕсли;			
				
			КонецЕсли;
			
		Исключение    
			//+Гавриленков В. 27.05.2026 #UT10-5881
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при добавлении менежеров в филиал " + СпрОбъект.Наименование + ": " + ОписаниеОшибки());
			//-Гавриленков В. 27.05.2026 #UT10-5881
		КонецПопытки;

		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОформлятьРеализацииКакВнутреннееПеремещение") = Неопределено Тогда 
			СпрОбъект.ОформлятьРеализацииКакВнутреннееПеремещение = Булево(ФабрикаСправочника.ОформлятьРеализацииКакВнутреннееПеремещение);
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ЗаказыватьТоварыДляХозДеятельностиФилиала") = Неопределено Тогда 
			СпрОбъект.ЗаказыватьТоварыДляХозДеятельностиФилиала = Булево(ФабрикаСправочника.ЗаказыватьТоварыДляХозДеятельностиФилиала);
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("СоздаватьСборки") = Неопределено Тогда 
			
			СоздаватьCборкиЗначение = ФабрикаСправочника.СоздаватьСборки.Перечисление;
			СпрОбъект.СоздаватьСборки = ?(ЗначениеЗаполнено(СоздаватьCборкиЗначение), Перечисления.СоздаватьСборки[СоздаватьCборкиЗначение], 
			Перечисления.СоздаватьСборки.ПустаяСсылка());
			
		КонецЕсли;

		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ИнтервалДоОкончанияОчереди") = Неопределено Тогда 
			СпрОбъект.ИнтервалДоОкончанияОчереди = Число(ФабрикаСправочника.ИнтервалДоОкончанияОчереди);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("МинимальноеКоличествоТваровГотовыхКСборке") = Неопределено Тогда 
			СпрОбъект.МинимальноеКоличествоТваровГотовыхКСборке = Число(ФабрикаСправочника.МинимальноеКоличествоТваровГотовыхКСборке);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ТоварыТолькоСоСклада") = Неопределено Тогда 
			СпрОбъект.ТоварыТолькоСоСклада = Булево(ФабрикаСправочника.ТоварыТолькоСоСклада);
		КонецЕсли;		

		Если НЕ ФабрикаСправочника.Свойства().Получить("ФТПКаталогДляПрайса") = Неопределено Тогда 
			СпрОбъект.ФТПКаталогДляПрайса = СокрЛП(ФабрикаСправочника.ФТПКаталогДляПрайса);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечатьУПДВВертикальномФормате") = Неопределено Тогда 
			СпрОбъект.ПечатьУПДВВертикальномФормате = Булево(ФабрикаСправочника.ПечатьУПДВВертикальномФормате);
		КонецЕсли;		

		Если НЕ ФабрикаСправочника.Свойства().Получить("ЦентрФинансовойОтветственности") = Неопределено Тогда 
			СпрОбъект.ЦентрФинансовойОтветственности = Булево(ФабрикаСправочника.ЦентрФинансовойОтветственности);
		КонецЕсли;		

		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечататьТоварныйЧекБезЦенВместоУПД") = Неопределено Тогда 
			СпрОбъект.ПечататьТоварныйЧекБезЦенВместоУПД = Булево(ФабрикаСправочника.ПечататьТоварныйЧекБезЦенВместоУПД);
		КонецЕсли;		

		Если НЕ ФабрикаСправочника.Свойства().Получить("ОтчетКомиссионера_НомерПервойСтроки") = Неопределено Тогда
			СпрОбъект.ОтчетКомиссионера_НомерПервойСтроки = ФабрикаСправочника.ОтчетКомиссионера_НомерПервойСтроки;
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОтчетКомиссионера_СтруктураФайла") = Неопределено Тогда			
			
			СпрОбъект.ОтчетКомиссионера_СтруктураФайла.Очистить();
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ОтчетКомиссионера_СтруктураФайла", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для Каждого Стр Из МассивСтрок Цикл 				
					
					НоваяСтрока = СпрОбъект.ОтчетКомиссионера_СтруктураФайла.Добавить();
					ЗаполнитьСвойствоПоПоискуКодаМДМ("ОтчетКомиссионера_ПоляExcel", НоваяСтрока, "ПолеExcel", Стр.ПолеExcel);
					НоваяСтрока.НомерКолонки = Число(Стр.НомерКолонки);
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;

		
		Если НЕ ФабрикаСправочника.Свойства().Получить("DS_Подразделение_ID") = Неопределено Тогда
			СпрОбъект.DS_Подразделение_ID = Число(ФабрикаСправочника.DS_Подразделение_ID); 
		КонецЕсли;

		СпрОбъект.ОператорЭДО = Справочники.ОператорыЭДО.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ОператорЭДО.GUID));	
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("УпаковыватьСамовывоз") = Неопределено Тогда 
			СпрОбъект.УпаковыватьСамовывоз = Булево(ФабрикаСправочника.УпаковыватьСамовывоз);
		КонецЕсли;		

		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечататьСчетНаОплату") = Неопределено Тогда 
			СпрОбъект.ПечататьСчетНаОплату = Булево(ФабрикаСправочника.ПечататьСчетНаОплату);
		КонецЕсли;		
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("DS_Подразделение_ID") = Неопределено Тогда
			СпрОбъект.DS_Подразделение_ID = Число(ФабрикаСправочника.DS_Подразделение_ID); 
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ЗаполнятьКомментарииВТоварномЧеке") = Неопределено Тогда
			СпрОбъект.ЗаполнятьКомментарииВТоварномЧеке = Булево(ФабрикаСправочника.ЗаполнятьКомментарииВТоварномЧеке); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ДополнительныеПараметрыВыгрузкиВЭДО") = Неопределено Тогда	
			
			СпрОбъект.ДополнительныеПараметрыВыгрузкиВЭДО.Очистить();
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ДополнительныеПараметрыВыгрузкиВЭДО", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для Каждого Стр Из МассивСтрок Цикл 				
					
					НоваяСтрока = СпрОбъект.ДополнительныеПараметрыВыгрузкиВЭДО.Добавить();
					НоваяСтрока.ИмяПараметра = Стр.ИмяПараметра;
					НоваяСтрока.ЗначениеПараметра = Стр.ЗначениеПараметра;
					
				КонецЦикла;    
				
			КонецЕсли;
			
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("СертифицированнаяТорговаяТочка") = Неопределено Тогда
			СпрОбъект.СертифицированнаяТорговаяТочка = Булево(ФабрикаСправочника.СертифицированнаяТорговаяТочка); 
		КонецЕсли; 
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("СертификатыТорговыхТочек") = Неопределено Тогда			
			
			СпрОбъект.СертификатыТорговыхТочек.Очистить();
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "СертификатыТорговыхТочек", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для Каждого Стр Из МассивСтрок Цикл 				
					
					НоваяСтрока = СпрОбъект.СертификатыТорговыхТочек.Добавить();
					ЗаполнитьСвойствоПоПоискуКодаМДМ("СертификатТорговойТочки", НоваяСтрока, "СертификатТорговойТочки", Стр.СертификатТорговойТочки);					
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ТранзитЧерезТомилино") = Неопределено Тогда 
			СпрОбъект.ТранзитЧерезТомилино = Булево(ФабрикаСправочника.ТранзитЧерезТомилино);
		КонецЕсли;		
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПоказыватьКомментарийИзЗаказаВСборке") = Неопределено Тогда 
			СпрОбъект.ПоказыватьКомментарийИзЗаказаВСборке = Булево(ФабрикаСправочника.ПоказыватьКомментарийИзЗаказаВСборке);
		КонецЕсли;		
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПополнениеТОХ") = Неопределено Тогда
			СпрОбъект.ПополнениеТОХ = Булево(ФабрикаСправочника.ПополнениеТОХ); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеОбъединятьВОбщемВыкупе") = Неопределено Тогда
			СпрОбъект.НеОбъединятьВОбщемВыкупе = Булево(ФабрикаСправочника.НеОбъединятьВОбщемВыкупе); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеОтправлятьЭкспрессВТомилино") = Неопределено Тогда
			СпрОбъект.НеОтправлятьЭкспрессВТомилино = Булево(ФабрикаСправочника.НеОтправлятьЭкспрессВТомилино); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечататьВозвратныеДокументыПриОтгрузке") = Неопределено Тогда
			СпрОбъект.ПечататьВозвратныеДокументыПриОтгрузке = Булево(ФабрикаСправочника.ПечататьВозвратныеДокументыПриОтгрузке); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("СобственныйФилиал") = Неопределено Тогда
			СпрОбъект.СобственныйФилиал = Булево(ФабрикаСправочника.СобственныйФилиал); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПереносДоставкиБезУдаленияРТУ") = Неопределено Тогда 
			СпрОбъект.ПереносДоставкиБезУдаленияРТУ = Булево(ФабрикаСправочника.ПереносДоставкиБезУдаленияРТУ); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОбратнаяПродажа") = Неопределено Тогда 
			СпрОбъект.ОбратнаяПродажа = Булево(ФабрикаСправочника.ОбратнаяПродажа); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОбъединятьГМВТЕ") = Неопределено Тогда 
			СпрОбъект.ОбъединятьГМВТЕ = Булево(ФабрикаСправочника.ОбъединятьГМВТЕ);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеПечататьЭтикеткиГМ") = Неопределено Тогда 
			СпрОбъект.НеПечататьЭтикеткиГМ = Булево(ФабрикаСправочника.НеПечататьЭтикеткиГМ); 
		КонецЕсли;
		
		//+Сёмин Р.И. 18.08.2026 #UT10-6012
		Если НЕ ФабрикаСправочника.Свойства().Получить("КодСкладаДляВыкуповАвтоматом") = Неопределено Тогда 
			СпрОбъект.КодСкладаДляВыкуповАвтоматом = СокрЛП(ФабрикаСправочника.КодСкладаДляВыкуповАвтоматом);
		КонецЕсли;
		//-Сёмин Р.И. 18.08.2026 #UT10-6012
		
		//+Сёмин Р.И. 08.09.2026 #UT10-6028
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеПечататьУПД") = Неопределено Тогда 
			СпрОбъект.НеПечататьУПД = Булево(ФабрикаСправочника.НеПечататьУПД);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеПечататьУКД") = Неопределено Тогда 
			СпрОбъект.НеПечататьУКД = Булево(ФабрикаСправочника.НеПечататьУКД);
		КонецЕсли;
		//-Сёмин Р.И. 08.09.2026 #UT10-6028
		
	ИначеЕсли ИмяОбъектаМетаданных = "ТипыЦенНоменклатурыКонтрагентов" Тогда
		
		СпрОбъект.ПометкаУдаления = ФабрикаСправочника.ПометкаУдаления;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.ЦенаВключаетНДС = ФабрикаСправочника.ЦенаВключаетНДС;		
		СпрОбъект.Владелец = СсылкаПоИдентификатору(Тип("СправочникСсылка.Контрагенты"), ФабрикаСправочника.Владелец.GUID);
		СпрОбъект.ТипЦеныНоменклатуры = Справочники.ТипыЦенНоменклатуры.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.СхемаРаботы.GUID)); 
		
		Если СпрОбъект.ЭтоНовый() Тогда
			СпрОбъект.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить();			
		КонецЕсли;		
		
	ИначеЕсли ИмяОбъектаМетаданных = "ДоговорыКонтрагентов" Тогда
		
		Если СпрОбъект.ЭтоНовый() Тогда

			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
			СпрОбъект.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
			СпрОбъект.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
			СпрОбъект.ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
			СпрОбъект.ОбособленныйУчетТоваровПоЗаказамПокупателей = Истина;
			СпрОбъект.ПорядокРегистрацииСчетовФактурНаАвансПоДоговору = Перечисления.ПорядокРегистрацииСчетовФактурНаАванс.ПустаяСсылка();
			
		КонецЕсли;
		
		Если ФабрикаСправочника.ВидДоговора.Перечисление = "С покупателем" Тогда
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
		ИначеЕсли ФабрикаСправочника.ВидДоговора.Перечисление = "С поставщиком" Тогда
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ИначеЕсли ФабрикаСправочника.ВидДоговора.Перечисление = "С комитентом" Тогда
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом;
		ИначеЕсли ФабрикаСправочника.ВидДоговора.Перечисление = "С комиссионером" Тогда
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером;
		ИначеЕсли ФабрикаСправочника.ВидДоговора.Перечисление = "Прочее" Тогда
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
		Иначе
			СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		СпрОбъект.КонтролироватьСуммуЗадолженности = Булево(ФабрикаСправочника.КонтролироватьСуммуЗадолженности);
		СпрОбъект.ДопустимаяСуммаЗадолженности = ?(ФабрикаСправочника.ГлубинаКредита = "", 0, Число(ФабрикаСправочника.ГлубинаКредита));     		
		
		СпрОбъект.КонтролироватьЧислоДнейЗадолженности = Булево(ФабрикаСправочника.КонтролироватьЧислоДнейЗадолженности);
		СпрОбъект.ДопустимоеЧислоДнейЗадолженности = ?(ФабрикаСправочника.КоличествоДнейОтсрочки = "", 0, Число(ФабрикаСправочника.КоличествоДнейОтсрочки));  
		
		СпрОбъект.ОплатаПоДоговоруНаличными  = Булево(ФабрикаСправочника.ОплатаНаличными);
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.НаименованиеДляПечати = СокрЛП(ФабрикаСправочника.Наименование);
		СпрОбъект.DS_Подразделение_ID = ФабрикаСправочника.DS_Подразделение_ID;	     
		СпрОбъект.ОператорЭДО = Справочники.ОператорыЭДО.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ОператорЭДО.GUID));	
		СпрОбъект.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг = Булево(ФабрикаСправочника.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг);		
		СпрОбъект.Организация = Справочники.Организации.НайтиПоРеквизиту("КодМДМГоловнойОрганизации", СокрЛП(ФабрикаСправочника.Организация.GUID));
		СпрОбъект.Владелец = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.Владелец.GUID));

		Если СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			СпрОбъект.ТипЦен = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ТипЦеныНоменклатурыКонтрагента.GUID));	
		Иначе
			СпрОбъект.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.СхемаРаботы.GUID));
		КонецЕсли;

		СпрОбъект.МножественныеУсловия = Булево(ФабрикаСправочника.МножественныеУсловия);
		
		СпрОбъект.Условия.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "Условия", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				НовСтр = СпрОбъект.Условия.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаМассива);
				НовСтр.ТипЦен = Справочники.ТипыЦенНоменклатуры.НайтиПоРеквизиту("КодМДМ", СокрЛП(СтрокаМассива.СхемаРаботы.GUID));
				
			КонецЦикла;			
			
		КонецЕсли;
		
		Попытка
			СформироватьСкидкиПоУсловиям(ФабрикаСправочника, СпрОбъект);
		Исключение
		КонецПопытки;
		
		СпрОбъект.Номер = ФабрикаСправочника.Номер; 
		СпрОбъект.Дата = ПреобразоватьДатуМДМ(ФабрикаСправочника.Дата);
		СпрОбъект.СрокДействия = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаОкончанияДействия);
		
		Если НРег(ФабрикаСправочника.ВедениеВзаиморасчетов.Перечисление) = "по счетам" Тогда
			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоСчетам;
		ИначеЕсли НРег(ФабрикаСправочника.ВедениеВзаиморасчетов.Перечисление) = "по заказам" Тогда
			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
		ИначеЕсли НРег(ФабрикаСправочника.ВедениеВзаиморасчетов.Перечисление) = "по договору в целом" Тогда
			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		ИначеЕсли НРег(ФабрикаСправочника.ВедениеВзаиморасчетов.Перечисление) = "удалить по расчетным документам" Тогда
			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.УдалитьПоРасчетнымДокументам;
		КонецЕсли;
		
		СпрОбъект.ВестиПоДокументамРасчетовСКонтрагентом = Булево(ФабрикаСправочника.ВестиПоДокументамРасчетовСКонтрагентом);
		СпрОбъект.Подарки = Булево(ФабрикаСправочника.Подарки);
		СпрОбъект.ПроцентПредоплаты = ФабрикаСправочника.ПроцентПредоплаты;  		
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ИнформационныеБазы") = Неопределено Тогда
			
			Для Каждого ИнфБаза Из ФабрикаСправочника.ИнформационныеБазы.Строка Цикл
				
				Если ИнфБаза.База = "Биллинг" Тогда
					
					Если ИнфБаза.Использование = "true" Тогда
						СпрОбъект.ВыгружаетсяВБиллинг = Истина;
					Иначе
						СпрОбъект.ВыгружаетсяВБиллинг = Ложь;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "Соглашения", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда 	
			
			Если Не СпрОбъект.ЭтоНовый() Тогда
				
				Набор = РегистрыСведений.ДоговорыАварды.СоздатьНаборЗаписей();
				Набор.Отбор.ДоговорКонтрагента.Установить(СпрОбъект.Ссылка);
				Набор.Прочитать();
				Набор.Очистить();
				Набор.Записать();
				
			КонецЕсли;		
			
			Для каждого Соглашение Из МассивСтрок Цикл
				
				МенеджерЗаписи = РегистрыСведений.ДоговорыАварды.СоздатьМенеджерЗаписи();
				
				Если СпрОбъект.ЭтоНовый() Тогда
					МенеджерЗаписи.ДоговорКонтрагента = СпрОбъект.ПолучитьСсылкуНового();
				Иначе
					МенеджерЗаписи.ДоговорКонтрагента = СпрОбъект.Ссылка;
				КонецЕсли; 
				
				МенеджерЗаписи.ОплатаНаличными = Булево(Соглашение.ОплатаНаличными);
				МенеджерЗаписи.КодАварда = СокрЛП(Соглашение.КодАвардаСоглашения);
				МенеджерЗаписи.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли; 
		
		СпрОбъект.ОсновнойДоговор = Булево(ФабрикаСправочника.ОсновнойДоговор);
		ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ПерезаполнитьОсновнойДоговорКонтрагента = Ложь;
		
		Если Булево(ФабрикаСправочника.ОсновнойДоговор) Тогда
			
			Если Не ЗначениеЗаполнено(СпрОбъект.Владелец.ОсновнойДоговорКонтрагента) Тогда
				
				ПерезаполнитьОсновнойДоговорКонтрагента = Истина;
				
				Если СпрОбъект.ЭтоНовый() Тогда
					ОсновнойДоговорКонтрагента = СпрОбъект.ПолучитьСсылкуНового();
				Иначе
					ОсновнойДоговорКонтрагента = СпрОбъект.Ссылка;
				КонецЕсли; 
				
			Иначе
				//Основной договор уже заполнен, поэтому не перезаполняем
			КонецЕсли;
			
		Иначе
			
			Если Не СпрОбъект.ЭтоНовый() и СпрОбъект.Владелец.ОсновнойДоговорКонтрагента = СпрОбъект.Ссылка Тогда
				
				МассивДоговоровКонтрагента = ПолучитьМассивДоговоровКонтрагента(СпрОбъект.Владелец, СпрОбъект.Ссылка);
				
				Для Каждого ТекущийДоговор Из МассивДоговоровКонтрагента Цикл
					
					Если ТекущийДоговор.ОсновнойДоговор Тогда
						
						ОсновнойДоговорКонтрагента = ТекущийДоговор;
						ПерезаполнитьОсновнойДоговорКонтрагента = Истина;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(ОсновнойДоговорКонтрагента) Тогда
					
					ОсновнойДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
					ПерезаполнитьОсновнойДоговорКонтрагента = Истина;
					
				КонецЕсли;					
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПерезаполнитьОсновнойДоговорКонтрагента Тогда
			
			КонтрагентОбъект = СпрОбъект.Владелец.ПолучитьОбъект();
			
			Если КонтрагентОбъект <> Неопределено Тогда
				
				КонтрагентОбъект.ОсновнойДоговорКонтрагента = ОсновнойДоговорКонтрагента;
				КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
				КонтрагентОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		СпрОбъект.Комментарий = СокрЛП(ФабрикаСправочника.Комментарий);
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("НеОтправлятьАктыСверкиВзаиморасчетов") = Неопределено Тогда 
			СпрОбъект.НеОтправлятьАктыСверкиВзаиморасчетов = Булево(ФабрикаСправочника.НеОтправлятьАктыСверкиВзаиморасчетов);
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ДержатьРезервБезОплатыОграниченноеВремя") = Неопределено Тогда 
			СпрОбъект.ДержатьРезервБезОплатыОграниченноеВремя = Булево(ФабрикаСправочника.ДержатьРезервБезОплатыОграниченноеВремя);
		КонецЕсли;   
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ЧислоДнейРезерваБезОплаты") = Неопределено Тогда 
			СпрОбъект.ЧислоДнейРезерваБезОплаты = Число(ФабрикаСправочника.ЧислоДнейРезерваБезОплаты);
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("РозничнаяПродажа") = Неопределено Тогда 
			СпрОбъект.РозничнаяПродажа = Булево(ФабрикаСправочника.РозничнаяПродажа);
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("БизнесКарта") = Неопределено Тогда 
			СпрОбъект.БизнесКарта = Булево(ФабрикаСправочника.БизнесКарта);
		КонецЕсли; 

		Если НЕ ФабрикаСправочника.Свойства().Получить("СрокВозврата") = Неопределено Тогда 
			СпрОбъект.СрокВозврата = Число(ФабрикаСправочника.СрокВозврата);
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ОтправлятьДокументыЧерезЭДО") = Неопределено Тогда
			СпрОбъект.ОтправлятьДокументыЧерезЭДО = Булево(ФабрикаСправочника.ОтправлятьДокументыЧерезЭДО); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ДатаНачалаОбменаЭДО") = Неопределено Тогда
			СпрОбъект.ДатаНачалаОбменаЭДО = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаОбменаЭДО); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("РаботаетБезПечати") = Неопределено Тогда
			СпрОбъект.РаботаетБезПечати = Булево(ФабрикаСправочника.РаботаетБезПечати); 
		КонецЕсли;

		Если НЕ ФабрикаСправочника.Свойства().Получить("ЛицевойСчет") = Неопределено Тогда
			СпрОбъект.ЛицевойСчет = Булево(ФабрикаСправочника.ЛицевойСчет); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ДатаНачалаРаботыЛицевогоСчета") = Неопределено Тогда
			СпрОбъект.ДатаНачалаРаботыЛицевогоСчета = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаРаботыЛицевогоСчета); 
		КонецЕсли;
		
		СпрОбъект.ДоставкаЧерезСкладТомилино  = Булево(ФабрикаСправочника.ДоставкаЧерезСкладТомилино);
		
		Если СпрОбъект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			СпрОбъект.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ИспользуетсяДляПодключенияПоСхемеИсключительныхСкладов") = Неопределено Тогда
			СпрОбъект.ИспользуетсяДляПодключенияПоСхемеИсключительныхСкладов = Булево(ФабрикаСправочника.ИспользуетсяДляПодключенияПоСхемеИсключительныхСкладов); 
		КонецЕсли;
		
		СпрОбъект.ПередаватьНомерЗаявкиНаВозвратВУКДЭДО  = Булево(ФабрикаСправочника.ПередаватьНомерЗаявкиНаВозвратВУКДЭДО);
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("Статус") = Неопределено Тогда
			СпрОбъект.Потенциальный = СокрЛП(ФабрикаСправочника.Статус.GUID) = "b8ebd009-4ddf-11ef-80f1-00505689035b"; 
		КонецЕсли;
		
		//+Сёмин Р. 17.02.2026 #UT10-5702
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечататьТН") = Неопределено Тогда 
			СпрОбъект.ПечататьТН = Булево(ФабрикаСправочника.ПечататьТН);
		КонецЕсли;
		//-Сёмин Р. 17.02.2026 #UT10-5702 
		
		//+Белов А. 05.03.2026 #
		Если НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Не покупает товары ЧЗ") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.НеПокупаетТоварыЧЗ;               
		ИначеЕсли НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Товары ЧЗ в розницу") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ТоварыЧЗВРозницу;
		ИначеЕсли НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Покупка для собственных нужд") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд;
		ИначеЕсли НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Не классифицирован") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.НеКлассифицирован;
		ИначеЕсли НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Участник оборота") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.УчастникОборота;
		//+Белов А. 07.05.2026 #UT10-5843
		ИначеЕсли НРег(ФабрикаСправочника.УсловияРаботыСЧЗ.Перечисление) = НРег("Торговля с новыми регионами") Тогда
			СпрОбъект.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ТорговляСНовымиРегионами;  
		//-Белов А. 07.05.2026 #UT10-5843	
		КонецЕсли;		
		//-Белов А. 05.03.2026 #
		
		//+Сёмин Р.И. 18.06.2026 #UT10-5912
		СпрОбъект.ОстаточныйСрокГодности.Очистить();
		МассивСтрокОстаточныйСрокГодности = СформироватьМассивПоСвойству(ФабрикаСправочника, "ОстаточныйСрокГодности", "Строка");
		
		Если МассивСтрокОстаточныйСрокГодности.Количество() > 0 Тогда
			
			Для Каждого СтрокаМассива Из МассивСтрокОстаточныйСрокГодности Цикл
				
				НовСтр = СпрОбъект.ОстаточныйСрокГодности.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаМассива);
				НовСтр.НачалоПериода = ПреобразоватьДатуМДМ(СтрокаМассива.НачалоПериода);
				НовСтр.ОкончаниеПериода = ПреобразоватьДатуМДМ(СтрокаМассива.ОкончаниеПериода);
				
			КонецЦикла;			
			
		КонецЕсли;
		//-Сёмин Р.И. 18.06.2026 #UT10-5912  
		
		//+Белов А. 24.08.2026 #UT10-6007
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОтправлятьЭТРН") = Неопределено Тогда 
			СпрОбъект.ОтправлятьЭТРН = Булево(ФабрикаСправочника.ОтправлятьЭТРН);
		КонецЕсли;
		//-Белов А. 24.08.2026 #UT10-6007
		
	ИначеЕсли ИмяОбъектаМетаданных = "СхемыРаботы" Тогда
		
		Если СпрОбъект.ЭтоНовый() Тогда 			
			
			СпрОбъект.ЦенаВключаетНДС = Истина;
			СпрОбъект.ВалютаЦены = Константы.ВалютаУправленческогоУчета.Получить();
			СпрОбъект.ПорядокОкругления = Перечисления.ПорядкиОкругления.Окр0_01;			
			
		КонецЕсли;
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
	ИначеЕсли ИмяОбъектаМетаданных = "МаршрутыДоставки" Тогда
		
		СпрОбъект.Маршрут = ФабрикаСправочника.Маршрут;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.ВремяНачала = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяНачала);
		СпрОбъект.ВремяОкончания = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОкончания);
		СпрОбъект.ВремяОкончанияВСубботу = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОкончанияВСубботу);

		Если НЕ ФабрикаСправочника.Свойства().Получить("ВечерняяДоставка") = Неопределено Тогда 
			СпрОбъект.ВечерняяДоставка = Булево(ФабрикаСправочника.ВечерняяДоставка);
		КонецЕсли;

		СпрОбъект.ВремяНачалаСозданияСборокНаЗавтра = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяНачалаСозданияСборокНаЗавтра);
		СпрОбъект.ВремяНачалаСозданияСборокНаЗавтраДляСубботы = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяНачалаСозданияСборокНаЗавтраДляСубботы);
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ТарифДоставкиДляИП") = Неопределено Тогда 
			СпрОбъект.ТарифДоставкиДляИП = Справочники.ТарифыДоставки.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ТарифДоставкиДляИП.GUID)); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ТарифДоставкиШтат") = Неопределено Тогда 
			СпрОбъект.ТарифДоставкиШтат = Справочники.ТарифыДоставки.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ТарифДоставкиШтат.GUID));
		КонецЕсли;
		
	ИначеЕсли ИмяОбъектаМетаданных = "ОчередьДоставки" Тогда 		
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.ВремяНачалаОтправки = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяНачалаОтправки);
		СпрОбъект.ВремяОкончанияОтправки = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОкончанияОтправки);

		Если НЕ ФабрикаСправочника.Свойства().Получить("СрочнаяДоставка") = Неопределено Тогда
			СпрОбъект.СрочнаяДоставка = Булево(ФабрикаСправочника.СрочнаяДоставка);
		КонецЕсли;

	ИначеЕсли ИмяОбъектаМетаданных = "ТипыУпаковокДляКлиентов" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
	ИначеЕсли ИмяОбъектаМетаданных = "ТарифыДоставки" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("Тариф") = Неопределено Тогда 
			СпрОбъект.Тариф = Число(ФабрикаСправочника.Тариф);
		КонецЕсли;

	ИначеЕсли ИмяОбъектаМетаданных = "EMailЗаказ_ПоляExcel" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.НаименованиеWeb = ФабрикаСправочника.НаименованиеWeb;
		СпрОбъект.Обязательное = Булево(ФабрикаСправочника.Обязательное);
		
	ИначеЕсли ИмяОбъектаМетаданных = "ВидыДеятельностиКонтрагентов" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
	ИначеЕсли ИмяОбъектаМетаданных = "ВидыДеятельностиПоКлассификацииПроизводителя" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.КодДляСинхронизации = ФабрикаСправочника.КодДляСинхронизации;
		СпрОбъект.Примечание = ФабрикаСправочника.Примечание; 
		
	ИначеЕсли ИмяОбъектаМетаданных = "Производители" Тогда 
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.КодАварда = ФабрикаСправочника.КодАварда;
		СпрОбъект.НеПоказыватьНаПортале = Булево(ФабрикаСправочника.НеПоказыватьНаПортале);
		СпрОбъект.БезусловныйВозврат = Булево(ФабрикаСправочника.БезусловныйВозврат);
		
		//+Сёмин Р.И. 18.06.2026 #UT10-5912
		СпрОбъект.ОстаточныйСрокГодности = Число(ФабрикаСправочника.ОстаточныйСрокГодности);
		//-Сёмин Р.И. 18.06.2026 #UT10-5912
		
	ИначеЕсли ИмяОбъектаМетаданных = "СторонниеСклады" Тогда
		
		Если ФабрикаСправочника.СтороннийСклад Тогда
			
			СпрОбъект.Наименование 						 = ФабрикаСправочника.Наименование;
			
			СпрОбъект.ВремяОтправкиВоскресенье           = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиВоскресенье);
			СпрОбъект.ВремяОтправкиВоскресенье2          = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиВоскресенье2);         
			СпрОбъект.ВремяОтправкиВоскресенье3		  	 = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиВоскресенье3);	
			
			СпрОбъект.ВремяОтправкиПраздничныйДень       = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПраздничныйДень);  		
			СпрОбъект.ВремяОтправкиПраздничныйДень2      = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПраздничныйДень2);   
			СпрОбъект.ВремяОтправкиПраздничныйДень3	     = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПраздничныйДень3);
			
			СпрОбъект.ВремяОтправкиПредпрздничныйДень	 = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПредпрздничныйДень);
			СпрОбъект.ВремяОтправкиПредпрздничныйДень2   = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПредпрздничныйДень2);
			СпрОбъект.ВремяОтправкиПредпрздничныйДень3   = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиПредпрздничныйДень3);
			
			СпрОбъект.ВремяОтправкиРабочийДень           = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиРабочийДень); 
			СпрОбъект.ВремяОтправкиРабочийДень2          = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиРабочийДень2); 
			СпрОбъект.ВремяОтправкиРабочийДень3          = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиРабочийДень3);
			
			СпрОбъект.ВремяОтправкиСуббота				 = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиСуббота);	
			СпрОбъект.ВремяОтправкиСуббота2              = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиСуббота2);  
			СпрОбъект.ВремяОтправкиСуббота3              = ПреобразоватьДатуМДМ(ФабрикаСправочника.ВремяОтправкиСуббота3);
			
			СпрОбъект.Идентификатор                      = ФабрикаСправочника.Идентификатор;  
			СпрОбъект.КоэффициентЗакупки                 = ФабрикаСправочника.КоэффициентЗакупки;
			
			СпрОбъект.ОтправлятьВАварду                  = ФабрикаСправочника.ОтправлятьВАварду;
			СпрОбъект.ОтправлятьВПраздничныеДни          = ФабрикаСправочника.ОтправлятьВПраздничныеДни; 
			СпрОбъект.ОтправлятьВПредраздничныеДни       = ФабрикаСправочника.ОтправлятьВПредраздничныеДни;
			СпрОбъект.ОтправлятьПоВоскресеньям           = ФабрикаСправочника.ОтправлятьПоВоскресеньям; 
			СпрОбъект.ОтправлятьПоРабочмДням             = ФабрикаСправочника.ОтправлятьПоРабочмДням;
			СпрОбъект.ОтправлятьПоСубботам               = ФабрикаСправочника.ОтправлятьПоСубботам;
			СпрОбъект.СкоростьПоставки                   = ФабрикаСправочника.СкоростьПоставки; 
			
			СпрОбъект.СкоростьПоставки                   = Число(ФабрикаСправочника.СкоростьПоставки) + Константы.КоличествоДнейДоставкиНаСтороннийСклад.Получить(); 		
			
			Попытка
				
				СпрОбъект.ПараллельнаяОтправкаЗаказовВУТ11               = ФабрикаСправочника.ПараллельнаяОтправкаЗаказовВУТ11;
				СпрОбъект.ОтправлятьЗаказыПоСкладуВУТ11                   = ФабрикаСправочника.ОтправлятьЗаказыПоСкладуВУТ11;
				
			Исключение
			КонецПопытки;
			
			СпрОбъект.СтороннийСкладФилиала = ФабрикаСправочника.СтороннийСкладФилиала;
			СпрОбъект.НеОтправлятьЗаказыВSI = ФабрикаСправочника.НеОтправлятьЗаказыВSI;
			
			Если СпрОбъект.СтороннийСкладФилиала Тогда

				СпрОбъект.КонтрагентСторСклада = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.КонтрагентДляСтороннегоСклада.GUID));
				
				Если СокрЛП(ФабрикаСправочника.ДоговорДляСтороннегоСклада.GUID) <> "" Тогда
					СпрОбъект.ДоговорСторСклада = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ДоговорДляСтороннегоСклада.GUID));
				КонецЕсли;
				
			КонецЕсли;
			
			СпрОбъект.IDСклада = ФабрикаСправочника.IDСклада;
			
		Иначе
			
			Если ТипЗнч(СпрОбъект) = Тип("СправочникОбъект.Склады") Тогда
				
				СпрОбъект.КодМДМПрайсЛиста = ФабрикаСправочника.ПрайсЛист.GUID;
				СпрОбъект.ИдентификаторПрайса =  Число(ФабрикаСправочника.Идентификатор);
				
				Если НЕ ФабрикаСправочника.Свойства().Получить("ВыгружатьВRabbitСостояниеТоваровПоСкладу") = Неопределено Тогда 
					СпрОбъект.ВыгружатьСостояниеТоваровНаСкладе = Булево(ФабрикаСправочника.ВыгружатьВRabbitСостояниеТоваровПоСкладу);	
				КонецЕсли;  				
				
			КонецЕсли;			
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбъектаМетаданных = "Номенклатура" Тогда 		
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ВидыНоменклатуры", СпрОбъект, "ВидНоменклатуры", ФабрикаСправочника.ВидНоменклатуры, ФабрикаСправочника);
		
		СпрОбъект.Наименование = СтрЗаменить(МСК.ВычиститьНепечатныеСимволы(ФабрикаСправочника.Наименование), ";", " ");
		СпрОбъект.НаименованиеПолное = СтрЗаменить(МСК.ВычиститьНепечатныеСимволы(ФабрикаСправочника.НаименованиеПолное), ";", " ");
		СпрОбъект.КодАварда = ФабрикаСправочника.КодАварда;
		СпрОбъект.КодПоБазеМоскоречье = ФабрикаСправочника.ИнвНомер;
		СпрОбъект.Артикул = МСК.ВычиститьНепечатныеСимволы(ФабрикаСправочника.ИнвНомер);
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("КлассификаторЕдиницИзмерения", СпрОбъект, "БазоваяЕдиницаИзмерения", ФабрикаСправочника.ЕдиницаИзмерения, ФабрикаСправочника);
		
		СпрОбъект.КодПроизводителя = МСК.ВычиститьНепечатныеСимволы(ФабрикаСправочника.Артикул);
		СпрОбъект.ВестиУчетПоСериям = Истина;
		СпрОбъект.ВестиПартионныйУчетПоСериям = Истина;
		СпрОбъект.Кратность = Число(ФабрикаСправочника.Кратность);
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("АВСКлассификацияНоменклатуры", СпрОбъект, "ГруппаАВС", ФабрикаСправочника.ГруппаABC, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("НоменклатурныеГруппы", СпрОбъект, "НоменклатурнаяГруппа", ФабрикаСправочника.Деталь, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Номенклатура", СпрОбъект, "Родитель", ФабрикаСправочника.Производитель, ФабрикаСправочника);
		
		СпрОбъект.СтавкаНДС = ?(ТекущаяДата() >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		СпрОбъект.НормализованныйКод = СпрОбъект.ПолучитьНормализованныйКод();
		СпрОбъект.Комментарий = ФабрикаСправочника.КомментарийАварда;
		СпрОбъект.ДатаПоследнегоИзменения = ТекущаяДата();
		СпрОбъект.ГорючиеЖидкости = Булево(ФабрикаСправочника.ГорючиеЖидкости);

		Если НЕ ФабрикаСправочника.Свойства().Получить("НеПодлежитВозврату") = Неопределено Тогда 
			СпрОбъект.НеПодлежитВозврату = Булево(ФабрикаСправочника.НеПодлежитВозврату);
		КонецЕсли;

		Если НЕ  ЗначениеЗаполнено(СпрОбъект.Код) Тогда 
			СпрОбъект.УстановитьНовыйКод(); 
		КонецЕсли;

		Если ЗначениеЗаполнено(СпрОбъект.ВидНоменклатуры) и СпрОбъект.ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
			СпрОбъект.Услуга = Истина;
		Иначе
			СпрОбъект.Услуга = Ложь;
		КонецЕсли;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("СтатьиЗатрат",СпрОбъект,"СтатьяЗатрат",ФабрикаСправочника.СтатьяРасходов,ФабрикаСправочника);
		
		СпрОбъект.ТребуетсяМаркировка = Булево(ФабрикаСправочника.ТребуетсяМаркировкаЧестныйЗнак);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ТоварныеГруппыЧЗ",СпрОбъект,"ТоварнаяГруппаЧестногоЗнака",ФабрикаСправочника.ТоварнаяГруппаЧестногоЗнака,ФабрикаСправочника);   
		СпрОбъект.СрокГодности = Число(ФабрикаСправочника.СрокГодностиМаркировкиЧестныйЗнак);
		СпрОбъект.GTIN = Строка(ФабрикаСправочника.GTIN);
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("КодыТНВЭД", СпрОбъект, "КодТНВЭД", ФабрикаСправочника.КодТНВЭД, ФабрикаСправочника);
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("КодыОКПД2", СпрОбъект, "КодОКПД2", ФабрикаСправочника.КодОКПД2, ФабрикаСправочника);
		
		//+Сёмин Р.И. 01.04.2026 #UT10-5798
		СпрОбъект.ЗначениеМаскиНедоступныхТоваров = Число(ФабрикаСправочника.ЗначениеМаскиНедоступныхТоваров);
		//-Сёмин Р.И. 01.04.2026 #UT10-5798
		
		//+Сёмин Р.И. 18.06.2026 #UT10-5912
		СпрОбъект.ОстаточныйСрокГодности = Число(ФабрикаСправочника.ОстаточныйСрокГодности);
		//-Сёмин Р.И. 18.06.2026 #UT10-5912
		
	ИначеЕсли ИмяОбъектаМетаданных = "ВидыНоменклатуры" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.ТипНоменклатуры = ПолучитьТипНоменклатурыПоГУИД(ФабрикаСправочника.ТипНоменклатуры);
		
	ИначеЕсли ИмяОбъектаМетаданных = "КлассификаторЕдиницИзмерения" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Код = ФабрикаСправочника.Код;
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		СпрОбъект.МеждународноеСокращение = ФабрикаСправочника.МеждународноеСокращение;
		
	ИначеЕсли ИмяОбъектаМетаданных = "КлассификаторДеталейАвтомобилей" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
		СпрОбъект.Код = ФабрикаСправочника.КодАварда;
		СпрОбъект.СтавкаНДС = ?(ТекущаяДата() >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		СпрОбъект.ГорючиеЖидкости = Булево(ФабрикаСправочника.ГорючиеЖидкости);
		
		//+Сёмин Р.И. 18.06.2026 #UT10-5912
		СпрОбъект.ОстаточныйСрокГодности = Число(ФабрикаСправочника.ОстаточныйСрокГодности);
		//-Сёмин Р.И. 18.06.2026 #UT10-5912

	ИначеЕсли ИмяОбъектаМетаданных = "АВСКлассификацияНоменклатуры" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Код = ФабрикаСправочника.КодABC;
		
	ИначеЕсли ИмяОбъектаМетаданных = "УпаковкиЕдиницыИзмерения" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Номенклатура", СпрОбъект, "Владелец", ФабрикаСправочника.Владелец, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("КлассификаторЕдиницИзмерения", СпрОбъект, "ЕдиницаПоКлассификатору", ФабрикаСправочника.ЕдиницаИзмерения, ФабрикаСправочника);
		СпрОбъект.Вес = Число(ФабрикаСправочника.Вес);
		СпрОбъект.Объем = Число(ФабрикаСправочника.Объем);
		СпрОбъект.Коэффициент = Число(ФабрикаСправочника.Числитель);
		СпрОбъект.Длина = Число(ФабрикаСправочника.Глубина);
		СпрОбъект.Ширина = Число(ФабрикаСправочника.Ширина);
		СпрОбъект.Высота = Число(ФабрикаСправочника.Высота);
		СпрОбъект.Негабарит = Булево(ФабрикаСправочника.Негабарит);
		СпрОбъект.КратностьМашинокомплекта = Число(ФабрикаСправочника.КратностьМашинокомплекта);

	ИначеЕсли ИмяОбъектаМетаданных = "ФизическиеЛица" Тогда
		
		Если НЕ ЗначениеЗаполнено(СпрОбъект.Наименование) Тогда 
			СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		КонецЕсли;
		
		СпрОбъект.АРМКладовщика = ФабрикаСправочника.АРМКладовщика;
		
		ТабГруппыРассылок = Новый ТаблицаЗначений;
		ТабГруппыРассылок.Колонки.Добавить("ФизическоеЛицо", Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
		ТабГруппыРассылок.Колонки.Добавить("ГруппаРассылок", Новый ОписаниеТипов("СправочникСсылка.КатегорииОбъектов"));
		ТабГруппыРассылок.Колонки.Добавить("Подключить",	 Новый ОписаниеТипов("Булево"));
		
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ПодключениеКРассылкам", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НоваяСтрока = ТабГруппыРассылок.Добавить();
				ЗаполнитьСвойствоПоПоискуКодаМДМ("КатегорииОбъектов", НоваяСтрока, "ГруппаРассылок", Стр.ГруппаРассылок);
				НоваяСтрока.Подключить = Булево(Стр.Подключить);
				НоваяСтрока.ФизическоеЛицо = ?(СпрОбъект.ЭтоНовый(), СпрОбъект.ПолучитьСсылкуНового(), СпрОбъект.Ссылка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если СпрОбъект.ЭтоНовый() Тогда
			
			Для Каждого Строка Из ТабГруппыРассылок Цикл
				
				Если Строка.Подключить Тогда
					
					МЗ = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи();
					МЗ.Объект = СпрОбъект.ПолучитьСсылкуНового();
					МЗ.Категория = Строка.ГруппаРассылок;
					МЗ.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ТабГруппыРассылок.ФизическоеЛицо КАК Справочник.ФизическиеЛица) КАК ФизическоеЛицо,
			|	ТабГруппыРассылок.ГруппаРассылок,
			|	ТабГруппыРассылок.Подключить
			|ПОМЕСТИТЬ ТабГруппыРассылок
			|ИЗ
			|	&ТабГруппыРассылок КАК ТабГруппыРассылок
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабГруппыРассылок.ФизическоеЛицо,
			|	ТабГруппыРассылок.ГруппаРассылок,
			|	ТабГруппыРассылок.Подключить КАК ПодключитьСтало,
			|	ЛОЖЬ КАК ПодключитьБыло
			|ПОМЕСТИТЬ втГруппыРассылок
			|ИЗ
			|	ТабГруппыРассылок КАК ТабГруппыРассылок
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	КатегорииОбъектов.Объект,
			|	КатегорииОбъектов.Категория,
			|	ИСТИНА,
			|	ИСТИНА
			|ИЗ
			|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
			|ГДЕ
			|	КатегорииОбъектов.Объект = &ФизическоеЛицо
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втГруппыРассылок.ФизическоеЛицо,
			|	втГруппыРассылок.ГруппаРассылок,
			|	МАКСИМУМ(втГруппыРассылок.ПодключитьСтало) КАК ПодключитьСтало,
			|	МАКСИМУМ(втГруппыРассылок.ПодключитьБыло) КАК ПодключитьБыло
			|ИЗ
			|	втГруппыРассылок КАК втГруппыРассылок
			|
			|СГРУППИРОВАТЬ ПО
			|	втГруппыРассылок.ФизическоеЛицо,
			|	втГруппыРассылок.ГруппаРассылок";
			
			Запрос.УстановитьПараметр("ТабГруппыРассылок", ТабГруппыРассылок.Скопировать());
			Запрос.УстановитьПараметр("ФизическоеЛицо", СпрОбъект.Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Не Выборка.ПодключитьСтало и Выборка.ПодключитьБыло Тогда
					
					НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Объект.Установить(СпрОбъект.Ссылка);
					НаборЗаписей.Отбор.Категория.Установить(Выборка.ГруппаРассылок);
					НаборЗаписей.Записать();
					
				ИначеЕсли Выборка.ПодключитьСтало и Не Выборка.ПодключитьБыло Тогда
					
					МЗ = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи();
					МЗ.Объект = СпрОбъект.Ссылка;
					МЗ.Категория = Выборка.ГруппаРассылок;
					МЗ.Записать();
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	ИначеЕсли ИмяОбъектаМетаданных = "БанковскиеСчетаКонтрагентов" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.НомерСчета = ФабрикаСправочника.НомерСчета;
		
		Если Булево(ФабрикаСправочника.РучноеИзменениеРеквизитовБанка) Тогда
			СпрОбъект.Банк = Справочники.Банки.НайтиПоКоду(ФабрикаСправочника.БИКБанка);
		Иначе
			ЗаполнитьСвойствоПоПоискуКодаМДМ("Банки", СпрОбъект, "Банк", ФабрикаСправочника.Банк, ФабрикаСправочника);
		КонецЕсли;
		
		Если Булево(ФабрикаСправочника.РучноеИзменениеРеквизитовБанкаДляРасчетов) Тогда
			СпрОбъект.БанкДляРасчетов = Справочники.Банки.НайтиПоКоду(ФабрикаСправочника.БИКБанкаДляРасчетов);
		Иначе
			ЗаполнитьСвойствоПоПоискуКодаМДМ("Банки", СпрОбъект, "БанкДляРасчетов", ФабрикаСправочника.БанкДляРасчетов, ФабрикаСправочника);
		КонецЕсли;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Контрагенты", СпрОбъект, "Владелец", ФабрикаСправочника.Владелец, ФабрикаСправочника);
		
		СпрОбъект.ТекстКорреспондента = ФабрикаСправочника.ТекстКорреспондента;
		СпрОбъект.ТекстНазначения = ФабрикаСправочника.ТекстНазначения;
		СпрОбъект.ВидСчета = "Расчетный";
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Валюты", СпрОбъект, "ВалютаДенежныхСредств", ФабрикаСправочника.ВалютаДенежныхСредств, ФабрикаСправочника);
		
		Если Булево(ФабрикаСправочника.ОсновнойБанковскийСчет) И ЗначениеЗаполнено(СпрОбъект.Владелец) Тогда
			
			КонтрагентОбъект = СпрОбъект.Владелец.ПолучитьОбъект();
			
			Если КонтрагентОбъект <> Неопределено Тогда
				
				Если СпрОбъект.ЭтоНовый() Тогда
					КонтрагентОбъект.ОсновнойБанковскийСчет = СпрОбъект.ПолучитьСсылкуНового();
				Иначе
					КонтрагентОбъект.ОсновнойБанковскийСчет = СпрОбъект.Ссылка;
				КонецЕсли; 
				
				КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
				КонтрагентОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбъектаМетаданных = "КлассификаторБанковРФ" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Код = ФабрикаСправочника.Код;
		
		Если Не СпрОбъект.ЭтоГруппа Тогда
			
			СпрОбъект.КоррСчет = ФабрикаСправочника.КоррСчет;
			СпрОбъект.Город = ФабрикаСправочника.Город;
			СпрОбъект.Адрес = ФабрикаСправочника.Адрес;
			СпрОбъект.Телефоны = ФабрикаСправочника.Телефоны;
			
		КонецЕсли;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Банки", СпрОбъект, "Родитель", ФабрикаСправочника.Родитель, ФабрикаСправочника);

	ИначеЕсли ИмяОбъектаМетаданных = "ИсточникиЗаказов" Тогда 		
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.КодИсточника = ФабрикаСправочника.КодИсточника;		

	ИначеЕсли ИмяОбъектаМетаданных = "СтатусыФНСКонтрагента" Тогда 
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;

	ИначеЕсли ИмяОбъектаМетаданных = "СтраныМира" Тогда 		
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Код = ФабрикаСправочника.Код;
		СпрОбъект.КодАльфа2 = ФабрикаСправочника.КодАльфа2;
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;

	ИначеЕсли ИмяОбъектаМетаданных = "ОтчетКомиссионера_ПоляExcel" Тогда 
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование; 	

	ИначеЕсли ИмяОбъектаМетаданных = "ГруппыРассылок" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование; 	
		СпрОбъект.НазначениеКатегории = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_ФизическиеЛица;
		
	ИначеЕсли ИмяОбъектаМетаданных = "Кассы" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование; 	
		СпрОбъект.ИД = ФабрикаСправочника.ИД; 	
		СпрОбъект.ОбновлятьСтатусКассыССервера = Булево(ФабрикаСправочника.ОбновлятьСтатусКассыССервера);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Валюты", СпрОбъект, "ВалютаДенежныхСредств", ФабрикаСправочника.ВалютаДенежныСредств, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Организации", СпрОбъект, "Владелец", ФабрикаСправочника.Владелец, ФабрикаСправочника);
		
		СтруктураМДМ = Новый Структура("ОтветственноеЛицоОсновнойКассир",Справочники.ФизическиеЛица.ПустаяСсылка());
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ФизическиеЛица", СтруктураМДМ, "ОтветственноеЛицоОсновнойКассир", ФабрикаСправочника.ОтветственноеЛицоОсновнойКассир, ФабрикаСправочника);
		
		Отбор = Новый Структура("СтруктурнаяЕдиница", ?(СпрОбъект.ЭтоНовый(), СпрОбъект.ПолучитьСсылкуНового(), СпрОбъект.Ссылка));
		ТекущаяЗапись = РегистрыСведений.ОтветственныеЛица.ПолучитьПоследнее(ТекущаяДата(), Отбор);
		
		Если ТекущаяЗапись.ФизическоеЛицо <> СтруктураМДМ.ОтветственноеЛицоОсновнойКассир и ЗначениеЗаполнено(СтруктураМДМ.ОтветственноеЛицоОсновнойКассир) Тогда
			
			МенеджерЗаписи = РегистрыСведений.ОтветственныеЛица.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = ТекущаяДата();
			МенеджерЗаписи.СтруктурнаяЕдиница = ?(СпрОбъект.ЭтоНовый(), СпрОбъект.ПолучитьСсылкуНового(), СпрОбъект.Ссылка);
			МенеджерЗаписи.ФизическоеЛицо = СтруктураМДМ.ОтветственноеЛицоОсновнойКассир;			
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
		Если ТипЗнч(ФабрикаСправочника.ГоловнаяКасса) = Тип("ОбъектXDTO") И ФабрикаСправочника.ГоловнаяКасса.Свойства().Получить("GUID") <> Неопределено Тогда
			СпрОбъект.КодМДМГоловнойКассы = ФабрикаСправочника.ГоловнаяКасса.GUID; 
		КонецЕсли;
		
		СпрОбъект.ИнкасацияЧерезОсновнуюКассу = Булево(ФабрикаСправочника.ИнкассацияЧерезОсновнуюКассу);

	ИначеЕсли ИмяОбъектаМетаданных = "СертификатТорговойТочки" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование; 			
		
	ИначеЕсли ИмяОбъектаМетаданных = "ПоставщикиТОХ" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Контрагенты", СпрОбъект, "Контрагент", ФабрикаСправочника.Контрагент, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ДоговорыКонтрагентов", СпрОбъект, "ДоговорКонтрагента", ФабрикаСправочника.ДоговорКонтрагента, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ДоговорыКонтрагентов", СпрОбъект, "ДоговорВыкупа", ФабрикаСправочника.ДоговорВыкупа, ФабрикаСправочника);
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Номенклатура", СпрОбъект, "ПроизводительПоУмолчанию", ФабрикаСправочника.БрендПоУмолчанию, ФабрикаСправочника);
		
		СпрОбъект.НомерКолонкиДатаМХ1		  = Число(ФабрикаСправочника.НомерКолонкиДатаМХ1);
		СпрОбъект.НомерКолонкиДатаУПД		  = Число(ФабрикаСправочника.НомерКолонкиДатаУПД);
		СпрОбъект.НомерКолонкиНомерМХ1		  = Число(ФабрикаСправочника.НомерКолонкиНомерМХ1);
		СпрОбъект.НомерКолонкиНомерУПД		  = Число(ФабрикаСправочника.НомерКолонкиНомерУПД);
		СпрОбъект.НомерПервойСтрокиМХ1		  = Число(ФабрикаСправочника.НомерПервойСтрокиМХ1);
		СпрОбъект.НомерПервойСтрокиПрайсЛиста = Число(ФабрикаСправочника.НомерПервойСтрокиПрайсЛиста);
		СпрОбъект.НомерПервойСтрокиУПД 		  = Число(ФабрикаСправочника.НомерПервойСтрокиУПД);
		СпрОбъект.НомерСтрокиДатаМХ1		  = Число(ФабрикаСправочника.НомерСтрокиДатаМХ1);
		СпрОбъект.НомерСтрокиДатаУПД 		  = Число(ФабрикаСправочника.НомерСтрокиДатаУПД);
		СпрОбъект.НомерСтрокиНомерМХ1		  = Число(ФабрикаСправочника.НомерСтрокиНомерМХ1);
		СпрОбъект.НомерСтрокиНомерУПД 		  = Число(ФабрикаСправочника.НомерСтрокиНомерУПД);
		
		СпрОбъект.ПроизводителиПоУмолчанию.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "БрендыПоУмолчанию", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого СтрокаМассива Из МассивСтрок Цикл
				
				НовСтр = СпрОбъект.ПроизводителиПоУмолчанию.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр, СтрокаМассива);
				НовСтр.ПроизводительПоУмолчанию = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СокрЛП(СтрокаМассива.ПроизводительПоУмолчанию.GUID));
				
			КонецЦикла;			
			
		КонецЕсли;
		
		СпрОбъект.НастрокиЗагрузкиПрайсЛиста.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "ПрайсЛист", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НоваяСтрока = СпрОбъект.НастрокиЗагрузкиПрайсЛиста.Добавить();
				ЗаполнитьСвойствоПоПоискуКодаМДМ("EMailЗаказ_ПоляExcel", НоваяСтрока, "ПолеExcel", Стр.ПолеExcel);
				НоваяСтрока.НомерКолонки = Число(Стр.НомерКолонки);
				
			КонецЦикла;
			
		КонецЕсли; 
		
		СпрОбъект.НастрокиЗагрузкиМХ1.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "МХ1", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НоваяСтрока = СпрОбъект.НастрокиЗагрузкиМХ1.Добавить();
				ЗаполнитьСвойствоПоПоискуКодаМДМ("EMailЗаказ_ПоляExcel", НоваяСтрока, "ПолеExcel", Стр.ПолеExcel);
				НоваяСтрока.НомерКолонки = Число(Стр.НомерКолонки);
				
			КонецЦикла;
			
		КонецЕсли; 
		
		СпрОбъект.НастрокиЗагрузкиУПД.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "УПД", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НоваяСтрока = СпрОбъект.НастрокиЗагрузкиУПД.Добавить();
				ЗаполнитьСвойствоПоПоискуКодаМДМ("EMailЗаказ_ПоляExcel", НоваяСтрока, "ПолеExcel", Стр.ПолеExcel);
				НоваяСтрока.НомерКолонки = Число(Стр.НомерКолонки);
				
			КонецЦикла;
			
		КонецЕсли;		
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("РазделятьВыкупы") = Неопределено Тогда
			СпрОбъект.РазделятьВыкупы = Булево(ФабрикаСправочника.РазделятьВыкупы); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ЭлектроннаяПочтаДляОтправкиВыкупа") = Неопределено Тогда
			СпрОбъект.ЭлектроннаяПочтаДляОтправкиВыкупа = СокрЛП(ФабрикаСправочника.ЭлектроннаяПочтаДляОтправкиВыкупа); 
		КонецЕсли;
		
		Если НЕ ФабрикаСправочника.Свойства().Получить("ПечатьМХ3НаНачалоПериода") = Неопределено Тогда
			СпрОбъект.ПечатьМХ3наНачалоПериода = Булево(ФабрикаСправочника.ПечатьМХ3НаНачалоПериода); 
		КонецЕсли;
		
		//+Сёмин Р.И. 17.08.2026 #UT10-6012
		Если НЕ ФабрикаСправочника.Свойства().Получить("ОтправлятьВыкупыАвтоматом") = Неопределено Тогда
			СпрОбъект.ОтправлятьВыкупыАвтоматом = Булево(ФабрикаСправочника.ОтправлятьВыкупыАвтоматом); 
		КонецЕсли;
		
		СпрОбъект.РасписаниеФормированияВыкупов.Очистить();
		МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "РасписаниеФормированияВыкупов", "Строка");
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Для Каждого Стр Из МассивСтрок Цикл 				
				
				НовСтр = СпрОбъект.РасписаниеФормированияВыкупов.Добавить();
				НовСтр.ДеньНеделиНомер = Число(Стр.ДеньНеделиНомер);
				НовСтр.Время = ПреобразоватьДатуМДМ(Стр.Время);
				
			КонецЦикла;
			
		КонецЕсли;
		//-Сёмин Р.И. 17.08.2026 #UT10-6012

	ИначеЕсли ИмяОбъектаМетаданных = "ТокеныДоступа" Тогда
		
		ЗаполнитьСвойствоПоПоискуКодаМДМ("Контрагенты", СпрОбъект, "Контрагент", ФабрикаСправочника.Контрагент, ФабрикаСправочника);
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Неактивен    = Булево(ФабрикаСправочника.Неактивен);
		
	ИначеЕсли ИмяОбъектаМетаданных = "ТоварныеГруппыЧестногоЗнака" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Алиас = ФабрикаСправочника.Алиас;
		СпрОбъект.ШаблонМаркировки = Число(ФабрикаСправочника.ШаблонМаркировки);
		СпрОбъект.ДатаЖесткогоКонтроля = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаКонтроля);
		СпрОбъект.УказыватьДатуПроизводства = Булево(ФабрикаСправочника.УказыватьДатуПроизводства);
		СпрОбъект.ОтчетОНанесении = Булево(ФабрикаСправочника.ОтчетОНанесении);
		СпрОбъект.ДатаОкончанияМаркировкиОстатков = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаОкончанияМаркировкиОстатков);
		СпрОбъект.ОтображатьВПрайсЛистах = Булево(ФабрикаСправочника.ОтображатьВПрайсЛистах);
		
		//+Сёмин Р.И. 22.05.2026 #UT10-5855
		СпрОбъект.ОбъемноСортовойУчет = Булево(ФабрикаСправочника.ОбъемноСортовойУчет);
		//-Сёмин Р.И. 22.05.2026 #UT10-5855
		
		//+Сёмин Р.И. 22.05.2026 #UT10-5862
		СпрОбъект.ТолькоПеремаркировка = Булево(ФабрикаСправочника.ТолькоПеремаркировка);
		//-Сёмин Р.И. 22.05.2026 #UT10-5862
		
		//+Сёмин Р.И. 18.06.2026 #UT10-5912
		СпрОбъект.ОстаточныйСрокГодности = Число(ФабрикаСправочника.ОстаточныйСрокГодности);
		//-Сёмин Р.И. 18.06.2026 #UT10-5912
		
		//+Сёмин Р.И. 30.06.2026 #UT10-5933
		СпрОбъект.СтартКонтроляВладельца = ПреобразоватьДатуМДМ(ФабрикаСправочника.СтартКонтроляВладельца);
		//-Сёмин Р.И. 30.06.2026 #UT10-5933
		
		//+Макрушин Е. 28.07.2026 #UT10-5973
		СпрОбъект.ИспользуетсяМОД = Булево(ФабрикаСправочника.ИспользуетсяМОД); 
		//-Макрушин Е. 28.07.2026 #UT10-5973
		
		//+Макрушин Е. 07.09.2026 #UT10-6036
		Если НЕ ФабрикаСправочника.Свойства().Получить("СпособыВыпускаВОборот") = Неопределено Тогда	
			
			СпрОбъект.СпособыВыпускаВОборот.Очистить();
			
			МассивСтрок = СформироватьМассивПоСвойству(ФабрикаСправочника, "СпособыВыпускаВОборот", "Строка");
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				Для каждого Стр Из МассивСтрок Цикл 				
					
					НоваяСтрока = СпрОбъект.СпособыВыпускаВОборот.Добавить();
					ЗаполнитьСвойствоПоПоискуКодаМДМ("СпособыВыпускаВОборот", НоваяСтрока, "СпособВыпускаВОборот", Стр.СпособВыпуска, ФабрикаСправочника);
					НоваяСтрока.ДатаНачала = ПреобразоватьДатуМДМ(Стр.ДатаНачала);
					НоваяСтрока.ДатаОкончания = ПреобразоватьДатуМДМ(Стр.ДатаОкончания);
					
				КонецЦикла;    
				
			КонецЕсли;
			
		КонецЕсли;
		//-Макрушин Е. 07.09.2026 #UT10-6036
     	
	//+Макрушин Е. 07.09.2026 #UT10-6036	
	ИначеЕсли ИмяОбъектаМетаданных = "СпособыВыпускаВОборот" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.Алиас = ФабрикаСправочника.Алиас;  
	//-Макрушин Е. 07.09.2026 #UT10-6036		
		
	ИначеЕсли ИмяОбъектаМетаданных = "КодыТНВЭД" Тогда
	
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		СпрОбъект.КодТНВЭД = ФабрикаСправочника.КодТНВЭД;
	
	ИначеЕсли ИмяОбъектаМетаданных = "GTIN" Тогда
		
		СпрОбъект.ПометкаУдаления = ФабрикаСправочника.ПометкаУдаления;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;     
		СпрОбъект.GTIN = ФабрикаСправочника.GTIN;
		СпрОбъект.Владелец = СсылкаПоИдентификатору(Тип("СправочникСсылка.Номенклатура"), ФабрикаСправочника.Владелец.GUID);   
		
		Если Не ЗначениеЗаполнено(ФабрикаСправочника.Поставщик.GUID) Тогда
			СпрОбъект.Поставщик = Справочники.Контрагенты.ПустаяСсылка();   
		Иначе	
			СпрОбъект.Поставщик = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.Поставщик.GUID)); 
		КонецЕсли;
		
	//+Макрушин Е. 02.09.2026 #UT11-6040
	ИначеЕсли ИмяОбъектаМетаданных = "СертификатыНоменклатуры" Тогда
		
		СпрОбъект.ПометкаУдаления = ФабрикаСправочника.ПометкаУдаления;
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;     
		СпрОбъект.СсылкаНаРеестрСертификатов = ФабрикаСправочника.СсылкаНаРеестрСертификатов;
		СпрОбъект.ДатаНачалаСрокаДействия = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаНачалаСрокаДействия);
		СпрОбъект.ДатаОкончанияСрокаДействия = ПреобразоватьДатуМДМ(ФабрикаСправочника.ДатаОкончанияСрокаДействия);
		СпрОбъект.ТипСертификата = ФабрикаСправочника.ТипСертификата; 
	//-Макрушин Е. 02.09.2026 #UT11-6040
		
	ИначеЕсли ИмяОбъектаМетаданных = "КлассификаторОКПД2" Тогда
		
		СпрОбъект.Наименование = ФабрикаСправочника.Наименование;
		СпрОбъект.НаименованиеПолное = ФабрикаСправочника.НаименованиеПолное;
		СпрОбъект.КодОКПД2 = ФабрикаСправочника.Код;
	
	ИначеЕсли ИмяОбъектаМетаданных = "СобственныеСклады" Тогда
		
		КодМДМПрайсЛиста = Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста;
		
		НастройкаФилиала = Неопределено;
		
		Для Каждого Строка Из ФабрикаСправочника.НастройкиФилиалов Цикл
			
			Если КодМДМПрайсЛиста = СокрЛП(Строка.ПрайсЛист.GUID) Тогда
				
				НастройкаФилиала = Строка;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СпрОбъект.Идентификатор = Число(ФабрикаСправочника.Идентификатор);
		
		СпрОбъект.Наименование = СокрЛП(ФабрикаСправочника.Наименование);
		СпрОбъект.СкладПоставщикаДляСтатусовНаПортале = СокрЛП(ФабрикаСправочника.НаименованиеСкладаДляСтатусовНаПортале);
		СпрОбъект.АдресВебСервиса = СокрЛП(ФабрикаСправочника.АдресВебСервиса);
		СпрОбъект.КодГрузоотправителяУТ11 = СокрЛП(ФабрикаСправочника.ФилиалОтправитель.GUID);
	
		Если НастройкаФилиала = Неопределено Тогда
			СпрОбъект.ИсключитьИзОбщегоЭкспресса = Ложь;
		Иначе
			
			СпрОбъект.ИсключитьИзОбщегоЭкспресса = Булево(ФабрикаСправочника.ИсключитьИзОбщегоЭкспресса);
			СпрОбъект.ВебСервисУТ11 = Булево(ФабрикаСправочника.ВебСервисУТ11);
			СпрОбъект.ДоставкаЧерезСкладТомилино = Булево(ФабрикаСправочника.ДоставкаЧерезСкладТомилино);
			СпрОбъект.НеИспользоватьОбособленнуюОтгрузку = Булево(ФабрикаСправочника.НеИспользоватьОбособленнуюОтгрузку);
			СпрОбъект.СоздаватьСчетФактуруПриПроведенииПТУ = Булево(ФабрикаСправочника.СоздаватьСчетФактуру);
			СпрОбъект.СоздаватьНоменклатуруВМДМ = Булево(ФабрикаСправочника.СоздаватьНоменклатуру);
			
			СпрОбъект.ДнейВПути = Число(ФабрикаСправочника.ДнейВПути);
			
			СпрОбъект.Поставщик = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.Поставщик.GUID));
			СпрОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СокрЛП(ФабрикаСправочника.ДоговорСПоставщиком.GUID));
			
			Если ЗначениеЗаполнено(НастройкаФилиала.АльтернативныйАдресВебСервиса) Тогда
				СпрОбъект.АдресВебСервиса = СокрЛП(ФабрикаСправочника.АльтернативныйАдресВебСервиса);
			КонецЕсли;
			
			СпрОбъект.КодКонтрагента = СокрЛП(ФабрикаСправочника.ФилиалПолучатель.GUID);
			СпрОбъект.КодДоговора = СокрЛП(ФабрикаСправочника.ДоговорСПокупателем.GUID);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектЗагрузки(СпрОбъект, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки, ЗаменяющийСправочник = "")
	
	Если СпрОбъект = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ФабрикаИмени.Свойства().Получить("ШтампВерсии") = Неопределено Тогда
		ШтампВерсии = Число(ФабрикаИмени.ШтампВерсии);
	Иначе
		ШтампВерсии = 0;
	КонецЕсли;

	Если (НЕ СпрОбъект.ЭтоНовый() И НЕ ЗначениеЗаполнено(СпрОбъект.ШтампВерсии) ) 
		Или (СпрОбъект.ШтампВерсии < ШтампВерсии) или (СпрОбъект.ЭтоНовый() и ШтампВерсии=0)
		ИЛИ (СпрОбъект.ШтампВерсии = ШтампВерсии) Тогда

		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.ПометкаУдаления = Булево(ФабрикаИмени.ПометкаУдаления);
		
		СпрОбъект.КодМДМ = ФабрикаИмени.GUID;    			
		СпрОбъект.ШтампВерсии = ШтампВерсии;
		
		ОчиститьПустыеСвойства(ФабрикаИмени);		
		ОбработатьРеквизитыФабрики(СпрОбъект, ИмяОбъектаМетаданныхИсточник, ФабрикаИмени, ИмяОчереди);		
		
		Если СпрОбъект.ЭтоНовый() И ЗначениеЗаполнено(СправочникЗагрузки.РодительЗагрузки) Тогда
			СпрОбъект.Родитель = СправочникЗагрузки.РодительЗагрузки;	
		КонецЕсли;     
		
		СпрОбъект.Записать();
		
		Если ЗначениеЗаполнено(ЗаменяющийСправочник)  Тогда
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Получен элемент справочника " 
			+ ИмяОбъектаМетаданныхИсточник + " : " + СпрОбъект.Ссылка + " заменяющий его справочник " + ЗаменяющийСправочник);	
		Иначе
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Получен элемент справочника " 
			+ ИмяОбъектаМетаданных + " : " + СпрОбъект.Ссылка);	
		КонецЕсли; 
		
		Если ИмяОбъектаМетаданных = "Номенклатура" и ИмяОбъектаМетаданных = ИмяОбъектаМетаданныхИсточник Тогда
			
			//Проверим, не зависли ли элементы связанных справочников
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.МоментОшибки КАК МоментОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОбъектаМетаданных,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМ КАК КодМДМ,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяСопутствСправочника,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМСопутствСправочника,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ТекстОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ОписаниеОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.Обработано,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НомерСообщения,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НужноОбработать,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОчереди,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КоличествоПопыток,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ШтампВерсии КАК ШтампВерсии
			|ИЗ
			|	РегистрСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP КАК ОшибкиЗагрузкиДанныхИзОчередиAMQP
			|ГДЕ
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НужноОбработать = ИСТИНА
			|	И ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМСопутствСправочника = &КодМДМ
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШтампВерсии УБЫВ
			|ИТОГИ ПО
			|	КодМДМ";
			
			Запрос.УстановитьПараметр("КодМДМ",ФабрикаИмени.GUID);
			ВыборкаПоСправочникам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоСправочникам.Следующий() Цикл
				
				Выборка = ВыборкаПоСправочникам.Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					Чтение = Новый ЧтениеXML;
					Пар = Новый ПараметрыЧтенияXML(,,,,,,,,, Истина, Истина);
					
					Чтение.УстановитьСтроку(Выборка.ОписаниеОшибки, Пар);
					ФабрикаМДМ = ФабрикаXDTO.ПрочитатьXML(Чтение);
					
					ИмяОбъектаМетаданных_ = Выборка.ИмяОбъектаМетаданных;
					СправочникЗагрузки = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ИмяОбъектаМетаданных_);			
					
					Если ИмяОбъектаМетаданных_ = "ЕдиницыИзмерения" Тогда
						
						ИмяОбъектаМетаданныхИсточник_ = "УпаковкиЕдиницыИзмерения";
						СпрОбъектМДМ = ПолучитьОбъектПоФабрике(ФабрикаМДМ, ИмяОбъектаМетаданных_, ИмяОчереди);   			
						ЗаполнитьОбъектЗагрузки(СпрОбъектМДМ, ФабрикаМДМ, ИмяОбъектаМетаданныхИсточник_, ИмяОбъектаМетаданных_, ИмяОчереди, СправочникЗагрузки);
						
					ИначеЕсли ИмяОбъектаМетаданных_ = "Штрихкоды" Тогда
						
						ИмяОбъектаМетаданныхИсточник_ = "ШтрихКодыНоменклатуры";
						РСЗапись = Неопределено;
						РСЗаписи = ПолучитьРегистрСведенийПоФабрике(РСЗапись, ФабрикаМДМ, ИмяОбъектаМетаданных_, ИмяОчереди);
						ЗаполнитьОбъектРегистраСведений(РСЗаписи, РСЗапись, ФабрикаМДМ, ИмяОбъектаМетаданныхИсточник_, ИмяОбъектаМетаданных_, ИмяОчереди, СправочникЗагрузки );
						
					Иначе
						Продолжить;
					КонецЕсли;
					
					КоличествоПопыток = Выборка.КоличествоПопыток;
					
					НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.КодМДМ.Установить(ФабрикаМДМ.GUID);
					НаборЗаписей.Отбор.КодМДМСопутствСправочника.Установить(ФабрикаИмени.GUID);
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() > 0 Тогда
						
						Если НаборЗаписей[0].КоличествоПопыток <= КоличествоПопыток Тогда	//Ошибка не повторилась, можно удалять записи
							НаборЗаписей.Очистить();
							НаборЗаписей.Записать();
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЕсли;  
				
			КонецЦикла;
			
		ИначеЕсли (ИмяОбъектаМетаданных = "Номенклатура" и ИмяОбъектаМетаданныхИсточник = "Производители") 
			  ИЛИ ИмяОбъектаМетаданных = "ЕдиницыИзмерения" или ИмяОбъектаМетаданных = "НоменклатурныеГруппы" //или ИмяОбъектаМетаданных = "Штрихкоды" 
			  ИЛИ ИмяОбъектаМетаданных = "ВидНоменклатуры" или ИмяОбъектаМетаданных = "КлассификаторЕдиницИзмерения" 
			  ИЛИ ИмяОбъектаМетаданных = "АВСКлассификацияНоменклатуры" Тогда
			
			Если ИмяОбъектаМетаданных = "ЕдиницыИзмерения" Тогда
				
				ИмяОбъектаМетаданныхИсточник = "УпаковкиЕдиницыИзмерения";
				Владелец = СпрОбъект.Владелец;
				
				Если СпрОбъект.ЕдиницаПоКлассификатору = Владелец.БазоваяЕдиницаИзмерения и Не ЗначениеЗаполнено(Владелец.ЕдиницаХраненияОстатков) Тогда
					
					ВладелецНом = Владелец.ПолучитьОбъект();
					ВладелецНом.ЕдиницаХраненияОстатков = СпрОбъект.Ссылка;
					ВладелецНом.ЕдиницаДляОтчетов = СпрОбъект.Ссылка;
					ВладелецНом.ОбменДанными.Загрузка = Истина;
					ВладелецНом.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Проверим, не завис ли элемент в РС Ошибки
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.МоментОшибки КАК МоментОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОбъектаМетаданных,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМ КАК КодМДМ,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяСопутствСправочника,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМСопутствСправочника КАК КодМДМСопутствСправочника,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ТекстОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ОписаниеОшибки,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.Обработано,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НомерСообщения,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НужноОбработать,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОчереди,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КоличествоПопыток,
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ШтампВерсии КАК ШтампВерсии
			|ИЗ
			|	РегистрСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP КАК ОшибкиЗагрузкиДанныхИзОчередиAMQP
			|ГДЕ
			|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НужноОбработать = ИСТИНА
			|	И ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМСопутствСправочника = &КодМДМ
			|	И (ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОбъектаМетаданных = ""Номенклатура""
			|	ИЛИ ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОбъектаМетаданных = ""Штрихкоды"")
			|
			|УПОРЯДОЧИТЬ ПО
			|	ШтампВерсии УБЫВ
			|ИТОГИ ПО
			|	КодМДМСопутствСправочника";
			
			Запрос.УстановитьПараметр("КодМДМ",ФабрикаИмени.GUID);
			
			ВыборкаПоОбъектам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоОбъектам.Следующий() Цикл
				
				Выборка = ВыборкаПоОбъектам.Выбрать();
				
				Если Выборка.Следующий() Тогда
					
					Чтение = Новый ЧтениеXML;
					Пар = Новый ПараметрыЧтенияXML(,,,,,,,,,Истина, Истина);
					Чтение.УстановитьСтроку(Выборка.ОписаниеОшибки, Пар);
					ФабрикаМДМ = ФабрикаXDTO.ПрочитатьXML(Чтение);
					
					ИмяОбъектаМетаданных_ = Выборка.ИмяОбъектаМетаданных;
					ИмяОбъектаМетаданныхИсточник_ = Выборка.ИмяОбъектаМетаданных;
					
					КоличествоПопыток = Выборка.КоличествоПопыток;
					СправочникЗагрузки = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ИмяОбъектаМетаданных_);			
					
					Если СправочникЗагрузки.ТипДанных = "РегистрыСведений" Тогда
						
						РСЗапись = Неопределено;
						РСЗаписи = ПолучитьРегистрСведенийПоФабрике(РСЗапись, ФабрикаМДМ, ИмяОбъектаМетаданных_, ИмяОчереди);
						ЗаполнитьОбъектРегистраСведений(РСЗаписи, РСЗапись, ФабрикаМДМ, ИмяОбъектаМетаданныхИсточник_, ИмяОбъектаМетаданных_, ИмяОчереди, СправочникЗагрузки );
						
					Иначе
						
						СпрОбъектМДМ = ПолучитьОбъектПоФабрике(ФабрикаМДМ, ИмяОбъектаМетаданных_, ИмяОчереди);   			
						ЗаполнитьОбъектЗагрузки(СпрОбъектМДМ, ФабрикаМДМ, ИмяОбъектаМетаданныхИсточник_, ИмяОбъектаМетаданных_, ИмяОчереди, СправочникЗагрузки);
						
					КонецЕсли;
					
					НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.КодМДМ.Установить(ФабрикаМДМ.GUID);
					НаборЗаписей.Отбор.КодМДМСопутствСправочника.Установить(ФабрикаИмени.GUID);
					НаборЗаписей.Прочитать();
					
					Если НаборЗаписей.Количество() > 0 Тогда
						
						Если НаборЗаписей[0].КоличествоПопыток <= КоличествоПопыток Тогда	//Ошибка не повторилась, можно удалять записи
							
							НаборЗаписей.Очистить();
							НаборЗаписей.Записать();
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЕсли;   
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Существующий элемент справочника " 
		+ ИмяОбъектаМетаданных + " : " + СпрОбъект.Ссылка + " имеет больший штамп версии, чем загружаемый. Сообщение отклонено.");			
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьОбъектПоФабрике(ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы, Создавать = Истина, ВернутьСсылку = Ложь, ЭтоГруппа = Ложь, ЗаменяющийСправочник = "")
	
	ИмяОбъектаМетаданныхОригинал = ИмяОбъектаМетаданных;
	Если ЗначениеЗаполнено(ЗаменяющийСправочник) Тогда
		ИмяОбъектаМетаданных = ЗаменяющийСправочник;
	КонецЕсли; 
	
	ГУИД = "";
	СпрОбъект = Неопределено;
	
	СпрСсылка = Справочники[ИмяОбъектаМетаданных].НайтиПоРеквизиту("КодМДМ", ФабрикаИмени.GUID);
	
	Если НЕ СпрСсылка.Пустая() Тогда
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	Если СпрОбъект = Неопределено Тогда
		
		Если ТипЗнч(ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем) = Тип("ОбъектXDTO") Тогда
			
			Если ТипЗнч(ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки) = Тип("СписокXDTO") Тогда			
				
				Для Каждого Стр Из ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки Цикл
					
					Если Стр.КодПрикладнойСистемы = КодПрикладнойСистемы И ТипЗнч(Стр.GUID) = Тип("Строка") Тогда
						
						ГУИД = Стр.GUID;
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ГУИД) Тогда
					
					СпрСсылка = Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
					СпрОбъект = СпрСсылка.ПолучитьОбъект();
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки) = Тип("ОбъектXDTO") Тогда
				
				ГУИД = ""; 				
				
				Если ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки.КодПрикладнойСистемы = КодПрикладнойСистемы 
					И ТипЗнч(ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки.GUID) = Тип("Строка")Тогда
					ГУИД = ФабрикаИмени.УникальныеИдентификаторыПрикладныхСистем.Строки.GUID;		
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ГУИД) Тогда
					
					СпрСсылка = Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
					СпрОбъект = СпрСсылка.ПолучитьОбъект();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СпрОбъект = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ФабрикаИмени.GUID) Тогда
			
			СпрСсылка = Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(ФабрикаИмени.GUID));
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
			
		КонецЕсли;
		
	КонецЕсли; 		
	
	
	//По коду МДМ не нашли, продолжаем поиск по остальным ключевым реквизитам
	Если СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "Номенклатура" и Не ЗначениеЗаполнено(ЗаменяющийСправочник) Тогда
		
		ЗагружатьНоменклатуруТолькоПоКодуМДМ = Константы.ЗагружатьНоменклатуруТолькоПоКодуМДМ.Получить();
		Если ЗагружатьНоменклатуруТолькоПоКодуМДМ Тогда	
			//Если не нашли по коду МДМ, то сразу создаем новую
			СпрОбъект = Справочники.Номенклатура.СоздатьЭлемент();			
		Иначе
			//Перенес поиск номенклатуры в отдельную функцию
			СпрОбъект = ПоискИСозданиеНоменклатуры(ФабрикаИмени);
		КонецЕсли;
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "КлассификаторЕдиницИзмерения" Тогда
		
		СпрСсылка = Справочники[ИмяОбъектаМетаданных].НайтиПоКоду(ФабрикаИмени.Код);
		
		Если НЕ СпрСсылка.Пустая() Тогда
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "ОператорыЭДО" Тогда
		
		СпрСсылка = Справочники[ИмяОбъектаМетаданных].НайтиПоНаименованию(ФабрикаИмени.Наименование);
		
		Если НЕ СпрСсылка.Пустая() Тогда
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли; 
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "АВСКлассификацияНоменклатуры" Тогда
		
		СпрСсылка = Справочники[ИмяОбъектаМетаданных].НайтиПоКоду(ФабрикаИмени.КодABC);
		
		Если НЕ СпрСсылка.Пустая() Тогда
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "Кассы" Тогда
		
		Если ТипЗнч(ФабрикаИмени.Владелец) = Тип("ОбъектXDTO") И ФабрикаИмени.Владелец.Свойства().Количество() > 0 Тогда
			
			Владелец = Справочники.Организации.НайтиПоРеквизиту("КодМДМ", ФабрикаИмени.Владелец.GUID);
			
			Если Владелец.Пустая() Тогда
				
				//Владелец еще не загрузился в ИБ
				ТекстОшибки = "Не найден владелец Кассы организация КодМДМ " + СокрЛП(ФабрикаИмени.Владелец.GUID);
				ЗаписатьОшибкуВРС(ФабрикаИмени, ИмяОбъектаМетаданных, ФабрикаИмени.GUID, "Организации", ФабрикаИмени.Владелец.GUID, ТекстОшибки);
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "ЕдиницыИзмерения" Тогда
		
		Если ТипЗнч(ФабрикаИмени.Владелец) = Тип("ОбъектXDTO") И ФабрикаИмени.Владелец.Свойства().Количество() > 0 
			И ФабрикаИмени.Владелец.Свойства().Получить("Тип") <> Неопределено и ФабрикаИмени.Владелец.Тип = "Справочник.Номенклатура" Тогда
			
			Владелец = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", ФабрикаИмени.Владелец.GUID);
			
			Если Владелец.Пустая() Тогда
				
				//Владелец еще не загрузился в ИБ, сохраним сведения о ЕИ в регистре сведений. ЕИ будет создана после загрузки номенклатуры
				ТекстОшибки = "Не найден владелец ЕИ " + СокрЛП(ФабрикаИмени.Владелец.GUID);
				ЗаписатьОшибкуВРС(ФабрикаИмени, ИмяОбъектаМетаданных, ФабрикаИмени.GUID, "Номенклатура", ФабрикаИмени.Владелец.GUID, ТекстОшибки);
				Возврат Неопределено;
				
			КонецЕсли;
			
			БазоваяЕИ = Справочники.КлассификаторЕдиницИзмерения.НайтиПоРеквизиту("КодМДМ", ФабрикаИмени.ЕдиницаИзмерения.GUID);
			
			Если ЗначениеЗаполнено(Владелец.ЕдиницаХраненияОстатков) и Владелец.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору = БазоваяЕИ Тогда
				СпрОбъект = Владелец.ЕдиницаХраненияОстатков.ПолучитьОбъект();
				
			Иначе
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ЕдиницыИзмерения.Ссылка,
				|	ЕдиницыИзмерения.ПометкаУдаления КАК ПометкаУдаления,
				|	ЕдиницыИзмерения.ЕдиницаПоКлассификатору
				|ИЗ
				|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
				|ГДЕ
				|	ЕдиницыИзмерения.Владелец = &Владелец
				|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &БазоваяЕИ
				|
				|УПОРЯДОЧИТЬ ПО
				|	ПометкаУдаления";
				
				Запрос.УстановитьПараметр("Владелец", Владелец);
				Запрос.УстановитьПараметр("БазоваяЕИ", БазоваяЕИ);
				
				//Получаем еи сначала без пометок на удаление, если такие есть
				Выборка = Запрос.Выполнить().Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
					Прервать;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли СпрОбъект = Неопределено и ИмяОбъектаМетаданных = "Банки" Тогда
		
		СпрСсылка = Справочники[ИмяОбъектаМетаданных].НайтиПоКоду(ФабрикаИмени.Код);
		
		Если НЕ СпрСсылка.Пустая() Тогда
			СпрОбъект = СпрСсылка.ПолучитьОбъект();
		КонецЕсли;
		
		ЭтоГруппа = (ФабрикаИмени.ЭтоГруппа = "true");
		
	КонецЕсли;
	
	Если Создавать Тогда
		
		Если СпрОбъект = Неопределено Тогда 			
			
			Если ЭтоГруппа = Ложь Тогда
				
				СпрОбъект = Справочники[ИмяОбъектаМетаданных].СоздатьЭлемент();
				
				Если ЗначениеЗаполнено(ФабрикаИмени.GUID) Тогда
					
					СпрОбъект.УстановитьСсылкуНового(Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(ФабрикаИмени.GUID)));
					СпрОбъект.УстановитьНовыйКод();
					
				КонецЕсли; 			
				
			Иначе 
				
				СпрОбъект = Справочники[ИмяОбъектаМетаданных].СоздатьГруппу();
				
				Если ЗначениеЗаполнено(ФабрикаИмени.GUID) Тогда
					
					СпрОбъект.УстановитьСсылкуНового(Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор(ФабрикаИмени.GUID)));
					СпрОбъект.УстановитьНовыйКод();
					
				КонецЕсли; 			
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ВернутьСсылку Тогда
		Возврат СпрОбъект;
	Иначе
		
		Если СпрОбъект = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Возврат СпрОбъект.Ссылка
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗагрузитьДокументПоФабрике(СообщениеJSON, СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ)
	
	Если ВидДокумента = "ПеремещениеТоваров" Или ВидДокумента = "РеализацияТоваровУслуг" Тогда
		
		//Получим основные поля из структуры документа в сообщении
		НомерДок = СокрЛП(СтруктураДокумента.Номер);
		ДатаДок = ПреобразоватьДатуМДМ(СтруктураДокумента.Дата);
		КонтрагентКодАварда = РаботаСАвардой.ФорматироватьСтроку(СтруктураДокумента.КонтрагентКодАварда);
		КонтрагентИНН = СтруктураДокумента.КонтрагентИНН;
		КонтрагентКПП = СтруктураДокумента.КонтрагентКПП;
		СкладГУИД = СтруктураДокумента.СкладGUID;
		
		//Поиск существующих документов
		ДокПоступления = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("НомерСкладскогоДокумента",НомерДок);		
		
		Если ЗначениеЗаполнено(ДокПоступления) Тогда
			//Не трогаем существующие
			Возврат;			
		Иначе
			
			ДокПоступления = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			СобытиеЖурнала = "Создан документ: ";
			
		КонецЕсли;
		
		//Заполнение шапки
		ДокПоступления.Дата = НачалоДня(ТекущаяДата() + 60 * 60 * 24);
		ДокПоступления.ВидПоступления  = Перечисления.ВидыПоступленияТоваров.НаСклад;
		ДокПоступления.КратностьВзаиморасчетов = 1;
		ДокПоступления.КурсВзаиморасчетов  = 1;			
		ДокПоступления.ОтражатьВНалоговомУчете = Истина;
		ДокПоступления.ОтражатьВБухгалтерскомУчете = Истина;	
		ДокПоступления.ОтражатьВУправленческомУчете = Истина;
		ДокПоступления.НДСВключенВСтоимость = Истина;
		ДокПоступления.Организация = Константы.ОсновнаяОрганизация.Получить();
		ДокПоступления.СкладОрдер = Константы.ОсновнойСклад.Получить();
		ДокПоступления.ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить();
		Контрагент = Константы.ОсновнойПоставщик;
		ДокПоступления.Контрагент = Контрагент;
		ДокПоступления.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
		ДокПоступления.Комментарий = "Создан регламентным заданием загрузки из Раббит " + ТекущаяДата();		
		ДокПоступления.Ответственный = глЗначениеПеременной("глТекущийПользователь");
		ДокПоступления.НомерСкладскогоДокумента = НомерДок;
		
		//Заполнение ТЧ
		Для Сч=1 По СообщениеJSON.Количество()-1 Цикл
			
			ТекСтр = СообщениеJSON[Сч];
			ИнвНомер = СокрЛП(ТекСтр.ИнвНомер); //в ут10 это артикул
			Артикул = СокрЛП(ТекСтр.Артикул);
			Упаковка = СокрЛП(ТекСтр.Упаковка);
			КоличествоУпаковок = Число(ТекСтр.КоличествоУпаковок);
			Количество = Число(ТекСтр.Количество);
			Цена = Число(ТекСтр.Цена);
			НомерГТД = СокрЛП(ТекСтр.НомерГТД);
			КодСтраны = СокрЛП(ТекСтр.КодСтраны);
			
			Если ВидДокумента = "РеализацияТоваровУслуг" Тогда
				
				Сумма = Число(ТекСтр.Сумма);
				СтавкаНДС = ПолучитьСтавкуНДСПеречислением(СокрЛП(ТекСтр.СтавкаНДС));
				СуммаНДС = Число(ТекСтр.СуммаНДС);				
				
			Иначе
				
				Сумма = Окр(Количество * Цена, 2);  

				Если ДокПоступления.Дата >= Дата("20260101000000") Тогда
					
					СтавкаНДС = Перечисления.СтавкиНДС.НДС22;
					СуммаНДС = Окр(Сумма * 0.22, 2);
					
				Иначе
					
					СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					СуммаНДС = Окр(Сумма * 0.20, 2);
					
				КонецЕсли;
				
			КонецЕсли;		
			
			НовСтр = ДокПоступления.Товары.Добавить();
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", ИнвНомер);
			НовСтр.Номенклатура = Номенклатура;
			НовСтр.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Упаковка);
			НовСтр.Количество = КоличествоУпаковок;
			НовСтр.Коэффициент = Количество / КоличествоУпаковок;
			НовСтр.Цена = Цена;
			НовСтр.Сумма = Сумма;
			НовСтр.СтавкаНДС = СтавкаНДС;
			НовСтр.СуммаНДС = СуммаНДС;
			НовСтр.Склад = ДокПоступления.СкладОрдер;
			СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НомерГТД, Истина,, Номенклатура);
			
			Если СерияНоменклатуры.Пустая() И Не Номенклатура.Пустая() Тогда
				
				НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
				Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(КодСтраны);
				НовСтр.СерияНоменклатуры = ПроверитьИСоздатьСерию(Номенклатура, НомерГТД, Страна, НомерГТДСсылка);
				
			Иначе			
				НовСтр.СерияНоменклатуры = СерияНоменклатуры;
			КонецЕсли;
			
		КонецЦикла;
		
		ДокПоступления.Записать(); 
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, СобытиеЖурнала+ДокПоступления.Ссылка);				
		
	ИначеЕсли МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) И ВидДокумента = "УстановкаЦенНоменклатурыКонтрагентов" Тогда  
		
		Для каждого СтруктураОбъекта Из СообщениеJSON Цикл
			
			// Данные шапки			
			ЕстьОшибки = Ложь;   
			ДанныеПрайсПМ = ПолучитьДанныеПрайсПМ(СтруктураОбъекта, ЕстьОшибки);    
			
			Если ЕстьОшибки Тогда
				Продолжить;
			КонецЕсли;     
			
			// Поиск / создание документа			
			ДокОбъект = Неопределено;
			ПолучитьДокументУстановкаЦенНоменклатурыКонтрагентов(ДокОбъект, ДанныеПрайсПМ);
			
			// Поиск и добавление в документ номенклатуры с новой ценой
			ДобавитьНоменклатуруПрайсПМСНовойЦеной(ДокОбъект, СтруктураОбъекта, ДанныеПрайсПМ);
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ЗагрузитьПоступлениеТоваровУслугИзЭДО(ТекстСообщения, ТекстОшибки, Отказ, Сообщение, ПринудительнаяЗагрузкаДляКонтрагентаТОХ = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	СтруктураДокумента = ПрочитатьJSON(ЧтениеJSON); 
	
	НомерДок = СокрЛП(СтруктураДокумента.number);
	ДатаДок = ПреобразоватьДатуМДМ(СтруктураДокумента.date);
	КонтрагентКодМДМ = СтруктураДокумента.supplier_mdm_id; 
	ОрганизацияКодМДМ = СтруктураДокумента.organization_mdm_id;
	СкладКодМДМ = СтруктураДокумента.warehouse_mdm_id;  
	//+Шульман А. 25.02.2026 #UT10-5713
	СуммаДокумента = СтруктураДокумента.total.totalAmount;
	СуммаНДСДокумента = СтруктураДокумента.total.totalAmountOfTax;
	//-Шульман А. 25.02.2026 #UT10-5713
	
	Если СтруктураДокумента.Свойство("Id_edi") Тогда
		ВидЗагрузки = 0;
	Иначе
		ВидЗагрузки = 1;
	КонецЕсли;
	
	НомерЭДО = ?(ВидЗагрузки = 0, СтруктураДокумента.Id_edi, НомерДок);
		
	//Поиск существующих документов     
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КонтрагентКодМДМ); 
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
	
		ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не найден контрагент с кодом МДМ " + КонтрагентКодМДМ); 
		
		ТекстОшибки = ТекстОшибки + "Не найден контрагент с кодом МДМ " + КонтрагентКодМДМ + Символы.ПС;
	    Возврат Неопределено;
		
	КонецЕсли; 
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5900
	ЭтоМежфилиальнаяПоставка = ЭтоМежфилиальнаяПоставка(Контрагент);
	//-Сёмин Р.И. 08.06.2026 #UT10-5900
	
	ДокПоступления = НайтиДокументПТУПоНомеруЭДОИКонтрагенту(НомерЭДО, ДатаДок, Контрагент, ВидЗагрузки);
	
	Если ЗначениеЗаполнено(ДокПоступления) Тогда
		
		//+Сёмин Р.И. 08.06.2026 #UT10-5900
		Если ЭтоМежфилиальнаяПоставка Тогда
			
			МСКWEB.УстановитьЗначениеДопСвойства(ДокПоступления, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПодтвержденияЭДОПТУ, Перечисления.СтатусыПодтвержденияЭДОПТУ.Подтверждено);
			
			//+Сёмин Р.И. 10.06.2026 #UT10-5918
			Если НЕ ЗначениеЗаполнено(ДокПоступления.file_id) Тогда
				
				Если СтруктураДокумента.Свойство("file_id") Тогда
					
					ДокПоступленияОбъект = ДокПоступления.ПолучитьОбъект();
					ДокПоступленияОбъект.file_id = СтруктураДокумента.file_id;
					ДокПоступленияОбъект.Записать();
					
				КонецЕсли;
				
			КонецЕсли;
			//-Сёмин Р.И. 10.06.2026 #UT10-5918
			
			Возврат Неопределено;
			
		КонецЕсли;
		//-Сёмин Р.И. 08.06.2026 #UT10-5900
		
		Ошибка = "Документ с номером вх.документа " + НомерЭДО + ", дата вх.документа " + Формат(ДатаДок, "ДФ=dd.MM.yyyy") 
		      + " по контрагенту " + Строка(Контрагент) + " уже загружен";
		ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка,,, 
		Ошибка); 
		
		ТекстОшибки = ТекстОшибки + Ошибка;
		Возврат Неопределено;
		
	КонецЕсли;
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5900
	Если ЭтоМежфилиальнаяПоставка Тогда
		
		Ошибка = "Документ с номером вх. документа " + НомерЭДО + ", дата вх.документа " + Формат(ДатаДок, "ДФ=dd.MM.yyyy") + ", контрагент " + Строка(Контрагент) + " является межфилиальной поставкой. Такой документ должен быть загружен через веб-сервис goodsreserv.";
		ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка, , , Ошибка);
		
		ТекстОшибки = "#Пропустить_Сообщение#" + ТекстОшибки + Ошибка;
		Возврат Неопределено;
		
	КонецЕсли;
	//-Сёмин Р.И. 08.06.2026 #UT10-5900
	
	СкладОрдер = Справочники.Склады.НайтиПоРеквизиту("КодМДМ", СкладКодМДМ);
	
	Если Не ЗначениеЗаполнено(СкладОрдер) Тогда
	
		ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не найден склад с кодом МДМ " + СкладКодМДМ); 
		
		ТекстОшибки = ТекстОшибки + "Не найден склад с кодом МДМ " + СкладКодМДМ + Символы.ПС;
	
	КонецЕсли;    
	
	//Заполнение ТЧ  
	МассивТовары = СтруктураДокумента.Detail;   
	ТипСумма = ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный);
	
	тзТовары = Новый ТаблицаЗначений;    
	тзТовары.Колонки.Добавить("КодСтрокиКМ", ОбщегоНазначения.ОписаниеТипаЧисло(6, 0, ДопустимыйЗнак.Неотрицательный));
	тзТовары.Колонки.Добавить("НоменклатураКодМДМ", ОбщегоНазначения.ОписаниеТипаСтрока(36));     
	тзТовары.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10, 3, ДопустимыйЗнак.Неотрицательный));
	тзТовары.Колонки.Добавить("Цена", ТипСумма);
	тзТовары.Колонки.Добавить("Сумма", ТипСумма);
	тзТовары.Колонки.Добавить("СуммаНДС", ТипСумма);     
	тзТовары.Колонки.Добавить("СуммаСНДС", ТипСумма);   
	//+Шульман А. 25.02.2026 #UT10-5713
	//тзТовары.Колонки.Добавить("СтавкаНДСЧисло", ТипСумма);  
	//-Шульман А. 25.02.2026 #UT10-5713
	тзТовары.Колонки.Добавить("СтранаНаименование", ОбщегоНазначения.ОписаниеТипаСтрока(30)); 
	//+Шульман А. 30.03.2026 #UT10-5789   
	тзТовары.Колонки.Добавить("КодСтраны", ОбщегоНазначения.ОписаниеТипаСтрока(3)); 
	//-Шульман А. 30.03.2026 #UT10-5789
	тзТовары.Колонки.Добавить("НомерГТД", ОбщегоНазначения.ОписаниеТипаСтрока(30));         
	
	тзКодыМаркировки = Новый ТаблицаЗначений;    
	тзКодыМаркировки.Колонки.Добавить("КодСтрокиКМ", ОбщегоНазначения.ОписаниеТипаЧисло(6, 0, ДопустимыйЗнак.Неотрицательный));
	
	//+Макрушин Е. 27.02.2026 #UT11-5806
	// обрезало 1 символ
	//тзКодыМаркировки.Колонки.Добавить("КодМаркировки", ОбщегоНазначения.ОписаниеТипаСтрока(30));
	тзКодыМаркировки.Колонки.Добавить("КодМаркировки", ОбщегоНазначения.ОписаниеТипаСтрока(31));
	//-Макрушин Е. 27.02.2026 #UT11-5806
	
	тзКодыМаркировки.Колонки.Добавить("ДатаПроизводства", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	тзКодыМаркировки.Колонки.Добавить("СрокГодности", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	//+Шульман А. 17.03.2026 #UT10-5748
	тзКодыМаркировки.Колонки.Добавить("Причина", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	тзКодыМаркировки.Колонки.Добавить("Невалиден", Новый ОписаниеТипов("Булево"));     
	//-Шульман А. 17.03.2026 #UT10-5748
	
	КодСтроки = 1;
	
	Для каждого ТекСтр Из МассивТовары Цикл
		
		ДобСтрока = тзТовары.Добавить();     
		ДобСтрока.КодСтрокиКМ = КодСтроки;
		ДобСтрока.НоменклатураКодМДМ = ТекСтр.Product_mdm_id; 
		ДобСтрока.Количество = ТекСтр.Qty; 
		ДобСтрока.НомерГТД = ТекСтр.gtd; 
		ДобСтрока.СтранаНаименование = ТекСтр.country; 
		
		//+Шульман А. 30.03.2026 #UT10-5789
		Если ТекСтр.Свойство("code_country") Тогда    // потом условие можно убрать
			ДобСтрока.КодСтраны = ТекСтр.code_country; 
		КонецЕсли;  
		//-Шульман А. 30.03.2026 #UT10-5789
		
		Если ВидЗагрузки = 0 Тогда   
			
			//+Гавриленков В. 29.07.2026 #UT10-5980
			//ДобСтрока.Цена = ТекСтр.Cost.PriceOfTax;
			//-Гавриленков В. 29.07.2026 #UT10-5980
			
			//+Шульман А. 25.02.2026 #UT10-5713
			//ДобСтрока.СтавкаНДСЧисло = ТекСтр.Cost.Tax;   
			//-Шульман А. 25.02.2026 #UT10-5713    
			//+Шульман А. 05.06.2026 #UT10-5909
			ДобСтрока.СуммаНДС = ТекСтр.Cost.Tax; 
			//-Шульман А. 05.06.2026 #UT10-5909
			ДобСтрока.Сумма = ТекСтр.Total.AmountOfTax;
			
		Иначе               
			
			//+Гавриленков В. 29.07.2026 #UT10-5980
			//ДобСтрока.Цена = ТекСтр.Cost.Price; 
			//-Гавриленков В. 29.07.2026 #UT10-5980
			
			//+Шульман А. 25.02.2026 #UT10-5713
			//ДобСтрока.СтавкаНДСЧисло = 20; 
			//-Шульман А. 25.02.2026 #UT10-5713
			ДобСтрока.СуммаНДС = ТекСтр.Cost.Tax; 
			ДобСтрока.Сумма = ТекСтр.Total.Amount;   
			
		КонецЕсли; 
		
		//+Гавриленков В. 29.07.2026 #UT10-5980
		ДобСтрока.Цена = ДобСтрока.Сумма / ?(ДобСтрока.Количество = 0, 1, ДобСтрока.Количество);
		//-Гавриленков В. 29.07.2026 #UT10-5980
		
		ДобСтрока.СуммаСНДС = ТекСтр.Total.Amount;   
		
		// Коды маркировки
		Для каждого тзСтрокаКМ Из ТекСтр.codes Цикл
		
			ДобСтрока = тзКодыМаркировки.Добавить();   
			ДобСтрока.КодСтрокиКМ = КодСтроки; 
			ДобСтрока.КодМаркировки = тзСтрокаКМ.km; 
			
			ДобСтрока.ДатаПроизводства = СтрокаВДату(тзСтрокаКМ.productionDate); 
			ДобСтрока.СрокГодности = СтрокаВДату(тзСтрокаКМ.expireDate);
			
			//+Шульман А. 17.03.2026 #UT10-5748     
			Если тзСтрокаКМ.Свойство("isValid") Тогда
				ДобСтрока.Невалиден = Не тзСтрокаКМ.isValid;    
			КонецЕсли;
			
			Если тзСтрокаКМ.Свойство("text") Тогда
				ДобСтрока.Причина = тзСтрокаКМ.text;  
			КонецЕсли;
			//-Шульман А. 17.03.2026 #UT10-5748
			
		КонецЦикла;  
		
		КодСтроки = КодСтроки + 1;
			
	КонецЦикла;  
	
	тзТоварыПТУ = ЗапросНайтиСсылкиПоступлениеТоваровУслугИзЭДО(тзТовары); 
	
	
	// Обработка ошибок  
	РФ = Справочники.КлассификаторСтранМира.Россия;
	
	Для каждого тзСтрока Из тзТоварыПТУ Цикл
		
		Если Не ЗначениеЗаполнено(тзСтрока.Номенклатура) Тогда
		
			ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не найдена номенклатура с кодом МДМ " + тзСтрока.НоменклатураКодМДМ); 
			
			ТекстОшибки = ТекстОшибки + "Не найдена номенклатура с кодом МДМ " + тзСтрока.НоменклатураКодМДМ + Символы.ПС;
		
		КонецЕсли;    
		
		Если Не ЗначениеЗаполнено(тзСтрока.Страна) Тогда
		
			ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не найдена страна " + тзСтрока.СтранаНаименование 
			//+Шульман А. 30.03.2026 #UT10-5789
			+ ?(ПустаяСтрока(тзСтрока.КодСтраны), "", ", код " + тзСтрока.КодСтраны)); 
			
			//ТекстОшибки = ТекстОшибки + "Не найдена страна " + тзСтрока.СтранаНаименование + Символы.ПС;
			тзСтрока.Страна = РФ;
			//-Шульман А. 30.03.2026 #UT10-5789
			
		КонецЕсли;   
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;  
	
	// Получаем заказы поставщику      
	тзТоварыКопия = тзТоварыПТУ.Скопировать();
	тзТоварыКопия.Свернуть("Номенклатура", "Количество");  
	
	Результат = ЗапросНайтиЗаказыПоставщикуДляПТУ(тзТоварыКопия, Контрагент); 
	КоличЗапросов = Результат.Количество() - 1;
	ТабЗаказов = Результат[КоличЗапросов - 1].Выгрузить();
	ТабЗаказовПоставщику = Результат[КоличЗапросов].Выгрузить(); 
	
	//+Шульман А. 04.03.2026 #UT10-5735  
	Если СтруктураДокумента.Свойство("contract") И СтруктураДокумента.Свойство("contract_date") Тогда    
		
		ДатаДоговора = ПреобразоватьДатуМДМ(СтруктураДокумента.contract_date);
		Договор = ПолучитьДоговор(Контрагент, СтруктураДокумента.contract, ДатаДоговора);  
		
		//+Шульман А. 30.03.2026 #UT10-5789
		// Договор в этом случае берется из заказа поставщику - будет ниже
		//Если Не ЗначениеЗаполнено(Договор) Тогда     
		//	Договор = Контрагент.ОсновнойДоговорКонтрагента;  
		//КонецЕсли;
		//-Шульман А. 30.03.2026 #UT10-5789
		
	Иначе       
		
		//+Шульман А. 27.04.2026 #UT10-5837
		//Договор = Контрагент.ОсновнойДоговорКонтрагента;  
		//-Шульман А. 27.04.2026 #UT10-5837    
		
	КонецЕсли;
	//-Шульман А. 04.03.2026 #UT10-5735   
	
	//+Шульман А. 27.04.2026 #UT10-5837
	Если Не ЗначениеЗаполнено(Договор) Тогда
	
		Если ЗначениеЗаполнено(ТабЗаказовПоставщику) Тогда
			Договор = ТабЗаказовПоставщику[0].ДоговорКонтрагента;
		КонецЕсли;     
		
		Если Не ЗначениеЗаполнено(Договор) Тогда   
			Договор = ПолучитьДоговорСПоставщиком(Контрагент);
		КонецЕсли;
	
	КонецЕсли;
	//-Шульман А. 27.04.2026 #UT10-5837
			
	//+Белов А. 18.05.2026 #UT10-5856
	ПоставщикТОХ = Справочники.ПоставщикиТОХ.НайтиПоРеквизиту("Контрагент", Контрагент);
	
	Если ЗначениеЗаполнено(ПоставщикТОХ) И Не ПринудительнаяЗагрузкаДляКонтрагентаТОХ Тогда

		НеСозданныйПТУ = Справочники.НеСозданныеПТУ.СоздатьЭлемент();
		НеСозданныйПТУ.Наименование = "Загрузка поступления по ЭДО: " + Строка(Контрагент);
		НеСозданныйПТУ.Дата = ТекущаяДата(); 
		НеСозданныйПТУ.КодМДМСклада = СкладКодМДМ;
		НеСозданныйПТУ.ЭДО = Истина;		
		НеСозданныйПТУ.Причина = "Не определена необходимость создания поступления, так как поставщик является поставщиком ТОХ и работает через ЭДО";
		НеСозданныйПТУ.НомерПоДаннымПоставщика = НомерДок;
		НеСозданныйПТУ.ДатаПоДаннымПоставщика = ДатаДок;			
		НеСозданныйПТУ.ВходящееСообщение = Сообщение; 
		НеСозданныйПТУ.СтороннийСклад = ПоставщикТОХ;
		НеСозданныйПТУ.ПТОХ = Истина;
		
		Для каждого тзСтрока Из тзТоварыПТУ Цикл
			
			НСтр = НеСозданныйПТУ.Товары.Добавить();
			НСтр.Номенклатура = тзСтрока.Номенклатура;
			НСтр.Количество = тзСтрока.Количество;
			НСтр.Цена = тзСтрока.Сумма / тзСтрока.Количество; 
			НСтр.Сумма = тзСтрока.Сумма; 
			НСтр.СуммаНДС = тзСтрока.СуммаНДС;
			НСтр.Производитель = НСтр.Номенклатура.Производитель;
			НСтр.КодПроизводителя = НСтр.Номенклатура.КодПроизводителя;
			нСтр.ФормализованныйКод = НСтр.Номенклатура.НормализованныйКод;
			нСтр.СерияНоменклатуры = тзСтрока.СерияНоменклатуры;
			
		КонецЦикла;   
		
		НеСозданныйПТУ.Записать();
		
		Возврат Неопределено;
		
	КонецЕсли;
	//-Белов А. 18.05.2026 #UT10-5856
	
	//+Белов А. 14.04.2026 #UT10-5816
	ЭтоМагистраль = ЭтоМагистраль(Контрагент);
	//-Белов А. 14.04.2026 #UT10-5816
	
	// Формирование ПТУ  
	ДокПоступления = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	
	ДокПоступления.Дата = ТекущаяДата();
	ДокПоступления.ВидПоступления  = Перечисления.ВидыПоступленияТоваров.НаСклад;   
	ДокПоступления.Организация = Константы.ОсновнаяОрганизация.Получить();
	ДокПоступления.СкладОрдер = СкладОрдер;
	ДокПоступления.ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить();
	ДокПоступления.Контрагент = Контрагент;   
	//+Шульман А. 04.03.2026 #UT10-5735
	//ДокПоступления.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;   
	ДокПоступления.ДоговорКонтрагента = Договор;    
	//-Шульман А. 04.03.2026 #UT10-5735
	ДокПоступления.НомерВходящегоДокумента = НомерДок;                
	ДокПоступления.ДатаВходящегоДокумента = ДатаДок;  
	//+Шульман А. 25.02.2026 #UT10-5713 
	ДокПоступления.НомерСкладскогоДокумента = НомерДок;                
	//-Шульман А. 25.02.2026 #UT10-5713
	ДокПоступления.УчитыватьНДС = Истина;
	
	//+Белов А. 02.06.2026 #UT10-5888          
	Если СтруктураДокумента.Свойство("file_id") Тогда
		ДокПоступления.file_id = СтруктураДокумента.file_id;	
	КонецЕсли;
	//-Белов А. 02.06.2026 #UT10-5888
	
	Если ВидЗагрузки = 0 Тогда
	
		ДокПоступления.НомерВходящегоДокументаЭлектронногоОбмена = НомерЭДО; 
		ДокПоступления.ДатаВходящегоДокументаЭлектронногоОбмена = ДатаДок;      
		//+Шульман А. 05.06.2026 #UT10-5909
		//ДокПоступления.НДСВключенВСтоимость = Истина;  
		ДокПоступления.СуммаВключаетНДС = Истина;   
		//-Шульман А. 05.06.2026 #UT10-5909
		
	Иначе
		ДокПоступления.СуммаВключаетНДС = Истина;   
	КонецЕсли; 
	
	ДокПоступления.КратностьВзаиморасчетов = 1;
	ДокПоступления.КурсВзаиморасчетов  = 1;			
	ДокПоступления.ОтражатьВНалоговомУчете = Истина;
	ДокПоступления.ОтражатьВБухгалтерскомУчете = Истина;	
	ДокПоступления.ОтражатьВУправленческомУчете = Истина;   
	ДокПоступления.Комментарий = "Создан регламентным заданием загрузки из Раббит " + ТекущаяДата();		
	ДокПоступления.Ответственный = глЗначениеПеременной("глТекущийПользователь");  
	
	Если ТабЗаказовПоставщику.Количество() Тогда  
		
		//+Шульман А. 30.03.2026 #UT10-5789
		Если ЗначениеЗаполнено(Договор) Тогда     
			ЗаполнитьЗначенияСвойств(ДокПоступления, ТабЗаказовПоставщику[0].ЗаказПоставщику, "Экспресс, ПополнениеЗапасов, ПремиальнаяПерекупка"); 
		//-Шульман А. 30.03.2026 #UT10-5789
		Иначе  
			ЗаполнитьЗначенияСвойств(ДокПоступления, ТабЗаказовПоставщику[0].ЗаказПоставщику, "ДоговорКонтрагента, Экспресс, ПополнениеЗапасов, ПремиальнаяПерекупка");
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого тзСтрока Из тзТоварыПТУ Цикл
	
		Номенклатура      = тзСтрока.Номенклатура;
		ТекКоличество     = тзСтрока.Количество;     
		
		СерияНоменклатуры = тзСтрока.СерияНоменклатуры;   
		//+Шульман А. 25.02.2026 #UT10-5713
		//СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПеречисление(тзСтрока.СтавкаНДСЧисло);  
		СтавкаНДС   = Номенклатура.СтавкаНДС;                         
		ТекСумма    = тзСтрока.Сумма;    
		ТекСуммаНДС = тзСтрока.СуммаНДС;    
		//-Шульман А. 25.02.2026 #UT10-5713
		
		Если Не ЗначениеЗаполнено(СерияНоменклатуры) Тогда
			СерияНоменклатуры = ПроверитьИСоздатьСерию(тзСтрока.Номенклатура, тзСтрока.НомерГТД, тзСтрока.Страна, тзСтрока.НомерГТДСсылка);
		КонецЕсли;
		
		НайденнаяНоменклатура = ТабЗаказовПоставщику.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
		
		Для каждого ТекЗаказПоставщику Из НайденнаяНоменклатура Цикл 
			
			Если ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика <= 0 Тогда 
				Продолжить;                                         
			КонецЕсли;
			
			Если ТекКоличество <= 0 Тогда      
				Прервать;                     
			КонецЕсли;
				
			НайденныеЗаказы = ТабЗаказов.НайтиСтроки(Новый Структура("Номенклатура, ЗаказПоставщику", Номенклатура, ТекЗаказПоставщику.ЗаказПоставщику));    
			
			Для каждого ТекЗаказ Из НайденныеЗаказы Цикл     
				
				Если ТекЗаказ.КоличествоЗаказаноПокупателем <= 0 Тогда    
					Продолжить;           
				КонецЕсли;
				
				Если ТекКоличество <= 0 Тогда      
					Прервать;                     
				КонецЕсли;
				
				ДобСтрока = ДокПоступления.Товары.Добавить();      
				ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока);
				ДобСтрока.СтавкаНДС = СтавкаНДС;  
				
				СтруктураСтроки = Новый Структура();   
				СтруктураСтроки.Вставить("Документ", 					ДокПоступления);
				СтруктураСтроки.Вставить("Номенклатура", 				Номенклатура);
				СтруктураСтроки.Вставить("ТекСтрока", 					ТекЗаказ);
				СтруктураСтроки.Вставить("ТекКоличество", 		    	Мин(ТекКоличество, ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика, ТекЗаказ.КоличествоЗаказаноПокупателем));
				СтруктураСтроки.Вставить("Цена", 				    	тзСтрока.Цена);
				СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 		Истина);
				СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	    Истина);
				СтруктураСтроки.Вставить("ЗаказПоставщику", 			ТекЗаказПоставщику.ЗаказПоставщику);  
				СтруктураСтроки.Вставить("ВидЗагрузки", ВидЗагрузки);
					
				ЗаполнитьСтрокуПТУ(ДобСтрока, СтруктураСтроки);

				ДобСтрока.Склад = СкладОрдер;        
				ДобСтрока.СерияНоменклатуры = СерияНоменклатуры;
					
				ТекЗаказ.КоличествоЗаказаноПокупателем = ТекЗаказ.КоличествоЗаказаноПокупателем - ДобСтрока.Количество;
				ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика = ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика - ДобСтрока.Количество;
				ТекКоличество = ТекКоличество - ДобСтрока.Количество; 
				
				//+Шульман А. 25.02.2026 #UT10-5713
				ТекСумма    = ТекСумма - ДобСтрока.Сумма;    
				ТекСуммаНДС = ТекСуммаНДС - ДобСтрока.СуммаНДС;    
				//-Шульман А. 25.02.2026 #UT10-5713
				
			КонецЦикла;
				
			// заказано в заказе поставщика не по заказу покупателя
			Если ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика > 0 И ТекКоличество > 0 Тогда
				
				СтруктураСтроки = Новый Структура();
				СтруктураСтроки.Вставить("Документ", 				ДокПоступления);
				СтруктураСтроки.Вставить("Номенклатура", 			Номенклатура);
				СтруктураСтроки.Вставить("ТекСтрока", 				ТекЗаказПоставщику);
				СтруктураСтроки.Вставить("ТекКоличество", 			Мин(ТекКоличество,	ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика));
				СтруктураСтроки.Вставить("Цена", 					тзСтрока.Цена);
				СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 	Истина);
				СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	Ложь);
				СтруктураСтроки.Вставить("ЗаказПоставщику", 		ТекЗаказПоставщику.ЗаказПоставщику);
				СтруктураСтроки.Вставить("ВидЗагрузки", ВидЗагрузки);
				
				ДобСтрока = ДокПоступления.Товары.Добавить();      
				ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока);
				ДобСтрока.СтавкаНДС = СтавкаНДС;     
				
				ЗаполнитьСтрокуПТУ(ДобСтрока, СтруктураСтроки);  
				
				//+Шульман А. 25.02.2026 #UT10-5713
				Если ТекКоличество = ДобСтрока.Количество Тогда
					
					ДобСтрока.Сумма = ТекСумма;
					ДобСтрока.СуммаНДС = ТекСуммаНДС;
				
				КонецЕсли;
				//-Шульман А. 25.02.2026 #UT10-5713

				ДобСтрока.Склад = СкладОрдер;        
				ДобСтрока.СерияНоменклатуры = СерияНоменклатуры;
				
				ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика = ТекЗаказПоставщику.КоличествоЗаказаноУПоставщика - ДобСтрока.Количество;
				ТекКоличество = ТекКоличество - ДобСтрока.Количество; 
				
				//+Шульман А. 25.02.2026 #UT10-5713
				ТекСумма    = ТекСумма - ДобСтрока.Сумма;    
				ТекСуммаНДС = ТекСуммаНДС - ДобСтрока.СуммаНДС;    
				//-Шульман А. 25.02.2026 #UT10-5713
				
			КонецЕсли;
				
		КонецЦикла;  
			
		// пришло товара больше чем заказывали
		Если ТекКоличество > 0 Тогда
			
			СтруктураСтроки = Новый Структура();
			СтруктураСтроки.Вставить("Документ", 					ДокПоступления);
			СтруктураСтроки.Вставить("Номенклатура", 				Номенклатура);
			СтруктураСтроки.Вставить("ТекСтрока", 					Неопределено);
			СтруктураСтроки.Вставить("ТекКоличество", 			    ТекКоличество);
			СтруктураСтроки.Вставить("БратьУказанноеКоличество", 	Истина);
			СтруктураСтроки.Вставить("Цена", 					    тзСтрока.Цена);
			СтруктураСтроки.Вставить("ЗаказПоставщикуУказан", 		Ложь);
			СтруктураСтроки.Вставить("ЗаказПокупателяУказан", 	    Ложь);
			СтруктураСтроки.Вставить("ЗаказПоставщику", 			Неопределено);
			СтруктураСтроки.Вставить("ВидЗагрузки", ВидЗагрузки);
			
			ДобСтрока = ДокПоступления.Товары.Добавить();      
			ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока);
			ДобСтрока.СтавкаНДС = СтавкаНДС;     
			
			ЗаполнитьСтрокуПТУ(ДобСтрока, СтруктураСтроки);
			
			//+Шульман А. 25.02.2026 #UT10-5713
			ДобСтрока.Сумма = ТекСумма;
			ДобСтрока.СуммаНДС = ТекСуммаНДС;     
			//-Шульман А. 25.02.2026 #UT10-5713
			
			ДобСтрока.Склад = СкладОрдер;        
			ДобСтрока.СерияНоменклатуры = СерияНоменклатуры;
			
			ТекКоличество = ТекКоличество - ДобСтрока.Количество; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Таб.часть КодыМаркировки
	НайтиКодыМаркировки(тзКодыМаркировки, тзТоварыПТУ);   
	
	Для каждого тзСтрока Из тзКодыМаркировки Цикл
		
		ДобСтрока = ДокПоступления.КодыМаркировки.Добавить();      
		ДобСтрока.КодСтрокиКМ = тзСтрока.КодСтрокиКМ;
		
		//+Шульман А. 17.03.2026 #UT10-5748
		// Перенесено в процедуру НайтиКодыМаркировки()
		//Если Не ЗначениеЗаполнено(тзСтрока.ШтрихкодСсылка) Тогда    
		//	
		//	ДанныеКМ = Новый Структура("КодМаркировки, Номенклатура, СрокГодности, ДатаПроизводства");
		//	ЗаполнитьЗначенияСвойств(ДанныеКМ, тзСтрока);
		//	ДанныеКМ.Вставить("ТипУпаковки", Перечисления.ТипУпаковкиМаркировки.МаркированныйТовар);
		//	ДанныеКМ.Вставить("ТипПоступления", 2);
		//	
		//	ДобСтрока.КодМаркировки = Справочники.ШтрихкодыНоменклатуры.СоздатьКодМаркировки(ДанныеКМ);     
		//	
		//Иначе	
		//    ДобСтрока.КодМаркировки = тзСтрока.ШтрихкодСсылка;
		//КонецЕсли;        
		ДобСтрока.КодМаркировки = тзСтрока.ШтрихкодСсылка;     
		ДобСтрока.Невалиден = тзСтрока.Невалиден;    
		ДобСтрока.Причина = тзСтрока.Причина;
		//-Шульман А. 17.03.2026 #UT10-5748
		
	КонецЦикла;
	
	//+Сёмин Р.И. 22.06.2026 #UT10-5914
	Если НЕ ЭтоМежфилиальнаяПоставка Тогда
		
		УчитыватьКонстантуОстаточныйСрокГодности = НадоУчитыватьКонстантуОстаточныйСрокГодности(ДокПоступления);
		ЗаполнитьОстаточныеСрокиГодностиМаркировки(ДокПоступления.КодыМаркировки, ДокПоступления.ДатаВходящегоДокумента, ДокПоступления.ДоговорКонтрагента, ДокПоступления.Дата, УчитыватьКонстантуОстаточныйСрокГодности);
		
	КонецЕсли;
	//-Сёмин Р.И. 22.06.2026 #UT10-5914
	
	//+Шульман А. 05.06.2026 #UT10-5909
	Если СтруктураДокумента.Свойство("file_id") Тогда   
		
		АдресИсходнаяТЗНоменклатуры = ПоместитьВоВременноеХранилище(тзТоварыПТУ);
		ДокПоступления.ДополнительныеСвойства.Вставить("АдресИсходнаяТЗНоменклатуры", АдресИсходнаяТЗНоменклатуры); 
		
	КонецЕсли;     
	//-Шульман А. 05.06.2026 #UT10-5909
	
	Попытка
		ДокПоступления.Записать(РежимЗаписиДокумента.Запись); 
	Исключение    
		
		//+Шульман А. 04.03.2026 #UT10-5735
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		Возврат Неопределено;
		//-Шульман А. 04.03.2026 #UT10-5735
		
	КонецПопытки; 
	
	//+Белов А. 14.04.2026 #UT10-5816
	Если ЭтоМагистраль Тогда
		
		Если ТабЗаказовПоставщику.Количество() Тогда  
			
			КопияТабЗаказовПоставщику = ТабЗаказовПоставщику.Скопировать();
			КопияТабЗаказовПоставщику.Свернуть("ЗаказПоставщику");
			МассивЗаказовПоставщику = КопияТабЗаказовПоставщику.ВыгрузитьКолонку("ЗаказПоставщику");
			
			Для каждого ДокЗаказ Из МассивЗаказовПоставщику Цикл
				
				Если Не ЗначениеЗаполнено(ДокЗаказ) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.ЗагруженоПоступление = Истина;
				
				Попытка
					ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);	
				Исключение
				    ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка, ДокЗаказ.Метаданные(), ДокЗаказ, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				
				
			КонецЦикла;		
			
		КонецЕсли;
				
	КонецЕсли;
	//-Белов А. 14.04.2026 #UT10-5816
			
	Попытка
		
		//+Шульман А. 30.03.2026 #UT10-5789
		Если Не ДокПоступления.ДоговорКонтрагента.Пустая() Тогда
		//-Шульман А. 30.03.2026 #UT10-5789
			ДокПоступления.Записать(РежимЗаписиДокумента.Проведение);  
		КонецЕсли;
			
	Исключение                   
		
		//+Шульман А. 04.03.2026 #UT10-5735
		//ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 
		ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка, ДокПоступления.Метаданные(), 
		ДокПоступления.Ссылка, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		//-Шульман А. 04.03.2026 #UT10-5735
		
	КонецПопытки;
	
	//+Шульман А. 26.03.2026 #UT10-5785
	Возврат ДокПоступления.Ссылка; 
	//-Шульман А. 26.03.2026 #UT10-5785
	
КонецФункции

Процедура ЗагрузитьКорректировкуПоступленияИзЭДО(ТекстСообщения, ТекстОшибки, Отказ)
	
	//+Макрушин Е. 26.02.2026 #UT10-5657
	//переложил аналогичный код УТ11
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	СтруктураДокумента = ПрочитатьJSON(ЧтениеJSON); 
	
	СкладКодМДМ = СтруктураДокумента.warehouse_mdm_id;
	КонтрагентКодМДМ = СтруктураДокумента.supplier_mdm_id;
	КонтрагентИНН = "";	
	КонтрагентКПП = "";
	НомерПоДаннымПоставщика = СокрЛП(СтруктураДокумента.number);
	ДатаПоДаннымПоставщика  = ПреобразоватьДатуМДМ(СтруктураДокумента.date);    
	НомерПоДаннымПоставщикаПТУ = СокрЛП(СтруктураДокумента.utd_number);
	ДатаПоДаннымПоставщикаПТУ  = ПреобразоватьДатуМДМ(СтруктураДокумента.utd_date);
	
	СуммаНДС          = СтруктураДокумента.total.totalAmountOfTax;
	СуммаВсегоСНДС    = СтруктураДокумента.total.totalAmount;
	ОрганизацияКодМДМ = СтруктураДокумента.organization_mdm_id;

	СуществующийКПТУ  = СуществуетДокументПоДаннымВходящегоДокумента(НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, "КорректировкаПоступления"); 
	
	Если ЗначениеЗаполнено(СуществующийКПТУ) Тогда
		
		СтрокаОшибка = "Уже существует Корректировка поступления с Номер вх. документа = " + НомерПоДаннымПоставщика + " и Дата вх. документа = " + ДатаПоДаннымПоставщика;   
		ЗаписьЖурналаРегистрации("UT10.documents.Mark", УровеньЖурналаРегистрации.Ошибка,,, СтрокаОшибка);
		ВызватьИсключение СтрокаОшибка;
		
	КонецЕсли;
	
	ДокументОснование  = СуществуетДокументПоДаннымВходящегоДокумента(НомерПоДаннымПоставщикаПТУ, ДатаПоДаннымПоставщикаПТУ, "ПоступлениеТоваровУслуг"); 
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		
		СтрокаОшибка = "Не найден ПТУ с Номер вх. документа = " + НомерПоДаннымПоставщикаПТУ + " и Дата вх. документа = " + ДатаПоДаннымПоставщикаПТУ;   
		ЗаписьЖурналаРегистрации("UT10.documents.Mark", УровеньЖурналаРегистрации.Ошибка,,, СтрокаОшибка);
		ВызватьИсключение СтрокаОшибка;
		
	КонецЕсли;
	
	СтрокаОшибка = "";

	Для Каждого СтрокаДетайл ИЗ СтруктураДокумента.Detail Цикл        
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаДетайл.Product_mdm_id);    
		
		Если Номенклатура.Пустая() Тогда
		
			СтрокаОшибка = СтрокаОшибка + "Не найдена номенклатура с кодом МДМ " + СтрокаДетайл.Product_mdm_id + Символы.ПС;     
			Продолжить;
		
		КонецЕсли;         
		
		СтрокаДетайл.Вставить("Номенклатура", Номенклатура);
		
		мКодыМаркировки = Новый Массив;
		
		Для Каждого СтрокаКодес ИЗ СтрокаДетайл.codes Цикл    
			
			ПолученныйКМ = СокрЛП(СтрокаКодес.km);
			
			Если НЕ ЗначениеЗаполнено(ПолученныйКМ) Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныйШК = Справочники.ШтрихкодыНоменклатуры.НайтиШтрихкод(ПолученныйКМ, Номенклатура);
			
			Если НЕ ЗначениеЗаполнено(НайденныйШК) Тогда
				
				СтрокаОшибка = СтрокаОшибка + "Не найден код маркировки " + ПолученныйКМ + " по номенклатуре " + Номенклатура + Символы.ПС;     
				Продолжить;
				
			КонецЕсли;
			
			СтрокаКодес.Вставить("КодМаркировки", НайденныйШК);
			
		КонецЦикла;
		
	КонецЦикла;   
	
	Если ЗначениеЗаполнено(СтрокаОшибка) Тогда
		ВызватьИсключение СтрокаОшибка;
	КонецЕсли;
	
	
	ДокОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();  
	ДокОбъект.Заполнить(ДокументОснование);
	ДокОбъект.Дата = ТекущаяДата();		
	ДокОбъект.НомерВходящегоДокумента = НомерПоДаннымПоставщика;
	ДокОбъект.ДатаВходящегоДокумента = ДатаПоДаннымПоставщика;
	ДокОбъект.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	ДокОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
	ДокОбъект.Комментарий = "Создан регламентным заданием загрузки из Раббит " + ДокОбъект.Дата;
	ДокОбъект.УстановитьНовыйНомер(ДокОбъект.Организация.Префикс);
	
	ИсходнаяТЧ = ДокОбъект.Товары.Выгрузить();
	ИсходнаяТЧ.Колонки.Добавить("ПересчитатьСуммуДоИзменения", Новый ОписаниеТипов("Булево"));
	ИсходнаяТЧ.Колонки.Добавить("ПересчитатьСумму", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаДетайл ИЗ СтруктураДокумента.Detail Цикл        
		
		ИзменениеКоличества = СтрокаВЧисло(СтрокаДетайл.Qty);
		
		// тч РасхожденияКМ
		Для Каждого СтрокаКодес ИЗ СтрокаДетайл.codes Цикл    
			
			СтрокаРасхожденияКМ = ДокОбъект.РасхожденияКМ.Добавить();
			СтрокаРасхожденияКМ.Номенклатура = СтрокаДетайл.Номенклатура;
			СтрокаРасхожденияКМ.КодМаркировки = СтрокаКодес.КодМаркировки;
			
			Если ИзменениеКоличества < 0 Тогда
				СтрокаРасхожденияКМ.Недостача = Истина;
			ИначеЕсли ИзменениеКоличества > 0 Тогда
				СтрокаРасхожденияКМ.Излишек = Истина;
			КонецЕсли;
			
		КонецЦикла; 		
		
		// тч Товары
		// суммы для финальной проверки после распределения
		ИзменениеСуммаСНДС = СтрокаВЧисло(СтрокаДетайл.Total.Amount);
		ИзменениеСуммаНДС  = ИзменениеСуммаСНДС - СтрокаВЧисло(СтрокаДетайл.Total.AmountOfTax);
				
		тзДляПроверкиСуммДо = ИсходнаяТЧ.Скопировать(Новый Структура("Номенклатура", СтрокаДетайл.Номенклатура));		
		
		// распределение количества изменения 
		Если ИзменениеКоличества < 0 Тогда
			
			ИзменениеКоличества = -ИзменениеКоличества;
			ЭтоНедостача = Истина;
			
		Иначе
			ЭтоНедостача = Ложь;
		КонецЕсли;		
		
		мСтрокиПоНоменклатуре = ИсходнаяТЧ.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДетайл.Номенклатура));
			
		Для Каждого СтрокаПоНоменклатуре Из мСтрокиПоНоменклатуре Цикл
			
			Если ИзменениеКоличества = 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если ЭтоНедостача Тогда
				
				Если ИзменениеКоличества >= СтрокаПоНоменклатуре.Количество Тогда
					
					// строка полностью списывается
					ИзменениеКоличества = ИзменениеКоличества - СтрокаПоНоменклатуре.Количество;
					
					СтрокаПоНоменклатуре.Количество = 0;
					СтрокаПоНоменклатуре.ПересчитатьСумму = Истина;
					
					СтрокаПоНоменклатуре.Заказ = Неопределено;
					СтрокаПоНоменклатуре.ОтражатьТоварныйУчет = Истина;
					
				Иначе
					
					КоличествоКЗачету = ИзменениеКоличества;
					
					// выделяем пересечение по количеству
					ДопСтрока = ИсходнаяТЧ.Добавить();
					ЗаполнитьЗначенияСвойств(ДопСтрока, СтрокаПоНоменклатуре);
					
					ДопСтрока.КоличествоДоИзменения = КоличествоКЗачету;
					ДопСтрока.Количество = КоличествоКЗачету;
					ИзменениеКоличества = ИзменениеКоличества - КоличествоКЗачету;
					
					ДопСтрока.ПересчитатьСуммуДоИзменения = Истина;
					ДопСтрока.ПересчитатьСумму = Истина;
					
					
					// остаток - отдельной строкой отклонение
					СтрокаПоНоменклатуре.КоличествоДоИзменения = СтрокаПоНоменклатуре.КоличествоДоИзменения - КоличествоКЗачету;
					СтрокаПоНоменклатуре.Количество = 0;
					
					СтрокаПоНоменклатуре.ПересчитатьСуммуДоИзменения = Истина;
					СтрокаПоНоменклатуре.ПересчитатьСумму = Истина;
					
					СтрокаПоНоменклатуре.Заказ = Неопределено;
					СтрокаПоНоменклатуре.ОтражатьТоварныйУчет = Истина;
				КонецЕсли;
			
				
			
			Иначе
				
				// излишек, заполняем по первой подходящей строке
				ДопСтрока = ИсходнаяТЧ.Добавить();
				ЗаполнитьЗначенияСвойств(ДопСтрока, СтрокаПоНоменклатуре);
				
				ДопСтрока.КоличествоДоИзменения = 0;
                ДопСтрока.Количество = ИзменениеКоличества;
				
				ДопСтрока.ПересчитатьСуммуДоИзменения = Истина;
				ДопСтрока.ПересчитатьСумму = Истина;
				
				ДопСтрока.Заказ = Неопределено;
				ДопСтрока.ОтражатьТоварныйУчет = Истина;
				
				ИзменениеКоличества = 0;
				
				Прервать;
				
			КонецЕсли;

		КонецЦикла;
		
		Если ИзменениеКоличества <> 0 Тогда
			
			СтрокаОшибка = "Осталось нераспределенное изменение количества " + ИзменениеКоличества + " по номенклатуре " + СтрокаДетайл.Номенклатура;
			ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;

		
		// пересчет сумм
		Для Каждого СтрокаПоНоменклатуре Из ИсходнаяТЧ Цикл
			
			Если СтрокаПоНоменклатуре.ПересчитатьСуммуДоИзменения Тогда
				
				СтрокаПоНоменклатуре.ПересчитатьСуммуДоИзменения = Ложь;
				
				СтрокаПоНоменклатуре.СуммаДоИзменения = СтрокаПоНоменклатуре.Цена * СтрокаПоНоменклатуре.КоличествоДоИзменения;
				СтрокаПоНоменклатуре.СуммаНДСДоИзменения = УчетНДС.РассчитатьСуммуНДС(СтрокаПоНоменклатуре.СуммаДоИзменения,
			                                                   ДокОбъект.УчитыватьНДС, ДокОбъект.СуммаВключаетНДС,
			                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаПоНоменклатуре.СтавкаНДС));
															   
			КонецЕсли;
			
			Если СтрокаПоНоменклатуре.ПересчитатьСумму Тогда
				
				СтрокаПоНоменклатуре.ПересчитатьСумму = Ложь;
				
				СтрокаПоНоменклатуре.Сумма = СтрокаПоНоменклатуре.Цена * СтрокаПоНоменклатуре.Количество;											   
				СтрокаПоНоменклатуре.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоНоменклатуре.Сумма,
			                                                   ДокОбъект.УчитыватьНДС, ДокОбъект.СуммаВключаетНДС,
			                                                   УчетНДС.ПолучитьСтавкуНДС(СтрокаПоНоменклатуре.СтавкаНДС)); 
															   
			КонецЕсли;
														   
		КонецЦикла;											   
		
		// проверка расхождения по суммам
		тзДляПроверкиСуммПосле = ИсходнаяТЧ.Скопировать(Новый Структура("Номенклатура", СтрокаДетайл.Номенклатура));
		
		Если ИзменениеСуммаСНДС <> тзДляПроверкиСуммПосле.Итог("Сумма") - тзДляПроверкиСуммДо.Итог("Сумма") Тогда
			
			//СтрокаОшибка = "После распределения и пересчета по номенклатуре " + СтрокаДетайл.Номенклатура + " не сошлась Сумма расхождения." 
			//	+ " Получено по ЭДО значение = " + ИзменениеСуммаСНДС + " после пересчета получилась Сумма расхождения = " + тзДляПроверкиСуммПосле.Итог("Сумма") - тзДляПроверкиСуммДо.Итог("Сумма");
			//	
			//ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;
		
		Если ИзменениеСуммаНДС <> тзДляПроверкиСуммПосле.Итог("СуммаНДС") - тзДляПроверкиСуммДо.Итог("СуммаНДС") Тогда
			
			//СтрокаОшибка = "После распределения и пересчета по номенклатуре " + СтрокаДетайл.Номенклатура + " не сошлась СуммаНДС расхождения." 
			//	+ " Получено по ЭДО значение = " + ИзменениеСуммаНДС + " после пересчета получилась Сумма расхождения = " + тзДляПроверкиСуммПосле.Итог("СуммаНДС") - тзДляПроверкиСуммДо.Итог("СуммаНДС");
			//	
			//ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли; 
		
		Если тзДляПроверкиСуммДо.Итог("СуммаДоИзменения") <> тзДляПроверкиСуммПосле.Итог("СуммаДоИзменения") Тогда
			
			//СтрокаОшибка = "После распределения и пересчета по номенклатуре " + СтрокаДетайл.Номенклатура + " не сошлась Сумма до изменения." 
			//	+ " Было: " + тзДляПроверкиСуммДо.Итог("СуммаДоИзменения") + " стало: " +  тзДляПроверкиСуммПосле.Итог("СуммаДоИзменения");
			//	
			//ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;
		
		Если тзДляПроверкиСуммДо.Итог("СуммаНДСДоИзменения") <> тзДляПроверкиСуммПосле.Итог("СуммаНДСДоИзменения") Тогда
			
			//СтрокаОшибка = "После распределения и пересчета по номенклатуре " + СтрокаДетайл.Номенклатура + " не сошлась СуммаНДС до изменения." 
			//	+ " Было: " + тзДляПроверкиСуммДо.Итог("СуммаНДСДоИзменения") + " стало: " +  тзДляПроверкиСуммПосле.Итог("СуммаНДСДоИзменения");
			//	
			//ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;

	КонецЦикла;   
	
    ДокОбъект.Товары.Очистить();
	ДокОбъект.Товары.Загрузить(ИсходнаяТЧ);
	
	Попытка
		
		НачатьТранзакцию();
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		// отметим категорию
		РезультатУстановкиДокументПолучен = Справочники.КатегорииОбъектов.УстановитьКатегориюОбъекта(ДокОбъект.Ссылка, "ДокументПолучен");
		
		Если НЕ РезультатУстановкиДокументПолучен.ВыполненоУспешно Тогда
			
			СтрокаОшибка = "Ошибка при установке категории " + РезультатУстановкиДокументПолучен.ОписаниеОшибки;     
			ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;
		
		// собственно проведение корректировки
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);      
		
		// сф по корректировке
		ДокОбъектСФ = Документы.СчетФактураПолученный.СоздатьДокумент();
		ДокОбъект.Дата = ДокОбъект.Дата;
		ДокОбъектСФ.ДополнительныеСвойства.Вставить("НеЗаполнятьСчетФактуруНаАванс");
		ДокОбъектСФ.Заполнить(ДокОбъект.Ссылка);
		ДокОбъектСФ.НомерВходящегоДокумента = ДокОбъект.НомерВходящегоДокумента;
		ДокОбъектСФ.ДатаВходящегоДокумента = ДокОбъект.ДатаВходящегоДокумента;
		ДокОбъектСФ.УстановитьНовыйНомер(ДокОбъектСФ.Организация.Префикс);
		
		ДокОбъектСФ.Записать(РежимЗаписиДокумента.Проведение); 
		
	Исключение       
		
		ОтменитьТранзакцию();
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	//-Макрушин Е. 26.02.2026 #UT10-5657 

КонецПроцедуры

Функция ЭтоМагистраль(Контрагент)
//+Белов А. 14.04.2026 #UT10-5816

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	НЕ СобственныеСклады.ПометкаУдаления
	|	И СобственныеСклады.Поставщик = &Поставщик
	|	И СобственныеСклады.ВэбСервисУТ11";
	
	Запрос.УстановитьПараметр("Поставщик", Контрагент);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;         
	
	Возврат Ложь;

//-Белов А. 14.04.2026 #UT10-5816 
КонецФункции

Функция ЗапросНайтиСсылкиПоступлениеТоваровУслугИзЭДО(тзТовары)
	
	Запрос = Новый Запрос;      
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	//+Гавриленков В. 08.04.2026 #UT10-5804
	//"ВЫБРАТЬ
	//|	тзТовары.НоменклатураКодМДМ,
	//|	тзТовары.Количество,
	//|	тзТовары.НомерГТД,
	//|	тзТовары.СтранаНаименование,   
	////+Шульман А. 30.03.2026 #UT10-5789   
	//|	тзТовары.КодСтраны,   
	////-Шульман А. 30.03.2026 #UT10-5789
	//|	тзТовары.Цена,
	//|	тзТовары.Сумма,
	//|	тзТовары.СуммаСНДС, 
	//|	тзТовары.СуммаНДС,  
	////+Шульман А. 25.02.2026 #UT10-5713
	////|	тзТовары.СтавкаНДСЧисло, 
	////-Шульман А. 25.02.2026 #UT10-5713
	//|	тзТовары.КодСтрокиКМ КАК КодСтрокиКМ
	//|ПОМЕСТИТЬ ВТ_Сообщение
	//|ИЗ
	//|	&тзТовары КАК тзТовары
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Сообщение.КодСтрокиКМ,
	//|	МАКСИМУМ(ЕСТЬNULL(СправНоменклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Номенклатура,
	//|	ВТ_Сообщение.НоменклатураКодМДМ,
	//|	ВТ_Сообщение.НомерГТД КАК НомерГТД,
	//|	МАКСИМУМ(ЕСТЬNULL(СправНомераГТД.Ссылка, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))) КАК НомерГТДСсылка,
	//|	ВТ_Сообщение.Цена,
	//|	ВТ_Сообщение.Количество,
	//|	ВТ_Сообщение.Сумма,
	//|	ВТ_Сообщение.СуммаСНДС,     
	//|	ВТ_Сообщение.СуммаНДС,
	////|	ВТ_Сообщение.СтавкаНДСЧисло,
	//|	ВТ_Сообщение.СтранаНаименование,  
	////+Шульман А. 30.03.2026 #UT10-5789  
	////|	МАКСИМУМ(ЕСТЬNULL(КлассификаторСтранМира.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))) КАК Страна    
	//|	ВТ_Сообщение.КодСтраны,   
	////-Шульман А. 30.03.2026 #UT10-5789
	//|	МАКСИМУМ(ЕСТЬNULL(КлассификаторСтранМира.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия))) КАК Страна
	//|ПОМЕСТИТЬ ВТ_ТоварыБезСерий
	//|ИЗ
	//|	ВТ_Сообщение КАК ВТ_Сообщение
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура
	//|		ПО ВТ_Сообщение.НоменклатураКодМДМ = СправНоменклатура.КодМДМ
	//|			И (НЕ СправНоменклатура.ПометкаУдаления)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК СправНомераГТД
	//|		ПО ВТ_Сообщение.НомерГТД = СправНомераГТД.Код
	//|			И (НЕ СправНомераГТД.ПометкаУдаления)
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМира
	//|		ПО (ВТ_Сообщение.СтранаНаименование = КлассификаторСтранМира.Наименование
	//|				ИЛИ ВТ_Сообщение.СтранаНаименование = КлассификаторСтранМира.Код   
	////+Шульман А. 30.03.2026 #UT10-5789
	//|				ИЛИ ВТ_Сообщение.КодСтраны = КлассификаторСтранМира.Код
	////-Шульман А. 30.03.2026 #UT10-5789
	//|				ИЛИ ВТ_Сообщение.СтранаНаименование = КлассификаторСтранМира.КодАльфа2)
	//|			И (НЕ КлассификаторСтранМира.ПометкаУдаления)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Сообщение.НоменклатураКодМДМ,
	//|	ВТ_Сообщение.Количество,
	//|	ВТ_Сообщение.НомерГТД,
	//|	ВТ_Сообщение.СтранаНаименование,     
	////+Шульман А. 30.03.2026 #UT10-5789   
	//|	ВТ_Сообщение.КодСтраны,   
	////-Шульман А. 30.03.2026 #UT10-5789
	//|	ВТ_Сообщение.Цена,
	//|	ВТ_Сообщение.Сумма,
	//|	ВТ_Сообщение.СуммаСНДС, 
	//|	ВТ_Сообщение.СуммаНДС,
	//|	ВТ_Сообщение.КодСтрокиКМ
	////|	ВТ_Сообщение.СтавкаНДСЧисло
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ТоварыБезСерий.КодСтрокиКМ КАК КодСтрокиКМ,
	//|	ВТ_ТоварыБезСерий.Номенклатура,
	//|	ВТ_ТоварыБезСерий.НоменклатураКодМДМ,
	//|	МАКСИМУМ(ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))) КАК СерияНоменклатуры,
	//|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	//|	ВТ_ТоварыБезСерий.НомерГТД КАК НомерГТД,
	//|	ВТ_ТоварыБезСерий.НомерГТДСсылка КАК НомерГТДСсылка,
	//|	ВТ_ТоварыБезСерий.Цена,
	//|	ВТ_ТоварыБезСерий.Количество,
	//|	ВТ_ТоварыБезСерий.Количество КАК КоличествоУпаковок,
	//|	ВТ_ТоварыБезСерий.Сумма,
	//|	ВТ_ТоварыБезСерий.СуммаСНДС,    
	//|	ВТ_ТоварыБезСерий.СуммаНДС,
	////|	ВТ_ТоварыБезСерий.СтавкаНДСЧисло,
	//|	ВТ_ТоварыБезСерий.СтранаНаименование,  
	////+Шульман А. 30.03.2026 #UT10-5789   
	//|	ВТ_ТоварыБезСерий.КодСтраны,   
	////-Шульман А. 30.03.2026 #UT10-5789
	//|	ВТ_ТоварыБезСерий.Страна,
	//|	1 КАК Коэффициент
	//|ИЗ
	//|	ВТ_ТоварыБезСерий КАК ВТ_ТоварыБезСерий
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	//|		ПО (НЕ ВТ_ТоварыБезСерий.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	//|			И ВТ_ТоварыБезСерий.Номенклатура = СерииНоменклатуры.Владелец
	//|			И (НЕ ВТ_ТоварыБезСерий.НомерГТДСсылка = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	//|			И ВТ_ТоварыБезСерий.НомерГТДСсылка = СерииНоменклатуры.НомерГТД
	//|			И (НЕ ВТ_ТоварыБезСерий.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))
	//|			И ВТ_ТоварыБезСерий.Страна = СерииНоменклатуры.СтранаПроисхождения
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_ТоварыБезСерий.Страна,
	//|	ВТ_ТоварыБезСерий.СуммаСНДС,          
	//|	ВТ_ТоварыБезСерий.СуммаНДС,
	//|	ВТ_ТоварыБезСерий.НоменклатураКодМДМ,
	//|	ВТ_ТоварыБезСерий.НомерГТД,
	//|	ВТ_ТоварыБезСерий.НомерГТДСсылка,
	//|	ВТ_ТоварыБезСерий.Цена,
	//|	ВТ_ТоварыБезСерий.Сумма,
	//|	ВТ_ТоварыБезСерий.Номенклатура,
	//|	ВТ_ТоварыБезСерий.СтранаНаименование,    
	////+Шульман А. 30.03.2026 #UT10-5789   
	//|	ВТ_ТоварыБезСерий.КодСтраны,   
	////-Шульман А. 30.03.2026 #UT10-5789
	//|	ВТ_ТоварыБезСерий.КодСтрокиКМ,
	//|	ВТ_ТоварыБезСерий.Количество,
	//|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков,
	//|	ВТ_ТоварыБезСерий.Количество";
	
	"ВЫБРАТЬ
	|	тзТовары.НоменклатураКодМДМ,
	|	тзТовары.Количество,
	|	тзТовары.НомерГТД,
	|	тзТовары.СтранаНаименование,
	|	тзТовары.КодСтраны,
	|	тзТовары.Цена,
	|	тзТовары.Сумма,
	|	тзТовары.СуммаСНДС,
	|	тзТовары.СуммаНДС,
	|	тзТовары.КодСтрокиКМ КАК КодСтрокиКМ
	|ПОМЕСТИТЬ ВТ_Сообщение
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сообщение.КодСтрокиКМ,
	|	СправНоменклатура.Ссылка КАК Номенклатура,
	|	ВТ_Сообщение.НоменклатураКодМДМ,
	|	ВТ_Сообщение.НомерГТД КАК НомерГТД,
	|	ВТ_Сообщение.Цена,
	|	ВТ_Сообщение.Количество,
	|	ВТ_Сообщение.Сумма,
	|	ВТ_Сообщение.СуммаСНДС,
	|	ВТ_Сообщение.СуммаНДС,
	|	ВТ_Сообщение.СтранаНаименование,
	|	ВТ_Сообщение.КодСтраны
	|ПОМЕСТИТЬ ВТ_ТоварыНоменклатура
	|ИЗ
	|	ВТ_Сообщение КАК ВТ_Сообщение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура
	|		ПО ВТ_Сообщение.НоменклатураКодМДМ = СправНоменклатура.КодМДМ
	|			И (НЕ СправНоменклатура.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыНоменклатура.КодСтрокиКМ,
	|	ВТ_ТоварыНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыНоменклатура.НоменклатураКодМДМ,
	|	ВТ_ТоварыНоменклатура.НомерГТД КАК НомерГТД,
	|	МАКСИМУМ(ЕСТЬNULL(СправНомераГТД.Ссылка, ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))) КАК НомерГТДСсылка,
	|	ВТ_ТоварыНоменклатура.Цена,
	|	ВТ_ТоварыНоменклатура.Количество,
	|	ВТ_ТоварыНоменклатура.Сумма,
	|	ВТ_ТоварыНоменклатура.СуммаСНДС,
	|	ВТ_ТоварыНоменклатура.СуммаНДС,
	|	ВТ_ТоварыНоменклатура.СтранаНаименование,
	|	ВТ_ТоварыНоменклатура.КодСтраны
	|ПОМЕСТИТЬ ВТ_ТоварыНоменклатураГТД
	|ИЗ
	|	ВТ_ТоварыНоменклатура КАК ВТ_ТоварыНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НомераГТД КАК СправНомераГТД
	|		ПО ВТ_ТоварыНоменклатура.НомерГТД = СправНомераГТД.Код
	|			И (НЕ СправНомераГТД.ПометкаУдаления)
	|			И (НЕ СправНомераГТД.Код = """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыНоменклатура.НоменклатураКодМДМ,
	|	ВТ_ТоварыНоменклатура.Номенклатура,
	|	ВТ_ТоварыНоменклатура.Количество,
	|	ВТ_ТоварыНоменклатура.НомерГТД,
	|	ВТ_ТоварыНоменклатура.СтранаНаименование,
	|	ВТ_ТоварыНоменклатура.КодСтраны,
	|	ВТ_ТоварыНоменклатура.Цена,
	|	ВТ_ТоварыНоменклатура.Сумма,
	|	ВТ_ТоварыНоменклатура.СуммаСНДС,
	|	ВТ_ТоварыНоменклатура.СуммаНДС,
	|	ВТ_ТоварыНоменклатура.КодСтрокиКМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыНоменклатураГТД.КодСтрокиКМ,
	|	ВТ_ТоварыНоменклатураГТД.Номенклатура КАК Номенклатура,
	|	ВТ_ТоварыНоменклатураГТД.НоменклатураКодМДМ,
	|	ВТ_ТоварыНоменклатураГТД.НомерГТД КАК НомерГТД,
	|	ВТ_ТоварыНоменклатураГТД.НомерГТДСсылка КАК НомерГТДСсылка,
	|	ВТ_ТоварыНоменклатураГТД.Цена,
	|	ВТ_ТоварыНоменклатураГТД.Количество,
	|	ВТ_ТоварыНоменклатураГТД.Сумма,
	|	ВТ_ТоварыНоменклатураГТД.СуммаСНДС,
	|	ВТ_ТоварыНоменклатураГТД.СуммаНДС,
	|	ВТ_ТоварыНоменклатураГТД.СтранаНаименование,
	|	ВТ_ТоварыНоменклатураГТД.КодСтраны,
	|	МАКСИМУМ(ЕСТЬNULL(КлассификаторСтранМираПоКоду.Ссылка, ЕСТЬNULL(КлассификаторСтранМираПоНаименованию.Ссылка, ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.Россия)))) КАК Страна
	|ПОМЕСТИТЬ ВТ_ТоварыБезСерий
	|ИЗ
	|	ВТ_ТоварыНоменклатураГТД КАК ВТ_ТоварыНоменклатураГТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираПоКоду
	|		ПО (ВЫБОР
	|				КОГДА ВТ_ТоварыНоменклатураГТД.КодСтраны = """"
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ВТ_ТоварыНоменклатураГТД.КодСтраны = КлассификаторСтранМираПоКоду.Код
	|			КОНЕЦ)
	|			И (НЕ КлассификаторСтранМираПоКоду.ПометкаУдаления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторСтранМира КАК КлассификаторСтранМираПоНаименованию
	|		ПО (ВТ_ТоварыНоменклатураГТД.СтранаНаименование = КлассификаторСтранМираПоНаименованию.Наименование
	|				ИЛИ ВТ_ТоварыНоменклатураГТД.СтранаНаименование = КлассификаторСтранМираПоНаименованию.Код
	|				ИЛИ ВТ_ТоварыНоменклатураГТД.СтранаНаименование = КлассификаторСтранМираПоНаименованию.КодАльфа2
	|				ИЛИ ВТ_ТоварыНоменклатураГТД.СтранаНаименование = КлассификаторСтранМираПоНаименованию.НаименованиеПолное)
	|			И (НЕ КлассификаторСтранМираПоНаименованию.ПометкаУдаления)
	|			И (НЕ ВТ_ТоварыНоменклатураГТД.СтранаНаименование = """")
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыНоменклатураГТД.НоменклатураКодМДМ,
	|	ВТ_ТоварыНоменклатураГТД.Номенклатура,
	|	ВТ_ТоварыНоменклатураГТД.Количество,
	|	ВТ_ТоварыНоменклатураГТД.НомерГТД,
	|	ВТ_ТоварыНоменклатураГТД.НомерГТДСсылка,
	|	ВТ_ТоварыНоменклатураГТД.СтранаНаименование,
	|	ВТ_ТоварыНоменклатураГТД.КодСтраны,
	|	ВТ_ТоварыНоменклатураГТД.Цена,
	|	ВТ_ТоварыНоменклатураГТД.Сумма,
	|	ВТ_ТоварыНоменклатураГТД.СуммаСНДС,
	|	ВТ_ТоварыНоменклатураГТД.СуммаНДС,
	|	ВТ_ТоварыНоменклатураГТД.КодСтрокиКМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыБезСерий.КодСтрокиКМ КАК КодСтрокиКМ,
	|	ВТ_ТоварыБезСерий.Номенклатура,
	|	ВТ_ТоварыБезСерий.НоменклатураКодМДМ,
	|	МАКСИМУМ(ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))) КАК СерияНоменклатуры,
	|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	ВТ_ТоварыБезСерий.НомерГТД КАК НомерГТД,
	|	ВТ_ТоварыБезСерий.НомерГТДСсылка КАК НомерГТДСсылка,
	|	ВТ_ТоварыБезСерий.Цена,
	|	ВТ_ТоварыБезСерий.Количество,
	|	ВТ_ТоварыБезСерий.Количество КАК КоличествоУпаковок,
	|	ВТ_ТоварыБезСерий.Сумма,
	|	ВТ_ТоварыБезСерий.СуммаСНДС,
	|	ВТ_ТоварыБезСерий.СуммаНДС,
	|	ВТ_ТоварыБезСерий.СтранаНаименование,
	|	ВТ_ТоварыБезСерий.КодСтраны,
	|	ВТ_ТоварыБезСерий.Страна,
	|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВТ_ТоварыБезСерий КАК ВТ_ТоварыБезСерий
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (НЕ ВТ_ТоварыБезСерий.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И ВТ_ТоварыБезСерий.Номенклатура = СерииНоменклатуры.Владелец
	|			И (НЕ ВТ_ТоварыБезСерий.НомерГТДСсылка = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|			И ВТ_ТоварыБезСерий.НомерГТДСсылка = СерииНоменклатуры.НомерГТД
	|			И (НЕ ВТ_ТоварыБезСерий.Страна = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))
	|			И ВТ_ТоварыБезСерий.Страна = СерииНоменклатуры.СтранаПроисхождения
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТоварыБезСерий.Страна,
	|	ВТ_ТоварыБезСерий.СуммаСНДС,
	|	ВТ_ТоварыБезСерий.СуммаНДС,
	|	ВТ_ТоварыБезСерий.НоменклатураКодМДМ,
	|	ВТ_ТоварыБезСерий.НомерГТД,
	|	ВТ_ТоварыБезСерий.НомерГТДСсылка,
	|	ВТ_ТоварыБезСерий.Цена,
	|	ВТ_ТоварыБезСерий.Сумма,
	|	ВТ_ТоварыБезСерий.Номенклатура,
	|	ВТ_ТоварыБезСерий.СтранаНаименование,
	|	ВТ_ТоварыБезСерий.КодСтраны,
	|	ВТ_ТоварыБезСерий.КодСтрокиКМ,
	|	ВТ_ТоварыБезСерий.Количество,
	|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков,
	|	ВТ_ТоварыБезСерий.Количество,
	|	ВТ_ТоварыБезСерий.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент
	|
	|УПОРЯДОЧИТЬ ПО
	|	КодСтрокиКМ";
	//-Гавриленков В. 08.04.2026 #UT10-5804
	
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Возврат РезультатЗапроса.Выгрузить();   

КонецФункции // ()

Функция ЗапросНайтиЗаказыПоставщикуДляПТУ(тзТоварыКопия, Контрагент)
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Количество КАК Количество
	|ПОМЕСТИТЬ ВТ_Заказов
	|ИЗ
	|	&ВТ_Товары КАК ВТ_Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	МАКСИМУМ(ВТ_Заказов.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ЗаказыПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Заказов.Номенклатура
	|					ИЗ
	|						ВТ_Заказов)
	|				И ДоговорКонтрагента.Владелец = &Контрагент) КАК ЗаказыПоставщикамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказов КАК ВТ_Заказов
	|		ПО ЗаказыПоставщикамОстатки.Номенклатура = ВТ_Заказов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПоставщику.ЗаказПоставщику,
	|	СУММА(1) КАК СовпалоСтрок,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ЗаказыПоставщику.КоличествоОстаток = ВТ_ЗаказыПоставщику.Количество
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СовпалоПолностью
	|ПОМЕСТИТЬ ВТ_КоличествоСовпадений
	|ИЗ
	|	ВТ_ЗаказыПоставщику КАК ВТ_ЗаказыПоставщику
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаказыПоставщику.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаказыПоставщику.Номенклатура КАК Номенклатура,
	|	ВТ_ЗаказыПоставщику.ЗаказПоставщику КАК ЗаказПоставщику,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	МАКСИМУМ(ВТ_ЗаказыПоставщику.КоличествоОстаток) КАК КоличествоЗаказаноУПоставщика,
	|	СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0)) КАК КоличествоЗаказаноПокупателем
	|ПОМЕСТИТЬ ТабДанных
	|ИЗ
	|	ВТ_ЗаказыПоставщику КАК ВТ_ЗаказыПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ВТ_Заказов.Номенклатура
	|						ИЗ
	|							ВТ_Заказов)
	|					И ЗаказПоставщику.Контрагент = &Контрагент) КАК РазмещениеЗаказовПокупателейОстатки
	|		ПО ВТ_ЗаказыПоставщику.ЗаказПоставщику = РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
	|			И ВТ_ЗаказыПоставщику.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаказыПоставщику.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	ВТ_ЗаказыПоставщику.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДанных.Номенклатура,
	|	ТабДанных.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ТабДанных.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТабДанных.КоличествоЗаказаноУПоставщика,
	|	ТабДанных.КоличествоЗаказаноПокупателем,
	|	ВТ_КоличествоСовпадений.СовпалоСтрок КАК СовпалоСтрок,
	|	ВТ_КоличествоСовпадений.СовпалоПолностью КАК СовпалоПолностью
	|ИЗ
	|	ТабДанных КАК ТабДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоСовпадений КАК ВТ_КоличествоСовпадений
	|		ПО ТабДанных.ЗаказПоставщику = ВТ_КоличествоСовпадений.ЗаказПоставщику
	|
	|УПОРЯДОЧИТЬ ПО
	|	СовпалоСтрок УБЫВ,
	|	СовпалоПолностью УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДанных.Номенклатура КАК Номенклатура,
	|	ТабДанных.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ТабДанных.ЗаказПоставщику.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	МАКСИМУМ(ТабДанных.КоличествоЗаказаноУПоставщика) КАК КоличествоЗаказаноУПоставщика,
	|	ВТ_КоличествоСовпадений.СовпалоСтрок КАК СовпалоСтрок,
	|	ВТ_КоличествоСовпадений.СовпалоПолностью КАК СовпалоПолностью
	|ИЗ
	|	ТабДанных КАК ТабДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоСовпадений КАК ВТ_КоличествоСовпадений
	|		ПО ТабДанных.ЗаказПоставщику = ВТ_КоличествоСовпадений.ЗаказПоставщику
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДанных.Номенклатура,
	|	ТабДанных.ЗаказПоставщику,
	|	ВТ_КоличествоСовпадений.СовпалоСтрок,
	|	ВТ_КоличествоСовпадений.СовпалоПолностью
	|
	|УПОРЯДОЧИТЬ ПО
	|	СовпалоСтрок УБЫВ,
	|	СовпалоПолностью УБЫВ";
	
	
	Запрос.УстановитьПараметр("ВТ_Товары", тзТоварыКопия); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	
	Возврат Запрос.ВыполнитьПакет();   
	
КонецФункции // ()

Процедура НайтиКодыМаркировки(тзКодыМаркировки, тзТовары)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзКодыМаркировки.КодСтрокиКМ,
	|	тзКодыМаркировки.КодМаркировки,
	|	тзКодыМаркировки.ДатаПроизводства,  
	//+Шульман А. 17.03.2026 #UT10-5748
	|	тзКодыМаркировки.Невалиден,  
	|	тзКодыМаркировки.Причина,    
	//-Шульман А. 17.03.2026 #UT10-5748
	|	тзКодыМаркировки.СрокГодности
	|ПОМЕСТИТЬ ВТ_Коды
	|ИЗ
	|	&тзКодыМаркировки КАК тзКодыМаркировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзТовары.КодСтрокиКМ,
	|	тзТовары.Номенклатура
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&тзТовары КАК тзТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Коды.КодСтрокиКМ,
	|	ВТ_Коды.КодМаркировки,
	|	ВТ_Коды.ДатаПроизводства,
	|	ВТ_Коды.СрокГодности,   
	//+Шульман А. 17.03.2026 #UT10-5748
	|	ВТ_Коды.Невалиден,       
	|	ВТ_Коды.Причина,
	//-Шульман А. 17.03.2026 #UT10-5748
	|	ВТ_Товары.Номенклатура
	|ПОМЕСТИТЬ ВТ_ТоварыКМ
	|ИЗ
	|	ВТ_Коды КАК ВТ_Коды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
	|		ПО ВТ_Коды.КодСтрокиКМ = ВТ_Товары.КодСтрокиКМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыКМ.КодСтрокиКМ,
	|	ВТ_ТоварыКМ.Номенклатура,
	|	ВТ_ТоварыКМ.КодМаркировки,
	|	ВТ_ТоварыКМ.ДатаПроизводства,
	|	ВТ_ТоварыКМ.СрокГодности,  
	//+Шульман А. 17.03.2026 #UT10-5748
	|	ВТ_ТоварыКМ.Невалиден,  
	|	ВТ_ТоварыКМ.Причина,
	//-Шульман А. 17.03.2026 #UT10-5748
	|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихкодыНоменклатуры.ПустаяСсылка)) КАК ШтрихкодСсылка
	|ИЗ
	|	ВТ_ТоварыКМ КАК ВТ_ТоварыКМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ВТ_ТоварыКМ.КодМаркировки = ШтрихкодыНоменклатуры.КодМаркировки
	|			И ВТ_ТоварыКМ.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И (НЕ ШтрихкодыНоменклатуры.ПометкаУдаления)";
	
	тзТоварыКопия = тзТовары.Скопировать();
	тзТоварыКопия.Свернуть("Номенклатура, КодСтрокиКМ");
	
	Запрос.УстановитьПараметр("тзКодыМаркировки", тзКодыМаркировки);
	Запрос.УстановитьПараметр("тзТовары", тзТоварыКопия);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	тзКодыМаркировки = РезультатЗапроса.Выгрузить();  
	
	//+Шульман А. 17.03.2026 #UT10-5748         
	Для каждого тзСтрока Из тзКодыМаркировки Цикл
	
		Если Не ЗначениеЗаполнено(тзСтрока.ШтрихкодСсылка) Тогда    
			
			ДанныеКМ = Новый Структура("КодМаркировки, Номенклатура, СрокГодности, ДатаПроизводства");
			ЗаполнитьЗначенияСвойств(ДанныеКМ, тзСтрока);
			ДанныеКМ.Вставить("ТипУпаковки", Перечисления.ТипУпаковкиМаркировки.МаркированныйТовар);
			ДанныеКМ.Вставить("ТипПоступления", 2);
			
			тзСтрока.ШтрихкодСсылка = Справочники.ШтрихкодыНоменклатуры.СоздатьКодМаркировки(ДанныеКМ);     
			
		КонецЕсли;	
	
	КонецЦикла;  
	//-Шульман А. 17.03.2026 #UT10-5748

КонецПроцедуры

Функция ЗаполнитьСтрокуПТУ(НоваяСтрокаДокумента, СтруктураСтроки)
	
	Если СтруктураСтроки.ЗаказПокупателяУказан И СтруктураСтроки.ТекСтрока <> Неопределено Тогда 
		НоваяСтрокаДокумента.Заказ = СтруктураСтроки.ТекСтрока.ЗаказПокупателя;
	КонецЕсли;
	
	ПересчитатьСумму = СтруктураСтроки.ВидЗагрузки = 0 Или Не НоваяСтрокаДокумента.Количество = СтруктураСтроки.ТекКоличество;      
	
	НоваяСтрокаДокумента.Количество = СтруктураСтроки.ТекКоличество;
	
	Если СтруктураСтроки.ЗаказПоставщикуУказан Тогда 
		НоваяСтрокаДокумента.ЗаказПоставщику = СтруктураСтроки.ЗаказПоставщику;
	КонецЕсли;
	
	Если ПересчитатьСумму Тогда
	
		НоваяСтрокаДокумента.Сумма = НоваяСтрокаДокумента.Цена * НоваяСтрокаДокумента.Количество;
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаДокумента, СтруктураСтроки.Документ);   
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьМассивПоСвойству(ФабрикаИмени, ИмяСвойства, ИмяРеквизитаСтрок)
	
	МассивСтрок = Новый Массив;
	
	Если ПроверитьЧтоСвойствоИмеетСтроки(ФабрикаИмени, ИмяСвойства, ИмяРеквизитаСтрок) Тогда
		
		Для Каждого Стр Из ФабрикаИмени[ИмяСвойства][ИмяРеквизитаСтрок] Цикл
			МассивСтрок.Добавить(Стр);	
		КонецЦикла;
		
	ИначеЕсли ПроверитьЧтоСвойствоЯвляетсяОбъектом(ФабрикаИмени, ИмяСвойства, ИмяРеквизитаСтрок) Тогда
		МассивСтрок.Добавить(ФабрикаИмени[ИмяСвойства][ИмяРеквизитаСтрок]);	
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции

Функция ПолучитьПараметрСообщения(Параметры, ИмяПараметра)
	
	СтрокаПараметр = Параметры.Выгрузить().Найти(ИмяПараметра);
	
	Если СтрокаПараметр = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат СтрокаПараметр.Значение;
	КонецЕсли;
	

КонецФункции // ()

Функция ПолучитьКонтрагентаПоКодуАварды(КодАвардаФилиала)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.IDФилиала В(&СписокID)
	|	И Контрагенты.КодМДМ = """"";
	
	//Эту тупость потом надо будет убрать когда запретим редактировать контрагентов 24.04.2018
	//При ручном вводе Айди пользователи понадобавляли пробелов
	СписокID = Новый СписокЗначений;
	СписокID.Добавить(КодАвардаФилиала);
	СписокID.Добавить(" " + КодАвардаФилиала);
	СписокID.Добавить(КодАвардаФилиала + " ");
	СписокID.Добавить(" " + КодАвардаФилиала + " ");
	
	Запрос.УстановитьПараметр("СписокID", СписокID);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 		
		Возврат Выборка.Ссылка.ПолучитьОбъект();
	Иначе	
		
		СпрОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		СпрОбъект.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор()));
		СпрОбъект.IDФилиала = СокрЛП(КодАвардаФилиала);
		СпрОбъект.УстановитьНовыйКод();		
		
	КонецЕсли;
	
	Возврат СпрОбъект;
	
КонецФункции

Процедура ЗаполнитьОбъектРегистраСведений(РСЗаписи, РСЗапись, ФабрикаИмени, ИмяОбъектаМетаданныхИсточник, ИмяОбъектаМетаданных, ИмяОчереди, СправочникЗагрузки)
	
	Если РСЗаписи = Неопределено или РСЗаписи.Количество() = 0 или РСЗапись = Неопределено Тогда                                               
		Возврат;
	КонецЕсли;
	
	ШтампВерсии = Число(ФабрикаИмени.ШтампВерсии);
	
	Если (РСЗапись.ШтампВерсии < ШтампВерсии) или (РСЗапись.ШтампВерсии = 0 и ШтампВерсии=0)
		ИЛИ (РСЗапись.ШтампВерсии = ШтампВерсии) Тогда
		
		РСЗапись.КодМДМ = ФабрикаИмени.GUID;    			
		РСЗапись.ШтампВерсии = ШтампВерсии;
		ОчиститьПустыеСвойства(ФабрикаИмени);
		
		ОбработатьРеквизитыФабрикиРС(РСЗапись, ИмяОбъектаМетаданных, ФабрикаИмени, ИмяОчереди);		
		
		РСЗаписи.ОбменДанными.Загрузка = Истина;

		Если Булево(ФабрикаИмени.ПометкаУдаления) = Истина Тогда
			РСЗаписи.Удалить(РСЗапись);
		Иначе
			РСЗаписи.Записать(Истина);	
		КонецЕсли; 
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Получена запись справочника " 
		//+Макрушин Е. 02.09.2026 #UT11-6043
		// для РС возникает ошибка из-за наименования
		//+ ИмяОбъектаМетаданных + " : " + ФабрикаИмени.GUID + ", " + ФабрикаИмени.Наименование);
		+ ИмяОбъектаМетаданных + " : " + ФабрикаИмени.GUID);
		//-Макрушин Е. 02.09.2026 #UT11-6043
		
	Иначе
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, "Существующая запись регистра сведений "
		//+Макрушин Е. 02.09.2026 #UT11-6043
		// для РС возникает ошибка из-за наименования
		//+ ИмяОбъектаМетаданных + " : " + ФабрикаИмени.GUID + ", " + ФабрикаИмени.Наименование + " имеет больший штамп версии, чем загружаемый. Сообщение отклонено.");
		+ ИмяОбъектаМетаданных + " : " + ФабрикаИмени.GUID + " имеет больший штамп версии, чем загружаемый. Сообщение отклонено.");
		//-Макрушин Е. 02.09.2026 #UT11-6043
	КонецЕсли; 
	
КонецПроцедуры                         

Процедура ОбработатьРеквизитыФабрикиРС(РСЗапись, ИмяОбъектаМетаданных, ФабрикаРС, ИмяОчереди)
	
	Если ИмяОбъектаМетаданных = "СинонимыПроизводителей" Тогда
		РСЗапись.СинонимПроизводителя = ФабрикаРС.Наименование;
	ИначеЕсли ИмяОбъектаМетаданных = "Штрихкоды" Тогда
		
		РСЗапись.Штрихкод = ФабрикаРС.Штрихкод;
		РСЗапись.Качество = Справочники.Качество.Новый;
		ЗаполнитьСвойствоПоПоискуКодаМДМ("ЕдиницыИзмерения", РСЗапись, "ЕдиницаИзмерения", ФабрикаРС.Упаковка, ФабрикаРС, ИмяОбъектаМетаданных);
		
		Попытка
			
			Значен = Число(ФабрикаРС.Штрихкод);
			
			Если Значен >= 1000000000000 И  Значен <= 9999999999999 тогда
				РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			Иначе
				РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128;
			КонецЕсли;
			
		Исключение
			РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128;
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьРегистрСведенийПоФабрике(РСЗапись, ФабрикаИмени, ИмяОбъектаМетаданных, КодПрикладнойСистемы, Создавать = Истина)
	
	РСЗаписи = Неопределено;
	РСЗапись = Неопределено;
	
	Если ИмяОбъектаМетаданных = "СинонимыПроизводителей"  Тогда
		
		СинонимПроизводителя_КодМДМ = ФабрикаИмени.GUID;
		Производитель_КодМДМ = ФабрикаИмени.Производитель.GUID;
		
		Если ЗначениеЗаполнено(Производитель_КодМДМ) Тогда
			
			Производитель = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Производитель_КодМДМ); 
			
			Если НЕ ЗначениеЗаполнено(Производитель) Тогда
				Производитель = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Производитель_КодМДМ));			
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Производитель) Тогда
				
				РСЗаписи = РегистрыСведений.СинонимыПроизводителей.СоздатьНаборЗаписей();
				РСЗаписи.ОбменДанными.Загрузка = Истина;
				РСЗаписи.Отбор.Производитель.Установить(Производитель);
				РСЗаписи.Отбор.КодМДМ.Установить(СинонимПроизводителя_КодМДМ);
				РСЗаписи.Прочитать();
				
				Если Создавать и РСЗаписи.Количество() = 0 Тогда                 
					
					РСЗапись = РСЗаписи.Добавить();
					РСЗапись.Производитель = Производитель;
					РСЗапись.КодМДМ = СинонимПроизводителя_КодМДМ;
					РСЗапись.СинонимПроизводителя = ФабрикаИмени.Наименование;
					РСЗапись.Активность = Истина;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	ИначеЕсли ИмяОбъектаМетаданных = "Штрихкоды" Тогда
		
		РСЗапись = Неопределено;
		ШК_КодМДМ = ФабрикаИмени.GUID;
		Номенклатура_КодМДМ = ФабрикаИмени.Владелец.GUID;
		
		Если ЗначениеЗаполнено(Номенклатура_КодМДМ) Тогда
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Номенклатура_КодМДМ); 
			
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				
				НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(Номенклатура_КодМДМ));
				Номенклатура = НоменклатураСсылка.ПолучитьОбъект();
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда
				
				//Ищем по коду МДМ
				РСЗаписи = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
				РСЗаписи.ОбменДанными.Загрузка = Истина;
				РСЗаписи.Отбор.Владелец.Установить(Номенклатура);
				РСЗаписи.Отбор.КодМДМ.Установить(ШК_КодМДМ);
				РСЗаписи.Прочитать();
				
				Если РСЗаписи.Количество() > 0 Тогда
					РСЗапись = РСЗаписи[0];
				Иначе
					
					//Попробуем найти по ШК:
					РСЗаписи = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
					РСЗаписи.ОбменДанными.Загрузка = Истина;
					РСЗаписи.Отбор.Владелец.Установить(Номенклатура);
					РСЗаписи.Прочитать();
					
					Для н = 0 По РСЗаписи.Количество()-1 Цикл
						
						Если РСЗаписи[н].Штрихкод = ФабрикаИмени.Штрихкод и (Не ЗначениеЗаполнено(РСЗаписи[н].КодМДМ) или РСЗаписи[н].КодМДМ = ШК_КодМДМ) Тогда
							
							РСЗапись = РСЗаписи[н];
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;	
					
					Если РСЗапись = Неопределено и Создавать Тогда
						РСЗапись = РСЗаписи.Добавить();
					КонецЕсли;
					
					Если РСЗапись <> Неопределено Тогда
						
						РСЗапись.Владелец = Номенклатура;
						РСЗапись.КодМДМ = ШК_КодМДМ;
						РСЗапись.Штрихкод = ФабрикаИмени.Штрихкод;
						РСЗапись.Качество = Справочники.Качество.Новый;
						
						Попытка
							
							Значен = Число(ФабрикаИмени.Штрихкод);
							
							Если Значен >= 1000000000000 И  Значен <= 9999999999999 тогда
								РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
							Иначе
								РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128;
							КонецЕсли;
							
						Исключение
							РСЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128;
						КонецПопытки;
						
						ЗаполнитьСвойствоПоПоискуКодаМДМ("ЕдиницыИзмерения", РСЗапись, "ЕдиницаИзмерения", ФабрикаИмени.Упаковка, ФабрикаИмени, ИмяОбъектаМетаданных);
						РСЗапись.Активность = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ТекстОшибки = "Не найден владелец ШК "+СокрЛП(ФабрикаИмени.Владелец.GUID);
				ЗаписатьОшибкуВРС(ФабрикаИмени, ИмяОбъектаМетаданных, ФабрикаИмени.GUID, "Номенклатура", ФабрикаИмени.Владелец.GUID, ТекстОшибки);
				
			КонецЕсли; 
			
		КонецЕсли;

	//+Макрушин Е. 02.09.2026 #UT11-6043	
	ИначеЕсли ИмяОбъектаМетаданных = "ОбластиДействияСертификатовНоменклатуры"  Тогда
		
		ОбластьДействияСертификатовНоменклатуры_КодМДМ = ФабрикаИмени.GUID;
		
		Номенклатура_КодМДМ = ФабрикаИмени.Номенклатура.GUID;
		СертификатНоменклатуры_КодМДМ = ФабрикаИмени.СертификатНоменклатуры.GUID;
		
		Если ЗначениеЗаполнено(Номенклатура_КодМДМ) И ЗначениеЗаполнено(СертификатНоменклатуры_КодМДМ) Тогда
			
			Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Номенклатура_КодМДМ);
			СертификатНоменклатуры = Справочники.СертификатыНоменклатуры.НайтиПоРеквизиту("КодМДМ", СертификатНоменклатуры_КодМДМ);
			
			Если ЗначениеЗаполнено(Номенклатура) И ЗначениеЗаполнено(СертификатНоменклатуры) Тогда
				
				РСЗаписи = РегистрыСведений.ОбластиДействияСертификатовНоменклатуры.СоздатьНаборЗаписей();
				РСЗаписи.ОбменДанными.Загрузка = Истина;
				РСЗаписи.Отбор.КодМДМ.Установить(ОбластьДействияСертификатовНоменклатуры_КодМДМ);
				РСЗаписи.Прочитать();
				
				Если Создавать и РСЗаписи.Количество() = 0 Тогда                 
					
					РСЗапись = РСЗаписи.Добавить();
					РСЗапись.КодМДМ = ОбластьДействияСертификатовНоменклатуры_КодМДМ;
					РСЗапись.Номенклатура = Номенклатура;
					РСЗапись.СертификатНоменклатуры = СертификатНоменклатуры;
					РСЗапись.Активность = Истина;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
	//-Макрушин Е. 02.09.2026 #UT11-6043	
		
	КонецЕсли; 
	
	Если РСЗапись = Неопределено Тогда
		РСЗаписи = Неопределено;
	КонецЕсли;
	
	Возврат РСЗаписи;
	
КонецФункции

Функция ПолучитьСтавкуНДСПеречислением(СтавкаНДС) Экспорт
	
	ЗначениеНДС = Неопределено;
	
	Если ТипЗнч(СтавкаНДС) = Тип("Строка") Тогда
		ПредставлениеСтавкиНДС = СтавкаНДС;
	ИначеЕсли ТипЗнч(СтавкаНДС) = Тип("Число") Тогда 
		ПредставлениеСтавкиНДС = Строка(СтавкаНДС);
	Иначе// неправильный тип
		ПредставлениеСтавкиНДС = Неопределено;
	КонецЕсли;
	
	Если ПредставлениеСтавкиНДС = Неопределено ИЛИ ВРЕГ(ПредставлениеСтавкиНДС) = "БЕЗ НДС" Тогда
		ЗначениеНДС = Перечисления.СтавкиНДС.БезНДС;
		
	ИначеЕсли ПредставлениеСтавкиНДС = "0" ИЛИ ПредставлениеСтавкиНДС = "0%" Тогда
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС0;
		
	ИначеЕсли Найти("10#0.1#0,1#0.10#0,10#10%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС10;
		
	ИначеЕсли Найти("20#0.2#0,2#0.20#0,20#20%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС20; 
		
	ИначеЕсли Найти("22#0.22#0,22#0.22#0,22#22%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС22;
		
	ИначеЕсли Найти("18#0.18#0,18#0.18#0,18#18%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС18;
		
	ИначеЕсли Найти("10/110#10% / 110%#10%/110%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС10_110;
		
	ИначеЕсли Найти("18/118#18% / 118%#18%/118%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС18_118; 
		
	ИначеЕсли Найти("22/122#22% / 122%#22%/122%", ПредставлениеСтавкиНДС) > 0 Тогда
		
		ЗначениеНДС = Перечисления.СтавкиНДС.НДС22_122;
		
	КонецЕсли;
	
	Возврат ЗначениеНДС;
	
КонецФункции

Функция ПроверитьИСоздатьСерию(Номенклатура, НомерГТД, Страна, НомерГТДСсылка)
	
	//+Гавриленков В. 10.03.2026 #UT10-5742 // исправлены типы сравнения для НомерГТД и СтранаПроисхождения
	//+Марков И. 19.02.2026 #UT10-5709
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераГТД.Ссылка КАК НомерГТДСсылка,
	|	СерииНоменклатуры.Ссылка КАК СерияСсылка
	|ИЗ
	|	Справочник.НомераГТД КАК НомераГТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (НЕ СерииНоменклатуры.Владелец = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|			И (СерииНоменклатуры.Владелец = &Номенклатура)
	|			И (НЕ СерииНоменклатуры.НомерГТД = ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка))
	|			И (СерииНоменклатуры.НомерГТД = НомераГТД.Ссылка)
	|			И (НЕ СерииНоменклатуры.СтранаПроисхождения = ЗНАЧЕНИЕ(Справочник.КлассификаторСтранМира.ПустаяСсылка))
	|			И (СерииНоменклатуры.СтранаПроисхождения = &Страна)
	|			И (НЕ СерииНоменклатуры.ПометкаУдаления)
	|ГДЕ
	|	НЕ НомераГТД.ПометкаУдаления
	|	И НомераГТД.Код = &НомерГТД";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Страна", Страна);
	Запрос.УстановитьПараметр("НомерГТД", НомерГТД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если ЗначениеЗаполнено(Выборка.НомерГТДСсылка) Тогда
			НомерГТДСсылка = Выборка.НомерГТДСсылка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СерияСсылка) Тогда
			Возврат Выборка.СерияСсылка;
		КонецЕсли;
		
	КонецЕсли;
		
	СерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	СерияНоменклатуры.Владелец = Номенклатура;
	СерияНоменклатуры.Наименование = НомерГТД;
	СерияНоменклатуры.СтранаПроисхождения = Страна;
		
	Если ЗначениеЗаполнено(НомерГТДСсылка) Тогда
		СерияНоменклатуры.НомерГТД = НомерГТДСсылка;
	Иначе
		
		НомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент();
		НомерГТДОбъект.Код = НомерГТД;
		НомерГТДОбъект.Комментарий = "Создан регламентным заданием загрузки из Раббит " + ТекущаяДата();
		НомерГТДОбъект.Записать();
		СерияНоменклатуры.НомерГТД = НомерГТДОбъект.Ссылка;

	КонецЕсли;
	
	СерияНоменклатуры.Комментарий = "Создан регламентным заданием загрузки из Раббит " + ТекущаяДата();
		
	СерияНоменклатуры.Записать();
	
	Возврат СерияНоменклатуры.Ссылка;
	//-Марков И. 19.02.2026 #UT10-5709
	
КонецФункции

Процедура СформироватьСкидкиПоУсловиям(ФабрикаСправочника, ДоговорОб)
	
	СписокКодовМДМПрайсЛистов = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Склады.КодМДМПрайсЛиста
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.КодМДМПрайсЛиста <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(СокрЛП(Выборка.КодМДМПрайсЛиста)) Тогда
			СписокКодовМДМПрайсЛистов.Добавить(СокрЛП(Выборка.КодМДМПрайсЛиста));
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокКодовМДМПрайсЛистов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовыйДоговор = ДоговорОб.ЭтоНовый();
	Множественные = ДоговорОб.МножественныеУсловия;
	
	ОбработанныеДокументы = Новый Массив;
	
	МассивСтрокПрайсов = СформироватьМассивПоСвойству(ФабрикаСправочника, "ПрайсЛистыДляСкидокНаБренды", "Строка");
	
	МассивСтрокУсловий = СформироватьМассивПоСвойству(ФабрикаСправочника, "Условия", "Строка");
	
	Если НЕ Множественные Тогда
		
		МассивСтрокУсловий.Очистить();		
		МассивСтрокУсловий.Добавить(Новый Структура("КлючСтроки, Неактивное", "0", "false"));
		
	КонецЕсли;
	
	МассивСтрокСкидок = СформироватьМассивПоСвойству(ФабрикаСправочника, "СкидкиНаБренды", "Строка");
	
	Для каждого СтрУсловий ИЗ МассивСтрокУсловий Цикл
		
		Для каждого СтрСкидок ИЗ МассивСтрокСкидок Цикл
			
			Если Множественные Тогда
				
				Если СтрСкидок.КлючСтроки <> СтрУсловий.КлючСтроки Тогда
					Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрСкидок.Скидка) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьПрайсНужные = Ложь;
			
			Для каждого СтрПрайсов Из МассивСтрокПрайсов Цикл
				
				Если Не СтрПрайсов.УникальныйИдентификатор = СтрСкидок.УникальныйИдентификатор Тогда
					Продолжить;
				КонецЕсли;
				
				Если СписокКодовМДМПрайсЛистов.НайтиПоЗначению(СтрПрайсов.ПрайсЛист.GUID) <> Неопределено Тогда
					
					ЕстьПрайсНужные = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЕстьПрайсНужные Тогда
				
				Если Не НовыйДоговор Тогда
					
					Документ = ПолучитьУстановкуСкидокПоКлючам(СтрУсловий.КлючСтроки, СтрСкидок.УникальныйИдентификатор, ДоговорОб.Ссылка);
					
					Если ЗначениеЗаполнено(Документ) Тогда
						
						ДокументОб = Документ.ПолучитьОбъект();
						
						Если ДокументОб.ПометкаУдаления Тогда
							ДокументОб.УстановитьПометкуУдаления(Ложь);
						КонецЕсли;
						
					Иначе
						
						ДокументОб = Документы.УстановкаСкидокНоменклатуры.СоздатьДокумент();
						ДокументОб.Дата = ТекущаяДата();
						
					КонецЕсли;
					
				Иначе
					
					ДокументОб = Документы.УстановкаСкидокНоменклатуры.СоздатьДокумент();
					ДокументОб.Дата = ТекущаяДата();
					
				КонецЕсли;
				
				ДокументОб.КлючСтрокиСкидок = СтрСкидок.УникальныйИдентификатор;
				ДокументОб.КлючСтрокиУсловий = СтрУсловий.КлючСтроки;
				ДокументОб.ДатаНачала = ПреобразоватьДатуМДМ(СтрСкидок.ДатаНачала);
				ДокументОб.ДатаОкончания = ПреобразоватьДатуМДМ(СтрСкидок.ДатаОкончания);
				ДокументОб.Комментарий = "Загружен из МДМ: " + ТекущаяДата();
				ДокументОб.ПроцентСкидкиНаценки = СтрСкидок.Скидка;
				ДокументОб.ВидОперации = Перечисления.ВидыОперацийУстановкаСкидокНоменклатуры.ПоГруппамНоменклатуры;
				ДокументОб.ВидСкидки = Перечисления.ВидыСкидок.Оптовая;		
				ДокументОб.Условие = Перечисления.УсловияСкидкиНаценки.БезУсловий;
				ДокументОб.Валюта = Константы.ВалютаУправленческогоУчета.Получить();
				
				ДокументОб.ПолучателиСкидки.Очистить();
				Получатель = ДокументОб.ПолучателиСкидки.Добавить();
				
				Если НовыйДоговор Тогда
					Получатель.Получатель = ДоговорОб.ПолучитьСсылкуНового();
				Иначе
					Получатель.Получатель = ДоговорОб.Ссылка;
				КонецЕсли;
				
				Получатель.Контрагент = ДоговорОб.Владелец;
				
				ДокументОб.Товары.Очистить();
				Товар = ДокументОб.Товары.Добавить();
				Товар.ПроцентСкидкиНаценки = ДокументОб.ПроцентСкидкиНаценки;
				Товар.Качество = Справочники.Качество.Новый;
				ЗаполнитьСвойствоПоПоискуКодаМДМ("Номенклатура", Товар, "Номенклатура", СтрСкидок.Бренд);
				
				Если Не ЗначениеЗаполнено(Товар.Номенклатура) Тогда                                                                        				
					
					ТекстОшибки = "Не найдена группа номенклатуры по коду МДМ при установке скидок номенклатуры для множественных условий";				
					ЗаписатьОшибкуВРС(ФабрикаСправочника, "ДоговорыКонтрагентов", ФабрикаСправочника.GUID,,, ТекстОшибки, Ложь);
					
					Если НЕ ДокументОб.Проведен Тогда
						ДокументОб.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
					КонецЕсли;
					
				Иначе
					ДокументОб.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
				
				Если Булево(ФабрикаСправочника.ПометкаУдаления) ИЛИ Булево(СтрУсловий.Неактивное) Тогда
					ДокументОб.УстановитьПометкуУдаления(Истина);
				КонецЕсли;
				
				ОбработанныеДокументы.Добавить(ДокументОб.Ссылка);
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Если Не НовыйДоговор Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка
		|ИЗ
		|	Документ.УстановкаСкидокНоменклатуры.ПолучателиСкидки КАК УстановкаСкидокНоменклатурыПолучателиСкидки
		|ГДЕ
		|	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка.КлючСтрокиСкидок <> """"
		|	И (ВЫРАЗИТЬ(УстановкаСкидокНоменклатурыПолучателиСкидки.Получатель КАК Справочник.ДоговорыКонтрагентов)) = &Договор
		|	И НЕ УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка.Ссылка В (&ОбработанныеДокументы)
		|	И НЕ УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ОбработанныеДокументы", ОбработанныеДокументы);
		Запрос.УстановитьПараметр("Договор", ДоговорОб.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументОб = Выборка.Ссылка.ПолучитьОбъект();
			ДокументОб.УстановитьПометкуУдаления(Истина);
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьУстановкуСкидокПоКлючам(КлючУсловий, КлючСкидок, Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка
	|ИЗ
	|	Документ.УстановкаСкидокНоменклатуры.ПолучателиСкидки КАК УстановкаСкидокНоменклатурыПолучателиСкидки
	|ГДЕ
	|	УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка.КлючСтрокиУсловий = &КлючУсловий
	|	И УстановкаСкидокНоменклатурыПолучателиСкидки.Ссылка.КлючСтрокиСкидок = &КлючСкидок
	|	И (ВЫРАЗИТЬ(УстановкаСкидокНоменклатурыПолучателиСкидки.Получатель КАК Справочник.ДоговорыКонтрагентов)) = &Договор";
	
	Запрос.УстановитьПараметр("КлючУсловий", Число(КлючУсловий));
	Запрос.УстановитьПараметр("КлючСкидок", КлючСкидок);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

Процедура ЗаполнитьСвойствоПоПоискуКодаМДМ(ИмяСправочника, СпрОбъект, ИмяРеквизита, Значение, ФабрикаСправочника = Неопределено, ИмяОбъектаМетаданных = "")
	
	Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() > 0 И Значение.Свойства().Получить("GUID") <> Неопределено Тогда		
		
		СпрОбъект[ИмяРеквизита] = Справочники[ИмяСправочника].НайтиПоРеквизиту("КодМДМ", Значение.GUID); 
		
		Если Не ЗначениеЗаполнено(СпрОбъект[ИмяРеквизита]) и ФабрикаСправочника <> Неопределено и ЗначениеЗаполнено(Значение.GUID) Тогда
			ЗаписатьОшибкуВРС(ФабрикаСправочника, ?(Не ЗначениеЗаполнено(ИмяОбъектаМетаданных), СпрОбъект.Метаданные().Имя, ИмяОбъектаМетаданных),
			ФабрикаСправочника.GUID, ИмяСправочника, Значение.GUID);
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры

Процедура ЗагрузитьКонтактнуюИнформацию(МассивКонтактнойИнформации, СпрОбъект, ИмяОчереди)
	
	глСоответствиеКвартир = Новый Соответствие;
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Квартира, "кв.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Офис, "оф.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Бокс, "б.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Помещение, "пом.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Комната, "комн.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Этаж, "эт.");
	
	СсылкаНаОбъект = Неопределено;
	
	Если СпрОбъект.ЭтоНовый() Тогда
		СсылкаНаОбъект = СпрОбъект.ПолучитьСсылкуНового();
	Иначе
		СсылкаНаОбъект = СпрОбъект.Ссылка;
	КонецЕсли;
	
	Набор = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(СсылкаНаОбъект);
	Набор.Прочитать();
	Набор.Очистить();
	Набор.Записать();
	
	АдресЭППрайса = "";
	АдресЭПОбмена = "";

	Для каждого КонтактнаяИнформация Из МассивКонтактнойИнформации Цикл
		
		Вид = ПолучитьОбъектПоФабрике(КонтактнаяИнформация.Вид, "ВидыКонтактнойИнформации", ИмяОчереди, Ложь, Истина);
		
		Если Не ЗначениеЗаполнено(Вид) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Вид.Тип) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляПолучения = "";
		ЭтоАдрес = Ложь;
		
		Если Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда
			ЭтоАдрес = Истина;
			ИмяПоляПолучения = "Представление"
		ИначеЕсли Вид.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			ИмяПоляПолучения = "Представление";
		ИначеЕсли Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ИмяПоляПолучения = "Представление";
		ИначеЕсли Вид.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница Тогда
			ИмяПоляПолучения = "Представление";
		Иначе
			ИмяПоляПолучения = "Представление";
		КонецЕсли;
		
		ЗначениеИнформации = СокрЛП(КонтактнаяИнформация[ИмяПоляПолучения]);

		Попытка
			
			Если Не ЗначениеЗаполнено(ЗначениеИнформации) Тогда
				Продолжить;
			КонецЕсли;
			
		Исключение
			Продолжить;
		КонецПопытки;
		
		МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Вид = Вид;
		МенеджерЗаписи.Объект = СсылкаНаОбъект;
		МенеджерЗаписи.Тип = Вид.Тип;
		
		Если Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса Тогда
			
			АдресЭППрайса = АдресЭППрайса + ?(АдресЭППрайса = "", "", "; ") + ЗначениеИнформации;
			МенеджерЗаписи.Представление = АдресЭППрайса;
			
		ИначеЕсли Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами Тогда
			
			АдресЭПОбмена = АдресЭПОбмена + ?(АдресЭПОбмена = "", "", "; ") + ЗначениеИнформации;
			МенеджерЗаписи.Представление = АдресЭПОбмена;
			
		Иначе
			МенеджерЗаписи.Представление = ЗначениеИнформации;	
		КонецЕсли;		
		
		Если ЭтоАдрес Тогда
			
			ЗначенияПолей = КонтактнаяИнформация.ЗначенияПолей;
			
			ЗначенияПолей = СтрЗаменить(ЗначенияПолей, "&lt;", "<");
			ЗначенияПолей = СтрЗаменить(ЗначенияПолей, "&gt;", ">");
			
			XDTOАдрес = КонтактнаяИнформацияМДМ.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес);
			ЗданияИПомещения = КонтактнаяИнформацияМДМ.ЗданияИПомещенияАдреса(XDTOАдрес);
			
			МенеджерЗаписи.Поле1 = Формат(КонтактнаяИнформацияМДМ.ПочтовыйИндексАдреса(XDTOАдрес), "ЧГ=");
			МенеджерЗаписи.Поле2 = XDTOАдрес.Состав.Состав.СубъектРФ;
			
			Если XDTOАдрес.Состав.Состав.СвРайМО <> Неопределено Тогда
				МенеджерЗаписи.Поле3 = XDTOАдрес.Состав.Состав.СвРайМО.Район;
			Иначе
				МенеджерЗаписи.Поле3 = XDTOАдрес.Состав.Состав.ВнутригРайон;
			КонецЕсли;
			
			МенеджерЗаписи.Поле4 = XDTOАдрес.Состав.Состав.Город;
			МенеджерЗаписи.Поле5 = XDTOАдрес.Состав.Состав.НаселПункт;
			МенеджерЗаписи.Поле6 = XDTOАдрес.Состав.Состав.Улица;
			
			Если ЗданияИПомещения.Здания.Количество() > 0 Тогда
				
				Для каждого Здание ИЗ ЗданияИПомещения.Здания Цикл
					
					ТипЗдания = Здание.Тип;
					
					Если ТипЗдания = "Дом" ИЛИ ТипЗдания = "Владение" ИЛИ ТипЗдания = "Домовладение" Тогда 
						
						МенеджерЗаписи.Поле7 = Здание.Значение;
						МенеджерЗаписи.ТипДома = Перечисления.ТипыДомов[ТипЗдания];
						
					ИначеЕсли ТипЗдания = "Корпус" ИЛИ ТипЗдания = "Строение" ИЛИ ТипЗдания = "Литера" ИЛИ ТипЗдания = "Сооружение" ИЛИ ТипЗдания = "Участок" Тогда
						
						МенеджерЗаписи.Поле8 = Здание.Значение;
						МенеджерЗаписи.ТипКорпуса = Перечисления.ТипыКорпусов[ТипЗдания];	
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
			Если ЗданияИПомещения.Помещения.Количество() > 0 Тогда

				ЗначениеПомещения = "";
				ПромТипПомещения = "";
				ТаблицаСокращения = Новый ТаблицаЗначений;
				ТаблицаСокращения.Колонки.Добавить("Приоритет");
				ТаблицаСокращения.Колонки.Добавить("ТипПомещенияИсходный");
				ТаблицаСокращения.Колонки.Добавить("ТипПомещенияСформированный");
				ТаблицаСокращения.Колонки.Добавить("НачальныйНомерВСтроке");
				ТаблицаСокращения.Колонки.Добавить("КонечныйНомерВСтроке");
				ТаблицаСокращения.Колонки.Добавить("ТипПомещенияСокращенный");
				
				Для каждого Помещение ИЗ ЗданияИПомещения.Помещения Цикл
					
					ПромТипПомещения = ?(ПромТипПомещения = "" ,Помещение.Тип,ПромТипПомещения);
					ТипПомещения = Помещение.Тип;
					СформированныйТип = глСоответствиеКвартир.Получить(Перечисления.ТипыКвартир[ТипПомещения]);
					
					Если ТипПомещения = "Квартира" Или ТипПомещения = "Офис" Или ТипПомещения = "Бокс" Или ТипПомещения = "Этаж" Тогда			
						
						ЗначениеПомещения = ЗначениеПомещения +?(ЗначениеЗаполнено(ЗначениеПомещения), "," +СформированныйТип, "") + " " +Помещение.Значение;
						
					ИначеЕсли ТипПомещения = "Помещение"  Тогда
						
						ЗначениеПомещения = ЗначениеПомещения +?(ЗначениеЗаполнено(ЗначениеПомещения), "," + СформированныйТип, "") + " " +Помещение.Значение;
						
						СтрСокращения = ТаблицаСокращения.Добавить();
						СтрСокращения.Приоритет = 2;
						СтрСокращения.ТипПомещенияИсходный = ТипПомещения;
						СтрСокращения.ТипПомещенияСформированный = СформированныйТип;
						
						НачальныйНомерВСтроке = Найти(ЗначениеПомещения, СформированныйТип);
						СтрСокращения.НачальныйНомерВСтроке = НачальныйНомерВСтроке;
						СтрСокращения.КонечныйНомерВСтроке = СтрДлина(ЗначениеПомещения) - СтрДлина(Помещение.Значение) - 1;
						СтрСокращения.ТипПомещенияСокращенный = "п.";
						
					ИначеЕсли ТипПомещения = "Комната"  Тогда
						
						ЗначениеПомещения = ЗначениеПомещения +?(ЗначениеЗаполнено(ЗначениеПомещения), "," + СформированныйТип, "") + " " +Помещение.Значение;
						
						СтрСокращения = ТаблицаСокращения.Добавить();
						СтрСокращения.Приоритет = 1;
						СтрСокращения.ТипПомещенияИсходный = ТипПомещения;
						СтрСокращения.ТипПомещенияСформированный = СформированныйТип;
						НачальныйНомерВСтроке = Найти(ЗначениеПомещения, СформированныйТип);
						СтрСокращения.НачальныйНомерВСтроке = НачальныйНомерВСтроке;
						СтрСокращения.КонечныйНомерВСтроке = СтрДлина(ЗначениеПомещения) - СтрДлина(Помещение.Значение) - 1;
						СтрСокращения.ТипПомещенияСокращенный = "к.";
						
					КонецЕсли;	
					
				КонецЦикла;
				
				ТаблицаСокращения.Сортировать("Приоритет");
				
				Для Каждого СтрокаСокращения Из ТаблицаСокращения Цикл
					
					Если СтрДлина(ЗначениеПомещения) <= 20 Тогда
						Прервать;
					КонецЕсли;
					
					НачПозиция = СтрокаСокращения.НачальныйНомерВСтроке;
					КонПозиция = СтрокаСокращения.КонечныйНомерВСтроке;
					
					СтрокаДо = Лев(ЗначениеПомещения, НачПозиция - 1);
					СтрокаПосле = Сред(ЗначениеПомещения, КонПозиция + 1);
					
					ЗначениеПомещения = СтрокаДо + СтрокаСокращения.ТипПомещенияСокращенный + СтрокаПосле;
					
				КонецЦикла;
				
				МенеджерЗаписи.Поле9 = СокрЛП(ЗначениеПомещения);
				МенеджерЗаписи.ТипКвартиры = Перечисления.ТипыКвартир[ПромТипПомещения];

			КонецЕсли;                   			
			
		КонецЕсли;
		
		МенеджерЗаписи.Записать(Истина);  
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИмяОбъектаМетаданныхПоСообщению(Сообщение) Экспорт
	
	ИмяОбъектаМетаданных = "";
	
	Если МСК.ЭтоОчередьПрайсПМ(Сообщение.Подписка.ИмяОчереди) Тогда
	
		СтрПоиска = Сообщение.Параметры.Найти("price_type", "Имя");	
		
		Если СтрПоиска <> Неопределено И СтрПоиска.Значение = "ТОХ" Тогда
			Возврат "УстановкаЦенНоменклатурыКонтрагентов";		
		Иначе
			Возврат "";
		КонецЕсли;      
		
	КонецЕсли;
	
	ТекстСообщения = Сообщение.Данные;
	СтрВидДокумента = Найти(ТекстСообщения, "ВидДокумента");
	
	Если СтрВидДокумента = 0 Тогда
	
		тзСтрока = Сообщение.Параметры.Найти("document_type", "Имя");
		
		Если Не тзСтрока = Неопределено Тогда   
			
			ВидДокумента = тзСтрока.Значение;
			
			Если ВидДокумента = "ПоступлениеТоваровИУслуг" Тогда
				Возврат "ПоступлениеТоваровУслуг";  
			ИначеЕсли ВидДокумента = "СостояниеЗаказаНаЭмиссию" Тогда
				Возврат "ЗаказНаЭмиссиюКодовМаркировкиСУЗ";
			ИначеЕсли ВидДокумента = "СостояниеОтчетаОНанесении" Тогда
				Возврат "ОтчетОНанесенииКИЗ";
			ИначеЕсли ВидДокумента = "СостояниеВводВОборот" Тогда
				Возврат "ВводВОборотКИЗ";
			//+Белов А. 24.03.2026 #UT10-5761
			ИначеЕсли ВидДокумента = "СостояниеВыводаИзОборота" Тогда
				Возврат "ВыводИзОборотаКИЗ";
			//-Белов А. 24.03.2026 #UT10-5761  
			//+Белов А. 02.06.2026 #UT10-5894
			ИначеЕсли ВидДокумента = "СостояниеОбработкиГИСМТ" Тогда
				Возврат "ОбработкаГИСМТ";
			//-Белов А. 02.06.2026 #UT10-5894    
			//+Шульман А. 02.07.2026 #UT10-5944    
			ИначеЕсли ВидДокумента = "Перемещение" Тогда
				Возврат "ЗаказПоставщику";
			//-Шульман А. 02.07.2026 #UT10-5944
			Иначе	
				Возврат ВидДокумента;	
			КонецЕсли;
			
		КонецЕсли;   
		
		Возврат "";
	
	КонецЕсли;     
	
	Если СтрВидДокумента > 0 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
		СообщениеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		Если ТипЗнч(СообщениеJSON) = Тип("Массив") тогда
			
			СтруктураДокумента = СообщениеJSON[0];		
			ИмяОбъектаМетаданных = СтруктураДокумента.ВидДокумента;       
			
		ИначеЕсли ТипЗнч(СообщениеJSON) = Тип("Структура") тогда
			ИмяОбъектаМетаданных = СообщениеJSON.ВидДокумента;       
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяОбъектаМетаданных;
	
КонецФункции

Функция ПолучитьКодИсточникаПоСообщению(Сообщение) Экспорт
	
	КодИсточника = "";
	
	СтруктураСообщения = ОбщегоНазначения.ВернутьСтруктуруИзJSON(Сообщение.Данные);	
	
	Если СтруктураСообщения.Свойство("УникальныйИдентификатор") Тогда
		КодИсточника = СтруктураСообщения.УникальныйИдентификатор;	
	ИначеЕсли СтруктураСообщения.Свойство("Id_edi") Тогда
		КодИсточника = СтруктураСообщения.Id_edi;	
	ИначеЕсли СтруктураСообщения.Свойство("number") Тогда
		КодИсточника = СтруктураСообщения.number;
	КонецЕсли; 
	
	Возврат КодИсточника;
	
КонецФункции


/////////////////Вспомогательные процедуры загрузки сообщений//////////////////

Процедура ОчиститьПустыеСвойства(ФабрикаСправочника)
	
	Для каждого Свойство Из ФабрикаСправочника.Свойства() Цикл
		
		Имя = Свойство.Имя;
		
		Если ТипЗнч(ФабрикаСправочника[Имя]) = Тип("ОбъектXDTO") И ФабрикаСправочника[Имя].Свойства().Количество() = 0 Тогда
			ФабрикаСправочника[Имя] = "";
		КонецЕсли;		
		
	КонецЦикла;	 
	
КонецПроцедуры

Функция ПреобразоватьДатуМДМ(СтроковаяДата)
	
	Попытка
		
		СтроковаяДата = СтрЗаменить(СтроковаяДата, "-", ""); 
		СтроковаяДата = СтрЗаменить(СтроковаяДата, ":", "");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, "T", "");
		СтроковаяДата = СтрЗаменить(СтроковаяДата, " ", ""); 
		СтроковаяДата = Лев(СтроковаяДата, 14); 
		
		Возврат Дата(СтроковаяДата);
	
	Исключение    
		Возврат СтрокаВДату(СтроковаяДата);    
	КонецПопытки;
		
КонецФункции       

Функция СтрокаВДату(Знач ДатаСтрока) Экспорт
	
	ДатаСтрока = Лев(СОКРЛП(ДатаСтрока), 10);
	
	СначалаГод = Найти("0123456789", Сред(ДатаСтрока, 3, 1)) > 0;
	
	ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", "")); 
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "-", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "/", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "\", "");
	
	Если СначалаГод Тогда 
		ДатаСтрока = Лев(ДатаСтрока, 4) + Сред(ДатаСтрока, 5, 2) + Прав(ДатаСтрока, 2);  
	Иначе
		
		ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);  
	
		Если СтрДлина(ДатаСтрока) = 6 Тогда
			ДатаСтрока = "20" + ДатаСтрока;
		КонецЕсли;    
		
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(ДатаСтрока);
	
	Возврат Результат;
	
КонецФункции    

// Преобразует исходную строку в число.
//   Превращает строку в число без вызова исключений. Стандартная функция преобразования.
//   Число() строго контролирует отсутствие каких-либо символов кроме числовых.
//
// Параметры:
//   ИсходнаяСтрока - Строка - Строка, которую необходимо привести к числу.
//
// Возвращаемое значение:
//   Число - Полученное число.
//   Неопределено - Если строка не является числом.
//
Функция СтрокаВЧисло(Знач ИсходнаяСтрока) Экспорт
	
	//+Макрушин Е. 12.02.2026 #UT10-5665
	//перенесена типовая функция
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	Результат = 0;
	ЗнаковПослеЗапятой = -1;
	ЗнакОтрицательный = Ложь;
	Длина = СтрДлина(ИсходнаяСтрока);
	
	Для НомерСимвола = 1 По Длина Цикл
		
		КодСимвола = КодСимвола(ИсходнаяСтрока, НомерСимвола);
		
		Если КодСимвола = 32 Или КодСимвола = 160 Тогда // Пробел или неразрывный пробел.
			// Пропуск (действие не требуется).
		ИначеЕсли КодСимвола = 45 Или КодСимвола = 40 Тогда // Минус или открывающая скобка.
			
			Если Результат <> 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
			
			ЗнакОтрицательный = Истина;
			
		ИначеЕсли КодСимвола = 41 Тогда // Закрывающая скобка.
			
			Если Не ЗнакОтрицательный Или Результат = 0 Тогда // Не было открывающей скобки или нет числа.
				Возврат Неопределено;
			КонецЕсли;
			// Пропуск (действие не требуется).
			
		ИначеЕсли КодСимвола = 44 Или КодСимвола = 46 Тогда // Запятая или точка.
			
			Если ЗнаковПослеЗапятой <> -1 Тогда
				Возврат Неопределено; // Разделитель уже был, следовательно это не число.
			КонецЕсли;
			
			ЗнаковПослеЗапятой = 0; // Запуск отсчета знаков после запятой.
			
		ИначеЕсли КодСимвола > 47 И КодСимвола < 58 Тогда // Число.
			
			Если ЗнаковПослеЗапятой <> -1 Тогда
				ЗнаковПослеЗапятой = ЗнаковПослеЗапятой + 1;
			КонецЕсли;
			
			Число = КодСимвола - 48;
			Результат = Результат * 10 + Число;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗнаковПослеЗапятой > 0 Тогда
		Результат = Результат / Pow(10, ЗнаковПослеЗапятой);
	КонецЕсли;
	
	Если ЗнакОтрицательный Тогда
		Результат = -Результат;
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 12.02.2026 #UT10-5665
	
КонецФункции


Процедура ЗаписатьОшибкуВРС(ФабрикаСправочника, ИмяОбъектаМетаданных, КодМДМ, ИмяСопутствСправочника = "", КодМДМСопутствСправочника = "", 
	                        ТекстОшибки = "Не найден элемент по коду МДМ", НужноОбработать = Истина)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ФабрикаСправочника);
	ФабрикаСправочникаСтрокой = ЗаписьXML.Закрыть();    
	
	НаборЗаписей = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИмяОбъектаМетаданных.Установить(ИмяОбъектаМетаданных);
	НаборЗаписей.Отбор.КодМДМ.Установить(КодМДМ);
	
	Если ЗначениеЗаполнено(ИмяСопутствСправочника) и Строка(КодМДМСопутствСправочника) <> КодМДМ Тогда
		
		НаборЗаписей.Отбор.ИмяСопутствСправочника.Установить(ИмяСопутствСправочника);
		НаборЗаписей.Отбор.КодМДМСопутствСправочника.Установить(КодМДМСопутствСправочника);
		
	КонецЕсли;
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		
		ТекЗапись = НаборЗаписей[0];
		
		//Если штамп версии не изменился, то не сохраняем запись в РС
		Если ТекЗапись.ШтампВерсии >= Число(ФабрикаСправочника.ШтампВерсии) Тогда
			Возврат;
		КонецЕсли;
		
		ТекЗапись.КоличествоПопыток = ТекЗапись.КоличествоПопыток + 1;
		
	Иначе
		
		ТекЗапись = НаборЗаписей.Добавить();
		ТекЗапись.КоличествоПопыток = 1;
		
	КонецЕсли;
	
	ТекЗапись.МоментОшибки = ТекущаяДата() + 1;
	ТекЗапись.ИмяОбъектаМетаданных = ИмяОбъектаМетаданных;
	ТекЗапись.КодМДМ = КодМДМ;
	ТекЗапись.ТекстОшибки = ТекстОшибки;
	ТекЗапись.ОписаниеОшибки = ФабрикаСправочникаСтрокой;
	ТекЗапись.НужноОбработать = НужноОбработать;
	ТекЗапись.ШтампВерсии = Число(ФабрикаСправочника.ШтампВерсии);
	
	Если ЗначениеЗаполнено(ИмяСопутствСправочника) и Строка(КодМДМСопутствСправочника) <> КодМДМ Тогда
		
		ТекЗапись.ИмяСопутствСправочника = ИмяСопутствСправочника;
		ТекЗапись.КодМДМСопутствСправочника = КодМДМСопутствСправочника;
		
	КонецЕсли;
	
	Если ИмяОбъектаМетаданных = "Номенклатура" Тогда
		ТекЗапись.Комментарий = ФабрикаСправочника.КомментарийАварда;
	КонецЕсли;
	
	НаборЗаписей.Записать(); 
	
КонецПроцедуры

Функция СсылкаПоИдентификатору(ТипЗначения, Значение)     
	
	Если ТипЗначения = Тип("Null") Тогда
		Возврат Null;
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗначения);
	
	Если ОбъектМетаданных = Неопределено Тогда
		ВызватьИсключение "Не верный аргумент";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ABCКлассификация.Ссылка,
			|	ПРЕДСТАВЛЕНИЕ(ABCКлассификация.Ссылка) КАК Представление
			|ИЗ
			|	Перечисление.ABCКлассификация КАК ABCКлассификация";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Перечисление.ABCКлассификация", ОбъектМетаданных.ПолноеИмя());
			Запрос = Новый Запрос(ТекстЗапроса);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Представление = Значение Тогда
					Возврат Выборка.Ссылка;
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.КодМДМ = &КодМДМ";
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Справочник.Номенклатура", ОбъектМетаданных.ПолноеИмя());
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("КодМДМ", Значение);
			
			Результат = Запрос.Выполнить();
			
			Если Не Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				
				Возврат Выборка.Ссылка;
				
			КонецЕсли;
			
		КонецЕсли;                
		
	Иначе
		
		Если Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
			Менеджер = Перечисления[ОбъектМетаданных.Имя];
		ИначеЕсли Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
			Менеджер = Справочники[ОбъектМетаданных.Имя];
		Иначе
			ВызватьИсключение "Не правильный аргумент";
		КонецЕсли;  
		
		Возврат Менеджер.ПустаяСсылка();
		
	КонецЕсли;
	
	СтрокаОшибка = СтрШаблон("Не найден объект %1 с идентификатором %2", ОбъектМетаданных.ПолноеИмя(), Значение);
	
	ВызватьИсключение СтрокаОшибка;
	
КонецФункции

Функция ПроверитьЧтоСвойствоИмеетСтроки(ФабрикаИмени, ИмяСвойства, ИмяРеквизитаСтрок)
	
	Если ТипЗнч(ФабрикаИмени[ИмяСвойства]) = Тип("ОбъектXDTO") Тогда
		
		Если ФабрикаИмени[ИмяСвойства].Свойства().Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ФабрикаИмени[ИмяСвойства][ИмяРеквизитаСтрок]) = Тип("СписокXDTO") Тогда				
			Возврат Истина;					
		КонецЕсли; 	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьЧтоСвойствоЯвляетсяОбъектом(ФабрикаИмени, ИмяСвойства, ИмяРеквизитаСтрок)
	
	Если ТипЗнч(ФабрикаИмени[ИмяСвойства]) = Тип("ОбъектXDTO") Тогда
		
		Если ФабрикаИмени[ИмяСвойства].Свойства().Количество() = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если ТипЗнч(ФабрикаИмени[ИмяСвойства][ИмяРеквизитаСтрок]) = Тип("ОбъектXDTO") Тогда				
			Возврат Истина;					
		КонецЕсли; 	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции


/////////////////Прочие процедуры//////////////////
Функция МожноВМСК(ОбъектДоступа,Пользователь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Можно_В_МСК.Можно
	|ИЗ
	|	РегистрСведений.Можно_В_МСК КАК Можно_В_МСК
	|ГДЕ
	|	Можно_В_МСК.ОбъектДоступа = &ОбъектДоступа
	|	И Можно_В_МСК.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("ОбъектДоступа", ОбъектДоступа);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 	
		Возврат Выборка.Можно;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьАдресДоставки(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПОДСТРОКА(КонтактнаяИнформация.Поле4, 1, 100) = """"
	|				И ПОДСТРОКА(КонтактнаяИнформация.Поле6, 1, 100) = """"
	|				И ПОДСТРОКА(КонтактнаяИнформация.Поле7, 1, 100) = """"
	|				И ПОДСТРОКА(КонтактнаяИнформация.Поле8, 1, 100) = """"
	|				И ПОДСТРОКА(КонтактнаяИнформация.Поле9, 1, 100) = """"
	|			ТОГДА КонтактнаяИнформация.Представление
	|		ИНАЧЕ КонтактнаяИнформация.Поле2 + "", "" + КонтактнаяИнформация.Поле3 + "", "" + КонтактнаяИнформация.Поле4 + "" "" + КонтактнаяИнформация.Поле5 + "", "" + КонтактнаяИнформация.Поле6 + "", дом № "" + КонтактнаяИнформация.Поле7 + "" "" + ВЫБОР
	|				КОГДА ПОДСТРОКА(КонтактнаяИнформация.Поле8, 1, 100) = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" корпус "" + КонтактнаяИнформация.Поле8
	|			КОНЕЦ + "" "" + ВЫБОР
	|				КОГДА ПОДСТРОКА(КонтактнаяИнформация.Поле9, 1, 100) = """"
	|					ТОГДА """"
	|				ИНАЧЕ "" оф. "" + КонтактнаяИнформация.Поле9
	|			КОНЕЦ + """"
	|	КОНЕЦ КАК Представление,
	|	КонтактнаяИнформация.Представление КАК Представление1
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента)
	|	И КонтактнаяИнформация.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Возврат СокрЛП(Выборка.Представление);
		
	КонецЦикла;
	
	Возврат ""; 
	
КонецФункции

Функция ПолучитьТелефоны(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		Возврат СокрЛП(Выборка.Представление);		
	КонецЦикла;      
	
	Возврат ""; 
	
КонецФункции

Функция ПолучитьТелефоныМенеджераМСК(Менеджер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид в (&Вид)";
	
	СписокВидовТелефонов   = Новый Массив;
	СписокВидовТелефонов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаДомашний);
	СписокВидовТелефонов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный);
	
	Запрос.УстановитьПараметр("Объект", Менеджер);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("Вид", СписокВидовТелефонов);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Тел = "";
	
	Пока Выборка.Следующий() Цикл
		Тел = Тел + СокрЛП(Выборка.Представление) + ";";
	КонецЦикла;
	
	Возврат Тел; 
	
КонецФункции

Функция ПолучитьЭлектронныйАдрес(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда		
		Возврат Выборка.Представление;		
	КонецЕсли;                         
	
	Возврат "";                        
	
КонецФункции

Функция ПолучитьЯчейку(Контрагент) Экспорт 
	
	ЗапросЯчейки = Новый Запрос;
	ЗапросЯчейки.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыВЯчейкахОстатки.Ячейка
	|ИЗ
	|	РегистрНакопления.ЗаказыВЯчейках.Остатки(, Контрагент = &Контрагент) КАК ЗаказыВЯчейкахОстатки";
	
	ЗапросЯчейки.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЯчейки = ЗапросЯчейки.Выполнить();
	ВыборкаЯчейки = РезультатЯчейки.Выбрать();
	
	Пока ВыборкаЯчейки.Следующий() Цикл 	
		Возврат ВыборкаЯчейки.Ячейка;  	
	КонецЦикла;                         
	
	Возврат Справочники.ЯчейкиХраненияЗаказов.ПустаяСсылка();
	
КонецФункции

Функция СуммаВЕвро(Сумма, ДатаПересчета) Экспорт 
	
	Рупь = Константы.ВалютаРегламентированногоУчета.Получить();
	Евро = Справочники.Валюты.НайтиПоКоду("978");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Д, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Д", ДатаПересчета);
	Запрос.УстановитьПараметр("Валюта",Евро );
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		КурсЕвро = Выборка.Курс;
		КратностьЕвро = Выборка.Кратность;
		
	КонецЦикла;
	
	Возврат МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Сумма, Рупь, Евро, 1, КурсЕвро, 1, КратностьЕвро);                                                            
	
КонецФункции

Функция ПолучитьУчетнуюЗаписьПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.ДоступКУчетнойЗаписи.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  	
		Возврат Выборка.Ссылка;   	
	КонецЦикла;
	
КонецФункции

Функция ПолучитьНомерЗаявкиНАПортале(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗаказа
	|ИЗ
	|	РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
	|ГДЕ
	|	бит_ВыгруженныеЗагруженныеДокументыПортал.Заказ = &Заказ
	|	И бит_ВыгруженныеЗагруженныеДокументыПортал.Документ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		Возврат СокрЛП(Выборка.НомерЗаказа);		
	КонецЦикла;  
	
	Возврат "";  
	
КонецФункции

Функция ПолучитьДолжность(Ответственный) Экспорт 
	
	Возврат Ответственный.Должность;
	
КонецФункции

Функция ПолучитьДолжностьФЛ(ФизЛицо) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Должность
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо = &ФизЛицо
	|	И НЕ Пользователи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПриказФЛ(ФизЛицо) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Приказ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо = &ФизЛицо
	|	И НЕ Пользователи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Приказ;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТипНоменклатурыПоГУИД(ФабрикаТипНоменклатуры)	
	
	ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
	
	Если ФабрикаТипНоменклатуры.GUID = "cffb25c8-2fcf-11e9-9449-005056a22fef" 
		или ФабрикаТипНоменклатуры.GUID = "cffb25ca-2fcf-11e9-9449-005056a22fef" Тогда
		//Услуга или Работа
		
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга;
		
	ИначеЕсли ФабрикаТипНоменклатуры.GUID = "cffb25cb-2fcf-11e9-9449-005056a22fef" Тогда
		//Набор
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Набор;
		
	ИначеЕсли ФабрикаТипНоменклатуры.GUID = "cffb25cc-2fcf-11e9-9449-005056a22fef"
		или ФабрикаТипНоменклатуры.GUID = "cffb25c9-2fcf-11e9-9449-005056a22fef" Тогда
		//Многооборотная тара или Товар
		ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
		
	КонецЕсли;
	
	Возврат ТипНоменклатуры;
	
КонецФункции

Функция ПолучитьПользователяПоФизЛицу(ГУИДФизЛица) Экспорт 
	
	ПромПользователь = Справочники.Пользователи.ПустаяСсылка();
	
	ЗапросПользователя = Новый Запрос;
	ЗапросПользователя.УстановитьПараметр("КодМДМ",ГУИДФизЛица);
	ЗапросПользователя.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Пользователь
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ФизическиеЛица.Ссылка = Пользователи.ФизЛицо
	|ГДЕ
	|	ФизическиеЛица.КодМДМ = &КодМДМ";
	
	РезультатЗапросаПользователя = ЗапросПользователя.Выполнить();
	
	Если НЕ РезультатЗапросаПользователя.Пустой() Тогда
		
		ВыборкаЗапросапользователя = РезультатЗапросаПользователя.Выбрать();
		ВыборкаЗапросапользователя.Следующий();
		Возврат ВыборкаЗапросапользователя.Пользователь;  
		
	КонецЕсли;    
	
	Возврат ПромПользователь;  
	
КонецФункции

Функция ПолучитьДанныеПрайсПМ(СтруктураОбъекта, ЕстьОшибки)
	
	ДанныеПрайсПМ = Новый Структура("ИДДокументаВСмежнойБазе, Контрагент, Валюта, ТипЦен, Дата");
	
	ДанныеПрайсПМ.ИДДокументаВСмежнойБазе = Формат(СтруктураОбъекта.id, "ЧГ=");
	
	ГУИДКонтрагента = СтруктураОбъекта.partner;
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ГУИДКонтрагента);
	
	Если Контрагент.Пустая() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не найден контрагент с кодом МДМ " + ГУИДКонтрагента);
		ЕстьОшибки = Истина;
		Возврат ДанныеПрайсПМ;
		
	КонецЕсли;    
	
	ДанныеПрайсПМ.Контрагент = Контрагент;
	
	Валюта = Справочники.Валюты.НайтиПоРеквизиту("КодМДМ", СтруктураОбъекта.currency); 
	
	Если Валюта.Пустая() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не найдена валюта с кодом МДМ " + СтруктураОбъекта.currency);
		ЕстьОшибки = Истина;
		Возврат ДанныеПрайсПМ;
		
	КонецЕсли;   
	
	ДанныеПрайсПМ.Валюта = Валюта;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидыЦенПоставщиков.Ссылка
		|ИЗ
		|	Справочник.ТипыЦенНоменклатурыКонтрагентов КАК ВидыЦенПоставщиков
		|ГДЕ
		|	ВидыЦенПоставщиков.Владелец = &Контрагент
		|	И ВидыЦенПоставщиков.ВалютаЦены = &Валюта
		|	И НЕ ВидыЦенПоставщиков.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
	
		ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не найден тип цены для " + Строка(Контрагент) + " в " + Строка(Валюта));
		ЕстьОшибки = Истина;
		Возврат ДанныеПрайсПМ;
		
	КонецЕсли;
			
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	ДанныеПрайсПМ.ТипЦен = Выборка.Ссылка;
	
	ДанныеПрайсПМ.Дата = ПреобразоватьДатуМДМ(СтруктураОбъекта.date);
	
	Возврат ДанныеПрайсПМ;
	
КонецФункции    

Процедура ПолучитьДокументУстановкаЦенНоменклатурыКонтрагентов(ДокОбъект, ДанныеПрайсПМ)
	
	//Поиск существующих документов  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентов.Контрагент = &Контрагент      
		|	И Год(УстановкаЦенНоменклатурыКонтрагентов.Дата) = &Год
		|	И УстановкаЦенНоменклатурыКонтрагентов.ИДДокументаВСмежнойБазе = &ИДДокументаВСмежнойБазе";
	
	Запрос.УстановитьПараметр("ИДДокументаВСмежнойБазе", ДанныеПрайсПМ.ИДДокументаВСмежнойБазе);
	Запрос.УстановитьПараметр("Контрагент", ДанныеПрайсПМ.Контрагент);
	Запрос.УстановитьПараметр("Год", Год(ДанныеПрайсПМ.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Создаем документ или получаем объект существующего
	Если РезультатЗапроса.Пустой() Тогда
		
		// Найти документ за дату прайса, чтобы получить дату-время последнего документа
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЦеныНоменклатурыКонтрагентов.Регистратор,
			|	ЦеныНоменклатурыКонтрагентов.Период КАК Период
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатурыКонтрагентов КАК ЦеныНоменклатурыКонтрагентов
			|ГДЕ
			|	НАЧАЛОПЕРИОДА(ЦеныНоменклатурыКонтрагентов.Период, ДЕНЬ) = &ДатаПрайса
			|	И ЦеныНоменклатурыКонтрагентов.ТипЦен = &ТипЦен
			|	И ЦеныНоменклатурыКонтрагентов.Регистратор ССЫЛКА Документ.УстановкаЦенНоменклатурыКонтрагентов
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("ДатаПрайса", НачалоДня(ДанныеПрайсПМ.Дата));
		Запрос.УстановитьПараметр("ТипЦен", ДанныеПрайсПМ.ТипЦен);
		
		РезультатЗапроса = Запрос.Выполнить(); 
		
		Если РезультатЗапроса.Пустой() Тогда
			ДатаДок = ДанныеПрайсПМ.Дата;
		Иначе	
		    // Дата документа на секунду большего, чтобы не было записей с одинаковыми ключами
			Выборка = РезультатЗапроса.Выбрать();
		    Выборка.Следующий();   
			ДатаДок = Выборка.Период + 1;
		
		КонецЕсли;
		
		ДокОбъект = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();    
		ДокОбъект.Дата = ДатаДок;
		
		ДокОбъект.Контрагент = ДанныеПрайсПМ.Контрагент;   
		ДокОбъект.ИДДокументаВСмежнойБазе = ДанныеПрайсПМ.ИДДокументаВСмежнойБазе;
		
		ДобСтрока = ДокОбъект.ТипыЦен.Добавить();
		ДобСтрока.ТипЦен = ДанныеПрайсПМ.ТипЦен;  
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
	    Выборка.Следующий();
		
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если ДокОбъект.ПометкаУдаления = Истина Тогда
			ДокОбъект.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
	
		Если ДокОбъект.ТипыЦен.НайтиСтроки(Новый Структура("ТипЦен", ДанныеПрайсПМ.ТипЦен)).Количество() = 0 Тогда
		
			ДобСтрока = ДокОбъект.ТипыЦен.Добавить();
			ДобСтрока.ТипЦен = ДанныеПрайсПМ.ТипЦен;  
			
		КонецЕсли;   
		
	КонецЕсли;	   

КонецПроцедуры

Процедура ДобавитьНоменклатуруПрайсПМСНовойЦеной(ДокОбъект, СтруктураОбъекта, ДанныеПрайсПМ)
	
	// Считывание прайса в тзЦены
	тзЦены = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент().Товары.Выгрузить();  
	тзЦены.Колонки.Добавить("КодМДМ", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	Для Каждого Стр Из СтруктураОбъекта.data Цикл              
		
		Если ПустаяСтрока(Стр.mdm_id) Тогда
			Продолжить;
		КонецЕсли;  
		
		НовСтр = тзЦены.Добавить();
		НовСтр.КодМДМ = Стр.mdm_id;    
		НовСтр.Цена = Стр.price;
		
	КонецЦикла;    
	
	// Получаем номенклатуру, у которой цена в прайсе отличается от текущей цены в регистре ЦеныНоменклатурыКонтрагентов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЦены.КодМДМ,
		|	тзЦены.Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	&тзЦены КАК тзЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СправНоменклатура.Ссылка КАК Номенклатура,
		|	ВТ_Цены.Цена,
		|	ВТ_Цены.КодМДМ
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	ВТ_Цены КАК ВТ_Цены
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправНоменклатура
		|		ПО ВТ_Цены.КодМДМ = СправНоменклатура.КодМДМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Номенклатура,
		|	ВТ_Номенклатура.КодМДМ,
		|	ВТ_Номенклатура.Цена,
		|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 0) КАК ЦенаПоследняя,
		|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Регистратор
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&Дата, ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
		|		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
		|ГДЕ
		|	НЕ ВТ_Номенклатура.Цена = ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 0)";
	
	Запрос.УстановитьПараметр("тзЦены", тзЦены);
	Запрос.УстановитьПараметр("Дата",   ДанныеПрайсПМ.Дата);
	Запрос.УстановитьПараметр("ТипЦен", ДанныеПрайсПМ.ТипЦен);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
	     Возврат;
	КонецЕсли;
	
	ТипЦен = ДанныеПрайсПМ.ТипЦен;
	Валюта = ДанныеПрайсПМ.Валюта;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если Не Выборка.Номенклатура = NULL Тогда
		
			НовСтр = ДокОбъект.Товары.Добавить();
			НовСтр.Номенклатура = Выборка.Номенклатура;    
			НовСтр.ЕдиницаИзмерения = Выборка.Номенклатура.ЕдиницаХраненияОстатков;
			НовСтр.Цена = Выборка.Цена;
			НовСтр.ТипЦен = ТипЦен;     
			НовСтр.Валюта = Валюта;   
			
		Иначе
			ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не найдена номенклатура с кодом МДМ " + Выборка.КодМДМ);
		КонецЕсли;
			
	КонецЦикла;
	
	ВидДокумента = "УстановкаЦенНоменклатурыКонтрагентов";
	
	Если ДокОбъект.Товары.Количество() Тогда 
		
		Попытка    
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ДокОбъект.Ссылка);    
			
		Исключение     
			
			ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Ошибка записи документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 					 
			ВызватьИсключение СтрокаИсключения; 
			
		КонецПопытки;	 
		
		
		Попытка    
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение     
			
			ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;	 
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Загрузка прайс-листа из PM. Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Ошибка создания документа: не заполнена табличная часть 'Товары' ");
		
	КонецЕсли;

КонецПроцедуры // ()

// Работа с кратностью товара начало  
Функция ПроверкаНоменклатурыНаКратность(Номенклатура,Количество)   Экспорт
	
	Если Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала.Получить() Тогда
		ПромКратностьТовара = ?(Номенклатура.КратностьФилиала = 0 , Номенклатура.Кратность , Номенклатура.КратностьФилиала);
	Иначе
		ПромКратностьТовара = Номенклатура.Кратность;		
	КонецЕсли;
	
	Если  Количество  = 0 ИЛИ ПромКратностьТовара = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	РезультатДеления  =  Количество /ПромКратностьТовара;
	ЦелаяЧасть = Цел(РезультатДеления);
	
	Если  ЦелаяЧасть  <>  РезультатДеления Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьКратностьНоменклатуры(Номенклатура) Экспорт

	Если Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала.Получить() Тогда
		ПромКратностьТовара = ?(Номенклатура.КратностьФилиала = 0 , Номенклатура.Кратность , Номенклатура.КратностьФилиала);
	Иначе
		ПромКратностьТовара = Номенклатура.Кратность;		
	КонецЕсли; 
	
	Возврат ?(ПромКратностьТовара = 0 , 1 , ПромКратностьТовара);

КонецФункции

Функция ПроверкаНоменклатурыНаКратностьЗаказПокупателя(ЗаказПокупателя) Экспорт 
	
	ТаблицаНоменклатурыСНарушеннойКратностью = Новый ТаблицаЗначений;
	ТаблицаНоменклатурыСНарушеннойКратностью.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатурыСНарушеннойКратностью.Колонки.Добавить("Кратность", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 0));
	ТаблицаНоменклатурыСНарушеннойКратностью.Колонки.Добавить("Количество", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 2));
	
	Если НеобходимоПроверятьКратностьВЗаказе(ЗаказПокупателя) Тогда 	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
		|ПОМЕСТИТЬ КонстКратности
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонстКратности.ЗначениеКонстанты
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ ЗаказПокупателяТовары.Номенклатура.КратностьФилиала = 0
		|							ТОГДА ЗаказПокупателяТовары.Номенклатура.КратностьФилиала
		|						ИНАЧЕ ЗаказПокупателяТовары.Номенклатура.Кратность
		|					КОНЕЦ
		|			ИНАЧЕ ЗаказПокупателяТовары.Номенклатура.Кратность
		|		КОНЕЦ) КАК Кратность
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары,
		|	КонстКратности КАК КонстКратности
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка",ЗаказПокупателя);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Кратность = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			РезультатДеления = ВыборкаДетальныеЗаписи.Количество / ВыборкаДетальныеЗаписи.Кратность;
			ЦелаяЧасть = Цел(РезультатДеления);
			
			Если ЦелаяЧасть <> РезультатДеления Тогда
				
				НоваяСтрока = ТаблицаНоменклатурыСНарушеннойКратностью.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ВыборкаДетальныеЗаписи);
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаНоменклатурыСНарушеннойКратностью;
	
КонецФункции

Функция НеобходимоПроверятьКратностьВЗаказе(ЗаказПокупателя) Экспорт
	
	Если Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала.Получить() Тогда
		
		КодОсновногоСклада = Константы.FTPВыгрузкаОстатковКаталог.Получить();
		КодОсновногоСклада = ?(КодОсновногоСклада = "", 1, Число(КодОсновногоСклада));
		КодДопСклада       = Константы.FTPВыгрузкаОстатковКаталог1.Получить();
		КодДопСклада       = ?(КодДопСклада = "", 1, Число(КодДопСклада));                                                                                                    
		
		Возврат ЗаказПокупателя.IDСклада = КодОсновногоСклада ИЛИ ЗаказПокупателя.IDСклада = КодДопСклада Или ЗаказПокупателя.IDСклада = 0 
		Или ЗаказПокупателя.IDСклада = 1 Или ЗаказПокупателя.IDСклада = 4;
		
	Иначе  
		Возврат НЕ ЭтоСтороннийСклад(ЗаказПокупателя.IDСклада);
	КонецЕсли; 
	
КонецФункции
// Работа с кратностью товара конец

Функция ПолучитьСписокРабочихДней(ГрафикРаботыСтрока) Экспорт 
	
	СоответствиеГрафика = Новый Соответствие; 	
	СоответствиеГрафика.Вставить("ПН",1);
	СоответствиеГрафика.Вставить("ВТ",1);
	СоответствиеГрафика.Вставить("СР",1);
	СоответствиеГрафика.Вставить("ЧТ",1);
	СоответствиеГрафика.Вставить("ПТ",1);
	СоответствиеГрафика.Вставить("СБ",1);
	СоответствиеГрафика.Вставить("ВС",1);
	
	Если ЗначениеЗаполнено(ГрафикРаботыСтрока) Тогда
		
		Если СтрДлина(ГрафикРаботыСтрока) = 14 Тогда
			
			СоответствиеГрафика.Вставить("ПН", Число(Сред(ГрафикРаботыСтрока, 1, 1)));
			СоответствиеГрафика.Вставить("ВТ", Число(Сред(ГрафикРаботыСтрока, 3, 1))); 
			СоответствиеГрафика.Вставить("СР", Число(Сред(ГрафикРаботыСтрока, 5, 1))); 
			СоответствиеГрафика.Вставить("ЧТ", Число(Сред(ГрафикРаботыСтрока, 7, 1))); 
			СоответствиеГрафика.Вставить("ПТ", Число(Сред(ГрафикРаботыСтрока, 9, 1))); 
			СоответствиеГрафика.Вставить("СБ", Число(Сред(ГрафикРаботыСтрока, 11, 1))); 
			СоответствиеГрафика.Вставить("ВС", Число(Сред(ГрафикРаботыСтрока, 13, 1))); 			
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СоответствиеГрафика;

КонецФункции

Процедура ЗагрузкаКурсаЕвро() Экспорт    
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка курса Евро", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ОбработкаЗагрузкиКурсов = Обработки.КурсыВалютРБК.Создать();
	ОбработкаЗагрузкиКурсов.НачДата = ТекущаяДата();
	ОбработкаЗагрузкиКурсов.КонДата = ТекущаяДата();
	
	НовВалюта = ОбработкаЗагрузкиКурсов.СписокВалют.Добавить();
	НовВалюта.Валюта = Справочники.Валюты.НайтиПоКоду("978");
	
	ОбработкаЗагрузкиКурсов.ЗагрузитьКурсыСРБК_Фоновое();
	
КонецПроцедуры

Функция ДанныеОКонтрагентеДляСверкиСМосквой(Контрагент,Признак)  Экспорт 
	
	Код = СокрЛП(Контрагент.Код);
	Наименование = СокрЛП(Контрагент.Наименование);
	ИНН    =     Контрагент.ИНН;
	КодПоОКПО = Контрагент.КодПоОКПО;
	КПП    =    Контрагент.КПП;
	ЮрФизЛицо = ?(Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо, "1", "0");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Тип,
	|	КонтактнаяИнформация.Вид
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип В(&Тип)
	|	И КонтактнаяИнформация.Вид В(&Вид)";
	
	Запрос.УстановитьПараметр("Объект", Контрагент);
	Тип = Новый Массив;
	Вид = Новый Массив;
	
	Тип.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	Тип.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	Тип.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	
	Вид.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	Вид.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	Вид.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	Вид.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);
	
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Вид", Вид);
	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ФактАдресКонтрагента  = "";
	ЮрАдресКонтрагента    = "";
	ТелефонКонтрагента    = "";
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес И Выборка.Вид =  Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
			ФактАдресКонтрагента = Выборка.Представление;
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес И Выборка.Вид =  Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента Тогда
			ЮрАдресКонтрагента = Выборка.Представление;
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			ТелефонКонтрагента = Выборка.Представление;
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
			ЭлПочта = Выборка.Представление;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Признак = 1 Тогда
		Возврат СокрЛП(Код) + "@" + СокрЛП(Наименование) + "@" + СокрЛП(ИНН) + "@" + СокрЛП(КодПоОКПО) + "@" + СокрЛП(КПП)
		 + "@" + ЮрФизЛицо + "@" + СокрЛП(ФактАдресКонтрагента) + "@" + СокрЛП(ЮрАдресКонтрагента) + "@" + СокрЛП(ТелефонКонтрагента) + "@" + СокрЛП(ЭлПочта);
	ИначеЕсли Признак  = 2  Тогда
		Возврат СокрЛП(ФактАдресКонтрагента) + "@" + СокрЛП(ЮрАдресКонтрагента) + "@" + СокрЛП(ТелефонКонтрагента) + "@" + СокрЛП(ЭлПочта);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьДоговорНаНаличныеОплаты(Договор,СуммаДокумента) Экспорт 
	
	Если НЕ Договор.ОплатаПоДоговоруНаличными Тогда
		Возврат Истина;
	КонецЕсли;
	
	//
	// Если приход денег по договору за весь период (с учетом планируемой суммы) превышает 100000 руб - возврат "Ложь"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвиженияДенежныхСредствОбороты.СуммаОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(
	|			,
	|			,
	|			,
	|			ВидДенежныхСредств = &ВидДенежныхСредств
	|				И ПриходРасход = &ПриходРасход
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ДвиженияДенежныхСредствОбороты";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Договор);
	Запрос.УстановитьПараметр("ПриходРасход", Перечисления.ВидыДвиженийПриходРасход.Приход);
	Запрос.УстановитьПараметр("ВидДенежныхСредств", Перечисления.ВидыДенежныхСредств.Наличные);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СуммаОборот + СуммаДокумента > 100000 Тогда
			Возврат Ложь;
		Иначе 
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

Функция ПолучитьМассивДоговоровКонтрагента(Контрагент, ИсключаемыйДоговор = Неопределено) Экспорт
	
	МассивРезультата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Ссылка <> &ИсключаемыйДоговор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.ПометкаУдаления УБЫВ";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);	
	Запрос.УстановитьПараметр("ИсключаемыйДоговор", ?(ЗначениеЗаполнено(ИсключаемыйДоговор), ИсключаемыйДоговор, Справочники.ДоговорыКонтрагентов.ПустаяСсылка()));	
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивРезультата.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат МассивРезультата;	
	
КонецФункции

Функция НайтиИзРегистратора(Регистратор, Номенклатура, НомерСтроки)
	
	СтрДок = Регистратор.Товары[НомерСтроки];
	Возврат СтрДок.ОтказПоставщика;
	
КонецФункции

Функция НайтиДокументПТУПоНомеруЭДОИКонтрагенту(НомерДокументаУПД, ДатаДокументаУПД, Контрагент, ВидПоиска = 0)  
	
	ЗапросПТУ = Новый Запрос;
	ЗапросПТУ.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоступлениеТоваровУслуг.Ссылка КАК ДокПТУ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент   
	|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления";
	
	Если ВидПоиска = 0 Тогда
		ЗапросПТУ.Текст = ЗапросПТУ.Текст + " 
	|	И ПоступлениеТоваровУслуг.НомерВходящегоДокументаЭлектронногоОбмена = &НомерВходящегоДокумента 
	//+Шульман А. 25.02.2026 #UT10-5713
	|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокументаЭлектронногоОбмена = &ДатаВходящегоДокумента";
	//-Шульман А. 25.02.2026 #UT10-5713	
	Иначе	
		ЗапросПТУ.Текст = ЗапросПТУ.Текст + "
	|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента   
	//+Шульман А. 25.02.2026 #UT10-5713
	|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	//-Шульман А. 25.02.2026 #UT10-5713
	КонецЕсли;
	
	ЗапросПТУ.УстановитьПараметр("Контрагент", Контрагент);
	ЗапросПТУ.УстановитьПараметр("НомерВходящегоДокумента", НомерДокументаУПД); 
	//+Шульман А. 25.02.2026 #UT10-5713
	ЗапросПТУ.УстановитьПараметр("ДатаВходящегоДокумента", ДатаДокументаУПД);
	//-Шульман А. 25.02.2026 #UT10-5713
	
	РезультатЗапросаПТУ = ЗапросПТУ.Выполнить();
	
	Если НЕ РезультатЗапросаПТУ.Пустой() Тогда  
		
		Выборка = РезультатЗапросаПТУ.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ДокПТУ;       
		
	Иначе
		Возврат Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ПриЗаписиРегистра_ЗаказыПокупателейПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Регистратор = Источник.Отбор.Регистратор.Значение; 
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
		
		Если НЕ	Источник.Записывать Тогда 
			Источник.Записывать = Истина;
		КонецЕсли;
		
		Для Каждого Запись Из Источник Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись.ОтказПоставщика) Тогда
				
				ОтказПоставщика = НайтиИзРегистратора(Регистратор, Запись.Номенклатура, Запись.НомерСтроки);
				Запись.ОтказПоставщика = ОтказПоставщика;
				
			КонецЕсли;
			
		КонецЦикла;	 
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьНомерСчетФактуры(Дата) Экспорт 
	
	СтруктураСНомеромСчетфактуры = Новый Структура;
	ГодЭтогоДокумента = Год(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НомераСчетовФактур.МаксимальныйНомер
	|ИЗ
	|	Справочник.НомераСчетовФактур КАК НомераСчетовФактур
	|ГДЕ
	|	НомераСчетовФактур.Код = &Код
	|	И (НомераСчетовФактур.ВидДокумента = ""СчетФактураВыданный""
	|			ИЛИ НомераСчетовФактур.ВидДокумента = """")";
	
	Запрос.УстановитьПараметр("Код", ГодЭтогоДокумента);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		НовЭлемент = Справочники.НомераСчетовФактур.СоздатьЭлемент();
		НовЭлемент.Код = ГодЭтогоДокумента;
		НовЭлемент.ВидДокумента = "СчетФактураВыданный";
		НовЭлемент.Записать();
		МаксимальныйНомер = 0;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МаксимальныйНомер = Выборка.МаксимальныйНомер;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураСНомеромСчетфактуры.Вставить("МаксимальныйНомер", МаксимальныйНомер);
	
	Макс =  МаксимальныйНомер + 1;
	Макс  = СтрЗаменить(Строка(Макс), Символы.НПП, "");
	ТекущаяБаза = Константы.База.Получить();                 
	
	Если ТекущаяБаза = Перечисления.НазваниеБазы.Самара 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.НабережныеЧелны 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж2 Тогда                           
		Номер = Прав("0000000" + Макс + "/01", 11);
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Владимир 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Казань2 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Липецк Тогда
		Номер = Прав("0000000" + Макс + "/02", 11);
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Рязань 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Чебоксары
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Тамбов Тогда
		Номер = Прав("0000000" + Макс + "/03", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Тула
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Ульяновск Тогда
		Номер = Прав("0000000" + Макс + "/04", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Ярославль
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Альметьевск Тогда
		Номер = Прав("0000000" + Макс + "/05", 11);		
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Калуга Тогда
		Номер = Прав("0000000" + Макс + "/06", 11);		
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Молодогвардейская Тогда
		Номер = Прав("0000000" + Макс + "/07", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.ЮГ Тогда
		Номер = Прав("0000000" + Макс + "/08", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Тверь Тогда
		Номер = Прав("0000000" + Макс + "/09", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Север Тогда
		Номер = Прав("0000000" + Макс + "/10", 11);	
	ИначеЕсли  ТекущаяБаза = Перечисления.НазваниеБазы.Восток Тогда
		Номер = "УТ" + Прав("0000000" + Макс, 9);
	Иначе
		
		Префикс = СокрЛП(Константы.ОсновнаяОрганизация.Получить().Префикс);
		ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
		ДлинаНомера = 11;
		Номер = Префикс + Прав("0000000000" + Макс, ДлинаНомера - СтрДлина(Префикс));   
		
	КонецЕсли;
	
	СтруктураСНомеромСчетфактуры.Вставить("Номер", Номер);
	Возврат СтруктураСНомеромСчетфактуры ;
	
КонецФункции

Функция ВернутьНомерРеализацииТоваровУслуг(Дата, Организация) Экспорт 
	
	СтруктураСНомеромРТУ = Новый Структура;
	ГодЭтогоДокумента = Год(Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НомераСчетовФактур.МаксимальныйНомер
	|ИЗ
	|	Справочник.НомераСчетовФактур КАК НомераСчетовФактур
	|ГДЕ
	|	НомераСчетовФактур.Код = &Код
	|	И (НомераСчетовФактур.ВидДокумента = ""РеализацияТоваровУслуг"")";
	
	Запрос.УстановитьПараметр("Код", ГодЭтогоДокумента);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		НовЭлемент = Справочники.НомераСчетовФактур.СоздатьЭлемент();
		НовЭлемент.Код = ГодЭтогоДокумента;
		НовЭлемент.ВидДокумента = "РеализацияТоваровУслуг";
		НовЭлемент.Записать();
		МаксимальныйНомер = 0;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МаксимальныйНомер = Выборка.МаксимальныйНомер;
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураСНомеромРТУ.Вставить("МаксимальныйНомер", МаксимальныйНомер);
	
	Макс = МаксимальныйНомер + 1;
	Макс = СтрЗаменить(Строка(Макс), Символы.НПП, "");
	
	Префикс = СокрЛП(Организация.Префикс);
	ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	ДлинаНомера = 11;
	
	Номер = Префикс + Прав("0000000000" + Макс,ДлинаНомера - СтрДлина(Префикс));
	
	СтруктураСНомеромРТУ.Вставить("Номер", Номер);
	
	Возврат СтруктураСНомеромРТУ;
	
КонецФункции

Процедура ПриЗаписиРегистраНакопления_ТоварыНаСкладахПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	// не используется
	
КонецПроцедуры

Функция ОправитьПоЭлектроннойПочте(СтруктураДляОтравки,ТабДокументСФ, ТабДокументСчет = Неопределено, ВыводитьСообщениеОбОтправке = Ложь, 
	                               ТабДокументТорг12 = Неопределено, ТабДокументТоварныйЧек = Неопределено)  Экспорт
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если  Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТабДокументСФ = Неопределено И ТабДокументСчет = Неопределено И ТабДокументТорг12 = Неопределено
		И ТабДокументТоварныйЧек = Неопределено Тогда 
		Возврат "";		
	КонецЕсли;	
	
	// СФ
	Если ТабДокументСФ <> Неопределено Тогда 
		
		ТабДокументСФ.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокументСФ.ПолеСверху = 13;
		ТабДокументСФ.ПолеСлева  = 0;
		ТабДокументСФ.ПолеСнизу  = 0;
		ТабДокументСФ.ПолеСправа = 0;
		
		ТабДокументСФ.ВерхнийКолонтитул.Выводить          = Истина;
		ТабДокументСФ.ВерхнийКолонтитул.НачальнаяСтраница = 2;
		ТабДокументСФ.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
		ТабДокументСФ.ВерхнийКолонтитул.ТекстСправа  = "Лист [&НомерСтраницы]";
		
		ТабДокументСФ.Записать(СтруктураДляОтравки.ЗаголовокФайла,СтруктураДляОтравки.ТипФайлаТабДок); 
		
	КонецЕсли;
	
	Если ТабДокументСчет <> Неопределено Тогда 
		ТабДокументСчет.Записать(СтруктураДляОтравки.ЗаголовокФайлаСчет,СтруктураДляОтравки.ТипФайлаСчетТабДок); 
	КонецЕсли;
	
	Если ТабДокументТорг12 <> Неопределено Тогда 
		ТабДокументТорг12.Записать(СтруктураДляОтравки.ЗаголовокФайлаТорг12,СтруктураДляОтравки.ТипФайлаТорг12ТабДок); 
	КонецЕсли;
	
	Если ТабДокументТоварныйЧек<>Неопределено Тогда
		ТабДокументТоварныйЧек.Записать(СтруктураДляОтравки.ЗаголовокФайлаТоварныйЧек,СтруктураДляОтравки.ТипФайлаТоварныйЧек);  
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = СтруктураДляОтравки.ТемаПисьма;
	МылоКонтрагента = "";
	
	МылоКонтрагента = СтруктураДляОтравки.Емэйл;
	
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтруктураДляОтравки.Емэйл, ";");
	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		
		ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу. " 
		+ Символы.ПС + ОписаниеОшибки());
		Возврат "Не сумел подключиться к почтовому серверу!"; 
		
	КонецПопытки;
	
	Для каждого ТекАдрес Из МассивАдресов Цикл
		Сообщение.Получатели.Добавить(ТекАдрес); 
	КонецЦикла;
	
	Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	
	Если ТабДокументСФ <> Неопределено Тогда 
		Сообщение.Вложения.Добавить(СтруктураДляОтравки.ЗаголовокФайла, СтруктураДляОтравки.ТипФайлаТабДок);
	КонецЕсли;
	
	Если ТабДокументСчет <> Неопределено Тогда 
		Сообщение.Вложения.Добавить(СтруктураДляОтравки.ЗаголовокФайлаСчет, СтруктураДляОтравки.ТипФайлаСчетТабДок);
	КонецЕсли;
	
	Если ТабДокументТорг12 <> Неопределено Тогда 
		Сообщение.Вложения.Добавить(СтруктураДляОтравки.ЗаголовокФайлаТорг12, СтруктураДляОтравки.ТипФайлаТорг12ТабДок);
	КонецЕсли;
	
	Если ТабДокументТоварныйЧек<>Неопределено Тогда
		Сообщение.Вложения.Добавить(СтруктураДляОтравки.ЗаголовокФайлаТоварныйЧек, СтруктураДляОтравки.ТипФайлаТоварныйЧек); 	
	КонецЕсли;

	Если СтруктураДляОтравки.Свойство("ЗаголовкиФайловУКД") Тогда
		
		Если НЕ СтруктураДляОтравки.ЗаголовкиФайловУКД.Количество() = 0 Тогда
			
			Для Каждого СтрокаЗаголовковУКД Из СтруктураДляОтравки.ЗаголовкиФайловУКД Цикл
				
				ТабДокУКД = СтрокаЗаголовковУКД.Значение;
				ТабДокУКД.Записать(СтрокаЗаголовковУКД.Ключ, СтруктураДляОтравки.ТипФайлаУКД);	
				Сообщение.Вложения.Добавить(СтрокаЗаголовковУКД.Ключ, СтруктураДляОтравки.ТипФайлаУКД);
				
			КонецЦикла;			
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если СтруктураДляОтравки.Свойство("ТекстПисьма") Тогда
		Сообщение.Тексты.Добавить(СтруктураДляОтравки.ТекстПисьма, ТипТекстаПочтовогоСообщения.HTML);
	КонецЕсли;
		
	Попытка
		
		Почта.Послать(Сообщение);
		
		ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, СтруктураДляОтравки.Сообщение); 
		СтатусВозврата = "";
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не отправлено письмо на адрес " 
		+ СтруктураДляОтравки.Емэйл + Символы.ПС + ОписаниеОшибки());
		СтатусВозврата = ОписаниеОшибки(); 
		
	Конецпопытки;
	
	Сообщение.Получатели.Очистить();
	Сообщение.Вложения.Очистить();
	Почта.Отключиться();
	
	Если ВыводитьСообщениеОбОтправке Тогда 
		Сообщить(СтруктураДляОтравки.Сообщение, СтатусСообщения.Информация);
	КонецЕсли;
	
	Если ТабДокументСФ <> Неопределено Тогда 
		УдалитьФайлы(СтруктураДляОтравки.ЗаголовокФайла);
	КонецЕсли;
	
	Если ТабДокументСчет <> Неопределено Тогда
		УдалитьФайлы(СтруктураДляОтравки.ТипФайлаСчетТабДок);
	КонецЕсли;
	
	Если ТабДокументТорг12 <> Неопределено Тогда 
		УдалитьФайлы(СтруктураДляОтравки.ТипФайлаТорг12ТабДок);
	КонецЕсли; 
	
	Если СтруктураДляОтравки.Свойство("ЗаголовкиФайловУКД") Тогда
		
		Если НЕ СтруктураДляОтравки.ЗаголовкиФайловУКД.Количество() = 0 Тогда
			
			Для Каждого СтрокаЗаголовковУКД Из СтруктураДляОтравки.ЗаголовкиФайловУКД Цикл
				УдалитьФайлы(СтрокаЗаголовковУКД.Ключ);
			КонецЦикла;			
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СтатусВозврата;
	
КонецФункции  

Процедура ДополнитьСтруктуруДляОтправкиПоСобытию(СтруктураДляОтправки, Событие = Неопределено, Контрагент = Неопределено) Экспорт

	ТекстПисьма = "";

	Если ЗначениеЗаполнено(Событие) Тогда  
		
		Рассылка = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.Рассылки , Событие); 
		
		Если ЗначениеЗаполнено(Рассылка) И ТипЗнч(Рассылка) = Тип("СправочникСсылка.ПЛ_События") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПЛ_УведомленияОСобытиях.Ссылка
			|ИЗ
			|	Справочник.ПЛ_УведомленияОСобытиях КАК ПЛ_УведомленияОСобытиях
			|ГДЕ
			|	НЕ ПЛ_УведомленияОСобытиях.ПометкаУдаления
			|	И ПЛ_УведомленияОСобытиях.Событие = &Событие";
			
			Запрос.УстановитьПараметр("Событие", Рассылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл  
				
				ТекстПисьма = ТекстПисьма + Выборка.Ссылка.ТекстСообщения + Символы.ПС + Символы.ПС;	
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекстПисьма) Тогда
		
		Если СтруктураДляОтправки.Свойство("ТекстПисьма") Тогда
			СтруктураДляОтправки.ТекстПисьма = СтруктураДляОтправки.ТекстПисьма + Символы.ПС + ТекстПисьма;
		Иначе
			СтруктураДляОтправки.Вставить("ТекстПисьма", ТекстПисьма);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

Функция НапечататьКомплектДокументов(СтруктураДляПечати) Экспорт
	
	Реализация 						= СтруктураДляПечати.Реализация;
	СчетФактура 					= СтруктураДляПечати.СчетФактура;
	База 							= СтруктураДляПечати.База;
	КолЭкз 							= СтруктураДляПечати.КолЭкз;
	СразуНаПринтер 					= СтруктураДляПечати.СразуНаПринтер;
	ПечатьУПД 						= СтруктураДляПечати.ПечатьУПД;
	ПечатьСчета 					= СтруктураДляПечати.ПечатьСчета;
	ПечатьТорг12 					= СтруктураДляПечати.ПечатьТорг12;
	ОтправлятьПоПочте 				= СтруктураДляПечати.ОтправлятьПоПочте;
	ПечатьАктРасчетаПремииПоРекламе = СтруктураДляПечати.ПечатьАктРасчетаПремииПоРекламе;
	ПечатьКорректСчФк               = СтруктураДляПечати.ПечатьКорректСчФк;
	ПечатьТТН                       = СтруктураДляПечати.ПечатьТТН; 
	КолвоЭкзТТН						= СтруктураДляПечати.КолвоЭкзТТН;
	ГрузополучательПризнакПечатиТТН = СтруктураДляПечати.ГрузополучательПризнакПечатиТТН; 
	
	ПечатьТранзитЧерезТомилино 		= СтруктураДляПечати.ПечатьТранзитЧерезТомилино;
	
	Если СтруктураДляПечати.Свойство("ПечатьКорректировкиСборки") Тогда
		ПечатьКорректировкиСборки = СтруктураДляПечати.ПечатьКорректировкиСборки;
	Иначе
		ПечатьКорректировкиСборки = Ложь;
	КонецЕсли;      
	
	Если СтруктураДляПечати.Свойство("ОтветственныйКорректировкаСборки") Тогда
		ОтветственныйКорректировкаСборки = СтруктураДляПечати.ОтветственныйКорректировкаСборки;
	Иначе
		ОтветственныйКорректировкаСборки = Ложь;
	КонецЕсли;       
	
	Если СтруктураДляПечати.Свойство("ЕстьКорректировкиСборки") Тогда
		ЕстьКорректировкиСборки = СтруктураДляПечати.ЕстьКорректировкиСборки;
	Иначе
		ЕстьКорректировкиСборки = Ложь;
	КонецЕсли;
	
	Если СтруктураДляПечати.Свойство("ПечатьЗаявкиНаВозврат") Тогда
		ПечатьЗаявкиНаВозврат = СтруктураДляПечати.ПечатьЗаявкиНаВозврат;
	Иначе
		ПечатьЗаявкиНаВозврат = Ложь;
	КонецЕсли;
	
	//+Сёмин Р. 24.02.2026 #UT10-5691
	Если СтруктураДляПечати.Свойство("ПечатьЗаявкиНаПеревозкуГрузов") Тогда
		ПечатьЗаявкиНаПеревозкуГрузов = СтруктураДляПечати.ПечатьЗаявкиНаПеревозкуГрузов;
	Иначе
		ПечатьЗаявкиНаПеревозкуГрузов = Ложь;
	КонецЕсли;
	//-Сёмин Р. 24.02.2026 #UT10-5691
	
	//+Сёмин Р.И. 18.08.2026 #UT10-6010
	Если СтруктураДляПечати.Свойство("НеПечататьУПДГрузополучателю") Тогда
		НеПечататьУПДГрузополучателю = СтруктураДляПечати.НеПечататьУПДГрузополучателю;
	Иначе
		НеПечататьУПДГрузополучателю = Ложь;
	КонецЕсли;
	//-Сёмин Р.И. 18.08.2026 #UT10-6010
   
	ДокОбъект = Реализация.ПолучитьОбъект(); 
	
	ПечДокСФ = Неопределено;
	ПечДокСчет = Неопределено;       
	
	
	ОрганизацияМСК = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить();
	
	Если (Реализация.Организация = ОрганизацияМСК 
		И 
		(База = Перечисления.НазваниеБазы.Казань
		ИЛИ База = Перечисления.НазваниеБазы.Воронеж
		ИЛИ База = Перечисления.НазваниеБазы.Молодогвардейская
		ИЛИ База = Перечисления.НазваниеБазы.ЮГ
		ИЛИ База = Перечисления.НазваниеБазы.Север
		ИЛИ База = Перечисления.НазваниеБазы.Восток
		ИЛИ База = Перечисления.НазваниеБазы.Ростов
		ИЛИ База = Перечисления.НазваниеБазы.Краснодар
		ИЛИ База = Перечисления.НазваниеБазы.Краснодар2
		ИЛИ База = Перечисления.НазваниеБазы.НижнийНовгород
		ИЛИ База = Перечисления.НазваниеБазы.НабережныеЧелны))
		ИЛИ Реализация.ДоговорКонтрагента.РозничнаяПродажа
		ИЛИ Реализация.ДоговорКонтрагента.ЛицевойСчет Тогда 
		
		Если Константы.ОбъединятьТоварныеЧекиПриПечати.Получить() Тогда
			
			ПечДокЧек = ДокОбъект.Чек(Ложь, Ложь, КолЭкз);
			
			//+Сёмин Р.И. 19.08.2026 #UT10-6010
			//УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
			
			Если НЕ НеПечататьУПДГрузополучателю Тогда
				УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
			КонецЕсли;
			//-Сёмин Р.И. 19.08.2026 #UT10-6010
			
		Иначе
			
			ПечДокЧек = ДокОбъект.Чек();
			
			//+Сёмин Р.И. 19.08.2026 #UT10-6010
			//УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, КолЭкз, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
			
			Если НЕ НеПечататьУПДГрузополучателю Тогда
				УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, КолЭкз, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
			КонецЕсли;
			//-Сёмин Р.И. 19.08.2026 #UT10-6010
			
		КонецЕсли;
		
		Если ПечатьКорректСчФк И Константы.ДатаОтсчетаНачалаПечатиКорректСчФк.Получить() <> Дата('00010101') Тогда
			
			//+Гавриленков В. 22.05.2026 #
			//ТолькоОтметка = ЗначениеЗаполнено(Реализация.Грузополучатель.DS_Подразделение_ID) ИЛИ ЗначениеЗаполнено(Реализация.ДоговорКонтрагента.DS_Подразделение_ID);
			//РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати, ТолькоОтметка);
			
			//+Сёмин Р.И. 08.09.2026 #UT10-6028
			//РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати);
			РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати, ДокОбъект.Грузополучатель.НеПечататьУКД);
			//-Сёмин Р.И. 08.09.2026 #UT10-6028
			
			//-Гавриленков В. 22.05.2026 #
			МассивТабДокКорректСчФк = ПолучитьКорректировочныеСчетаФактурыДляОтправки(ДокОбъект.Грузополучатель);	
			
		КонецЕсли; 						
		
		Если ПечатьТТН И Константы.ВключитьПечатьТТН.Получить() = Истина И 
			
			ГрузополучательПризнакПечатиТТН = Истина И ДокОбъект.Автомобиль <> Справочники.ТранспортныеСредства.ПустаяСсылка() Тогда
			РаспечататьТТН(ДокОбъект, СтруктураДляПечати);				
			
		КонецЕсли; 
		
		Если ДокОбъект.ТаксиДоставка Тогда
			
			ПечДокЧек = ДокОбъект.ПечатьАктаПриемаПередачиТаксиДоставка();
			УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 2, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);				
			
		КонецЕсли;			
		
		Если  НЕ ДокОбъект.БылаПечать  Тогда
			
			ДокОбъект.БылаПечать  = Истина;
			ДокОбъект.ОбменДанными.Загрузка = Истина;
			ДокОбъект.ДополнительныеСвойства.Вставить("НеФормироватьИсходящееСообщение");
			
			Попытка
				
				ДокОбъект.Записать();
				СтруктураДляПечати.Вставить("БылаПечать", Истина);
				
			Исключение
				
				Сообщить("Для документа " + Реализация + " не удалось установить признак 'Была печать'. Не удалось выполнить запись документа!");
				
			КонецПопытки;
			
		КонецЕсли; 
		
		Если ОтправлятьПоПочте Тогда 
			
			ТекГрузополучатель = Реализация.Грузополучатель;  
			
			Если  ((ЗначениеЗаполнено(Реализация.Грузополучатель.DS_Подразделение_ID) ИЛИ ЗначениеЗаполнено(Реализация.ДоговорКонтрагента.DS_Подразделение_ID)) 
				И МСК.ЭтоОбособленноеПодразделение() 
				И НЕ Константы.База.Получить() = Перечисления.НазваниеБазы.Ростов) Тогда
				 
				Если ЗначениеЗаполнено(ТекГрузополучатель) И 
					(ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте ИЛИ ТекГрузополучатель.ОтправлятьСчетПоПочте
					ИЛИ ТекГрузополучатель.ОтправлятьТорг12ПоПочте) Тогда
					
					АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(ТекГрузополучатель); 
					
					Если Не ПустаяСтрока(АдресЭлПочты)  Тогда
						
						СтруктураДляОтравки = СформироватьСтруктуруДляОтправкеПоПочте(АдресЭлПочты,
						ТекГрузополучатель,
						СчетФактура, 
						Реализация, 
						ПечатьУПД, 
						Истина, 
						ПечатьТорг12,
						МассивТабДокКорректСчФк);
						
						ДополнитьСтруктуруДляОтправкиПоСобытию(СтруктураДляОтравки, "Печать комплекта документов", ТекГрузополучатель);
						
						Если Реализация.Контрагент.ВместоУПДВысылатьДругуюФорму Тогда 
							
							ПечДокСФ = ДокОбъект.ПечатьДляКорсуна();
							ПечДокСФ_НаПечать = ДокОбъект.ПечатьУниверсальногоПередаточногоДокумента();
							
						Иначе
							
							Если НЕ Реализация.Грузополучатель.ПечататьТоварныйЧекБезЦенВместоУПД Тогда
								
								ПечДокСФ = ДокОбъект.ПечатьУниверсальногоПередаточногоДокумента();
								
								Если НЕ ПечДокСФ = Неопределено Тогда
									
									Если Реализация.Грузополучатель.ПечатьУПДВВертикальномФормате Тогда
										ПечДокСФ.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
									Иначе
										ПечДокСФ.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
									КонецЕсли;
									
								КонецЕсли; 
								
							Иначе
								ПечДокСФ = ДокОбъект.Чек(Ложь,Истина);
							КонецЕсли;
							
						КонецЕсли;
						
						Если ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте Тогда
							
							Если Реализация.ДоговорКонтрагента.Розничнаяпродажа ИЛИ Реализация.ДоговорКонтрагента.ЛицевойСчет Тогда
								
								Если СтруктураДляОтравки.ОтправлятьТоварныйЧекПоПочте Тогда 
									
									ПечДокЧек = ДокОбъект.Чек(Ложь, Ложь, 1);
									ПечДокСФ = Неопределено;
									
								Иначе
									ПечДокЧек = Неопределено;
								КонецЕсли;
								
							Иначе
								
								Если ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте И ПечатьУПД 
								   И ТекГрузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда
									МСК.ОтправитьПечатныеФормыПоЭП(Реализация);
								КонецЕсли;							
								
								Если НЕ СтруктураДляОтравки.ОтправлятьСчетФактуруПоПочте ИЛИ НЕ ПечатьУПД Тогда 
									ПечДокСФ = Неопределено;
								Иначе
									
									Если ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.УПД 
									   И ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.УПДИКодПроизводителя 
									   И ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда 
										
										ТекОбъектСФ = СчетФактура.ПолучитьОбъект();
										ПечДокСФ = ТекОбъектСФ.ПечатьСчетФактуру(СчетФактура); 		
										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если СтруктураДляОтравки.ОтправлятьСчетПоПочте Тогда 
							ПечДокСчет = ДокОбъект.НовыйСчет();
						Иначе
							ПечДокСчет = Неопределено;
						КонецЕсли;
						
						Если НЕ СтруктураДляОтравки.ОтправлятьТорг12ПоПочте ИЛИ НЕ ПечатьТорг12 Тогда 
							ПечДокТорг12 = Неопределено;
						КонецЕсли;
						
						КодОтправки = ОправитьПоЭлектроннойПочте(СтруктураДляОтравки,ПечДокСФ, ПечДокСчет, Истина, ПечДокТорг12, ПечДокЧек);
						
						Если КодОтправки<>"" Тогда 
							Сообщить(КодОтправки);
						Иначе
							
							Если СтруктураДляОтравки.Свойство("МассивТабДокКорректСчФк") Тогда
								
								Если НЕ СтруктураДляОтравки.МассивТабДокКорректСчФк.Количество() = 0 Тогда
									
									Для Каждого СтрокаЗаголовковУКД Из СтруктураДляОтравки.МассивТабДокКорректСчФк Цикл  
										
										РСМенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
										РСМенеджерЗаписи.Объект = СтрокаЗаголовковУКД.Ключ.Ссылка;
										РСМенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ОтправленоПоЭлПочте;		
										РСМенеджерЗаписи.Значение = Истина;
										РСМенеджерЗаписи.Записать(Истина);										
										
									КонецЦикла;			
									
								КонецЕсли;		
								
							КонецЕсли;	
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
			ИначеЕсли ЗначениеЗаполнено(ТекГрузополучатель) И ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте 
			        И (Реализация.ДоговорКонтрагента.Розничнаяпродажа ИЛИ Реализация.ДоговорКонтрагента.ЛицевойСчет) Тогда
				
				АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(ТекГрузополучатель); 
				
				Если Не ПустаяСтрока(АдресЭлПочты)  Тогда
					
					СтруктураДляОтравки = СформироватьСтруктуруДляОтправкеПоПочте(АдресЭлПочты,
					ТекГрузополучатель,
					СчетФактура, 
					Реализация, 
					Ложь, 
					Ложь, 
					Ложь,
					МассивТабДокКорректСчФк);    
					
					ДополнитьСтруктуруДляОтправкиПоСобытию(СтруктураДляОтравки, "Печать комплекта документов", ТекГрузополучатель);
					
					ПечДокЧек = ДокОбъект.Чек(Ложь, Ложь, 1);

					КодОтправки = ОправитьПоЭлектроннойПочте(СтруктураДляОтравки,ПечДокСФ, ПечДокСчет, Истина, ПечДокТорг12, ПечДокЧек);
					
					Если КодОтправки<>"" Тогда 
						Сообщить(КодОтправки);
					Иначе
						
						Если СтруктураДляОтравки.Свойство("МассивТабДокКорректСчФк") Тогда
							
							Если НЕ СтруктураДляОтравки.МассивТабДокКорректСчФк.Количество() = 0 Тогда
								
								Для Каждого СтрокаЗаголовковУКД Из СтруктураДляОтравки.МассивТабДокКорректСчФк Цикл  
									
									РСМенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
									РСМенеджерЗаписи.Объект = СтрокаЗаголовковУКД.Ключ.Ссылка;
									РСМенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ОтправленоПоЭлПочте;		
									РСМенеджерЗаписи.Значение = Истина;
									РСМенеджерЗаписи.Записать(Истина);										
									
								КонецЦикла;			
								
							КонецЕсли;		
							
						КонецЕсли;	
						
					КонецЕсли;

				КонецЕсли;			
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ПечатьУПД Тогда 
			
			Если СокрЛП(Реализация.Контрагент.ИНН) = "" Тогда 
				Сообщить("У контрагента " + Реализация.Контрагент + "по документу " + Реализация + " не заполнен ИНН! Печать УПД для контрагентов с незаполненным ИНН запрещена!");
			Иначе	
				
				Если Константы.ПечататьТоварныйЧекСУПД.Получить() Тогда
					
					ПечДокЧек = ДокОбъект.Чек();
					
					//+Сёмин Р.И. 07.09.2026 #UT10-6030
					//УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
					
					Если НЕ НеПечататьУПДГрузополучателю Тогда
						УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
					КонецЕсли;
					//-Сёмин Р.И. 07.09.2026 #UT10-6030
					
					Если ПечатьСчета Тогда 
						
						ПечДокСчет = ДокОбъект.НовыйСчет();
						
						//+Сёмин Р.И. 07.09.2026 #UT10-6030
						//УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСчет, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
						
						Если НЕ НеПечататьУПДГрузополучателю Тогда
							УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСчет, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
						КонецЕсли;
						//-Сёмин Р.И. 07.09.2026 #UT10-6030
						
					КонецЕсли;						
					
				КонецЕсли;
				
				Если Реализация.Контрагент.ВместоУПДВысылатьДругуюФорму Тогда 
					
					ПечДокСФ = ДокОбъект.ПечатьДляКорсуна();
					ПечДокСФ_НаПечать = ДокОбъект.ПечатьУниверсальногоПередаточногоДокумента();
					
				Иначе
					
					Если НЕ Реализация.Грузополучатель.ПечататьТоварныйЧекБезЦенВместоУПД Тогда
						
						ПечДокСФ = ДокОбъект.ПечатьУниверсальногоПередаточногоДокумента();
						
						Если НЕ ПечДокСФ = Неопределено Тогда
							
							Если Реализация.Грузополучатель.ПечатьУПДВВертикальномФормате Тогда
								ПечДокСФ.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
							Иначе
								ПечДокСФ.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
							КонецЕсли;
							
						КонецЕсли; 
						
					Иначе
						ПечДокСФ = ДокОбъект.Чек(Ложь, Истина);
					КонецЕсли;
					
				КонецЕсли;
				
				Для Х = 1 по КолЭкз Цикл
					
					//+Сёмин Р.И. 18.08.2026 #UT10-6010
					//Если Реализация.Контрагент.ВместоУПДВысылатьДругуюФорму Тогда 
					//	УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСФ_НаПечать, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
					//Иначе 
					//	УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСФ, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);							
					//КонецЕсли;
					
					Если НЕ НеПечататьУПДГрузополучателю Тогда
						
						Если Реализация.Контрагент.ВместоУПДВысылатьДругуюФорму Тогда 
							УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСФ_НаПечать, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
						Иначе 
							УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСФ, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);							
						КонецЕсли;
						
					КонецЕсли;
					//-Сёмин Р.И. 18.08.2026 #UT10-6010
					
				КонецЦикла;
				
				Если НЕ ДокОбъект.БылаПечать Тогда
					
					ДокОбъект.БылаПечать = Истина;
					ДокОбъект.ДополнительныеСвойства.Вставить("НеФормироватьИсходящееСообщение");
					ДокОбъект.ОбменДанными.Загрузка = Истина;
					
					Попытка
						
						ДокОбъект.записать();
						СтруктураДляПечати.Вставить("БылаПечать", Истина);
						
					Исключение
						Сообщить("Для документа " + Реализация + " не удалось установить признак 'Была печать'. Не удалось выполнить запись документа!");
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПечатьТорг12 Тогда 
			
			ПечДокТорг12 = ДокОбъект.ПечатьТОРГ12();
			УниверсальныеМеханизмы.НапечататьДокумент(ПечДокТорг12, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
			
		КонецЕсли;
		
		Если НЕ Константы.ПечататьТоварныйЧекСУПД.Получить() Тогда 					
			
			Если ПечатьСчета Тогда 
				
				ПечДокСчет = ДокОбъект.НовыйСчет();
				УниверсальныеМеханизмы.НапечататьДокумент(ПечДокСчет, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
				
			КонецЕсли;
			
		КонецЕсли;				
		
		Если ПечатьКорректСчФк И Константы.ДатаОтсчетаНачалаПечатиКорректСчФк.Получить() <> Дата('00010101') Тогда
			
			//+Гавриленков В. 22.05.2026 #
			//ТолькоОтметка = ЗначениеЗаполнено(Реализация.Грузополучатель.DS_Подразделение_ID) ИЛИ ЗначениеЗаполнено(Реализация.ДоговорКонтрагента.DS_Подразделение_ID); 
			//РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати, ТолькоОтметка);
			
			//+Сёмин Р.И. 08.09.2026 #UT10-6028
			//РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати);
			РаспечататьКорректированыеСчетФактуры(ДокОбъект.Грузополучатель, СтруктураДляПечати, ДокОбъект.Грузополучатель.НеПечататьУКД);
			//-Сёмин Р.И. 08.09.2026 #UT10-6028
			
			//-Гавриленков В. 22.05.2026 #
			МассивТабДокКорректСчФк = ПолучитьКорректировочныеСчетаФактурыДляОтправки(ДокОбъект.Грузополучатель);	
			
		КонецЕсли; 			
		
		Если ПечатьТТН И Константы.ВключитьПечатьТТН.Получить() = Истина И ГрузополучательПризнакПечатиТТН = Истина Тогда
			РаспечататьТТН(ДокОбъект, СтруктураДляПечати);				
		КонецЕсли; 
		
		Если ПечатьАктРасчетаПремииПоРекламе Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КорректировкаДолгаСуммыДолга.Ссылка
			|ИЗ
			|	Документ.КорректировкаДолга.СуммыДолга КАК КорректировкаДолгаСуммыДолга
			|ГДЕ
			|	КорректировкаДолгаСуммыДолга.ДокументРасчетовСКонтрагентом = &ДокументРасчетовСКонтрагентом
			|	И КорректировкаДолгаСуммыДолга.ВидЗадолженности = &ВидЗадолженности
			|	И КорректировкаДолгаСуммыДолга.Ссылка.Проведен
			|	И КорректировкаДолгаСуммыДолга.Ссылка.КорректировкаЗадолженностиПоПремии";
			
			Запрос.УстановитьПараметр("ВидЗадолженности", Перечисления.ВидыЗадолженности.Дебиторская);
			Запрос.УстановитьПараметр("ДокументРасчетовСКонтрагентом", Реализация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				КорректировкаОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				ПечДокАкт = КорректировкаОбъект.ПечатьАктаРасчетаПремии();
				УниверсальныеМеханизмы.НапечататьДокумент(ПечДокАкт, 2, СразуНаПринтер, 
				ОбщегоНазначения.СформироватьЗаголовокДокумента(КорректировкаОбъект), КорректировкаОбъект.Ссылка);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ДокОбъект.ТаксиДоставка Тогда
			
			ПечДокЧек = ДокОбъект.ПечатьАктаПриемаПередачиТаксиДоставка();
			УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЧек, 2, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);				
			
		КонецЕсли;			
		
		Если ОтправлятьПоПочте Тогда 
			
			ТекГрузополучатель = Реализация.Грузополучатель; 
			
			Если ЗначениеЗаполнено(ТекГрузополучатель) И 
				(ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте ИЛИ ТекГрузополучатель.ОтправлятьСчетПоПочте
				ИЛИ ТекГрузополучатель.ОтправлятьТорг12ПоПочте) Тогда
				
				АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(ТекГрузополучатель);
				
				Если Не ПустаяСтрока(АдресЭлПочты)  Тогда
					
					СтруктураДляОтравки = СформироватьСтруктуруДляОтправкеПоПочте(АдресЭлПочты,
					ТекГрузополучатель,
					СчетФактура, 
					Реализация, 
					ПечатьУПД, 
					Истина, 
					ПечатьТорг12,
					МассивТабДокКорректСчФк); 
					
					ДополнитьСтруктуруДляОтправкиПоСобытию(СтруктураДляОтравки, "Печать комплекта документов", ТекГрузополучатель);
					
					Если ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте Тогда
						
						Если ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте И ПечатьУПД 
							И ТекГрузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда
							МСК.ОтправитьПечатныеФормыПоЭП(Реализация); 					
						КонецЕсли;							
						
						Если НЕ СтруктураДляОтравки.ОтправлятьСчетФактуруПоПочте ИЛИ НЕ ПечатьУПД Тогда 
							ПечДокСФ = Неопределено;
						Иначе
							
							Если ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.УПД 
								И ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.УПДИКодПроизводителя 
								И ТекГрузополучатель.ВидОтправляемойСФ <> Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда 
								
								ТекОбъектСФ = СчетФактура.ПолучитьОбъект();
								ПечДокСФ = ТекОбъектСФ.ПечатьСчетФактуру(СчетФактура); 		
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;

					Если СтруктураДляОтравки.ОтправлятьСчетПоПочте Тогда  
						ПечДокСчет = ДокОбъект.НовыйСчет();
					Иначе
						ПечДокСчет = Неопределено;
					КонецЕсли;
					
					Если НЕ СтруктураДляОтравки.ОтправлятьТорг12ПоПочте ИЛИ НЕ ПечатьТорг12 Тогда 
						ПечДокТорг12 = Неопределено;
					КонецЕсли;
					
					КодОтправки = ОправитьПоЭлектроннойПочте(СтруктураДляОтравки, ПечДокСФ, ПечДокСчет, Истина, ПечДокТорг12);
					
					Если КодОтправки <> "" Тогда 
						Сообщить(КодОтправки); 
					Иначе
						Если СтруктураДляОтравки.Свойство("МассивТабДокКорректСчФк") Тогда
							
							Если НЕ СтруктураДляОтравки.МассивТабДокКорректСчФк.Количество() = 0 Тогда
								
								Для Каждого СтрокаЗаголовковУКД Из СтруктураДляОтравки.МассивТабДокКорректСчФк Цикл  
									
									РСМенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
									РСМенеджерЗаписи.Объект = СтрокаЗаголовковУКД.Ключ.Ссылка;
									РСМенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ОтправленоПоЭлПочте;		
									РСМенеджерЗаписи.Значение = Истина;
									РСМенеджерЗаписи.Записать(Истина);										
									
								КонецЦикла;			
								
							КонецЕсли;		
							
						КонецЕсли;	
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЕстьКорректировкиСборки Тогда				
		
		МассивКорректировокСборок = СформироватьКорректировкиДляВыводаНаПечать(Реализация);				
		
		Для Каждого КорректировкаСборки Из МассивКорректировокСборок Цикл					
			
			КорректировкаОбъект = КорректировкаСборки.ПолучитьОбъект();
			
			Если ПечатьКорректировкиСборки Тогда
				КорректировкаОбъект.Печать("ЗаданиеНаРазбор", 2, СразуНаПринтер, Ложь, ОтветственныйКорректировкаСборки);
			Иначе
				КорректировкаОбъект.Печать("ЗаданиеНаРазбор", 1, Ложь, Ложь, ОтветственныйКорректировкаСборки);
			КонецЕсли;
			
		КонецЦикла;				
		
	КонецЕсли;
	
	Если ПечатьТранзитЧерезТомилино Тогда   	
		
		ПечДокТранзитЧерезТомилино = ДокОбъект.ПечатьТранзитЧерезТомилино();
		УниверсальныеМеханизмы.НапечататьДокумент(ПечДокТранзитЧерезТомилино, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);	
		
	КонецЕсли;	
	
	Если ПечатьЗаявкиНаВозврат Тогда				
		
		МассивЗаявокНаВозврат = СформироватьЗаявкиНаВозвратДляВыводаНаПечать(Реализация);				
		
		Для Каждого ЗаявкаНаВозврат Из МассивЗаявокНаВозврат Цикл					
			
			ЗаявкаНаВозвратОбъект = ЗаявкаНаВозврат.ПолучитьОбъект();
			
			Попытка
				
				Если Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда 
					ЗаявкаНаВозвратОбъект.Печать("ЗаявлениеНаВозвратФизЛица", 1, СразуНаПринтер);
				Иначе 
					ЗаявкаНаВозвратОбъект.Печать("Претензия", 2, СразуНаПринтер);					
				КонецЕсли;

				ЗаявкаНаВозвратОбъект.Печать("Возврат", 2, СразуНаПринтер);
				
				НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Объект.Установить(ЗаявкаНаВозвратОбъект.Ссылка);
				НаборЗаписей.Отбор.Категория.Установить(Справочники.КатегорииОбъектов.РаспечатаноПриОтгрузке);
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = ЗаявкаНаВозвратОбъект.Ссылка;
				Запись.Категория = Справочники.КатегорииОбъектов.РаспечатаноПриОтгрузке;  
				
				НаборЗаписей.Записать();
				
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;				
		
	КонецЕсли;
	
	//+Сёмин Р. 24.02.2026 #UT10-5691
	Если ПечатьЗаявкиНаПеревозкуГрузов Тогда
		
		ПечДокЗаявкаНаПеревозкуГрузов = ДокОбъект.ПечатьЗаявкиНаПеревозкуГрузов();
		УниверсальныеМеханизмы.НапечататьДокумент(ПечДокЗаявкаНаПеревозкуГрузов, 1, СразуНаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);
		
	КонецЕсли;
	//-Сёмин Р. 24.02.2026 #UT10-5691

КонецФункции

Функция РаспечататьТТН(ДокОбъект , СтруктураДляПечати) Экспорт
	
	ПечДокТТН = ДокОбъект.ПечатьТранспортнойНакладной();
	
	Если СтруктураДляПечати.СразуНаПринтер Тогда
		
		Для Х = 1 по СтруктураДляПечати.КолвоЭкзТТН Цикл
			
			УниверсальныеМеханизмы.НапечататьДокумент(ПечДокТТН, 1, СтруктураДляПечати.СразуНаПринтер, 
			ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);					
			
		КонецЦикла;				  
	Иначе
		УниверсальныеМеханизмы.НапечататьДокумент(ПечДокТТН, 1, СтруктураДляПечати.СразуНаПринтер, 
		ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект), ДокОбъект.Ссылка);							
	КонецЕсли; 
	
КонецФункции

Функция РаспечататьКорректированыеСчетФактуры(Грузополучатель, СтруктураДляПечати, ТолькоОтметкаПечати = Ложь) Экспорт
	
	Запрос = Новый Запрос;		
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО СчетФактураВыданныйДокументыОснования.Ссылка = ЗначенияСвойствОбъектов.Объект
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СчетФактураВыданныйДокументыОснования.Ссылка.ДокументОснование) = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации)
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Дата >= &Дата
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование.Грузополучатель = &Грузополучатель
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|	И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Распечатано)
	|				И ЗначенияСвойствОбъектов.Значение = ЛОЖЬ
	|			ИЛИ ЗначенияСвойствОбъектов.Объект ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	
	//+Гавриленков В. 22.05.2026 #
	//Запрос.УстановитьПараметр("Дата", Константы.ДатаОтсчетаНачалаПечатиКорректСчФк.Получить());
	Запрос.УстановитьПараметр("Дата", Макс(Константы.ДатаОтсчетаНачалаПечатиКорректСчФк.Получить(), ДобавитьМесяц(ТекущаяДата(), -1)));
	//-Гавриленков В. 22.05.2026 #
	Запрос.УстановитьПараметр("Грузополучатель", Грузополучатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пока РезультатЗапроса.Следующий() Цикл                                            
		
		Если НЕ ТолькоОтметкаПечати Тогда 
			
			ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();			
			
			ДанныеДляПечати = Неопределено;
			УчетнаяПолитика = Неопределено;		
			
			ВерсияПостановления = УчетНДС.ПолучитьВерсиюПостановления(ДокОбъект.Дата);		
			Корректировочный = ДокОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
			
			ДокОбъект.СобратьДанныеДляПечати(ДанныеДляПечати, УчетнаяПолитика);
			
			Если ВерсияПостановления = 2 Тогда			
				
				Если Корректировочный Тогда
					
					Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда
						ТабДокумент = ДокОбъект.ПечатьУниверсальногоКорректировочногоДокумента();
					Иначе
						ТабДокумент = ДокОбъект.ПечатьКорректировочногоСчетаФактуры1137(ДанныеДляПечати); 
					КонецЕсли;
					
				Иначе
					ТабДокумент = ДокОбъект.ПечатьСчетаФактуры1137(ДанныеДляПечати);
				КонецЕсли;
				
			Иначе
				
				Если Корректировочный Тогда
					
					Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда
						ТабДокумент = ДокОбъект.ПечатьУниверсальногоКорректировочногоДокумента();
					Иначе
						ТабДокумент = ДокОбъект.ПечатьКорректировочногоСчетаФактуры(ДанныеДляПечати);
					КонецЕсли;
					
				Иначе
					ТабДокумент  = ДокОбъект.ПечатьСчетаФактуры1137(ДанныеДляПечати);
				КонецЕсли;			
				
			КонецЕсли;		
			
			КолЭкземпляров = ?(Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить(), 2, 1); 
			
			Если СтруктураДляПечати.СразуНаПринтер Тогда
				
				УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 
				КолЭкземпляров,                       
				СтруктураДляПечати.СразуНаПринтер, 
				ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект),
				ДокОбъект.Ссылка); 
				
			Иначе
				
				УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 
				КолЭкземпляров,                       
				СтруктураДляПечати.СразуНаПринтер, 
				ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект),
				ДокОбъект.Ссылка);
				
			КонецЕсли; 
			
		КонецЕсли;   
		
		РСМенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
		РСМенеджерЗаписи.Объект = РезультатЗапроса.Ссылка;
		РСМенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.Распечатано;		
		РСМенеджерЗаписи.Значение = Истина;			
		РСМенеджерЗаписи.Записать(Истина);
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);   
	
	Возврат Истина;
	
КонецФункции

Функция  ПолучитьКорректировочныеСчетаФактурыДляОтправки(Грузополучатель)
	
	МассивТабДок = Новый Соответствие;   
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер КАК Номер,
	|	ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ) КАК Значение
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО СчетФактураВыданныйДокументыОснования.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ОтправленоПоЭлПочте))
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СчетФактураВыданныйДокументыОснования.Ссылка.ДокументОснование) = ЗНАЧЕНИЕ(Документ.КорректировкаРеализации)
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Дата >= &Дата
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование.Грузополучатель = &Грузополучатель
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование.Грузополучатель.ОтправлятьСчетФактуруПоПочте = ИСТИНА
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыВыставленного.Корректировочный)
	|	И ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЛОЖЬ) = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	
	Запрос.УстановитьПараметр("Дата", Константы.ДатаОтсчетаНачалаПечатиКорректСчФк.Получить());
	Запрос.УстановитьПараметр("Грузополучатель", Грузополучатель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл                                            
		
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();			
		ДанныеДляПечати = Неопределено;
		УчетнаяПолитика     = Неопределено;		
		ВерсияПостановления = УчетНДС.ПолучитьВерсиюПостановления(ДокОбъект.Дата);		
		
		Корректировочный = ДокОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный;
		ДокОбъект.СобратьДанныеДляПечати(ДанныеДляПечати, УчетнаяПолитика);
		
		Если ВерсияПостановления = 2 Тогда			
			
			Если Корректировочный Тогда
				
				Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда
					ТабДокумент = ДокОбъект.ПечатьУниверсальногоКорректировочногоДокумента();
				Иначе
					ТабДокумент = ДокОбъект.ПечатьКорректировочногоСчетаФактуры1137(ДанныеДляПечати); 
				КонецЕсли;
				
			Иначе
				ТабДокумент = ДокОбъект.ПечатьСчетаФактуры1137(ДанныеДляПечати);
			КонецЕсли;
			
		Иначе
			
			Если Корректировочный Тогда
				
				Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда
					ТабДокумент = ДокОбъект.ПечатьУниверсальногоКорректировочногоДокумента();
				Иначе
					ТабДокумент = ДокОбъект.ПечатьКорректировочногоСчетаФактуры(ДанныеДляПечати);
				КонецЕсли;
				
			Иначе
				ТабДокумент  = ДокОбъект.ПечатьСчетаФактуры1137(ДанныеДляПечати);
			КонецЕсли;			
			
		КонецЕсли;		
		
		МассивТабДок.Вставить(ДокОбъект, ТабДокумент);
		
	КонецЦикла; 
	
	Возврат МассивТабДок;
	
КонецФункции

Функция СформироватьСтруктуруДляОтправкеПоПочте(АдресЭлПочты,
	Грузополучатель, 
	ДокументОснование, 
	Реализация, 
	ПечатьСФ, 
	ПечатьСчета, 
	ПечатьТорг12, 
	МассивТабДокКорректСчФк = Неопределено) Экспорт
	
	Город = Константы.Город.Получить();
	СтруктураДляОтравки = Новый Структура;
	СтруктураДляОтравки.Вставить("ЕМэйл", АдресЭлПочты);
	
	Если НЕ Грузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда
		СтруктураДляОтравки.Вставить("ОтправлятьСчетФактуруПоПочте", Грузополучатель.ОтправлятьСчетФактуруПоПочте);
	Иначе
		СтруктураДляОтравки.Вставить("ОтправлятьСчетФактуруПоПочте", Ложь);
	КонецЕсли;
	
	СтруктураДляОтравки.Вставить("ОтправлятьСчетПоПочте", Грузополучатель.ОтправлятьСчетПоПочте);

	// СФ и УПД
	Если НЕ  Грузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда
		
		НазваниеСФ = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокументОснование);
		НазваниеСФ = СтрЗаменить(НазваниеСФ, "г.", "г");
		
		Если Грузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.УПД 
		 ИЛИ Грузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.УПДИКодПроизводителя Тогда
			
			Если ДокументОснование.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный Тогда 
				
				Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда
					ЗаголовокДокумента = "УКД";
				Иначе 
					ЗаголовокДокумента = "Счет-фактура корректировочный";	
				КонецЕсли; 
				
			Иначе
				ЗаголовокДокумента = "";
			КонецЕсли;
			
			НазваниеСФ = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокументОснование, ЗаголовокДокумента);
			НазваниеСФ = СтрЗаменить(НазваниеСФ, "г.", "г");   
			
		КонецЕсли;
		
		НазваниеСФ = НазваниеСФ + " " + Город;
		
		Если Грузополучатель.ФорматExcel = Перечисления.ФорматExcel.Excel2007 Тогда 
			
			СтруктураДляОтравки.Вставить("ЗаголовокФайла", КаталогВременныхФайлов() + СтрЗаменить(НазваниеСФ, "/", "-") + ".xlsx");
			СтруктураДляОтравки.Вставить("ТипФайлаТабДок", ТипФайлаТабличногоДокумента.XLSX);
			
		Иначе 
			
			СтруктураДляОтравки.Вставить("ЗаголовокФайла", КаталогВременныхФайлов() + СтрЗаменить(НазваниеСФ, "/", "-") + ".xls");
			СтруктураДляОтравки.Вставить("ТипФайлаТабДок", ТипФайлаТабличногоДокумента.XLS);
			
		КонецЕсли;
		
	КонецЕсли; 
	

	// Счет
	СтруктураДляОтравки.Вставить("ОтправлятьСчетПоПочте", Грузополучатель.ОтправлятьСчетПоПочте);
	
	НазваниеСчета = ОбщегоНазначения.СформироватьЗаголовокДокумента(Реализация, "Счет");
	НазваниеСчета = СтрЗаменить(НазваниеСчета, "г.", "г");
	
	Если Грузополучатель.ФорматExcelдляСчета = Перечисления.ФорматExcel.Excel2007 Тогда 
		
		СтруктураДляОтравки.Вставить("ЗаголовокФайлаСчет", КаталогВременныхФайлов()+СтрЗаменить(НазваниеСчета, "/", "-") + ".xlsx");
		СтруктураДляОтравки.Вставить("ТипФайлаСчетТабДок", ТипФайлаТабличногоДокумента.XLSX);
		
	Иначе 
		
		СтруктураДляОтравки.Вставить("ЗаголовокФайлаСчет", КаталогВременныхФайлов()+СтрЗаменить(НазваниеСчета, "/", "-") + ".xls");
		СтруктураДляОтравки.Вставить("ТипФайлаСчетТабДок", ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;
	
	//Торг12
	СтруктураДляОтравки.Вставить("ОтправлятьТорг12ПоПочте", Грузополучатель.ОтправлятьТорг12ПоПочте);
	
	НазваниеТорг12 = ОбщегоНазначения.СформироватьЗаголовокДокумента(Реализация, "Торг12");
	НазваниеТорг12 = СтрЗаменить(НазваниеТорг12, "г.", "г");
	
	Если Грузополучатель.ФорматExcelдляСчета = Перечисления.ФорматExcel.Excel2007 Тогда 
		
		СтруктураДляОтравки.Вставить("ЗаголовокФайлаТорг12", КаталогВременныхФайлов()+СтрЗаменить(НазваниеТорг12, "/", "-") + ".xlsx");
		СтруктураДляОтравки.Вставить("ТипФайлаТорг12ТабДок", ТипФайлаТабличногоДокумента.XLSX);
		
	Иначе 
		
		СтруктураДляОтравки.Вставить("ЗаголовокФайлаТорг12", КаталогВременныхФайлов()+СтрЗаменить(НазваниеТорг12, "/", "-") + ".xls");
		СтруктураДляОтравки.Вставить("ТипФайлаТорг12ТабДок", ТипФайлаТабличногоДокумента.XLS);
		
	КонецЕсли;	

	СтруктураДляОтравки.Вставить("ОтправлятьТоварныйЧекПоПочте",Ложь);
	
	Если Грузополучатель.ОтправлятьСчетФактуруПоПочте И ЗначениеЗаполнено(Реализация) 
	   И (Реализация.ДоговорКонтрагента.РозничнаяПродажа ИЛИ Реализация.ДоговорКонтрагента.ЛицевойСчет) Тогда
		
		СтруктураДляОтравки.ОтправлятьТоварныйЧекПоПочте = Истина;   
		
		НазваниеТоварныйЧек = ОбщегоНазначения.СформироватьЗаголовокДокумента(Реализация, "Товарный чек");
		НазваниеТоварныйЧек = СтрЗаменить(НазваниеТоварныйЧек, "г.", "г");
		
		СтруктураДляОтравки.Вставить("ЗаголовокФайлаТоварныйЧек", КаталогВременныхФайлов()+СтрЗаменить(НазваниеТоварныйЧек, "/", "-") + ".xls");
		СтруктураДляОтравки.Вставить("ТипФайлаТоварныйЧек", ТипФайлаТабличногоДокумента.XLS);
		
		СтруктураДляОтравки.ОтправлятьСчетФактуруПоПочте = Ложь;		
		
	КонецЕсли;
	
	// общая часть
	ТемаПисьма = "";
	СообщениеОтправки = "";
	СтрокаОтправкиУКД = "";
	
	Если НЕ Грузополучатель.ВидОтправляемойСФ = Перечисления.ВидСчетФактурыДляКонтрагента.ИзСохраненныхНастроек Тогда
		
		Если Грузополучатель.ОтправлятьСчетФактуруПоПочте И ПечатьСФ Тогда
			
			ТемаПисьма = НазваниеСФ;
			СообщениеОтправки = НазваниеСФ + " для контрагента " + Грузополучатель + " отправлена."
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Грузополучатель.ОтправлятьСчетПоПочте И ПечатьСчета Тогда 
		
		ТемаПисьма = ?(ТемаПисьма = "", НазваниеСчета, ТемаПисьма + "; " + НазваниеСчета);
		СообщениеОтправки = ?(СообщениеОтправки = "", 
		НазваниеСчета + " для контрагента " + Грузополучатель + " отправлен.", 
		"Документы : " + НазваниеСФ + " и " + НазваниеСчета + " для контрагента " + Грузополучатель + " отправлены.");
		
	КонецЕсли;
	
	Если Грузополучатель.ОтправлятьТорг12ПоПочте И ПечатьТорг12 Тогда 
		
		ТемаПисьма = ?(ТемаПисьма = "", НазваниеТорг12, ТемаПисьма + "; " +НазваниеТорг12);
		СообщениеОтправки = ?(СообщениеОтправки = "", 
		НазваниеТорг12 + " для контрагента " + Грузополучатель+ " отправлен.", 
		СообщениеОтправки + "; " + НазваниеТорг12 + " для контрагента " + Грузополучатель + " отправлена.");
		
	КонецЕсли;
	
	Если СтруктураДляОтравки.ОтправлятьТоварныйЧекПоПочте Тогда
		
		ТемаПисьма = ?(ТемаПисьма = "", НазваниеТоварныйЧек, ТемаПисьма + "; " + НазваниеТоварныйЧек);
		СообщениеОтправки = ?(СообщениеОтправки = "", 
		НазваниеТоварныйЧек + " для контрагента " + Грузополучатель + " отправлен.", 
		СообщениеОтправки + "; " + НазваниеТоварныйЧек + " для контрагента " + Грузополучатель + " отправлен.");
		
	КонецЕсли;

	
	Если Не МассивТабДокКорректСчФк = Неопределено И МассивТабДокКорректСчФк.Количество() > 0 Тогда
		
		СоответствиеКорректировочныхСчФактур = Новый Соответствие;   
		
		Для Каждого СтрокаМассива Из МассивТабДокКорректСчФк Цикл
			
			Если Константы.ИспользоватьУКДВместоКорректировочногоСчетаФактуры.Получить() Тогда 
				НазваниеСФ = "УКД № " + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаМассива.Ключ) + " от " + Формат(СтрокаМассива.Ключ.Дата, "ДФ='дд ММММ гггг'") + " г";
			Иначе
				НазваниеСФ = "Счет-фактура корректировочный № " + ОбщегоНазначения.ПолучитьНомерНаПечать(СтрокаМассива.Ключ) 
				+ " от " + Формат(СтрокаМассива.Ключ.Дата, "ДФ='дд ММММ гггг'") + " г"; 
			КонецЕсли;
			
			НазваниеСФ = НазваниеСФ + " " + Город;
			СтрокаОтправкиУКД = ?(СтрокаОтправкиУКД = "", НазваниеСФ,СтрокаОтправкиУКД + ";" + НазваниеСФ);
			
			Если Грузополучатель.ФорматExcelдляСчета = Перечисления.ФорматExcel.Excel2007 Тогда 
				ПутьФайлаУКД = КаталогВременныхФайлов() + СтрЗаменить(НазваниеСФ, "/", "-") + ".xlsx";	
			Иначе
				ПутьФайлаУКД = КаталогВременныхФайлов() + СтрЗаменить(НазваниеСФ, "/", "-") + ".xls";
			КонецЕсли;
			
			СоответствиеКорректировочныхСчФактур.Вставить(ПутьФайлаУКД, СтрокаМассива.Значение);;
			
		КонецЦикла; 
		
		Если Грузополучатель.ФорматExcelдляСчета = Перечисления.ФорматExcel.Excel2007 Тогда 
			СтруктураДляОтравки.Вставить("ТипФайлаУКД", ТипФайлаТабличногоДокумента.XLSX);
		Иначе 
			СтруктураДляОтравки.Вставить("ТипФайлаУКД", ТипФайлаТабличногоДокумента.XLS);
		КонецЕсли;
		
		СтруктураДляОтравки.Вставить("ЗаголовкиФайловУКД", СоответствиеКорректировочныхСчФактур);
		СтруктураДляОтравки.Вставить("МассивТабДокКорректСчФк", МассивТабДокКорректСчФк);   
		
		ТемаПисьма = ?(ТемаПисьма = "", СтрокаОтправкиУКД, ТемаПисьма + ";" + СтрокаОтправкиУКД); 
		СообщениеОтправки = ?(СообщениеОтправки = "", 
		СтрокаОтправкиУКД + " для контрагента " + Грузополучатель + " отправлен.", 
		СообщениеОтправки + "; " +СтрокаОтправкиУКД); 		
		
	КонецЕсли;
	
	СтруктураДляОтравки.Вставить("ТемаПисьма",	ТемаПисьма);
	СтруктураДляОтравки.Вставить("Сообщение",	СообщениеОтправки); 
	
	Возврат СтруктураДляОтравки; 
	
КонецФункции

Функция ЗакрытьОткрытуюФорму() Экспорт
	
	Если Не ЭтоОбособленноеПодразделение() тогда
		
		Сообщить("Обработка не предназначена для вашей базы!");
		Возврат Истина;
		
	КонецЕсли;	
	
	Возврат Ложь;
	
КонецФункции	

Функция ЗафиксироватьПечатьДокумента(ДокументПечати,МакетПечати,СинонимМакета) Экспорт 
	
	НоваяЗапись = РегистрыСведений.НапечатанныеДокументы.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Документ = ДокументПечати;
	НоваяЗапись.Макет = МакетПечати;
	НоваяЗапись.СинонимМакета = СинонимМакета;
	НоваяЗапись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НоваяЗапись.ДатаПечати = ТекущаяДата();
	
	НоваяЗапись.Записать();
	
КонецФункции	

Функция ПроверитьПараметрыПодключения() Экспорт 
	
	КластерСерверов = СокрЛП(Константы.КластерСерверов.Получить());
	ИмяИБ = СокрЛП(Константы.ИмяИБВКластере.Получить());
	
	Возврат ВРег(СтрокаСоединенияИнформационнойБазы()) = ВРег("Srvr=""" + КластерСерверов + """;Ref=""" + ИмяИБ + """;"); 

КонецФункции

Функция ВычиститьНепечатныеСимволы(СтрокаАнализа) Экспорт 
	
	СтрокаАнализа = СтрЗаменить(СтрокаАнализа, Символы.ВТаб, "");
	СтрокаАнализа = СтрЗаменить(СтрокаАнализа, Символы.Таб, "");
	
	Возврат СтрокаАнализа;

КонецФункции

Функция ЭтоОбособленноеПодразделение() Экспорт
	
	ТекБаза = Константы.База.Получить();
	
	Если  ТекБаза = Перечисления.НазваниеБазы.Самара ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Владимир ИЛИ
		ТекБаза = Перечисления.НазваниеБазы.Рязань ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Ярославль ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Тула ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Калуга ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Молодогвардейская ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.ЮГ ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Север ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Тверь ИЛИ
		ТекБаза = Перечисления.НазваниеБазы.Восток ИЛИ 
		ТекБаза = Перечисления.НазваниеБазы.Ростов Тогда 
		Возврат Истина;
		
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ЭтоОбособленноеПодразделениеОтдельногоЮрЛица() Экспорт
	
	ТекБаза = Константы.База.Получить();
	
	Если ТекБаза = Перечисления.НазваниеБазы.НабережныеЧелны Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции

Функция ЗаполнитьОстатокВДокументе(ОбъектДокумент)  Экспорт
	
	Для каждого Стр Из ОбъектДокумент.Товары Цикл
		
		Стр.СвободныйОстаток = 0;
		Стр.ВЗаказе = 0;
		
	КонецЦикла;
	
	ТзТовары = ОбъектДокумент.Товары.Выгрузить(, "НомерСтроки,Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОстатков,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаНоменклатура.Номенклатура
	|					ИЗ
	|						ТаблицаНоменклатура КАК ТаблицаНоменклатура)
	|				И Склад В
	|					(ВЫБРАТЬ
	|						Склады.Ссылка
	|					ИЗ
	|						Справочник.Склады КАК Склады
	|					ГДЕ
	|						Склады.ИспользоватьВЗаполненииСвободногоОстаткаВДокументахПоступления)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&ДатаОстатков,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ТаблицаНоменклатура.Номенклатура
	|						ИЗ
	|							ТаблицаНоменклатура КАК ТаблицаНоменклатура)
	|					И Склад В
	|						(ВЫБРАТЬ
	|							Склады.Ссылка
	|						ИЗ
	|							Справочник.Склады КАК Склады
	|						ГДЕ
	|							Склады.ИспользоватьВЗаполненииСвободногоОстаткаВДокументахПоступления)) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0";
	
	Запрос.УстановитьПараметр("ТЗ", ТзТовары);
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(ОбъектДокумент.МоментВремени(), ВидГраницы.Включая));
	
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрТЧ Из ТаблицаОстатков Цикл
		
		ОтборПоНоменклатуре = Новый Структура("Номенклатура", СтрТЧ.Номенклатура);
		НайденныеСтроки = ТзТовары.НайтиСтроки(ОтборПоНоменклатуре);
		
		Если НайденныеСтроки <> Неопределено Тогда 
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ОбъектДокумент.Товары[НайденнаяСтрока.НомерСтроки - 1].СвободныйОстаток = СтрТЧ.Остаток;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0)) КАК РазмещеноБезЗаказаПокупателя
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблицаНоменклатура.Номенклатура
	|				ИЗ
	|					ТаблицаНоменклатура КАК ТаблицаНоменклатура)) КАК ЗаказыПоставщикамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаНоменклатура.Номенклатура
	|					ИЗ
	|						ТаблицаНоменклатура КАК ТаблицаНоменклатура)) КАК РазмещениеЗаказовПокупателейОстатки
	|		ПО ЗаказыПоставщикамОстатки.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ТЗ", ТзТовары);
	Запрос.УстановитьПараметр("ДатаОстатков", Новый Граница(ОбъектДокумент.МоментВремени(), ВидГраницы.Включая));
	
	
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрТЧ Из ТаблицаОстатков Цикл
		
		ОтборПоНоменклатуре = Новый Структура("Номенклатура", СтрТЧ.Номенклатура);
		НайденныеСтроки = ТзТовары.НайтиСтроки(ОтборПоНоменклатуре);
		
		Если НайденныеСтроки <> Неопределено Тогда 
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ОбъектДокумент.Товары[НайденнаяСтрока.НомерСтроки - 1].ВЗаказе = СтрТЧ.РазмещеноБезЗаказаПокупателя;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции // ЗаполнитьОстатокВДокументе()

Процедура СоздатьИОтправитьАкт(ТекАкт, ТекКонтрагент, АдресЭлектроннойПочты, ВсегоАктов = 0, НомерТекущегоАкта = 0) Экспорт 
	
	ТекАктОбъект = 	ТекАкт.ПолучитьОбъект();
	
	УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.ДляСверки;
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Если АдресЭлектроннойПочты = "" Тогда 
		АдресЭлектроннойПочты = МСК.ПолучитьЭлектронныйАдрес(ТекКонтрагент);    
	КонецЕсли;
	
	//!!!!!!!!!!!!!!!!!!!
	//АдресЭлектроннойПочты = "MakarovaMarina@list.ru";	
	//АдресЭлектроннойПочты = "svetlov_dn@moskvorechie.ru";
	
	
	Если  АдресЭлектроннойПочты <> "" Тогда     
		
		ПечатныйДокумент = ТекАктОбъект.ПечатьАктаСверки();
		
		Почта = Новый ИнтернетПочта; 
		УдалосьПодключиться = Ложь;
		
		Попытка
			
			Почта.Подключиться(Профиль);
			УдалосьПодключиться = Истина;
			
		Исключение
		КонецПопытки;
		
		Если НЕ УдалосьПодключиться Тогда 
			
			Попытка
				
				Почта.Подключиться(Профиль);
				УдалосьПодключиться = Истина;
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Если НЕ УдалосьПодключиться Тогда 
			
			Попытка
				
				Почта.Подключиться(Профиль);
				УдалосьПодключиться = Истина;
				
			Исключение
				
				ТекстСообщения = "К почтовому серверу подключиться не удалось!";
				#Если Клиент Тогда
					Сообщить(ТекстСообщения);
				#Иначе
					ЗаписьЖурналаРегистрации("ОбработкаКонтрольИОтправкаАктовСверкиВзаиморасчетов", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
				#КонецЕсли 
				
				Возврат;
				
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	ДатаНачалаБезВремени = Формат(ТекАкт.ДатаНачала, "ДФ=dd.MM.yyyy");
	ДатаОкончанияБезВремени = Формат(ТекАкт.ДатаОкончания, "ДФ=dd.MM.yyyy");
	
	ЗаголовокФайла = "Акт_сверки_С_" + СтрЗаменить(ДатаНачалаБезВремени, ".", "_") + "_по_" + СтрЗаменить(ДатаОкончанияБезВремени, ".", "_") + ".xlsx";
	
	ПечатныйДокумент.Записать(КаталогВременныхФайлов() + ЗаголовокФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = "Сверка взаиморасчетов с ООО Москворечье Трейдинг с " + ДатаНачалаБезВремени+ " по " +ДатаОкончанияБезВремени;
	
	Если ТекАкт.ДатаНачала = НачалоМесяца(ТекАкт.ДатаНачала) И ТекАкт.ДатаОкончания = КонецМесяца(ТекАкт.ДатаОкончания) Тогда 
		
		// сверка за месяц
		ТекстСообщенияОтправки = "Уважаемый клиент!" + Символы.ПС +
		"Вам отправлен акт сверки взаиморасчетов за месяц с " + ДатаНачалаБезВремени+
		" по " + ДатаОкончанияБезВремени + "." + Символы.ПС +
		"Пожалуйста, направьте ответ на адрес " + СокрЛП(УчетнаяЗапись.АдресЭлектроннойПочты) + " согласны или не согласны с данными в документе. " + Символы.ПС +
		"Заранее спасибо," + Символы.ПС + 
		"Бухгалтерия ООО Москворечье-Трейдинг.";
		
	ИначеЕсли ТекАкт.ДатаНачала = НачалоМесяца(ТекАкт.ДатаНачала) И ТекАкт.ДатаОкончания = КонецКвартала(ТекАкт.ДатаНачала) Тогда 	
		
		// квартальная сверка
		ТекстСообщенияОтправки = "Уважаемый клиент!" + Символы.ПС +
		
		"Вам отправлен акт сверки взаиморасчетов за квартал с " + ДатаНачалаБезВремени+
		" по " + ДатаОкончанияБезВремени+ "." + Символы.ПС +
		"Пожалуйста, распечатайте документ и в случае согласия с данными поставьте печать и подпись. " + Символы.ПС +
		"Заранее спасибо," + Символы.ПС + 
		"Бухгалтерия ООО Москворечье-Трейдинг.";			
		
	Иначе
		
		// произвольные даты
		ТекстСообщенияОтправки = "Уважаемый клиент!" + Символы.ПС +
		"Вам отправлен акт сверки взаиморасчетов с " + ДатаНачалаБезВремени+
		" по " + ДатаОкончанияБезВремени+ "." + Символы.ПС +
		"Пожалуйста, направьте ответ на адрес " + СокрЛП(УчетнаяЗапись.АдресЭлектроннойПочты) + " согласны или не согласны с данными в документе. " + Символы.ПС +
		"Заранее спасибо," + Символы.ПС + 
		"Бухгалтерия ООО Москворечье-Трейдинг.";
		
	КонецЕсли;
	
	Сообщение.Тексты.Добавить(ТекстСообщенияОтправки, ТипТекстаПочтовогоСообщения.ПростойТекст);
	
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлектроннойПочты,";");  // ТекСтр.ЭлАдрес   "svetlov_dn@moskvorechie.ru"
	
	Для каждого ТекАдрес Из МассивАдресов Цикл
		Сообщение.Получатели.Добавить(ТекАдрес);    
	КонецЦикла;
	
	//Сообщение.Получатели.Добавить("makarova_mv@moskvorechie.ru"); 
	Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	Сообщение.Вложения.Добавить(КаталогВременныхФайлов() + ЗаголовокФайла, ТипФайлаТабличногоДокумента.XLSX);
	
	ОтправкаСостоялась = Ложь;
	
	Попытка
		
		Почта.Послать(Сообщение);
		ТекстСообщения = ?(НомерТекущегоАкта = 0, "", Строка(НомерТекущегоАкта) + " из ")+
		?(ВсегоАктов = 0, "", Строка(ВсегоАктов) + ": ")+
		"Отправлено письмо " + ТекКонтрагент + " на адрес " + АдресЭлектроннойПочты +
		" с актом сверки взаиморасчетов с " + ДатаНачалаБезВремени + " по " + ДатаОкончанияБезВремени + ".";
		
		Сообщить(ТекстСообщения);
		ОтправкаСостоялась = Истина;
		
	Исключение
	КонецПопытки;
	
	Сообщение.Получатели.Очистить();
	Сообщение.Вложения.Очистить();
	УдалитьФайлы(КаталогВременныхФайлов()+ЗаголовокФайла);
	
	// зафиксируем факт отправки
	Если ОтправкаСостоялась Тогда  
		
		НоваяЗапись = РегистрыСведений.РассылкаДокументов.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период 		= НачалоДня(ТекущаяДата());
		НоваяЗапись.Контрагент 	= ТекКонтрагент;
		НоваяЗапись.Документ 		= ТекАкт;
		НоваяЗапись.ТипРассылки 	= Перечисления.ТипыРассылокЭлектроннойПочты.АктСверкиВзаиморасчетов;
		НоваяЗапись.ВремяОтправки 	= ТекущаяДата();
		ТекстСообщения = "Отправлено письмо " + ТекКонтрагент + " на адрес " + АдресЭлектроннойПочты +
		" с актом сверки взаиморасчетов с " + ТекАкт.ДатаНачала + " по " + ТекАкт.ДатаОкончания + ".";
		НоваяЗапись.Комментарий 	= ТекстСообщения;	
		
		НоваяЗапись.Записать();		
		
	КонецЕсли;
	
КонецПроцедуры	

Функция  ЗавершитьОтправку(ТекГрузополучатель, ТекстТелаПисьма, ТекстСПеречнемЗаказов, ТекЗаказПокупателя, АдресЭлПочтыДляОтправки, ДокументРодитель)
	
	Если ТекГрузополучатель = "!!!" Тогда 
		Возврат Истина;
	КонецЕсли;
	
	Если ТекстТелаПисьма <> "" Тогда 
		
		ТекстТелаПисьма = ТекстТелаПисьма + "</table><p>С Уважением,<br>Компания «Москворечье-" + Константы.База.Получить() + "»</p>";
		
		// и добавим приветствие
		ТекстТелаПисьма = "<p>Уважаемый клиент!<br>Информация по Заказу(-ам) " + ТекстСПеречнемЗаказов + "</p>" + ТекстТелаПисьма;
		
		//отправляем
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "Информация о заказе № " + ТекстСПеречнемЗаказов;
		
		Почта = Новый ИнтернетПочта; 
		ОтправитьПочту = Истина;
		
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			
			ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Ошибка,,,
			"Не удалось подключиться к почтовому серверу!");
			ОтправитьПочту = Ложь;
			Возврат Ложь;
			
		КонецПопытки;
		
		Если ОтправитьПочту Тогда 
			
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочтыДляОтправки, ";");
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				
				Сообщение.Получатели.Добавить(ТекАдрес); 
				//Сообщение.Получатели.Добавить("MakarovaMarina@list.ru"); 
				//Сообщение.Получатели.Добавить("svetlov_dn@moskvorechie.ru");
			КонецЦикла;
			
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Тексты.Добавить(ТекстТелаПисьма,ТипТекстаПочтовогоСообщения.HTML);
			
			Попытка
				Почта.Послать(Сообщение);
			Исключение
				
				ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Ошибка,,,
				"Не удалось отправить письмо клиенту " + ТекГрузополучатель.Наименование+" по адресу " + АдресЭлПочтыДляОтправки+
				" с информацией об отказе по документу " + ТекЗаказПокупателя);
				
				Возврат Ложь;
			КонецПопытки;
			
			Сообщение.Получатели.Очистить();
			
			Почта.Отключиться();
			
			ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Информация,,,
			"Отправлено письмо клиенту " + ТекГрузополучатель.Наименование + " по адресу " + АдресЭлПочтыДляОтправки +
			" с информацией об отказе по документу " + ТекЗаказПокупателя);
			
			// зафиксируем факт отправки
			НЗРассылкаДокументов 				= РегистрыСведений.РассылкаДокументов.СоздатьМенеджерЗаписи();
			НЗРассылкаДокументов.Период 		= НачалоДня(ТекущаяДата());
			НЗРассылкаДокументов.Контрагент 	= ТекГрузополучатель;
			НЗРассылкаДокументов.Документ 		= ТекЗаказПокупателя;
			НЗРассылкаДокументов.ТипРассылки 	= Перечисления.ТипыРассылокЭлектроннойПочты.ЗакрытиеЗаказаПоставщику;
			НЗРассылкаДокументов.ВремяОтправки 	= ТекущаяДата();
			НЗРассылкаДокументов.Комментарий 	= "выполнено регламентным заданием по " + ДокументРодитель;	
			НЗРассылкаДокументов.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОтправкаПисемПоЭлектроннойПочте() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка писем по электронной почте", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДокументыКОтправке.ТипСообщения,
	|	ДокументыКОтправке.ДокументКОтправке,
	|	ДокументыКОтправке.АктуальноДо
	|ИЗ
	|	РегистрСведений.ДокументыКОтправке КАК ДокументыКОтправке";
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.АктуальноДо < ТекущаяДата() Тогда 
			
			Рег = РегистрыСведений.ДокументыКОтправке.СоздатьНаборЗаписей();
			Рег.Отбор.ДокументКОтправке.Установить(Выборка.ДокументКОтправке);   
			Рег.Отбор.ТипСообщения.Установить(Выборка.ТипСообщения);
			Рег.Отбор.АктуальноДо.Установить(Выборка.АктуальноДо);
			
			Рег.Очистить();
			Рег.Записать();
			
		Иначе
			
			Если ТипЗнч(Выборка.ДокументКОтправке) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда 
				
				Если Выборка.ТипСообщения = Перечисления.ТипыРассылокЭлектроннойПочты.ПроведениеКорректировкиЗаказа Тогда 
					
					ГрузополучательИзЗаказа = Выборка.ДокументКОтправке.ЗаказПокупателя.Грузополучатель;
					
					Если НЕ ЗначениеЗаполнено(ГрузополучательИзЗаказа) Тогда 
						ГрузополучательИзЗаказа = Выборка.ДокументКОтправке.Контрагент;
					КонецЕсли;
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ
					|	КонтактнаяИнформация.Представление
					|ИЗ
					|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
					|ГДЕ
					|	КонтактнаяИнформация.Объект = &Объект
					|	И КонтактнаяИнформация.Тип = &Тип
					|	И КонтактнаяИнформация.Вид = &Вид";
					
					Запрос.УстановитьПараметр("Объект", ГрузополучательИзЗаказа);
					Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
					Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОтказа);
					Результат = Запрос.Выполнить();
					ВыборкаПочта = Результат.Выбрать();
					
					Если ВыборкаПочта.Следующий() Тогда
						
						АдресЭлПочтыДляОтправки = ВыборкаПочта.Представление;
						
						Если Не ПустаяСтрока(АдресЭлПочтыДляОтправки) Тогда
							
							//формируем письмо
							// отправляются только строки с причинами отказа  Отказ Покупателя и Отказ поставщика
							Запрос = Новый Запрос;
							Запрос.Текст = 
							"ВЫБРАТЬ
							|	КорректировкаЗаказаПокупателяТовары.Номенклатура,
							|	КорректировкаЗаказаПокупателяТовары.Номенклатура.Родитель КАК Родитель,
							|	КорректировкаЗаказаПокупателяТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
							|	КорректировкаЗаказаПокупателяТовары.Номенклатура.Наименование КАК Наименование,
							|	-1 * КорректировкаЗаказаПокупателяТовары.Количество КАК Количество,
							|	КорректировкаЗаказаПокупателяТовары.Причина,
							|	КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя
							|ИЗ
							|	Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
							|ГДЕ
							|	КорректировкаЗаказаПокупателяТовары.Ссылка = &Ссылка
							|	И (КорректировкаЗаказаПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
							|			ИЛИ КорректировкаЗаказаПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
							|			ИЛИ КорректировкаЗаказаПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования))
							|	И КорректировкаЗаказаПокупателяТовары.Количество < 0";
							
							
							Запрос.УстановитьПараметр("Ссылка", Выборка.ДокументКОтправке);
							Результат = Запрос.Выполнить();
							ВыборкаДанных = Результат.Выбрать();
							
							ТекстТелаПисьма = "" ;
							СписокЗаказов = Новый СписокЗначений; 
							ТекстСПеречнемЗаказов = "";
							
							Пока ВыборкаДанных.Следующий() Цикл 
								
								Если СписокЗаказов.НайтиПоЗначению(ВыборкаДанных.ЗаказПокупателя) = Неопределено Тогда 
									
									СписокЗаказов.Добавить(ВыборкаДанных.ЗаказПокупателя);
									
									ТекстСПеречнемЗаказов = ТекстСПеречнемЗаказов +
									?(ТекстСПеречнемЗаказов = "", ВыборкаДанных.ЗаказПокупателя.Номер + " от " + ВыборкаДанных.ЗаказПокупателя.Дата,
									"; " + ВыборкаДанных.ЗаказПокупателя.Номер + " от " + ВыборкаДанных.ЗаказПокупателя.Дата);
									
								КонецЕсли;
								
								Если ТекстТелаПисьма = "" Тогда 
									// шапка
									ТекстТелаПисьма = "
									|<table border=""1"" style= ""border-collapse: collapse;"">
									|<thead>
									|<tr style=""background-color: eee;"">
									|<th style=""text-align:center"">Причина отказа</th>
									|<th style=""text-align:center"">Родитель</th>
									|<th style=""text-align:center"">Код производителя</th>
									|<th style=""text-align:center"">Наименование</th>
									|<th style=""text-align:center"">Количество</th>
									|</tr>
									|</thead>";
								КонецЕсли;	
								
								ПричинаТекст = "";                                
								
								Если  ВыборкаДанных.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента Тогда 
									ПричинаТекст = "Отказ покупателя";
								ИначеЕсли  ВыборкаДанных.Причина = Перечисления.ПричиныКорректировкиСборки.ИстекСрокРезервирования Тогда
									ПричинаТекст = "Истёк срок резервирования";
								Иначе
									ПричинаТекст = "Отказ поставщика";
								КонецЕсли;
								
								// строки
								ТекстТелаПисьма=ТекстТелаПисьма+"<tbody>
								|<tr>
								|<td>"+ПричинаТекст+"</td>
								|<td>"+ВыборкаДанных.Родитель+"</td>
								|<td>"+ВыборкаДанных.КодПроизводителя+"</td>
								|<td>"+ВыборкаДанных.Наименование+"</td>
								|<td>"+ВыборкаДанных.Количество+"</td>
								|</tr>
								|</tbody>";
								
							КонецЦикла;
							
							Если ТекстТелаПисьма <> "" Тогда 
								
								ТекстТелаПисьма = ТекстТелаПисьма + "</table><p>С Уважением,<br>Компания «Москворечье-" + Константы.База.Получить() + "»</p>";
								
								// и добавим приветствие
								ТекстТелаПисьма = "<p>Уважаемый клиент!<br>Информация по Заказу(-ам) " + ТекстСПеречнемЗаказов+"</p>" + ТекстТелаПисьма;
								
								// отправляем
								УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
								Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
								
								Сообщение = Новый ИнтернетПочтовоеСообщение;
								Сообщение.Тема = "Информация о заказе № " + ТекстСПеречнемЗаказов;
								
								Почта = Новый ИнтернетПочта; 
								ОтправитьПочту = Истина;      
								
								Попытка
									Почта.Подключиться(Профиль);
								Исключение
									
									ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Ошибка,,,
									"Не удалось подключиться к почтовому серверу!");
									ОтправитьПочту = Ложь;
									
								КонецПопытки;
								
								Если ОтправитьПочту Тогда 
									
									МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочтыДляОтправки, ";");
									
									Для Каждого ТекАдрес Из МассивАдресов Цикл
										Сообщение.Получатели.Добавить(ТекАдрес); 
									КонецЦикла;
									
									Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
									Сообщение.Тексты.Добавить(ТекстТелаПисьма,ТипТекстаПочтовогоСообщения.HTML);
									
									Попытка
										Почта.Послать(Сообщение);
									Исключение 
										
										ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Ошибка,,,
										"Не удалось отправить письмо клиенту " + ГрузополучательИзЗаказа.Наименование + " по адресу " + АдресЭлПочтыДляОтправки+
										" с информацией об отказе по документу " + Выборка.ДокументКОтправке+" " + СокрЛП(ОписаниеОшибки())); 
										Сообщение.Получатели.Очистить(); 								
										Почта.Отключиться(); 
										
										Продолжить;
										
									КонецПопытки;
									
									Сообщение.Получатели.Очистить();
									
									Почта.Отключиться();
									
									ЗаписьЖурналаРегистрации("Регламентное задание по отправке электронной почты", УровеньЖурналаРегистрации.Информация,,,
									"Отправлено письмо клиенту " + ГрузополучательИзЗаказа.Наименование+" по адресу " + АдресЭлПочтыДляОтправки+
									" с информацией об отказе по документу " + Выборка.ДокументКОтправке);
									
									// зафиксируем факт отправки
									НЗРассылкаДокументов 				= РегистрыСведений.РассылкаДокументов.СоздатьМенеджерЗаписи();
									НЗРассылкаДокументов.Период 		= НачалоДня(ТекущаяДата());
									НЗРассылкаДокументов.Контрагент 	= ГрузополучательИзЗаказа;
									НЗРассылкаДокументов.Документ 		= Выборка.ДокументКОтправке;
									НЗРассылкаДокументов.ТипРассылки 	= Перечисления.ТипыРассылокЭлектроннойПочты.ПроведениеКорректировкиЗаказа;
									НЗРассылкаДокументов.ВремяОтправки 	= ТекущаяДата();
									НЗРассылкаДокументов.Комментарий 	= "выполнено регламентным заданием";	
									НЗРассылкаДокументов.Записать();
									
									// очистим текущее задание на отправку
									Рег = РегистрыСведений.ДокументыКОтправке.СоздатьНаборЗаписей();
									Рег.Отбор.ДокументКОтправке.Установить(Выборка.ДокументКОтправке);   
									Рег.Отбор.ТипСообщения.Установить(Выборка.ТипСообщения);
									Рег.Отбор.АктуальноДо.Установить(Выборка.АктуальноДо);
									
									Рег.Очистить();
									Рег.Записать();
									
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				
			ИначеЕсли ТипЗнч(Выборка.ДокументКОтправке) = Тип("ДокументСсылка.ЗакрытиеЗаказовПоставщикам") Тогда 
				
				Если Выборка.ТипСообщения = Перечисления.ТипыРассылокЭлектроннойПочты.ЗакрытиеЗаказаПоставщику Тогда 
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаказыПокупателей.ЗаказПокупателя,
					|	ЗаказыПокупателей.ЗаказПокупателя.Грузополучатель,
					|	ЗаказыПокупателей.ЗаказПокупателя.Контрагент,
					|	ЗаказыПокупателей.Номенклатура,
					|	СУММА(ЗаказыПокупателей.Количество) КАК Количество
					|ПОМЕСТИТЬ Таб
					|ИЗ
					|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
					|ГДЕ
					|	ЗаказыПокупателей.Регистратор = &Регистратор
					|	И ЗаказыПокупателей.ЗаказПокупателя.Грузополучатель.ОтправлятьИнформациюОбОтказах
					|
					|СГРУППИРОВАТЬ ПО
					|	ЗаказыПокупателей.ЗаказПокупателя,
					|	ЗаказыПокупателей.ЗаказПокупателя.Грузополучатель,
					|	ЗаказыПокупателей.ЗаказПокупателя.Контрагент,
					|	ЗаказыПокупателей.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Таб.ЗаказПокупателя КАК ЗаказПокупателя,
					|	Таб.ЗаказПокупателяГрузополучатель КАК Грузополучатель,
					|	Таб.ЗаказПокупателяКонтрагент КАК Контрагент,
					|	Таб.Номенклатура,
					|	Таб.Количество,
					|	Таб.Номенклатура.Родитель КАК Родитель,
					|	Таб.Номенклатура.КодПроизводителя КАК КодПроизводителя
					|ИЗ
					|	Таб КАК Таб
					|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых КАК РассылкаДокументовСрезПервых
					|		ПО Таб.ЗаказПокупателя = РассылкаДокументовСрезПервых.Документ
					|			И (РассылкаДокументовСрезПервых.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ЗакрытиеЗаказаПоставщику))
					|			И Таб.ЗаказПокупателяГрузополучатель = РассылкаДокументовСрезПервых.Контрагент
					|ГДЕ
					|	РассылкаДокументовСрезПервых.Документ ЕСТЬ NULL 
					|
					|УПОРЯДОЧИТЬ ПО
					|	Таб.ЗаказПокупателяГрузополучатель,
					|	ЗаказПокупателя
					|АВТОУПОРЯДОЧИВАНИЕ";
					
					Запрос.УстановитьПараметр("Регистратор", Выборка.ДокументКОтправке);
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда 
						
						Рег = РегистрыСведений.ДокументыКОтправке.СоздатьНаборЗаписей();
						Рег.Отбор.ДокументКОтправке.Установить(Выборка.ДокументКОтправке);   
						Рег.Отбор.ТипСообщения.Установить(Перечисления.ТипыРассылокЭлектроннойПочты.ЗакрытиеЗаказаПоставщику);
						Рег.Отбор.АктуальноДо.Установить(Выборка.АктуальноДо);
						
						Рег.Очистить();
						Рег.Записать();
						
					Иначе
						
						ВыборкаДанных = РезультатЗапроса.Выбрать();
						
						ТекГрузополучатель = "!!!";
						ТекЗаказ = "!!!";
						АдресЭлПочтыДляОтправки = "";
						ТекстТелаПисьма = "";
						ТекстСПеречнемЗаказов = "";
						РезультатОтправкиОсновной = Истина; 
						
						Пока ВыборкаДанных.Следующий() Цикл
							
							Если ТекГрузополучатель <> ВыборкаДанных.Грузополучатель Тогда 
								
								РезультатОтправкиОсновной = РезультатОтправкиОсновной 
								и ЗавершитьОтправку(ТекГрузополучатель,ТекстТелаПисьма, ТекстСПеречнемЗаказов, ТекЗаказ, АдресЭлПочтыДляОтправки, Выборка.ДокументКОтправке);
								
								ТекГрузополучатель = ВыборкаДанных.Грузополучатель;
								ТекЗаказ = ВыборкаДанных.ЗаказПокупателя;
								АдресЭлПочтыДляОтправки = "";
								
								Запрос = Новый Запрос;
								Запрос.Текст = 
								"ВЫБРАТЬ
								|	КонтактнаяИнформация.Представление
								|ИЗ
								|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
								|ГДЕ
								|	КонтактнаяИнформация.Объект = &Объект
								|	И КонтактнаяИнформация.Тип = &Тип
								|	И КонтактнаяИнформация.Вид = &Вид";
								
								Запрос.УстановитьПараметр("Объект", ТекГрузополучатель);
								Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
								Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОтказа);
								
								Результат = Запрос.Выполнить();
								ВыборкаПочта = Результат.Выбрать();
								
								Если ВыборкаПочта.Следующий() Тогда
									АдресЭлПочтыДляОтправки = ВыборкаПочта.Представление;
								КонецЕсли;
								
								ТекстТелаПисьма = "" ;
								СписокЗаказов = Новый СписокЗначений; 
								ТекстСПеречнемЗаказов = "";
								
							КонецЕсли;
							
							Если Не ПустаяСтрока(АдресЭлПочтыДляОтправки) Тогда
								
								Если СписокЗаказов.НайтиПоЗначению(ВыборкаДанных.ЗаказПокупателя) = Неопределено Тогда 
									
									СписокЗаказов.Добавить(ВыборкаДанных.ЗаказПокупателя);
									
									ТекстСПеречнемЗаказов = ТекстСПеречнемЗаказов +
									?(ТекстСПеречнемЗаказов = "", ВыборкаДанных.ЗаказПокупателя.Номер + " от " + ВыборкаДанных.ЗаказПокупателя.Дата,
									"; " + ВыборкаДанных.ЗаказПокупателя.Номер + " от " + ВыборкаДанных.ЗаказПокупателя.Дата);
									
								КонецЕсли;
								
								Если ТекстТелаПисьма = "" Тогда 
									// шапка
									ТекстТелаПисьма = "
									|<table border=""1"" style= ""border-collapse: collapse;"">
									|<thead>
									|<tr style=""background-color: eee;"">
									|<th style=""text-align:center"">Причина отказа</th>
									|<th style=""text-align:center"">Родитель</th>
									|<th style=""text-align:center"">Код производителя</th>
									|<th style=""text-align:center"">Наименование</th>
									|<th style=""text-align:center"">Количество</th>
									|</tr>
									|</thead>";
								КонецЕсли;	
								
								// строки
								ТекстТелаПисьма=ТекстТелаПисьма+"<tbody>
								|<tr>
								|<td>Отказ поставщика</td>
								|<td>"+ВыборкаДанных.Родитель+"</td>
								|<td>"+ВыборкаДанных.КодПроизводителя+"</td>
								|<td>"+ВыборкаДанных.Номенклатура.Наименование+"</td>
								|<td>"+ВыборкаДанных.Количество+"</td>
								|</tr>
								|</tbody>";
								
							КонецЕсли;
							
						КонецЦикла;
						
						РезультатОтправки = ЗавершитьОтправку(ТекГрузополучатель, ТекстТелаПисьма, ТекстСПеречнемЗаказов, ТекЗаказ, 
						                    АдресЭлПочтыДляОтправки, Выборка.ДокументКОтправке);
						
						// очистим текущее задание на отправку
						Если  РезультатОтправки  и РезультатОтправкиОсновной Тогда 
							
							Рег = РегистрыСведений.ДокументыКОтправке.СоздатьНаборЗаписей();
							Рег.Отбор.ДокументКОтправке.Установить(Выборка.ДокументКОтправке);   
							Рег.Отбор.ТипСообщения.Установить(Перечисления.ТипыРассылокЭлектроннойПочты.ЗакрытиеЗаказаПоставщику);
							Рег.Отбор.АктуальноДо.Установить(Выборка.АктуальноДо);
							
							Рег.Очистить();
							Рег.Записать();
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Процедура ПодпискаНаСобытие1ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//  Если у документа НЕТ документа "СчетФактураПолученный"    -> СОЗДАЮ!!
	Если Не Отказ И Источник.Проведен И Константы.СоздаватьСчетФактуруПриПроведенииПТУ.Получить()
		И Источник.ОтражатьВБухгалтерскомУчете И ЗначениеЗаполнено( Источник.НомерВходящегоДокумента)
		И ПроверитьНеобходимостьСозданияСчетаФактуры(Источник)
		Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СчетФактураПолученный.Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ДокументОснование = &ДокументОснование
		|	И НЕ СчетФактураПолученный.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.НомерСтроки
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.СтавкаНДС <> &БезНДС
		|	И ПоступлениеТоваровУслугТовары.Ссылка = &ДокументОснование";
		
		Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
		Запрос.УстановитьПараметр("БезНДС", Перечисления.СтавкиНДС.БезНДС);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		Результат = РезультатЗапроса[0];
		ЕстьСтрокиСНДС = НЕ РезультатЗапроса[1].Пустой();
		
		Если Результат.Пустой() И ЕстьСтрокиСНДС Тогда 
			
			//  Создать документ "СчетФактураПолученный"
			НовыйДокумент = Документы.СчетФактураПолученный.СоздатьДокумент();
			НовыйДокумент.Заполнить(Источник.Ссылка);
			НовыйДокумент.ДатаВходящегоДокумента =  Источник.ДатаВходящегоДокумента ;
			НовыйДокумент.НомерВходящегоДокумента = Источник.НомерВходящегоДокумента ;
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодпискаНаСобытиеОбработкаПроведенияЗаказаПоставщику(Источник, Отказ, РежимПроведения) Экспорт   
	
	Если Не Отказ И Источник.Проведен Тогда  
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПоставщикуТовары.Заказ,
		|	ЗаказПоставщикуТовары.Номенклатура
		|ПОМЕСТИТЬ ВТ_ЗаказыПокупателей
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|	И НЕ ЗаказПоставщикуТовары.Заказ = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		|	И ЗаказПоставщикуТовары.Ссылка.Экспресс = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПоставщикуТовары.Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателей КАК ВТ_ЗаказыПокупателей
		|		ПО ЗаказПоставщикуТовары.Заказ = ВТ_ЗаказыПокупателей.Заказ
		|			И ЗаказПоставщикуТовары.Номенклатура = ВТ_ЗаказыПокупателей.Номенклатура
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка.Проведен = ЛОЖЬ
		|	И ЗаказПоставщикуТовары.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ТекОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ТекОбъект.УстановитьПометкуУдаления(Истина);  
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьНеобходимостьСозданияСчетаФактуры(Документ)
	
	Если  Документ.Контрагент = Константы.ОсновнойПоставщик.Получить() Тогда
		Возврат Константы.СоздаватьСчетФактуруПриПроведенииПТУДляОсновногоПоставщика.Получить();
	КонецЕсли;
	
	Если Документ.Товары.Количество() = 0 Тогда  
		Возврат Ложь;
	Иначе
		
		ЗапросСозданияПоСкладуВЗаказе = Новый Запрос;
		ЗапросСозданияПоСкладуВЗаказе.Текст =  
		"ВЫБРАТЬ
		|	Константы.ДопПоставщик
		|ПОМЕСТИТЬ ВТ_ДопПоставщик
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад ЕСТЬ NULL
		|					ИЛИ ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
		|				ТОГДА НЕ ПоступлениеТоваровУслугТовары.Ссылка.Контрагент = ВТ_ДопПоставщик.ДопПоставщик
		|			ИНАЧЕ ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад.СоздаватьСчетФактуруПриПроведенииПТУ
		|		КОНЕЦ) КАК СоздаватьСчФактуру
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары,
		|	ВТ_ДопПоставщик КАК ВТ_ДопПоставщик
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка";

		ЗапросСозданияПоСкладуВЗаказе.УстановитьПараметр("Ссылка",Документ.Ссылка);
		
		РезультатЗапросаСозданияПоСкладу = ЗапросСозданияПоСкладуВЗаказе.Выполнить();
		
		Если НЕ РезультатЗапросаСозданияПоСкладу.Пустой() Тогда
			
			ВыборкаЗапросаСозданияПоСкладу = РезультатЗапросаСозданияПоСкладу.Выбрать(); 
			ВыборкаЗапросаСозданияПоСкладу.Следующий();
			Возврат ВыборкаЗапросаСозданияПоСкладу.СоздаватьСчФактуру;
			
		Иначе
			Возврат Не Документ.Контрагент = Константы.ДопПоставщик.Получить() 
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат Ложь;	

КонецФункции

Функция ПроверкаНаСтороннийСклад(ДокументПроверки) Экспорт 
	
	Если ТипЗнч(ДокументПроверки) = Тип("ДокументОбъект.КорректировкаСборкиЗаказовПокупателя") Тогда 
		
		ТабЗаказов = ДокументПроверки.Товары.Выгрузить(, "ЗаказПокупателя,Причина");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ТЗ.ЗаказПокупателя КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
		|	ВЫРАЗИТЬ(ТЗ.Причина КАК Перечисление.ПричиныКорректировкиСборки) КАК Причина
		|ПОМЕСТИТЬ ТаблицаЗаказов
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТаблицаЗаказов.ЗаказПокупателя КАК ЗаказСсылка
		|ИЗ
		|	ТаблицаЗаказов КАК ТаблицаЗаказов
		|ГДЕ
		|	ТаблицаЗаказов.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		|	И ТаблицаЗаказов.ЗаказПокупателя.IDСклада_СтороннийСклад <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("ТЗ", ТабЗаказов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			
			ПереченьЗаказов = "";
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ПереченьЗаказов = ПереченьЗаказов + ВыборкаДетальныеЗаписи.ЗаказСсылка.Номер + ", ";
			КонецЦикла;
			
			ПереченьЗаказов = Лев(ПереченьЗаказов,СтрДлина(ПереченьЗаказов) - 2);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Товар заказанный со стороннего склада по заказу(-ам) %1 отказу и возврату НЕ ПОДЛЕЖИТ!!!'"), ПереченьЗаказов);
			Возврат ТекстСообщения;
			
		Иначе 
			Возврат "";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументПроверки) = Тип("ДокументОбъект.КорректировкаЗаказаПокупателя") Тогда
		
		ТекЗаказ = ДокументПроверки.ЗаказПокупателя;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
		|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
		|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику,
		|	РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&МоментДокумента, ЗаказПокупателя = &ЗаказПокупателя) КАК РазмещениеЗаказовПокупателейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.Склад,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
		|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
		|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&МоментДокумента, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки";
		
		Если ДокументПроверки.Ссылка.Пустая() Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&МоментДокумента", "");
		Иначе
			Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(ДокументПроверки.МоментВремени(), ВидГраницы.Исключая));
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", ТекЗаказ);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ТЗРазмещений = РезультатЗапроса[0].Выгрузить();
		ТЗРезервов = РезультатЗапроса[1].Выгрузить();
		
		ТекстСообщения = "";
		
		Если ТЗРазмещений.Количество()>0 Тогда 
			ТекстСообщения = "Товар, заказанный со стороннего склада по заказу " + ТекЗаказ.Номер+
			", уже заказан поставщику. Товар не подлежит корректировке по причине 'Отказ клиента!'!";
		КонецЕсли;
		
		Если ТЗРезервов.Количество() > 0 Тогда
			
			ТекстСообщения = ?(ТекстСообщения <> "", ТекстСообщения + Символы.ПС, "");
			ТекстСообщения = ТекстСообщения + "Товар, заказанный со стороннего склада по заказу " + ТекЗаказ.Номер +
			", уже зарезервирован за покупателем. Товар не подлежит корректировке по причине 'Отказ клиента!'!";
			
		КонецЕсли;
		
		Возврат ТекстСообщения;
		
	КонецЕсли;

КонецФункции

Функция НайтиСтороннийСкладПоID(ID,СоздаватьВСлучаеОтсутствия = Ложь) Экспорт 
	
	ПустойСклад = Справочники.СторонниеСклады.ПустаяСсылка();
	
	Если ID = 0 Тогда 
		Возврат ПустойСклад;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка КАК СобственныйСклад,
	|	СобственныеСклады.Идентификатор
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", ID);	
	РезультатЗапросаСобственные = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапросаСобственные.Пустой()  Тогда
		Возврат ПустойСклад;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСкладФилиала
	|ИЗ
	|	РегистрСведений.СоответствиеСтороннихСкладовСкладамФилиала КАК СоответствиеСтороннихСкладовСкладамФилиала
	|ГДЕ
	|	СоответствиеСтороннихСкладовСкладамФилиала.Использование
	|	И СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСклад = &Идентификатор
	|	И НЕ СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСкладФилиала.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", ID);  
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СтороннийСкладФилиала;
	Иначе
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	СторонниеСклады.Ссылка КАК СтороннийСклад
		               |ИЗ
		               |	Справочник.СторонниеСклады КАК СторонниеСклады
		               |ГДЕ
		               |	СторонниеСклады.Идентификатор = &Идентификатор
		               |	И НЕ СторонниеСклады.ПометкаУдаления
		               |	И НЕ СторонниеСклады.СтороннийСкладФилиала";   
		
		Выборка = Запрос.Выполнить().Выбрать();  
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.СтороннийСклад;			
		КонецЕсли;     
		
		Если СоздаватьВСлучаеОтсутствия И НЕ Константы.НеСоздаватьСтороннийСклад.Получить() Тогда 
			
			НовыйСтороннийСклад = Справочники.СторонниеСклады.СоздатьЭлемент();
			НовыйСтороннийСклад.Идентификатор = ID;
			НовыйСтороннийСклад.Наименование = ID;
			НовыйСтороннийСклад.IDСклада = ID;
			
			НовыйСтороннийСклад.Записать();
			РаботаСАвардой.СоздатьОповещениеОбИзмененииДляСтороннихСкладов("Появился новый сторонний склад", "Появился новый сторонний склад с идентификатором "
			 + ID + ". Необходимо задать для него настройки отправки!",НовыйСтороннийСклад.Ссылка);		
			Возврат НовыйСтороннийСклад.Ссылка;
			
		КонецЕсли;
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
КонецФункции

Функция ЭтоСтороннийСклад(ИдентификаторСклада = 0) Экспорт 
	
	Если ИдентификаторСклада <> 0 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобственныеСклады.Ссылка
		|ИЗ
		|	Справочник.СобственныеСклады КАК СобственныеСклады
		|ГДЕ
		|	СобственныеСклады.Идентификатор = &Идентификатор
		|	И НЕ СобственныеСклады.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	СобственныеСклады.Ссылка
		|ИЗ
		|	Справочник.СобственныеСклады КАК СобственныеСклады
		|ГДЕ
		|	НЕ СобственныеСклады.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСклада);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ТЗСобственныйСклад = РезультатЗапроса[0].Выгрузить();
		СобственныйСкладыЗаполнены = РезультатЗапроса[1].Выгрузить();
		
		Если СобственныйСкладыЗаполнены.Количество() > 0 Тогда 
			
			Если ТЗСобственныйСклад.Количество() = 0 Тогда 
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПроверкаДоговоров() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Проверка договоров", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.НеПроверятьПриРегламентномЗадании = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.ВестиПоДокументамРасчетовСКонтрагентом
	|	И ДоговорыКонтрагентов.КонтролироватьЧислоДнейЗадолженности = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Об =  Выборка.Ссылка.ПолучитьОбъект();
		Об.КонтролироватьЧислоДнейЗадолженности = Истина;
		Об.ДопустимоеЧислоДнейЗадолженности  = 1;
		Об.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаполнитьРеквизитПоСоответствию(Значение, ИмяРеквизитаФабрики, СпрОбъект, ИмяРеквизитаСправочника, ИмяОчереди)	
	
	Если ТипЗнч(Значение) = Тип("ОбъектXDTO") И Значение.Свойства().Количество() > 0 И Значение.Свойства().Получить(ИмяРеквизитаФабрики) <> Неопределено Тогда		
		
		ЗначениеУстановки = СокрЛП(Значение[ИмяРеквизитаФабрики]);
		
		Если ЗначениеЗаполнено(ЗначениеУстановки) Тогда
			
			СоответствиеУстановки = ПолучитьСоответствиеПоID(ЗначениеУстановки);
			
			Если ЗначениеЗаполнено(СоответствиеУстановки) Тогда
				СпрОбъект[ИмяРеквизитаСправочника] = СоответствиеУстановки;
			Иначе
				
				СтруктураСообщения = Новый Структура;
				СтруктураСообщения.Вставить("service", "doc-order-assemble-additional");
				СтруктураСообщения.Вставить("error", "Не найдено соответствие для реквизита: " + ИмяРеквизитаСправочника 
				+ " (" + Строка(ТипЗнч(СпрОбъект)) + ")" + " и значения: " + ЗначениеУстановки + " в регистре сведений СоответствиеОбъектовДляОбмена");
				СтруктураСообщения.Вставить("body", "");
				СтруктураСообщения.Вставить("solved", false); 				
				
				СвойстваСтруктура = Новый Структура;
				СвойстваСтруктура.Вставить("app_id", ИмяОчереди);    					
				СтруктураСообщения.Вставить("props", СвойстваСтруктура); 					
				
				AMQP_РаботаСоСправочниками.ОтправитьСообщениеВЭластик(СтруктураСообщения, Строка(Новый УникальныйИдентификатор()), Истина);
				
			КонецЕсли;     
			
		КонецЕсли;
		
	КонецЕсли;   
	
КонецФУнкции

Функция ПолучитьСоответствиеПоID(ID)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеОбъектовДляОбмена.СобственнаяСсылка
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовДляОбмена КАК СоответствиеОбъектовДляОбмена
	|ГДЕ
	|	СоответствиеОбъектовДляОбмена.СсылкаВДругойИБ = &СсылкаВДругойИБ";
	
	Запрос.УстановитьПараметр("СсылкаВДругойИБ", ID);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.СобственнаяСсылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭтоВодитель() Экспорт
	
	Возврат РольДоступна("Водитель");

КонецФункции

Процедура ФормированиеИОтправкаЕжедневногоОтчета() Экспорт
	
	ОбработкаОтправки = Обработки.ЕжедневныйОтчет.Создать();
	ОбработкаОтправки.СформироватьОтчет();
	
КонецПроцедуры

Процедура ПринятьСообщениеПоВнутреннемуОбмену(ТекстСообщения, Отказ) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстСообщения);
	СтруктураСообщений = ПрочитатьJSON(ЧтениеJSON);
	
	Если ТипЗнч(СтруктураСообщений) = Тип("Массив") Тогда
		
		Для каждого СтруктураСообщения Из СтруктураСообщений Цикл
			
			ТипОбъекта = СтруктураСообщения.ТипОбъекта;
			Объект = СтруктураСообщения.Объект;
			
			Если ТипОбъекта = "Константы" Тогда		
				
				Тип = Метаданные.Константы[Объект].Тип;
				Значение = СтруктураСообщения.Реквизиты[0][Объект];
				
				Если ТипЗнч(Значение) = Тип("Структура") Тогда
					Константы[Объект].Установить(ПолучитьОбъектПоСтруктуре(Значение));						
				Иначе
					Константы[Объект].Установить(Значение); 					
				КонецЕсли;
				
			ИначеЕсли ТипОбъекта = "РегистрыСведений" Тогда
				
				МенеджерЗаписи = РегистрыСведений[Объект].СоздатьМенеджерЗаписи();
				
				Для каждого Реквизит Из СтруктураСообщения.Реквизиты Цикл 			
					
					Для каждого Элемент Из Реквизит Цикл 
						
						Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
							МенеджерЗаписи[Элемент.Ключ] = ПолучитьОбъектПоСтруктуре(Элемент.Значение);						
						Иначе
							МенеджерЗаписи[Элемент.Ключ] = Элемент.Значение; 					
						КонецЕсли;
						
					КонецЦикла;      
					
				КонецЦикла;
				
				МенеджерЗаписи.Записать();
				
			ИначеЕсли ТипОбъекта = "Справочники" Тогда
				
				НовыйЭлемент = Справочники[Объект].СоздатьЭлемент();
				
				Для каждого Реквизит Из СтруктураСообщения.Реквизиты Цикл 			
					
					Для каждого Элемент Из Реквизит Цикл 
						
						Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
							НовыйЭлемент[Элемент.Ключ] = ПолучитьОбъектПоСтруктуре(Элемент.Значение);						
						Иначе
							НовыйЭлемент[Элемент.Ключ] = Элемент.Значение; 					
						КонецЕсли;
						
					КонецЦикла;      
					
				КонецЦикла;
				
				НовыйЭлемент.ОбменДанными.Загрузка = Истина;
				НовыйЭлемент.Записать();
				
			ИначеЕсли ТипОбъекта = "Документы" Тогда
				
				НовыйЭлемент = Документы[Объект].СоздатьДокумент();
				
				Для каждого Реквизит Из СтруктураСообщения.Реквизиты Цикл 			
					
					Для каждого Элемент Из Реквизит Цикл 
						
						Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
							НовыйЭлемент[Элемент.Ключ] = ПолучитьОбъектПоСтруктуре(Элемент.Значение);						
						Иначе
							НовыйЭлемент[Элемент.Ключ] = Элемент.Значение; 					
						КонецЕсли;
						
					КонецЦикла;      
					
				КонецЦикла;
				
				НовыйЭлемент.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьОбъектПоСтруктуре(СтруктураЗначения)
	
	Значение = СтруктураЗначения.Значение;
	ТипОбъекта = СтруктураЗначения.ТипОбъекта;
	Объект = СтруктураЗначения.Объект;
	
	Если ТипОбъекта = "Перечисление" Тогда
		Возврат Перечисления[Объект][Значение];
	ИначеЕсли ТипОбъекта = "Справочник" Тогда
		Возврат Справочники[Объект].ПолучитьСсылку(Новый УникальныйИдентификатор(Значение)); 
	ИначеЕсли ТипОбъекта = "Документ" Тогда
		Возврат Документы[Объект].ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
	ИначеЕсли ТипОбъекта = "ПланОбмена" Тогда
		Возврат ПланыОбмена[Объект].ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
	ИначеЕсли ТипОбъекта = "ПланВидовХарактеристик" Тогда
		Возврат ПланыВидовХарактеристик[Объект].ПолучитьСсылку(Новый УникальныйИдентификатор(Значение));
	КонецЕсли;
	
КонецФункции

Функция ЭтоСсылочныйТип(Тип)
	
	Если Тип = Новый ОписаниеТипов("Строка") ИЛИ Тип = Новый ОписаниеТипов("Число") ИЛИ Тип = Новый ОписаниеТипов("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ПроведениеРазмещениеПоЯчейкам() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Проведение и размещение по ячейкам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Документы.РазмещениеПоЯчейкам.ПровестиДокументыБезДвижений();
	
КонецПроцедуры

Процедура ФормированиеИОтправкаОтчетаПоТоварамБезЦен() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Формирование и отправка отчета по товарам без цен", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ОбработкаОтправки = Обработки.ОтчетПоТоварамБезЦен.Создать();
	
	ОбработкаОтправки.ОтправкаПисем();
	
КонецПроцедуры

Процедура ИсправлениеРегистраТоварыОрганизаций() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Исправление регистра Товары организаций", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ОбработкаОтправки = Обработки.ИсправлениеРегистраТоварыОрганизаций.Создать();
	ОбработкаОтправки.Месяц = ТекущаяДата();	
	ОбработкаОтправки.ИсправитьТоварыОрганизаций();

КонецПроцедуры

Функция МенеджерОбъектаПоПолномуИмени(ПолноеИмя) Экспорт
	
	Перем КлассОМ, ИмяОМ, Менеджер;
	
	ЧастиИмени = _СтрРазделить(ПолноеИмя, ".");
	
	Если ЧастиИмени.Количество() >= 2 Тогда
		
		КлассОМ = ЧастиИмени[0];
		ИмяОМ  = ЧастиИмени[1];
		
	КонецЕсли;
	
	Если      ВРег(КлассОМ) = "ПЛАНОБМЕНА" Тогда
		Менеджер = ПланыОбмена;
		
	ИначеЕсли ВРег(КлассОМ) = "СПРАВОЧНИК" Тогда
		Менеджер = Справочники;
		
	ИначеЕсли ВРег(КлассОМ) = "ДОКУМЕНТ" Тогда
		Менеджер = Документы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЖУРНАЛДОКУМЕНТОВ" Тогда
		Менеджер = ЖурналыДокументов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЕРЕЧИСЛЕНИЕ" Тогда
		Менеджер = Перечисления;
		
	ИначеЕсли ВРег(КлассОМ) = "ОТЧЕТ" Тогда
		Менеджер = Отчеты;
		
	ИначеЕсли ВРег(КлассОМ) = "ОБРАБОТКА" Тогда
		Менеджер = Обработки;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВХАРАКТЕРИСТИК" Тогда
		Менеджер = ПланыВидовХарактеристик;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНСЧЕТОВ" Тогда
		Менеджер = ПланыСчетов;
		
	ИначеЕсли ВРег(КлассОМ) = "ПЛАНВИДОВРАСЧЕТА" Тогда
		Менеджер = ПланыВидовРасчета;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРСВЕДЕНИЙ" Тогда
		Менеджер = РегистрыСведений;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРНАКОПЛЕНИЯ" Тогда
		Менеджер = РегистрыНакопления;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРБУХГАЛТЕРИИ" Тогда
		Менеджер = РегистрыБухгалтерии;
		
	ИначеЕсли ВРег(КлассОМ) = "РЕГИСТРРАСЧЕТА" Тогда
		
		Если ЧастиИмени.Количество() = 2 Тогда
			// Регистр расчета
			Менеджер = РегистрыРасчета;
		Иначе
			
			КлассПодчиненногоОМ = ЧастиИмени[2];
			ИмяПодчиненногоОМ = ЧастиИмени[3];
			
			Если ВРег(КлассПодчиненногоОМ) = "ПЕРЕРАСЧЕТ" Тогда
				
				// Перерасчет
				Попытка
					
					Менеджер = РегистрыРасчета[ИмяОМ].Перерасчеты;
					ИмяОм = ИмяПодчиненногоОМ;
					
				Исключение
					Менеджер = Неопределено;
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(КлассОМ) = "БИЗНЕСПРОЦЕСС" Тогда
		Менеджер = БизнесПроцессы;
		
	ИначеЕсли ВРег(КлассОМ) = "ЗАДАЧА" Тогда
		Менеджер = Задачи;
		
	ИначеЕсли ВРег(КлассОМ) = "КОНСТАНТА" Тогда
		Менеджер = Константы;
		
	ИначеЕсли ВРег(КлассОМ) = "ПОСЛЕДОВАТЕЛЬНОСТЬ" Тогда
		Менеджер = Последовательности;
	КонецЕсли;
	
	Если Менеджер <> Неопределено Тогда
		
		Попытка
			Возврат Менеджер[ИмяОМ];
		Исключение
			Менеджер = Неопределено;
		КонецПопытки;
		
	КонецЕсли;
	
	ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Неизвестный тип объекта метаданных ""%1""'"), ПолноеИмя);
	
КонецФункции

Функция _СтрРазделить(знач Строка, Разделитель, ВключатьПустые = Истина) Экспорт
	
	Результат = Новый Массив;
	
	Если Строка = "" Тогда 
		
		Если ВключатьПустые Тогда
			Результат.Добавить(Строка);
		КонецЕсли;
		
		Возврат Результат;
		
	КонецЕсли;
	
	Позиция = Найти(Строка, Разделитель);
	
	Пока Позиция > 0 Цикл
		
		Подстрока = Лев(Строка, Позиция - 1);
		
		Если ВключатьПустые ИЛИ НЕ Подстрока = "" Тогда
			Результат.Добавить(Подстрока);
		КонецЕсли;
		
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = Найти(Строка, Разделитель);
		
	КонецЦикла;
	
	Если ВключатьПустые ИЛИ НЕ Строка = "" Тогда
		Результат.Добавить(Строка);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция _СтрНайти(Строка, ПодстрокаПоиска, НаправлениеПоиска = Неопределено, НачальнаяПозиция = Неопределено, НомерВхождения = 1) Экспорт
	// НаправлениеПоиска: СКонца,СНачала. По умолчанию: СНачала
	
	Если Строка = "" и ПодстрокаПоиска = "" Тогда
		
		// чтобы отрабатывало как в платформе
		Если НаправлениеПоиска = "СКонца" Тогда
			
			Если НомерВхождения = 1 Тогда
				Возврат 1;
			Иначе
				Возврат 0;
			КонецЕсли;
			
		Иначе
			Возврат мин(НомерВхождения, ?(НачальнаяПозиция=Неопределено, 1, НачальнаяПозиция));
		КонецЕсли;
		
	КонецЕсли;
	
	Если НачальнаяПозиция = Неопределено Тогда
		
		Если НаправлениеПоиска = "СКонца" Тогда
			лНачальнаяПозиция = СтрДлина(Строка);
		Иначе
			лНачальнаяПозиция = 1;
		КонецЕсли;
		
	Иначе
		лНачальнаяПозиция = НачальнаяПозиция;
	КонецЕсли;
	
	Если НаправлениеПоиска = "СКонца" Тогда
		
		лСтрока = "";
		
		Для сч = 1 По СтрДлина(Строка) Цикл
			лСтрока = Сред(Строка, сч, 1) + лСтрока;
		КонецЦикла;
		
		лПодстрокаПоиска = "";
		
		Для сч = 1 По СтрДлина(ПодстрокаПоиска) Цикл
			лПодстрокаПоиска = Сред(ПодстрокаПоиска, сч, 1) + лПодстрокаПоиска;
		КонецЦикла;
		
		лНачальнаяПозиция = макс(1, СтрДлина(Строка)-лНачальнаяПозиция-СтрДлина(ПодстрокаПоиска) + 2);
		
	Иначе
		
		лСтрока = Строка;
		лПодстрокаПоиска = ПодстрокаПоиска;
		
		лНачальнаяПозиция = лНачальнаяПозиция;
	КонецЕсли;
	
	лНомерВхождения = 0;
	Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
	
	Пока Результат Цикл
		
		лНачальнаяПозиция = Результат + лНачальнаяПозиция + СтрДлина(ПодстрокаПоиска) - 1;
		лНомерВхождения = лНомерВхождения + 1;
		
		Если лНомерВхождения = НомерВхождения Тогда
			Прервать;
		КонецЕсли;
		
		Результат = Найти(Сред(лСтрока, лНачальнаяПозиция), лПодстрокаПоиска);
		
	КонецЦикла;
	
	Если лНомерВхождения = НомерВхождения Тогда
		Результат = лНачальнаяПозиция - СтрДлина(ПодстрокаПоиска);
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Если НаправлениеПоиска = "СКонца" И Результат<>0 Тогда
		Результат = СтрДлина(Строка) - Результат - СтрДлина(ПодстрокаПоиска) + 2;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает значение свойства элемента формы, если находит элемент на форме
//
// Параметры
//  ЭлементыФормы - ВсеЭлементыФормы - элементы формы, среди которых содержится искомый элемент.
//  ИмяЭлемента   - Строка - имя искомого элемента.
//  ИмяСвойства   - Строка - имя свойства, для которого будет устанавливаться значение.
//  Значение      - Произвольный - значение, которое будет установлено
//  УстанавливатьДляПодчиненных - Булево - установить аналогичное свойство для подчиненных элементов искомого элемента
//
Процедура УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ИмяЭлемента, ИмяСвойства, Значение, УстанавливатьДляПодчиненных = Ложь) Экспорт
	
	Элемент = ЭлементыФормы.Найти(ИмяЭлемента);
	
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НРег(ИмяСвойства) = "толькопросмотр"
		И ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
		
		ИмяСвойстваЭлемента = "Доступность";
		ЗначениеСвойства    = НЕ Значение;
		
	Иначе
		
		ИмяСвойстваЭлемента = ИмяСвойства;
		ЗначениеСвойства    = Значение;
		
	КонецЕсли;
	
	Если Элемент[ИмяСвойстваЭлемента] <> ЗначениеСвойства Тогда
		Элемент[ИмяСвойстваЭлемента] = ЗначениеСвойства;
	КонецЕсли;
	
	ТипыЭлементовФормыСПодчиненнымиЭлементами = Новый ОписаниеТипов("УправляемаяФорма, ГруппаФормы, ТаблицаФормы");
	
	Если УстанавливатьДляПодчиненных И ТипыЭлементовФормыСПодчиненнымиЭлементами.СодержитТип(ТипЗнч(Элемент)) Тогда
		
		Для Каждого ПодчиненныйЭлемент Из Элемент.ПодчиненныеЭлементы Цикл
			УстановитьСвойствоЭлементаФормы(ЭлементыФормы, ПодчиненныйЭлемент.Имя, ИмяСвойства, Значение, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьСвойствоЭлементаФорма()

// Перед выполнением команды печати проверить, был ли передан хотя бы один объект, так как
// для команд с множественным режимом использования может быть передан пустой массив.
Функция ПроверитьКоличествоПереданныхОбъектов(ПараметрКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") И ПараметрКоманды.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

// Формирует и выводит на принтер печатные формы.
//
// Параметры:
//  ИмяМенеджераПечати - Строка - менеджер печати для печатаемых объектов;
//  ИменаМакетов       - Строка - идентификаторы печатных форм;
//  МассивОбъектов     - Ссылка, Массив - объекты печати;
//  ВладелецФормы      - УправляемаяФорма - форма, из которой выполняется печать;
//  ПараметрыПечати    - Структура - произвольные параметры для передачи в менеджер печати.
//
Процедура ВыполнитьКомандуПечатиНаПринтер(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати = Неопределено) Экспорт
	
	// Проверим количество объектов.
	Если НЕ ПроверитьКоличествоПереданныхОбъектов(МассивОбъектов) Тогда
		Возврат;
	КонецЕсли;
	
	// Сформируем табличные документы.
	ПечатныеФормы = МСК.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
	ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати);
	
	Если НЕ ПечатныеФормы.Отказ Тогда
		
		ОбъектыПечати = Новый СписокЗначений;
		ТабличныеДокументы = ПолучитьИзВременногоХранилища(ПечатныеФормы.Адрес);
		
		Для Каждого ОбъектПечати Из ПечатныеФормы.ОбъектыПечати Цикл
			ОбъектыПечати.Добавить(ОбъектПечати.Значение, ОбъектПечати.Ключ);
		КонецЦикла;
		
		ПечатныеФормы.ОбъектыПечати = ОбъектыПечати;
		
	КонецЕсли;
	
	Если ПечатныеФормы.Отказ Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нет прав для вывода печатной формы на принтер, обратитесь к администратору.'"));
		Возврат;
		
	КонецЕсли;
	
	//установим количество экземпляров
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
	Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(),
	МассивОбъектов, Неопределено);
	
	Для Каждого ТекПФ Из ТабличныеДокументы Цикл
		
		СтрокаЭкз = КомплектПечатныхФорм.Найти(ТекПФ.Представление, "Представление");
		
		Если ЗначениеЗаполнено(СтрокаЭкз) Тогда
			ТекПФ.Значение.КоличествоЭкземпляров = СтрокаЭкз.Экземпляров;
		КонецЕсли;
		
	КонецЦикла;
	
	РаспечататьТабличныеДокументы(ТабличныеДокументы, МассивОбъектов, Ложь);
	
КонецПроцедуры

// Сформировать печатные формы для непосредственного вывода на принтер в обычном приложении.
Функция СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Адрес");
	Результат.Вставить("ОбъектыПечати");
	Результат.Вставить("ПараметрыВывода");
	Результат.Вставить("Отказ", Ложь);
	
	ПечатныеФормы = СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати);
	
	Если ПечатныеФормы.Отказ Тогда
		
		Результат.Отказ = ПечатныеФормы.Отказ;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат.ОбъектыПечати = Новый Соответствие;
	
	Для Каждого ОбъектПечати Из ПечатныеФормы.ОбъектыПечати Цикл
		Результат.ОбъектыПечати.Вставить(Строка(ОбъектПечати), ОбъектПечати);
	КонецЦикла;
	
	Результат.Адрес = ПоместитьВоВременноеХранилище(ПечатныеФормы.ТабличныеДокументы);
	Возврат Результат;
	
КонецФункции

// Вывести табличные документы на принтер.
//
// Параметры:
//  ТабличныеДокументы           - СписокЗначений - печатные формы.
//  ОбъектыПечати                - СписокЗначений - соответствие объектов именам областей табличного документа.
//  ПечататьКомплектами          - Булево, Неопределено - (не используется, вычисляется автоматически).
//  КоличествоКопийКомплектов    - Число - количество экземпляров каждого из комплектов документов.
Процедура РаспечататьТабличныеДокументы(ТабличныеДокументы, ОбъектыПечати, Знач ПечататьКомплектами = Неопределено, Знач КоличествоКопийКомплектов = 1) Экспорт
	
	ПакетОтображаемыхДокументов = МСК.ПакетДокументов(ТабличныеДокументы,
	ОбъектыПечати, ПечататьКомплектами, КоличествоКопийКомплектов);
	
	ПакетОтображаемыхДокументов.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
КонецПроцедуры

// Сформировать печатные формы для непосредственного вывода на принтер.
//
Функция СформироватьПечатныеФормыДляБыстройПечати(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ТабличныеДокументы");
	Результат.Вставить("ОбъектыПечати");
	Результат.Вставить("ПараметрыВывода");
	Результат.Вставить("Отказ", Ложь);
	
	ПечатныеФормы = СформироватьПечатныеФормы(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати);
	
	ТабличныеДокументы = Новый СписокЗначений;
	Для Каждого ПечатнаяФорма Из ПечатныеФормы.КоллекцияПечатныхФорм Цикл  
		
		Если (ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) = Тип("ТабличныйДокумент")) И (ПечатнаяФорма.ТабличныйДокумент.ВысотаТаблицы <> 0) 
			Или ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) = Тип("ТекстовыйДокумент") Тогда 
			ТабличныеДокументы.Добавить(ПечатнаяФорма.ТабличныйДокумент, ПечатнаяФорма.СинонимМакета);
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.ТабличныеДокументы = ТабличныеДокументы;
	Результат.ОбъектыПечати      = ПечатныеФормы.ОбъектыПечати;
	Результат.ПараметрыВывода    = ПечатныеФормы.ПараметрыВывода;
	Возврат Результат;
	
КонецФункции

// Формирует пакет документов для отправки на принтер.
Функция ПакетДокументов(ТабличныеДокументы, ОбъектыПечати, ПечататьКомплектами, КоличествоЭкземпляров = 1) Экспорт
	
	Пакет = Новый ПакетОтображаемыхДокументов;
	КоллекцияПечатныхФорм = ТабличныеДокументы.ВыгрузитьЗначения();
	
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		ТабличныйДокумент = Новый ТабличныйДокумент;
		ТабличныйДокумент.Вывести(ПечатнаяФорма);
		ЗаполнитьЗначенияСвойств(ТабличныйДокумент, ПечатнаяФорма, 
		"АвтоМасштаб,Вывод,ВысотаСтраницы,ДвусторонняяПечать,Защита,ИмяПринтера,КодЯзыкаМакета,КоличествоЭкземпляров,МасштабПечати,
		|ОриентацияСтраницы,ПолеСверху,ПолеСлева,ПолеСнизу,ПолеСправа,РазборПоКопиям,РазмерКолонтитулаСверху,РазмерКолонтитулаСнизу,
		|РазмерСтраницы,ТочностьПечати,ЧерноБелаяПечать,ШиринаСтраницы,ЭкземпляровНаСтранице");
		
		ВложенныйПакет = Новый ПакетОтображаемыхДокументов;
		ВложенныйПакет.Состав.Добавить().Данные = ПакетСОднимТабличнымДокументом(ТабличныйДокумент);			
		ВложенныйПакет.КоличествоЭкземпляров = ПечатнаяФорма.КоличествоЭкземпляров;
		
		ЭлементОсновногоПакета = Пакет.Состав.Добавить();
		ЭлементОсновногоПакета.Данные = ВложенныйПакет;
		
	КонецЦикла;
	
	Возврат Пакет;
	
КонецФункции

// Заворачивает табличный документ в пакет отображаемых документов.
Функция ПакетСОднимТабличнымДокументом(ТабличныйДокумент)
	
	АдресТабличногоДокументаВоВременномХранилище = ПоместитьВоВременноеХранилище(ТабличныйДокумент);
	
	ПакетСОднимДокументом = Новый ПакетОтображаемыхДокументов;
	ПакетСОднимДокументом.Состав.Добавить(АдресТабличногоДокументаВоВременномХранилище);
	ЗаполнитьЗначенияСвойств(ПакетСОднимДокументом, ТабличныйДокумент, "Вывод, ДвусторонняяПечать, ИмяПринтера, КоличествоЭкземпляров, ТочностьПечати");
	
	Если ТабличныйДокумент.РазборПоКопиям <> Неопределено Тогда
		ПакетСОднимДокументом.РазборПоКопиям = ТабличныйДокумент.РазборПоКопиям;
	КонецЕсли;
	
	Возврат ПакетСОднимДокументом;

КонецФункции

// Сформировать печатные формы.
Функция СформироватьПечатныеФормы(Знач ИмяМенеджераПечати, Знач ИменаМакетов, Знач МассивОбъектов, Знач ПараметрыПечати, 
	ДопустимыеТипыОбъектовПечати = Неопределено) Экспорт
	
	КоллекцияПечатныхФорм = ПодготовитьКоллекциюПечатныхФорм(Новый Массив);
	ОбъектыПечати = Новый СписокЗначений;
	ПараметрыВывода = ПодготовитьСтруктуруПараметровВывода();
	
	Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
		ИменаМакетов = МСК._СтрРазделить(ИменаМакетов, ",");
	Иначе // Тип("Массив")
		ИменаМакетов = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ИменаМакетов);
	КонецЕсли;
	
	ПрефиксВнешнихПечатныхФорм = "ВнешняяПечатнаяФорма.";
	
	ИсточникВнешнихПечатныхФорм = ИмяМенеджераПечати;
	
	Если МСК.ЭтоСсылка(ТипЗнч(МассивОбъектов)) Тогда
		ИсточникВнешнихПечатныхФорм = МассивОбъектов.Метаданные().ПолноеИмя();
	Иначе
		
		Если МассивОбъектов.Количество() > 0 Тогда
			ИсточникВнешнихПечатныхФорм = МассивОбъектов[0].Метаданные().ПолноеИмя();
		КонецЕсли;
		
	КонецЕсли;
	
	ВнешниеПечатныеФормы = СписокПечатныхФормИзВнешнихИсточников(ИсточникВнешнихПечатныхФорм);
	
	// Добавление внешних печатных форм в комплект.
	ДобавленныеВнешниеПечатныеФормы = Новый Массив;
	
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") Тогда 		
		
		ИдентификаторыВнешнихПечатныхФорм = ВнешниеПечатныеФормы.ВыгрузитьЗначения();
		
		Для Каждого Идентификатор Из ИдентификаторыВнешнихПечатныхФорм Цикл
			
			ИменаМакетов.Добавить(ПрефиксВнешнихПечатныхФорм + Идентификатор);
			ДобавленныеВнешниеПечатныеФормы.Добавить(ПрефиксВнешнихПечатныхФорм + Идентификатор);
			
		КонецЦикла;
		
	КонецЕсли;
	
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
	Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(),
	МассивОбъектов, Неопределено);
	
	Для Каждого ИмяМакета Из ИменаМакетов Цикл
		
		Если ИмяМакета <> "КомплектДокументов" Тогда
			
			СтрокаНастроек = КомплектПечатныхФорм.Найти(ИмяМакета, "Имя");
			
			Если СтрокаНастроек <> Неопределено И НЕ СтрокаНастроек.Печатать Тогда	
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;	
		
		// Проверка наличия уже напечатанной формы.
		НайденнаяПечатнаяФорма = КоллекцияПечатныхФорм.Найти(ИмяМакета, "ИмяМакета");
		
		Если НайденнаяПечатнаяФорма <> Неопределено Тогда
			
			ПоследняяДобавленнаяПечатнаяФорма = КоллекцияПечатныхФорм[КоллекцияПечатныхФорм.Количество() - 1];
			
			Если ПоследняяДобавленнаяПечатнаяФорма.ИмяМакета = НайденнаяПечатнаяФорма.ИмяМакета Тогда
				ПоследняяДобавленнаяПечатнаяФорма.Экземпляров = ПоследняяДобавленнаяПечатнаяФорма.Экземпляров + 1;
			Иначе
				
				КопияПечатнойФормы = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(КопияПечатнойФормы, НайденнаяПечатнаяФорма);
				КопияПечатнойФормы.Экземпляров = 1;
				
			КонецЕсли;
			Продолжить;
			
		КонецЕсли;
		
		// Поиск указания дополнительного менеджера печати в имени печатной формы.
		ИмяДополнительногоМенеджераПечати = "";
		Идентификатор = ИмяМакета;
		ВнешняяПечатнаяФорма = Неопределено;
		
		Если _СтрНайти(Идентификатор, ПрефиксВнешнихПечатныхФорм) > 0 Тогда // это внешняя печатная форма
			
			Идентификатор = Сред(Идентификатор, СтрДлина(ПрефиксВнешнихПечатныхФорм) + 1);
			ВнешняяПечатнаяФорма = ВнешниеПечатныеФормы.НайтиПоЗначению(Идентификатор);
			
		ИначеЕсли _СтрНайти(Идентификатор, ".") > 0 Тогда // Указан дополнительный менеджер печати.
			
			Позиция = _СтрНайти(Идентификатор, ".", "СКонца");
			ИмяДополнительногоМенеджераПечати = Лев(Идентификатор, Позиция - 1);
			Идентификатор = Сред(Идентификатор, Позиция + 1);
			
		КонецЕсли;
		
		// Определение внутреннего менеджера печати.
		ИспользуемыйМенеджерПечати = ИмяДополнительногоМенеджераПечати;
		
		Если ПустаяСтрока(ИспользуемыйМенеджерПечати) Тогда
			ИспользуемыйМенеджерПечати = ИмяМенеджераПечати;
		КонецЕсли;
		
		// Проверка соответствия печатаемых объектов выбранной печатной форме.
		ОжидаемыйТипОбъекта = Неопределено;
		
		ОбъектыСоответствующиеПечатнойФорме = МассивОбъектов;
		
		Если ДопустимыеТипыОбъектовПечати <> Неопределено И ДопустимыеТипыОбъектовПечати.Количество() > 0 Тогда
			
			Если ТипЗнч(МассивОбъектов) = Тип("Массив") Тогда
				
				ОбъектыСоответствующиеПечатнойФорме = Новый Массив;
				
				Для Каждого Объект Из МассивОбъектов Цикл
					
					Если ДопустимыеТипыОбъектовПечати.Найти(ТипЗнч(Объект)) = Неопределено Тогда
						СообщитьПечатнаяФормаНедоступна(Объект);
					Иначе
						ОбъектыСоответствующиеПечатнойФорме.Добавить(Объект);
					КонецЕсли;
					
				КонецЦикла;
				
				Если ОбъектыСоответствующиеПечатнойФорме.Количество() = 0 Тогда
					ОбъектыСоответствующиеПечатнойФорме = Неопределено;
				КонецЕсли;
				
			ИначеЕсли ОбщегоНазначения.ЗначениеСсылочногоТипа(МассивОбъектов) Тогда // передан не массив
				
				Если ДопустимыеТипыОбъектовПечати.Найти(ТипЗнч(МассивОбъектов)) = Неопределено Тогда
					
					СообщитьПечатнаяФормаНедоступна(МассивОбъектов);
					ОбъектыСоответствующиеПечатнойФорме = Неопределено;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ВременнаяКоллекцияДляОднойПечатнойФормы = ПодготовитьКоллекциюПечатныхФорм(Идентификатор);
		
		// Вызов процедуры Печать из менеджера печати.
		Если ВнешняяПечатнаяФорма <> Неопределено Тогда
			
			Попытка
				
				// Менеджер печати во внешней печатной форме.
				МСК.ПечатьПоВнешнемуИсточнику(
				ВнешняяПечатнаяФорма(ВнешняяПечатнаяФорма.Значение, ИсточникВнешнихПечатныхФорм),
				Новый Структура("ИдентификаторКоманды, ОбъектыНазначения", ВнешняяПечатнаяФорма.Значение, ОбъектыСоответствующиеПечатнойФорме),
				ВременнаяКоллекцияДляОднойПечатнойФормы,
				ОбъектыПечати,
				ПараметрыВывода);
				
			Исключение
			КонецПопытки;			
			
		Иначе
			
			Если Не ПустаяСтрока(ИспользуемыйМенеджерПечати) Тогда
				
				МенеджерПечати = МСК.МенеджерОбъектаПоПолномуИмени(ИспользуемыйМенеджерПечати);
				
				// Печать внутренней печатной формы.
				Если ОбъектыСоответствующиеПечатнойФорме <> Неопределено Тогда
					
					МенеджерПечати.Печать(ОбъектыСоответствующиеПечатнойФорме, ПараметрыПечати, ВременнаяКоллекцияДляОднойПечатнойФормы, 
					ОбъектыПечати, ПараметрыВывода);
					
				Иначе
					ВременнаяКоллекцияДляОднойПечатнойФормы[0].ТабличныйДокумент = Новый ТабличныйДокумент;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка корректности заполнения коллекции печатных форм, полученной из менеджера печати.
		Для Каждого ОписаниеПечатнойФормы Из ВременнаяКоллекцияДляОднойПечатнойФормы Цикл
			МСК.Проверить(
			ТипЗнч(ОписаниеПечатнойФормы.Экземпляров) = Тип("Число") И ОписаниеПечатнойФормы.Экземпляров > 0,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не задано количество экземпляров для печатной формы ""%1"".'"),
			?(ПустаяСтрока(ОписаниеПечатнойФормы.СинонимМакета), ОписаниеПечатнойФормы.ИмяМакета, ОписаниеПечатнойФормы.СинонимМакета)));
		КонецЦикла;
		
		// обновление коллекции
		Отказ = ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() = 0;
		
		// Предполагается одна печатная форма, но для обратной совместимости принимается вся коллекция.
		Для Каждого ВременнаяПечатнаяФорма Из ВременнаяКоллекцияДляОднойПечатнойФормы Цикл 
			
			Если ВременнаяПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда
				
				ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
				ЗаполнитьЗначенияСвойств(ПечатнаяФорма, ВременнаяПечатнаяФорма);
				
				Если ВременнаяКоллекцияДляОднойПечатнойФормы.Количество() = 1 Тогда
					
					ПечатнаяФорма.ИмяМакета = ИмяМакета;
					ПечатнаяФорма.ИмяВРЕГ = ВРег(ИмяМакета);
					
				КонецЕсли;
				
			Иначе
				// Возникла ошибка при формировании печатной формы.
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		// Вызов исключения при возникновении ошибки.
		Если Отказ Тогда
			
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр(
			"ru = 'При формировании печатной формы ""%1"" возникла ошибка. Обратитесь к администратору.'"), ИмяМакета);
			ВызватьИсключение ТекстСообщенияОбОшибке;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Установка количества экземпляров табличным документам.
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл

		Если ПечатнаяФорма.ТабличныйДокумент <> Неопределено Тогда 
			
			Если ПечатнаяФорма.ТабличныйДокумент  = Тип("ТабличныйДокумент") Тогда
				ПечатнаяФорма.ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.Экземпляров; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("КоллекцияПечатныхФорм", КоллекцияПечатныхФорм);

	СписокОбъектовПечати = Новый СписокЗначений;
	Массив = КоллекцияПечатныхФорм.ВыгрузитьКолонку("ИмяМакета");
	СписокОбъектовПечати.ЗагрузитьЗначения(Массив);		
	
	Результат.Вставить("ОбъектыПечати", СписокОбъектовПечати);         
	Результат.Вставить("ПараметрыВывода", ПараметрыВывода);
	
	Возврат Результат;
	
КонецФункции

// Возвращает ссылку на объект-источник внешней печатной формы.
//
// Параметры:
//  Идентификатор              - Строка - идентификатор формы;
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта метаданных, для которого требуется получить ссылку
//                                        на источник внешней печатной формы.
//
// Возвращаемое значение:
//  Ссылка.
Функция ВнешняяПечатнаяФорма(Идентификатор, ПолноеИмяОбъектаМетаданных)
	
	ВнешняяПечатнаяФормаСсылка = Неопределено;
	
	ПриПолученииВнешнейПечатнойФормы(Идентификатор, ПолноеИмяОбъектаМетаданных, ВнешняяПечатнаяФормаСсылка);
	
	Возврат ВнешняяПечатнаяФормаСсылка;

КонецФункции

// Возвращает список внешних печатных форм.
//
// Параметры:
//  ПолноеИмяОбъектаМетаданных - Строка - полное имя объекта метаданных, для которого необходимо получить список
//                                        печатных форм.
//
// Возвращаемое значение:
//  Список:
//   * Значение      - Строка - идентификатор печатной формы;
//   * Представление - Строка - представление печатной формы.
Функция СписокПечатныхФормИзВнешнихИсточников(ПолноеИмяОбъектаМетаданных) Экспорт
	
	ВнешниеПечатныеФормы = Новый СписокЗначений;
	
	Если Не ПустаяСтрока(ПолноеИмяОбъектаМетаданных) Тогда
		ПриПолученииСпискаВнешнихПечатныхФорм(ВнешниеПечатныеФормы, ПолноеИмяОбъектаМетаданных);
	КонецЕсли;
	
	Возврат ВнешниеПечатныеФормы;
	
КонецФункции

// Заполняет список печатных форм из внешних источников.
//
// Параметры:
//   ВнешниеПечатныеФормы - СписокЗначений - Печатные формы.
//       Значение      - Строка - Идентификатор печатной формы.
//       Представление - Строка - Название печатной формы.
//   ПолноеИмяОбъектаМетаданных - Строка - Полное имя объекта метаданных,
//       для которого требуется получить список печатных форм.
//
// Места использования:
//   УправлениеПечатью.ПриПолученииСпискаВнешнихПечатныхФорм().
//
Процедура ПриПолученииСпискаВнешнихПечатныхФорм(ВнешниеПечатныеФормы, ПолноеИмяОбъектаМетаданных) Экспорт
	
	Запрос = НовыйЗапросПоДоступнымКомандам(Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма, ПолноеИмяОбъектаМетаданных);
	
	ТаблицаКоманд = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Команда Из ТаблицаКоманд Цикл
		
		Если _СтрНайти(Команда.Идентификатор, ",") = 0 Тогда // кроме "комплектов"
			ВнешниеПечатныеФормы.Добавить(Команда.Идентификатор, Команда.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует запрос для получения таблицы команд дополнительных отчетов или обработок.
//
// Параметры:
//   ВидОбработок - ПеречислениеСсылка.ВидыДополнительныхОтчетовИОбработок - Вид обработки.
//   Размещение - СправочникСсылка.ИдентификаторыОбъектовМетаданных, Строка - Необязательный.
//       Объект метаданных (Ссылка или ПолноеИмя).
//       Для назначаемых обработок - справочника или документа.
//       Для глобальных обработок - подсистемы.
//   ЭтоФормаОбъекта - Булево - Необязательный.
//       Истина - для формы объекта.
//       Ложь - для формы списка.
//   ТипыКоманд - ПеречислениеСсылка.ВариантыПубликацииДополнительныхОтчетовИОбработок - Тип получаемых команд.
//       - Массив - Типы команд, которые необходимо получить.
//           * ПеречислениеСсылка.ВариантыПубликацииДополнительныхОтчетовИОбработок.
//
// Возвращаемое значение: 
//   ТаблицаЗначений - Команды дополнительных отчетов или обработок.
//       * Ссылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Ссылка дополнительного отчета или обработки.
//       * Идентификатор - Строка - Идентификатор команды, как он задан разработчиком дополнительного объекта.
//       * ВариантЗапуска - ПеречислениеСсылка.СпособыВызоваДополнительныхОбработок -
//           Способ вызова команды дополнительного объекта.
//       * Представление - Строка - Наименование команды в пользовательском интерфейсе.
//       * ПоказыватьОповещение - Булево - Показывать оповещение пользователю после выполнения команды.
//       * Модификатор - Строка - Модификатор команды.
//
Функция НовыйЗапросПоДоступнымКомандам(ВидОбработок, Размещение) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопОтчетыИОбработки.Ссылка КАК Ссылка,
	|	ДопОтчетыИОбработки.Наименование КАК Идентификатор,
	|	ТаблицаКоманды.ПредставлениеОбъекта КАК Представление,
	|	ТаблицаКоманды.ХранилищеВнешнейОбработки КАК ХранилищеВнешнейОбработки
	|ИЗ
	|	Справочник.ВнешниеОбработки.Принадлежность КАК ТаблицаКоманды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнешниеОбработки КАК ДопОтчетыИОбработки
	|		ПО ТаблицаКоманды.Ссылка = ДопОтчетыИОбработки.Ссылка
	|			И (ДопОтчетыИОбработки.ВидОбработки = &Вид)
	|			И (ДопОтчетыИОбработки.ПометкаУдаления = ЛОЖЬ)
	|			И (ТаблицаКоманды.ПредставлениеОбъекта ПОДОБНО ""%" + Метаданные.НайтиПоПолномуИмени(Размещение).Синоним + "%"")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Идентификатор";
	
	Запрос.УстановитьПараметр("Вид", ВидОбработок);
	
	Возврат Запрос;
	
КонецФункции

Процедура СообщитьПечатнаяФормаНедоступна(Объект)
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Печать %1 не выполнена: выбранная печатная форма недоступна.'"), Объект);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект);

КонецПроцедуры

// Подготовить структуру параметров вывода для менеджера объекта формирующего печатные формы.
//
Функция ПодготовитьСтруктуруПараметровВывода() Экспорт
	
	ПараметрыВывода = Новый Структура;
	ПараметрыВывода.Вставить("ДоступнаПечатьПоКомплектно", Ложь); // не используется
	
	СтруктураПараметровПисьма = Новый Структура("Получатель,Тема,Текст", Неопределено, "", "");
	ПараметрыВывода.Вставить("ПараметрыОтправки", СтруктураПараметровПисьма);
	
	Возврат ПараметрыВывода;
	
КонецФункции

// Подготовить коллекцию печатных форм - таблицу значений используемые при формировании печатных форм.
//
Функция ПодготовитьКоллекциюПечатныхФорм(Знач ИменаМакетов) Экспорт
	
	Макеты = Новый ТаблицаЗначений;
	Макеты.Колонки.Добавить("ИмяМакета");
	Макеты.Колонки.Добавить("ИмяВРЕГ");
	Макеты.Колонки.Добавить("СинонимМакета");
	Макеты.Колонки.Добавить("ТабличныйДокумент");
	Макеты.Колонки.Добавить("Экземпляров");
	Макеты.Колонки.Добавить("Картинка");
	Макеты.Колонки.Добавить("ПолныйПутьКМакету");
	Макеты.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	
	Если ТипЗнч(ИменаМакетов) = Тип("Строка") Тогда
		ИменаМакетов = _СтрРазделить(ИменаМакетов, ",");
	КонецЕсли;
	
	Для Каждого ИмяМакета Из ИменаМакетов Цикл
		
		Макет = Макеты.Найти(ИмяМакета, "ИмяМакета");
		
		Если Макет = Неопределено Тогда
			
			Макет = Макеты.Добавить();
			Макет.ИмяМакета = ИмяМакета;
			Макет.ИмяВРЕГ = ВРег(ИмяМакета);
			Макет.Экземпляров = 1;
			
		Иначе
			Макет.Экземпляров = Макет.Экземпляров + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Макеты;
	
КонецФункции

// Возвращает ссылку на объект внешней печатной формы.
//
Процедура ПриПолученииВнешнейПечатнойФормы(Идентификатор, ПолноеИмяОбъектаМетаданных, ВнешняяПечатнаяФормаСсылка) Экспорт
	
	Запрос = НовыйЗапросПоДоступнымКомандам(Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма, ПолноеИмяОбъектаМетаданных);
	
	ТаблицаКоманд = Запрос.Выполнить().Выгрузить();
	
	Команда = ТаблицаКоманд.Найти(Идентификатор, "Идентификатор");
	
	Если Команда <> Неопределено Тогда 
		ВнешняяПечатнаяФормаСсылка = Команда.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

//Фукнция раскладывает переданный массив сслылок в соотвествие по типам этих ссылок
//
//	Параметры:
//		МассивСсылок - Массив - массив ссылок на объекты информационной базы
//  Возвращаемое значение:
//		Соотвествие:
//			Ключ - полное имя типа ссылки
//	        Значение - массив ссылок этого типа
//
Функция СоответствиеМассивовПоТипамОбъектов(МассивСсылок) Экспорт
	
	СоответствиеТипов = Новый Соответствие;
	
	Для Каждого Объект Из МассивСсылок Цикл
		
		ТипОбъекта = Объект.Метаданные().ПолноеИмя();
		ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта);
		
		Если ТекущийТипОбъекта = Неопределено Тогда
			
			СоответствиеТипов.Вставить(ТипОбъекта, Новый Массив);
			ТекущийТипОбъекта = СоответствиеТипов.Получить(ТипОбъекта);
			
		КонецЕсли;
		
		ТекущийТипОбъекта.Добавить(Объект);
		
	КонецЦикла;
	
	Возврат СоответствиеТипов;
	
КонецФункции

Функция ПечатьКомплектаДокументов(ОбъектыПечати) Экспорт
	
	МСК.ВыполнитьКомандуПечатиНаПринтер(
	"РегистрСведений.НастройкиПечатиОбъектов",
	"КомплектДокументов",
	ОбъектыПечати,
	Новый Структура);
	
КонецФункции

// Проверка того, что переданный тип является ссылочным типом данных.
// Для типа "Неопределено" возвращается Ложь.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЭтоСсылка(Тип) Экспорт
	
	Возврат Тип <> Тип("Неопределено") 
	И (Справочники.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ Документы.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ Перечисления.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип)
	ИЛИ Задачи.ТипВсеСсылки().СодержитТип(Тип)
	ИЛИ ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип));
	
КонецФункции

// Проверить, нужно ли печатать макет.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - см. ПодготовитьКоллекциюПечатныхФорм();
//  ИмяМакета             - Строка          - имя проверяемого макета.
//
// Возвращаемое значение:
//  Булево - Истина, если макет надо печатать.
Функция НужноПечататьМакет(КоллекцияПечатныхФорм, ИмяМакета) Экспорт
	
	Возврат КоллекцияПечатныхФорм.Найти(ВРег(ИмяМакета), "ИмяВРЕГ") <> Неопределено;
	
КонецФункции

// Добавляет табличный документ в коллекцию печатных форм.
//
// Параметры:
//  КоллекцияПечатныхФорм - ТаблицаЗначений - см. ПодготовитьКоллекциюПечатныхФорм();
//  ИмяМакета             - Строка - имя макета;
//  СинонимМакета         - Строка - представление макета;
//  ТабличныйДокумент     - ТабличныйДокумент - печатная форма документа;
//  Картинка              - Картинка;
//  ПолныйПутьКМакету     - Строка - путь к макету в дереве метаданных, например:
//                                   "Документ.СчетНаОплатуПокупателю.ПФ_MXL_СчетЗаказ".
//                                   Если не указывать этот параметр, то редактирование макета пользователем будет
//                                   недоступно в форме ПечатьДокументов.
//  ИмяФайлаПечатнойФормы - Строка - имя, используемое при сохранении печатной формы в файл;
//                        - Соответствие:
//                           * Ключ     - ЛюбаяСсылка - ссылка на объект печати;
//                           * Значение - Строка - имя файла.
Процедура ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, ИмяМакета, СинонимМакета, ТабличныйДокумент,
	Картинка = Неопределено, ПолныйПутьКМакету = "", ИмяФайлаПечатнойФормы = Неопределено) Экспорт
	
	ОписаниеПечатнойФормы = КоллекцияПечатныхФорм.Найти(ВРег(ИмяМакета), "ИмяВРЕГ");
	
	Если ОписаниеПечатнойФормы <> Неопределено Тогда
		
		ОписаниеПечатнойФормы.ТабличныйДокумент = ТабличныйДокумент;
		ОписаниеПечатнойФормы.СинонимМакета = СинонимМакета;
		ОписаниеПечатнойФормы.Картинка = Картинка;
		ОписаниеПечатнойФормы.ПолныйПутьКМакету = ПолныйПутьКМакету;
		ОписаниеПечатнойФормы.ИмяФайлаПечатнойФормы = ИмяФайлаПечатнойФормы;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывает исключение с текстом Сообщение, если Условие не равно Истина.
// Применяется для самодиагностики кода.
//
// Параметры:
//   Условие                - Булево - если не равно Истина, то вызывается исключение.
//   КонтекстПроверки       - Строка - например, имя процедуры или функции, в которой выполняется проверка.
//   Сообщение              - Строка - текст сообщения. Если не задан, то исключение вызывается с сообщением по
//                                     умолчанию.
//
Процедура Проверить(Знач Условие, Знач Сообщение = "", Знач КонтекстПроверки = "") Экспорт
	
	Если Условие <> Истина Тогда
		
		Если ПустаяСтрока(Сообщение) Тогда
			ТекстИсключения = НСтр("ru = 'Недопустимая операция'"); // Assertion failed
		Иначе
			ТекстИсключения = Сообщение;
		КонецЕсли;
		
		Если Не ПустаяСтрока(КонтекстПроверки) Тогда
			ТекстИсключения = ТекстИсключения + " " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'в %1'"), КонтекстПроверки);
		КонецЕсли;
		
		ВызватьИсключение ТекстИсключения;
		
	КонецЕсли;
	
КонецПроцедуры

// Формирует печатную форму по внешнему источнику.
//
// Параметры:
//   ДополнительнаяОбработкаСсылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - внешняя обработка.
//   ПараметрыИсточника            - Структура - структура со свойствами:
//       * ИдентификаторКоманды - Строка - список макетов, перечисленных через запятую.
//       * ОбъектыНазначения    - Массив
//   КоллекцияПечатныхФорм - ТаблицаЗначений - см. описание процедуры Печать() в документации.
//   ОбъектыПечати         - СписокЗначений  - см. описание процедуры Печать() в документации.
//   ПараметрыВывода       - Структура       - см. описание процедуры Печать() в документации.
//
Процедура ПечатьПоВнешнемуИсточнику(ДополнительнаяОбработкаСсылка, ПараметрыИсточника, КоллекцияПечатныхФорм,
	ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ВнешняяОбработкаОбъект = ПолучитьОбъектВнешнейОбработки(ДополнительнаяОбработкаСсылка);
	
	Если ВнешняяОбработкаОбъект = Неопределено Тогда
		#Если Клиент Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Внешняя обработка ""%1"" (тип ""%2"") не обслуживается подсистемой ""%3""'"),
			Строка(ДополнительнаяОбработкаСсылка),
			Строка(ТипЗнч(ДополнительнаяОбработкаСсылка)),
			"");
		#КонецЕсли
	КонецЕсли;
	
	КоллекцияПечатныхФорм = МСК.ПодготовитьКоллекциюПечатныхФорм(ПараметрыИсточника.ИдентификаторКоманды);
	ПараметрыВывода = МСК.ПодготовитьСтруктуруПараметровВывода();
	ПараметрыВывода.Вставить("ДополнительнаяОбработкаСсылка", ДополнительнаяОбработкаСсылка);
	ОбъектыПечати = Новый СписокЗначений;
	
	ВнешняяОбработкаОбъект.Печать(
	ПараметрыИсточника.ОбъектыНазначения[0],
	КоллекцияПечатныхФорм);
	
	// Проверим, все ли макеты были сформированы.
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		
		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			#Если Клиент Тогда 
				ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В обработчике печати не был сформирован табличный документ для: %1'"),
				ПечатнаяФорма.ИмяМакета);
				ВызватьИсключение(ТекстСообщенияОбОшибке);
			#КонецЕсли
		КонецЕсли;	
		
		Если ТипЗнч(ПечатнаяФорма.ТабличныйДокумент) = Тип("ТабличныйДокумент") Тогда
			ПечатнаяФорма.ТабличныйДокумент.КоличествоЭкземпляров = ПечатнаяФорма.Экземпляров;		
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

// Возвращает объект внешнего отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Подключаемый отчет или обработка.
//
// Возвращаемое значение: 
//   * ВнешняяОбработкаОбъект - Объект подключенной обработки.
//   * ВнешнийОтчетОбъект     - Объект подключенного отчета.
//   * Неопределено           - Если передана некорректная ссылка.
//
// Важно:
//   Проверка функциональной опции "ИспользоватьДополнительныеОтчетыИОбработки"
//     должна выполняться вызывающим кодом.
//
Функция ПолучитьОбъектВнешнейОбработки(Ссылка) Экспорт
	
	// Подключение
	ИмяОбработки = ПодключитьВнешнююОбработку(Ссылка);
	
	// Проверка корректности переданных параметров.
	Если ИмяОбработки = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Получение экземпляра объекта.
	Если Ссылка.ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
		Менеджер = ВнешниеОтчеты;
	Иначе
		Менеджер = ВнешниеОбработки;
	КонецЕсли;
	
	Возврат Менеджер.Создать(ИмяОбработки);
	
КонецФункции

// Подключает и возвращает имя, под которым подключен внешний отчет или обработка.
//   После подключения отчет или обработка регистрируется в программе под определенным именем,
//   используя которое можно создавать объект или открывать формы отчета или обработки.
//
// Параметры:
//   Ссылка - СправочникСсылка.ДополнительныеОтчетыИОбработки - Подключаемая обработка.
//
// Возвращаемое значение: 
//   * Строка       - Имя подключенного отчета или обработки.
//   * Неопределено - Если передана некорректная ссылка.
//
// Важно:
//   Проверка функциональной опции "ИспользоватьДополнительныеОтчетыИОбработки"
//     должна выполняться вызывающим кодом.
//
Функция ПодключитьВнешнююОбработку(Ссылка) Экспорт
	
	СтандартнаяОбработка = Истина;
	Результат = Неопределено;
	
	// Проверка корректности переданных параметров.
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.ВнешниеОбработки") 
		Или Ссылка = Справочники.ВнешниеОбработки.ПустаяСсылка() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Подключение
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	ИмяОбработки = ПолучитьИмяВременногоФайла();
	ХранилищеОбработки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ХранилищеВнешнейОбработки");
	ДвоичныеДанные = ХранилищеОбработки.Получить();
	ДвоичныеДанные.Записать(ИмяОбработки);
	Возврат ИмяОбработки;
	#КонецЕсли
	
	Вид = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Вид");
	
	Если Вид = Перечисления.ВидыДополнительныхОтчетовИОбработок.Отчет Тогда
		Менеджер = ВнешниеОтчеты;
	Иначе
		Менеджер = ВнешниеОбработки;
	КонецЕсли;
	
	ПараметрыЗапуска = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "БезопасныйРежим, ХранилищеОбработки");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ПараметрыЗапуска.ХранилищеОбработки.Получить());
	
	ИмяОбработки = Менеджер.Подключить(АдресВоВременномХранилище, , Ложь);
	
	Возврат ИмяОбработки;
	
КонецФункции

Процедура ОтправитьПечатныеФормыПоЭП(знач Документ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Документ.Проведен Тогда
		
		ПараметрКоманды = Новый Массив;
		ПараметрКоманды.Добавить(Документ);		
		ТекГрузополучатель = Документ.Грузополучатель;
		
		Если ЗначениеЗаполнено(ТекГрузополучатель) И 
			(ТекГрузополучатель.ОтправлятьСчетФактуруПоПочте ИЛИ ТекГрузополучатель.ОтправлятьСчетПоПочте
			ИЛИ ТекГрузополучатель.ОтправлятьТорг12ПоПочте) Тогда			
			
			АдресЭлПочты = МСК.ПолучитьЭлектронныйАдрес(ТекГрузополучатель);			
			
			Если ЗначениеЗаполнено(АдресЭлПочты) Тогда				
				
				СписокФорм = Новый СписокЗначений;
				
				МассивОбъектов = Новый Массив;
				МассивОбъектов.Добавить(Документ);
				Рез = СформироватьФайлыДляОтправкиПоЭП("РегистрСведений.НастройкиПечатиОбъектов", "КомплектДокументов", МассивОбъектов, ПараметрКоманды);
				
				ТемаСообщения = "Документы по вашему заказу ";
				
				Для Каждого Зн Из Рез Цикл
					
					Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда		
						
						Если Найти(Зн.представление,"УПД") > 0 Тогда
							
							СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(Документ.Ссылка, "СчетФактураВыданный", Истина);
							
							Если НЕ СчетФактура.Пустая() Тогда
								
								НазваниеПечФормы = ОбщегоНазначения.СформироватьЗаголовокДокумента(СчетФактура, "УПД");
								НазваниеПечФормы = СтрЗаменить(НазваниеПечФормы, "г.", "г");
								
							КонецЕсли;
							
						ИначеЕсли Найти(Зн.представление, "Счет") > 0 Тогда
							
							НазваниеПечФормы = ОбщегоНазначения.СформироватьЗаголовокДокумента(Документ, "Счет");
							НазваниеПечФормы = СтрЗаменить(НазваниеПечФормы, "г.", "г");
							
						Иначе
							НазваниеПечФормы = Зн.Представление;
						КонецЕсли;
						
					КонецЕсли;	
					
					СписокФорм.Добавить(Зн.Значение,НазваниеПечФормы);
					ТемаСообщения = ТемаСообщения + " " + НазваниеПечФормы + ", ";
					
				КонецЦикла;				
				
				ПараметрыОтправки = Новый Структура;
				ПараметрыОтправки.Вставить("Тема", ТемаСообщения);
				ПараметрыОтправки.Вставить("Вложения", ПоместитьТабличныеДокументыВоВременноеХранилище(СписокФорм,Документ));
				ПараметрыОтправки.Вставить("УдалятьФайлыПослеОтправки", Истина);
				ПараметрыОтправки.Вставить("Кому", АдресЭлПочты);					
				ПараметрыОтправки.Вставить("Тело", "Это сообщение сформировано автоматически. Пожалуйста, не отвечайте на него. По всем вопросам обращайтесь к вашим менеджерам");
				ОтправитьПисьмо(ПараметрыОтправки);
				
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция СформироватьФайлыДляОтправкиПоЭП(ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати = Неопределено) 
	
	// Проверим количество объектов.
	Если НЕ ПроверитьКоличествоПереданныхОбъектов(МассивОбъектов) Тогда
		Возврат неопределено;
	КонецЕсли;
	
	// Сформируем табличные документы.
	ПечатныеФормы = МСК.СформироватьПечатныеФормыДляБыстройПечатиОбычноеПриложение(
	ИмяМенеджераПечати, ИменаМакетов, МассивОбъектов, ПараметрыПечати);
	
	Если НЕ ПечатныеФормы.Отказ Тогда
		
		ОбъектыПечати = Новый СписокЗначений;
		ТабличныеДокументы = ПолучитьИзВременногоХранилища(ПечатныеФормы.Адрес);
		
		Для Каждого ОбъектПечати Из ПечатныеФормы.ОбъектыПечати Цикл
			ОбъектыПечати.Добавить(ОбъектПечати.Значение, ОбъектПечати.Ключ);
		КонецЦикла;
		
		ПечатныеФормы.ОбъектыПечати = ОбъектыПечати;
		
	КонецЕсли;
	
	Если ПечатныеФормы.Отказ Тогда
		
		Сообщить("Нет прав для вывода печатной формы на принтер, обратитесь к администратору.");
		Возврат Неопределено;
		
	Иначе
		Возврат ТабличныеДокументы;
	КонецЕсли;
	
	
КонецФункции

Функция ПоместитьТабличныеДокументыВоВременноеХранилище(ТабличныеДокументы,ПечДокумент = Неопределено)
	
	Результат = Новый Соответствие;
	
	// Каталог временных файлов
	ИмяВременнойПапки = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(ИмяВременнойПапки);
	ПолныйПутьКФайлу = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяВременнойПапки);
	
	УИД = Новый УникальныйИдентификатор;
	
	// Сохранение табличных документов.
	Для Каждого ТабличныйДокумент Из ТабличныеДокументы Цикл
		
		Если ТабличныйДокумент.Значение.Вывод = ИспользованиеВывода.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		РасширениеФайла = ".xls";
		ТипФайла        = ТипФайлаТабличногоДокумента.XLS;
		
		Если ТипЗнч(ПечДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И НЕ ПечДокумент.Грузополучатель.Пустая() Тогда		
			
			Если Найти(ТабличныйДокумент.Представление,"УПД") > 0 Тогда 
				
				Если ТипЗнч(ТабличныйДокумент.Значение) = Тип("ТекстовыйДокумент") Тогда 
					
					РасширениеФайла = ".csv";
					ТипФайла = КодировкаТекста.ANSI;
					
				Иначе
					
					Если ПечДокумент.Грузополучатель.ФорматExcel = Перечисления.ФорматExcel.Excel2007 Тогда
						
						РасширениеФайла = ".xlsx";
						ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
						
					КонецЕсли; 
					
				КонецЕсли;
				
			ИначеЕсли Найти(ТабличныйДокумент.Представление,"Счет") > 0 Тогда
				
				Если ПечДокумент.Грузополучатель.ФорматExcelдляСчета = Перечисления.ФорматExcel.Excel2007 Тогда
					
					РасширениеФайла = ".xlsx";
					ТипФайла = ТипФайлаТабличногоДокумента.XLSX;
					
				КонецЕсли;				
				
			КонецЕсли;				
			
		КонецЕсли;		
		
		ИмяФайла = СтрЗаменить(ТабличныйДокумент.Представление, "/", "-") + РасширениеФайла;
		ПолноеИмяФайла = ПолныйПутьКФайлу + ИмяФайла;
		
		ТабличныйДокумент.Значение.Записать(ПолноеИмяФайла, ТипФайла);
		
		Результат.Вставить(ИмяФайла, ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайла), УИД));
		
	КонецЦикла;
	
	УдалитьФайлы(ИмяВременнойПапки);
	
	Возврат Результат;
	
КонецФункции

Процедура Отправитьписьмо(ПараметрыОтправки)
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = ПараметрыОтправки.Тема;
	
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрыОтправки.Кому, ";");
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Возврат;
	КонецПопытки;
	
	Для каждого ТекАдрес Из МассивАдресов Цикл
		Сообщение.Получатели.Добавить(ТекАдрес); 
	КонецЦикла;
	
	Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	
	Если ТипЗнч(ПараметрыОтправки.Вложения) = Тип("Соответствие") Тогда
		
		Для Каждого Вложение Из ПараметрыОтправки.Вложения Цикл
			
			ДанныеВложения = Вложение.Значение;
			
			Если МСК.ПривестиВложениеДляВставкиВПисьмо(ДанныеВложения) Тогда
				Сообщение.Вложения.Добавить(ДанныеВложения, Вложение.Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Попытка
		Почта.Послать(Сообщение);
	Исключение
		ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не отправлено письмо на адрес " + ПараметрыОтправки.Кому);
	Конецпопытки;
	
	Сообщение.Получатели.Очистить();
	Сообщение.Вложения.Очистить();
	Почта.Отключиться();		
	
КонецПроцедуры

// Преобразовывает внутренние форматы вложений к двоичным данным.
//
Функция ПривестиВложениеДляВставкиВПисьмо(Вложение) Экспорт
	
	Если ТипЗнч(Вложение) = Тип("Строка") И ЭтоАдресВременногоХранилища(Вложение) Тогда
		
		Вложение = ПолучитьИзВременногоХранилища(Вложение);
		ПривестиВложениеДляВставкиВПисьмо(Вложение);
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Вложение) = Тип("Картинка") Тогда
		
		Вложение = Вложение.ПолучитьДвоичныеДанные();
		Возврат Истина;
		
	ИначеЕсли ТипЗнч(Вложение) = Тип("Файл") И Вложение.Существует() И Вложение.ЭтоФайл() Тогда
		
		Вложение = Новый ДвоичныеДанные(Вложение.ПолноеИмя);
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция СформироватьКорректировкиДляВыводаНаПечать(Реализация)
	
	МассивСборок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаСборкиЗаказовПокупателя.Ссылка
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
	|ГДЕ
	|	((КорректировкаСборкиЗаказовПокупателя.Контрагент, КорректировкаСборкиЗаказовПокупателя.Грузополучатель) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Контрагент,
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Грузополучатель
	|				ИЗ
	|					Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|				ГДЕ
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &Реализация)
	|			ИЛИ КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|				ИЗ
	|					Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|				ГДЕ
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &Реализация))
	|	И НЕ КорректировкаСборкиЗаказовПокупателя.Исполнено
	|	И КорректировкаСборкиЗаказовПокупателя.Проведен";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);   	
	Таблица = Запрос.Выполнить().Выгрузить();        	
	
	Если Таблица.Количество() > 0 Тогда
		МассивСборок = Таблица.ВыгрузитьКолонку("Ссылка");
	КонецЕсли;           	
	
	Возврат МассивСборок;     	
	
КонецФункции

Функция СформироватьЗаявкиНаВозвратДляВыводаНаПечать(Реализация)

	МассивЗаявок = Новый Массив;
	
	Если ЗначениеЗаполнено(Константы.ДатаНачалаПечатиВозвратныхДокументовПриОтгрузке.Получить()) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.ДатаНачалаПечатиВозвратныхДокументовПриОтгрузке КАК ДатаНачалаПечати
		|ПОМЕСТИТЬ ВТ_КонстантаДатаНачала
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаВозврат.Ссылка,
		|	ЗаявкаНаВозврат.Статус,
		|	ЕСТЬNULL(КатегорииОбъектов.Категория, ЗНАЧЕНИЕ(Справочник.Категорииобъектов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Категорииобъектов.РаспечатаноПриОтгрузке) КАК Распечатан
		|ПОМЕСТИТЬ ВТ_ЗаявкиНаВозврат
		|ИЗ
		|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|		ПО ЗаявкаНаВозврат.Ссылка = КатегорииОбъектов.Объект
		|			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.Категорииобъектов.РаспечатаноПриОтгрузке)),
		|	ВТ_КонстантаДатаНачала КАК ВТ_КонстантаДатаНачала
		|ГДЕ
		|	(ЗаявкаНаВозврат.Реализация.Контрагент, ЗаявкаНаВозврат.Реализация.Грузополучатель) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				РеализацияТоваровУслугДокументыСборкиЗаказов.Контрагент,
		|				РеализацияТоваровУслугДокументыСборкиЗаказов.Грузополучатель
		|			ИЗ
		|				Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|			ГДЕ
		|				РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &Реализация)
		|	И ЗаявкаНаВозврат.Дата >= ВТ_КонстантаДатаНачала.ДатаНачалаПечати
		|	И ЗаявкаНаВозврат.Проведен
		|	И (ЗаявкаНаВозврат.Статус = ""Согласован""
		|			ИЛИ ЗаявкаНаВозврат.Статус = ""На доставке"")
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаявкиНаВозврат.Ссылка,
		|	ВТ_ЗаявкиНаВозврат.Распечатан
		|ИЗ
		|	ВТ_ЗаявкиНаВозврат КАК ВТ_ЗаявкиНаВозврат
		|ГДЕ
		|	НЕ ВТ_ЗаявкиНаВозврат.Распечатан";
		
		Запрос.УстановитьПараметр("Реализация", Реализация);   	
		Таблица = Запрос.Выполнить().Выгрузить();        	
		
		Если Таблица.Количество() > 0 Тогда
			МассивЗаявок = Таблица.ВыгрузитьКолонку("Ссылка");
		КонецЕсли;           	
		
	КонецЕсли;
	
	Возврат МассивЗаявок;     	

КонецФункции

Процедура ЗагрузитьДокументИзСтруктурыПоФабрике(СообщениеJSON, ВидДокумента, ИмяОчереди, Отказ, КоличествоПопытокОбработки = 0)

	//+Белов А. 14.09.2026 #
	Если ВидДокумента = "ЗаказЗаявка" Тогда
		
		НовыйДокСсылка = Документы.ЗаказЗаявка.ПолучитьСсылку(Новый УникальныйИдентификатор(СообщениеJSON.УникальныйИдентификатор));
		
		Если НовыйДокСсылка.ПолучитьОбъект() <> Неопределено Тогда
			
			ЗаписьЖурналаРегистрации("Загрузка документов." + ВидДокумента, УровеньЖурналаРегистрации.Предупреждение,,,"Заказ заявка с идентификатором: " + СообщениеJSON.УникальныйИдентификатор + " уже существует");
			Возврат;

		КонецЕсли;    
		
		Перевозчик = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СообщениеJSON.ПеревозчикКодМДМ);  
		
		Если Не ЗначениеЗаполнено(Перевозчик) Тогда
			
			ЗаписьЖурналаРегистрации("Загрузка документов." + ВидДокумента, УровеньЖурналаРегистрации.Предупреждение,,,"Не найден перевозчик с кодом МДМ: " + СообщениеJSON.ПеревозчикКодМДМ);
			Возврат;

		КонецЕсли; 
		
		НовыйДок = Документы.ЗаказЗаявка.СоздатьДокумент(); 
		НовыйДок.ЗагруженИзСтороннейБазы = Истина;
		НовыйДок.УстановитьСсылкуНового(НовыйДокСсылка);
		НовыйДок.Организация = Константы.ОсновнаяОрганизация.Получить();
		НовыйДок.Дата = Дата(СообщениеJSON.Дата);
		НовыйДок.Номер = СообщениеJSON.Номер;  
		НовыйДок.Контрагент = Перевозчик;    
		НовыйДок.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СообщениеJSON.ДоговорПеревозчикаКодМДМ);    
		НовыйДок.ТелефонКонтрагента = СообщениеJSON.ТелефонКонтрагента;
		НовыйДок.ДатаПогрузки = XMLЗначение(Тип("Дата"), СообщениеJSON.ДатаПогрузки);
		НовыйДок.КоличествоГрузомест = СообщениеJSON.КоличествоГрузомест;
		НовыйДок.ВесГруза = СообщениеJSON.ВесГруза;
		НовыйДок.ОбъемГруза = СообщениеJSON.ОбъемГруза;
		НовыйДок.Грузоподъемность = СообщениеJSON.Грузоподъемность;
		НовыйДок.Вместимость = СообщениеJSON.Вместимость;
		НовыйДок.ОтветПеревозчика = ОбщегоНазначения.ВернутьJSON(СообщениеJSON.ОтветПеревозчика); 
		
		Для каждого Стр Из СообщениеJSON.Грузополучатели Цикл
			
			НСтр = НовыйДок.Грузополучатели.Добавить();
			НСтр.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", Стр.ГрузополучательКодМДМ);  
			
		КонецЦикла;  
		
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		
		
	//-Белов А. 14.09.2026 #
	ИначеЕсли ВидДокумента = "ПоступлениеБезналичныхДенежныхСредств" Тогда
		
		//Получим основные поля из структуры документа в сообщении
		НомерДок = СокрЛП(СообщениеJSON.НомерДокумента);
		ДатаДок = Дата(СообщениеJSON.ДатаДокумента);
		ГУИДДокумента = СообщениеJSON.УникальныйИдентификатор;
		Статус = СообщениеJSON.Статус;
		ШтампВерсии = СообщениеJSON.ШтампВерсии;
		КодДоговора = СообщениеJSON.КодДоговораМДМ;
		КодКонтрагента = СообщениеJSON.КодКонтрагентаМДМ;
		Сумма = СообщениеJSON.Сумма;
		НазначениеПлатежа = СообщениеJSON.НазначениеПлатежа;
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КодКонтрагента); 
		
		Если Не ЗначениеЗаполнено(Контрагент) тогда			
			
			ЗаписьЖурналаРегистрации("Загрузка документов.Поступление безналичных денежных средств", УровеньЖурналаРегистрации.Предупреждение,,, 
			"Не найден контрагент по ГУИД: " + КодКонтрагента + "; ВидДокумента " + ВидДокумента);
			Возврат;
			
		КонецЕсли;  
		
		Если ЗначениеЗаполнено(КодДоговора) тогда
			Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", КодДоговора);
		Иначе
			Договор = Неопределено;
		КонецЕсли;
		
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		
		//Поиск существующих документов
		ДокПоступления = Документы.ПлатежноеПоручениеВходящее.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		
		Если ЗначениеЗаполнено(ДокПоступления.ВерсияДанных) Тогда
			Док = ДокПоступления.ПолучитьОбъект();
		Иначе
			
			//на всякий случай поищем по контрагенту, дате и сумме документа
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПлатежноеПоручениеВходящее.Ссылка
			|ИЗ
			|	Документ.ПлатежноеПоручениеВходящее КАК ПлатежноеПоручениеВходящее
			|ГДЕ
			|	ПлатежноеПоручениеВходящее.Дата МЕЖДУ &ДатаН И &ДатаК
			|	И ПлатежноеПоручениеВходящее.Контрагент = &Контрагент
			|	И ПлатежноеПоручениеВходящее.СуммаДокумента = &СуммаДокумента
			|	И НЕ ПлатежноеПоручениеВходящее.НомерВходящегоДокумента ПОДОБНО ""%МТУТ%"""; 
			
			Запрос.УстановитьПараметр("ДатаН", НачалоДня(ДатаДок));
			Запрос.УстановитьПараметр("ДатаК", КонецДня(ДатаДок));
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.УстановитьПараметр("СуммаДокумента", Сумма); 
			
			Выб = Запрос.Выполнить().Выбрать();  
			
			Если Выб.Следующий() тогда
				Док = Выб.Ссылка.ПолучитьОбъект();
			Иначе
				
				Док = Документы.ПлатежноеПоручениеВходящее.СоздатьДокумент();
				Док.УстановитьСсылкуНового(ДокПоступления);
				
			КонецЕсли;  
			
		КонецЕсли;
		
		Если Док.ПометкаУдаления тогда
			Док.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		Если Док.Проведен тогда
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		Док.РасшифровкаПлатежа.Очистить();
		
		Док.Дата 				= ДатаДок;
		Док.Организация 		= Организация;
		Док.ОтраженоВОперУчете 	= Истина;
		Док.Контрагент 			=  Контрагент;
		Док.ДоговорКонтрагента 	=  Договор;
		Док.Оплачено 			= Истина;
		Док.ВалютаДокумента 	= Константы.ВалютаРегламентированногоУчета.Получить();
		Док.КурсДокумента 		= 1;
		Док.КратностьДокумента 	= 1;
		Док.Ответственный 		= ПараметрыСеанса.ТекущийПользователь;
		Док.ДатаОплаты 			= Док.Дата;
		Док.ВидОперации 		= Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
		Док.СчетОрганизации 	= Организация.ОсновнойБанковскийСчет;
		Док.СуммаДокумента 		= Сумма;
		Док.СозданРуками 			= Истина;
		Док.НомерВходящегоДокумента = НомерДок;
		Док.НазначениеПлатежа = НазначениеПлатежа;
		Док.ДатаВходящегоДокумента = Док.Дата;
		
		Если Договор.ВестиПоДокументамРасчетовСКонтрагентом Тогда 
			
			СтруктураПараметров = Новый Структура;
			
			СтруктураПараметров.Вставить("Организация"					, Док.Организация);
			СтруктураПараметров.Вставить("Контрагент"					, Док.Контрагент);
			СтруктураПараметров.Вставить("ВалютаДокумента"				, Док.ВалютаДокумента);
			СтруктураПараметров.Вставить("СуммаДокумента"				, Док.СуммаДокумента);
			СтруктураПараметров.Вставить("ДатаДок"						, Док.Дата - 1);
			СтруктураПараметров.Вставить("ВидОперацииДок"				, Док.ВидОперации);
			СтруктураПараметров.Вставить("РасшифровкаПлатежа"			, Док.РасшифровкаПлатежа);
			СтруктураПараметров.Вставить("КурсДокумента"				, 1);
			СтруктураПараметров.Вставить("КратностьДокумента"			, 1);
			СтруктураПараметров.Вставить("ТипЗадолженности"				, ">0");
			СтруктураПараметров.Вставить("Интерактивно"					, Ложь);
			СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов"	, Ложь);
			
			СтруктураПараметровАвто = Новый Структура;
			СтруктураПараметровАвто.Вставить("УчитыватьФактическиеЗадолженности" , Истина);
			СтруктураПараметровАвто.Вставить("УчитыватьОперативныеЗадолженности" , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьСумму"			    , Истина);
			СтруктураПараметровАвто.Вставить("ПодборПоСуммеПлатежа"			, Истина);
			СтруктураПараметровАвто.Вставить("СуммаДляПодбора"			    , Док.СуммаДокумента);
			СтруктураПараметровАвто.Вставить("СпособЗаполнения"			    , "ФИФО");
			СтруктураПараметровАвто.Вставить("ПоЗаявкам"				    , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьПланируемыеДвижения"	, Ложь);
			СтруктураПараметровАвто.Вставить("НеПревышатьЗапланированныхЗначений", Ложь);
			СтруктураПараметровАвто.Вставить("ВключенныеВПлатежныйКалендарь", Ложь);
			
			//отбор по конкретному договору 
			Построитель = Новый ПостроительОтчета;
			Построитель.Текст = "ВЫБРАТЬ
			|    ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента,
			|    ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток,
			|    ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток
			|ИЗ
			|    РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(, Контрагент = &Контрагент {(ДоговорКонтрагента).*}) КАК ВзаиморасчетыСКонтрагентамиОстатки";    
			
			ПолеДоговора = Построитель.Отбор.Добавить("ДоговорКонтрагента");			
			ПолеДоговора.ВидСравнения = ВидСравнения.Равно;
			ПолеДоговора.Использование = Истина;
			ПолеДоговора.Значение = Договор;
			ОтборПоДоговорам = Построитель.ПолучитьНастройки();
			
			СтруктураПараметровАвто.Вставить("ОтборПоДоговорам", ОтборПоДоговорам);		
			
			СтруктураПараметров.Вставить("СтруктураПараметровАвто"		, СтруктураПараметровАвто);
			СтруктураПараметров.Вставить("ФормаОплаты"					, Перечисления.ВидыДенежныхСредств.Безналичные);
			СтруктураПараметров.Вставить("ВидОперацииПлан"				, УправлениеДенежнымиСредствами.ОпределитьВидОперацииПлан(Док.ВидОперации));
			СтруктураПараметров.Вставить("ИмяРегистраПлан"				, "ЗаявкиНаРасходованиеСредств");
			СтруктураПараметров.Вставить("БанковскийСчетКасса"			, Док.СчетОрганизации);
			СтруктураПараметров.Вставить("СсылкаНаДокумент"				, ?(Док.Проведен, Док.Ссылка, Док));
			
			УправлениеДенежнымиСредствами.ЗаполнитьРасшифровкуПлатежей(СтруктураПараметров);
			
			Для Каждого СтрокаДокумента Из Док.РасшифровкаПлатежа Цикл 
				
				СтрокаДокумента.СтавкаНДС = ?(Док.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
				УправлениеДенежнымиСредствами.ЗаполнитьРеквизитыРеглУчета(Док.Ссылка,СтрокаДокумента,СтрокаДокумента.СтавкаНДС);
				
			КонецЦикла;
			
		Иначе
			
			НоваяСтрокаТЧ = Док.РасшифровкаПлатежа.Добавить();
			НоваяСтрокаТЧ.ДоговорКонтрагента 	= Договор;
			НоваяСтрокаТЧ.СуммаПлатежа 			= Сумма;
			НоваяСтрокаТЧ.СуммаВзаиморасчетов 	= Сумма; 
			
			Если Док.Дата >= Дата("20260101000000") Тогда 
				
				НоваяСтрокаТЧ.СтавкаНДС  			= Перечисления.СтавкиНДС.НДС22;
				ЗначениеСтавкиНДС = 22;
				
			Иначе
				
				НоваяСтрокаТЧ.СтавкаНДС  			= Перечисления.СтавкиНДС.НДС20;
				ЗначениеСтавкиНДС = 20;
			
			КонецЕсли;
			
			НоваяСтрокаТЧ.СуммаНДС  			= НоваяСтрокаТЧ.СуммаПлатежа*ЗначениеСтавкиНДС/(100+ЗначениеСтавкиНДС);
			НоваяСтрокаТЧ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
			НоваяСтрокаТЧ.КурсВзаиморасчетов 	= 1;
			НоваяСтрокаТЧ.КратностьВзаиморасчетов = 1;				
			
		КонецЕсли;
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			
			Если КоличествоПопытокОбработки = 0 Тогда
				ЗаписьЖурналаРегистрации("Загрузка документов.Поступление безналичных денежных средств.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли; 	
			
			СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ВызватьИсключение СтрокаИсключения;
			
		КонецПопытки; 		
		
		Если Статус = 1 тогда
			
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				Если КоличествоПопытокОбработки = 0 Тогда
					ЗаписьЖурналаРегистрации("Загрузка документов.Поступление безналичных денежных средств.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецЕсли; 				
				
				СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение СтрокаИсключения;
				
			КонецПопытки; 		
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ДокПоступления.Ссылка);				
		
	ИначеЕсли ВидДокумента = "ЗаказНаПеремещение" Тогда
		
		ГУИДДокумента = СообщениеJSON.ИДДокументаВСмежнойБазе;
		СтатусСогласованияСтр = СообщениеJSON.СтатусСогласования;
		НомерСообщенияWMS = "";
		
		КодМДМОрганизацииВСмежнойБазе = ?(СообщениеJSON.Свойство("ОрганизацияКодМДМ"), СообщениеJSON.ОрганизацияКодМДМ, "");

		Если СообщениеJSON.Свойство("НомерСообщенияWMS", НомерСообщенияWMS) Тогда
			НомерСообщенияWMS = СообщениеJSON.НомерСообщенияWMS;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГУИДДокумента) Тогда
			
			ДокВозвратПоставщику = Документы.ВозвратТоваровПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
			Док = ДокВозвратПоставщику.ПолучитьОбъект();
			
			Если ЗначениеЗаполнено(СтатусСогласованияСтр) Тогда
				СтатусСогласования = Перечисления.СтатусыСогласованияРеклВозвратов[СтатусСогласованияСтр];
			Иначе
				СтатусСогласования = Док.СтатусСогласования;
			КонецЕсли;
			
			Если Док <> Неопределено И (Док.СтатусСогласования <> СтатусСогласования Или Док.НомерСообщенияWMS <> НомерСообщенияWMS
				Или Док.КодМДМОрганизацииВСмежнойБазе <> КодМДМОрганизацииВСмежнойБазе) Тогда
				
				Док.СтатусСогласования = СтатусСогласования;
				Док.НомерСообщенияWMS = НомерСообщенияWMS;
				Док.КодМДМОрганизацииВСмежнойБазе = КодМДМОрганизацииВСмежнойБазе;
				Док.ОбменДанными.Загрузка = Истина;
				Док.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли ВидДокумента = "КорректировкаПоступления" Тогда
		
		ГУИДКорректировки = СообщениеJSON.УникальныйИдентификатор; 
		
		Статус = СообщениеJSON.Статус;
		
		Если ЗначениеЗаполнено(ГУИДКорректировки) Тогда
			ДокКорректировкаРТУ = Документы.КорректировкаРеализации.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе",ГУИДКорректировки);
		Иначе
			ДокКорректировкаРТУ = Документы.КорректировкаРеализации.ПустаяСсылка();
		КонецЕсли; 		
		
		Если ДокКорректировкаРТУ.Пустая() Тогда			
			
			ГУИДДокументаРТУ = СообщениеJSON.РодительДокументаОснования;
			
			Если ЗначениеЗаполнено(ГУИДДокументаРТУ) Тогда 
				
				ДокументРТУ = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокументаРТУ));
				ТекОснование  = ДокументРТУ;
				ОбъектДокКорретировкаРТУ = Документы.КорректировкаРеализации.СоздатьДокумент();
				ДокОснование = ОбъектДокКорретировкаРТУ.ПолучитьПоследнийКорректирующийДокумент(ТекОснование);
				
				Пока ТекОснование <> ДокОснование Цикл
					
					ТекОснование = ДокОснование;
					ДокОснование = ОбъектДокКорретировкаРТУ.ПолучитьПоследнийКорректирующийДокумент(ТекОснование);
					
				КонецЦикла;				
				
				ОбъектДокКорретировкаРТУ.ИДДокументаВСмежнойБазе = ГУИДКорректировки;
				ОбъектДокКорретировкаРТУ.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
				ОбъектДокКорретировкаРТУ.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
				
			КонецЕсли;
			
		Иначе
			
			ОбъектДокКорретировкаРТУ = ДокКорректировкаРТУ.ПолучитьОбъект();
			ДокОснование = ОбъектДокКорретировкаРТУ.ИсправляемыйДокументРеализации;
			ОбъектДокКорретировкаРТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			
		КонецЕсли;
		
		ОбъектДокКорретировкаРТУ.Заполнить(ДокОснование);
		ОбъектДокКорретировкаРТУ.Дата =  Дата(СообщениеJSON.ДатаДокумента); 
		ОбъектДокКорретировкаРТУ.Записать(РежимЗаписиДокумента.Запись);   
		СписокТоваров = СообщениеJSON.Товары;
		
		Для Каждого СтрокаСпискаТоваров Из СписокТоваров Цикл
			
			СтрокиВДокументе = ОбъектДокКорретировкаРТУ.Товары.НайтиСтроки(Новый Структура("Номенклатура",
			Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.КодМДМНоменклатуры)));
			
			Если НЕ СтрокиВДокументе.Количество() = 0  Тогда
				
				КоличествоКорректируем = СтрокаСпискаТоваров.КоличествоДоИзменения - СтрокаСпискаТоваров.Количество;
				
				Для Каждого СтрокаВДокументе из СтрокиВДокументе Цикл
					
					Если КоличествоКорректируем = 0 Тогда Прервать;КонецЕсли; 
					
					
					Если СтрокаВДокументе.Количество = 0 Тогда
						Продолжить;
					ИначеЕсли СтрокаВДокументе.Количество >= КоличествоКорректируем Тогда
						
						СтрокаВДокументе.Количество = СтрокаВДокументе.Количество-КоличествоКорректируем;
						КоличествоКорректируем = 0;
						
					Иначе
						
						КоличествоКорректируем = КоличествоКорректируем-СтрокаВДокументе.Количество;
						СтрокаВДокументе.Количество = 0;
						
					КонецЕсли;					
					
					СтрокаВДокументе.ОтражатьТоварныйУчет = Истина;
					СтрокаВДокументе.Сумма = СтрокаВДокументе.Количество * СтрокаВДокументе.Цена;
					СтрокаВДокументе.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаВДокументе.Сумма, ОбъектДокКорретировкаРТУ.УчитыватьНДС, 
					ОбъектДокКорретировкаРТУ.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаВДокументе.СтавкаНДС));
					
				КонецЦикла;				
				
			КонецЕсли;			
			
		КонецЦикла;
		
		Попытка
			
			Если Статус = 1 Тогда
				ОбъектДокКорретировкаРТУ.Записать(РежимЗаписиДокумента.Проведение); 
			Иначе 
				
				Если ОбъектДокКорретировкаРТУ.Проведен Тогда
					ОбъектДокКорретировкаРТУ.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
				Иначе
					ОбъектДокКорретировкаРТУ.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ОбъектДокКорретировкаРТУ.Ссылка);
			
		Исключение   
			
			ТекстДействие = ?(Статус = 1, "Ошибка проведения документа: ", "Ошибка отмены проведения документа: ");
			
			ЗаписьЖурналаРегистрации("Загрузка документов.Корректировка реализации.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
										ТекстДействие + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрокаИсключения;
			
		КонецПопытки;
		
	ИначеЕсли ВидДокумента = "СостояниеЭДО" Тогда 
		
		ГУИДРеализации = СообщениеJSON.ГУИД;
		ТипДокумента   = СообщениеJSON.ТипДокумента;
		
		Если ЗначениеЗаполнено(ГУИДРеализации) Тогда 		
			ДокРТУ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДРеализации));
		Иначе
			ДокРТУ = Документы[ТипДокумента].ПустаяСсылка();
		КонецЕсли; 	  
		
		Если ДокРТУ.ПолучитьОбъект() = Неопределено Тогда
			
			ПромНомерДокумента = СообщениеJSON.Номер;
			ПрефиксОрганизации = СтрЗаменить(Сред(ПромНомерДокумента, 1, Найти(ПромНомерДокумента, "00-") - 1), "00-", "");
			НомерДокумента = Сред(ПромНомерДокумента, Найти(ПромНомерДокумента, "00-") + 3, СтрДлина(ПромНомерДокумента));
			НомерДляПоиска = СокрЛП(ПрефиксОрганизации) + СтроковыеФункцииКлиентСервер.ДополнитьСтроку(НомерДокумента, 11 - СтрДлина(ПрефиксОрганизации), "0", "СЛЕВА");
			
			ПромДатаДокумента  = Дата(СообщениеJSON.Дата);
			ДокРТУ = Документы[ТипДокумента].НайтиПоНомеру(НомерДляПоиска, ПромДатаДокумента);	
			
		КонецЕсли;
		
		Если НЕ ДокРТУ.Пустая() Тогда
			
			ТекСостояниеЭДО = Перечисления.СостояниеЭДО[СообщениеJSON.СостояниеЭДО];
			
			Попытка
				
				ЗаписатьСостояниеЭДО(ДокРТУ,ТекСостояниеЭДО);
				
				Если ТипДокумента = "РеализацияТоваровУслуг" Тогда
					
					Если ТекСостояниеЭДО = Перечисления.СостояниеЭДО.Аннулирован  Тогда 
						
						Рег = РегистрыСведений.ВозвращенныеДокументы.СоздатьНаборЗаписей();
						Рег.Отбор.Коробка.Установить(Справочники.КоробкиХраненияДокументов.КоробкаЭДО);
						Рег.Отбор.Документ.Установить(ДокРТУ);
						Рег.Отбор.НеАктуально.Установить(Ложь);
						Рег.Прочитать();
						
						Если Рег.Количество() = 0 тогда
							
							Запись = Рег.Добавить();
							запись.Документ = ДокРТУ;
							Запись.Коробка = Справочники.КоробкиХраненияДокументов.КоробкаЭДО;
							Запись.ОригиналыПолучены = Истина;
							Запись.ДатаПолучения = ТекущаяДата();
							Запись.НомерПоПорядку = обработки.ВозвращенныеДокументы.Создать().ПолучитьМаксимальныйНомерПоПорядку(Справочники.КоробкиХраненияДокументов.КоробкаЭДО);
							
						Иначе
							Запись = Рег[0];
						КонецЕсли;
						
						Запись.НасУстраивает = Ложь; 
						Запись.НетПечати = Ложь;
						Запись.ФИО = "";
						Запись.СуммаДокумента = ДокРТУ.СуммаДокумента;
						Запись.ДатаПоследнегоИзменения = ТекущаяДата();
						Рег.Записать();
						
					КонецЕсли;
					
				КонецЕсли;
			Исключение
				//Отказ = Истина;
			КонецПопытки;
			
		КонецЕсли;                                                                                    		

	ИначеЕсли ВидДокумента = "СписаниеБезналичныхДенежныхСредств" Тогда 
		
		Если Не СообщениеJSON.ВидОперации = "ВозвратОплатыКлиенту" Тогда
			Возврат;
		КонецЕсли;		
		
		//Получим основные поля из структуры документа в сообщении
		НомерДок = СокрЛП(СообщениеJSON.НомерДокумента);
		ДатаДок = Дата(СообщениеJSON.ДатаДокумента);
		ГУИДДокумента = СообщениеJSON.УникальныйИдентификатор;
		Статус = СообщениеJSON.Статус;
		ШтампВерсии = СообщениеJSON.ШтампВерсии;
		КодДоговора = СообщениеJSON.КодДоговораМДМ;
		КодКонтрагента = СообщениеJSON.КодКонтрагентаМДМ;
		Сумма = СообщениеJSON.Сумма;
		НазначениеПлатежа = СообщениеJSON.НазначениеПлатежа;
		Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КодКонтрагента);
		
		Если Не ЗначениеЗаполнено(Контрагент) Тогда			
			
			ЗаписьЖурналаРегистрации("Загрузка документов.Списание безналичных денежных средств", УровеньЖурналаРегистрации.Предупреждение,,, 
			"Не найден контрагент по ГУИД: " + КодКонтрагента + "; ВидДокумента " + ВидДокумента);
			Возврат;			
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодДоговора) Тогда
			Договор = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", КодДоговора);
		Иначе
			Договор = Неопределено;
		КонецЕсли;
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		
		//Поиск существующих документов
		ППИсходящее = Документы.ПлатежноеПоручениеИсходящее.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		
		Если ЗначениеЗаполнено(ППИсходящее.ВерсияДанных) Тогда
			Док = ППИсходящее.ПолучитьОбъект();
		Иначе
			
			//на всякий случай поищем по контрагенту, дате и сумме документа
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПлатежноеПоручениеИсходящее.Ссылка
			|ИЗ
			|	Документ.ПлатежноеПоручениеИсходящее КАК ПлатежноеПоручениеИсходящее
			|ГДЕ
			|	ПлатежноеПоручениеИсходящее.Дата МЕЖДУ &ДатаН И &ДатаК
			|	И ПлатежноеПоручениеИсходящее.Контрагент = &Контрагент
			|	И ПлатежноеПоручениеИсходящее.СуммаДокумента = &СуммаДокумента
			|	И ПлатежноеПоручениеИсходящее.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ДатаН", НачалоДня(ДатаДок));
			Запрос.УстановитьПараметр("ДатаК", КонецДня(ДатаДок));
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			Запрос.УстановитьПараметр("СуммаДокумента", Сумма);
			Выб = Запрос.Выполнить().Выбрать();
			
			Если Выб.Следующий() Тогда
				Док = Выб.Ссылка.ПолучитьОбъект();
			Иначе
				
				Док = Документы.ПлатежноеПоручениеИсходящее.СоздатьДокумент();
				Док.УстановитьСсылкуНового(ППИсходящее);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Док.ПометкаУдаления Тогда
			Док.ПометкаУдаления = Ложь;
		КонецЕсли;
		
		Если Док.Проведен Тогда
			Док.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		Док.РасшифровкаПлатежа.Очистить();
		
		Док.Дата 					= ДатаДок;
		Док.Организация 			= Организация;
		Док.ОтраженоВОперУчете 		= Истина;
		Док.Контрагент 				= Контрагент;
		Док.ДоговорКонтрагента 		= Договор;
		Док.Оплачено 				= Истина;
		Док.ВалютаДокумента 		= Константы.ВалютаРегламентированногоУчета.Получить();
		Док.КурсДокумента 			= 1;
		Док.КратностьДокумента 		= 1;
		Док.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
		Док.ДатаОплаты 				= Док.Дата;
		Док.ВидОперации 			= Перечисления.ВидыОперацийППИсходящее.ВозвратДенежныхСредствПокупателю;
		Док.СчетОрганизации 		= Организация.ОсновнойБанковскийСчет;
		Док.СуммаДокумента 			= Сумма;		
		Док.НазначениеПлатежа 		= НазначениеПлатежа;		
		Док.ОчередностьПлатежа 		= 6;
		Док.Комментарий 			= НазначениеПлатежа + " (" + НомерДок + ")";
		
		НоваяСтрокаТЧ = Док.РасшифровкаПлатежа.Добавить();
		НоваяСтрокаТЧ.ДоговорКонтрагента 	= Договор;
		НоваяСтрокаТЧ.СуммаПлатежа 			= Сумма;
		НоваяСтрокаТЧ.СуммаВзаиморасчетов 	= Сумма;
		НоваяСтрокаТЧ.СтавкаНДС  			= ?(Док.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		ЗначениеСтавкиНДС 					= 20;
		НоваяСтрокаТЧ.СуммаНДС  			= НоваяСтрокаТЧ.СуммаПлатежа * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
		НоваяСтрокаТЧ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПокупателю;
		НоваяСтрокаТЧ.КурсВзаиморасчетов 	= 1;
		НоваяСтрокаТЧ.КратностьВзаиморасчетов = 1;		
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);
		Исключение			
			
			Если КоличествоПопытокОбработки = 0 Тогда
				ЗаписьЖурналаРегистрации("Загрузка документов.Списание безналичных денежных средств.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецЕсли; 	
			
			СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ВызватьИсключение СтрокаИсключения;			
			
		КонецПопытки; 		
		
		Если Статус = 1 Тогда
			
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение				
				
				Если КоличествоПопытокОбработки = 0 Тогда
					ЗаписьЖурналаРегистрации("Загрузка документов.Списание безналичных денежных средств.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецЕсли;				
				
				СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ВызватьИсключение СтрокаИсключения;				
				
			КонецПопытки;			
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ППИсходящее.Ссылка);		
		
	ИначеЕсли ВидДокумента = "УстановкаЦенНоменклатуры" Тогда
		
		ГУИДУстановкиЦен = СообщениеJSON.УникальныйИдентификатор;
		
		АвторДокументаWebadmin = СообщениеJSON.АвторWebadmin;
		
		Если АвторДокументаWebadmin Тогда 
			ОтветственныйДокумента = Справочники.Пользователи.НайтиПоКоду("webadmin");	
		Иначе
			
			ОтветственныйДокумента = Справочники.Пользователи.НайтиПоКоду("robot_op");
			
			Если ОтветственныйДокумента.Пустая() Тогда
				ОтветственныйДокумента = Справочники.Пользователи.НайтиПоКоду("robot");
			КонецЕсли;

		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГУИДУстановкиЦен) Тогда 
			
			ДокУстановкаЦен = Документы.УстановкаЦенНоменклатуры.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ГУИДУстановкиЦен);  
			
			Если НЕ ДокУстановкаЦен.Пустая() Тогда    
				
				ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Документ с ИД документа '"
				+ ГУИДУстановкиЦен + "' уже загружен ");
				Возврат;
				
			Иначе
				
				ДокУстановкаЦен							   = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
				ДокУстановкаЦен.Дата                       =  ТекущаяДата();
				ДокУстановкаЦен.ИДДокументаВСмежнойБазе    = ГУИДУстановкиЦен;				 
				ДокУстановкаЦен.Ответственный              = ?(ОтветственныйДокумента.Пустая(), Справочники.Пользователи.НайтиПоКоду("webadmin"), ОтветственныйДокумента);;
				ДокУстановкаЦен.Комментарий                = "Установка цен " + СокрЛП(СообщениеJSON.НомерДокумента) + " от " + Дата(СообщениеJSON.ДатаДокумента);
				ДокУстановкаЦен.НеПроводитьНулевыеЗначения = Истина;
				
				СоответствиеТиповЦен = Новый Соответствие;
				СписокТиповЦен = СообщениеJSON.ТипыЦен;
				
				Для Каждого СтрокаСпискаТиповЦен Из СписокТиповЦен Цикл
					
					ТипЦеныПоКодМДМ = Справочники.ТипыЦенНоменклатуры.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТиповЦен.ТипЦенКодМДМ);  
					
					Если НЕ ТипЦеныПоКодМДМ.Пустая() Тогда  
						
						НовСтрТипыЦен =  ДокУстановкаЦен.ТипыЦен.Добавить();
						НовСтрТипыЦен.ТипЦен = ТипЦеныПоКодМДМ.Ссылка;
						
						СоответствиеТиповЦен.Вставить(СтрокаСпискаТиповЦен.ТипЦенКодМДМ, ТипЦеныПоКодМДМ);
						
					Иначе             
						ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Не найден тип цены  " + СокрЛП(СтрокаСпискаТиповЦен.ТипЦенНаименование) + " с кодом МДМ " + СокрЛП(СтрокаСпискаТиповЦен.ТипЦенКодМДМ));
					КонецЕсли;
					
				КонецЦикла;
				
				Если ДокУстановкаЦен.ТипыЦен.Количество() = 0 Тогда   
					
					ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Документ с ИД документа '" + ГУИДУстановкиЦен + "' не найден ни один тип цен по кодам МДМ");
					Возврат;
					
				Иначе
					ДокУстановкаЦен.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
				СписокТоваров = СообщениеJSON.Товары;
				
				Для Каждого СтрокаСпискаТоваров Из СписокТоваров Цикл
					
					ТипЦеныПоСоответствию = СоответствиеТиповЦен.Получить(СтрокаСпискаТоваров.ТипЦенКодМДМ); 
					
					Если НЕ ТипЦеныПоСоответствию = Неопределено Тогда       
						
						ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
						
						Если НЕ ТоварПоКодуМДМ.Пустая() Тогда     
							
							ТекЕдиницаХранения = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;							
							
							Если Не ЗначениеЗаполнено(ТекЕдиницаХранения) Тогда
								
								ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
								"У номенклатуры с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ)+ " не заполнена единица хранения остатков.");
								Продолжить;  
								
							КонецЕсли;
							
							НоваяСтрокаТовары				  		 = ДокУстановкаЦен.Товары.Добавить();
							НоваяСтрокаТовары.Номенклатура	  		 = ТоварПоКодуМДМ;
							НоваяСтрокаТовары.ЕдиницаИзмерения		 = ТекЕдиницаХранения;
							НоваяСтрокаТовары.ТипЦен	     		 = ТипЦеныПоСоответствию; 
							НоваяСтрокаТовары.Валюта	      		 = ТипЦеныПоСоответствию.ВалютаЦены;
							НоваяСтрокаТовары.Цена	          		 = СтрокаСпискаТоваров.Цена;
							НоваяСтрокаТовары.ИндексСтрокиТаблицыЦен = СтрокаСпискаТоваров.ИндексСтрокиТаблицыЦен; 
							
						Иначе 
							ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
							"Не найден товар с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ));
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ДокУстановкаЦен.Товары.Количество() = 0 Тогда 
					
					Попытка    
						
						ДокУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
						ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ДокУстановкаЦен.Ссылка);    
						
					Исключение     
						
						ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
						СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 					 
						ВызватьИсключение СтрокаИсключения; 
						
					КонецПопытки;	 
					
				Иначе
					
					ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка создания документа: не заполнена табличная часть 'Товары' ");
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЕсли;		
		
	ИначеЕсли ВидДокумента = "УстановкаЦенНоменклатурыКонтрагентов" Тогда
		
		ГУИДУстановкиЦен = СообщениеJSON.УникальныйИдентификатор;
	
		ОтветственныйДокумента = Справочники.Пользователи.НайтиПоКоду("служебный");
		
		Если ЗначениеЗаполнено(ГУИДУстановкиЦен) Тогда 
			
			ДокУстановкаЦен = Документы.УстановкаЦенНоменклатурыКонтрагентов.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ГУИДУстановкиЦен);  
			
			Если НЕ ДокУстановкаЦен.Пустая() Тогда    
				
				ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Документ с ИД документа '" + ГУИДУстановкиЦен + "' уже загружен ");
				Возврат;
				
			Иначе
				
				ДокУстановкаЦен							   = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
				ДокУстановкаЦен.Дата					   =  Дата(СообщениеJSON.ДатаДокумента);
				ДокУстановкаЦен.ИДДокументаВСмежнойБазе    = ГУИДУстановкиЦен;				 
				ДокУстановкаЦен.Ответственный			   = ?(ОтветственныйДокумента.Пустая(), Справочники.Пользователи.НайтиПоКоду("webadmin"), ОтветственныйДокумента);;
				ДокУстановкаЦен.Комментарий 			   = "Установка цен " + СокрЛП(СообщениеJSON.НомерДокумента) + " от " + Дата(СообщениеJSON.ДатаДокумента);
				ДокУстановкаЦен.НеПроводитьНулевыеЗначения = Истина;
				
				СоответствиеТиповЦен = Новый Соответствие;
				СписокТиповЦен = СообщениеJSON.ТипыЦен;
				
				Для Каждого СтрокаСпискаТиповЦен Из СписокТиповЦен Цикл
					
					ТипЦеныПоКодМДМ = Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТиповЦен.ТипЦенКодМДМ);  
					
					Если НЕ ТипЦеныПоКодМДМ.Пустая() Тогда  
						
						НовСтрТипыЦен =  ДокУстановкаЦен.ТипыЦен.Добавить();
						НовСтрТипыЦен.ТипЦен = ТипЦеныПоКодМДМ.Ссылка;
						
						СоответствиеТиповЦен.Вставить(СтрокаСпискаТиповЦен.ТипЦенКодМДМ, ТипЦеныПоКодМДМ);
						
						ДокУстановкаЦен.Контрагент = ТипЦеныПоКодМДМ.Владелец;
						
					Иначе             
						ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Не найден тип цены  " + СокрЛП(СтрокаСпискаТиповЦен.ТипЦенНаименование) + " с кодом МДМ " + СокрЛП(СтрокаСпискаТиповЦен.ТипЦенКодМДМ));
					КонецЕсли;
					
				КонецЦикла;
				
				Если ДокУстановкаЦен.ТипыЦен.Количество() = 0 Тогда   
					
					ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Документ с ИД документа '" + ГУИДУстановкиЦен + "' не найден ни один тип цен по кодам МДМ");
					Возврат;
					
				Иначе
					ДокУстановкаЦен.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
				
				СписокТоваров = СообщениеJSON.Товары;
				
				Для Каждого СтрокаСпискаТоваров Из СписокТоваров Цикл
					
					ТипЦеныПоСоответствию = СоответствиеТиповЦен.Получить(СтрокаСпискаТоваров.ТипЦенКодМДМ); 
					
					Если НЕ ТипЦеныПоСоответствию = Неопределено Тогда       
						
						ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
						
						Если НЕ ТоварПоКодуМДМ.Пустая() Тогда
							
							НоваяСтрокаТовары				  		 = ДокУстановкаЦен.Товары.Добавить();
							НоваяСтрокаТовары.Номенклатура	  		 = ТоварПоКодуМДМ;
							НоваяСтрокаТовары.ЕдиницаИзмерения		 = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;
							НоваяСтрокаТовары.ТипЦен	     		 = ТипЦеныПоСоответствию; 
							НоваяСтрокаТовары.Валюта	      		 = ТипЦеныПоСоответствию.ВалютаЦены;
							НоваяСтрокаТовары.Цена	          		 = СтрокаСпискаТоваров.Цена;
							НоваяСтрокаТовары.ИндексСтрокиТаблицыЦен = СтрокаСпискаТоваров.ИндексСтрокиТаблицыЦен; 
							
						Иначе 
							ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
							"Не найден товар с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ));
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ДокУстановкаЦен.Товары.Количество() = 0 Тогда 
					
					Попытка    
						
						ДокУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
						ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Информация,,, ДокУстановкаЦен.Ссылка);    
						
					Исключение     
						
						ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
						
						СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()); 					 
						ВызватьИсключение СтрокаИсключения; 
						
					КонецПопытки;	 
					
				Иначе
					
					ЗаписьЖурналаРегистрации("Загрузка документов.Установка цен номенклатуры контрагентов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка создания документа: не заполнена табличная часть 'Товары' ");
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЕсли;
	
	ИначеЕсли ВидДокумента = "ПередачаРеквизитовНоменклатуры" Тогда
		
		СписокТоваров = СообщениеJSON.Товары;
		
		Для Каждого СтрокаСпискаТоваров Из СписокТоваров Цикл
			
			ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
			
			Если НЕ ТоварПоКодуМДМ.Пустая() Тогда
				
				Если НЕ ТоварПоКодуМДМ.НеЗагружатьЦеныЕслиЕстьОстатокТовара = Булево(СтрокаСпискаТоваров.НеЗагружатьЦеныЕслиЕстьОстатокТовара) 
					ИЛИ НЕ ТоварПоКодуМДМ.КратностьФилиала = СтрокаСпискаТоваров.КратностьФилиала Тогда
					
					ТоварОбъект                                      = ТоварПоКодуМДМ.ПолучитьОбъект(); 
					ТоварОбъект.ОбменДанными.Загрузка                = Истина;   
					ТоварОбъект.НеЗагружатьЦеныЕслиЕстьОстатокТовара = Булево(СтрокаСпискаТоваров.НеЗагружатьЦеныЕслиЕстьОстатокТовара);
					ТоварОбъект.КратностьФилиала                     = СтрокаСпискаТоваров.КратностьФилиала;
					
					Попытка
						ТоварОбъект.Записать();
					Исключение
						ЗаписьЖурналаРегистрации("Загрузка документов.Передача реквизитов номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка записи номенклатуры : " + СокрЛП(ТоварОбъект.Артикул) + "  " + сокрЛП(ТоварОбъект.Наименование)
						+ "  " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					КонецПопытки;
					
				КонецЕсли;
				
			Иначе 
				ЗаписьЖурналаРегистрации("Загрузка документов.Передача реквизитов номенклатуры.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Не найден товар с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ));
			КонецЕсли;
			
		КонецЦикла; 
		
		ЗаписьЖурналаРегистрации("Загрузка документов.Передача реквизитов номенклатуры.Обработка", УровеньЖурналаРегистрации.Информация,,,
		"Обработано " + СокрЛП(СписокТоваров.Количество()) + " строк");
		
	ИначеЕсли ВидДокумента = "ВыкупСОтветственногоХранения" Тогда 

		ГУИДВыкупа 		  = СообщениеJSON.УникальныйИдентификатор;
		КодМДМФилиала	  = СокрЛП(СообщениеJSON.КодМДМФилиала);
		КодМДМДоговораТОХ = СокрЛП(СообщениеJSON.КодМДМДоговораТОХ);
		НазваниеБазы 	  = СокрЛП(СообщениеJSON.НазваниеБазы);
		НачалоПериода     = Дата(СообщениеJSON.НачалоПериода);
		КонецПериода      = Дата(СообщениеJSON.КонецПериода);
		Статус            = Число(СообщениеJSON.Статус);

		ЕстьФилиал = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", КодМДМФилиала);
		
		Если ЕстьФилиал.Пустая() Тогда
			
			ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не найден филиал с кодом МДМ " + КодМДМФилиала);
			
			Возврат;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КодМДМДоговораТОХ) Тогда
			
			ЕстьДоговорПоставщикаТОХ = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", КодМДМДоговораТОХ);
			
			Если Не ЕстьДоговорПоставщикаТОХ.Пустая() Тогда
				
				ПоставщикТОХ = Справочники.ПоставщикиТОХ.НайтиПоРеквизиту("ДоговорКонтрагента", ЕстьДоговорПоставщикаТОХ);
				
				Если ПоставщикТОХ.Пустая() Тогда
					
					ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
					"Не найден поставщик ТОХ с договором " + СокрЛП(ЕстьДоговорПоставщикаТОХ.Наименование));
					Возврат;
					
				КонецЕсли;
				
			Иначе
				
				ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
				"Не найден договор поставщика ТОХ с кодом МДМ " + СокрЛП(КодМДМДоговораТОХ));
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГУИДВыкупа) Тогда 
			
			ДокВыкуп = Документы.ВыкупСОтветственногоХранения.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе",ГУИДВыкупа);  
			
			Если НЕ ДокВыкуп.Пустая() Тогда    
				
				ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Документ с ИД документа '" + ГУИДВыкупа + "' уже загружен ");
				Возврат;
				
			Иначе
				
				ДокВыкуп 						   = Документы.ВыкупСОтветственногоХранения.СоздатьДокумент();
				ДокВыкуп.Дата 					   = Дата(СообщениеJSON.ДатаДокумента);
				ДокВыкуп.ИДДокументаВСмежнойБазе   = ГУИДВыкупа;
				ДокВыкуп.Филиал 				   = ЕстьФилиал;
				ДокВыкуп.НачалоПериода			   = НачалоПериода;
				ДокВыкуп.КонецПериода			   = КонецПериода;
				ДокВыкуп.Ответственный			   = ПараметрыСеанса.ТекущийПользователь; 
				ДокВыкуп.Контрагент				   = ПоставщикТОХ.Контрагент;
				ДокВыкуп.ДоговорКонтрагента		   = ПоставщикТОХ.ДоговорКонтрагента;
				ДокВыкуп.ВалютаДокумента		   = ПоставщикТОХ.ДоговорКонтрагента.ВалютаВзаиморасчетов; 
				ДокВыкуп.КурсВзаиморасчетов	       = 1;
				ДокВыкуп.КратностьВзаиморасчетов   = 1;  			
				ДокВыкуп.Организация               = ПоставщикТОХ.ДоговорКонтрагента.Организация;
				ДокВыкуп.Склад					   = Константы.ОсновнойСклад.Получить();
				ИмяПеречисления					   = Метаданные.Перечисления.СтатусыТОХ.ЗначенияПеречисления[Статус].Имя; 
				ДокВыкуп.Статус                    = Перечисления.СтатусыТОХ[ИмяПеречисления];
				ДокВыкуп.Комментарий               = "Создан по документу № " + СокрЛП(СообщениеJSON.НомерДокумента) + " из базы " + НазваниеБазы;
				
				ПромТипЦен = ЕстьДоговорПоставщикаТОХ.ТипЦен;
				
				СписокТоваров = СообщениеJSON.Товары;
				
				ЗапросСерииНоменклатуры = Новый Запрос;
				ЗапросСерииНоменклатуры.Текст =
				"ВЫБРАТЬ
				|	ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента,
				|	ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура,
				|	ТоварыОтветственногоХраненияПереданныеОстатки.СерияНоменклатуры,
				|	ТоварыОтветственногоХраненияПереданныеОстатки.Филиал,
				|	ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток,
				|	ВЫБОР
				|		КОГДА &Серия = ЗНАЧЕНИЕ(Справочник.Серииноменклатуры.ПустаяСсылка)
				|			ТОГДА 1
				|		ИНАЧЕ ВЫБОР
				|				КОГДА ТоварыОтветственногоХраненияПереданныеОстатки.СерияНоменклатуры = &Серия
				|					ТОГДА 0
				|				ИНАЧЕ 1
				|			КОНЕЦ
				|	КОНЕЦ КАК Приоритет
				|ПОМЕСТИТЬ ВТ_Остатки
				|ИЗ
				|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
				|			&Дата,
				|			Номенклатура = &Номенклатура
				|				И Филиал = &Филиал) КАК ТоварыОтветственногоХраненияПереданныеОстатки
				|ГДЕ
				|	ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток > 0
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВТ_Остатки.Номенклатура,
				|	ВТ_Остатки.СерияНоменклатуры,
				|	ВТ_Остатки.КоличествоОстаток КАК КоличествоОстаток,
				|	ВТ_Остатки.Приоритет КАК Приоритет
				|ИЗ
				|	ВТ_Остатки КАК ВТ_Остатки
				|
				|УПОРЯДОЧИТЬ ПО
				|	Приоритет,
				|	КоличествоОстаток Возр";
				
				ЗапросСерииНоменклатуры.УстановитьПараметр("Дата",ДокВыкуп.Дата);
				ЗапросСерииНоменклатуры.УстановитьПараметр("Филиал",ЕстьФилиал);

				Для Каждого СтрокаСпискаТоваров Из СписокТоваров Цикл
					
					ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
					
					Если НЕ ТоварПоКодуМДМ.Пустая() Тогда
						
						СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СтрокаСпискаТоваров.НомерГТД, Истина,, ТоварПоКодуМДМ);
						
						ЗапросСерииНоменклатуры.УстановитьПараметр("Номенклатура",ТоварПоКодуМДМ);
						ЗапросСерииНоменклатуры.УстановитьПараметр("Серия",СерияНоменклатуры);
						
						РезультатЗапросаСерии = ЗапросСерииНоменклатуры.Выполнить();
						
						Если НЕ РезультатЗапросаСерии.Пустой() Тогда
							
							ВыборкаЗапросаСерии = РезультатЗапросаСерии.Выбрать();
							
							КоличествоСписатьПоСтроке = СтрокаСпискаТоваров.Количество;
							
							Пока ВыборкаЗапросаСерии.Следующий() Цикл
								
								Если КоличествоСписатьПоСтроке = 0 Тогда
									Прервать;
								КонецЕсли;
								
								Если ВыборкаЗапросаСерии.КоличествоОстаток >= КоличествоСписатьПоСтроке Тогда
									
									НоваяСтрокаТовары				  			 = ДокВыкуп.Товары.Добавить();
									НоваяСтрокаТовары.Номенклатура	  			 = ТоварПоКодуМДМ;
									НоваяСтрокаТовары.ЕдиницаИзмерения			 = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;
									НоваяСтрокаТовары.Коэффициент				 = НоваяСтрокаТовары.ЕдиницаИзмерения.Коэффициент;
									НоваяСтрокаТовары.Количество            	 = КоличествоСписатьПоСтроке; 					
									НоваяСтрокаТовары.Цена	           			 = ПолучитьЦенуПоставщика(ТоварПоКодуМДМ,ПромТипЦен,ДокВыкуп.Дата); 						
									НоваяСтрокаТовары.Сумма	          		 	 = НоваяСтрокаТовары.Цена*СтрокаСпискаТоваров.Количество;
									НоваяСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
									НоваяСтрокаТовары.СерияНоменклатуры 		 = ВыборкаЗапросаСерии.СерияНоменклатуры;

									КоличествоСписатьПоСтроке = 0;
									
								Иначе
									
									НоваяСтрокаТовары				  			 = ДокВыкуп.Товары.Добавить();
									НоваяСтрокаТовары.Номенклатура	  			 = ТоварПоКодуМДМ;
									НоваяСтрокаТовары.ЕдиницаИзмерения			 = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;
									НоваяСтрокаТовары.Коэффициент				 = НоваяСтрокаТовары.ЕдиницаИзмерения.Коэффициент;
									НоваяСтрокаТовары.Количество            	 = Мин(КоличествоСписатьПоСтроке,ВыборкаЗапросаСерии.КоличествоОстаток); 					
									НоваяСтрокаТовары.Цена	           			 = ПолучитьЦенуПоставщика(ТоварПоКодуМДМ,ПромТипЦен,ДокВыкуп.Дата); 						
									НоваяСтрокаТовары.Сумма	          		 	 = НоваяСтрокаТовары.Цена*СтрокаСпискаТоваров.Количество;
									НоваяСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
									НоваяСтрокаТовары.СерияНоменклатуры 		 = ВыборкаЗапросаСерии.СерияНоменклатуры;
									
									КоличествоСписатьПоСтроке = КоличествоСписатьПоСтроке - Мин(КоличествоСписатьПоСтроке,ВыборкаЗапросаСерии.КоличествоОстаток);
									
								КонецЕсли;									
								
							КонецЦикла;							
							
							Если НЕ КоличествоСписатьПоСтроке = 0 Тогда
								
								НоваяСтрокаТовары				  			 = ДокВыкуп.Товары.Добавить(); 
								НоваяСтрокаТовары.Номенклатура	  			 = ТоварПоКодуМДМ;
								НоваяСтрокаТовары.ЕдиницаИзмерения			 = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;
								НоваяСтрокаТовары.Коэффициент				 = НоваяСтрокаТовары.ЕдиницаИзмерения.Коэффициент;
								НоваяСтрокаТовары.Количество            	 = КоличествоСписатьПоСтроке; 					
								НоваяСтрокаТовары.Цена	           			 = ПолучитьЦенуПоставщика(ТоварПоКодуМДМ,ПромТипЦен,ДокВыкуп.Дата); 						
								НоваяСтрокаТовары.Сумма	          		 	 = НоваяСтрокаТовары.Цена*СтрокаСпискаТоваров.Количество;
								НоваяСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
								НоваяСтрокаТовары.СерияНоменклатуры 		 = СерияНоменклатуры;
								
							КонецЕсли;
							
						Иначе
							
							НоваяСтрокаТовары				  			 = ДокВыкуп.Товары.Добавить();   
							НоваяСтрокаТовары.Номенклатура	  			 = ТоварПоКодуМДМ;
							НоваяСтрокаТовары.ЕдиницаИзмерения			 = ТоварПоКодуМДМ.ЕдиницаХраненияОстатков;
							НоваяСтрокаТовары.Коэффициент				 = НоваяСтрокаТовары.ЕдиницаИзмерения.Коэффициент;
							НоваяСтрокаТовары.Количество            	 = КоличествоСписатьПоСтроке; 					
							НоваяСтрокаТовары.Цена	           			 = ПолучитьЦенуПоставщика(ТоварПоКодуМДМ,ПромТипЦен,ДокВыкуп.Дата); 						
							НоваяСтрокаТовары.Сумма	          		 	 = НоваяСтрокаТовары.Цена*СтрокаСпискаТоваров.Количество;
							НоваяСтрокаТовары.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
							
							Если СерияНоменклатуры.Пустая()  Тогда  
								
								НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СтрокаСпискаТоваров.НомерГТД);
								
								Если ЗначениеЗаполнено(СокрЛП(СтрокаСпискаТоваров.СтранаПроисхожденияКодМДМ)) Тогда
									Страна = Справочники.КлассификаторСтранМира.НайтиПоРеквизиту("КодМДМ", СокрЛП(СтрокаСпискаТоваров.СтранаПроисхожденияКодМДМ));	
								ИначеЕсли ЗначениеЗаполнено(СокрЛП(СтрокаСпискаТоваров.СтранаПроисхожденияКод)) Тогда   							
									Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрокаСпискаТоваров.СтранаПроисхожденияКод);   						
								КонецЕсли;
								
								НоваяСтрокаТовары.СерияНоменклатуры = ПроверитьИСоздатьСерию(ТоварПоКодуМДМ, СтрокаСпискаТоваров.НомерГТД, Страна, НомерГТДСсылка);
								
							Иначе			
								НоваяСтрокаТовары.СерияНоменклатуры = СерияНоменклатуры;
							КонецЕсли;  
							
						КонецЕсли;
						
					Иначе 
						ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Не найден товар с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ));
					КонецЕсли;
					
				КонецЦикла;				
				
				Попытка
					ДокВыкуп.Записать(РежимЗаписиДокумента.Проведение);					
				Исключение				
					
					Если КоличествоПопытокОбработки = 0 Тогда
						ЗаписьЖурналаРегистрации("Загрузка документов.Выкуп с ответственного хранения.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка проведения документа: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
					КонецЕсли;				
					
					СтрокаИсключения = "ВидДокумента " + ВидДокумента + "; Ошибка создания/записи" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ВызватьИсключение СтрокаИсключения;				
					
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВидДокумента = "ЗаказПоставщику" Тогда  
		
		Настройка = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", ВидДокумента);
		Документы.ЗаказПоставщику.Р_ЗагрузитьДокумент(СообщениеJSON, Настройка, Отказ);
		
	//+Шульман А. 02.07.2026 #UT10-5944
	ИначеЕсли ВидДокумента = "Перемещение" И ВРЕГ(Прав(ИмяОчереди, 13)) = ".DOCUMENTS.SM" Тогда  
		
		Настройка = Справочники.AMQP_СправочникиЗагрузки.НайтиПоРеквизиту("ИмяСправочника", "ЗаказПоставщику");
		Документы.ЗаказПоставщику.Р_ЗагрузитьДокументПеремещение(СообщениеJSON, Настройка, Отказ);  
	//-Шульман А. 02.07.2026 #UT10-5944
		
	ИначеЕсли ВидДокумента = "ТоварыБезЦенДляГоловногоФилиала" Тогда
		
		ДатаВыгрузки = НачалоДня(Дата(СообщениеJSON.ДатаВыгрузки));
		Товары       = СообщениеJSON.Товары;
		
		ЗапросДатыВРегистре = Новый Запрос;
		ЗапросДатыВРегистре.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыДляУстановкиЦенИзОП.Дата КАК Дата
		|ИЗ
		|	РегистрСведений.ТоварыДляУстановкиЦенИзОП КАК ТоварыДляУстановкиЦенИзОП
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
		
		РезультатЗапросаДатыВРегистре = ЗапросДатыВРегистре.Выполнить().Выгрузить();
		
		Если НЕ РезультатЗапросаДатыВРегистре.Количество() = 0 Тогда
			
			ТекДатаВРегистре = РезультатЗапросаДатыВРегистре[0].Дата;
			
			Если ТекДатаВРегистре < ДатаВыгрузки Тогда
				
				НаборЗаписейВРегистре = РегистрыСведений.ТоварыДляУстановкиЦенИзОП.СоздатьНаборЗаписей();				
				НаборЗаписейВРегистре.Записать();
				
			КонецЕсли;
				
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Для Каждого СтрокаСпискаТоваров Из Товары Цикл
			
			ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
			
			Если НЕ ТоварПоКодуМДМ.Пустая() Тогда
				
				НаборЗаписей = РегистрыСведений.ТоварыДляУстановкиЦенИзОП.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Номенклатура.Установить(ТоварПоКодуМДМ);
				НаборЗаписей.Отбор.Дата.Установить(ДатаВыгрузки);
				НаборЗаписей.Прочитать();			
				
				Если НаборЗаписей.Количество() = 0 Тогда
					
					ЗаписьРегистра = НаборЗаписей.Добавить();
					ЗаписьРегистра.Дата = ДатаВыгрузки;
					ЗаписьРегистра.Номенклатура = ТоварПоКодуМДМ;
					ЗаписьРегистра.Себестоимость = СтрокаСпискаТоваров.Себестоимость;
					
				Иначе
					
					ЗаписьРегистра = НаборЗаписей[0];
					
					Если ЗаписьРегистра.Себестоимость < СтрокаСпискаТоваров.Себестоимость Тогда
						ЗаписьРегистра.Себестоимость = СтрокаСпискаТоваров.Себестоимость;	
					КонецЕсли; 				
					
				КонецЕсли;
				
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать(Истина);
				
			Иначе
				
				ЗаписьЖурналаРегистрации("Товары без цен для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Не найден товар с кодом МДМ "+СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ)+"");
				Возврат; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();	
		
	ИначеЕсли ВидДокумента = "ТоварыГруппыZДляГоловногоФилиала" Тогда
		
		ДатаВыгрузки = НачалоДня(Дата(СообщениеJSON.ДатаВыгрузки));
		Товары       = СообщениеJSON.Товары;
		
		ЗапросДатыВРегистре = Новый Запрос;
		ЗапросДатыВРегистре.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыГруппыZВНаличииВОП.Дата КАК Дата
			|ИЗ
			|	РегистрСведений.ТоварыГруппыZВНаличииВОП КАК ТоварыГруппыZВНаличииВОП
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата";
		
		РезультатЗапросаДатыВРегистре = ЗапросДатыВРегистре.Выполнить().Выгрузить();
		
		Если НЕ РезультатЗапросаДатыВРегистре.Количество() = 0 Тогда
			
			ТекДатаВРегистре = РезультатЗапросаДатыВРегистре[0].Дата;
			
			Если ТекДатаВРегистре < ДатаВыгрузки Тогда
				
				НаборЗаписейВРегистре = РегистрыСведений.ТоварыГруппыZВНаличииВОП.СоздатьНаборЗаписей();				
				НаборЗаписейВРегистре.Записать();
				
			КонецЕсли;
				
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Для Каждого СтрокаСпискаТоваров Из Товары Цикл
			
			ТоварПоКодуМДМ = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаСпискаТоваров.НоменклатураКодМДМ);
			
			Если НЕ ТоварПоКодуМДМ.Пустая() Тогда
				
				МенеджерЗаписи = РегистрыСведений.ТоварыГруппыZВНаличииВОП.СоздатьМенеджерЗаписи();
				
				МенеджерЗаписи.Дата = ДатаВыгрузки;
				МенеджерЗаписи.Номенклатура = ТоварПоКодуМДМ;
				
				МенеджерЗаписи.Записать(Истина);
				
			Иначе
				
				ЗаписьЖурналаРегистрации("Товары группы Z для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
					"Не найден товар с кодом МДМ " + СокрЛП(СтрокаСпискаТоваров.НоменклатураКодМДМ) + "");
				Возврат; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();	
		
	КонецЕсли;		
	
КонецПроцедуры

Функция ПолучитьЦенуПоставщика(Товар,ТипЦен,Дата)
	
	ЗапросЦены = Новый Запрос;
	ЗапросЦены.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И ТипЦен = &ТипЦены) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних";
	
	ЗапросЦены.УстановитьПараметр("Дата", Дата);
	ЗапросЦены.УстановитьПараметр("Номенклатура", Товар);
	ЗапросЦены.УстановитьПараметр("ТипЦены", ТипЦен);
	
	РезультатЗапросаЦены = ЗапросЦены.Выполнить();
	
	Если Не РезультатЗапросаЦены.Пустой() Тогда
		
		ВыборкаЗапросаЦены = РезультатЗапросаЦены.Выбрать();
		ВыборкаЗапросаЦены.Следующий();
		Возврат ВыборкаЗапросаЦены.Цена;
		
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ФорматироватьДату(ДатаСтрока)
	
	День = Сред(ДатаСтрока, 1, 2);
	Месяц = Сред(ДатаСтрока, 4, 2);
	Год = Сред(ДатаСтрока, 7, 4);
	Час = Сред(ДатаСтрока, 12, 2);
	Мин = Сред(ДатаСтрока, 15, 2);
	Сек = Сред(ДатаСтрока, 18, 2);
	
	Возврат Дата(Год, Месяц, День, Час, Мин, Сек);

КонецФункции

Функция ОбработатьНеподдерживаемоеСвойствоJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат "";
	
КонецФункции

Процедура ПередЗаписьюДокументаПроверкаПометкиУдаления(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт 

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда
		
		Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ Источник.ПометкаУдаления Тогда
			
			Если НЕ РольДоступна(Метаданные.Роли.СамыеПолныеПрава) И НЕ РольДоступна(Метаданные.Роли.РазрешитьУстанавливатьПометкуНаУдаление) Тогда		
				
				Отказ = Истина;	
				#Если Клиент Тогда
					Сообщить("Недостаточно прав для установки пометки удаления. Изменения не могут быть записаны...", СтатусСообщения.Важное);
				#КонецЕсли 
				
			КонецЕсли; 		
			
		КонецЕсли;             	
		
	КонецЕсли; 

КонецПроцедуры

Процедура ОтправкаЗаказовВнешнимПоставщикам() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка заказов внешним поставщикам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Письма = Новый Соответствие;
	
	Запрос = Новый Запрос;                                                  
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмо.Ссылка КАК Письмо
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|ГДЕ
	|	ЭлектронноеПисьмо.ПометкаУдаления = ЛОЖЬ
	|	И ЭлектронноеПисьмо.Тема ПОДОБНО &Тема
	|	И ЭлектронноеПисьмо.Дата > &Дата
	|	И ЭлектронноеПисьмо.СтатусПисьма = &СтатусПисьма";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 60*60*24*7); //Письма за неделю	
	Запрос.УстановитьПараметр("Тема", "%Перечень товаров к заказу%");
	Запрос.УстановитьПараметр("СтатусПисьма", Перечисления.СтатусыПисем.Исходящее);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Письма.Вставить(Выборка.Письмо, Неопределено);
	КонецЦикла;
	
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), 
	глЗначениеПеременной("глТекущийПользователь"),, Письма, Истина);
	
КонецПроцедуры

Функция ПолучитьСостояниеЭДО(ПромДок) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект",ПромДок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение КАК ТекЗначение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СостояниеЭДО)
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектЗначение = Выборка.ТекЗначение; 
	Иначе
		ОбъектЗначение = Перечисления.СостояниеЭДО.ПустаяСсылка();
	КонецЕсли; 
	
	Возврат ОбъектЗначение;

КонецФункции

Функция ЗаписатьСостояниеЭДО(ПромДок,ПромСтатус) Экспорт

	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ПромДок);
	НаборЗаписей.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СостояниеЭДО);
	НаборЗаписей.Записать();
	
	НовЗначСвва = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	НовЗначСвва.Объект = ПромДок;
	НовЗначСвва.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СостояниеЭДО;
	НовЗначСвва.Значение = ПромСтатус;
	НовЗначСвва.Записать();

КонецФункции

Функция ПроверятьВзаимоарасчетыЧерезБиллингКонтроль(ТекОбъект) 
	
	ВозвращаемоеЗначение = Ложь;
	
	ОсновнаяОрганизация = Константы.ОсновнаяОрганизация.Получить();   
	
	Если Не ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВыгружаетсяВБиллинг = ИСТИНА";
	
	Запрос.УстановитьПараметр("Владелец", ТекОбъект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ОсновнаяОрганизация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВозвращаемоеЗначение = Истина;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

Функция ПолучитьСтатусПриемки(ПромДок) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ПромДок);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение КАК ТекЗначение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки)
	|	И ЗначенияСвойствОбъектов.Объект = &Объект";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектЗначение = Выборка.ТекЗначение; 
	Иначе
		ОбъектЗначение = Перечисления.СтатусыПриемки.ПустаяСсылка();
	КонецЕсли; 
	
	Возврат ОбъектЗначение;

КонецФункции

Функция ЭтоОчередьПрайсПМ(ИмяОчереди) Экспорт

	Возврат ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 9)) = ".PRICE.PM";

КонецФункции // () 

Функция ЭтоОчередьУТ10ВУТ10(ИмяОчереди) Экспорт
//+Белов А. 14.09.2026 #UT10-6038
	Возврат ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 15)) = ".DOCUMENTS.UT10";
	
//-Белов А. 14.09.2026 #UT10-6038
КонецФункции // ()


Функция ЭтоОчередьDocumentsSM(ИмяОчереди) Экспорт

	Возврат ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 13)) = ".DOCUMENTS.SM";

КонецФункции  

Функция ПоискИСозданиеНоменклатуры(ФабрикаИмени)

	СпрОбъект = Неопределено;	
	ЧислоКодАварды = Число(ФабрикаИмени.КодАварда);
	
	Если ЧислоКодАварды > 0 Тогда		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КодАварда = &КодАварда
		|	И Номенклатура.КодМДМ = """"
		|	И Номенклатура.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("КодАварда", ЧислоКодАварды);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();		
		КонецЕсли;
		
	КонецЕсли;
	
	Если СпрОбъект = Неопределено Тогда
		
		СпрОбъект = РаботаСАвардой.ПроверитьНоменклатуруПоНормализованномуКоду(ФабрикаИмени.Артикул, 
		Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", ФабрикаИмени.Производитель.GUID, Справочники.Номенклатура.ПустаяСсылка()));
		
	КонецЕсли;
	
	Возврат СпрОбъект;	

КонецФункции

Функция ПолучитьСоответствиеСтороннегоСкладаСкладуФилиала(СтороннийСклад, СтороннийСкладФилиала) Экспорт

	//Если нужно получить соответствие по одному из параметров, то нужно передать второй параметр как Неопределено	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСклад,
	                      |	СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСкладФилиала
	                      |ИЗ
	                      |	РегистрСведений.СоответствиеСтороннихСкладовСкладамФилиала КАК СоответствиеСтороннихСкладовСкладамФилиала
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &СтороннийСклад = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСклад = &СтороннийСклад
	                      |		КОНЕЦ
	                      |	И ВЫБОР
	                      |			КОГДА &СтороннийСкладФилиала = НЕОПРЕДЕЛЕНО
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСкладФилиала = &СтороннийСкладФилиала
	                      |		КОНЕЦ
	                      |	И СоответствиеСтороннихСкладовСкладамФилиала.Использование = ИСТИНА
						  |	И СоответствиеСтороннихСкладовСкладамФилиала.СтороннийСклад ССЫЛКА Справочник.СторонниеСклады");
	
	Запрос.Параметры.Вставить("СтороннийСклад", СтороннийСклад);
	Запрос.Параметры.Вставить("СтороннийСкладФилиала", СтороннийСкладФилиала);
	
	РезЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезЗапроса.Следующий() Тогда
		Возврат РезЗапроса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

Функция ТекстЗапросаЗаполнитьТЧТОХ() 
	
	// ВНИМАНИЕ!!! Меняя этот запрос, нужно также аналогичным образом изменить запрос 
	// в РегистрыНакопления.ТоварыОтветственногоХранения.ПолучитьДвиженияСписание(),
	// УправлениеЗапасами.ПолучитьТаблицуСвободныхОстатковПоСериямТОХ(),
	// МСК.СверитьТабЧастьТОХиВыкупы()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура,
	|	Остатки.СерияНоменклатуры,
	|	Остатки.КоличествоОстаток КАК КоличествоОстатокТОХ,
	|	0 КАК КоличествоОстатокТОХФилиал,
	|	0 КАК КоличествоОстатокСклад
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(&Дата, Номенклатура В (&МассивТоваров)) КАК Остатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиТОХ.Номенклатура,
	|	ОстаткиТОХ.СерияНоменклатуры,
	|	0,
	|	ОстаткиТОХ.КоличествоОстаток,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(&Дата, Номенклатура В (&МассивТоваров)) КАК ОстаткиТОХ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиСклад.Номенклатура,
	|	ОстаткиСклад.СерияНоменклатуры,
	|	0,
	|	0,
	|	ОстаткиСклад.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			Номенклатура В (&МассивТоваров)
	|				И Склад = &Склад) КАК ОстаткиСклад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХ) КАК КоличествоОстатокТОХ,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал) КАК КоличествоОстатокТОХФилиал,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокСклад) КАК КоличествоОстатокСклад,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал < 0
	|				ТОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОстатокТОХФилиалОтрицат
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ_БезСерии
	|ИЗ
	|	ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТОХ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Для процедуры ЗаполнитьТЧТОХ - не отбрасываем отрицательные остатки
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	ВТ_ОстаткиТОХ.СерияНоменклатуры,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХ) КАК КоличествоОстатокТОХ,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал) КАК КоличествоОстатокТОХФилиал,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокСклад) КАК КоличествоОстатокСклад,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХ - ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал) КАК ДоступноТОХПоСерии
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ_ПоСериям
	|ИЗ
	|	ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	ВТ_ОстаткиТОХ.СерияНоменклатуры
	|;                              
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ_ПоСериям.Номенклатура,
	|	СУММА(ВТ_ОстаткиТОХ_ПоСериям.КоличествоОстатокТОХФилиал) КАК КоличествоОстатокТОХФилиал
	|ПОМЕСТИТЬ ВТ_ОтрицатТОХПереданные
	|ИЗ
	|	ВТ_ОстаткиТОХ_ПоСериям КАК ВТ_ОстаткиТОХ_ПоСериям
	|ГДЕ
	|	ВТ_ОстаткиТОХ_ПоСериям.КоличествоОстатокТОХФилиал < 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТОХ_ПоСериям.Номенклатура
	|;	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ_БезСерии.Номенклатура,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХ - ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХФилиал КАК ВсегоДоступноТОХ,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХ,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХФилиал,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокСклад,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокСклад - (ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХ - ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХФилиал) КАК СобственныйОстаток,
	|	ВТ_ОстаткиТОХ_БезСерии.КоличествоОстатокТОХФилиалОтрицат КАК КоличествоОстатокТОХФилиалОтрицат	
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ_ПоНоменклатуре  
	|ИЗ
	|	ВТ_ОстаткиТОХ_БезСерии КАК ВТ_ОстаткиТОХ_БезСерии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	ВТ_ОстаткиТОХ.СерияНоменклатуры,
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХ - ВЫБОР
	|			КОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал > 0
	|				ТОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ДоступноТОХПоСерии
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ_БезОтрицатОстатков  
	|ИЗ
	|	ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	ВТ_ОстаткиТОХ.СерияНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_ОстаткиТОХ.КоличествоОстатокТОХ - ВЫБОР
	|			КОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал > 0
	|				ТОГДА ВТ_ОстаткиТОХ.КоличествоОстатокТОХФилиал
	|			ИНАЧЕ 0
	|		КОНЕЦ) > 0	
	|";

    Возврат ТекстЗапроса;

КонецФункции // ()

/////////////////////////////////////////////////
//  Процедуры работы с таб.частью ТОХ

Функция ЗаполнитьТЧТОХ(ДокОбъект, тзТОХНовый, мСклад = Неопределено, ЗадаватьВопрос = Истина) Экспорт
	
	#Если Клиент Тогда
	Если ЗадаватьВопрос И РольДоступна("ТОХ_ПолныеПрава") Тогда
		
		Ответ = Вопрос("Перезаполнить данные на вкладке ТОХ?", РежимДиалогаВопрос.ДаНет, 0);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	#КонецЕсли
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ТребованиеНакладная") Тогда 
		ТаблТоваров = ДокОбъект.Материалы.Выгрузить();
	Иначе
		ТаблТоваров = ДокОбъект.Товары.Выгрузить();
	КонецЕсли;     
	
	тзТОХНовый.Очистить();
	
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаПоступления") Тогда  
		ТаблТоваров.Свернуть("Номенклатура, СерияНоменклатуры", "Количество, КоличествоДоИзменения");
	Иначе	          
		
		ТаблТоваров.Свернуть("Номенклатура, СерияНоменклатуры", "Количество");   
		ТаблТоваров.Колонки.Добавить("КоличествоДоИзменения", 	Новый ОписаниеТипов("Число")); 
		
	КонецЕсли;
	
	ТаблТоваров.Колонки.Добавить("Распределить", 			Новый ОписаниеТипов("Булево"));
	ТаблТоваров.Колонки.Добавить("КоличествоРаспределить", 	Новый ОписаниеТипов("Число"));
	
	МассивТоваров = ТаблТоваров.ВыгрузитьКолонку("Номенклатура");     
	
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапросаЗаполнитьТЧТОХ(); 
		
	Запрос.УстановитьПараметр("МассивТоваров", 	МассивТоваров);
	Запрос.УстановитьПараметр("Дата", 			Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая)); 
	Запрос.УстановитьПараметр("Склад",          ?(мСклад = Неопределено, Константы.ОсновнойСклад.Получить(), мСклад));
	
	Запрос.Выполнить();
	ОбщиеОстаткиТОХ   = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_ОстаткиТОХ_ПоНоменклатуре"].ПолучитьДанные().Выгрузить();
	ОстаткиТОХПоСерии = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_ОстаткиТОХ_ПоСериям"].ПолучитьДанные().Выгрузить(); 
	
	Если ОбщиеОстаткиТОХ.Количество() > 0 Тогда  
		
		//итерации распределения
		//1. по серии, с учетом общего количества, и определение в дальнейшее распределение на другие серии  
		
		Для Каждого СтрокаТовар Из ТаблТоваров Цикл
			
			СтрукПоискОбщие 	= Новый Структура("Номенклатура", СтрокаТовар.Номенклатура);
			МассивСтрокОбщие 	= ОбщиеОстаткиТОХ.НайтиСтроки(СтрукПоискОбщие);
			
			Если МассивСтрокОбщие.Количество() = 0 Тогда  
				Продолжить;
			КонецЕсли;
				
			ОстаткиОбщие = МассивСтрокОбщие[0];
			
			Если Не ОстаткиОбщие.ВсегоДоступноТОХ > 0 Тогда 
				Продолжить;
			КонецЕсли;
					
			Если СтрокаТовар.КоличествоДоИзменения > 0 Тогда // для документа КорректировкаПоступления
				СтрокаТовар.КоличествоРаспределить = СтрокаТовар.КоличествоДоИзменения - СтрокаТовар.Количество;
			Иначе
				СтрокаТовар.КоличествоРаспределить = СтрокаТовар.Количество;
			КонецЕсли;	
			
			//учет собственного Товара не участвующий в распределении
			СобственныйТовар =  Мин(СтрокаТовар.КоличествоРаспределить, Макс(0, ОстаткиОбщие.СобственныйОстаток)); 
			
			СтрокаТовар.КоличествоРаспределить 	= СтрокаТовар.КоличествоРаспределить - СобственныйТовар; 
			СтрокаТовар.Распределить 			= СтрокаТовар.КоличествоРаспределить > 0; 
			
			//Учтем распределение собственного количества, если по серии не найдет, в распределении по прочим уйдет меньше количество
			ОстаткиОбщие.СобственныйОстаток 	= ОстаткиОбщие.СобственныйОстаток - СобственныйТовар;
								
			Если Не СтрокаТовар.Распределить Тогда 
				Продолжить;
			КонецЕсли;
				
			СтрукПоискСерия  = Новый Структура("Номенклатура, СерияНоменклатуры", СтрокаТовар.Номенклатура, СтрокаТовар.СерияНоменклатуры);
			МассивСтрокСерия = ОстаткиТОХПоСерии.НайтиСтроки(СтрукПоискСерия);   
			
			Если МассивСтрокСерия.Количество() = 0 Тогда 
				Продолжить;
			КонецЕсли;
						
			ОстаткиПоСерии = МассивСтрокСерия[0];       
			
			СкорректироватьДоступноТОХПоСерии(ОстаткиОбщие, ОстаткиПоСерии, СтрокаТовар.КоличествоРаспределить);   
			
			КоличествоТОХПоСерии = Мин(макс(ОстаткиОбщие.ВсегоДоступноТОХ, 0), Макс(0, ОстаткиПоСерии.ДоступноТОХПоСерии));   
			
			Если Не КоличествоТОХПоСерии > 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			МожноРаспределить = Мин(КоличествоТОХПоСерии, СтрокаТовар.КоличествоРаспределить); 
			
			Если Не МожноРаспределить > 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			НоваяСтрокаТох = тзТОХНовый.Добавить();
			НоваяСтрокаТох.Номенклатура			= СтрокаТовар.Номенклатура; 
			НоваяСтрокаТох.СерияНоменклатуры	= СтрокаТовар.СерияНоменклатуры; 
			НоваяСтрокаТох.Количество			= МожноРаспределить;
			НоваяСтрокаТох.ЕдиницаИзмерения 	= НоваяСтрокаТох.Номенклатура.ЕдиницаХраненияОстатков;
			НоваяСтрокаТох.Коэффициент 			= НоваяСтрокаТох.ЕдиницаИзмерения.Коэффициент;  
			
			//учет распределенного
			СтрокаТовар.КоличествоРаспределить 	= СтрокаТовар.КоличествоРаспределить - МожноРаспределить;
			СтрокаТовар.Распределить 			= СтрокаТовар.КоличествоРаспределить > 0;
			
			//Учет распределения 
			ОстаткиПоСерии.ДоступноТОХПоСерии 	= ОстаткиПоСерии.ДоступноТОХПоСерии - МожноРаспределить;        
			ОстаткиОбщие.ВсегоДоступноТОХ		= ОстаткиОбщие.ВсегоДоступноТОХ - МожноРаспределить;		
												
			//КонецЕсли;   
						
		КонецЦикла;  
		
		//распределение на другие серии ТОХ
		СтукрПоискРаспределения  = Новый Структура("Распределить", Истина);
		МассивСтрокРаспределения = ТаблТоваров.Скопировать(СтукрПоискРаспределения);   
		МассивСтрокРаспределения.Свернуть("Номенклатура", "КоличествоРаспределить");
		
		Для Каждого ТоварТОХ Из МассивСтрокРаспределения Цикл 
			
			ВсегоДоступноТОХ 	= 0;
			ОстаткиОбщие 		= Неопределено;
			
			СтрукПоискОбщие 	= Новый Структура("Номенклатура", ТоварТОХ.Номенклатура);
			МассивСтрокОбщие 	= ОбщиеОстаткиТОХ.НайтиСтроки(СтрукПоискОбщие);
			
			Если МассивСтрокОбщие.Количество() > 0 Тогда 
				
				ОстаткиОбщие 	 = МассивСтрокОбщие[0];
				ВсегоДоступноТОХ = ОстаткиОбщие.ВсегоДоступноТОХ;
				
			КонецЕсли;	
			
			Распределить = Мин(ТоварТОХ.КоличествоРаспределить, Макс(0, ВсегоДоступноТОХ));
			
			Если Не Распределить > 0 Тогда 
				Продолжить;
			КонецЕсли;
				
			СтрутураОтбора = Новый Структура("Номенклатура", ТоварТОХ.Номенклатура);
			МассивСтрокТОХ = ОстаткиТОХПоСерии.НайтиСтроки(СтрутураОтбора); 
			
			Для Каждого СтрокаТОХ Из МассивСтрокТОХ Цикл 
				
				Если Распределить = 0 Тогда
					Прервать;
				КонецЕсли;  
				
				СкорректироватьДоступноТОХПоСерии(ОстаткиОбщие, СтрокаТОХ, Распределить);   
				
				Если СтрокаТОХ.ДоступноТОХПоСерии <= 0 Тогда 
					Продолжить;
				КонецЕсли;	                        
				
				МожноРаспределить = Мин(СтрокаТОХ.ДоступноТОХПоСерии, Распределить); 
				
				Если МожноРаспределить > 0 Тогда
					
					НоваяСтрокаТох = тзТОХНовый.Добавить();
					
					НоваяСтрокаТох.Номенклатура			= ТоварТОХ.Номенклатура; 
					НоваяСтрокаТох.СерияНоменклатуры	= СтрокаТОХ.СерияНоменклатуры; 
					НоваяСтрокаТох.Количество			= МожноРаспределить;
					НоваяСтрокаТох.ЕдиницаИзмерения 	= НоваяСтрокаТох.Номенклатура.ЕдиницаХраненияОстатков;
					НоваяСтрокаТох.Коэффициент 			= НоваяСтрокаТох.ЕдиницаИзмерения.Коэффициент;  
					
					Распределить = Распределить - МожноРаспределить;
					
					СтрокаТОХ.ДоступноТОХПоСерии = СтрокаТОХ.ДоступноТОХПоСерии - МожноРаспределить;  
					
					Если ОстаткиОбщие <> Неопределено Тогда 
						ОстаткиОбщие.ВсегоДоступноТОХ = ОстаткиОбщие.ВсегоДоступноТОХ - МожноРаспределить;
					КонецЕсли;
					
				КонецЕсли;  
				
			КонецЦикла;	
				
		КонецЦикла;		
		
	КонецЕсли; 
	
	Возврат Истина;
	
КонецФункции

Процедура ЗаполнитьСерииТЧТОХ(ДокОбъект) Экспорт   

	ЗапросТоваровТОХ = Новый Запрос;	
	ЗапросТоваровТОХ.Текст = 
	"ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Товары.СерияНоменклатуры,
	|	Товары.Количество
	|ПОМЕСТИТЬ ВТ_ТаблТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры,   
	|	ЛОЖЬ КАК Отработано,
	|	СУММА(ЕСТЬNULL(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток, 0)) КАК ОстатокТОХ
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	|			&Дата,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблТовары.Номенклатура
	|				ИЗ
	|					ВТ_ТаблТовары КАК ТаблТовары)) КАК ТоварыОтветственногоХраненияОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	|				&Дата,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблТовары.Номенклатура
	|					ИЗ
	|						ВТ_ТаблТовары КАК ТаблТовары)) КАК ТоварыОтветственногоХраненияПереданныеОстатки
	|		ПО ТоварыОтветственногоХраненияОстатки.Номенклатура = ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура
	|			И ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры = ТоварыОтветственногоХраненияПереданныеОстатки.СерияНоменклатуры
	|			И ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента = ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента
	|			И ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток, 0)) > 0";
	
	
	ТаблТоваров  = ДокОбъект.ТоварыОтветственногоХранения.Выгрузить();       
	ТаблТоваров1 = ТаблТоваров.Скопировать();
	
	ТаблТоваров1.Свернуть("Номенклатура, СерияНоменклатуры", "Количество");
	
	ЗапросТоваровТОХ.УстановитьПараметр("Товары", 	ТаблТоваров1);
	ЗапросТоваровТОХ.УстановитьПараметр("Дата", 	Новый Граница(ДокОбъект.Дата, ВидГраницы.Исключая));
	
	РезультатЗапроса = ЗапросТоваровТОХ.Выполнить();  
	
	тзОстаткиТОХ = РезультатЗапроса.Выгрузить();  
	
	тзНовыеСтроки = ТаблТоваров.Скопировать();    
	тзНовыеСтроки.Очистить();
	
	ОтборОстаткиСерии = Новый Структура("Номенклатура, СерияНоменклатуры, Отработано");      
	ОтборОстаткиСерии.Отработано = Ложь;
	
	ОтборОстатки = Новый Структура("Номенклатура, Отработано");      
	ОтборОстатки.Отработано = Ложь;
	
	Для каждого тзСтрокаТОХ Из ТаблТоваров Цикл
		
		РаспределитьПоСериям = тзСтрокаТОХ.Количество;   
		ДобавитьСтроку = Истина;
		
		// Поиск остатка в разрезе серии                
		Если Не тзСтрокаТОХ.СерияНоменклатуры.Пустая() Тогда
		
			ОтборОстаткиСерии.Номенклатура      = тзСтрокаТОХ.Номенклатура;
			ОтборОстаткиСерии.СерияНоменклатуры = тзСтрокаТОХ.СерияНоменклатуры;   
			
			МассивСтрок = тзОстаткиТОХ.НайтиСтроки(ОтборОстаткиСерии);      
			
			Если МассивСтрок.Количество() > 0 Тогда
				
				тзСтрокаОстатки = МассивСтрок[0];
				
				Если тзСтрокаТОХ.Количество <= тзСтрокаОстатки.ОстатокТОХ Тогда 
					
					// Достаточно остатка по этой серии    
					РаспределитьПоСериям = 0;
					тзСтрокаОстатки.ОстатокТОХ = тзСтрокаОстатки.ОстатокТОХ - тзСтрокаТОХ.Количество;
					
					Если тзСтрокаОстатки.ОстатокТОХ = 0 Тогда  
						тзСтрокаОстатки.Отработано  = Истина;
					КонецЕсли;
					
				Иначе                      
					
					// Остатка по серии не хватает, нужно распределить на другие серии
					РаспределитьПоСериям       = тзСтрокаТОХ.Количество - тзСтрокаОстатки.ОстатокТОХ;
					тзСтрокаТОХ.Количество     = тзСтрокаОстатки.ОстатокТОХ; 
					тзСтрокаОстатки.ОстатокТОХ = 0;         
					тзСтрокаОстатки.Отработано = Истина;      
					
				КонецЕсли;   
				
			Иначе                                              
				
				// Нет остатка по серии. Эту строку потом удалим.
				РаспределитьПоСериям = тзСтрокаТОХ.Количество;  
				ДобавитьСтроку       = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;   // Не тзСтрокаТОХ.СерияНоменклатуры.Пустая()
		
		Если РаспределитьПоСериям > 0 Тогда
		
			// Распределение по сериям. Поиск остатков в разрезе номенклатуры
			ОтборОстатки.Номенклатура = тзСтрокаТОХ.Номенклатура;
			
			МассивСтрок = тзОстаткиТОХ.НайтиСтроки(ОтборОстатки);  
			
			Для каждого тзСтрокаОстатки Из МассивСтрок Цикл
			
				Если РаспределитьПоСериям = 0 Тогда
					Прервать;
				КонецЕсли;   
				
				Списать = МИН(РаспределитьПоСериям, тзСтрокаОстатки.ОстатокТОХ);
				
				Если ДобавитьСтроку Тогда
					НоваяСтрокаТох = тзНовыеСтроки.Добавить();
				Иначе
					
					НоваяСтрокаТох = тзСтрокаТОХ;  
					ДобавитьСтроку = Истина;
					
				КонецЕсли;  
				
				НоваяСтрокаТох.Номенклатура      = тзСтрокаОстатки.Номенклатура; 
				НоваяСтрокаТох.СерияНоменклатуры = тзСтрокаОстатки.СерияНоменклатуры; 
				НоваяСтрокаТох.ЕдиницаИзмерения  = НоваяСтрокаТох.Номенклатура.ЕдиницаХраненияОстатков;
				НоваяСтрокаТох.Коэффициент 		 = НоваяСтрокаТох.ЕдиницаИзмерения.Коэффициент;  
				НоваяСтрокаТох.Количество        = Списать;
				
				тзСтрокаОстатки.ОстатокТОХ = тзСтрокаОстатки.ОстатокТОХ - Списать;   
				РаспределитьПоСериям       = РаспределитьПоСериям - Списать;
				
				Если тзСтрокаОстатки.ОстатокТОХ = 0 Тогда  
					тзСтрокаОстатки.Отработано  = Истина;
				КонецЕсли;         
				
				Если РаспределитьПоСериям > 0  Тогда  
					
					// Для количество, для которых нет остатков, добавляется строка с пустой серией
					
					НоваяСтрокаТох                   = тзНовыеСтроки.Добавить();
					НоваяСтрокаТох.Номенклатура      = тзСтрокаТОХ.Номенклатура; 
					НоваяСтрокаТох.ЕдиницаИзмерения  = НоваяСтрокаТох.Номенклатура.ЕдиницаХраненияОстатков;
					НоваяСтрокаТох.Коэффициент 		 = НоваяСтрокаТох.ЕдиницаИзмерения.Коэффициент;   
					НоваяСтрокаТох.Количество        = РаспределитьПоСериям;  
					РаспределитьПоСериям             = 0;
						
					Сообщить("Строка " + Строка(тзСтрокаТОХ.НомерСтроки) + ": недостаточно остатка " + Строка(тзСтрокаТОХ.Номенклатура) 
					       + " артикул " + СОКРЛП(тзСтрокаТОХ.Номенклатура.Артикул) 
					       + ", серия " + СОКРЛП(Строка(тзСтрокаТОХ.СерияНоменклатуры)) + " в количестве " + Строка(РаспределитьПоСериям) 
						   + " " +  СОКРЛП(Строка(тзСтрокаТОХ.ЕдиницаИзмерения)) + ". Поле серии очищено.");
				
				КонецЕсли;   
			
			КонецЦикла;  
			
		КонецЕсли;
	
		Если РаспределитьПоСериям > 0 Тогда        
			
			Сообщить("Строка " + Строка(тзСтрокаТОХ.НомерСтроки) + ": недостаточно остатка " + Строка(тзСтрокаТОХ.Номенклатура)  
			       + " артикул " + СОКРЛП(тзСтрокаТОХ.Номенклатура.Артикул) 
			       + ", серия " + СОКРЛП(Строка(тзСтрокаТОХ.СерияНоменклатуры)) + " в количестве " + Строка(РаспределитьПоСериям) 
				   + " " +  СОКРЛП(Строка(тзСтрокаТОХ.ЕдиницаИзмерения)) + ?(Не ДобавитьСтроку, ". Установлено количество 0.", "")); 
				   
			Если Не ДобавитьСтроку Тогда
				тзСтрокаТОХ.Количество = 0;
			КонецЕсли;      
			
		КонецЕсли;   
			   
	КонецЦикла;   
		
	// Добавить новые строки
	Для каждого тзСтрокаТОХ Из тзНовыеСтроки Цикл  
		
		МассивСтрок   = ТаблТоваров.НайтиСтроки(Новый Структура("Номенклатура", тзСтрокаТОХ.Номенклатура));   
		
		ИндексВставки = ТаблТоваров.Индекс(МассивСтрок[0]) + 1;
		ДобСтрока = ТаблТоваров.Вставить(ТаблТоваров.Индекс(МассивСтрок[0]) + 1);  
		
		ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрокаТОХ);
	
	КонецЦикла;  
	
	ДокОбъект.ТоварыОтветственногоХранения.Загрузить(ТаблТоваров);
	
КонецПроцедуры      

Процедура СкорректироватьДоступноТОХПоСерии(ОстаткиОбщие, ОстаткиПоСерии, НужноСписать)

	Если ОстаткиПоСерии.КоличествоОстатокТОХ <= 0 Тогда  
		ОстаткиПоСерии.ДоступноТОХПоСерии = 0;
	Иначе
		
		Если ОстаткиПоСерии.КоличествоОстатокТОХФилиал = 0 Тогда  
			ОстаткиПоСерии.ДоступноТОХПоСерии = ОстаткиПоСерии.КоличествоОстатокТОХ;   
			
		ИначеЕсли ОстаткиПоСерии.КоличествоОстатокТОХФилиал > 0 Тогда  
			
			// Добавить до КоличествоОстатокТОХ из имеющихся отрицат.остатков других серий  
			ДобратьТОХ = МИН(НужноСписать, ОстаткиПоСерии.КоличествоОстатокТОХ - МАКС(ОстаткиПоСерии.ДоступноТОХПоСерии, 0), -ОстаткиОбщие.КоличествоОстатокТОХФилиалОтрицат);
			
			ОстаткиПоСерии.ДоступноТОХПоСерии = ОстаткиПоСерии.ДоступноТОХПоСерии + ДобратьТОХ; 
			ОстаткиОбщие.КоличествоОстатокТОХФилиалОтрицат = ОстаткиОбщие.КоличествоОстатокТОХФилиалОтрицат + ДобратьТОХ;
				
		Иначе   // ОстаткиПоСерии.КоличествоОстатокТОХФилиал < 0 
			ОстаткиПоСерии.ДоступноТОХПоСерии = ОстаткиПоСерии.КоличествоОстатокТОХ;
		КонецЕсли;  

    КонецЕсли;

КонецПроцедуры

Процедура СверитьТабЧастьТОХиДвижения(тзТОХ, ТаблицаДвижений, ВыводитьСообщения, Отказ, ТекстСообщения) Экспорт  

	тзЗаписи = ТаблицаДвижений.Скопировать();
	тзЗаписи.Свернуть("Номенклатура, СерияНоменклатуры", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗаписи.Номенклатура,
		|	тзЗаписи.СерияНоменклатуры,
		|	тзЗаписи.Количество
		|ПОМЕСТИТЬ ТабЗаписи
		|ИЗ
		|	&тзЗаписи КАК тзЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзТОХ.Номенклатура,
		|	тзТОХ.СерияНоменклатуры,
		|	тзТОХ.Количество
		|ПОМЕСТИТЬ ТабТОХ
		|ИЗ
		|	&тзТОХ КАК тзТОХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДокументСписанияТОХ.Номенклатура,
		|	ДокументСписанияТОХ.СерияНоменклатуры,
		|	СУММА(ДокументСписанияТОХ.Количество) КАК Количество
		|ПОМЕСТИТЬ ТабДокумент
		|ИЗ
		|	ТабТОХ КАК ДокументСписанияТОХ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДокументСписанияТОХ.Номенклатура,
		|	ДокументСписанияТОХ.СерияНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабДокумент.Номенклатура,
		|	ТабДокумент.СерияНоменклатуры,
		|	ТабДокумент.Количество,
		|	ЕСТЬNULL(ТабЗаписи.Количество, 0) КАК КоличествоВРегистре,
		|	ТабДокумент.Количество - ЕСТЬNULL(ТабЗаписи.Количество, 0) КАК Расхождение,
		|	ТабДокумент.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
		|ИЗ
		|	ТабДокумент КАК ТабДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаписи КАК ТабЗаписи
		|		ПО ТабДокумент.Номенклатура = ТабЗаписи.Номенклатура
		|			И ТабДокумент.СерияНоменклатуры = ТабЗаписи.СерияНоменклатуры
		|ГДЕ
		|	НЕ ТабДокумент.Количество = ЕСТЬNULL(ТабЗаписи.Количество, 0)";
	
	Запрос.УстановитьПараметр("тзТОХ", тзТОХ);
	Запрос.УстановитьПараметр("тзЗаписи", тзЗаписи);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда  
		
		ТекстСообщения = "Есть отрицательные остатки по измененным товарам с вкладки ТОХ. Проверьте заполнение вкладки ТОХ и проведите документ.";
	
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС 
			       + Строка(Выборка.Номенклатура) + " артикул " + СОКРЛП(Выборка.Номенклатура.Артикул) + ", серия " + СОКРЛП(Строка(Выборка.СерияНоменклатуры)) 
			       + ": не хватает " + Строка(Выборка.Расхождение) + " " + Строка(Выборка.ЕдиницаИзмерения);
		КонецЦикла;               
			   
		#Если Клиент Тогда    
		Если ВыводитьСообщения Тогда
			Сообщить(ТекстСообщения);					   
		КонецЕсли;			
	    #КонецЕсли
			   
		Отказ = Истина;   
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьВТ_Расхождения(Запрос, ДокОбъект, ТаблицаДвижений) Экспорт
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗаписи.Номенклатура,
		|	тзЗаписи.Количество
		|ПОМЕСТИТЬ ТабЗаписи
		|ИЗ
		|	&тзЗаписи КАК тзЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзТОХ.Номенклатура,
		|	тзТОХ.Количество
		|ПОМЕСТИТЬ ТабТОХ
		|ИЗ
		|	&тзТОХ КАК тзТОХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзТовары.Номенклатура,
		|	тзТовары.Количество
		|ПОМЕСТИТЬ ТабТовары
		|ИЗ
		|	&тзТовары КАК тзТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабЗаписи.Номенклатура,
		|	ТабТОХ.Номенклатура КАК НоменклатураТОХ,
		|	ЕСТЬNULL(ТабТОХ.Количество, 0) КАК Количество,
		|	ТабТОХ.Количество КАК Количество1,
		|	ТабЗаписи.Количество КАК Количество2
		|ПОМЕСТИТЬ ВТ_Расхождения
		|ИЗ
		|	ТабЗаписи КАК ТабЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТОХ КАК ТабТОХ
		|		ПО (ТабТОХ.Номенклатура = ТабЗаписи.Номенклатура)
		|ГДЕ
		|	НЕ ТабЗаписи.Количество = ЕСТЬNULL(ТабТОХ.Количество, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расхождения.Номенклатура,
		|	ЕСТЬNULL(ТабТовары.Количество, 0) КАК Количество,
		|	ВТ_Расхождения.Количество КАК КоличествоТОХ
		|ПОМЕСТИТЬ ВТ_РасхожденияТовары
		|ИЗ
		|	ВТ_Расхождения КАК ВТ_Расхождения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТовары КАК ТабТовары
		|		ПО ВТ_Расхождения.Номенклатура = ТабТовары.Номенклатура
		|ГДЕ
		|	ВТ_Расхождения.Количество > ЕСТЬNULL(ТабТовары.Количество, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабЗаписи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабТОХ";
		
	тзЗаписи = ТаблицаДвижений.Выгрузить();
	тзЗаписи.Свернуть("Номенклатура", "Количество");

	тзТОХ = ДокОбъект.ТоварыОтветственногоХранения.Выгрузить();
	тзТОХ.Свернуть("Номенклатура", "Количество");
	
	МетаданныеДокумента = ДокОбъект.Метаданные();   
	
	Если ОбщегоНазначения.ЕстьТабЧастьДокумента("Товары", МетаданныеДокумента) И ОбщегоНазначения.ЕстьТабЧастьДокумента("Материалы", МетаданныеДокумента) Тогда
		тзТовары = ДокОбъект.Товары.Выгрузить(); 
	ИначеЕсли ОбщегоНазначения.ЕстьТабЧастьДокумента("Материалы", МетаданныеДокумента) Тогда 
		тзТовары = ДокОбъект.Материалы.Выгрузить();
	Иначе
		тзТовары = ДокОбъект.Товары.Выгрузить();
	КонецЕсли;
		
	тзТовары.Свернуть("Номенклатура", "Количество");
	
	Запрос.УстановитьПараметр("тзТОХ",     тзТОХ);
	Запрос.УстановитьПараметр("тзЗаписи",  тзЗаписи);  
	Запрос.УстановитьПараметр("тзТовары",  тзТовары);
	Запрос.УстановитьПараметр("ДокСсылка", ДокОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата",      ДокОбъект.Дата);
	
	Запрос.Выполнить();

КонецПроцедуры

Процедура СверитьТабЧастьТОХиВыкупы(Запрос, ВыводитьСообщения, Отказ) Экспорт
	
	// Сравнение с имеющимися выкупами по измененной номенклатуре и документу
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Расхождения.Номенклатура КАК Номенклатура,
	|	ВыкупДокументыОснования.Ссылка КАК Выкуп,
	|	СУММА(ВыкупДокументыОснования.Количество) КАК КоличествоВыкуп,
	|	ВТ_Расхождения.Количество КАК Количество,
	|	МАКСИМУМ(ВТ_Расхождения.Номенклатура.Артикул) КАК Артикул,
	|	МАКСИМУМ(ВТ_Расхождения.Номенклатура.ЕдиницаХраненияОстатков) КАК ЕдиницаИзмерения
	|ИЗ
	|	ВТ_Расхождения КАК ВТ_Расхождения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения.ДокументыОснованияВыкупаТОХ КАК ВыкупДокументыОснования
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупСОтветственногоХранения КАК ВыкупСОтветственногоХранения
	|			ПО ВыкупДокументыОснования.Ссылка = ВыкупСОтветственногоХранения.Ссылка
	|				И (ВыкупСОтветственногоХранения.Проведен)
	|				И (ВыкупСОтветственногоХранения.Дата >= &Дата)
	|				И (ВыкупДокументыОснования.ДокументОснование = &ДокСсылка)
	|		ПО (ВыкупДокументыОснования.Номенклатура = ВТ_Расхождения.Номенклатура)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Расхождения.Номенклатура,
	|	ВыкупДокументыОснования.Ссылка,
	|	ВТ_Расхождения.Количество
	|
	|ИТОГИ
	|	МАКСИМУМ(Количество),   
	|	СУММА(КоличествоВыкуп),
	|	МАКСИМУМ(Артикул),
	|	МАКСИМУМ(ЕдиницаИзмерения)
	|ПО
	|	Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда     
		
		ТекстСообщения = "";
		
		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаНоменклатура.Следующий() Цикл
			
			Если ВыборкаНоменклатура.Количество = ВыборкаНоменклатура.КоличествоВыкуп Тогда
				Продолжить;
			КонецЕсли; 
			
			ТекстСообщения = ?(ТекстСообщения = "", "Ошибка проведения, вкладка ТОХ не соответствует Выкупам:", ТекстСообщения);

			ТекстСообщения = ТекстСообщения + Символы.ПС  
			       + Строка(ВыборкаНоменклатура.Номенклатура) + " артикул " + СОКРЛП(ВыборкаНоменклатура.Артикул) + Символы.ПС 
				   + "Новое количество " + ВыборкаНоменклатура.Количество  + " " + Строка(ВыборкаНоменклатура.ЕдиницаИзмерения)
				   + " не соответствует количеству в выкупах: ";
			
			Выборка = ВыборкаНоменклатура.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС + "   " + Строка(Выборка.Выкуп) + " - " + Выборка.КоличествоВыкуп + " " + Строка(Выборка.ЕдиницаИзмерения);
			КонецЦикла;               
			
		КонецЦикла;               
			
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			
			Если ВыводитьСообщения Тогда
				Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);					   
			КонецЕсли;
			   
			Отказ = Истина;    
			
		КонецЕсли;			
		
	КонецЕсли; 

КонецПроцедуры

Процедура ПроверитьНедосписаниеТОХ(Запрос, МассивТоваров, ВыводитьСообщения, Отказ) Экспорт
	
	// Сравнение с собственными остатками по измененной номенклатуре    
	
	// ... Остатки получаем тем же запросом, которым заполняется закладка ТОХ при проведении нового документа
	ЗапросОстатки = Новый Запрос;   
	ЗапросОстатки.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ЗапросОстатки.Текст = ТекстЗапросаЗаполнитьТЧТОХ(); 
		
	ЗапросОстатки.УстановитьПараметр("МассивТоваров", 	МассивТоваров);
	ЗапросОстатки.УстановитьПараметр("Дата", 			Новый Граница(Запрос.Параметры.Дата, ВидГраницы.Исключая)); 
	ЗапросОстатки.УстановитьПараметр("Склад",           Константы.ОсновнойСклад.Получить());           
	
	ЗапросОстатки.Выполнить();
	ОбщиеОстаткиТОХ = ЗапросОстатки.МенеджерВременныхТаблиц.Таблицы["ВТ_ОстаткиТОХ_ПоНоменклатуре"].ПолучитьДанные().Выгрузить();
	
	// Сравнение разницы закладок Товары-ТОХ с остатками.
	// Если собствееные товары к списанию превышают остаток собств.товаров, значит ТОХ недосписаны
	Запрос.УстановитьПараметр("ОбщиеОстаткиТОХ", ОбщиеОстаткиТОХ);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбщиеОстаткиТОХ.Номенклатура,
	|	ОбщиеОстаткиТОХ.СобственныйОстаток КАК СобственныйОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	&ОбщиеОстаткиТОХ КАК ОбщиеОстаткиТОХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВТ_Расхождения.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВТ_Расхождения.Количество,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК КоличествоТовары,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) - МАКСИМУМ(ВТ_Расхождения.Количество) КАК КоличествоСобственное,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_Остатки.СобственныйОстаток, 0) < 0
	|				ТОГДА 0
	|			ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СобственныйОстаток, 0)
	|		КОНЕЦ) КАК СобственныйОстаток           
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_Расхождения КАК ВТ_Расхождения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_Расхождения.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|	    И РеализацияТоваровУслугТовары.Ссылка = &ДокСсылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Расхождения.Номенклатура = ВТ_Остатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Расхождения.Номенклатура,
	|	ВТ_Расхождения.Количество
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Номенклатура,     
	|	ВТ_Результат.Номенклатура.Артикул КАК Артикул,
	|	ВТ_Результат.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	ВТ_Результат.Количество,
	|	ВТ_Результат.КоличествоСобственное,
	|	ВТ_Результат.СобственныйОстаток,
	|	ВТ_Результат.КоличествоСобственное - ВТ_Результат.СобственныйОстаток КАК НедосписанТОХ
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.КоличествоСобственное > ВТ_Результат.СобственныйОстаток";
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда     
		
		ТекстСообщения = "Ошибка проведения, недостаточное заполнение вкладки ТОХ:";

		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл     
			ТекстСообщения = ТекстСообщения + Символы.ПС  
		       + Строка(Выборка.Номенклатура) + " артикул " + СОКРЛП(Выборка.Артикул) 
			    + ". Количество к списанию собственное - " + Выборка.КоличествоСобственное  + " " + Строка(Выборка.ЕдиницаИзмерения)
			   + ", собственный остаток - " + Выборка.СобственныйОстаток + " " + Строка(Выборка.ЕдиницаИзмерения);
		КонецЦикла;               
			
		Если ВыводитьСообщения Тогда
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);					   
		КонецЕсли;			
			   
		Отказ = Истина;   
		
	КонецЕсли; 

КонецПроцедуры


Процедура ПроверитьПроведениеПоТОХНаВыкупы(ДокОбъект, НаборТОХ, ВыводитьСообщения,  Отказ) Экспорт
	
	// Получение измененных строк ТОХ в ВТ_Расхождения
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МСК.ПолучитьВТ_Расхождения(Запрос, ДокОбъект, НаборТОХ);
	
	тзРасхождения = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_Расхождения"].ПолучитьДанные().Выгрузить();
	тзРасхожденияТовары = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_РасхожденияТовары"].ПолучитьДанные().Выгрузить();
	
	Если тзРасхождения.Количество() > 0 Тогда
		
		Если тзРасхожденияТовары.Количество() > 0 Тогда
			
			Отказ = Истина;
			
			ТекстСообщения = "Ошибка проведения, количество на вкладке ТОХ превышает количество на вкладке Товар:";
			
			Для каждого тзСтрока Из тзРасхожденияТовары Цикл
				ТекстСообщения = ТекстСообщения + Символы.ПС  
			       + Строка(тзСтрока.Номенклатура) + " артикул " + СОКРЛП(тзСтрока.Номенклатура.Артикул) 
				   + ". Количество ТОХ - " + тзСтрока.КоличествоТОХ + " " + Строка(тзСтрока.Номенклатура.ЕдиницаХраненияОстатков)
				   + ", количество Товары - " + тзСтрока.Количество + " " + Строка(тзСтрока.Номенклатура.ЕдиницаХраненияОстатков);
			 КонецЦикла;    
			   
			Сообщить(ТекстСообщения, СтатусСообщения.ОченьВажное);   
		
		КонецЕсли;    
		
		// Если расхождения есть, то проводятся проверки    
		// Проверка 1. на соответствие выкупам измененных строк 
		МСК.СверитьТабЧастьТОХиВыкупы(Запрос, ВыводитьСообщения, Отказ);
		
		#Если Клиент Тогда      
		// Проверка 2. На недосписанные выкупы
		ОтключитьПроверкуТоварыПриИзмененииТОХ = Справочники.МТ_ПредопределенныеЗначения.ОтключитьПроверкуТоварыПриИзмененииТОХ.Значение;   
		
		ПолныеПраваТОХ = РольДоступна("ТОХ_ПолныеПрава");
		
		Если Не ПолныеПраваТОХ Или (ПолныеПраваТОХ И Не ОтключитьПроверкуТоварыПриИзмененииТОХ = Истина) Тогда
		
			МассивТоваров = тзРасхождения.ВыгрузитьКолонку("Номенклатура");
			ПроверитьНедосписаниеТОХ(Запрос, МассивТоваров, ВыводитьСообщения, Отказ);    
			
		КонецЕсли;
    	#КонецЕсли
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьПроведениеПоТОХ(ДокОбъект, НаборТОХ, Отказ) Экспорт
	
	ТаблицаДвижений = РегистрыНакопления.ТоварыОтветственногоХранения.ПолучитьДвиженияСписание(ДокОбъект);
	
	// Проверка на отрицательные остатки по всей таб.части ТОХ, без вывода сообщения
	ОтказТОХ = Ложь;    
	ТекстОшибки = "";
	МСК.СверитьТабЧастьТОХиДвижения(ДокОбъект.ТоварыОтветственногоХранения.Выгрузить(), ТаблицаДвижений, Ложь, ОтказТОХ, ТекстОшибки);   

	Если ОтказТОХ Тогда
		
		// Проверка на отрицательные остатки по сериям и количеству, которые различаются в старых и новых движениях ТОХ.
		// Отказ происходит только в случае расхождения по измененным строкам.
		тзДвиженияТОХСтарый = НаборТОХ.Выгрузить();   
		тзДвиженияТОХСтарый.Свернуть("Номенклатура, СерияНоменклатуры", "Количество");
		
		ТекстОшибки2 = "";
		МСК.СверитьТабЧастьТОХиДвижения(тзДвиженияТОХСтарый, ТаблицаДвижений, Истина, Отказ, ТекстОшибки2);  
		
		Если Не Отказ Тогда
			// Движения совпали, но поскольку при первой проверке не совпали таб.части, то все равно отказ
			#Если Клиент Тогда    
			Сообщить(ТекстОшибки, СтатусСообщения.ОченьВажное);					   
	    	#КонецЕсли
		
			Отказ = Истина;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	МСК.ПроверитьПроведениеПоТОХНаВыкупы(ДокОбъект, НаборТОХ, Истина, Отказ); 

КонецПроцедуры


Функция ПроверитьВыкупыТОХ(ДокСсылка) Экспорт

	Набор = РегистрыНакопления.ТоварыОтветственногоХранения.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(ДокСсылка);
	Набор.Прочитать();
	
	Если Набор.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	
	// Найти документы выкупа по договорам поставщика из движения по регистру ТОХ 
	Запрос = Новый Запрос;  
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзДвиженияТОХ.Номенклатура,
		|	тзДвиженияТОХ.СерияНоменклатуры,
		|	тзДвиженияТОХ.ДоговорКонтрагента,
		|	тзДвиженияТОХ.Количество
		|ПОМЕСТИТЬ ВТ_ДоговораТОХ
		|ИЗ
		|	&тзДвиженияТОХ КАК тзДвиженияТОХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоговораТОХ.Номенклатура,
		|	ВТ_ДоговораТОХ.СерияНоменклатуры,
		|	ВТ_ДоговораТОХ.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВТ_ДоговораТОХ.Количество,
		|	ТОХПереданныеОбороты.Регистратор КАК Выкуп,
		|	ТОХПереданныеОбороты.Период КАК Период,
		|	ТОХПереданныеОбороты.КоличествоРасход
		|ПОМЕСТИТЬ ВТ_Выкупы1
		|ИЗ
		|	ВТ_ДоговораТОХ КАК ВТ_ДоговораТОХ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХранения.Обороты(
		|				&Дата,
		|				,
		|				Регистратор,
		|				ДоговорКонтрагента В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДоговораТОХ.ДоговорКонтрагента
		|					ИЗ
		|						ВТ_ДоговораТОХ КАК ВТ_ДоговораТОХ)) КАК ТОХПереданныеОбороты
		|		ПО ВТ_ДоговораТОХ.ДоговорКонтрагента = ТОХПереданныеОбороты.ДоговорКонтрагента
		|ГДЕ
		|	ТОХПереданныеОбороты.Регистратор ССЫЛКА Документ.ВыкупСОтветственногоХранения
		|	И ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).КонецПериода >= &Дата
		|	И НЕ ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТОХ.ВозвратПоБраку)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДоговораТОХ.Номенклатура,
		|	ВТ_ДоговораТОХ.СерияНоменклатуры,
		|	ВТ_ДоговораТОХ.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ВТ_ДоговораТОХ.Количество,
		|	ТОХПереданныеОбороты.Регистратор КАК Выкуп,
		|	ТОХПереданныеОбороты.Период КАК Период,
		|	ТОХПереданныеОбороты.КоличествоРасход
		|ПОМЕСТИТЬ ВТ_Выкупы2
		|ИЗ
		|	ВТ_ДоговораТОХ КАК ВТ_ДоговораТОХ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Обороты(
		|				&Дата,
		|				,
		|				Регистратор,
		|				Договор В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДоговораТОХ.ДоговорКонтрагента
		|					ИЗ
		|						ВТ_ДоговораТОХ КАК ВТ_ДоговораТОХ)) КАК ТОХПереданныеОбороты
		|		ПО ВТ_ДоговораТОХ.ДоговорКонтрагента = ТОХПереданныеОбороты.Договор
		|ГДЕ
		|	ТОХПереданныеОбороты.Регистратор ССЫЛКА Документ.ВыкупСОтветственногоХранения
		|	И ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|	И ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).КонецПериода >= &Дата
		|	И НЕ ВЫРАЗИТЬ(ТОХПереданныеОбороты.Регистратор КАК Документ.ВыкупСОтветственногоХранения).Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыТОХ.ВозвратПоБраку)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Выкупы1.Номенклатура,
		|	ВТ_Выкупы1.СерияНоменклатуры,
		|	ВТ_Выкупы1.ДоговорКонтрагента,
		|	ВТ_Выкупы1.Количество,
		|	ВТ_Выкупы1.Выкуп,
		|	ВТ_Выкупы1.Период КАК Период
		|ИЗ
		|	ВТ_Выкупы1 КАК ВТ_Выкупы1
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_Выкупы2.Номенклатура,
		|	ВТ_Выкупы2.СерияНоменклатуры,
		|	ВТ_Выкупы2.ДоговорКонтрагента,
		|	ВТ_Выкупы2.Количество,
		|	ВТ_Выкупы2.Выкуп,
		|	ВТ_Выкупы2.Период
		|ИЗ
		|	ВТ_Выкупы2 КАК ВТ_Выкупы2";
	
	Запрос.УстановитьПараметр("тзДвиженияТОХ", Набор.Выгрузить());  
	Запрос.УстановитьПараметр("Дата", ДокСсылка.Дата);    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

Функция ЗаблокироватьПерепроведениеТОХ(ДокОбъект, Отказ) Экспорт
	
	ДокСсылка = ДокОбъект.Ссылка;
	
	ВключенаБлокировкаПерепроведения = ДокСсылка.Проведен 
	                                    И Справочники.МТ_ПредопределенныеЗначения.ВключитьБлокировкуПерепроведенияДокументовТОХ(ТипЗнч(ДокСсылка));
										
	Если НЕ ВключенаБлокировкаПерепроведения Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ДокОбъект.Дата = ДокСсылка.Дата Тогда
		
		Сообщить("Дата документа с заполненной вкладкой ТОХ не может быть изменена");  
		Отказ = Истина;
		Возврат Истина;
	
	КонецЕсли;  
	
	Если ЕстьОшибкиИзмененияТОХПриПроведении(ДокОбъект) Тогда   
	
		Отказ = Истина;  
		Возврат Истина;
	
	КонецЕсли; 
	
	Возврат Ложь;

КонецФункции // ()

Функция ЕстьОшибкиИзмененияТОХПриПроведении(ДокОбъект)
	
	тзТОХНовый = ДокОбъект.ТоварыОтветственногоХранения.Выгрузить();  
	тзТОХНовый.Очистить();
	
	// Получение тзТОХНовый      
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		МСК.ЗаполнитьТЧТОХ(ДокОбъект, тзТОХНовый, ДокОбъект.СкладОтправитель, Ложь); 
	ИначеЕсли ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.КорректировкаПоступления") Тогда
		МСК.ЗаполнитьТЧТОХ(ДокОбъект, тзТОХНовый, ДокОбъект.СкладОрдер, Ложь);  
	Иначе
		МСК.ЗаполнитьТЧТОХ(ДокОбъект, тзТОХНовый, ДокОбъект.Склад, Ложь);  
	КонецЕсли;
	
	// Сравнить существующие ТОХ и новые, после заполнения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзТОХНовый.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	тзТОХНовый.Количество
		|ПОМЕСТИТЬ ВТ_ТОХНовая
		|ИЗ
		|	&тзТОХНовый КАК тзТОХНовый
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзТОХ.Номенклатура,
		|	тзТОХ.Количество
		|ПОМЕСТИТЬ ВТ_ТОХ
		|ИЗ
		|	&тзТОХ КАК тзТОХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТОХНовая.Номенклатура,
		|	ВТ_ТОХНовая.Номенклатура.Артикул КАК Артикул,
		|	ВТ_ТОХНовая.Номенклатура.КодПроизводителя КАК ИнвНомер,
		|	ЕСТЬNULL(ВТ_ТОХ.Количество, 0) КАК Количество,
		|	ВТ_ТОХНовая.Количество КАК КоличествоНовое
		|ИЗ
		|	ВТ_ТОХНовая КАК ВТ_ТОХНовая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТОХ КАК ВТ_ТОХ
		|		ПО ВТ_ТОХНовая.Номенклатура = ВТ_ТОХ.Номенклатура
		|ГДЕ
		|	ВТ_ТОХНовая.Количество > ЕСТЬNULL(ВТ_ТОХ.Количество, 0)";
	
	тзТОХНовый.Свернуть("Номенклатура", "Количество");
	тзТОХ = ДокОбъект.Ссылка.ТоварыОтветственногоХранения.Выгрузить();  
	тзТОХ.Свернуть("Номенклатура", "Количество");
	
	Запрос.УстановитьПараметр("тзТОХНовый", тзТОХНовый);
	Запрос.УстановитьПараметр("тзТОХ", тзТОХ);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.СписаниеТоваров.СоздатьДокумент().ПолучитьМакет("РасхожденияТОХ"); 
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заголовок = "Блокировка перепроведения в связи с увеличением количества по артикулам ТОХ" + Символы.ПС + Строка(ДокОбъект);
	ТабДок.Вывести(Область);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Область = Макет.ПолучитьОбласть("Строка");   
		Область.Параметры.Заполнить(Выборка); 
		ТабДок.Вывести(Область);
		
	КонецЦикла;      
	
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Показать("Блокировка перепроведения ТОХ"); 
	
	Возврат Истина;

КонецФункции

Функция ПолучитьДеньПоКалендарю(Дата) Экспорт

	ДеньНедели = ДеньНедели(Дата);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)"; 

	Запрос.УстановитьПараметр("ДатаКалендаря", НачалоДня(Дата));

	Результат = Запрос.Выполнить();

	Если Результат.Пустой() Тогда
		Возврат ?(ДеньНедели = 6, 1, ДеньНедели);	
	Иначе
		Возврат 6;
	КонецЕсли;   

КонецФункции

Функция ПолучитьДоговор(Контрагент, НомерДоговора, ДатаДоговора)
	
	//+Шульман А. 04.03.2026 #UT10-5735
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.Дата = &Дата
		|	И ДоговорыКонтрагентов.Номер = &Номер  
		//+Шульман А. 27.04.2026 #UT10-5837
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)"; 
		//-Шульман А. 27.04.2026 #UT10-5837
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номер", НомерДоговора);
	Запрос.УстановитьПараметр("Дата",  ДатаДоговора);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий();
		Договор = Выборка.Ссылка;
		
	КонецЕсли;
	
	Возврат Договор;  
	//-Шульман А. 04.03.2026 #UT10-5735

КонецФункции     

Функция ПолучитьДоговорСПоставщиком(Контрагент)
	
	//+Шульман А. 27.04.2026 #UT10-5837
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)"; 
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Если Выборка.Количество() = 1 Тогда
		
			Выборка.Следующий();
			Договор = Выборка.Ссылка;

		КонецЕсли;
			
	КонецЕсли;
	
	Возврат Договор;  
	//-Шульман А. 27.04.2026 #UT10-5837

КонецФункции // ()


Функция СуществуетДокументПоДаннымВходящегоДокумента(НомерПоДаннымПоставщика, ДатаПоДаннымПоставщика, ИмяДокумента)
	
	//+Макрушин Е. 26.02.2026 #UT10-5657
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК КорректировкаПоступления " + "
	|ГДЕ
	|	КорректировкаПоступления.ПометкаУдаления = ЛОЖЬ
	|	И КорректировкаПоступления.НомерВходящегоДокумента = &НомерПоДаннымПоставщика
	|	И НачалоПериода(КорректировкаПоступления.ДатаВходящегоДокумента, День) = &ДатаПоДаннымПоставщика";
	
	Запрос.Параметры.Вставить("НомерПоДаннымПоставщика", НомерПоДаннымПоставщика);
	Запрос.Параметры.Вставить("ДатаПоДаннымПоставщика", НачалоДня(ДатаПоДаннымПоставщика));
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка; 
	Иначе
		Возврат Документы[ИмяДокумента].ПустаяСсылка(); 	
	КонецЕсли;	
	//-Макрушин Е. 26.02.2026 #UT10-5657
	
КонецФункции

Функция ЭтоМежфилиальнаяПоставка(Контрагент) Экспорт
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5900
	ЭтоМежфилиальнаяПоставка = Ложь;
	
	Если ЭтоМагистраль(Контрагент) Тогда
		Возврат ЭтоМежфилиальнаяПоставка;
	КонецЕсли;
	
	Если Контрагент = Константы.ОсновнойПоставщик.Получить() Тогда
		
		ЭтоМежфилиальнаяПоставка = Истина;
		Возврат ЭтоМежфилиальнаяПоставка;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобственныеСклады.Ссылка
		|ИЗ
		|	Справочник.СобственныеСклады КАК СобственныеСклады
		|ГДЕ
		|	СобственныеСклады.Поставщик = &Поставщик
		|	И НЕ СобственныеСклады.ПометкаУдаления
		|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса";
	
	Запрос.УстановитьПараметр("Поставщик", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЭтоМежфилиальнаяПоставка = Истина;
	КонецЕсли;
	
	Возврат ЭтоМежфилиальнаяПоставка;
	//-Сёмин Р.И. 08.06.2026 #UT10-5900
	
КонецФункции

Функция НадоУчитыватьКонстантуОстаточныйСрокГодности(ДокПТУ) Экспорт
	
	//+Сёмин Р.И. 22.06.2026 #UT10-5914
	УчитыватьКонстантуОстаточныйСрокГодности = Ложь;
	
	Для Каждого Стр Из ДокПТУ.Товары Цикл
		
		Если ЗначениеЗаполнено(Стр.ЗаказПоставщику) Тогда
			
			УчитыватьКонстантуОстаточныйСрокГодности = ДокПТУ.Экспресс И ЗначениеЗаполнено(Стр.ЗаказПоставщику.IDСклада);
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат УчитыватьКонстантуОстаточныйСрокГодности;
	//-Сёмин Р.И. 22.06.2026 #UT10-5914
		
КонецФункции

Процедура ЗаполнитьОстаточныеСрокиГодностиМаркировки(КодыМаркировки, ДатаОтсчета, ДоговорКонтрагента, ДатаДокумента, УчитыватьКонстантуОстаточныйСрокГодности) Экспорт
	
	//+Сёмин Р.И. 22.06.2026 #UT10-5914
	Для Каждого Стр Из КодыМаркировки Цикл
		
		Если НЕ ЗначениеЗаполнено(Стр.СрокГодностиИзЧЗ) Тогда
			
			ПроверкаКодаЧЗ = МенеджерОборудованияМаркировка.ПроверитьСостояниеКМ(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КодМаркировки, "КодМаркировки"));
			
			Если ПроверкаКодаЧЗ.Свойство("expirationDate") Тогда
				Стр.СрокГодностиИзЧЗ = ПреобразоватьДатуМДМ(ПроверкаКодаЧЗ.expirationDate);
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Стр.СрокГодностиИзЧЗ) Тогда
			Стр.ОсталосьДнейЧЗ = (Стр.СрокГодностиИзЧЗ - ДатаОтсчета) / 60 / 60 / 24;
		КонецЕсли;
		
		СтруктураМинимальныйСрок = ПолучитьМинимальныйСрокГодностиМаркировки(
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.КодМаркировки, "Номенклатура"),
			ДоговорКонтрагента,
			ДатаДокумента,
			УчитыватьКонстантуОстаточныйСрокГодности
		);
		
		Стр.НашМинимальныйСрок = СтруктураМинимальныйСрок.Срок;
		Стр.СрокНарушен = Стр.НашМинимальныйСрок > Стр.ОсталосьДнейЧЗ;
		
	КонецЦикла;
	//-Сёмин Р.И. 22.06.2026 #UT10-5914
		
КонецПроцедуры

Функция ПолучитьМинимальныйСрокГодностиМаркировки(Номенклатура, Договор = Неопределено, ДатаДокумента = Неопределено, УчитыватьКонстантуОстаточныйСрокГодности = Ложь) Экспорт
	
	//+Сёмин Р.И. 22.06.2026 #UT10-5914
	Результат = Новый Структура("Срок,Источник", 0, "");
	
	СрокГодностиТоварнаяГруппаЧЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.ТоварнаяГруппаЧестногоЗнака, "ОстаточныйСрокГодности");
	СрокГодностиНоменклатурнаяГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.НоменклатурнаяГруппа, "ОстаточныйСрокГодности");
	СрокГодностиРодитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура.Родитель, "ОстаточныйСрокГодности");
	СрокГодностиНоменклатура = Номенклатура.ОстаточныйСрокГодности;
	
	СрокГодностиДоговор = 0;
	
	Если ЗначениеЗаполнено(Договор) И ЗначениеЗаполнено(ДатаДокумента) Тогда
		
		Для Каждого Стр Из Договор.ОстаточныйСрокГодности Цикл
			
			Если ДатаДокумента >= Стр.НачалоПериода И ДатаДокумента <= Стр.ОкончаниеПериода Тогда
				
				Если ЗначениеЗаполнено(СрокГодностиДоговор) Тогда
					СрокГодностиДоговор = Мин(СрокГодностиДоговор, Стр.СрокВДнях);
				Иначе
					СрокГодностиДоговор = Стр.СрокВДнях;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	тзСрокиГодности = Новый ТаблицаЗначений;
	тзСрокиГодности.Колонки.Добавить("Срок");
	тзСрокиГодности.Колонки.Добавить("Источник");
	
	ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, СрокГодностиТоварнаяГруппаЧЗ, "ТоварнаяГруппаЧЗ");
	ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, СрокГодностиНоменклатурнаяГруппа, "НоменклатурнаяГруппа");
	ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, СрокГодностиРодитель, "Родитель");
	ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, СрокГодностиНоменклатура, "Номенклатура");
	ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, СрокГодностиДоговор, "Договор");
	
	Если УчитыватьКонстантуОстаточныйСрокГодности Тогда
		ДобавитьСтрокуВТЗСрокиГодности(тзСрокиГодности, Константы.ОстаточныйСрокГодностиДляЭкспрессовСторСкл.Получить(), "КонстантаОстаточныйСрокГодности");
	КонецЕсли;
	
	Если тзСрокиГодности.Количество() > 0 Тогда
		
		тзСрокиГодности.Сортировать("Срок");
		ЗаполнитьЗначенияСвойств(Результат, тзСрокиГодности.Получить(0));
		
	КонецЕсли;
	
	Возврат Результат;
	//-Сёмин Р.И. 22.06.2026 #UT10-5914
	
КонецФункции

Процедура ДобавитьСтрокуВТЗСрокиГодности(ТЗ, Срок, Источник)
	
	//+Сёмин Р.И. 22.06.2026 #UT10-5914
	Если ЗначениеЗаполнено(Срок) Тогда
		
		НовСтр = ТЗ.Добавить();
		НовСтр.Срок = Срок;
		НовСтр.Источник = Источник;
		
	КонецЕсли;
	//-Сёмин Р.И. 22.06.2026 #UT10-5914
	
КонецПроцедуры
