
Процедура ЗаполнитьТоварыПоЯчейкам(Сборка) Экспорт 
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыВСборкеОстатки.Сборка,
		|	ТоварыВСборкеОстатки.Контрагент,
		|	ТоварыВСборкеОстатки.ЗаказПокупателя,
		|	ТоварыВСборкеОстатки.Номенклатура,
		|	ТоварыВСборкеОстатки.СобраноОстаток + ТоварыВСборкеОстатки.КСборкеОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВСборке.Остатки(, Сборка = &Сборка) КАК ТоварыВСборкеОстатки
		|ГДЕ
		|	ТоварыВСборкеОстатки.СобраноОстаток + ТоварыВСборкеОстатки.КСборкеОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейках.Склад,
		|	ТоварыВЯчейках.Номенклатура,
		|	ТоварыВЯчейках.Ячейка,
		|	СУММА(ТоварыВЯчейках.Количество) КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Регистратор = &Сборка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейках.Склад,
		|	ТоварыВЯчейках.Номенклатура,
		|	ТоварыВЯчейках.Ячейка";
		
		
		Запрос.УстановитьПараметр("Сборка", Сборка);
		Пакет = Запрос.ВыполнитьПакет();
		
		ТабЗаказов	= Пакет[0].Выгрузить();
		ТабЯчеек	= Пакет[1].Выгрузить();
		
		Для Каждого ТекЗаказ Из ТабЗаказов Цикл
			
			НайденныеСтроки =  ТабЯчеек.НайтиСтроки(Новый Структура("Номенклатура",ТекЗаказ.Номенклатура));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл  
				
				Если ТекЗаказ.Количество <= 0 Тогда 
					Прервать;
				КонецЕсли;
				
				Если ТекСтрока.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				ВычестьИзТекЯчейки = Мин(ТекСтрока.Количество,ТекЗаказ.Количество);
				
				ТекСтрока.Количество = ТекСтрока.Количество - ВычестьИзТекЯчейки ;
				ТекЗаказ.Количество = ТекЗаказ.Количество - ВычестьИзТекЯчейки;
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.ЗаказПокупателя = ТекЗаказ.ЗаказПокупателя;
				НоваяСтрока.Номенклатура 	= ТекСтрока.Номенклатура;
				НоваяСтрока.Склад		 	= ТекСтрока.Склад;
				НоваяСтрока.Ячейка		 	= ТекСтрока.Ячейка;
				НоваяСтрока.Количество		= ВычестьИзТекЯчейки;
			КонецЦикла;	
			
		КонецЦикла;			
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТоварыВСборкеОстатки.Контрагент,
		|	ТоварыВСборкеОстатки.ЗаказПокупателя,
		|	ТоварыВСборкеОстатки.Номенклатура,
		|	ТоварыВСборкеОстатки.СобраноОстаток + ТоварыВСборкеОстатки.КСборкеОстаток КАК Количество
		|ПОМЕСТИТЬ ТоварыВСборке
		|ИЗ
		|	РегистрНакопления.ТоварыВСборке.Остатки(, Сборка = &Сборка) КАК ТоварыВСборкеОстатки
		|ГДЕ
		|	ТоварыВСборкеОстатки.СобраноОстаток + ТоварыВСборкеОстатки.КСборкеОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейках.Склад,
		|	ТоварыВЯчейках.Номенклатура,
		|	ТоварыВЯчейках.Ячейка,
		|	СУММА(ТоварыВЯчейках.Количество) КАК Количество
		|ПОМЕСТИТЬ ДвиженияПоЯчейкам
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Регистратор = &Сборка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейках.Склад,
		|	ТоварыВЯчейках.Номенклатура,
		|	ТоварыВЯчейках.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб.Склад КАК Склад,
		|	Таб.Номенклатура КАК Номенклатура,
		|	Таб.Ячейка КАК Ячейка,
		|	СУММА(Таб.Количество) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыВЯчейках.Склад КАК Склад,
		|		ТоварыВЯчейках.Номенклатура КАК Номенклатура,
		|		ТоварыВЯчейках.Ячейка КАК Ячейка,
		|		-ТоварыВЯчейках.Количество КАК Количество
		|	ИЗ
		|		РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|	ГДЕ
		|		ТоварыВЯчейках.Регистратор = &Корректировка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДвиженияПоЯчейкам.Склад,
		|		ДвиженияПоЯчейкам.Номенклатура,
		|		ДвиженияПоЯчейкам.Ячейка,
		|		ДвиженияПоЯчейкам.Количество
		|	ИЗ
		|		ДвиженияПоЯчейкам КАК ДвиженияПоЯчейкам) КАК Таб
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб.Склад,
		|	Таб.Номенклатура,
		|	Таб.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Таб2.Контрагент КАК Контрагент,
		|	Таб2.ЗаказПокупателя КАК ЗаказПокупателя,
		|	Таб2.Номенклатура КАК Номенклатура,
		|	СУММА(Таб2.Количество) КАК Количество
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыВСборке2.Контрагент КАК Контрагент,
		|		ТоварыВСборке2.ЗаказПокупателя КАК ЗаказПокупателя,
		|		ТоварыВСборке2.Номенклатура КАК Номенклатура,
		|		ТоварыВСборке2.Собрано + ТоварыВСборке2.КСборке КАК Количество
		|	ИЗ
		|		РегистрНакопления.ТоварыВСборке КАК ТоварыВСборке2
		|	ГДЕ
		|		ТоварыВСборке2.Регистратор = &Корректировка
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыВСборке.Контрагент,
		|		ТоварыВСборке.ЗаказПокупателя,
		|		ТоварыВСборке.Номенклатура,
		|		ТоварыВСборке.Количество
		|	ИЗ
		|		ТоварыВСборке КАК ТоварыВСборке) КАК Таб2
		|
		|СГРУППИРОВАТЬ ПО
		|	Таб2.Контрагент,
		|	Таб2.ЗаказПокупателя,
		|	Таб2.Номенклатура";
		
		Запрос.УстановитьПараметр("Корректировка", Ссылка);
		Запрос.УстановитьПараметр("Сборка", Сборка);
		
		Пакет = Запрос.ВыполнитьПакет();
		
		ТабЗаказов	= Пакет[2].Выгрузить();
		ТабЯчеек	= Пакет[3].Выгрузить();
		
		Для Каждого ТекЗаказ Из ТабЗаказов Цикл
			
			НайденныеСтроки =  ТабЯчеек.НайтиСтроки(Новый Структура("Номенклатура",ТекЗаказ.Номенклатура));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл  
				
				Если ТекЗаказ.Количество <= 0 Тогда 
					Прервать;
				КонецЕсли;
				
				Если ТекСтрока.Количество = 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				ВычестьИзТекЯчейки = Мин(ТекСтрока.Количество,ТекЗаказ.Количество);
				
				ТекСтрока.Количество = ТекСтрока.Количество - ВычестьИзТекЯчейки ;
				ТекЗаказ.Количество = ТекЗаказ.Количество - ВычестьИзТекЯчейки;
				
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.ЗаказПокупателя = ТекСтрока.ЗаказПокупателя; //ТекЗаказ.ЗаказПокупателя;
				НоваяСтрока.Номенклатура 	= ТекСтрока.Номенклатура;
				НоваяСтрока.Склад		 	= ТекЗаказ.Склад;
				НоваяСтрока.Ячейка		 	= ТекЗаказ.Ячейка;
				НоваяСтрока.Количество		= ВычестьИзТекЯчейки;
				
			КонецЦикла;	
			
		КонецЦикла;			
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СборкаЗаказовПокупателя") Тогда
		
		СборкаЗаказовПокупателя = ДанныеЗаполнения;
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
		Грузополучатель = ДанныеЗаполнения.Грузополучатель;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Дата = ТекущаяДата();
		
		Если ДанныеЗаполнения.Проведен Тогда       
			
			//+Шульман А. 10.10.2025 #UT10-5452  
			//+Шульман А. 24.10.2025 #UT10-5483 
			Если ДанныеЗаполнения.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Или ДанныеЗаполнения.УпаковыватьСамовывоз Тогда
			//-Шульман А. 24.10.2025 #UT10-5483 
				#Если Клиент Тогда            
					
					СтандартнаяОбработка = Ложь;                        
					ДополнительныеСвойства.Вставить("НеОткрывать", Истина);
					ОтобратьТоварыИСоздатьЗапросыНаИзменениеКоличества(ДанныеЗаполнения);  
					
				#Иначе
					ЗаполнитьТоварыПоЯчейкам(ДанныеЗаполнения);				
				#КонецЕсли
			//-Шульман А. 10.10.2025 #UT10-5452
				
			Иначе       
				ЗаполнитьТоварыПоЯчейкам(ДанныеЗаполнения);				
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтобратьТоварыИСоздатьЗапросыНаИзменениеКоличества(ДокументСборка)
	
	//+Шульман А. 10.10.2025 #UT10-5452
	ФормаВыбораТоваровДляЗапросов = ЭтотОбъект.ПолучитьФорму("ФормаВыбораТоваровДляЗапросов", ЭтотОбъект);
	ФормаВыбораТоваровДляЗапросов.ДокументСборка = ДокументСборка; 
	ФормаВыбораТоваровДляЗапросов.ОткрытьМодально();
	//-Шульман А. 10.10.2025 #UT10-5452

КонецПроцедуры

Функция ПроверитьКорректностьЗаполненияДокумента()
	
	СтруктураВозврата = Новый Структура;
	
	Отказ = Ложь;
	
	Если Товары.Количество()= 0 Тогда 
		
		Сообщить("Не заполнена табличная часть товары для выполнения корректировки!");
		Возврат СтруктураВозврата.Вставить("Отказ", Истина);
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Организация = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Организация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияОрганизации,
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Контрагент = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Контрагент
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияКонтрагента,
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Грузополучатель = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Грузополучатель
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияГрузополучателя
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателя.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейках.Склад,
	|	ТоварыВЯчейках.Номенклатура,
	|	ТоварыВЯчейках.Ячейка,
	|	СУММА(ТоварыВЯчейках.Количество) КАК Количество
	|ПОМЕСТИТЬ ДвиженияТоварыВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|ГДЕ
	|	ТоварыВЯчейках.Регистратор = &Сборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейках.Склад,
	|	ТоварыВЯчейках.Номенклатура,
	|	ТоварыВЯчейках.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыГотовыеКСборке.Номенклатура,
	|	СУММА(ТоварыГотовыеКСборке.Количество) КАК Количество,
	|	ТоварыГотовыеКСборке.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ДвиженияТоварыГотовыеКСборке
	|ИЗ
	|	РегистрНакопления.ТоварыГотовыеКСборке КАК ТоварыГотовыеКСборке
	|ГДЕ
	|	ТоварыГотовыеКСборке.Регистратор = &Сборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыГотовыеКСборке.Номенклатура,
	|	ТоварыГотовыеКСборке.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаСборкиЗаказовПокупателя.Ссылка
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя = &Сборка
	|	И КорректировкаСборкиЗаказовПокупателя.Ссылка <> &Ссылка
	|	И КорректировкаСборкиЗаказовПокупателя.Ссылка.Проведен
	|	И КорректировкаСборкиЗаказовПокупателя.Дата <= &ДатаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокумента.Ссылка.СборкаЗаказовПокупателя КАК Ссылка,
	|	&Контрагент КАК Контрагент,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Ячейка,
	|	ТабДокумента.Склад,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Количество,
	|	ТабДокумента.Причина
	|ПОМЕСТИТЬ ТабДокумента
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК ТабДокумента
	|ГДЕ
	|	ТабДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Склад КАК Склад,
	|	Таб.Номенклатура КАК Номенклатура,
	|	Таб.Ячейка КАК Ячейка,
	|	СУММА(Таб.Количество) КАК Количество,
	|	СУММА(Таб.КоличествоВДокументе) КАК КоличествоВДокументе
	|ПОМЕСТИТЬ ТабРезультата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыВЯчейках.Склад КАК Склад,
	|		ТоварыВЯчейках.Номенклатура КАК Номенклатура,
	|		ТоварыВЯчейках.Ячейка КАК Ячейка,
	|		-ТоварыВЯчейках.Количество КАК Количество,
	|		0 КАК КоличествоВДокументе
	|	ИЗ
	|		РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО ТоварыВЯчейках.Регистратор = Корректировки.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияТоварыВЯчейках.Склад,
	|		ДвиженияТоварыВЯчейках.Номенклатура,
	|		ДвиженияТоварыВЯчейках.Ячейка,
	|		ДвиженияТоварыВЯчейках.Количество,
	|		0
	|	ИЗ
	|		ДвиженияТоварыВЯчейках КАК ДвиженияТоварыВЯчейках
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабТовары.Склад,
	|		ТабТовары.Номенклатура,
	|		ТабТовары.Ячейка,
	|		0,
	|		ТабТовары.Количество
	|	ИЗ
	|		ТабДокумента КАК ТабТовары) КАК Таб
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Склад,
	|	Таб.Номенклатура,
	|	Таб.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб2.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Таб2.Номенклатура КАК Номенклатура,
	|	СУММА(Таб2.Количество) КАК Количество,
	|	СУММА(Таб2.КоличествоВДокументе) КАК КоличествоВДокументе,
	|	СУММА(Таб2.КоличествоСДокументом) КАК КоличествоСДокументом
	|ПОМЕСТИТЬ ТабРезультатаТоварыКсборке
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыГотовыеКСборке.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ТоварыГотовыеКСборке.Номенклатура КАК Номенклатура,
	|		-ТоварыГотовыеКСборке.Количество КАК Количество,
	|		0 КАК КоличествоВДокументе,
	|		-ТоварыГотовыеКСборке.Количество КАК КоличествоСДокументом
	|	ИЗ
	|		РегистрНакопления.ТоварыГотовыеКСборке КАК ТоварыГотовыеКСборке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО ТоварыГотовыеКСборке.Регистратор = Корректировки.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияТоварыГотовыеКСборке.ЗаказПокупателя,
	|		ДвиженияТоварыГотовыеКСборке.Номенклатура,
	|		ДвиженияТоварыГотовыеКСборке.Количество,
	|		0,
	|		ДвиженияТоварыГотовыеКСборке.Количество
	|	ИЗ
	|		ДвиженияТоварыГотовыеКСборке КАК ДвиженияТоварыГотовыеКСборке
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабТовары.ЗаказПокупателя,
	|		ТабТовары.Номенклатура,
	|		0,
	|		ТабТовары.Количество,
	|		-ТабТовары.Количество
	|	ИЗ
	|		ТабДокумента КАК ТабТовары) КАК Таб2
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб2.ЗаказПокупателя,
	|	Таб2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультата.Склад,
	|	ТабРезультата.Номенклатура,
	|	ТабРезультата.Ячейка,
	|	ТабРезультата.Количество,
	|	ТабРезультата.КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ТабРезультата.Количество - ТабРезультата.КоличествоВДокументе < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиПревышенияКоличества
	|ИЗ
	|	ТабРезультата КАК ТабРезультата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияТоварыВЯчейках КАК ДвиженияТоварыВЯчейках
	|		ПО ТабРезультата.Склад = ДвиженияТоварыВЯчейках.Склад
	|			И ТабРезультата.Ячейка = ДвиженияТоварыВЯчейках.Ячейка
	|			И ТабРезультата.Номенклатура = ДвиженияТоварыВЯчейках.Номенклатура
	|ГДЕ
	|	ТабРезультата.Количество - ТабРезультата.КоличествоВДокументе < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультатаТоварыКсборке.ЗаказПокупателя,
	|	ТабРезультатаТоварыКсборке.Номенклатура,
	|	ТабРезультатаТоварыКсборке.Количество,
	|	ТабРезультатаТоварыКсборке.КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ТабРезультатаТоварыКсборке.Количество - ТабРезультатаТоварыКсборке.КоличествоВДокументе < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиПревышенияКоличества
	|ИЗ
	|	ТабРезультатаТоварыКсборке КАК ТабРезультатаТоварыКсборке
	|ГДЕ
	|	ТабРезультатаТоварыКсборке.Количество - ТабРезультатаТоварыКсборке.КоличествоВДокументе < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультатаТоварыКсборке.ЗаказПокупателя,
	|	ТабРезультатаТоварыКсборке.Номенклатура,
	|	ТабРезультатаТоварыКсборке.КоличествоСДокументом
	|ИЗ
	|	ТабРезультатаТоварыКсборке КАК ТабРезультатаТоварыКсборке
	|ГДЕ
	|	ТабРезультатаТоварыКсборке.КоличествоСДокументом > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокумента.Ссылка,
	|	ТабДокумента.Контрагент,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Причина,
	|	СУММА(ТабДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабДокументаГруппа
	|ИЗ
	|	ТабДокумента КАК ТабДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДокумента.Ссылка,
	|	ТабДокумента.Контрагент,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Причина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	МИНИМУМ(ЗаказПокупателяТовары.Цена) КАК Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	(ЗаказПокупателяТовары.Ссылка, ЗаказПокупателяТовары.Номенклатура) В
	|			(ВЫБРАТЬ
	|				ТабДокумента.ЗаказПокупателя,
	|				ТабДокумента.Номенклатура
	|			ИЗ
	|				ТабДокумента КАК ТабДокумента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокументаГруппа.Ссылка,
	|	ТабДокументаГруппа.Контрагент,
	|	ТабДокументаГруппа.ЗаказПокупателя,
	|	ТабДокументаГруппа.Номенклатура,
	|	ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Количество,
	|	ТабДокументаГруппа.Количество КАК КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) - ТабДокументаГруппа.Количество < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиПревышенияКоличества,
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ТабДокументаГруппа.Количество КАК Сумма,
	|	ТабДокументаГруппа.Причина
	|ИЗ
	|	ТабДокументаГруппа КАК ТабДокументаГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				&ДатаОстатков,
	|				(Сборка, Контрагент, ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТабДокумента.Ссылка,
	|						ТабДокумента.Контрагент,
	|						ТабДокумента.ЗаказПокупателя,
	|						ТабДокумента.Номенклатура
	|					ИЗ
	|						ТабДокумента КАК ТабДокумента)) КАК ТоварыВСборкеОстатки
	|		ПО ТабДокументаГруппа.Ссылка = ТоварыВСборкеОстатки.Сборка
	|			И ТабДокументаГруппа.Контрагент = ТоварыВСборкеОстатки.Контрагент
	|			И ТабДокументаГруппа.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
	|			И ТабДокументаГруппа.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ТабДокументаГруппа.ЗаказПокупателя = ЦеныНоменклатуры.ЗаказПокупателя
	|			И ТабДокументаГруппа.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|ГДЕ
	|	ТабДокументаГруппа.Количество > 0";

	Запрос.УстановитьПараметр("Сборка", СборкаЗаказовПокупателя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата()); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ОшибкиШапки = МассивРезультатов[0].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ОшибкиШапки Цикл 
		
		Если СтрокаТаблицы.ЕстьОшибкиЗаполненияОрганизации Тогда 
			
			Отказ = Истина;
			Сообщить("Организация в документе корректировки не соответствует организации в документе сборки!");
			
		КонецЕсли;
		
		Если СтрокаТаблицы.ЕстьОшибкиЗаполненияКонтрагента Тогда 
			
			Отказ = Истина;
			Сообщить("Контрагент в документе корректировки не соответствует контрагенту в документе сборки!");
			
		КонецЕсли;
		
		Если СтрокаТаблицы.ЕстьОшибкиЗаполненияГрузополучателя Тогда 
			
			Отказ = Истина;
			Сообщить("Грузополучатель в документе корректировки не соответствует грузополучателю в документе сборки!");
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ТаблицаОшибокКоличестваПоЯчейкам = МассивРезультатов[7].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибокКоличестваПоЯчейкам Цикл 
		
		Если СтрокаТаблицы.ЕстьОшибкиПревышенияКоличества Тогда 
			
			Отказ = Истина;
			Сообщить("Для номенклатуры " + СтрокаТаблицы.Номенклатура + " по складу " + СтрокаТаблицы.Склад + 
			" по ячейке " + СтрокаТаблицы.Ячейка + " превышено допустимое количество корректировки " + Символы.ПС + "(Попытка откорректировать: " + СтрокаТаблицы.КоличествоВДокументе + 
			" ед., возможно откорректировать: " + СтрокаТаблицы.Количество + " ед.)!");
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	ТаблицаОшибокКоличестваПоСборкам = МассивРезультатов[8].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибокКоличестваПоСборкам Цикл 
		
		Если СтрокаТаблицы.ЕстьОшибкиПревышенияКоличества Тогда 
			
			Отказ = Истина;
			Сообщить("Для номенклатуры " + СтрокаТаблицы.Номенклатура + " по заказу " + СтрокаТаблицы.ЗаказПокупателя + 
			" превышено допустимое количество корректировки " + Символы.ПС + "(Попытка откорректировать: " + СтрокаТаблицы.КоличествоВДокументе + 
			" ед., возможно откорректировать: " + СтрокаТаблицы.Количество + " ед.)!");
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	ТаблицаОшибокТоварыВСборке = МассивРезультатов[12].Выгрузить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаОшибокТоварыВСборке Цикл 
		
		Если СтрокаТаблицы.ЕстьОшибкиПревышенияКоличества Тогда 
			
			Отказ = Истина;
			Сообщить("Для номенклатуры " + СтрокаТаблицы.Номенклатура + " по заказу " + СтрокаТаблицы.ЗаказПокупателя + Символы.ПС + 
			"по сборке " + СтрокаТаблицы.Ссылка + 
			" превышено допустимое количество корректировки по регистру Товары В Сборке :" + Символы.ПС + "(Попытка откорректировать: " + СтрокаТаблицы.КоличествоВДокументе + 
			" ед., возможно откорректировать: " + СтрокаТаблицы.Количество + " ед.)!");
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	СоздаватьДвиженияПоРегиструНоменклатураГотоваяЕхатьККлиенту = Ложь;

	СтруктураВозврата.Вставить("Отказ", Отказ);
	СтруктураВозврата.Вставить("СоздаватьДвиженияПоРегиструНоменклатураГотоваяЕхатьККлиенту", СоздаватьДвиженияПоРегиструНоменклатураГотоваяЕхатьККлиенту);
	СтруктураВозврата.Вставить("ТаблицаТоварыВСборке", ТаблицаОшибокТоварыВСборке);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ПроверитьКорректностьЗаполненияКодовМаркировки(Отказ)

	//+Шульман А. 24.09.2025 #UT10-5433  
	Если КодыМаркировки.Количество() = 0  Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзКодыМаркировки.КодМаркировки КАК Справочник.ШтрихкодыНоменклатуры) КАК ШтрихкодНоменклатуры
		|ПОМЕСТИТЬ ВТ_КодыДокумента
		|ИЗ
		|	&тзКодыМаркировки КАК тзКодыМаркировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КодыДокумента.ШтрихкодНоменклатуры КАК ШтрихкодНоменклатуры,
		|	ВТ_КодыДокумента.ШтрихкодНоменклатуры.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ДвижениеКодовСборка.Регистратор, ЗНАЧЕНИЕ(Документ.СборкаЗаказовПокупателя.ПустаяСсылка)) КАК Сборка,
		|	ЕСТЬNULL(ДвижениеКодовКорректировкаСборки.Регистратор, ЗНАЧЕНИЕ(Документ.КорректировкаСборкиЗаказовПокупателя.ПустаяСсылка)) КАК КорректировкаСборки
		|ИЗ
		|	ВТ_КодыДокумента КАК ВТ_КодыДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеКодовМаркировкиСУЗ КАК ДвижениеКодовСборка
		|		ПО ВТ_КодыДокумента.ШтрихкодНоменклатуры = ДвижениеКодовСборка.ШтрихкодНоменклатуры
		|			И (ДвижениеКодовСборка.Основание = &Сборка)
		|			И (ДвижениеКодовСборка.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДвижениеКодовМаркировкиСУЗ КАК ДвижениеКодовКорректировкаСборки
		|		ПО ВТ_КодыДокумента.ШтрихкодНоменклатуры = ДвижениеКодовКорректировкаСборки.ШтрихкодНоменклатуры
		|			И (ДвижениеКодовКорректировкаСборки.Основание = &Сборка)
		|			И (НЕ ДвижениеКодовКорректировкаСборки.Регистратор = &Ссылка)
		|			И (ДвижениеКодовКорректировкаСборки.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя)
		|ГДЕ
		|	ДвижениеКодовСборка.Основание = &Сборка
		|	И НЕ ДвижениеКодовСборка.Регистратор = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(Сборка),
		|	МАКСИМУМ(КорректировкаСборки)
		|ПО
		|	ШтрихкодНоменклатуры";
	
	Запрос.УстановитьПараметр("ДокументСобранИУпакован", СборкаЗаказовПокупателя.ДокументСобранИУпакован);
	Запрос.УстановитьПараметр("Сборка", СборкаЗаказовПокупателя);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("тзКодыМаркировки", КодыМаркировки.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаШК = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШК.Следующий() Цикл    
		
		Выборка = ВыборкаШК.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Если Не ЗначениеЗаполнено(Выборка.Сборка) Тогда
			
				Отказ = Истина;
				Сообщить("Для номенклатуры " + Выборка.Номенклатура + " код маркировки " 
				+ Выборка.ШтрихкодНоменклатуры.КодМаркировки + " не собран/не находится на сборке");
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.КорректировкаСборки) Тогда
			
				Отказ = Истина;
				Сообщить("Для номенклатуры " + Выборка.Номенклатура + " код маркировки " 
				+ Выборка.ШтрихкодНоменклатуры.КодМаркировки + " уже есть в " + Выборка.КорректировкаСборки);
				
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЦикла;
	//-Шульман А. 24.09.2025 #UT10-5433

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	СтруктураОтвета = ПроверитьКорректностьЗаполненияДокумента();
	
	Если СтруктураОтвета.Отказ Тогда 
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;	
	
	//+Шульман А. 24.09.2025 #UT10-5433
	ПроверитьКорректностьЗаполненияКодовМаркировки(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//-Шульман А. 24.09.2025 #UT10-5433
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	Движения.ТоварыГотовыеКСборке.Записывать = Истина;
	Движения.НоменклатураГотоваяЕхатьККлиенту.Записывать = Истина;
	Движения.СобраноПоЗаказу.Записывать = Истина;
	Движения.ТоварыВСборке.Записывать = Истина;   
	//+Шульман А. 24.09.2025 #UT10-5433    
	Движения.ДвижениеКодовМаркировкиСУЗ.Записывать = Истина;
	//-Шульман А. 24.09.2025 #UT10-5433
	
	//ТоварыВЯчейках
	ПроводитьПоЯчейкам = Ложь;
	
	Если Дата < Константы.ДатаНачалаПроведенияКорректировкиСборкиПоРегиструТоварыВЯчейкахСУчетомИсполнено.Получить() Тогда 
		ПроводитьПоЯчейкам = Истина;
	Иначе
		ПроводитьПоЯчейкам = Исполнено;
	КонецЕсли;
	
	Если ПроводитьПоЯчейкам Тогда 
		
		Движения.ТоварыВЯчейках.Записывать = Истина;
		
		ТЧТовары = Товары.Выгрузить(,"Номенклатура,Склад,Ячейка,ПроблемнаяЯчейка,Количество");
		ТЧТовары.Свернуть("Номенклатура,Склад,ПроблемнаяЯчейка,Ячейка","Количество");
		
		Для каждого ТекСтр Из ТЧТовары Цикл
			
			Если ТекСтр.Количество > 0 Тогда 
				
				Движение 				= Движения.ТоварыВЯчейках.Добавить();
				Движение.Период 		= Дата;
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
				Движение.Номенклатура 	= ТекСтр.Номенклатура ;
				Движение.Склад 			= ТекСтр.Склад;
				Движение.Ячейка 		= ТекСтр.Ячейка ;
				Движение.Количество 	= ТекСтр.Количество;
				Движение.ПроблемнаяЯчейка = ТекСтр.ПроблемнаяЯчейка;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	//ТоварыГотовыеКСборке
	ТЧТоварыПоЗакказу = Товары.Выгрузить(, "Номенклатура,ЗаказПокупателя,Количество");
	ТЧТоварыПоЗакказу.Свернуть("Номенклатура,ЗаказПокупателя", "Количество");
	
	Для каждого ТекСтр Из ТЧТоварыПоЗакказу Цикл
		
		Если ТекСтр.Количество > 0 Тогда 
			
			Движение 				= Движения.ТоварыГотовыеКСборке.Добавить();
			Движение.Период 		= Дата;
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
			Движение.Номенклатура 	= ТекСтр.Номенклатура ;
			Движение.ЗаказПокупателя= ТекСтр.ЗаказПокупателя;
			Движение.Количество 	= ТекСтр.Количество; 
			Движение.Назначение 	= СборкаЗаказовПокупателя.Назначение;
			
			ДвижениеСобрано 				= Движения.СобраноПоЗаказу.Добавить();
			ДвижениеСобрано.Регистратор		= Ссылка;
			ДвижениеСобрано.Период 			= Дата;
			ДвижениеСобрано.Заказ 			= ТекСтр.ЗаказПокупателя;
			ДвижениеСобрано.Номенклатура 	= ТекСтр.Номенклатура;
			ДвижениеСобрано.Количество 		= -ТекСтр.Количество;   
			
		КонецЕсли;
		
	КонецЦикла; 
	
	
	//НоменклатураГотоваяЕхатьККлиенту
	// Если ВСЕ позиции по ЗаказуПокупателя откорректированы, то необходимо сделать движение по регистру
	СоздаватьДвижения = Неопределено;
	
	Если СтруктураОтвета.Свойство("СоздаватьДвиженияПоРегиструНоменклатураГотоваяЕхатьККлиенту", СоздаватьДвижения) И СборкаЗаказовПокупателя.ДокументСобранИУпакован Тогда 
		
		Если СоздаватьДвижения Тогда 
			
			Движение 							= Движения.НоменклатураГотоваяЕхатьККлиенту.Добавить();
			Движение.Период 					= Дата;
			Движение.ВидДвижения 				= ВидДвиженияНакопления.Расход;
			Движение.ДокументСборкиНоменклатуры = СборкаЗаказовПокупателя;
			Движение.Организация 				= Организация;
			Движение.Количество 				= 1;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	
	//ТоварыВСборке
	ТаблицаТоварыВСборке = Неопределено;
	
	Если СтруктураОтвета.Свойство("ТаблицаТоварыВСборке", ТаблицаТоварыВСборке) И ТаблицаТоварыВСборке.Количество() <> 0 Тогда
		
		//+Шульман А. 24.09.2025 #UT10-5433
		ДокументСобранИУпакован = СборкаЗаказовПокупателя.ДокументСобранИУпакован;
		//-Шульман А. 24.09.2025 #UT10-5433
		
		Для Каждого ТекСтр Из ТаблицаТоварыВСборке Цикл
			
			ДвижениеТоварыВСборке 					= Движения.ТоварыВСборке.Добавить();
			ДвижениеТоварыВСборке.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			ДвижениеТоварыВСборке.Период 			= Дата;
			ДвижениеТоварыВСборке.Регистратор 		= Ссылка;
			ДвижениеТоварыВСборке.Сборка		 	= СборкаЗаказовПокупателя;
			ДвижениеТоварыВСборке.Контрагент 		= ТекСтр.Контрагент;
			ДвижениеТоварыВСборке.ЗаказПокупателя 	= ТекСтр.ЗаказПокупателя;
			ДвижениеТоварыВСборке.Номенклатура 		= ТекСтр.Номенклатура;
			ДвижениеТоварыВСборке.Причина 			= ТекСтр.Причина;  
			ДвижениеТоварыВСборке.Назначение 		= СборкаЗаказовПокупателя.Назначение; 
			
			Если Дата > Константы.ДатаНачалаПроведенияКСборкеПоНовомуАлгоритму.Получить() Тогда	 
				
				Если ОткорректированНеСобранным Тогда 
					
					ДвижениеТоварыВСборке.КСборке	 		= ТекСтр.КоличествоВДокументе;
					ДвижениеТоварыВСборке.СуммаКСборке		= ТекСтр.Сумма;
					
				Иначе
					
					ДвижениеТоварыВСборке.Собрано	 		= ТекСтр.КоличествоВДокументе;
					ДвижениеТоварыВСборке.СуммаСобрано		= ТекСтр.Сумма;
					
				КонецЕсли;
				
			Иначе
				
				Если ДокументСобранИУпакован Тогда 
					
					ДвижениеТоварыВСборке.Собрано	 		= ТекСтр.КоличествоВДокументе;
					ДвижениеТоварыВСборке.СуммаСобрано		= ТекСтр.Сумма;
					
				Иначе
					
					ДвижениеТоварыВСборке.КСборке	 		= ТекСтр.КоличествоВДокументе;
					ДвижениеТоварыВСборке.СуммаКСборке		= ТекСтр.Сумма;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;     
		
		//+Шульман А. 24.09.2025 #UT10-5433
		Для каждого тзСтрока Из КодыМаркировки Цикл
			
			ДвижениеКМ 					= Движения.ДвижениеКодовМаркировкиСУЗ.Добавить();
			ДвижениеКМ.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			ДвижениеКМ.Период 			= Дата;
			ДвижениеКМ.Регистратор 		= Ссылка;                       
			ДвижениеКМ.Склад            = СборкаЗаказовПокупателя;
			ДвижениеКМ.ШтрихкодНоменклатуры = тзСтрока.КодМаркировки;
			ДвижениеКМ.Основание        = СборкаЗаказовПокупателя;     
			
			Если ДокументСобранИУпакован Тогда 
				ДвижениеКМ.Собрано = -1;
			Иначе
				ДвижениеКМ.КСборке = -1;
			КонецЕсли;
		
		КонецЦикла;
		//-Шульман А. 24.09.2025 #UT10-5433
		
	КонецЕсли;
	
	//Грузовые места помечаем на удаление, если все скорректированные позиции составляют целые грузовые места
	Если Исполнено Тогда 
		
		ТаблицаТоварыВСборке.Свернуть("ЗаказПокупателя,Номенклатура", "КоличествоВДокументе,Количество"); 
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТаблицаТоваровВСборке", ТаблицаТоварыВСборке);
		Запрос.УстановитьПараметр("Сборка", СборкаЗаказовПокупателя);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТоваровВСборке.ЗаказПокупателя,
		|	ТаблицаТоваровВСборке.Номенклатура,
		|	ТаблицаТоваровВСборке.КоличествоВДокументе КАК КоличествоКорректируем,
		|	ТаблицаТоваровВСборке.Количество КАК Количество
		|ПОМЕСТИТЬ ТаблицаТоваровВСборке
		|ИЗ
		|	&ТаблицаТоваровВСборке КАК ТаблицаТоваровВСборке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Ссылка,
		|	ГрузовоеМестоТовары.Заказ,
		|	ГрузовоеМестоТовары.Номенклатура,
		|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоВГрузовомМесте
		|ПОМЕСТИТЬ ГрузовыеМеста
		|ИЗ
		|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Сборка = &Сборка
		|	И ГрузовоеМестоТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ВЫБОР
		|			КОГДА ГрузовоеМестоТовары.Ссылка.Сборка.УпаковыватьСамовывоз
		|				ТОГДА ГрузовоеМестоТовары.Ссылка.РеализацияСамовывоза = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрузовоеМестоТовары.Заказ,
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовыеМеста.Ссылка КАК ГрузовоеМесто,
		|	ГрузовыеМеста.Заказ КАК Заказ,
		|	ГрузовыеМеста.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ГрузовыеМеста.КоличествоВГрузовомМесте, 0) КАК Упаковано,
		|	ЕСТЬNULL(ТаблицаТоваровВСборке.КоличествоКорректируем, 0) КАК Корректируем,
		|	ЕСТЬNULL(ТаблицаТоваровВСборке.Количество, 0) КАК Всего,
		|	ЕСТЬNULL(ТаблицаТоваровВСборке.Количество, 0) - ЕСТЬNULL(ГрузовыеМеста.КоличествоВГрузовомМесте, 0) КАК Неупаковано,
		|	ЕСТЬNULL(ТаблицаТоваровВСборке.КоличествоКорректируем, 0) - (ЕСТЬNULL(ТаблицаТоваровВСборке.Количество, 0) - ЕСТЬNULL(ГрузовыеМеста.КоличествоВГрузовомМесте, 0)) КАК КорректировкаГМ
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ГрузовыеМеста КАК ГрузовыеМеста
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаТоваровВСборке КАК ТаблицаТоваровВСборке
		|		ПО ГрузовыеМеста.Заказ = ТаблицаТоваровВСборке.ЗаказПокупателя
		|			И ГрузовыеМеста.Номенклатура = ТаблицаТоваровВСборке.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.ГрузовоеМесто КАК ГрузовоеМесто,
		|	ИтоговаяТаблица.Заказ КАК Заказ,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.КорректировкаГМ КАК КорректировкаГМ
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ИтоговаяТаблица.Корректируем > 0
		|	И ИтоговаяТаблица.КорректировкаГМ > 0
		|ИТОГИ
		|	СУММА(КорректировкаГМ)
		|ПО
		|	ГрузовоеМесто,
		|	Заказ,
		|	Номенклатура";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаПоГМ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоГМ.Следующий() Цикл
				
				ГрузоместоОбъект = ВыборкаПоГМ.ГрузовоеМесто.ПолучитьОбъект();
				
				КоличествоПослеКорректировки = ГрузоместоОбъект.Товары.Итог("Количество");

				ВыборкаПоЗаказам = ВыборкаПоГМ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоЗаказам.Следующий() Цикл					
					
					ВыборкаПоНом = ВыборкаПоЗаказам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаПоНом.Следующий() Цикл
						
						ЕстьСтрокаВТаблицеКорректировки = ТаблицаТоварыВСборке.НайтиСтроки(Новый Структура("Номенклатура,ЗаказПокупателя", ВыборкаПоНом.Номенклатура, ВыборкаПоНом.Заказ));
						
						Если ЕстьСтрокаВТаблицеКорректировки[0].КоличествоВДокументе = 0 Тогда 
							Продолжить;
						КонецЕсли;
						
						ЕстьСтрокаВТабличнойЧасти = ГрузоместоОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,Заказ", ВыборкаПоНом.Номенклатура, ВыборкаПоНом.Заказ));
						
						Если НЕ ЕстьСтрокаВТабличнойЧасти.Количество() = 0 Тогда 
							
							ПромСтрока = ЕстьСтрокаВТабличнойЧасти[0];
							КоличествоПослеКорректировки = КоличествоПослеКорректировки - ВыборкаПоНом.КорректировкаГМ;
							
						КонецЕсли;
						
						ЕстьСтрокаВТаблицеКорректировки[0].КоличествоВДокументе = ЕстьСтрокаВТаблицеКорректировки[0].КоличествоВДокументе - ВыборкаПоНом.КорректировкаГМ;
						
					КонецЦикла; 
					
				КонецЦикла; 
				
				Если КоличествоПослеКорректировки > 0 Тогда  
					
					// Проверить другие корректировки  
					ТаблицаТоварыПрочихКорректировокСборок = ПолучитьТаблицуТоваровПрочихКорректировокСборок(); 
					
					Для Каждого ТекСтрока Из ТаблицаТоварыПрочихКорректировокСборок Цикл  
						
						МассивНайденных = ГрузоместоОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура, Заказ", ТекСтрока.Номенклатура, ТекСтрока.ЗаказПокупателя));
						
						Если МассивНайденных.Количество() > 0 Тогда 
							КоличествоПослеКорректировки = КоличествоПослеКорректировки - Мин(МассивНайденных[0].Количество, ТекСтрока.КоличествоВДокументе);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Попытка

					Если КоличествоПослеКорректировки = 0 Тогда

						ГрузоместоОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);						
						ГрузоместоОбъект.ПометкаУдаления = Истина;
						ГрузоместоОбъект.Неактуально_КорректировкаСборки = Истина;
						ГрузоместоОбъект.КорректировкаСборки = Ссылка;
						ГрузоместоОбъект.Записать(РежимЗаписиДокумента.Запись);
						
					Иначе
						ГрузоместоОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
					
				Исключение
					
					#Если Клиент Тогда
						Сообщить(ОписаниеОшибки());
					#КонецЕсли
					
					//+Гавриленков В. 07.11.2025 #UT10-5497
					ЗаписьЖурналаРегистрации("Проведение Корректировки сборки заказов покупателя", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.КорректировкаСборкиЗаказовПокупателя,, "Грузовое место " + Строка(ГрузоместоОбъект.Номер) + " не помечен на удаление: " + ОписаниеОшибки());
					//-Гавриленков В. 07.11.2025 #UT10-5497
					
				КонецПопытки;   			
				
			КонецЦикла;			
			
		КонецЕсли;

	КонецЕсли;
	
	ТаблицаТоваров = Товары.Выгрузить();
	ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
	
	#Если Клиент Тогда
		Оповестить("ВведенаКорректировка", ТаблицаТоваров);
	#КонецЕсли
	
	Если Не Отказ И Константы.AMQP_ВыгружатьДанные.Получить() И СборкаЗаказовПокупателя.Договор.ВыгружаетсяВБиллинг Тогда
		Рез = AMQP_РаботаСДокументами.ОтправитьДокументКорректировкиВБиллинг(Ссылка);
	КонецЕсли;

КонецПроцедуры   

Функция ПолучитьТаблицуТоваровПрочихКорректировокСборок()  

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Организация = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Организация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияОрганизации,
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Контрагент = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Контрагент
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияКонтрагента,
	|	ВЫБОР
	|		КОГДА КорректировкаСборкиЗаказовПокупателя.Грузополучатель = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя.Грузополучатель
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьОшибкиЗаполненияГрузополучателя,
	|	КорректировкаСборкиЗаказовПокупателя.Ссылка
	|ПОМЕСТИТЬ ВТ_КорректировкиСборок
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя = &Сборка
	|	И КорректировкаСборкиЗаказовПокупателя.Ссылка <> &Ссылка
	|	И КорректировкаСборкиЗаказовПокупателя.Проведен = ИСТИНА
	|	И КорректировкаСборкиЗаказовПокупателя.Исполнено = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейках.Склад,
	|	ТоварыВЯчейках.Номенклатура,
	|	ТоварыВЯчейках.Ячейка,
	|	СУММА(ТоварыВЯчейках.Количество) КАК Количество
	|ПОМЕСТИТЬ ДвиженияТоварыВЯчейках
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|ГДЕ
	|	ТоварыВЯчейках.Регистратор = &Сборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейках.Склад,
	|	ТоварыВЯчейках.Номенклатура,
	|	ТоварыВЯчейках.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыГотовыеКСборке.Номенклатура,
	|	СУММА(ТоварыГотовыеКСборке.Количество) КАК Количество,
	|	ТоварыГотовыеКСборке.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ДвиженияТоварыГотовыеКСборке
	|ИЗ
	|	РегистрНакопления.ТоварыГотовыеКСборке КАК ТоварыГотовыеКСборке
	|ГДЕ
	|	ТоварыГотовыеКСборке.Регистратор = &Сборка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыГотовыеКСборке.Номенклатура,
	|	ТоварыГотовыеКСборке.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаСборкиЗаказовПокупателя.Ссылка
	|ПОМЕСТИТЬ Корректировки
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя = &Сборка
	|	И КорректировкаСборкиЗаказовПокупателя.Ссылка = &Ссылка
	|	И КорректировкаСборкиЗаказовПокупателя.Ссылка.Проведен
	|	И КорректировкаСборкиЗаказовПокупателя.Дата <= &ДатаОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокумента.Ссылка.СборкаЗаказовПокупателя КАК Ссылка,
	|	&Контрагент КАК Контрагент,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Ячейка,
	|	ТабДокумента.Склад,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Количество,
	|	ТабДокумента.Причина
	|ПОМЕСТИТЬ ТабДокумента
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК ТабДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировкиСборок КАК ВТ_КорректировкиСборок
	|		ПО ТабДокумента.Ссылка = ВТ_КорректировкиСборок.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Склад КАК Склад,
	|	Таб.Номенклатура КАК Номенклатура,
	|	Таб.Ячейка КАК Ячейка,
	|	СУММА(Таб.Количество) КАК Количество,
	|	СУММА(Таб.КоличествоВДокументе) КАК КоличествоВДокументе
	|ПОМЕСТИТЬ ТабРезультата
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыВЯчейках.Склад КАК Склад,
	|		ТоварыВЯчейках.Номенклатура КАК Номенклатура,
	|		ТоварыВЯчейках.Ячейка КАК Ячейка,
	|		-ТоварыВЯчейках.Количество КАК Количество,
	|		0 КАК КоличествоВДокументе
	|	ИЗ
	|		РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО ТоварыВЯчейках.Регистратор = Корректировки.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияТоварыВЯчейках.Склад,
	|		ДвиженияТоварыВЯчейках.Номенклатура,
	|		ДвиженияТоварыВЯчейках.Ячейка,
	|		ДвиженияТоварыВЯчейках.Количество,
	|		0
	|	ИЗ
	|		ДвиженияТоварыВЯчейках КАК ДвиженияТоварыВЯчейках
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабТовары.Склад,
	|		ТабТовары.Номенклатура,
	|		ТабТовары.Ячейка,
	|		0,
	|		ТабТовары.Количество
	|	ИЗ
	|		ТабДокумента КАК ТабТовары) КАК Таб
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Склад,
	|	Таб.Номенклатура,
	|	Таб.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб2.ЗаказПокупателя КАК ЗаказПокупателя,
	|	Таб2.Номенклатура КАК Номенклатура,
	|	СУММА(Таб2.Количество) КАК Количество,
	|	СУММА(Таб2.КоличествоВДокументе) КАК КоличествоВДокументе,
	|	СУММА(Таб2.КоличествоСДокументом) КАК КоличествоСДокументом
	|ПОМЕСТИТЬ ТабРезультатаТоварыКсборке
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыГотовыеКСборке.ЗаказПокупателя КАК ЗаказПокупателя,
	|		ТоварыГотовыеКСборке.Номенклатура КАК Номенклатура,
	|		-ТоварыГотовыеКСборке.Количество КАК Количество,
	|		0 КАК КоличествоВДокументе,
	|		-ТоварыГотовыеКСборке.Количество КАК КоличествоСДокументом
	|	ИЗ
	|		РегистрНакопления.ТоварыГотовыеКСборке КАК ТоварыГотовыеКСборке
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Корректировки КАК Корректировки
	|			ПО ТоварыГотовыеКСборке.Регистратор = Корректировки.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияТоварыГотовыеКСборке.ЗаказПокупателя,
	|		ДвиженияТоварыГотовыеКСборке.Номенклатура,
	|		ДвиженияТоварыГотовыеКСборке.Количество,
	|		0,
	|		ДвиженияТоварыГотовыеКСборке.Количество
	|	ИЗ
	|		ДвиженияТоварыГотовыеКСборке КАК ДвиженияТоварыГотовыеКСборке
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабТовары.ЗаказПокупателя,
	|		ТабТовары.Номенклатура,
	|		0,
	|		ТабТовары.Количество,
	|		-ТабТовары.Количество
	|	ИЗ
	|		ТабДокумента КАК ТабТовары) КАК Таб2
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб2.ЗаказПокупателя,
	|	Таб2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультата.Склад,
	|	ТабРезультата.Номенклатура,
	|	ТабРезультата.Ячейка,
	|	ТабРезультата.Количество,
	|	ТабРезультата.КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ТабРезультата.Количество - ТабРезультата.КоличествоВДокументе < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиПревышенияКоличества
	|ИЗ
	|	ТабРезультата КАК ТабРезультата
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияТоварыВЯчейках КАК ДвиженияТоварыВЯчейках
	|		ПО ТабРезультата.Склад = ДвиженияТоварыВЯчейках.Склад
	|			И ТабРезультата.Ячейка = ДвиженияТоварыВЯчейках.Ячейка
	|			И ТабРезультата.Номенклатура = ДвиженияТоварыВЯчейках.Номенклатура
	|ГДЕ
	|	ТабРезультата.Количество - ТабРезультата.КоличествоВДокументе < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультатаТоварыКсборке.ЗаказПокупателя,
	|	ТабРезультатаТоварыКсборке.Номенклатура,
	|	ТабРезультатаТоварыКсборке.Количество,
	|	ТабРезультатаТоварыКсборке.КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ТабРезультатаТоварыКсборке.Количество - ТабРезультатаТоварыКсборке.КоличествоВДокументе < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьОшибкиПревышенияКоличества
	|ИЗ
	|	ТабРезультатаТоварыКсборке КАК ТабРезультатаТоварыКсборке
	|ГДЕ
	|	ТабРезультатаТоварыКсборке.Количество - ТабРезультатаТоварыКсборке.КоличествоВДокументе < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРезультатаТоварыКсборке.ЗаказПокупателя,
	|	ТабРезультатаТоварыКсборке.Номенклатура,
	|	ТабРезультатаТоварыКсборке.КоличествоСДокументом
	|ИЗ
	|	ТабРезультатаТоварыКсборке КАК ТабРезультатаТоварыКсборке
	|ГДЕ
	|	ТабРезультатаТоварыКсборке.КоличествоСДокументом > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокумента.Ссылка,
	|	ТабДокумента.Контрагент,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Причина,
	|	СУММА(ТабДокумента.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабДокументаГруппа
	|ИЗ
	|	ТабДокумента КАК ТабДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабДокумента.Ссылка,
	|	ТабДокумента.Контрагент,
	|	ТабДокумента.ЗаказПокупателя,
	|	ТабДокумента.Номенклатура,
	|	ТабДокумента.Причина
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДокументаГруппа.ЗаказПокупателя,
	|	ТабДокументаГруппа.Номенклатура,
	|	ЕСТЬNULL(ТоварыВСборкеОбороты.СобраноРасход, 0) КАК Количество,
	|	ТабДокументаГруппа.Количество КАК КоличествоВДокументе
	|ИЗ
	|	ТабДокументаГруппа КАК ТабДокументаГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Обороты(
	|				,
	|				&ДатаОстатков,
	|				Регистратор,
	|				(Сборка, Контрагент, ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТабДокумента.Ссылка,
	|						ТабДокумента.Контрагент,
	|						ТабДокумента.ЗаказПокупателя,
	|						ТабДокумента.Номенклатура
	|					ИЗ
	|						ТабДокумента КАК ТабДокумента)) КАК ТоварыВСборкеОбороты
	|		ПО ТабДокументаГруппа.Ссылка = ТоварыВСборкеОбороты.Сборка
	|			И ТабДокументаГруппа.Контрагент = ТоварыВСборкеОбороты.Контрагент
	|			И ТабДокументаГруппа.ЗаказПокупателя = ТоварыВСборкеОбороты.ЗаказПокупателя
	|			И ТабДокументаГруппа.Номенклатура = ТоварыВСборкеОбороты.Номенклатура
	|ГДЕ
	|	ТабДокументаГруппа.Количество > 0";  
	
	Запрос.УстановитьПараметр("Сборка", СборкаЗаказовПокупателя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаОстатков", ТекущаяДата());
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;  
	
	Если Не ДополнительныеСвойства.Свойство("НеПроверятьНоменклатуруНаКратность") Тогда
		
		ДатаНачалаПроверкиКратностиНоменклатуры = Константы.ДатаНачалаПроверкиКратностиНоменклатуры.Получить();
		
		Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения И 
			ЗначениеЗаполнено(ДатаНачалаПроверкиКратностиНоменклатуры) И 
			НачалоДня(ДатаНачалаПроверкиКратностиНоменклатуры) <= НачалоДня(Дата) Тогда
			
			ТаблицаТоваров = Товары.Выгрузить(,"Номенклатура,Количество");  
			ТаблицаТоваров.Очистить();
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				Если МСК.НеобходимоПроверятьКратностьВЗаказе(СтрокаТовары.ЗаказПокупателя) Тогда
					
					НоваяСтрока = ТаблицаТоваров.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
					
				КонецЕсли; 			
				
			КонецЦикла;	
			
			ТаблицаТоваров.Свернуть("Номенклатура", "Количество");
			
			Для каждого ТекСтр Из ТаблицаТоваров  Цикл
				
				Если МСК.ПроверкаНоменклатурыНаКратность(ТекСтр.Номенклатура,ТекСтр.Количество) = Ложь Тогда 
					
					Отказ = Истина;
					Сообщить("Для номенклатуры " + ТекСтр.Номенклатура + ", Ошибка в КРАТНОСТИ!");
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
		
		ТекстОтвета = МСК.ПроверкаНаСтороннийСклад(ЭтотОбъект);
		
		Если ТекстОтвета <> ""  Тогда 
			
			#Если Клиент Тогда
				Предупреждение(ТекстОтвета);
			#КонецЕсли
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Дата >= Константы.ДатаНачалаПроведенияКорректировкиСборкиПоРегиструТоварыВЯчейкахСУчетомИсполнено.Получить() Тогда 
			
			Если ПоискПричиныПоТабличнойЧастиТовары() = 0 Тогда
				Исполнено = Истина;
			Иначе
				
				Если ЗначениеЗаполнено(Ссылка) Тогда 
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	НапечатанныеДокументы.Документ,
					|	НапечатанныеДокументы.Макет,
					|	НапечатанныеДокументы.Ответственный,
					|	НапечатанныеДокументы.ДатаПечати,
					|	НапечатанныеДокументы.СинонимМакета
					|ИЗ
					|	РегистрСведений.НапечатанныеДокументы КАК НапечатанныеДокументы
					|ГДЕ
					|	НапечатанныеДокументы.Документ = &Документ
					|	И НапечатанныеДокументы.Макет = &Макет";
					
					Запрос.УстановитьПараметр("Документ", Ссылка);
					Запрос.УстановитьПараметр("Макет", "ЗаданиеНаРазбор");
					
					РезультатЗапроса = Запрос.Выполнить();
					Исполнено = НЕ РезультатЗапроса.Пустой();
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда 
		
		Если НЕ ЗначениеЗаполнено(Организация) Тогда 
			
			Отказ = Истина;
			Сообщить("Не заполнено поле 'Организация'");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда 
			
			Отказ = Истина;
			Сообщить("Не заполнено поле 'Контрагент'");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Ответственный) Тогда 
			
			Если Исполнено  Тогда 
				
				Отказ = Истина;
				Сообщить("Не заполнено поле 'Ответственный'");
				
			Иначе
				
				Если НЕ РольДоступна("РедактированиеДокументовСборки") Тогда 
					
					Отказ = Истина;
					Сообщить("Не заполнено поле 'Ответственный'");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда 
		Грузополучатель = СборкаЗаказовПокупателя.Грузополучатель;
	КонецЕсли;	
	
	Для Каждого Стр из Товары Цикл 
		
		Если НЕ ЗначениеЗаполнено(Стр.Причина) Тогда 
			
			Отказ = Истина;
			Сообщить("В строке " + Стр.НомерСтроки + " не заполнена причина корректировки!");
			
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Стр.Ячейка) Тогда 
			
			Отказ = Истина;
			Сообщить("В строке " + Стр.НомерСтроки + " не заполнена ячейка!");
			
		КонецЕсли;

	КонецЦикла;
	
	Если ЗначениеЗаполнено(СборкаЗаказовПокупателя) 
		И СборкаЗаказовПокупателя.ПолностьюОткорректирована 
		И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
		Тогда 
		
		ОбъектСборка = СборкаЗаказовПокупателя.ПолучитьОбъект();
		ОбъектСборка.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина); 
		ОбъектСборка.ПолностьюОткорректирована = Ложь;
		ОбъектСборка.Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	Если ЭтоНовый()	Тогда 
		ОткорректированНеСобранным = НЕ СборкаЗаказовПокупателя.ДокументСобранИУпакован;
	КонецЕсли;	 
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СборкаЗаказовПокупателя = "";

КонецПроцедуры

Процедура СоздатьКорректировкиЗаказа(ВыводитьСообщение = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.ЗаказПокупателя  КАК ЗаказПокупателя
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка = &ТекущийДокумент";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
		НовыйДок.Дата = ТекущаяДата() + 1;
		
		СтруктураЗаполнения = Новый Структура;
		СтруктураЗаполнения.Вставить("ДокументОснование", Выборка.ЗаказПокупателя);
		СтруктураЗаполнения.Вставить("КорректировкаСборки", Ссылка);
		СтруктураЗаполнения.Вставить("ТипЗаполнения", "ПоКорректировкеСборки");
		
		
		НовыйДок.Заполнить(СтруктураЗаполнения);
		
		Если НовыйДок.Товары.Количество()= 0 Тогда 
			
			Если ВыводитьСообщение Тогда 
				Сообщить("Для заказа " + Выборка.ЗаказПокупателя + " создание корректировки заказа не требуется.");
			КонецЕсли;
			
		Иначе

			Попытка  
				
				Если ДополнительныеСвойства.Свойство("НеПроверятьНоменклатуруНаКратность") Тогда
					НовыйДок.ДополнительныеСвойства.Вставить("НеПроверятьНоменклатуруНаКратность", Истина);
				КонецЕсли;
				
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("создана " + Строка(НовыйДок.Ссылка) + " к документу " + Строка(Выборка.ЗаказПокупателя));
				НовыйДок.СоздатьПеремещения(Ложь, Истина);

			Исключение
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при создании корректировки заказа покупателя. Проверьте и проведите документ вручную!");
				НовыйДок.ПолучитьФорму("ФормаДокумента").Открыть();  
				
				//+Гавриленков В. 07.11.2025 #UT10-5497
				ЗаписьЖурналаРегистрации("Создание Корректировки заказа", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.КорректировкаСборкиЗаказовПокупателя,, "Ошибка при создании корректировки заказа покупателя: " + ОписаниеОшибки());
				//-Гавриленков В. 07.11.2025 #UT10-5497
				
			КонецПопытки

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьКорректировкиЗаказа()

Процедура ПроверитьПолностьюОткорректирована()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.Контрагент,
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.СобраноОстаток,
	|	ТоварыВСборкеОстатки.СуммаСобраноОстаток,
	|	ТоварыВСборкеОстатки.КСборкеОстаток,
	|	ТоварыВСборкеОстатки.СуммаКСборкеОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(, Сборка = &СборкаОснование) КАК ТоварыВСборкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборке.Регистратор,
	|	ТоварыВСборке.Сборка,
	|	ТоварыВСборке.Контрагент,
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.Номенклатура,
	|	ТоварыВСборке.Собрано,
	|	ТоварыВСборке.КСборке,
	|	ТоварыВСборке.СуммаКСборке,
	|	ТоварыВСборке.Причина
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборке
	|ГДЕ
	|	ТоварыВСборке.Сборка = &СборкаОснование
	|	И НЕ ТоварыВСборке.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
	|	И ТоварыВСборке.Активность
	|	И ТоварыВСборке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)";
	
	Запрос.УстановитьПараметр("СборкаОснование", СборкаЗаказовПокупателя);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТабОстатков	= Пакет[0].Выгрузить();
	ТабКорректировок	= Пакет[1].Выгрузить();
	ПолностьОткорректирована = Ложь;
	
	Если ТабОстатков.Количество() = 0 И ТабКорректировок.Количество()= 0 Тогда
		ПолностьОткорректирована = Истина;
	КонецЕсли;	
	
	Если СборкаЗаказовПокупателя.ПолностьюОткорректирована <> ПолностьОткорректирована  Тогда 
		
		ОбъектСборка = СборкаЗаказовПокупателя.ПолучитьОбъект();
		ОбъектСборка.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина); 
		ОбъектСборка.ПолностьюОткорректирована = ПолностьОткорректирована;

		Если ОбъектСборка.Проведен Тогда
			ОбъектСборка.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектСборка.Записать(РежимЗаписиДокумента.Запись); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПолностьюОткорректирована()

Функция ПровестиИСоздатьКорректировкиЗаказа() Экспорт
	
	Попытка
		
		Записать(РежимЗаписиДокумента.Проведение);
		ПроверитьПолностьюОткорректирована();
		
		Если Дата >= Константы.ДатаНачалаПроведенияКорректировкиСборкиПоРегиструТоварыВЯчейкахСУчетомИсполнено.Получить() Тогда 
			
			Если Исполнено Тогда 
				СоздатьКорректировкиЗаказа(Истина);
			КонецЕсли;
			
		Иначе
			СоздатьКорректировкиЗаказа(Истина);
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение   
		
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		//+Гавриленков В. 07.11.2025 #UT10-5497
		ЗаписьЖурналаРегистрации("Создание Корректировки заказа", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.КорректировкаСборкиЗаказовПокупателя,, ОписаниеОшибки());
		//-Гавриленков В. 07.11.2025 #UT10-5497
			
		Возврат Ложь; 
		
	КонецПопытки;
	
КонецФункции 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если РольДоступна("РедактированиеДокументовСборки") И Не Исполнено Тогда 
	//	МассивНепроверяемыхРеквизитов = Новый Массив;
	//	МассивНепроверяемыхРеквизитов.Добавить("Ответственный");
	//	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	//КонецЕсли;
	
КонецПроцедуры

#Если Клиент Тогда
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НеВыводитьДиалогВыбораОтветственного = Ложь, _Ответственный = Неопределено) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		Если ИмяМакета = "Ячейки" Тогда
			ТабДокумент = ПечатьПоЯчейкам();
		ИначеЕсли ИмяМакета = "ЗаданиеНаРазбор" Тогда
			
			Если НеВыводитьДиалогВыбораОтветственного Тогда
				
				ТабДокумент = ПечатьЗаданияНаРазбор(КоличествоЭкземпляров);
				
				Если Константы.ОбъединятьСборкиПриПечати.Получить() Тогда
					КоличествоЭкземпляров = 1;
				КонецЕсли;

			Иначе
				
				ВыбОтветственный = Ответственный;

				Если ЗначениеЗаполнено(_Ответственный) Тогда
					
					Если _Ответственный <> Ответственный Тогда
						Ответственный = _Ответственный;
					КонецЕсли;

					ТабДокумент = ПечатьЗаданияНаРазбор(КоличествоЭкземпляров);									
					
					Если Константы.ОбъединятьСборкиПриПечати.Получить() Тогда
						КоличествоЭкземпляров = 1;
					КонецЕсли;  

					ПровестиИСоздатьКорректировкиЗаказа();
					
				Иначе
					
					Если ВвестиЗначение(ВыбОтветственный, "Укажите ответственного", ) Тогда
						
						Если ВыбОтветственный <> Ответственный  Тогда 
							Ответственный = ВыбОтветственный;
						КонецЕсли;

						ТабДокумент = ПечатьЗаданияНаРазбор(КоличествоЭкземпляров);
						
						Если Константы.ОбъединятьСборкиПриПечати.Получить() Тогда
							КоличествоЭкземпляров = 1;
						КонецЕсли;

						ПровестиИСоздатьКорректировкиЗаказа();
						
					КонецЕсли;
					
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабДокумент <> 0 Тогда 
			УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
		КонецЕсли;
		
	КонецПроцедуры // Печать
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Ячейки", "Номенклатура по ячейкам");
	
	Если Дата >= Константы.ДатаНачалаПроведенияКорректировкиСборкиПоРегиструТоварыВЯчейкахСУчетомИсполнено.Получить() Тогда 
		СтруктураМакетов.Вставить("ЗаданиеНаРазбор", "Задание на разбор");
	КонецЕсли;
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

Функция ПечатьПоЯчейкам()
	
	Если ЭтоНовый() Тогда
		Записать();
	КонецЕсли;
	
	Макет = ПолучитьМакет("Ячейки");
	ТабДок  = Новый ТабличныйДокумент;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = Ссылка.Номер;
	ОбластьМакета.Параметры.Дата = Формат(Ссылка.Дата,"ДЛФ=D");
	ОбластьМакета.Параметры.Клиент = Ссылка.Контрагент;
	ТабДок.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель КАК НоменклатураРодитель,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстаткиИОбороты.Склад,
	|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоПриход,
	|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(, , Регистратор, , Номенклатура В (&МассивНоменклатуры)) КАК ТоварыВЯчейкахОстаткиИОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор = &Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Код УБЫВ,
	|	НоменклатураРодитель,
	|	КодПроизводителя"; 
	
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("МассивНоменклатуры", Товары.ВыгрузитьКолонку("Номенклатура"));
	
	Результат = Запрос.Выполнить();
	ВыборкаНоменклатура = Результат.Выбрать();
	Сч = 1;
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Папа 				= ВыборкаНоменклатура.НоменклатураРодитель;
		ОбластьМакета.Параметры.КодПроизводителя	= ВыборкаНоменклатура.КодПроизводителя;
		ОбластьМакета.Параметры.Номенклатура 		= ВыборкаНоменклатура.Номенклатура;
		ОбластьМакета.Параметры.Ячейка     			= ВыборкаНоменклатура.Ячейка;
		ОбластьМакета.Параметры.Кол	          		= ВыборкаНоменклатура.КоличествоПриход;
		ОбластьМакета.Параметры.ОстатокВЯчейке   	= ВыборкаНоменклатура.КоличествоКонечныйОстаток;
		ОбластьМакета.Параметры.Сч = Сч;
		ТабДок.Вывести(ОбластьМакета);
		Сч  = Сч + 1;
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ПечатьЗаданияНаРазбор(КолЭкземпляров = 1) Экспорт
	
	Если ПоискПричиныПоТабличнойЧастиТовары() = 0 Тогда 

		Сообщить("Печать задания на разбор не требуется");
		Возврат 0;
		
	КонецЕсли;

	ТабДокСводный = Новый ТабличныйДокумент;
	ТабДокСводный.ПолеСлева = 1;
	ТабДокСводный.ПолеСправа = 1;
	ТабДокСводный.ПолеСнизу = 1; 
	ТабДокСводный.ПолеСверху = 1; 
	ТабДокСводный.АвтоМасштаб = Истина;
	ОбъединяемНаОдинЛист = Ложь;
	КоличествоСтрок = Товары.Количество();
	
	Если Константы.ОбъединятьСборкиПриПечати.Получить() И КолЭкземпляров > 1 Тогда
		
		ОбъединяемНаОдинЛист = Истина;
		МассивВыводимыхОбластей = Новый Массив;
		
	КонецЕсли;

	Макет = ПолучитьМакет("ЗаданиеНаРазбор");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = Номер;
	ОбластьМакета.Параметры.Дата = Дата;
	ОбластьМакета.Параметры.НомерСборки = СборкаЗаказовПокупателя.Номер;
	ОбластьМакета.Параметры.ДатаСборки = СборкаЗаказовПокупателя.Дата;
	ОбластьМакета.Параметры.Грузополучатель = СборкаЗаказовПокупателя.Грузополучатель;
	ОбластьМакета.Параметры.ИнформацияОМаршруте = ?(СборкаЗаказовПокупателя.СпособДоставки = Перечисления.СпособДоставки.Самовывоз, 
	                     "САМОВЫВОЗ", "Маршрут: " + СборкаЗаказовПокупателя.МаршрутДоставки);
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ячейка,
	|	СУММА(КорректировкаСборкиЗаказовПокупателяТовары.Количество) КАК Кол,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.Родитель КАК Папа,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.КодПроизводителя КАК КодП,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдИзм
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка = &Ссылка
	|	И ( КорректировкаСборкиЗаказовПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)				   
	|        ИЛИ  КорректировкаСборкиЗаказовПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика) )  
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ячейка,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.Родитель,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.КодПроизводителя,
	|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура.ЕдиницаХраненияОстатков
	|
	|УПОРЯДОЧИТЬ ПО
	|	Папа,
	|	КодП
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТоварыКРазбору = Запрос.Выполнить().Выгрузить();
	Сч = 1;
	
	Для каждого ТекСтр  Из ТоварыКРазбору Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Сч  = Сч;
		ОбластьМакета.Параметры.Заполнить(ТекСтр);
		ТабДокумент.Вывести(ОбластьМакета);
		Сч = Сч+1;
		
	КонецЦикла;
	
	МСК.ЗафиксироватьПечатьДокумента(Ссылка,"ЗаданиеНаРазбор", "Задание на разбор");
	Исполнено = Истина;

	Если ОбъединяемНаОдинЛист Тогда 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Разделитель");
		ТабДокумент.Вывести(ОбластьМакета);  	
		МассивВыводимыхОбластей.Очистить();
		
		ПромТабДок = Новый ТабличныйДокумент;
		ПромТабДок.АвтоМасштаб = Истина;
		
		Для Экземпляров = 1 По КолЭкземпляров Цикл
			МассивВыводимыхОбластей.Добавить(ТабДокумент);				
		КонецЦикла;
		
		Для Экземпляров = 1 По КолЭкземпляров Цикл
			
			ТабДокСводный.Вывести(ТабДокумент);
			
			Если НЕ ПромТабДок.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
				ТабДокСводный.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;					
			
		КонецЦикла;				 
		
		ТабДокумент.Очистить();
		
	КонецЕсли; 
	
	Если НЕ ТабДокСводный.КоличествоСтраниц() = 0 Тогда
		Возврат ТабДокСводный; 
	Иначе
		Возврат ТабДокумент;			
	КонецЕсли;

КонецФункции

Процедура ОбработкаУдаленияПроведения(Отказ) 
	
	Если Не Отказ И Константы.AMQP_ВыгружатьДанные.Получить() И СборкаЗаказовПокупателя.Договор.ВыгружаетсяВБиллинг Тогда
		Рез = AMQP_РаботаСДокументами.ОтменитьДокументКорректировкиБлокировкиВБиллинге(Ссылка);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаЗаказаПокупателяТовары.Ссылка
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	|		ПО КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура = КорректировкаЗаказаПокупателяТовары.Номенклатура
	|			И КорректировкаСборкиЗаказовПокупателяТовары.ЗаказПокупателя = КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя
	|			И КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.Дата <= КорректировкаЗаказаПокупателяТовары.Ссылка.Дата
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка = &КорректировкаСсылка
	|	И КорректировкаЗаказаПокупателяТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("КорректировкаСсылка", Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.УстановитьПометкуУдаления(Истина); 	
		сообщить("Помечен на удаление документ : " + Строка(Об.Ссылка));
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПоискПричиныПоТабличнойЧастиТовары() Экспорт
	
	СписокПричин = ПолучитьСписокПричинОтказа();
	
	Для каждого Элемент  Из СписокПричин Цикл
		
		СтруктураПоиска = Новый Структура("Причина", Элемент.Значение);
		МассивСтрок = Товары.НайтиСтроки(СтруктураПоиска);
		
		Если МассивСтрок.Количество() > 0 Тогда
			
			Количество = МассивСтрок.Количество();
			Возврат Количество;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат 0;
	
КонецФункции

Функция ПолучитьСписокПричинОтказа()
	
	СписокПричин = Новый Структура;
	СписокПричин.Вставить("ОтказКлиента", Перечисления.ПричиныКорректировкиСборки.ОтказКлиента);	
	СписокПричин.Вставить("ОтказПоставщика", Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика);
	
	Возврат СписокПричин;
	
КонецФункции;





