#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Перем мИмяСервиса;
Перем мМетоды;

Перем Клиент;

////////////////////////////////////////////////////////////
// Программный интерфейс

Процедура УстановитьИмяСервиса(Знач ИмяСервиса) Экспорт

	мИмяСервиса = ИмяСервиса;

КонецПроцедуры

Процедура ДобавитьМетод(Знач ИмяМетода, Знач ИмяОбработчика) Экспорт

	мМетоды.Вставить(ИмяМетода, ИмяОбработчика);

КонецПроцедуры

Процедура СлушатьВызовы() Экспорт

	Если мМетоды.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не определен ни один метод'");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(мИмяСервиса) Тогда
		ВызватьИсключение НСтр("ru = 'Не определено имя сервиса'");
	КонецЕсли;

	ПодготовитьКлиентRMQ();

	Данные = "";
	ЗаписьЖурналаРегистрации("АсинхронныйСервис.Старт",УровеньЖурналаРегистрации.Информация,,,
		СтрШаблон(НСтр("ru = 'Сервис %1 запущен.'")));
	Пока Клиент.ПолучитьСообщение(КлючПотребителя(), Данные) Цикл
		
		Попытка
			Сообщение = ДесериализоватьСообщение(Данные);
		Исключение
			ЗаписьЖурналаРегистрации("АсинхронныйСервис.НеверныйФормат", 
				УровеньЖурналаРегистрации.Ошибка,,,
				НСтр(СтрШаблон("ru = 'Не удалось прочитать текст сообщения: %1
                     |%2'",Данные, ОписаниеОшибки())));
			Продолжить;
		КонецПопытки;
		
		ВызватьМетод(Сообщение);
		Клиент.ПодтвердитьСообщение();
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("АсинхронныйСервис.Стоп",УровеньЖурналаРегистрации.Информация,,,
		СтрШаблон(НСтр("ru = 'Сервис %1 остановлен.'")));
	
КонецПроцедуры

////////////////////////////////////////////////////////////
// Служебные методы

Функция КлючПотребителя()

	Возврат "rpc." + мИмяСервиса;

КонецФункции // КлючПотребителя()


Процедура ВызватьМетод(Знач Сообщение)
	
	Перем МетодОбработчик;
	Перем Параметры;
	
	МетодОбработчик = мМетоды[Сообщение.method];
	Если МетодОбработчик = Неопределено Тогда
		ЗаписьЖурналаРегистрации("АсинхронныйСервис.НеверныйФормат", 
			УровеньЖурналаРегистрации.Предупреждение,,,
			НСтр(СтрШаблон("ru = 'Неизвестное имя метода: %1'", Сообщение.method)));
		Возврат;
	КонецЕсли;
	
	Сообщение.Свойство("params", Параметры);
	СтрокаВызова = МетодОбработчик + "(Параметры)";
	
	Попытка
		Результат = СформироватьОтвет(Вычислить(СтрокаВызова));
	Исключение
		ТекстОшибки = МетодОбработчик + "
				|" + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("АсинхронныйСервис.ОшибкаВыполнения", 
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстОшибки);
		Результат = СформироватьОтветИсключение(ТекстОшибки);
	КонецПопытки;

	ОтправитьОтветНаСообщение(Сообщение, Результат);
	
КонецПроцедуры

Функция СформироватьОтвет(Результат)
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("status, value", "ok", Результат));
КонецФункции

Функция СформироватьОтветИсключение(ТекстОшибки)
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("status, value","error", ТекстОшибки));
КонецФункции

Процедура ОтправитьОтветНаСообщение(Знач Сообщение, Знач Результат)
	
	Перем АдресОтвета;
	Если Не Сообщение.Свойство("reply_to", АдресОтвета) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("id", Сообщение.id);
	СтруктураОтвета.Вставить("result", Результат);
	
	Попытка
		ДанныеОтвета = Обработки.АсинхронныйСервис.ЗаписатьСообщениеОбмена(СтруктураОтвета);
		Клиент.ОтправитьСообщение(АдресОтвета,ДанныеОтвета); 
	Исключение
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Не удалось отправить ответ по адресу %1
                                     |%2'"),
						АдресОтвета,
						ОписаниеОшибки());
		
		ЗаписьЖурналаРегистрации("АсинхронныйСервис.ОшибкаСвязи", 
				УровеньЖурналаРегистрации.Ошибка,,,
				ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

Процедура ПодготовитьКлиентRMQ()
	
	Клиент = ОчередьСообщений.ПолучитьЭкземплярКомпоненты();
	
	ИмяТочкиДоступа = Обработки.АсинхронныйСервис.ИмяТочкиОбмена(мИмяСервиса);
	ИмяОчереди      = "rpc." + мИмяСервиса;
	
	Клиент.ОбъявитьТочкуОбмена(ИмяТочкиДоступа, "direct",,Истина);
	Клиент.ОбъявитьОчередь(ИмяОчереди,,,,Истина);
	Клиент.УстановитьСвязьОчереди(ИмяОчереди, ИмяТочкиДоступа);
	Клиент.НачатьЧтение(ИмяОчереди, КлючПотребителя(), Ложь);

КонецПроцедуры

Функция ДесериализоватьСообщение(Знач Данные)

	ОбъектДанных = Обработки.АсинхронныйСервис.ПрочитатьСообщениеОбмена(Данные);
	
	Если Не ОбъектДанных.Свойство("method") Тогда
		ВызватьИсключение НСтр("ru = 'Неверный формат данных запроса'");
	КонецЕсли;
	
	Возврат ОбъектДанных;

КонецФункции // ДесериализоватьСообщение()

Процедура Инициализация()

	мМетоды = Новый Соответствие;

КонецПроцедуры


//////////////////////////////////////////////////////////

Инициализация();

#КонецЕсли