
Процедура ИнициализироватьПостроитель(НастройкиПостроителя = Неопределено) Экспорт 
	
	ПостроительОтчета = Новый ПостроительОтчета;
	
	Если НастройкиПостроителя = Неопределено Тогда
		НастройкиПостроителя = ПостроительОтчета.ПолучитьНастройки(Истина, Истина, Ложь, Ложь, Ложь);
	КонецЕсли; 
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетов.Контрагент,
	               |	АктСверкиВзаиморасчетов.ДоговорКонтрагента КАК Договор,
	               |	АктСверкиВзаиморасчетов.Ссылка КАК АктСверки,
	               |	АктСверкиВзаиморасчетов.ДатаНачала КАК НачалоСверки,
	               |	АктСверкиВзаиморасчетов.ДатаОкончания КАК ОкончаниеСверки,
	               |	АктСверкиВзаиморасчетов.Дата КАК ДатаДокумента,
	               |	Контрагенты.МенеджерМСК КАК Менеджер,
	               |	АктСверкиВзаиморасчетов.СверкаСогласована КАК Согласован,
	               |	АктСверкиВзаиморасчетов.Комментарий,
	               |	АктСверкиВзаиморасчетов.Номер,
	               |	АктСверкиВзаиморасчетов.Организация
	               |ПОМЕСТИТЬ АктыСверок
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО АктСверкиВзаиморасчетов.Контрагент = Контрагенты.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО АктСверкиВзаиморасчетов.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	               |	И (НЕ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов
	               |			ИЛИ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов ЕСТЬ NULL )
	               |	И Контрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктыСверок.Контрагент,
	               |	АктыСверок.Договор,
	               |	АктыСверок.АктСверки,
	               |	АктыСверок.НачалоСверки,
	               |	АктыСверок.ОкончаниеСверки,
	               |	АктыСверок.ДатаДокумента,
	               |	АктыСверок.Менеджер,
	               |	АктыСверок.Согласован,
	               |	АктыСверок.Комментарий,
	               |	АктыСверок.Номер,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(999)) КАК АдресЭлектроннойПочты,
	               |	ВЫБОР
	               |		КОГДА РассылкаДокументовСрезПоследних.Период ЕСТЬ NULL 
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Отправлен,
	               |	ВЫБОР
	               |		КОГДА РассылкаДокументовСрезПоследних.Период ЕСТЬ NULL 
	               |			ТОГДА ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |		ИНАЧЕ РассылкаДокументовСрезПоследних.ВремяОтправки
	               |	КОНЕЦ КАК ДатаОтправки,
	               |	АктыСверок.Организация
	               |ИЗ
	               |	АктыСверок КАК АктыСверок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПоследних(
	               |				,
	               |				(Документ, Контрагент) В
	               |						(ВЫБРАТЬ
	               |							АктыСверок.АктСверки,
	               |							АктыСверок.Контрагент
	               |						ИЗ
	               |							АктыСверок КАК АктыСверок)
	               |					И ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.АктСверкиВзаиморасчетов)) КАК РассылкаДокументовСрезПоследних
	               |		ПО АктыСверок.АктСверки = РассылкаДокументовСрезПоследних.Документ
	               |			И АктыСверок.Контрагент = РассылкаДокументовСрезПоследних.Контрагент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО АктыСверок.Контрагент = КонтактнаяИнформация.Объект
	               |			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОтправкиАктовСверок))";
	   
	
	ПостроительОтчета.Текст = ТекстЗапроса;
	ПостроительОтчета.ЗаполнитьНастройки();
	
	ПостроительОтчета.УстановитьНастройки(НастройкиПостроителя);
	ПорядокПостроителя = ПостроительОтчета.Порядок;
	ПорядокПостроителя.Добавить("ДатаДокумента");
	
	ОтборПостроителя = ПостроительОтчета.Отбор; 
	
	ОтборПостроителя.Добавить("ДатаДокумента");
	ОтборПостроителя["ДатаДокумента"].Использование = Ложь;
	ОтборПостроителя["ДатаДокумента"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	ПостроительОтчета.Отбор["ДатаДокумента"].Представление = "Дата документа";
	
	ОтборПостроителя.Добавить("Контрагент");
	ОтборПостроителя["Контрагент"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Контрагент"].Использование = Ложь;
	
	ОтборПостроителя.Добавить("НачалоСверки");
	ОтборПостроителя["НачалоСверки"].Использование = Ложь;
	ОтборПостроителя["НачалоСверки"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	
	ОтборПостроителя.Добавить("ОкончаниеСверки");
	ОтборПостроителя["ОкончаниеСверки"].Использование = Ложь;
	ОтборПостроителя["ОкончаниеСверки"].ВидСравнения = ВидСравнения.ИнтервалВключаяГраницы;
	
	ОтборПостроителя.Добавить("Менеджер");
	ОтборПостроителя["Менеджер"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Менеджер"].Использование = Ложь;
	
	ОтборПостроителя.Добавить("Согласован");
	ОтборПостроителя["Согласован"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Согласован"].Использование = Ложь;
	ОтборПостроителя["Согласован"].Значение = Истина;
	
	ОтборПостроителя.Добавить("Отправлен");
	ОтборПостроителя["Отправлен"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Отправлен"].Использование = Ложь;
	ОтборПостроителя["Отправлен"].Значение = Истина;
	
	ОтборПостроителя.Добавить("Организация");
	ОтборПостроителя["Контрагент"].ВидСравнения = ВидСравнения.Равно;
	ОтборПостроителя["Контрагент"].Использование = Ложь;	
	
КонецПроцедуры  

Процедура ВыполнитьСозданиеАктовиРазослатьСверку(ДатаН, ДатаК) Экспорт
	
	ОтправлятьПоПочте = НЕ Константы.НеОтправлятьПочту.Получить();
	Если ОтправлятьПоПочте Тогда 
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(999)) КАК АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса
	               |ПОМЕСТИТЬ КонтрагентыВсе
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |			ПО (КонтактнаяИнформация.Объект = Контрагенты.Ссылка)
	               |				И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	               |				И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДляОтправкиАктовСверок))
	               |		ПО ДоговорыКонтрагентов.Владелец = Контрагенты.Ссылка
	               |ГДЕ
	               |	НЕ ДоговорыКонтрагентов.НеОтправлятьАктыСверкиВзаиморасчетов
	               |	И Контрагенты.ГоловнойКонтрагент = Контрагенты.Ссылка
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И НЕ ДоговорыКонтрагентов.РозничнаяПродажа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АктСверкиВзаиморасчетов.Организация,
	               |	АктСверкиВзаиморасчетов.Контрагент,
	               |	АктСверкиВзаиморасчетов.ДоговорКонтрагента,
	               |	АктСверкиВзаиморасчетов.ДатаНачала,
	               |	АктСверкиВзаиморасчетов.ДатаОкончания
	               |ПОМЕСТИТЬ Акты
	               |ИЗ
	               |	Документ.АктСверкиВзаиморасчетов КАК АктСверкиВзаиморасчетов
	               |ГДЕ
	               |	НЕ АктСверкиВзаиморасчетов.ПометкаУдаления
	               |	И АктСверкиВзаиморасчетов.ДатаНачала = &ДатаНач
	               |	И АктСверкиВзаиморасчетов.ДатаОкончания = &ДатаКонНачалоДня
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.Контрагент,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовПриход,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовРасход,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента.Организация КАК Организация,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК Валюта,
	               |	КонтрагентыВсе.АдресЭлектроннойПочтыКонтрагентаДляРассылкиПрайса КАК АдресЭлектроннойПочты
	               |ПОМЕСТИТЬ Взаиморасчеты
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.ОстаткиИОбороты(
	               |			&ДатаНач,
	               |			&ДатаКон,
	               |			,
	               |			,
	               |			(ДоговорКонтрагента, Контрагент) В
	               |					(ВЫБРАТЬ
	               |						КонтрагентыВсе.ДоговорКонтрагента,
	               |						КонтрагентыВсе.Контрагент
	               |					ИЗ
	               |						КонтрагентыВсе КАК КонтрагентыВсе)
	               |				И НЕ (ДоговорКонтрагента, Контрагент, Организация) В
	               |						(ВЫБРАТЬ
	               |							Акты.ДоговорКонтрагента,
	               |							Акты.Контрагент,
	               |							Акты.Организация
	               |						ИЗ
	               |							Акты КАК Акты)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты
	               |		ПОЛНОЕ СОЕДИНЕНИЕ КонтрагентыВсе КАК КонтрагентыВсе
	               |		ПО ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.Контрагент = КонтрагентыВсе.Контрагент
	               |			И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДоговорКонтрагента = КонтрагентыВсе.ДоговорКонтрагента
	               |ГДЕ
	               |	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовНачальныйОстаток <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовПриход <> 0
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовРасход <> 0)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.ДоговорКонтрагента,
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.СуммаВзаиморасчетовНачальныйОстаток,
	               |	Взаиморасчеты.СуммаВзаиморасчетовКонечныйОстаток,
	               |	Взаиморасчеты.СуммаВзаиморасчетовПриход,
	               |	Взаиморасчеты.СуммаВзаиморасчетовРасход,
	               |	Взаиморасчеты.Организация,
	               |	Взаиморасчеты.Валюта,
	               |	Взаиморасчеты.АдресЭлектроннойПочты
	               |ИЗ
	               |	Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	Взаиморасчеты.АдресЭлектроннойПочты <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Взаиморасчеты.Контрагент,
	               |	Взаиморасчеты.АдресЭлектроннойПочты
	               |ИЗ
	               |	Взаиморасчеты КАК Взаиморасчеты
	               |ГДЕ
	               |	Взаиморасчеты.АдресЭлектроннойПочты = """"";
	
	
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ДатаН));
	Запрос.УстановитьПараметр("ДатаКон",КонецДня(ДатаК));
	Запрос.УстановитьПараметр("ДатаКонНачалоДня",НачалоДня(ДатаК));
	Запрос.УстановитьПараметр("Организация",Константы.ОсновнаяОрганизация.Получить());

	Результат = Запрос.ВыполнитьПакет();
	КлиентыКОтправке 	= Результат[3].Выгрузить();
	
	ТабКлиентыБезАдресов   = Результат[4].Выгрузить();
	Для каждого ТекКонтргент Из ТабКлиентыБезАдресов Цикл
		НоваяСтрока = КлиентыБезАдреса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекКонтргент);
	КонецЦикла;
	
	КоличествоАктов = КлиентыКОтправке.Количество();
	
	Если КоличествоАктов = 0 Тогда 
		ТекстСообщения = "За период с "+ДатаН+" по "+ДатаК+" нет  документов к отправке!";
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения);
		#Иначе
			ЗаписьЖурналаРегистрации("ОбработкаКонтрольИОтправкаАктовСверкиВзаиморасчетов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
		#КонецЕсли 
	Иначе	
		
		СоздаватьДокументы = Истина;
		
		#Если Клиент Тогда
			Если Вопрос("Внимание! Будет сформировано и отправлено "+КоличествоАктов+" документов Акт сверки взаиморасчетов. Продолжить?", РежимДиалогаВопрос.ДаНет,60) = КодВозвратаДиалога.Нет Тогда 
				СоздаватьДокументы = Ложь;
			КонецЕсли;
		#КонецЕсли 
		
		Если СоздаватьДокументы Тогда 
			НомерАкта = 0;
			Для каждого Стр Из КлиентыКОтправке Цикл
				НомерАкта = НомерАкта+1;
				
				НовыйАкт = Документы.АктСверкиВзаиморасчетов.СоздатьДокумент();
				
				НовыйАкт.Дата 				= ТекущаяДата();
				НовыйАкт.ДатаНачала 		= НачалоДня(ДатаН);
				НовыйАкт.ДатаОкончания 		= КонецДня(ДатаК);
				НовыйАкт.Организация 		= Стр.Организация;
				НовыйАкт.ВалютаДокумента 	= Стр.Валюта;
				НовыйАкт.Контрагент 		= Стр.Контрагент;
				НовыйАкт.ДоговорКонтрагента = Стр.ДоговорКонтрагента;
				НовыйАкт.Комментарий 		= "Создан автоматически обработкой контроля и отравки актов сверки взаиморасчетов";
				
				НовыйАкт.ЗаполнитьПоДаннымУправленческогоУчета(Ложь);
				ОстатокНаКонец = НовыйАкт.ОстатокНаНачало + НовыйАкт.ПоДаннымОрганизации.Итог("Дебет") -  НовыйАкт.ПоДаннымОрганизации.Итог("Кредит");
				ОстатокНаКонецКонтрагент = - НовыйАкт.ОстатокНаНачало + НовыйАкт.ПоДаннымКонтрагента.Итог("Дебет") -  НовыйАкт.ПоДаннымКонтрагента.Итог("Кредит");
				НовыйАкт.Расхождение = ОстатокНаКонец + ОстатокНаКонецКонтрагент;
				
				Попытка
					НовыйАкт.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					ТекстСообщения = "Не удалось записать документ для клиента "+Стр.Контрагент+
					", договор "+Стр.ДоговорКонтрагента+
					", организация "+Стр.Организация;
					
					#Если Клиент Тогда
						Сообщить(ТекстСообщения);
					#Иначе
						ЗаписьЖурналаРегистрации("ОбработкаКонтрольИОтправкаАктовСверкиВзаиморасчетов",УровеньЖурналаРегистрации.Информация,,,ТекстСообщения);
					#КонецЕсли 
				КонецПопытки;
				
				Если НовыйАкт <> Неопределено И Стр.АдресЭлектроннойПочты <> ""  И ОтправлятьПоПочте Тогда      
					
					МСК.СоздатьИОтправитьАкт(НовыйАкт.Ссылка, Стр.Контрагент, Стр.АдресЭлектроннойПочты, КоличествоАктов,НомерАкта );
					
					//Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	#Если Клиент Тогда
		ОбновитьПостроительАктов();
	#КонецЕсли 
	
КонецПроцедуры

Функция ОбновитьПостроительАктов(ОчищатьТаблицу = Истина) Экспорт 
	
	Если ОчищатьТаблицу Тогда 
		Акты.Очистить();
	КонецЕсли;
	
	ПостроительОтчета.Выполнить();
	
	АктуальныеАкты = ПостроительОтчета.Результат.Выгрузить();
	
	Для каждого ТекущийАкт Из АктуальныеАкты Цикл
		НоваяСтрока = Акты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущийАкт);
	КонецЦикла;
	
	Возврат АктуальныеАкты.Количество();
	
КонецФункции	

