
Функция ПолучитьЗначениеПоСвойству(Ссылка, Свойство = Неопределено) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	Если Не Свойство = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МТ_ПредопределенныеЗначенияСписок.Свойство,
		|	МТ_ПредопределенныеЗначенияСписок.Значение
		|ИЗ
		|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
		|ГДЕ
		|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка
		|	И МТ_ПредопределенныеЗначенияСписок.Свойство = &Свойство";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Свойство", Свойство);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ВозвращаемоеЗначение = Выборка.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции 

Функция ПолучитьМассивЗначенийПоСвойству(Ссылка, Свойство = Неопределено) Экспорт
	
	МассивЗначений = Неопределено;
	
	Если Не Свойство = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МТ_ПредопределенныеЗначенияСписок.Свойство,
		|	МТ_ПредопределенныеЗначенияСписок.Значение
		|ИЗ
		|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
		|ГДЕ
		|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка
		|	И МТ_ПредопределенныеЗначенияСписок.Свойство = &Свойство";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Свойство", Свойство);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			МассивЗначений = Выборка.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивЗначений;
	
КонецФункции

Функция ПолучитьТаблицуВсехСвойствЗначений(Ссылка) Экспорт
//+Гавриленков В. 13.02.2026 #UT10-5690	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МТ_ПредопределенныеЗначенияСписок.Свойство,
	|	МТ_ПредопределенныеЗначенияСписок.Значение
	|ИЗ
	|	Справочник.МТ_ПредопределенныеЗначения.Список КАК МТ_ПредопределенныеЗначенияСписок
	|ГДЕ
	|	МТ_ПредопределенныеЗначенияСписок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Таблица;
	
//-Гавриленков В. 13.02.2026 #UT10-5690	
КонецФункции

Функция ВключитьБлокировкуПерепроведенияДокументовТОХ(ТипДокСсылка) Экспорт
	
	//+Шульман А. 29.04.2025 #UT10-5197
	Для каждого тзСтрока Из Справочники.МТ_ПредопределенныеЗначения.ВключитьБлокировкуПерепроведенияДокументовТОХ.Список Цикл
		
		Если ТипЗнч(тзСтрока.Свойство) = ТипДокСсылка Тогда
			Возврат тзСтрока.Значение;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь; 
	//-Шульман А. 29.04.2025 #UT10-5197

КонецФункции // ()
