
Процедура ПередЗаписью(Отказ)
//+Гавриленков В. 13.02.2026 #UT10-5690
	
	Для Каждого ТекСтрока Из Список Цикл
		
		Если ТипЗнч(ТекСтрока.Свойство) = Тип("Строка") И ЗначениеЗаполнено(ТекСтрока.Свойство) Тогда
			
			ПодходящееИмяСвойства = СокрЛП(ТекСтрока.Свойство);
			
			Если ТекСтрока.Свойство <> ПодходящееИмяСвойства Тогда
				ТекСтрока.Свойство = ПодходящееИмяСвойства;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ТипЗнч(ТекСтрока.Значение) = Тип("Строка") И ЗначениеЗаполнено(ТекСтрока.Значение) Тогда
			
			ПодходящееИмяЗначение = СокрЛП(ТекСтрока.Значение);
			
			Если ТекСтрока.Значение <> ПодходящееИмяЗначение Тогда
				ТекСтрока.Значение = ПодходящееИмяЗначение;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

//-Гавриленков В. 13.02.2026 #UT10-5690
КонецПроцедуры
