Функция ДобавитьТабличныйДокументВОчередь(Пользователь, ТабличныйДокумент, ТипДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Идентификатор = Строка(Новый УникальныйИдентификатор());	
	
	Менеджер = РегистрыСведений.ОчередьПечатиДокументов.СоздатьМенеджерЗаписи();
	Менеджер.ДатаДобавления = ТекущаяДата();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Ответственный = Пользователь;
	Менеджер.ТабличныйДокумент = Новый ХранилищеЗначения(ТабличныйДокумент);
	Менеджер.ТипДокумента = ТипДокумента;
	Менеджер.Записать();
	
	Возврат Идентификатор;
		
КонецФункции 

Функция НапечататьДокумент(Идентификатор, ИмяПринтера) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Менеджер = РегистрыСведений.ОчередьПечатиДокументов.СоздатьМенеджерЗаписи();
	Менеджер.Идентификатор = Идентификатор;
	Менеджер.Прочитать();
	
	Если Менеджер.Выбран() Тогда
		
		Менеджер.ИмяПринтера = ИмяПринтера;
		Менеджер.Напечатано = Истина;
		Менеджер.ДатаПечати = ТекущаяДата();
		
	КонецЕсли;            
	
	Попытка
		
		ТабличныйДокумент = Менеджер.ТабличныйДокумент.Получить();      
		ТабличныйДокумент.ИмяПринтера = ИмяПринтера;
		ТабличныйДокумент.Напечатать(); 
		
		Менеджер.Записать(Истина);  
		
	Исключение
	    Сообщить("Возникла ошибка при печати: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции

Процедура НапечататьДокументыПоОтветственному(Ответственный, ИмяПринтера) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьПечатиДокументов.Идентификатор
	|ИЗ
	|	РегистрСведений.ОчередьПечатиДокументов КАК ОчередьПечатиДокументов
	|ГДЕ
	|	ОчередьПечатиДокументов.Ответственный = &Ответственный
	|	И НЕ ОчередьПечатиДокументов.Напечатано";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственный);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		НапечататьДокумент(Выборка.Идентификатор, ИмяПринтера);	
	КонецЦикла;                                                
	
КонецПроцедуры


