
Функция ЗапросАвтомобилейФизЛица(ФизЛицо) Экспорт
	
	//+Сёмин Р. 20.01.2026 #UT10-5636
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.Владелец = &Владелец
		|	И НЕ ТранспортныеСредства.ПометкаУдаления
		|	И ТранспортныеСредства.Владелец <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Владелец", ФизЛицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	//-Сёмин Р. 20.01.2026 #UT10-5636
	
КонецФункции
