

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	Для Каждого Запись Из ЭтотОбъект Цикл
		
		//+Кабанов А.В. 18.11.2024 #UT10-4904 
		Если Запись.Право = ПланыВидовХарактеристик.ПраваПользователей.ИзменятьСтатусПТУПриПроведении И Запись.Значение Тогда
			
			Если ЗначениеЗаполнено(Запись.Пользователь.ФизЛицо) Тогда 
				
				Если Справочники.КатегорииОбъектов.КатегорияОбъектаУстановлена(Запись.Пользователь.ФизЛицо,Справочники.КатегорииОбъектов.РазрешеноПроведениеПТУСТСД) Тогда 
					
					#Если Клиент Тогда
						Сообщить("У физ.лица "+СокрЛП(Запись.Пользователь.ФизЛицо)+" установлена категория 'Разрешено проведение ПТУ с ТСД'. Установка доп.права 'Изменять статус ПТУ при проведении' невозможно !",СтатусСообщения.Внимание);	
					#КонецЕсли	
					
					Отказ = Истина;
					Запись.Значение = Ложь;
					
				КонецЕсли;
				
				
			КонецЕсли;
			
		КонецЕсли;
		//-Кабанов А.В. 18.11.2024 #UT10-4904 
		
		Если Запись.Значение <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		

		
		// приводим запись к нужному типу
		Запись.Значение = Запись.Право.ТипЗначения.ПривестиЗначение(Запись.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Перем ОбновлятьЗначениеГлПеременной;
	
	КэшДополнительныхПрав = глЗначениеПеременной("ЗначенияДополнительныхПравПользователя");
	УправлениеПользователями.ИнформироватьОИзмененииНастроекПравАктивныхПользователей(ЭтотОбъект, 
																					  КэшДополнительныхПрав, 
																					  "Право",
																					  глЗначениеПеременной("глТекущийПользователь"), 
																					  "значения дополнительных прав",
																					  ОбновлятьЗначениеГлПеременной,
																					  Ложь);
																					  
	Если ОбновлятьЗначениеГлПеременной Тогда
		глЗначениеПеременнойУстановить("ЗначенияДополнительныхПравПользователя", КэшДополнительныхПрав, Истина);
	КонецЕсли;																						  

КонецПроцедуры
