
&НаСервере
Функция ПодключитьВнешнююОбработку() 
	
	//ВременныйФайл = Новый Файл(ПолучитьИмяВременногоФайла("epf"));
	//ПутьДоОбработки = ВременныйФайл.Путь + "\ARMStoreKeeper.epf";
	//Результат = ПоместитьФайл(АдресХранилищаВнешОбработки, ПутьДоОбработки, , Ложь);
	//// при подключении внешней обработки (отчета), если подключаемая обработка (отчет) двоично идентична уже подключенной и совпадает признак безопасного режима, 
	//// реального переподключения не происходит, ошибки при этом не выдается. В противном случае ранее подключенная внешняя обработка (отчет) отключается и 
	//// выполняется новое подключение внешней обработки (отчета);
	//ВнешняяОбработка = ВнешниеОбработки.Подключить(АдресХранилищаВнешОбработки);
		
	ПутьДоОбработки =	КаталогВременныхФайлов() + "ARMStoreKeeper.epf";	                  
	Файл = Новый Файл(ПутьДоОбработки);
	Если Файл.Существует() Тогда
		ВнешняяОбработка = ВнешниеОбработки.Создать(ПутьДоОбработки, Ложь);	
	Иначе
		
	   Попытка	
		   СпрЗапись = Справочники.ВнешниеОбработкиДляВерсионированияФункционала.НайтиПоНаименованию("ARMStoreKeeper",Истина);
		   Если СпрЗапись.Пустая() Или СпрЗапись = Неопределено Тогда
		   	  Возврат Неопределено;
		   КонецЕсли; 
		   ДвоичныеДанные = СпрЗапись.ХранилищеВнешнейОбработки.Получить();
		   ИмяФайла = КаталогВременныхФайлов() + СпрЗапись.Наименование + ".epf";

		   ДвоичныеДанные.Записать(ИмяФайла);
		   
	   Исключение
		   Возврат Неопределено;
	   КонецПопытки; 
		
	КонецЕсли; 
	
	Возврат ВнешняяОбработка;
	
КонецФункции
 
  
&НаСервере
Функция GetVesionWebService()
	
	Возврат 4.1;
	
КонецФункции

// Получить список товаров определенного документа ПТУ
Функция GetListGoodsFromPTU(GUIDPTU, UserGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListGoodsFromPTU");
	
	Попытка		
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокТоваровДокументаПТУ(GUIDPTU, UserGUID);			
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());		
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

// Получить список документов ПТУ
&НаСервере
Функция GetListOfDocumentsPTU(DocumentLink, DocumentGUID, UserGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListOfDocumentsPTU");
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокДокументовПТУ(DocumentLink, DocumentGUID, UserGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfDocumentsPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
	
КонецФункции


// Получить описание товара
Функция GetDescriptionGood(GUIDGood, UserGUID)     
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetDescriptionGood");
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОписаниеТовара(GUIDGood, UserGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDescriptionGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции


// Корректна ли отсканированная ячейка
Функция GetCell(NameCell, UserGUID)  
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetCell");
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку(); 
		РезультатВыполнения = ВнешняяОбработка.ПолучитьЯчейкуПоШтрихКоду(NameCell, UserGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

// Поиск товара по различным видам поиска
//Функция FindGoodByBarcode(Barcode, TypeDocument = "", GUIDDocument = "", SearchType = "ПоискШтрихкодов" )
Функция FindGoodByBarcodeForSearchType(UserGUID, Barcode, TypeDocument, GUIDDocument, SearchType )
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. FindGoodByBarcodeForSearchType");
	
	
	Результат = Неопределено;
	ВнешняяОбработка = ПодключитьВнешнююОбработку(); 		
	Попытка
		
		Если SearchType = "ПоискШтрихкодов"  Тогда
			                                                                                             
			ТЗ = ВнешняяОбработка.ПолучитьТоварПоШтрихкоду(UserGUID, Barcode, TypeDocument, GUIDDocument);
			МассивВременный = ВнешняяОбработка.ТаблицуВМассив(ТЗ);
			Результат = ВнешняяОбработка.ДанныеВJSONХранилище(МассивВременный);

		ИначеЕсли SearchType = "ПоискПоНормализованномуКоду"  Тогда
			
			ТЗ = ВнешняяОбработка.ПолучитьТоварПоНормализованномуКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
			
			МассивВременный = ВнешняяОбработка.ТаблицуВМассив(ТЗ);
			Результат = ВнешняяОбработка.ДанныеВJSONХранилище(МассивВременный);
			
		ИначеЕсли SearchType = "ПоискПоКоду" Тогда
			
			ТЗ =  ВнешняяОбработка.ПолучитьТоварПоКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
			МассивВременный = ВнешняяОбработка.ТаблицуВМассив(ТЗ);
			Результат = ВнешняяОбработка.ДанныеВJSONХранилище(МассивВременный);
			
		КонецЕсли;                                                      
		
	Исключение
		
	    Результат = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcodeForSearchType " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не Результат = Неопределено Тогда
	
		Возврат Результат;		
		
	КонецЕсли;  
	// --- Гавриленков, 12.11.2021
		
КонецФункции

// используется при работе сканера
Функция GetDocumentByBarcode(Barcode, UserIdGUID)   
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetDocumentByBarcode");
	// --- Гавриленков, 12.11.2021
	
	ВнешняяОбработка = ПодключитьВнешнююОбработку();
	UserIdСсылка = ВнешняяОбработка.ПолучитьПользователя(UserIdGUID);
	Попытка
		
		МассивДокументов = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Barcode);
		
		Если МассивДокументов.Количество() > 0 Тогда
			ДокументСсылка = МассивДокументов.Получить(0);		
			ВнешняяОбработка.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить документ по штрихкоду", Barcode); 
			// +++ Гавриленков, 12.11.2021, WARES-215 
			РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокДокументовПТУ( ДокументСсылка, Неопределено);
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDocumentByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;
			// --- Гавриленков, 12.11.2021
			
			
		КонецЕсли;  
		
	Исключение
		// +++ Гавриленков, 12.11.2021, WARES-215
		РезультатВыполнения =  ПолучитьОписаниеОшибки(ОписаниеОшибки());
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDocumentByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;
		// --- Гавриленков, 12.11.2021
		
	КонецПопытки; 
	

	
КонецФункции

// Присвоить штрихкод выбранному товару
Функция AddBarcodeForGood(Barcode, GoodGUID, UserGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. AddBarcodeForGood");
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ДобавитьШтрихкод(Barcode, GoodGUID, UserGUID);		
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBarcodeForGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

// Добавить запись в регистр сведений Буффер арм кладовщика                                                               
Функция AddBufferARMStoreKeeper(ObjectGUID, GoodGUID, UserIdGUID, CreateDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. AddBufferARMStoreKeeper");
	// --- Гавриленков, 12.11.2021
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		
		ОбъектСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку( Новый УникальныйИдентификатор(ObjectGUID) );	
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку( Новый УникальныйИдентификатор(GoodGUID));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КодПроизводителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		
		ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellGUID));
		Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
			UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку( Новый УникальныйИдентификатор(UserIdGUID));				
		Иначе 
			UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
		КонецЕсли; 
		
		
		МЗ = РегистрыСведений.БуферАрмКладовщика.СоздатьМенеджерЗаписи();	
		МЗ.Объект = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;                      		
		МЗ.Номенклатура = НоменклатураСсылка;		
		МЗ.CreateDate = CreateDate;
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			МЗ.Quantity = МЗ.Quantity + Quantity;
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
		Иначе
			МЗ.Объект = ОбъектСсылка;
			МЗ.UserId = UserIdСсылка;
			МЗ.CreateDate = CreateDate;			
			МЗ.Номенклатура = НоменклатураСсылка;		
			МЗ.Barcode = Barcode;
			МЗ.Quantity = Quantity;
			МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;
			МЗ.Ячейка = ЯчейкаСсылка;
			МЗ.ВведеноВРучную = PutIntoManual;
		КонецЕсли;	
		
		МЗ.Записать();
		
		ВнешняяОбработка.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в БуферАРМКладовщика" , 
			"ПТУ " + Строка(ОбъектСсылка.Номер) + ","+ Строка(ОбъектСсылка.НомерСкладскогоДокумента) + 
			"Номенклатура " + НоменклатураСсылка.КодПроизводителя + ", " + НоменклатураСсылка);
		
		РезультатВыполнения = Истина;
		
	Исключение

		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetRemainderForGoodFromDocument(UserGUID, ОbjectIdGUID, Barcode, SelectedProductIdGUID) 
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetRemainderForGoodFromDocument");
	
	Попытка
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОстатокПоТоваруИзДокумента( UserGUID, ОbjectIdGUID, Barcode, SelectedProductIdGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderForGoodFromDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция FindGoodByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues = False)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. FindGoodByBarcode");
	
	Попытка
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.FindGoodByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues);
			
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetRemainderForAllGoodsFromDocument(ОbjectIdGUID, UserGUID) 
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetRemainderForAllGoodsFromDocument");
	
	Попытка
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОстатокПоВсемТоварамИзДокумента( ОbjectIdGUID, UserGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderForAllGoodsFromDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции                                                  


Функция ПолучитьОписаниеОшибки(Ошибка)
	
	ВнешняяОбработка = ПодключитьВнешнююОбработку();
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("Ошибка", Ошибка); 
	Результат = ВнешняяОбработка.ДанныеВJSONХранилище(СтруктураОшибки);
    Возврат Результат;
		
КонецФункции

Функция CreateDocument(DocumentBaseGUID, UserIdGUID, TypeOperation, DeleteRecordsFromBuffer)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. CreateDocument");
	
	РезультатВыполнения = Неопределено;
	
	ВнешняяОбработка = ПодключитьВнешнююОбработку();	
	Если TypeOperation = "ПриемкаТовара" Тогда
		РезультатВыполнения = ВнешняяОбработка.СоздатьДокументРазмещенияПоМестамХранения( DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer);	
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	// --- Гавриленков, 12.11.2021
		
КонецФункции                           

Функция CreateDocumentMoveGood(UserIdGUID, CellFromGUID, CellToGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. CreateDocumentMoveGood");
	
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.СоздатьДокументПеремещенияТоваровМеждуЯчейками(UserIdGUID, CellFromGUID, CellToGUID);	
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateDocumentMoveGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции


Функция AuthenticationUser(Barcode, Password)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. AuthenticationUser");
		
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПроверитьДоступКARMStoreKeeper( Barcode, Password );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AuthenticationUser " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция IsGoodsInCell(CellGUID, UserGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. IsGoodsInCell");
	
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ЕстьЛиТоварыВЯчейке( CellGUID, UserGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. IsGoodsInCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetRemainderGoodFromCell(UserIdGUID, CellGUID, Barcode, GoodGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetRemainderGoodFromCell");
	
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОстатокНоменклатурыПоЯчейке( UserIdGUID, CellGUID, Barcode, GoodGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderGoodFromCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции

Функция GetListGoodsFromCell(UserGUID, CellGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListGoodsFromCell");
	
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокНоменклатурПоЯчейке( UserGUID, CellGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции
                                                                     
Функция GetRemainderGood(GoodGUID, UserGUID )
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetRemainderGood");
	
	Попытка                            
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОстатокТовара( GoodGUID, UserGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция AddBufferMovingARMStoreKeeper(UserIdGUID, CellFromGUID, GoodGUID, CreatedDate, Barcode, Quantity, CellWhereGUID, PutIntoManual)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. AddBufferMovingARMStoreKeeper");
	
	Попытка
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку( Новый УникальныйИдентификатор(GoodGUID));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КодПроизводителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellFromGUID));
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellWhereGUID));
		
		Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
			UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку( Новый УникальныйИдентификатор(UserIdGUID));				
		Иначе 
			UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
		КонецЕсли; 
				
		МЗ = РегистрыСведений.БуферАРМКладовшикаПеремещение.СоздатьМенеджерЗаписи();	
		
		МЗ.UserId = UserIdСсылка;                      		
		МЗ.ЯчейкаОткуда = ЯчейкаОткудаСсылка;
		МЗ.Номенклатура = НоменклатураСсылка;
		МЗ.CreatedDate = CreatedDate;                                                 
		
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			МЗ.Quantity = МЗ.Quantity + Quantity;
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
		Иначе
			
			МЗ.UserId = UserIdСсылка;                      		
			МЗ.ЯчейкаОткуда = ЯчейкаОткудаСсылка;
			МЗ.Номенклатура = НоменклатураСсылка;
			МЗ.CreatedDate = CreatedDate;
			МЗ.Barcode = Barcode;
			МЗ.Quantity = Quantity;
			МЗ.ЯчейкаКуда = ЯчейкаКудаСсылка;
			МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;
			МЗ.ВведеноВРучную = PutIntoManual;
			
		КонецЕсли;	
		                                                                                         
		МЗ.Записать();
		
		ВнешняяОбработка.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Добавить запись в БуферАРМКладовшикаПеремещение", 
			"Откуда " + ЯчейкаОткудаСсылка.Код + " Куда " + ЯчейкаКудаСсылка.Код + "; Штрихкод " + Barcode + "; КодПроизводителя " + РезультатЗапроса.КодПроизводителя +
			НоменклатураСсылка + ", КодПроивзодителя " + НоменклатураСсылка.КодПроизводителя);  
		
		РезультатВыполнения = Истина;
		
	Исключение

		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferMovingARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция IsGoodInCell(CellGUID, GoodGUID, UserGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. IsGoodInCell");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ЕстьЛиТоварВЯчейке( CellGUID, GoodGUID, UserGUID );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. IsGoodInCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListMovesForCreateDocument(UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListMovesForCreateDocument");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЯчеекДляПеремещения(UserIdGUID); 
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListMovesForCreateDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListDeliveryOrders(UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListDeliveryOrders");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаданийНаДоставку(UserIdGUID); 
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListDeliveryOrders " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetRemaindersGoodFromCells(Barcode, GoodGUID, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetRemaindersGoodFromCells");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьОстаткиНоменклатуры(Barcode, GoodGUID, UserIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemaindersGoodFromCells " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListCargoPlaces(DocumentGUID, GetAllRecords, UserIdGUID)  
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListCargoPlaces");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокГрузовыхМест(DocumentGUID, GetAllRecords, UserIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция ProcessingCargoPlace(DeliveryOrderGUID, CargoPlaceGUID, UserIDGUID )
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ProcessingCargoPlace");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ОбработатьГрузовоеМесто(DeliveryOrderGUID, CargoPlaceGUID, UserIDGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlace " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListsRecorfdsFromBufferPlacing(UserIdGUID, ОbjectIdGUID)

	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListsRecorfdsFromBufferPlacing");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаписейИзБуфераРазмещения(UserIdGUID, ОbjectIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListsRecorfdsFromBufferPlacing " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции


Функция WriteBufferWithCheckRemainder(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. WriteBufferWithCheckRemainder");
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		//НачатьТранзакцию();
		//Результат = ARMStoreKeeper.ЗаписатьВБуферРазмещенияСПроверкойОстатков(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual);
		//Если Найти(Результат, "Истина") = 0 Тогда
		//	ОтменитьТранзакцию();
		//Иначе 
		//	ЗафиксироватьТранзакцию();
		//КонецЕсли; 
		//
		//Возврат Результат;
		
		РезультатВыполнения = ВнешняяОбработка.ЗаписатьВБуферРазмещенияСПроверкойОстатков(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, 
																	      Quantity, CellGUID, PutIntoManual);
		
	Исключение
		//ОтменитьТранзакцию();
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. WriteBufferWithCheckRemainder " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции
              
Функция FindGoodByBarcodeWithRemains(Barcode, GoodGUID, UserIDGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. FindGoodByBarcodeWithRemains");
	
	Попытка
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.FindGoodByBarcodeWithRemains(Barcode, GoodGUID, UserIDGUID);
		
	Исключение
	    
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcodeWithRemains " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции


Функция GetListsRecorfdsFromBufferMoving(UserIdGUID, FromCellIdGUID, WhereCellGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListsRecorfdsFromBufferMoving");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаписейИзБуфераПеремещения(UserIdGUID, FromCellIdGUID, WhereCellGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListsRecorfdsFromBufferMoving " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
			
КонецФункции

Функция GetDescriptionForMoving(UserIdGUID, FromCellIdGUID, WhereCellIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetDescriptionForMoving");
	
	Попытка                            
		         
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.GetDescriptionForMoving(UserIdGUID, FromCellIdGUID, WhereCellIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDescriptionForMoving " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция SendLogsFromTSD(UserIdGUID, Logs)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. SendLogsFromTSD");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.SendLogsFromTSD(UserIdGUID, Logs );
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SendLogsFromTSD " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция CheckCellsForLockDuringInventory(ObjectGUID, Cells, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. CheckCellsForLockDuringInventory");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПроверитьЯчейкиДляБлокировкиПриИнвентаризации(ObjectGUID, Cells, UserIdGUID);
		
	Исключение                      
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CheckCellsForLockDuringInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция SetLockCellsForInventory(ObjectGUID, Cells, SetLock, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. SetLockCellsForInventory");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.УстановитьБлокирокуЯчеек(ObjectGUID, Cells, SetLock, UserIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetLockCellsForInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции

Функция GetInventoryForJobs(UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetInventoryForJobs");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаданийНаИнвентаризацию(UserIdGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetInventoryForJobs " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	                                     
КонецФункции

// Добавить запись в РС БуферАРМКладовщикаИнвентПоЯчейкам
Функция AddBufferInventoryARMStoreKeeper(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. AddBufferInventoryARMStoreKeeper");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ДобавитьЗаписьВБуферИнвентаризации(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferInventoryARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция GetCollectAmountGoodFromCellInventory(UserIdGUID, ObjectGUID, CellGUID, Barcode, GoodGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetCollectAmountGoodFromCellInventory");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.GetCollectAmountGoodFromCellInventory(UserIdGUID, ObjectGUID, CellGUID, Barcode, GoodGUID);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetCollectAmountGoodFromCellInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция CheckCanUnlockCellsFromJobInventory(UserIdGUID, ObjectGUID, Cells)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. CheckCanUnlockCellsFromJobInventory");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		                                                                            
		РезультатВыполнения = ВнешняяОбработка.CheckCanUnlockCellsFromJobInventory(UserIdGUID, ObjectGUID, Cells);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CheckCanUnlockCellsFromJobInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции

Функция GetListGoodsFromBufferInventory(UserIdGUID, ObjectGUID, Cell)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListGoodsFromBufferInventory");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаписейИзБуфераИнвентаризации(UserIdGUID, ObjectGUID, Cell);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromBufferInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция ImportDataToJobInventory(UserIdGUID, DocumentGUID, Cells, DeleteRecordsFromBuffer)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ImportDataToJobInventory");
	
	Попытка                                                                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию(UserIdGUID, DocumentGUID, Cells, DeleteRecordsFromBuffer);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ImportDataToJobInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция SetStatusForInventoryCell(UserIdGUID, DocumentGUID, Cell, StatusId)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. SetStatusForInventoryCell");
	
	Попытка                                             
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		                                                                            
		РезультатВыполнения = ВнешняяОбработка.УстановитьСтатусИнвентаризируемойЯчейки(UserIdGUID, DocumentGUID, Cell, StatusId);
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetStatusForInventoryCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListDeliveryOrdersFromUnloadAuto(UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListDeliveryOrdersFromUnloadAuto");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокЗаданийНаДоставкуИзДокументовРазгрузкаАвто(UserIdGUID); 
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListDeliveryOrdersFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция ProcessingCargoPlaceFromUnloadAuto(DeliveryOrderGUID, DocumentGUID, CargoPlaceGUID, UserIdGUID, CreatedDate)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ProcessingCargoPlaceFromUnloadAuto");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ОбработатьГрузовоеМестоИзРазгрузкаАвто(DeliveryOrderGUID, DocumentGUID, CargoPlaceGUID, UserIdGUID, CreatedDate); 
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlaceFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetInfoOnUserId(UserIdGUID, Password)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetInfoOnUserId");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьИнформациюПоПользователю(UserIdGUID, Password); 
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetInfoOnUserId " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция FinishUnloadingCargoPlaces(DeliveryOrderGUID, UserIdGUID, StoreKeeperGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. FinishUnloadingCargoPlaces");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто(DeliveryOrderGUID, UserIdGUID, StoreKeeperGUID);
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FinishUnloadingCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция GetListRouteFromUnloadAutoForSetRoute(UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListRouteFromUnloadAutoForSetRoute");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения =	ВнешняяОбработка.ПолучитьСписокМаршрутовИзРазгрузкаАвтоДляПостановкиНаМаршрут(UserIdGUID);		
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListRouteFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
		
КонецФункции

Функция SetLockOnRouteForUnloadAuto(StoreKeeperGUID, UnloadAutoGUID, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. SetLockOnRouteForUnloadAuto");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто(StoreKeeperGUID, UnloadAutoGUID, UserIdGUID);
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetLockOnRouteForUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
			
КонецФункции

Функция FinishSetOnRouteCargoPlaces(DeliveryOrderGUID, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. FinishSetOnRouteCargoPlaces");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UserIdGUID);
		                       
	Исключение
				
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FinishSetOnRouteCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция ProcessingCargoPlaceFromUnloadAutoForSetRoute(DeliveryOrderGUID, UnloadAutoGUID, CargoPlaceGUID, UserIdGUID, CreatedDate)

	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. ProcessingCargoPlaceFromUnloadAutoForSetRoute");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ОбработатьГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UnloadAutoGUID, CargoPlaceGUID, UserIdGUID, CreatedDate);
		                       
	Исключение
				
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlaceFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции

Функция GetListCargoPlacesFromUnloadAuto(DocumentGUID, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListCargoPlacesFromUnloadAuto");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвто(DocumentGUID, UserIdGUID);
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlacesFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция GetListCargoPlacesFromUnloadAutoForSetRoute(UnloadAutoGUID, UserIdGUID)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListCargoPlacesFromUnloadAutoForSetRoute");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвтоДляПостановкиНаМаршрут(UnloadAutoGUID, UserIdGUID);
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlacesFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021

КонецФункции

Функция GetListOrderPickingForLockCell(CellGUID, UserIdGUID)

	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. GetListOrderPickingForLockCell");
	
	Попытка                            
		
		ВнешняяОбработка = ПодключитьВнешнююОбработку();		
		РезультатВыполнения = ВнешняяОбработка.ПолучитьСписокСборокДляЗаблокированнойЯчейки(CellGUID, UserIdGUID);
		                       
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper_Test", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOrderPickingForLockCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	// --- Гавриленков, 12.11.2021
	
КонецФункции
