
Процедура РегламентноеВыполнение() Экспорт 
	
	Если Константы.МаксимальноеЧислоДнейДляРазбораТовара.Получить() = 0 Тогда
		
		ЗаписьЖурналаРегистрации("Проверка времени размещения документов ПТУ И ПТОХ", УровеньЖурналаРегистрации.Ошибка, , ,
		"Ошибка выполнения - не задана константа 'Максимальное число дней для разбора товара' ");
		
	//+Гавриленков В. 28.02.2025 #UT10-5115	
		//Возврат;  
	Иначе
		ПроверитьВремяРазмещенияПТУиПТОХ();
	//-Гавриленков В. 28.02.2025 #UT10-5115
	КонецЕсли; 
	
	//+Гавриленков В. 28.02.2025 #UT10-5115
	//ПроверитьВремяРазмещенияПТУиПТОХ(); 
	ОбновитьСтатусПоступленияЗавершено();
	//-Гавриленков В. 28.02.2025 #UT10-5115
	
КонецПроцедуры

Процедура ПроверитьВремяРазмещенияПТУиПТОХ() Экспорт
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ
	|	Константы.МаксимальноеЧислоДнейДляРазбораТовара КАК Значение
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки)
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.Обработка)
	|	И ЗначенияСвойствОбъектов.Объект.Дата < ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1 * ВТ_Константа.Значение)
	|	И (ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкам.ДокументОснование КАК Документ,
	|	МИНИМУМ(РазмещениеПоЯчейкам.Дата) КАК Дата
	|ПОМЕСТИТЬ ВТ_ПоступленияСДатамиРазмещений
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
	|ГДЕ
	|	РазмещениеПоЯчейкам.Проведен
	|	И РазмещениеПоЯчейкам.ДокументОснование В
	|			(ВЫБРАТЬ
	|				ВТ_Поступления.Документ
	|			ИЗ
	|				ВТ_Поступления)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкам.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоступленияСДатамиРазмещений.Документ
	|ИЗ
	|	ВТ_ПоступленияСДатамиРазмещений КАК ВТ_ПоступленияСДатамиРазмещений,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ВТ_ПоступленияСДатамиРазмещений.Дата < ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -1 * ВТ_Константа.Значение)";
	
	ЗапросДокументов.УстановитьПараметр("Дата",НачалоДня(ТекущаяДата()));
	
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	Если НЕ РезультатЗапросаДокументов.Пустой() Тогда
		
		ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				МСКWEB.УстановитьЗначениеДопСвойства(ВыборкаДокументов.Документ.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки,Перечисления.СтатусыПриемки.ОбратитеВнимание);
			Исключение   			
			КонецПопытки;				
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСтатусПоступленияЗавершено() Экспорт 
//+Гавриленков В. 28.02.2025 #UT10-5115
	
	ЗапросДокументов = Новый Запрос;
	ЗапросДокументов.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект КАК Документ
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки)
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ОбратитеВнимание)
	|	И (ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Документ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыПоступления
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_Поступления.Документ = ПоступлениеТоваровУслугТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование КАК Документ,
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_ТоварыРазмещения
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Поступления КАК ВТ_Поступления
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТ_Поступления.Документ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Поступление.Документ,
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) КАК Количество
	|ИЗ
	|	ВТ_ТоварыПоступления КАК Поступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыРазмещения КАК Размещено
	|		ПО Поступление.Номенклатура = Размещено.Номенклатура
	|			И Поступление.Документ = Размещено.Документ
	|
	|СГРУППИРОВАТЬ ПО
	|	Поступление.Документ
	|
	|ИМЕЮЩИЕ
	|	СУММА(Поступление.Количество - ЕСТЬNULL(Размещено.Количество, 0)) = 0";
	
	РезультатЗапросаДокументов = ЗапросДокументов.Выполнить();
	
	Если НЕ РезультатЗапросаДокументов.Пустой() Тогда
		
		ВыборкаДокументов = РезультатЗапросаДокументов.Выбрать();
		
		Пока ВыборкаДокументов.Следующий() Цикл
			
			Попытка
				МСКWEB.УстановитьЗначениеДопСвойства(ВыборкаДокументов.Документ.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.Завершено);
			Исключение   			
			КонецПопытки;				
				
		КонецЦикла;
		
	КонецЕсли;	
	
//-Гавриленков В. 28.02.2025 #UT10-5115	
КонецПроцедуры