

Функция ДанныеВJSONХранилище(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

Функция ИзменитьСтатусПТУ(ГУИДДокумента, Статус)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ИзменитьСтатусПТУ");
	
	ТекстОшибки = "";
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ГУИДДокумента);
	
	Если ПТУСсылка.Пустая() Или ПТУСсылка.ПолучитьОбъект() = Неопределено Тогда
		
		ТекстОшибки = "В УТ10 не найден документ ПТУ по реквизиту ИД документа в смежной базе='" + ГУИДДокумента + "'";
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;

	КонецЕсли;
	
	ПТУОбъект = ПТУСсылка.ПолучитьОбъект();
	
	Если ВРЕГ(Статус) = "ЦЕНООБРАЗОВАНИЕ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Ценообразование' у документа должен быть статус 'Бухгалтерия' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Ценообразование;
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;
		
	ИначеЕсли ВРЕГ(Статус) = "ЗАКРЫТ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Закрыт Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Закрыт' у документа должен быть статус 'Ценообразование' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Закрыт;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;
			
		КонецПопытки;

	ИначеЕсли ВРЕГ(Статус) = "БУХГАЛТЕРИЯ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Ценообразование и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'Бухгалтерия' у документа должен быть статус 'Ценообразование' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.Бухгалтерия;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;
	
	ИначеЕсли ВРЕГ(Статус) = "ВРАБОТЕ" Тогда
		
		Если ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус = Перечисления.СтатусыПТУ.ТребуетсяОбработка Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	АктОРасхожденияхПослеПриемки.Ссылка КАК АктОРасхождениях
			               |ИЗ
			               |	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
			               |ГДЕ
			               |	НЕ АктОРасхожденияхПослеПриемки.ПометкаУдаления
			               |	И АктОРасхожденияхПослеПриемки.ДокументОснование = &ДокументОснование";
			
			Запрос.УстановитьПараметр("ДокументОснование", ПТУОбъект.Ссылка);
			Выборка = Запрос.Выполнить().Выбрать();
			Отказ = Ложь;
			
			НачатьТранзакцию();			
			
			Пока Выборка.Следующий() Цикл
				
				ДокументАктОРасхождениях = Выборка.АктОРасхождениях.ПолучитьОбъект();
				ДокументАктОРасхождениях.УстановитьПометкуУдаления(Истина);
				
				Попытка
					ДокументАктОРасхождениях.Записать(РежимЗаписиДокумента.Запись);
				Исключение
					
					Отказ = Истина;
					ТекстОшибки = "Ошибка при установке пометки удаления Акта о расхождениях для ПТУ в УТ10";
					Прервать;
					
				КонецПопытки;
				
			КонецЦикла;
			
			Если Отказ Тогда
				ОтменитьТранзакцию();
			Иначе
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		
		ИначеЕсли ЗначениеЗаполнено(ПТУОбъект.Статус) и ПТУОбъект.Статус <> Перечисления.СтатусыПТУ.Бухгалтерия Тогда
			
			ТекстОшибки = "Ошибка: для установки статуса 'В работе' у документа должен быть статус 'Бухгалтерия' (" + Строка(ПТУСсылка) + ")";
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецЕсли;	
		
		ПТУОбъект.Статус = Перечисления.СтатусыПТУ.ВРаботе;
		
		Попытка
			ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			
			ТекстОшибки = "Ошибка при изменении статуса документа " + Строка(ПТУСсылка);  			
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;

		КонецПопытки;	

	Иначе
		
		ТекстОшибки = "Передан некорректный статус для документа " + Строка(ПТУСсылка);
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;

	КонецЕсли;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета());
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UT10_SetStatusPTU", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусПТУ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	Возврат РезультатВыполнения;
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ТекстОшибки="")
	
	Ответ = Новый Структура("Результат,ТекстОшибки");
	Ответ.Результат = ?(ЗначениеЗаполнено(ТекстОшибки), Ложь, Истина);
	Ответ.ТекстОшибки = ТекстОшибки;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка изменения статуса UT10_SetStatusPTU " + СокрЛП(ТекстОшибки));
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
