
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ПризнакВыполненияСозданиеДокументов.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.ПризнакВыполненияОтправкаДокументов.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.ПризнакВыполненияПодписаниеКвитанций.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.ПризнакВыполненияОтправкаКвитанций.Картинка = БиблиотекаКартинок.ДлительнаяОперация48;
		
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьСтатусСозданияДокументов(Текст = "", ПризнакВыполнения = Ложь, ПризнакОшибки = Ложь) Экспорт
	Если ПризнакОшибки Тогда
		Элементы.ПризнакВыполненияСозданиеДокументов.Картинка = БиблиотекаКартинок.Остановить;
	ИначеЕсли ПризнакВыполнения Тогда
		Элементы.ПризнакВыполненияСозданиеДокументов.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
	КонецЕсли;
	Если ЗначениеЗаполнено(Текст) Тогда
		Элементы.СтатусСозданияДокументов.Заголовок = Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОтправкиДокументов(Текст = "", ПризнакВыполнения = Ложь, ПризнакОшибки = Ложь) Экспорт
	Если ПризнакОшибки Тогда
		Элементы.ПризнакВыполненияОтправкаДокументов.Картинка = БиблиотекаКартинок.Остановить;
	ИначеЕсли ПризнакВыполнения Тогда
		Элементы.ПризнакВыполненияОтправкаДокументов.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
	КонецЕсли;
	Если ЗначениеЗаполнено(Текст) Тогда
		Элементы.СтатусОтправкиДокументов.Заголовок = Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусСозданияКвитанций(Текст = "", ПризнакВыполнения = Ложь, ПризнакОшибки = Ложь) Экспорт
	Если ПризнакОшибки Тогда
		Элементы.ПризнакВыполненияПодписаниеКвитанций.Картинка = БиблиотекаКартинок.Остановить;
	ИначеЕсли ПризнакВыполнения Тогда
		Элементы.ПризнакВыполненияПодписаниеКвитанций.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
	КонецЕсли;
	Если ЗначениеЗаполнено(Текст) Тогда
		Элементы.СтатусПодписаниеКвитанций.Заголовок = Текст;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусОтправкиКвитанций(Текст = "", ПризнакВыполнения = Ложь, ПризнакОшибки = Ложь) Экспорт
	Если ПризнакОшибки Тогда
		Элементы.ПризнакВыполненияОтправкаКвитанций.Картинка = БиблиотекаКартинок.Остановить;
	ИначеЕсли ПризнакВыполнения Тогда
		Элементы.ПризнакВыполненияОтправкаКвитанций.Картинка = БиблиотекаКартинок.ВыполнитьЗадачу;
	КонецЕсли;
	Если ЗначениеЗаполнено(Текст) Тогда
		Элементы.СтатусОтправкаКвитанций.Заголовок = Текст;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСтатусСозданияДокументов(Показать = Истина) Экспорт
	Элементы.ГруппаСозданиеДокументов.Видимость = Показать;
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьСтатусОтправкиДокументов(Показать = Истина) Экспорт
	Элементы.ГруппаОтправкаДокументов.Видимость = Показать;
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьСтатусСозданияКвитанций(Показать = Истина) Экспорт
	Элементы.ГруппаПодписаниеКвитанций.Видимость = Показать;
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьСтатусОтправкиКвитанций(Показать = Истина) Экспорт
	Элементы.ГруппаОтправкаКвитанций.Видимость = Показать;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.Свойство("СтатусСозданияДокументов") Тогда
		ОбновитьСтатусОтправкиДокументов(Параметры.СтатусСозданияДокументов.Текст, 
										 Параметры.СтатусСозданияДокументов.Выполнено,
										 НЕ Параметры.СтатусСозданияДокументов.Выполнено);
	КонецЕсли;
	Если Параметры.Свойство("СтатусОтправкиДокументов") Тогда
		ОбновитьСтатусСозданияДокументов(Параметры.СтатусОтправкиДокументов.Текст, 
										 Параметры.СтатусОтправкиДокументов.Выполнено,
										 НЕ Параметры.СтатусОтправкиДокументов.Выполнено);
	КонецЕсли;
	Если Параметры.Свойство("СтатусСозданияКвитанций") Тогда
		ОбновитьСтатусСозданияКвитанций(Параметры.СтатусСозданияКвитанций.Текст, 
										Параметры.СтатусСозданияКвитанций.Выполнено,
										НЕ Параметры.СтатусСозданияКвитанций.Выполнено);
	КонецЕсли;
	Если Параметры.Свойство("СтатусОтправкиКвитанций") Тогда
		ОбновитьСтатусОтправкиКвитанций(Параметры.СтатусОтправкиКвитанций.Текст, 
										Параметры.СтатусОтправкиКвитанций.Выполнено,
										НЕ Параметры.СтатусОтправкиКвитанций.Выполнено);
	КонецЕсли;
КонецПроцедуры
