
///////////////////Вызовы из подписок и регламентов///////////////////
Процедура ОбработкаПроведенияДокументаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт	
	
	ПроверитьДокументИСоздатьСообщение(Источник);
	
КонецПроцедуры

Процедура ПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи); 	 
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ШтампВерсии", Источник.Метаданные()) Тогда

		ПродолжитьПроверку = Истина;
		
		// Для документа "ВозвратТовровПоставщкику" необходимо формировать штамп версии, даже если документ  не проведен
		Если (ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратТоваровПоставщику") или ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаВозврат")) и Не Источник.Проведен Тогда 
			ПродолжитьПроверку = Ложь;	
		КонецЕсли; 
		
		Если ПродолжитьПроверку И Не ЗначениеЗаполнено(Источник.Ссылка) И РежимЗаписи = РежимЗаписиДокумента.Запись тогда
			Возврат; //Не делаем штамп версии для впервые записываемого, но не проводимого документа
		КонецЕсли;  
		
		НовыйШтамп = Число(Формат(ТекущаяДата(), "ДФ=yyMMddHHmmss"));
		
		Если Источник.ШтампВерсии >= НовыйШтамп Тогда
			Источник.ШтампВерсии = Источник.ШтампВерсии + 1;	
		Иначе
			Источник.ШтампВерсии = НовыйШтамп;
		КонецЕсли;  
		
	КонецЕсли;   
	                                                                                                         
КонецПроцедуры                                                 

Процедура ПриЗаписиДокументаПриЗаписи(Источник, Отказ) Экспорт
	
	Если (ТипЗнч(Источник) = Тип("ДокументОбъект.ВозвратТоваровПоставщику") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаВозврат")) И Не Источник.Проведен Тогда	
		//Если проведен, то выгрузка произойдет в подписке AMQP_ОбработкаПроведенияДокумента
		ПроверитьДокументИСоздатьСообщение(Источник);  
	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("РежимЗаписи") 
		И Источник.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись 
		//+Марков И. 13.08.2025 #UT10-5378
		И НЕ Источник.ДополнительныеСвойства.Свойство("НеФормироватьИсходящееСообщение") 
		//-Марков И. 13.08.2025 #UT10-5378
		И ОбщегоНазначения.ЕстьРеквизитДокумента("НомерЧекаККМ", Источник.Метаданные())
		И Источник.Проведен Тогда	
		ПроверитьДокументИСоздатьСообщение(Источник);  
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведенияОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ПроверитьДокументИСоздатьСообщение(Источник, Истина);		
	
КонецПроцедуры 

Функция СоздатьИсходящееСообщение(ДокументОбъект, ОтменаПроведения = Ложь, ПеречитатьРегистры = Истина, 
								  ДополнСвойства = Неопределено, ДополнЗаголовки = Неопределено, Точка = "", НеЗаписыватьСообщение = Ложь) Экспорт

	Если ДополнСвойства = Неопределено Тогда
		ДополнСвойства = Новый СписокЗначений;
	КонецЕсли; 
	
	Если ДополнЗаголовки = Неопределено Тогда
		ДополнЗаголовки = Новый СписокЗначений;	
	КонецЕсли; 
	
	ЭтоНовый = Ложь;
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда
		ЭтоНовый = ДокументОбъект.ДополнительныеСвойства.ЭтоНовый;
	КонецЕсли;
	
	Документ = ДокументОбъект.Ссылка;
	
	ТипДокумента = Документ.Метаданные().Имя;
	                                                                          
	ДатаВремяСобытия = ТекущаяДата();
		
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия; 
	
	Если ЗначениеЗаполнено(Точка) Тогда
		НовоеСообщение.ТочкаПубликации = Точка		
	Иначе
		НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить(); 
	КонецЕсли; 
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	ДобавитьJSONВСообщение(НовоеСообщение, Документ, ДокументОбъект, ОтменаПроведения, ПеречитатьРегистры);
	
	НовоеСообщение.Объект = Документ.Ссылка;  	
	
	ДобавитьДанныеВСвойстваИЗаголовки(ДокументОбъект, ДополнСвойства, ДополнЗаголовки);	
	ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ТипДокумента, ДополнСвойства, ДополнЗаголовки);                                                             	
	
	Если НеЗаписыватьСообщение Тогда
		Возврат НовоеСообщение; 
	Иначе     
		
		Если ЗначениеЗаполнено(НовоеСообщение.Сообщение) Тогда
			НовоеСообщение.Записать();	
		КонецЕсли;
				
		Возврат Не НовоеСообщение.БылаОшибка;  
		
	КонецЕсли;
	
КонецФункции

Процедура СоздатьИсходящееСообщениеТоварыSM(Источник)
	
	//+Шульман А. 13.05.2025 #UT10-5232
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	НовоеСообщение.Объект = Источник.ВидОстатка;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ВидСостояния",  Источник.ВидОстатка);
	СтруктураДокумента.Вставить("ДатаСостояния", Источник.ДатаСостояния);
	СтруктураДокумента.Вставить("ДатаВыгрузки",  ДатаВремяСобытия);

	//Табличная часть	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(Источник.Товары);
	СтруктураДокумента.Вставить("Товары", МассивТоваров);
	
	//Запись в JSON
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть();	
	
	НовоеСообщение.Сообщение = JsonСтрока;
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("message_ver",  "2.0"); 
 	Заголовки.Добавить("status_type",  Источник.ВидОстатка);
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого",	"application/json"); 
	Свойства.Добавить("ОтметкаВремени",	ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",			"status"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",	2);
	Свойства.Добавить("НомерСообщения",	Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать(); 	
	//-Шульман А. 13.05.2025 #UT10-5232
	
КонецПроцедуры

Процедура СоздатьИсходящееСообщениеПоИтогамЗагрузкиПТУ(Сообщение, ДокПТУ, ТекстОшибки) Экспорт
	
	//+Шульман А. 26.03.2026 #UT10-5785
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	НовоеСообщение.Объект = Сообщение;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, "Р_ВходящиеСообщения", Неопределено, Неопределено);                                                             	
	
	СтруктураДокумента = ОбщегоНазначения.ВернутьСтруктуруИзJSON(Сообщение.Данные); 
	
	СтруктураСообщения = Новый Структура();
	СтруктураСообщения.Вставить("api_id", СтруктураДокумента.api_id);
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		
		СтруктураСообщения.Вставить("number", "");    
		СтруктураСообщения.Вставить("date", "");
		СтруктураСообщения.Вставить("conducted", "");
		СтруктураСообщения.Вставить("agreement", "");
		СтруктураСообщения.Вставить("processed", Ложь);
		СтруктураСообщения.Вставить("error", ТекстОшибки);
		
	Иначе
		
		ТекстОшибки = СтрЗаменить(ТекстОшибки, Символы.ПС, " ");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, """", "");
		
		СтруктураСообщения.Вставить("number",    СОКРЛП(ДокПТУ.Номер));
		СтруктураСообщения.Вставить("date",      Формат(ДокПТУ.Дата, "ДФ='yyyy.MM.dd HH:mm:ss'"));     
		СтруктураСообщения.Вставить("conducted", ДокПТУ.Проведен);  
		
		// Данные соглашения
		СтруктураСоглашение = Новый Структура(); 
		СтруктураСоглашение.Вставить("name",    СОКРЛП(ДокПТУ.ДоговорКонтрагента.Наименование)); 
		СтруктураСоглашение.Вставить("stor",    Ложь); 
		СтруктураСоглашение.Вставить("prem",    ДокПТУ.ПремиальнаяПерекупка); 
		СтруктураСоглашение.Вставить("perekup", Ложь); 
		СтруктураСоглашение.Вставить("zapas",   ДокПТУ.ПополнениеЗапасов); 
		
		СтруктураСообщения.Вставить("agreement", СтруктураСоглашение);    
		СтруктураСообщения.Вставить("processed", Истина);
		СтруктураСообщения.Вставить("error", "");
		
	КонецЕсли;
	
	ТекстСообщения = ОбщегоНазначения.ВернутьJSON(СтруктураСообщения);    	
	
	НовоеСообщение.Сообщение = ТекстСообщения;  
	НовоеСообщение.Записать();
    //-Шульман А. 26.03.2026 #UT10-5785

КонецПроцедуры


///////////////////Общие процедуры и функции///////////////////
Функция ПроверитьНужноЛиВыгружатьДокумент(Документ) Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	
	ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", ИмяДокумента);
	
	Если Не ЗначениеЗаполнено(ДокументВыгрузки) ИЛИ Не ДокументВыгрузки.Выгружать Или ДокументВыгрузки.ПометкаУдаления Тогда
		Возврат Ложь;
	КонецЕсли;
	                          
	ПродолжитьПроверку = Ложь;
	
	Если ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver1_Ver2 
		Или ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver_1 Тогда
		ПродолжитьПроверку = Истина;
	КонецЕсли; 
	
	Если Не ПродолжитьПроверку Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если Документ.Дата < Константы.AMQP_ДатаНачалаВыгрузки.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ШтампВерсии", Документ.Метаданные()) Тогда
		
		Если Документ.ШтампВерсии = 0 тогда
			Возврат Ложь
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ИмяДокумента = "ВозвратТоваровПоставщику" Тогда
		
		Возврат Документ.Контрагент = Константы.ОсновнойПоставщик.Получить();
		
	// Документы СборкаЗаказовПокупателей, РеализацияТоваровУслуг, ВозвратТоваровОтПокупателя проверка идет, через реквизит договор.
	ИначеЕсли ИмяДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда
		
		Результат = ПроверитьДокументКорректировкаСборкиЗаказовПокупателя(Документ);
		Возврат Результат;
		
	ИначеЕсли ИмяДокумента = "КорректировкаРеализации" Тогда
		
		Результат = ПроверитьДокументКорректировкаРеализации(Документ);
		Возврат Результат;
		
	ИначеЕсли ИмяДокумента = "КорректировкаДолга" Тогда	
		
		Результат = НЕ Документ.НеОтправлятьДокументВУчетныеСистемы;
		Возврат Результат;
		
	ИначеЕсли ИмяДокумента = "ПлатежноеПоручениеВходящее" Тогда
		
		Результат = ПроверитьДокументПлатежноеПоручениеВходящее(Документ);
		Возврат Результат;
		
	ИначеЕсли ИмяДокумента = "ПлатежноеПоручениеИсходящее" Тогда
		
		Результат = ПроверитьДокументПлатежноеПоручениеИсходящее(Документ);
		Возврат Результат;
		
	ИначеЕсли ИмяДокумента = "ПриходныйКассовыйОрдер" ИЛИ ИмяДокумента = "РасходныйКассовыйОрдер" Тогда
		Возврат Истина;	
		
	ИначеЕсли ИмяДокумента = "ОприходованиеТоваров" Или ИмяДокумента = "СписаниеТоваров" Тогда
		Возврат Истина;	
		
	//+ Пашкин О.А. 07.07.2025 #UT10-5299
	ИначеЕсли ИмяДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда	
		
		Результат = Документ.Статус = Перечисления.СтатусыЗаказаНаМаркировку.Отправлен;
		Возврат Результат;

	ИначеЕсли ИмяДокумента = "ОтчетОНанесенииКИЗ" Тогда	
		
		Результат = Документ.Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен;
		Возврат Результат;

	ИначеЕсли ИмяДокумента = "ВводВОборотКИЗ" Тогда	
		
		Результат = Документ.Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен;
		Возврат Результат;
	//- Пашкин О.А. 07.07.2025 #UT10-5299
	//+Белов А. 24.03.2026 #UT10-5761
	ИначеЕсли ИмяДокумента = "ВыводИзОборотаКИЗ" Тогда	
		
		Результат = Документ.Статус = Перечисления.СтатусыВыводИзОборотаКИЗ.Отправлен;
		Возврат Результат;
	//-Белов А. 24.03.2026 #UT10-5761
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Договор", Документ.Метаданные()) Тогда
		
		Если Не ПроверитьДоговор(Документ.Договор) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;	                                  
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", Документ.Метаданные()) Тогда
		
		Если Не ПроверитьДоговор(Документ.ДоговорКонтрагента) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;	                                        
	
	Возврат Истина;
	          	                                       
КонецФункции

Процедура ПроверитьДокументИСоздатьСообщение(Источник, ОтменаПроведения = Ложь)
	
	СоздатьСообщение = Истина;
	
	Если Не ПроверитьНужноЛиВыгружатьДокумент(Источник) Тогда
		СоздатьСообщение = Ложь;
	КонецЕсли;
	
	Если СоздатьСообщение Тогда
		
		Попытка
			СоздатьИсходящееСообщение(Источник, ОтменаПроведения, Ложь); 
		Исключение
			ЗаписьЖурналаРегистрации("СозданиеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не записано исходящее сообщение для документа: " + Строка(Источник) + Символы.ПС + ОписаниеОшибки());			
		КонецПопытки;
		
	КонецЕсли; 
	
	СоздатьСообщение = Истина;
	
	Если Не AMQP_РаботаСДокументами_ver2.ПроверитьНужноЛиВыгружатьДокумент(Источник) Тогда
		СоздатьСообщение = Ложь;
	КонецЕсли;
	
	Если СоздатьСообщение Тогда
		
		Попытка
			AMQP_РаботаСДокументами_ver2.СоздатьИсходящееСообщение(Источник, ОтменаПроведения, Ложь); 
		Исключение
			ЗаписьЖурналаРегистрации("СозданиеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не записано исходящее сообщение ver 2.0 для документа: " + Строка(Источник) + Символы.ПС + ОписаниеОшибки());			
		КонецПопытки;	
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверитьДокументПлатежноеПоручениеВходящее(ДокументОбъект) 
	
	Результат = Ложь;
	
	Если ДокументОбъект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		
		Результат = ПроверитьДоговор(ДокументОбъект.ДоговорКонтрагента);
		Возврат Результат;
		
	КонецЕсли;
	
	Для каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Результат = ПроверитьДоговор(Стр.ДоговорКонтрагента);  
		
		Если Результат Тогда
			Прервать;
		КонецЕсли; 	
		
	КонецЦикла; 
		
	Возврат Результат;
	
КонецФункции 

Функция ПроверитьДокументПлатежноеПоручениеИсходящее(ДокументОбъект) 
	
	Результат = Ложь;
	
	Если ДокументОбъект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		
		Результат = ПроверитьДоговор(ДокументОбъект.ДоговорКонтрагента);
		Возврат Результат;
		
	КонецЕсли;
	
	Для каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Результат = ПроверитьДоговор(Стр.ДоговорКонтрагента);   
		
		Если Результат Тогда
			Прервать;
		КонецЕсли; 	
		
	КонецЦикла; 
		
	Возврат Результат;
	
КонецФункции  

Функция ПроверитьДокументКорректировкаДолга(ДокументОбъект) 
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;                             
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВзаиморасчетыСКонтрагентами.Регистратор,
	|	ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентами.Регистратор = &Регистратор
	|	И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВыгружаетсяВБиллинг"; 
	
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда		
		Результат = Истина;			
	КонецЕсли; 
	 	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументКорректировкаРеализации(ДокументОбъект) 
	
	Результат = Ложь;	
	
	Искать = Истина;
	Запрос = Новый Запрос;
	ПараметрСсылка = ДокументОбъект.Ссылка;
	
	Пока Искать Цикл

		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка КАК Ссылка,
		|	КорректировкаРеализации.ДокументРеализации КАК ДокументОснование
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрСсылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		ПараметрСсылка = РезультатЗапроса.ДокументОснование;
		
		Если ТипЗнч(РезультатЗапроса.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда			
			Продолжить;
		КонецЕсли; 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВыгружаетсяВБиллинг КАК ВыгружаетсяВБиллинг
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрСсылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.ВыгружаетсяВБиллинг;
		Искать = Ложь;		
		
	КонецЦикла; 
		
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументКорректировкаСборкиЗаказовПокупателя(ДокументОбъект) 
	
	Результат = Ложь;	 
	
	Запрос = Новый Запрос;		
	Запрос.Текст = "ВЫБРАТЬ
	               |	СборкаЗаказовПокупателя.Ссылка,
	               |	СборкаЗаказовПокупателя.Договор,
	               |	ЕСТЬNULL(ДоговорыКонтрагентов.ВыгружаетсяВБиллинг, ЛОЖЬ) КАК ВыгружаетсяВБиллинг,
	               |	ЕСТЬNULL(ДоговорыКонтрагентов.Ссылка, """") КАК Договор
	               |ИЗ
	               |	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |		ПО СборкаЗаказовПокупателя.Договор = ДоговорыКонтрагентов.Ссылка
	               |ГДЕ
	               |	СборкаЗаказовПокупателя.Ссылка = &СборкаЗаказовПокупателя";	
	
	Запрос.УстановитьПараметр("СборкаЗаказовПокупателя", ДокументОбъект.СборкаЗаказовПокупателя);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда    
		
		РезультатЗапроса.Следующий();
		Результат =  РезультатЗапроса.ВыгружаетсяВБиллинг;   
		
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции

Функция ПроверитьДоговор(Договор) 
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") И НЕ Договор.ВыгружаетсяВБиллинг Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ДобавитьДанныеВСвойстваИЗаголовки(ДокументОбъект, ДополнСвойства, ДополнЗаголовки)
	
	Документ = ДокументОбъект.Ссылка;
	ТипДокумента = Документ.Метаданные().Имя;
	
	Если ТипДокумента = "КорректировкаДолга" Тогда
		ДополнЗаголовки.Добавить("kind_operation", XMLСтрока(ДокументОбъект.ВидОперации));
		
	ИначеЕсли ТипДокумента = "ВозвратТоваровПоставщику" Тогда 
	
		ДополнЗаголовки.Добавить("app_id", ПолучитьКодПрикладнойСистемы());
		ДополнЗаголовки.Добавить("app_Recipient_id", "UT10");
		
		Если ЗначениеЗаполнено(ДокументОбъект.КодМДМОрганизацииВСмежнойБазе) Тогда
			ДополнЗаголовки.Добавить("operation_type", "Перемещение");
		Иначе
			ДополнЗаголовки.Добавить("operation_type", "Предварительный");
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры
 
Процедура ДобавитьJSONВСообщение(НовоеСообщение, Документ, ДокументОбъект, ОтменаПроведения, ПеречитатьРегистры = Истина) Экспорт
	
	СтруктураДокумента = Новый Структура;
	
	ТипДокумента = Документ.Метаданные().Имя;
	
	ЗаписатьПредопределенныеРеквизитыДокумента(Документ, СтруктураДокумента, ОтменаПроведения);
	
	Если ТипДокумента <> "КорректировкаДолга"  И ТипДокумента <> "РасходныйКассовыйОрдер" и ТипДокумента <> "ВозвратТоваровПоставщику" 
	   И ТипДокумента <> "ПриходныйКассовыйОрдер" 
	   И ТипДокумента <> "ОприходованиеТоваров"   
	   И ТипДокумента <> "СписаниеТоваров" Тогда  
		ЗаписатьОсновныеРеквизитыДокумента(Документ, СтруктураДокумента);
	КонецЕсли;
	
	//+ Пашкин О.А. 07.07.2025 #UT10-5299
	ОбработкаМаркировки = ЛОЖЬ;
	//- Пашкин О.А. 07.07.2025 #UT10-5299
	
	Если ТипДокумента = "СборкаЗаказовПокупателя" Тогда			
		ЗаписатьСборкаЗаказовПокупателяДляБиллинга(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);			
	ИначеЕсли ТипДокумента = "РеализацияТоваровУслуг" Тогда						
		ЗаписатьРеализацияТоваровУслуг(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);		
	ИначеЕсли ТипДокумента = "КорректировкаРеализации" Тогда	                               				
		ЗаписатьКорректировкаРеализации(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);		
	ИначеЕсли ТипДокумента = "ПлатежноеПоручениеВходящее" Тогда	                                				
		ЗаписатьПлатежноеПоручениеВходящее(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);		
	ИначеЕсли ТипДокумента = "ПлатежноеПоручениеИсходящее" Тогда	                               				
		ЗаписатьПлатежноеПоручениеИсходящее(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);		
	ИначеЕсли ТипДокумента = "ПриходныйКассовыйОрдер" Тогда	                                        				
		ЗаписатьПриходныйКассовыйОрдер(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);     	
	ИначеЕсли ТипДокумента = "РасходныйКассовыйОрдер" Тогда	                                        				
		ЗаписатьРасходныйКассовыйОрдер(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);     	
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтПокупателя" Тогда                                     	
		ЗаписатьВозвратТоваровОтПокупателя(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 	
	ИначеЕсли ТипДокумента = "КорректировкаДолга" Тогда                                             	
		ЗаписатьКорректировкаДолга(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);         		
	ИначеЕсли ТипДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда 
		ЗаписатьКорректировкуСборкиЗаказаПокупателя(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);
	ИначеЕсли ТипДокумента = "ВозвратТоваровПоставщику" Тогда
		ЗаписатьВозвратТоваровПоставщику(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);  
	ИначеЕсли ТипДокумента = "ОприходованиеТоваров" Тогда
		ЗаписатьОприходованиеТоваров(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
	ИначеЕсли ТипДокумента = "СписаниеТоваров" Тогда
		ЗаписатьСписаниеТоваров(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
	//+ Пашкин О.А. 07.07.2025 #UT10-5299
	ИначеЕсли ТипДокумента = "ОтчетОНанесенииКИЗ" Тогда
		ОбработкаМаркировки = ИСТИНА;
		ЗаписатьОтчетОНанесении(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
	ИначеЕсли ТипДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда
		ОбработкаМаркировки = ИСТИНА;
		ЗаписатьЗаказНаЭмиссиюКодовМаркировкиСУЗ(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
	ИначеЕсли ТипДокумента = "ВводВОборотКИЗ" Тогда
		ОбработкаМаркировки = ИСТИНА;
		ЗаписатьВводВОборот(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
	//- Пашкин О.А. 07.07.2025 #UT10-5299 
	//+Белов А. 24.03.2026 #ВыводИзОборотаКИЗ
	ИначеЕсли ТипДокумента = "ВыводИзОборотаКИЗ" Тогда
		
		ОбработкаМаркировки = ИСТИНА;
		ЗаписатьВыводИзОборота(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры); 
		
	//-Белов А. 24.03.2026 #ВыводИзОборотаКИЗ
	КонецЕсли;
	
	ЕстьОшибки = Ложь;
	СписокОшибок = "";
	
	Для каждого Стр Из СтруктураДокумента Цикл
		
		Если Найти(Стр.Ключ, "МДМ") <> 0 И Не ЗначениеЗаполнено(СокрЛП(Стр.Значение)) Тогда
			
			ЕстьОшибки = Истина;
			СписокОшибок = СписокОшибок + ?(ЗначениеЗаполнено(СписокОшибок), Символы.ПС, "") + "Не заполнен Код МДМ для реквизита: " + Стр.Ключ;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		
		НовоеСообщение.Сообщение = "";
		НовоеСообщение.БылаОшибка = Истина;
		
		Если НовоеСообщение.ЭтоНовый() Тогда
			AMQP_РаботаСДокументами.ОповеститьСерверМониторинга(Ложь, Истина,, СписокОшибок, Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
		Иначе
			AMQP_РаботаСДокументами.ОповеститьСерверМониторинга(Ложь, Истина,, СписокОшибок, Строка(НовоеСообщение.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЕстьОшибки Или Найти("ОприходованиеТоваров, СписаниеТоваров", ТипДокумента) > 0 Тогда
		

		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку(); 
		ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
		JsonСтрока = ЗаписьJSON.Закрыть(); 	
		//+ Пашкин О.А. 07.07.2025 #UT10-5299
		Если ОбработкаМаркировки Тогда
			JsonСтрока = СтрЗаменить(JsonСтрока,"\\u001","\u001");
		КонецЕсли;
		//- Пашкин О.А. 07.07.2025 #UT10-5299
		НовоеСообщение.Сообщение = JsonСтрока;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ТипДокумента, ДополнСвойства = Неопределено, ДополнЗаголовки = Неопределено)	
	                                                         
	Заголовки = Новый СписокЗначений;
	
	//+Шульман А. 26.03.2026 #UT10-5785
	Если ТипДокумента = "Р_ВходящиеСообщения" Тогда
		Заголовки.Добавить("status_type", "СостояниеОбработкиУПД"); 
	//-Шульман А. 26.03.2026 #UT10-5785
	Иначе
		Заголовки.Добавить("document_type", ПолучитьТипДокументаИзБиллингаДля1С(ТипДокумента));  
	КонецЕсли;
	
	НужноДобавлятьЗаголовокПолучателя = Истина; 
	
	Если ЗначениеЗаполнено(ДополнЗаголовки) И ДополнЗаголовки.НайтиПоЗначению("app_Receiver_id") <> Неопределено Тогда
		НужноДобавлятьЗаголовокПолучателя = Ложь;	
	КонецЕсли;  

	//+ Пашкин О.А. 07.07.2025 #UT10-5299
	Если ТипДокумента = "ОтчетОНанесенииКИЗ" 
		ИЛИ ТипДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" 
		ИЛИ ТипДокумента = "ВводВОборотКИЗ"
		//+Белов А. 24.03.2026 #UT10-5761
		ИЛИ ТипДокумента = "ВыводИзОборотаКИЗ"
		//-Белов А. 24.03.2026 #UT10-5761Т
		Тогда  
		
		Заголовки.Добавить("message_ver",  "2.0"); 
		НужноДобавлятьЗаголовокПолучателя = ЛОЖЬ;  
		
	КонецЕсли;
	//- Пашкин О.А. 07.07.2025 #UT10-5299
 
	Если НужноДобавлятьЗаголовокПолучателя Тогда
		Заголовки.Добавить("app_Receiver_id", "None");	
	КонецЕсли;  
	
	Если Найти("ОприходованиеТоваров, СписаниеТоваров", ТипДокумента) > 0 тогда
		Заголовки.Добавить("warehouse_id", НовоеСообщение.Объект.Склад.КодМДМ);     
	КонецЕсли;
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип", "document"); 
	Свойства.Добавить("ИмяПриложения", Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки", 2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла;   	
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнЗаголовки) Тогда
		
		Для каждого Заголовок Из ДополнЗаголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнСвойства) Тогда
		
		Для каждого Свойство Из ДополнСвойства Цикл
			
			НоваяСтрока = НовоеСообщение.Свойства.Добавить();
			НоваяСтрока.Наименование = Свойство.Значение;
			НоваяСтрока.Значение = Свойство.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;		
	
КонецПроцедуры

Функция ПолучитьТипДокументаИзБиллингаДля1С(ТипДокумента) Экспорт
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("СборкаЗаказа", "СборкаЗаказовПокупателя");
	Соотв.Вставить("Возврат", "ВозвратТоваровОтПокупателя");
	Соотв.Вставить("ОприходованиеТоваров", "ОприходованиеИзлишковТоваров");
	Соотв.Вставить("СписаниеТоваров", "СписаниеНедостачТоваров");
	//+ Пашкин О.А. 07.07.2025 #UT10-5299
	Соотв.Вставить("ОтчетОНанесенииКИЗ", "ОтчетОНанесении");
	Соотв.Вставить("ЗаказНаЭмиссиюКодовМаркировкиСУЗ", "ЗаказНаЭмиссию");
	Соотв.Вставить("ВводВОборотКИЗ", "ВводВОборот");
	//- Пашкин О.А. 07.07.2025 #UT10-5299  
	//+Белов А. 24.03.2026 #UT10-5761
	Соотв.Вставить("ВыводИзОборотаКИЗ", "ВыводИзОборота");
	//-Белов А. 24.03.2026 #UT10-5761
	
	Имя = Соотв.Получить(ТипДокумента);
	
	Если Имя = Неопределено Тогда
		Возврат ТипДокумента;
	Иначе
		Возврат Имя;
	КонецЕсли;   	
	
КонецФункции      

Функция ВозвратСтороннимСкладам(Документ) Экспорт
	
	Результат = Новый Структура("ВозвратСтороннимСкладам, ОтправлятьЗаказыПоСкладуВУТ11, КодСторСклада", Ложь, Ложь, "");
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		
		Запрос.УстановитьПараметр("ДокументПоступлениеТоваров",Документ.Ссылка);
		
		//+Гавриленков В. 24.07.2026 #UT10-5974  Добавлено поле ПремиальнаяПерекупка
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка КАК ПоступлениеТоваров,
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада КАК IDСклада,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ЗаказПоставщику.ПремиальнаяПерекупка, ЛОЖЬ) КАК ПремиальнаяПерекупка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.Ссылка = &ДокументПоступлениеТоваров
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.Ссылка,
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ЗаказПоставщику.ПремиальнаяПерекупка, ЛОЖЬ)";
		
	Иначе //Возврат товаров поставщику	
		
		Запрос.УстановитьПараметр("ДокументВозвратТоваров", Документ.Ссылка);		
		
		//+Гавриленков В. 21.07.2026 #UT10-5968
		//Если ЗначениеЗаполнено(Документ.IDСклада) Тогда  
		//	
		//	Запрос.Текст = "ВЫБРАТЬ
		//	|	ВозвратТоваровПоставщику.IDСклада КАК IDСклада
		//	|ИЗ
		//	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		//	|ГДЕ
		//	|	ВозвратТоваровПоставщику.Ссылка = &ДокументВозвратТоваров";
		//	
		//Иначе	
		//	
		//	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	ПоступлениеТоваровУслугТовары.Ссылка КАК ПоступлениеТоваров,
		//	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику КАК ЗаказПоставщику,
		//	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада КАК IDСклада
		//	|ИЗ
		//	|	(ВЫБРАТЬ
		//	|		ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
		//	|		ВозвратТоваровПоставщикуТовары.ДокументПоступления КАК ДокументПоступления
		//	|	ИЗ
		//	|		Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		//	|	ГДЕ
		//	|		ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументВозвратТоваров
		//	|	
		//	|	СГРУППИРОВАТЬ ПО
		//	|		ВозвратТоваровПоставщикуТовары.Номенклатура,
		//	|		ВозвратТоваровПоставщикуТовары.ДокументПоступления) КАК ПоступлениеТоваров
		//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		//	|		ПО ПоступлениеТоваров.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
		//	|			И ПоступлениеТоваров.ДокументПоступления = ПоступлениеТоваровУслугТовары.Ссылка
		//	|
		//	|СГРУППИРОВАТЬ ПО
		//	|	ПоступлениеТоваровУслугТовары.Ссылка,
		//	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
		//	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада";  
		//	
		//КонецЕсли;
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.IDСклада КАК IDСклада,
		|	ЛОЖЬ КАК ПремиальнаяПерекупка,
		|	1 КАК Порядок
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|ГДЕ
		|	ВозвратТоваровПоставщику.Ссылка = &ДокументВозвратТоваров
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ЗаказПоставщику.ПремиальнаяПерекупка, ЛОЖЬ),
		|	0
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
		|		ВозвратТоваровПоставщикуТовары.ДокументПоступления КАК ДокументПоступления
		|	ИЗ
		|		Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		|	ГДЕ
		|		ВозвратТоваровПоставщикуТовары.Ссылка = &ДокументВозвратТоваров
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВозвратТоваровПоставщикуТовары.Номенклатура,
		|		ВозвратТоваровПоставщикуТовары.ДокументПоступления) КАК ПоступлениеТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|		ПО ПоступлениеТоваров.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
		|			И ПоступлениеТоваров.ДокументПоступления = ПоступлениеТоваровУслугТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСклада,
		|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ЗаказПоставщику.ПремиальнаяПерекупка, ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
		//-Гавриленков В. 21.07.2026 #UT10-5968

	КонецЕсли;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		
		Если ЗначениеЗаполнено(Выборка.IDСклада) Тогда  
			
			//+Гавриленков В. 21.07.2026 #UT10-5968
			//Результат.ВозвратСтороннимСкладам = Истина;
			Если Не Выборка.ПремиальнаяПерекупка Тогда
				Результат.ВозвратСтороннимСкладам = Истина;
			КонецЕсли;
			//-Гавриленков В. 21.07.2026 #UT10-5968
			Результат.КодСторСклада = Выборка.IDСклада.КодМДМ;
			
			Если Выборка.IDСклада.ОтправлятьЗаказыПоСкладуВУТ11 Тогда 
				Результат.ОтправлятьЗаказыПоСкладуВУТ11 = Истина;
			КонецЕсли;		
			
			Прервать; 
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат Результат;
 
	
КонецФункции


///////////////////Процедуры записи документов///////////////////
Процедура ЗаписатьПредопределенныеРеквизитыДокумента(Документ, СтруктураДокумента, ОтменаПроведения)
	
	СтруктураДокумента.Вставить("НомерДокумента", СокрЛП(Документ.Номер));
	СтруктураДокумента.Вставить("ДатаДокумента", Документ.Дата);
	СтруктураДокумента.Вставить("УникальныйИдентификатор", Строка(Документ.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("Статус", ?(Документ.Проведен, ?(ОтменаПроведения, 0, 1), 0)); 
	СтруктураДокумента.Вставить("Комментарий", ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Комментарий", Документ.Метаданные()), Документ.Комментарий, ""));
	
КонецПроцедуры

Процедура ЗаписатьОсновныеРеквизитыДокумента(Документ, СтруктураДокумента) 
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СуммаДокумента","Сумма");     	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Договор", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорКонтрагента", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Грузополучатель", "КодМДМ", "КодФилиалаМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ШтампВерсии");
	
КонецПроцедуры

Процедура ЗаписатьСборкаЗаказовПокупателя(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("ДокументСобран", ?(Документ.ДокументСобранИУпакован, 1, 0));
	
	Валюта = Константы.ВалютаУправленческогоУчета.Получить();
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
		
	Если Документ.Движения.Найти("ТоварыВСборке") <> Неопределено Тогда
		
		Если ПеречитатьРегистры Тогда
			Документ.Движения.ТоварыВСборке.Прочитать();
		КонецЕсли;
		
		СтруктураДокумента.Вставить("Сумма", Документ.Движения.ТоварыВСборке.Итог("СуммаКСборке") + Документ.Движения.ТоварыВСборке.Итог("СуммаСобрано"));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьСборкаЗаказовПокупателяДляБиллинга(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры) Экспорт 
	
	Если ПеречитатьРегистры Тогда
		ДокументОбъект.Движения.ТоварыВСборке.Прочитать();
	КонецЕсли;
	
	СтруктураДокумента.Вставить("agreement_mdm_id", Строка(ДокументОбъект.Договор.КодМДМ));
	СтруктураДокумента.Вставить("app_id", Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
	СтруктураДокумента.Вставить("request_id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));	
	СтруктураДокумента.Вставить("request_id_name", ДокументОбъект.Номер);
	СтруктураДокумента.Вставить("request_id_date", Формат(ДокументОбъект.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("Принудительно") Тогда
		СтруктураДокумента.Вставить("skip_shipment_control", "Y");	
	КонецЕсли; 
		
	ТЗ = СформироватьСтрокуЗаказов(ДокументОбъект, Истина);
	
	МассивТранзакций = Новый Массив;
	
	Для каждого Стр Из ТЗ Цикл
		
		СтруктураДанных = Новый Структура;

		Если ЗначениеЗаполнено(Стр.Ссылка) Тогда
			
			СтруктураДанных.Вставить("order_id", Строка(Стр.Ссылка.УникальныйИдентификатор()));
			СтруктураДанных.Вставить("amount", ПреобразоватьЧисло(Стр.Сумма));
			СтруктураДанных.Вставить("order_id_name", Стр.Ссылка.Номер);
			СтруктураДанных.Вставить("order_id_date", Формат(Стр.Ссылка.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));			
			МассивТранзакций.Добавить(СтруктураДанных);
			
		КонецЕсли; 
		
	КонецЦикла; 	
		
	СтруктураДокумента.Вставить("orders", МассивТранзакций);

КонецПроцедуры

Процедура ЗаписатьРеализацияТоваровУслуг(Документ, СтруктураДокумента, ПеречитатьРегистры)
		
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
	КодСоглашенияАварда = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыАварды.КодАварда
	               |ИЗ
	               |	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	               |ГДЕ
	               |	ДоговорыАварды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		КодСоглашенияАварда = КодСоглашенияАварда + ?(ЗначениеЗаполнено(КодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(Выборка.КодАварда), " ", "");
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", КодСоглашенияАварда);
	
	Если Документ.Товары.Количество() > 0 И ЗначениеЗаполнено(Документ.Товары[0].ЗаказПокупателя) Тогда
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", Документ.Товары[0].ЗаказПокупателя.КлючСтрокиУсловий);
	Иначе
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", 0);
	КонецЕсли;
	
	Если Документ.Движения.Найти("Продажи") <> Неопределено Тогда
		
		ПродажиМассив = Новый Массив;
		
		Если ПеречитатьРегистры Тогда
			Документ.Движения.Продажи.Прочитать();
		КонецЕсли;
		
		ТаблицаПродаж = Документ.Движения.Продажи.Выгрузить();
		ТаблицаПродаж.Свернуть("ЗаказПокупателя", "Стоимость");
		
		Для каждого Продажа Из ТаблицаПродаж Цикл
			
			Если Не ЗначениеЗаполнено(Продажа.ЗаказПокупателя) Тогда
				Продолжить;
			КонецЕсли;
			
			ПродажиСтруктура = Новый Структура;
			ПродажиСтруктура.Вставить("УникальныйИдентификатор", Строка(Продажа.ЗаказПокупателя.УникальныйИдентификатор()));
			ПродажиСтруктура.Вставить("Номер", СокрЛП(Продажа.ЗаказПокупателя.Номер));
			ПродажиСтруктура.Вставить("Дата", Продажа.ЗаказПокупателя.Дата);
			ПродажиСтруктура.Вставить("Сумма", Продажа.Стоимость);    
			
			ПродажиМассив.Добавить(ПродажиСтруктура);   		
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Заказы", ПродажиМассив);
		
	КонецЕсли;

	СтруктураДокумента.Вставить("Водитель", Строка(Документ.Водитель));
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Номенклатура.КодМДМ КАК Номенклатура,
	               |	РеализацияТоваровУслугТовары.Количество,
	               |	РеализацияТоваровУслугТовары.СтавкаНДС,
	               |	РеализацияТоваровУслугТовары.Сумма,
	               |	РеализацияТоваровУслугТовары.СуммаНДС,
	               |	РеализацияТоваровУслугТовары.Цена,
	               |	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	               |	РеализацияТоваровУслугТовары.ЗаказПокупателя
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |ГДЕ
	               |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		
		ТоварыСтруктура = Новый Структура;
		ТоварыСтруктура.Вставить("Номенклатура", Выб.Номенклатура);
		ТоварыСтруктура.Вставить("Заказ", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("СтавкаНДС", Строка(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД)); 
		
		Товары.Добавить(ТоварыСтруктура);   		

	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьКорректировкаРеализации(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);
	
	ДокументРеализации = Документ.ДокументРеализации;  
	
	Пока ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл
		ДокументРеализации = ДокументРеализации.ДокументРеализации;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		СтруктураДокумента.Вставить("ДокументРеализации", Строка(ДокументРеализации.УникальныйИдентификатор()));
	КонецЕсли;

	Если Документ.Движения.Найти("Продажи") <> Неопределено Тогда
		
		Если ПеречитатьРегистры Тогда
			Документ.Движения.Продажи.Прочитать();
		КонецЕсли;
	
		ТаблицаПродаж = Документ.Движения.Продажи.Выгрузить();
		СуммаКорректировки = ТаблицаПродаж.Итог("Стоимость");
		СтруктураДокумента.Вставить("Сумма", СуммаКорректировки);

	КонецЕсли;

	Если ЗначениеЗаполнено(ДокументРеализации) И ТипЗнч(ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СтруктураДокумента.Вставить("НомерДокументаРеализации", ДокументРеализации.Номер);
		СтруктураДокумента.Вставить("ДатаДокументаРеализации", ДокументРеализации.Дата); 
		
	КонецЕсли;  
	
	СтруктураДокумента.Вставить("СуммаВключаетНДС", ?(Документ.СуммаВключаетНДС, 1, 0));
	СтруктураДокумента.Вставить("ВидОперации", Строка(Документ.ВидОперации)); 
	
	Товары = Новый Массив;
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаРеализацииТовары.Номенклатура.КодМДМ КАК Номенклатура,
	               |	КорректировкаРеализацииТовары.Количество,
	               |	КорректировкаРеализацииТовары.СтавкаНДС,
	               |	КорректировкаРеализацииТовары.Сумма,
	               |	КорректировкаРеализацииТовары.СуммаНДС,
	               |	КорректировкаРеализацииТовары.Цена,
	               |	КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	               |	КорректировкаРеализацииТовары.ЗаказПокупателя,
	               |	КорректировкаРеализацииТовары.КоличествоДоИзменения,
	               |	КорректировкаРеализацииТовары.ЦенаДоИзменения,
	               |	КорректировкаРеализацииТовары.СуммаДоИзменения,
	               |	КорректировкаРеализацииТовары.СуммаНДСДоИзменения,
	               |	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения
	               |ИЗ
	               |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	               |ГДЕ
	               |	КорректировкаРеализацииТовары.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл 
		
		ТоварыСтруктура = Новый Структура;
		ТоварыСтруктура.Вставить("Номенклатура", Выб.Номенклатура);
		ТоварыСтруктура.Вставить("Заказ", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("СтавкаНДС", Строка(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("КоличествоДоИзменения",Выб.КоличествоДоИзменения);
		ТоварыСтруктура.Вставить("СтавкаНДСДоИзменения", Строка(Выб.СтавкаНДСДоИзменения));
		ТоварыСтруктура.Вставить("СуммаДоИзменения"  , Выб.СуммаДоИзменения);
		ТоварыСтруктура.Вставить("СуммаНДСДоИзменения", Выб.СуммаНДСДоИзменения);
		ТоварыСтруктура.Вставить("ЦенаДоИзменения", Выб.ЦенаДоИзменения);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		Товары.Добавить(ТоварыСтруктура);   		

	КонецЦикла;
	
	СтруктураДокумента.Вставить("Товары", Товары);

КонецПроцедуры

Процедура ЗаписатьПлатежноеПоручениеВходящее(Документ, СтруктураДокумента, ПеречитатьРегистры)
		
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
КонецПроцедуры

Процедура ЗаписатьПлатежноеПоручениеИсходящее(Документ, СтруктураДокумента, ПеречитатьРегистры)
		
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
КонецПроцедуры

Процедура ЗаписатьПриходныйКассовыйОрдер(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("КодОрганизацииМДМ", Документ.Организация.КодМДМГоловнойОрганизации);
	СтруктураДокумента.Вставить("Сумма", Документ.СуммаДокумента);
	
	Если ЗначениеЗаполнено(Документ.Контрагент) ТОгда
		
		Если ТипЗнч(Документ.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
			СтруктураДокумента.Вставить("КодКонтрагентаМДМ", Документ.Контрагент.КодМДМ);
		ИначеЕсли ТипЗнч(Документ.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			СтруктураДокумента.Вставить("ПодотчетноеЛицоКодМДМ", Документ.Контрагент.КодМДМ);
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Документ.ДоговорКонтрагента) тогда
		СтруктураДокумента.Вставить("КодДоговораМДМ", Документ.ДоговорКонтрагента.КодМДМ);
	КонецЕсли;
	
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Касса.КодМДМГоловнойКассы КАК КодКассыМДМ,
	|	ПриходныйКассовыйОрдер.СуммаДокумента
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл
		СтруктураДокумента.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);    	
	КонецЦикла;
		
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
	Если ЗначениеЗаполнено(Документ.ДокументОснование) Тогда 
		
		СтруктураДокумента.Вставить("ОснованиеГУИД", Строка(Документ.ДокументОснование.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("ОснованиеНомер", Документ.ДокументОснование.Номер);
		СтруктураДокумента.Вставить("ОснованиеДата", Документ.ДокументОснование.Дата);
		СтруктураДокумента.Вставить("ОснованиеТип", Документ.ДокументОснование.Метаданные().Имя); 
		
	Иначе 
		
		СтруктураДокумента.Вставить("ОснованиеГУИД", "");
		СтруктураДокумента.Вставить("ОснованиеНомер", "");
		СтруктураДокумента.Вставить("ОснованиеДата", "");
		СтруктураДокумента.Вставить("ОснованиеТип", "");  
		
	КонецЕсли; 
	
	СтруктураДокумента.Вставить("Касса", Строка(Документ.Касса));
	СтруктураДокумента.Вставить("НомерЧекаККМ", Документ.НомерЧекаККМ);
	СтруктураДокумента.Вставить("Основание", Документ.Основание);
	СтруктураДокумента.Вставить("Приложение", Документ.Приложение);
	СтруктураДокумента.Вставить("ПринятоОт", Документ.ПринятоОт);
	СтруктураДокумента.Вставить("СтатьяДвиженияДенежныхСредств", Строка(Документ.СтатьяДвиженияДенежныхСредств));
	СтруктураДокумента.Вставить("ВидОперации", Строка(Документ.ВидОперации));
	СтруктураДокумента.Вставить("ПринятоОт", Документ.ПринятоОт);
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");  
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(Документ.НомерЧекаККМ), 1, 0)); 	
	
	РасшифровкаПлатежа = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Контрагент.КодМДМПартнера КАК КодПартнераМДМ,
	|	ПРЕДСТАВЛЕНИЕ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	|	ПриходныйКассовыйОрдер.ВалютаДокумента.КодМДМ КАК ВалютаВзаиморасчетов,
	|	"""" КАК КодДоговораКредитаИДепозитаМДМ,
	|	ПриходныйКассовыйОрдер.Организация.КодМДМГоловнойОрганизации КАК КодОрганизацииМДМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.КодМДМ КАК КодСтатьиДвиженияДенежныхСредствМДМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СуммаНДС,         
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.КодМДМ КАК КодДоговораМДМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом КАК _ДокументРасчетовСКонтрагентом,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС КАК _СтавкаНДС
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|		ПО ПриходныйКассовыйОрдер.Ссылка = ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);
	
	Результат = Запрос.Выполнить(); 
	
	Если Не Результат.Пустой() Тогда  
		
		Выборка = Результат.Выбрать();
		Массив = AMQP_РаботаСДокументами_ver2.МассивПоддерживаемыхТиповJSON();
		
		Пока Выборка.Следующий() Цикл 
			
			Структура = Новый Структура;
			AMQP_РаботаСДокументами_ver2.ЗаполнитьКоллекциюЗначений(Структура, Выборка, Результат.Колонки, Массив);
			Структура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выборка._СтавкаНДС));
			Структура.Вставить("ДокументРасчетовСКонтрагентом", AMQP_РаботаСДокументами_ver2.ЗначениеJSON(Выборка._ДокументРасчетовСКонтрагентом, Массив));
			
			РасшифровкаПлатежа.Добавить(Структура);

		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
КонецПроцедуры

Процедура ЗаписатьРасходныйКассовыйОрдер(Документ, СтруктураДокумента, ПеречитатьРегистры)
		
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);
	
	СтруктураДокумента.Вставить("КодОрганизацииМДМ", Документ.Организация.КодМДМГоловнойОрганизации);
	СтруктураДокумента.Вставить("Сумма", Документ.СуммаДокумента);
	
	Если ЗначениеЗаполнено(Документ.Контрагент) тогда
		СтруктураДокумента.Вставить("КодКонтрагента", Документ.Контрагент.КодМДМ);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Документ.ДоговорКонтрагента) тогда
		СтруктураДокумента.Вставить("КодДоговора", Документ.ДоговорКонтрагента.КодМДМ);
	КонецЕсли;
	
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии);
	
	Если ЗначениеЗаполнено(Документ.ДокументОснование) Тогда  
		
		СтруктураДокумента.Вставить("ОснованиеГУИД", Строка(Документ.ДокументОснование.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("ОснованиеНомер", Документ.ДокументОснование.Номер);
		СтруктураДокумента.Вставить("ОснованиеДата", Документ.ДокументОснование.Дата);
		СтруктураДокумента.Вставить("ОснованиеТип", Документ.ДокументОснование.Метаданные().Имя); 
		
	Иначе   
		
		СтруктураДокумента.Вставить("ОснованиеГУИД", "");
		СтруктураДокумента.Вставить("ОснованиеНомер", "");
		СтруктураДокумента.Вставить("ОснованиеДата", "");
		СтруктураДокумента.Вставить("ОснованиеТип", "");    
		
	КонецЕсли;  
	
	СтруктураДокумента.Вставить("Касса", Строка(Документ.Касса));  
	СтруктураДокумента.Вставить("НомерЧекаККМ", Документ.НомерЧекаККМ);
	СтруктураДокумента.Вставить("Основание", Документ.Основание);
	СтруктураДокумента.Вставить("ПоДокументу", Документ.ПоДокументу);
	СтруктураДокумента.Вставить("Выдать", Документ.Выдать);
	СтруктураДокумента.Вставить("Приложение", Документ.Приложение);
	СтруктураДокумента.Вставить("СтатьяДвиженияДенежныхСредств", Строка(Документ.СтатьяДвиженияДенежныхСредств));
	СтруктураДокумента.Вставить("КодСтатьиДвиженияДенежныхСредствМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств, "КодМДМ"));
	СтруктураДокумента.Вставить("ВидОперации", Строка(Документ.ВидОперации)); 
	СтруктураДокумента.Вставить("КодКассыМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Касса, "КодМДМГоловнойКассы"));
	СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");

	Если Документ.ВидОперации = Перечисления.ВидыОперацийРКО.ВзносНаличнымиВБанк и 
		НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Касса, "ИнкасацияЧерезОсновнуюКассу") Тогда
		СтруктураДокумента.Вставить("СчетОрганизацииКодМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.СчетОрганизации, "КодМДМ"));
	КонецЕсли; 
	
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(Документ.НомерЧекаККМ), 1, 0)); 	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю)
	|			ТОГДА ""ВозвратОплатыКлиенту""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами)
	|			ТОГДА ""ОплатаПоКредитам""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПоставщику)
	|			ТОГДА ""ОплатаПоставщику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами)
	|			ТОГДА ""ОплатаПоставщику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику)
	|			ТОГДА ""ВыдачаДенежныхСредствПодотчетнику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ)
	|			ТОГДА ""ВыдачаДенежныхСредствВДругуюКассу""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВзносНаличнымиВБанк)  и РасходныйКассовыйОрдер.Касса.ИнкасацияЧерезОсновнуюКассу
	|			ТОГДА ""ВыдачаДенежныхСредствВДругуюКассу"" 
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВзносНаличнымиВБанк)
	|			ТОГДА ""ИнкассацияДенежныхСредствВБанк""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасходДенежныхСредствПрочее)
	|			ТОГДА ""ВыплатаЗарплатыЧерезКассу""  
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыплатаЗаработнойПлаты)
	|			ТОГДА ""ВыплатаЗарплатыЧерезКассу"" 
	|		ИНАЧЕ ""ПрочаяВыдачаДенежныхСредств""
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	РасходныйКассовыйОрдер.Контрагент
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств КАК _СтатьяДвиженияДенежныхСредств,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа КАК СуммаПлатежа,
	|	ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.Владелец.КодМДМПартнера, """") КАК КодПартнераМДМ,
	|	ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.Организация.КодМДМГоловнойОрганизации, """") КАК КодОрганизацииМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС КАК _СтавкаНДС,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаНДС,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.КодМДМ КАК КодСтатьиДвиженияДенежныхСредствМДМ,
	|	"""" КАК КодДоговораКредитаИДепозитаМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом,
	|	ЕСТЬNULL(РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.КодМДМ, """") КАК КодДоговораМДМ
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);               
	
	Результат = Запрос.ВыполнитьПакет();
	
	Массив = AMQP_РаботаСДокументами_ver2.МассивПоддерживаемыхТиповJSON();
	
	Выборка = Результат[0].Выбрать();
	Выборка.Следующий();
	
	AMQP_РаботаСДокументами_ver2.ЗаполнитьКоллекциюЗначений(СтруктураДокумента, Выборка, Выборка.Владелец().Колонки, Массив);
	
	РасшифровкаПлатежа = Новый Массив;
	
	Выборка = Результат[1].Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		
		Структура = Новый Структура;
		AMQP_РаботаСДокументами_ver2.ЗаполнитьКоллекциюЗначений(Структура, Выборка, Выборка.Владелец().Колонки, Массив);
		РасшифровкаПлатежа.Добавить(Структура);
		
		Структура.Вставить("СтатьяДвиженияДенежныхСредств", Строка(Выборка._СтатьяДвиженияДенежныхСредств));
		Структура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выборка._СтавкаНДС));
		Структура.Вставить("ВалютаВзаиморасчетов", СтруктураДокумента.Валюта);
		Структура.Вставить("КодОрганизацииМДМ", СтруктураДокумента.КодОрганизацииМДМ);
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("РасшифровкаПлатежа", РасшифровкаПлатежа);
	
КонецПроцедуры

Процедура ЗаписатьВозвратТоваровОтПокупателя(Документ, СтруктураДокумента, ПеречитатьРегистры)
		
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);
	
	РеализациМассив = Новый Массив;
	
	ТаблицаТоваров = Документ.Товары.Выгрузить();
	ТаблицаТоваров.Свернуть("ДокументПартии", "Сумма");
	
	Для каждого Строка Из ТаблицаТоваров Цикл
		
		Если Не ЗначениеЗаполнено(Строка.ДокументПартии) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Строка.ДокументПартии) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Продолжить;
		КонецЕсли;
		
		РеализацияСтруктура = Новый Структура;
		РеализацияСтруктура.Вставить("УникальныйИдентификатор", Строка(Строка.ДокументПартии.УникальныйИдентификатор()));
		РеализацияСтруктура.Вставить("Номер", Строка.ДокументПартии.Номер);
		РеализацияСтруктура.Вставить("Дата", Строка.ДокументПартии.Дата);
		РеализацияСтруктура.Вставить("Сумма", Строка.Сумма);
		РеализациМассив.Добавить(РеализацияСтруктура);   		
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Реализации", РеализациМассив);
	СтруктураДокумента.Вставить("СуммаВключаетНДС", ?(Документ.СуммаВключаетНДС,1,0));
	
	Товары = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровОтПокупателяТовары.Номенклатура.КодМДМ КАК Номенклатура,
	               |	ВозвратТоваровОтПокупателяТовары.Количество,
	               |	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	               |	ВозвратТоваровОтПокупателяТовары.Сумма,
	               |	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
	               |	ВозвратТоваровОтПокупателяТовары.Цена,
	               |	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	               |	ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя,
	               |	ВозвратТоваровОтПокупателяТовары.ДокументПартии
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	               |ГДЕ
	               |	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);  
	
	Выб = Запрос.Выполнить().Выбрать();  
	
	Пока Выб.Следующий() Цикл 
		
		ТоварыСтруктура = Новый Структура; 
		ТоварыСтруктура.Вставить("Номенклатура", Выб.Номенклатура); 
		
		Если ЗначениеЗаполнено(Выб.ЗаказПокупателя) тогда
			ТоварыСтруктура.Вставить("Заказ", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));
		Иначе
			ТоварыСтруктура.Вставить("Заказ", "");
		КонецЕсли;
		
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("СтавкаНДС", Строка(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		
		Если ЗначениеЗаполнено(Выб.ДокументПартии) Тогда 
			
			ТоварыСтруктура.Вставить("ОснованиеГУИД", Строка(Выб.ДокументПартии.УникальныйИдентификатор()));
			ТоварыСтруктура.Вставить("ОснованиеНомер", Выб.ДокументПартии.Номер);
			ТоварыСтруктура.Вставить("ОснованиеДата", Выб.ДокументПартии.Дата);
			ТоварыСтруктура.Вставить("ОснованиеТип", Выб.ДокументПартии.Метаданные().Имя);
			
		Иначе 
			
			ТоварыСтруктура.Вставить("ОснованиеГУИД", "");
			ТоварыСтруктура.Вставить("ОснованиеНомер", "");
			ТоварыСтруктура.Вставить("ОснованиеДата", "");
			ТоварыСтруктура.Вставить("ОснованиеТип", ""); 
			
		КонецЕсли; 
		
		Товары.Добавить(ТоварыСтруктура);   		

	КонецЦикла; 
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьКорректировкаДолга(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии);
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);

	Если Документ.Движения.Найти("ВзаиморасчетыСКонтрагентами") <> Неопределено Тогда
		
		ВзаиморасчетыМассив = Новый Массив;
		
		Если ПеречитатьРегистры Тогда
			Документ.Движения.ВзаиморасчетыСКонтрагентами.Прочитать();
		КонецЕсли;
		
		ТаблицаВзаиморасчетов = Документ.Движения.ВзаиморасчетыСКонтрагентами.Выгрузить();
		ТаблицаВзаиморасчетов.Свернуть("ВидДвижения, Контрагент, ДоговорКонтрагента", "СуммаВзаиморасчетов");
		
		Для каждого Взаиморасчет Из ТаблицаВзаиморасчетов Цикл
				
			Если Не Взаиморасчет.ДоговорКонтрагента.ВыгружаетсяВБиллинг Тогда
				Продолжить;
			КонецЕсли; 		
			
			ВзаиморасчетыСтруктура = Новый Структура;
			ВзаиморасчетыСтруктура.Вставить("Валюта", Взаиморасчет.ДоговорКонтрагента.ВалютаВзаиморасчетов.КодМДМ);
			ВзаиморасчетыСтруктура.Вставить("КодКонтрагентаМДМ", Взаиморасчет.Контрагент.КодМДМ);
			ВзаиморасчетыСтруктура.Вставить("КодОрганизацииМДМ", Взаиморасчет.ДоговорКонтрагента.Организация.КодМДМГоловнойОрганизации);
			ВзаиморасчетыСтруктура.Вставить("КодДоговораМДМ", Взаиморасчет.ДоговорКонтрагента.КодМДМ);
			ВзаиморасчетыСтруктура.Вставить("Сумма", Взаиморасчет.СуммаВзаиморасчетов * ?(Взаиморасчет.ВидДвижения = ВидДвиженияНакопления.Расход, -1, 1));
			ВзаиморасчетыМассив.Добавить(ВзаиморасчетыСтруктура);   		
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Взаиморасчеты", ВзаиморасчетыМассив);
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);
	
	Если ЗначениеЗаполнено(Документ.КонтрагентДебитор) тогда
		СтруктураДокумента.Вставить("КонтрагентДебитор", Документ.КонтрагентДебитор.КодМДМ);
	Иначе
		СтруктураДокумента.Вставить("КонтрагентДебитор", "");
	КонецЕсли;  
	
	Если ЗначениеЗаполнено(Документ.КонтрагентКредитор) тогда
		СтруктураДокумента.Вставить("КонтрагентКредитор", Документ.КонтрагентКредитор.КодМДМ);
	Иначе
		СтруктураДокумента.Вставить("КонтрагентКредитор", "");
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(Документ.ДоговорКонтрагента) тогда
		СтруктураДокумента.Вставить("ДоговорКонтрагента", Документ.ДоговорКонтрагента.КодМДМ);
	Иначе
		СтруктураДокумента.Вставить("ДоговорКонтрагента", "");
	КонецЕсли;  
	
	Долги = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаДолгаСуммыДолга.Сумма,
	               |	КорректировкаДолгаСуммыДолга.ДоговорКонтрагента,
	               |	КорректировкаДолгаСуммыДолга.ВидЗадолженности,
	               |	КорректировкаДолгаСуммыДолга.ДокументРасчетовСКонтрагентом
	               |ИЗ
	               |	Документ.КорректировкаДолга.СуммыДолга КАК КорректировкаДолгаСуммыДолга
	               |ГДЕ
	               |	КорректировкаДолгаСуммыДолга.Ссылка = &Ссылка"; 
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);  
	
	Выб = Запрос.Выполнить().Выбрать();  
	
	Пока Выб.Следующий() Цикл   
		
		ДолгиСтруктура = Новый Структура;
		
		Если ЗначениеЗаполнено(Выб.ДоговорКонтрагента) Тогда
			ДолгиСтруктура.Вставить("ДоговорКонтрагента", Строка(Выб.ДоговорКонтрагента.КодМДМ));
		Иначе
			ДолгиСтруктура.Вставить("ДоговорКонтрагента", "");
		КонецЕсли; 
		
		ДолгиСтруктура.Вставить("Сумма", Выб.Сумма);
		ДолгиСтруктура.Вставить("ВидЗадолженности", СокрЛП(Выб.ВидЗадолженности));
		
		Если ЗначениеЗаполнено(Выб.ДокументРасчетовСКонтрагентом) Тогда    
			
			ДолгиСтруктура.Вставить("ОснованиеГУИД", Строка(Выб.ДокументРасчетовСКонтрагентом.УникальныйИдентификатор()));
			ДолгиСтруктура.Вставить("ОснованиеНомер", Выб.ДокументРасчетовСКонтрагентом.Номер);
			ДолгиСтруктура.Вставить("ОснованиеДата", Выб.ДокументРасчетовСКонтрагентом.Дата);
			ДолгиСтруктура.Вставить("ОснованиеТип", Выб.ДокументРасчетовСКонтрагентом.Метаданные().Имя);   
			
		Иначе     
			
			ДолгиСтруктура.Вставить("ОснованиеГУИД", "");
			ДолгиСтруктура.Вставить("ОснованиеНомер", "");
			ДолгиСтруктура.Вставить("ОснованиеДата", "");
			ДолгиСтруктура.Вставить("ОснованиеТип", ""); 
			
		КонецЕсли; 
		
		Долги.Добавить(ДолгиСтруктура);   		

	КонецЦикла;         
	
	СтруктураДокумента.Вставить("Долги", Долги);
	
КонецПроцедуры
	
Процедура ЗаписатьКорректировкуСборкиЗаказаПокупателя(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("request_id", Строка(ДокументОбъект.СборкаЗаказовПокупателя.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("app_id", Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
	СтруктураДокумента.Вставить("correction_request_id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));
	
	ТЗ = СформироватьСтрокуКорректировкиЗаказов(ДокументОбъект, Истина);
	
	МассивТранзакций = Новый Массив;                                           
	
	Для каждого Стр Из ТЗ Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("source_order_id", Строка(Стр.Ссылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("amount", ПреобразоватьЧисло(Стр.Сумма));
		МассивТранзакций.Добавить(СтруктураДанных);  
		
	КонецЦикла; 	
		
	СтруктураДокумента.Вставить("transactions", МассивТранзакций);
	
КонецПроцедуры

Процедура ЗаписатьСборкуЗаказаПокупателя(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры)

	СтруктураДокумента.Вставить("request_id", Строка(ДокументОбъект.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("app_id", Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
	
	ТЗ = СформироватьСтрокуЗаказов(ДокументОбъект, Истина);
	
	МассивТранзакций = Новый Массив;                                           
	
	Для каждого Стр Из ТЗ Цикл
	
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("source_order_id", Строка(Стр.Ссылка.УникальныйИдентификатор()));
		СтруктураДанных.Вставить("amount", ПреобразоватьЧисло(Стр.Сумма));
		МассивТранзакций.Добавить(СтруктураДанных);  
		
	КонецЦикла; 	
		
	СтруктураДокумента.Вставить("transactions", МассивТранзакций);

КонецПроцедуры

Процедура ЗаписатьВозвратТоваровПоставщику(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	Префикс = Лев(Документ.Организация.Префикс,2);
	ЧислоСимволов = 5;   
	
	НовыйНомер = Прав(Документ.Номер, ЧислоСимволов);
	
	Пока СтрДлина(НовыйНомер) < ЧислоСимволов Цикл
		НовыйНомер = "0" + НовыйНомер;
	КонецЦикла;     
	
	НомерУТ11 = ?(Префикс = "", "00", Префикс) + "00-В" + НовыйНомер;	
	
	СтруктураДокумента.Вставить("НомерУТ11", НомерУТ11);
	СтруктураДокумента.Вставить("app_id", ПолучитьКодПрикладнойСистемы());	
	СтруктураДокумента.Вставить("ВидДокумента", "ВозвратТоваровПоставщику");
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);
	СтруктураДокумента.Вставить("Ответственный", Строка(Документ.Ответственный));

	Если ЗначениеЗаполнено(Документ.КодМДМОрганизацииВСмежнойБазе) Тогда
		СтруктураДокумента.Вставить("ОрганизацияКодМДМ", СокрЛП(Документ.КодМДМОрганизацииВСмежнойБазе));
	Иначе
		СтруктураДокумента.Вставить("ОрганизацияКодМДМ", СокрЛП(Документ.Организация.КодМДМГоловнойОрганизации));
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Предварительный", НЕ ЗначениеЗаполнено(Документ.КодМДМОрганизацииВСмежнойБазе));
	СтруктураДокумента.Вставить("СкладКодМДМ", СокрЛП(Документ.Склад.КодМДМ));
	СтруктураДокумента.Вставить("Контрагент", СокрЛП(Документ.Контрагент));
	СтруктураДокумента.Вставить("ВозвратРекламационногоТовара", Документ.ВозвратРекламационногоТовара);
	СтруктураДокумента.Вставить("УникальныйИдентификатор", Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("СтатусСогласования", XMLСтрока(Документ.СтатусСогласования));
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("Проведен", Документ.Проведен);  
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии);
	СтруктураДокумента.Вставить("КодСкладаПолучателяМДМ", Константы.ГрузополучательДляВозвратов.Получить().ТранзитныйСкладКодМДМ);

	Результат = ВозвратСтороннимСкладам(Документ);
	СтруктураДокумента.Вставить("ВозвратСтороннимСкладам", Результат.ВозвратСтороннимСкладам);
	СтруктураДокумента.Вставить("ОтправлятьЗаказыПоСкладуВУТ11", Результат.ОтправлятьЗаказыПоСкладуВУТ11);
	СтруктураДокумента.Вставить("КодСторСклада", Результат.КодСторСклада);
	
	Если Результат.ОтправлятьЗаказыПоСкладуВУТ11 Тогда
		СтруктураДокумента.ВозвратРекламационногоТовара = Ложь;
	КонецЕсли;	

	СтруктураДокумента.Вставить("ДокументОснованиеВид", ?(ЗначениеЗаполнено(Документ.ДокументОснование), Документ.ДокументОснование.Метаданные().Имя, ""));
	СтруктураДокумента.Вставить("ДокументОснованиеУникальныйИдентификатор", 
	                  ?(ЗначениеЗаполнено(Документ.ДокументОснование), Строка(Документ.ДокументОснование.УникальныйИдентификатор()), ""));
	
	ТЧ = Документ.Товары.Выгрузить();
	ТЧ.Свернуть("ДокументПоступления");
	
	СписокПТУ = "";
	
	Для Каждого Стр Из ТЧ Цикл
		
		НомерВхДок = СокрЛП(Стр.ДокументПоступления.НомерВходящегоДокумента);  
		
		Если ЗначениеЗаполнено(НомерВхДок) Тогда
			СписокПТУ = СписокПТУ + ?(ЗначениеЗаполнено(СписокПТУ), ", ", "") + НомерВхДок;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Комментарий = "Возврат из филиала № " + Документ.Номер;
	
	Если ЗначениеЗаполнено(СписокПТУ) Тогда
		Комментарий = Комментарий + " (" + СписокПТУ + ")";
	КонецЕсли;	 
	
	Если ЗначениеЗаполнено(Документ.Комментарий) Тогда
		Комментарий = Комментарий + " (" + СокрЛП(Документ.Комментарий) + ")";
	КонецЕсли;	
	
	Комментарий = Комментарий + " от " + Строка(Документ.Дата);	
	СтруктураДокумента.Вставить("Комментарий", Комментарий);
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура.КодПоБазеМоскоречье КАК КодПоБазеМоскоречье,
	               |	ВозвратТоваровПоставщикуТовары.Количество,
	               |	ВозвратТоваровПоставщикуТовары.СтавкаНДС,
	               |	ВозвратТоваровПоставщикуТовары.Сумма,
	               |	ВозвратТоваровПоставщикуТовары.СуммаНДС,
	               |	ВозвратТоваровПоставщикуТовары.Цена,
	               |	ВозвратТоваровПоставщикуТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
				   |	ВозвратТоваровПоставщикуТовары.Комментарий
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка";   
				   
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);      
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл 
		
		ТоварыСтруктура = Новый Структура;
		ТоварыСтруктура.Вставить("Номенклатура", Строка(Выб.Номенклатура));  
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("КодПоБазеМоскоречье", Выб.КодПоБазеМоскоречье);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("СтавкаНДС", Строка(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		ТоварыСтруктура.Вставить("Комментарий", СокрЛП(Выб.Комментарий));
		
		Товары.Добавить(ТоварыСтруктура); 
		
	КонецЦикла;                
	
	СтруктураДокумента.Вставить("Товары", Товары);

КонецПроцедуры

Процедура ЗаписатьОприходованиеТоваров(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии); 
	СтруктураДокумента.Вставить("КодОрганизацииМДМ", Документ.Организация.КодМДМГоловнойОрганизации);   
	СтруктураДокумента.Вставить("КодСкладаМДМ", 	Документ.Склад.КодМДМ);
	СтруктураДокумента.Вставить("КодВидаЦеныМДМ", 	Документ.ТипЦен.КодМДМ);
	СтруктураДокумента.Вставить("СтатьяДоходов_Тип",           "ПланВидовХарактеристик.СтатьиДоходов");
	СтруктураДокумента.Вставить("СтатьяДоходов_Идентификатор", "");
	СтруктураДокумента.Вставить("СтатьяДоходов_Представление", "Излишек товаров, материалов, денежных средств");
	СтруктураДокумента.Вставить("СтатьяДоходов_КодМДМ",        "3e1840fa-6423-11ec-80da-00505689035b");  
	
	Подразделение = Документ.Подразделение;
	
	СтруктураДокумента.Вставить("АналитикаДоходов_Тип",           "Справочник.СтруктураПредприятия");
	СтруктураДокумента.Вставить("АналитикаДоходов_Идентификатор", XMLСтрока(Подразделение));
	СтруктураДокумента.Вставить("АналитикаДоходов_Представление", Строка(Подразделение));
	СтруктураДокумента.Вставить("АналитикаДоходов_КодМДМ",        Подразделение.КодМДМ);
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии);
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОприходованиеТоваров.НомерСтроки,
	               |	ОприходованиеТоваров.Номенклатура КАК Номенклатура,
	               |	ОприходованиеТоваров.Номенклатура.КодМДМ КАК КодНоменклатурыМДМ,
	               |	ОприходованиеТоваров.Количество,
	               |	ОприходованиеТоваров.Сумма,
	               |	ОприходованиеТоваров.Цена,
	               |	ОприходованиеТоваров.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	               |	ОприходованиеТоваров.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения
	               |ИЗ
	               |	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваров
	               |ГДЕ
	               |	ОприходованиеТоваров.Ссылка = &Ссылка";   
				   
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);      
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл 
		
		ТоварыСтруктура = Новый Структура;  
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);  
		ТоварыСтруктура.Вставить("КодНоменклатурыМДМ", Выб.КодНоменклатурыМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);   
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));   
		ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", СОКРЛП(Выб.КодМДМСтранаПроисхождения));
		
		Товары.Добавить(ТоварыСтруктура); 
		
	КонецЦикла;                
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьСписаниеТоваров(Документ, СтруктураДокумента, ПеречитатьРегистры)
	
	СтруктураДокумента.Вставить("ШтампВерсии", Документ.ШтампВерсии); 
	СтруктураДокумента.Вставить("КодОрганизацииМДМ", Документ.Организация.КодМДМГоловнойОрганизации);   
	СтруктураДокумента.Вставить("КодСкладаМДМ", 	Документ.Склад.КодМДМ);
	СтруктураДокумента.Вставить("КодВидаЦеныМДМ", 	"");
	СтруктураДокумента.Вставить("СтатьяРасходов_Тип",           "ПланВидовХарактеристик.СтатьиРасходов");
	СтруктураДокумента.Вставить("СтатьяРасходов_Идентификатор", "");
	СтруктураДокумента.Вставить("СтатьяРасходов_Представление", "Недостача товаров, материалов, денежных ср-в");
	СтруктураДокумента.Вставить("СтатьяРасходов_КодМДМ",        "e1fcacce-6423-11ec-80da-00505689035b");  
	
	Подразделение = Документ.Подразделение;
	
	СтруктураДокумента.Вставить("АналитикаРасходов_Тип",           "Справочник.СтруктураПредприятия");
	СтруктураДокумента.Вставить("АналитикаРасходов_Идентификатор", XMLСтрока(Подразделение));
	СтруктураДокумента.Вставить("АналитикаРасходов_Представление", Строка(Подразделение));
	СтруктураДокумента.Вставить("АналитикаРасходов_КодМДМ",        Подразделение.КодМДМ);	
	СтруктураДокумента.Вставить("ПодразделениеКодМДМ", Подразделение.КодМДМ);	
	СтруктураДокумента.Вставить("ПометкаУдаления",     Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("ШтампВерсии",         Документ.ШтампВерсии);
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СписаниеТоваров.НомерСтроки,
	               |	СписаниеТоваров.Номенклатура КАК Номенклатура,
	               |	СписаниеТоваров.Номенклатура.КодМДМ КАК КодНоменклатурыМДМ,
	               |	СписаниеТоваров.Количество,
	               |	СписаниеТоваров.Сумма,
	               |	СписаниеТоваров.Цена,
	               |	СписаниеТоваров.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	               |	СписаниеТоваров.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения
	               |ИЗ
	               |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваров
	               |ГДЕ
	               |	СписаниеТоваров.Ссылка = &Ссылка";   
				   
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);      
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл 
		
		ТоварыСтруктура = Новый Структура;  
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);  
		ТоварыСтруктура.Вставить("КодНоменклатурыМДМ", Выб.КодНоменклатурыМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));   
		ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", СОКРЛП(Выб.КодМДМСтранаПроисхождения));
		
		Товары.Добавить(ТоварыСтруктура); 
		
	КонецЦикла;                
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьОтчетОНанесении(Документ, СтруктураДокумента, ПеречитатьРегистры)
//+ Пашкин О.А. 07.07.2025 #UT10-5299	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Документ.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Документ.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация,"КодМДМГоловнойОрганизации")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Документ.ВидПродукции.Алиас);
	
	//+Макрушин Е. 29.07.2026 #UT10-5973
	Если ЗначениеЗаполнено(Документ.ВидПродукции) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.ВидПродукции, "ИспользуетсяМОД") = Истина Тогда
		СтруктураДокумента.Вставить("Кпп",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Константы.ОсновнаяОрганизация.Получить(), "КПП"));
	КонецЕсли;
	//-Макрушин Е. 29.07.2026 #UT10-5973

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ДатаТип = Новый ОписаниеТипов("Дата");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМаркировки",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ДатаПроизводства",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("СрокГодности",СтрокаТип);
	
	Для Каждого СтрокаТовары Из Документ.Товары Цикл
		
		//+Кабанов А.В. 21.08.2025 # UT10-5345 
		Если НЕ СтрокаТовары.ЧужойКИЗ И ЗначениеЗаполнено(СтрокаТовары.ШтрихКодМаркировки) И НЕ СтрокаТовары.ШтрихКодМаркировки.СрокГодности < Документ.Дата Тогда 
			
			НоваяСтрокаТТ                    = ТаблицаТоваров.Добавить(); 
			НоваяСтрокаТТ.КодСтроки          = СтрокаТовары.НомерСтроки;
			НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура,"КодМДМ"));
			НоваяСтрокаТТ.КодМаркировки      = СтрокаТовары.ШтрихКодМаркировки.ПолныйКодМаркировки.Получить();
			НоваяСтрокаТТ.ДатаПроизводства   = Формат(СтрокаТовары.ШтрихКодМаркировки.ДатаПроизводства, "ДФ=dd.MM.yyyy");
			НоваяСтрокаТТ.СрокГодности       = Формат(СтрокаТовары.ШтрихКодМаркировки.СрокГодности, "ДФ=dd.MM.yyyy");
			
		КонецЕсли;
		//+Кабанов А.В. 21.08.2025 # UT10-5345
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("Товары", МассивТоваров);
//- Пашкин О.А. 07.07.2025 #UT10-5299
	
КонецПроцедуры   

Процедура ЗаписатьЗаказНаЭмиссиюКодовМаркировкиСУЗ(Документ, СтруктураДокумента, ПеречитатьРегистры)
//+ Пашкин О.А. 07.07.2025 #UT10-5299
//+Шульман А. 08.10.2025 #UT10-5445
	ПревышенаДатаМаркировкиОстатков = (ТекущаяДата() >= Документ.ВидПродукции.ДатаОкончанияМаркировкиОстатков);   
	//-Шульман А. 08.10.2025 #UT10-5445
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Документ.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Документ.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация,"КодМДМГоловнойОрганизации")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Документ.ВидПродукции.Алиас);    
	//+Шульман А. 08.10.2025 #UT10-5445
	//СтруктураДокумента.Вставить("СпособВыпускаВОборот",  Маркировка.СпособВыпускаВОборот(Документ.СпособВводаВОборот));
	
	//+Сёмин Р.И. 21.05.2026 #UT10-5862
	//СтруктураДокумента.Вставить("СпособВыпускаВОборот",  Маркировка.СпособВыпускаВОборот(Документ.СпособВводаВОборот, ПревышенаДатаМаркировкиОстатков));
	СтруктураДокумента.Вставить("СпособВыпускаВОборот",  Маркировка.СпособВыпускаВОборот(Документ.СпособВводаВОборот, ПревышенаДатаМаркировкиОстатков, , Документ.ВидПродукции.ТолькоПеремаркировка));
	//-Сёмин Р.И. 21.05.2026 #UT10-5862
	
	//-Шульман А. 08.10.2025 #UT10-5445
	СтруктураДокумента.Вставить("СпособИзготовления",  Маркировка.СпособИзготовленияКодовМаркировки(Документ.СпособИзготовления));

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("Количество",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("GTIN",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ТипСерийногоНомера",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ТипШаблона",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("ТипКодаМаркировки",СтрокаТип);  
	
	Для Каждого СтрокаТовары Из Документ.Товары Цикл

		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура,"КодМДМ"));
		НоваяСтрокаТТ.Количество = СтрокаТовары.Количество;
		НоваяСтрокаТТ.GTIN = Строка(СтрокаТовары.GTIN);
		НоваяСтрокаТТ.ТипСерийногоНомера = Строка("OPERATOR");
		НоваяСтрокаТТ.ТипШаблона = Документ.ВидПродукции.ШаблонМаркировки;
		НоваяСтрокаТТ.ТипКодаМаркировки = "UNIT";
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("Товары", МассивТоваров);

//- Пашкин О.А. 07.07.2025 #UT10-5299

КонецПроцедуры

Процедура ЗаписатьВводВОборот(Документ, СтруктураДокумента, ПеречитатьРегистры)
//+ Пашкин О.А. 07.07.2025 #UT10-5301

	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Документ.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Документ.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация,"КодМДМГоловнойОрганизации")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Документ.ВидПродукции.Алиас); 
	
	//+Белов А. 21.04.2026 #UT10-5810
	Если Документ.СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя Тогда
		
		СтруктураДокумента.Вставить("ТипДокумента",  "LP_RETURN");  	
		СтруктураДокумента.Вставить("ПричинаВозврата",  "OWN_USE_RETURN");  	
		
	Иначе
		//-Белов А. 21.04.2026 #UT10-5810
		
		//+Шульман А. 29.10.2025 #UT10-5486     
		//СтруктураДокумента.Вставить("ТипДокумента",  "LP_INTRODUCE_OST");
		
		//+Сёмин Р.И. 28.05.2026 #UT10-5887
		//Если ТекущаяДата() >= Документ.ВидПродукции.ДатаОкончанияМаркировкиОстатков Тогда
		Если ТекущаяДата() >= Документ.ВидПродукции.ДатаОкончанияМаркировкиОстатков ИЛИ Документ.ВидПродукции.ТолькоПеремаркировка Тогда
		//-Сёмин Р.И. 28.05.2026 #UT10-5887
		
			СтруктураДокумента.Вставить("ТипДокумента",  "LK_REMARK");  
		Иначе        
			СтруктураДокумента.Вставить("ТипДокумента",  "LP_INTRODUCE_OST");  
		КонецЕсли;
		//-Шульман А. 29.10.2025 #UT10-5486
		
	КонецЕсли;

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ДатаТип = Новый ОписаниеТипов("Дата");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМаркировки",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры",СтрокаТип);
	
	Для Каждого СтрокаТовары Из Документ.Товары Цикл
		
		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура,"КодМДМ"));
		НоваяСтрокаТТ.КодМаркировки = СтрокаТовары.ШтрихКодМаркировки.КодМаркировки;
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("КодыМаркировки", МассивТоваров);

	//- Пашкин О.А. 07.07.2025 #UT10-5301
КонецПроцедуры

Процедура ЗаписатьВыводИзОборота(Документ, СтруктураДокумента, ПеречитатьРегистры)
	//+Белов А. 24.03.2026 #UT10-5761  
	
 	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Документ.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Документ.Дата);
	СтруктураДокумента.Вставить("ПометкаУдаления",  Документ.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация,"КодМДМГоловнойОрганизации")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Документ.ВидПродукции.Алиас); 
	СтруктураДокумента.Вставить("ТипДокумента",  "LK_RECEIPT");
	СтруктураДокумента.Вставить("Причина",  "OWN_USE");
	СтруктураДокумента.Вставить("ТипДокументаВыбытия",  "OTHER");
	
	//+Сёмин Р.И. 21.04.2026 #UT10-5815
	//СтруктураДокумента.Вставить("ИННПокупателя",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Основание.Контрагент, "ИНН"));
	//СтруктураДокумента.Вставить("НаименованиеДокументаВыбытия",  "Реализация товаров");
	
	Если ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СтруктураДокумента.Вставить("ИННПокупателя",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Основание.Контрагент, "ИНН"));
		СтруктураДокумента.Вставить("НаименованиеДокументаВыбытия",  "Реализация товаров");
		
	ИначеЕсли ТипЗнч(Документ.Основание) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда
		
		СтруктураДокумента.Вставить("ИННПокупателя",  "");
		СтруктураДокумента.Вставить("НаименованиеДокументаВыбытия",  "Требование накладная");
		
	КонецЕсли;
	//-Сёмин Р.И. 21.04.2026 #UT10-5815

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ДатаТип = Новый ОписаниеТипов("Дата");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки", ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМаркировки", СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры", СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("Цена", ЧислоТип);
	
	Для Каждого СтрокаТовары Из Документ.Товары Цикл
		
		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "КодМДМ"));
		НоваяСтрокаТТ.КодМаркировки = СтрокаТовары.ШтрихКодМаркировки.КодМаркировки;
		НоваяСтрокаТТ.Цена = СтрокаТовары.Цена * 100;
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("КодыМаркировки", МассивТоваров);

 //-Белов А. 24.03.2026 #UT10-5761

КонецПроцедуры

Процедура СформироватьВыгрузкуТоваровДляSM(ДатаОстатка = Неопределено) Экспорт
	
	//+Шульман А. 08.09.2025 #UT10-5415	
	СформироватьВыгрузкуТоварВПутиДляSM(ДатаОстатка);
	СформироватьВыгрузкуТоварВЗаказахПоставщикамДляSM(ДатаОстатка);
	//-Шульман А. 08.09.2025 #UT10-5415	

КонецПроцедуры

Процедура СформироватьВыгрузкуТоварВПутиДляSM(ДатаОстатка = Неопределено) Экспорт 
	
	//+Шульман А. 13.05.2025 #UT10-5232
	Если ДатаОстатка = Неопределено Тогда 
		ДатаОстатка = ТекущаяДата(); 
	КонецЕсли;                            
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ВидОстатка", "ТоварВПути");
	ПараметрыВыгрузки.Вставить("ДатаСостояния", ДатаОстатка);
	
	РезультатЗапроса = ВернутьЗапросТоварыВЗаказахПоставщикамТоварВПути(ДатаОстатка);
	ТаблицаТовара = РезультатЗапроса.Выгрузить(); 
	
	ПараметрыВыгрузки.Вставить("Товары", ТаблицаТовара);  
	
	СоздатьИсходящееСообщениеТоварыSM(ПараметрыВыгрузки);  
	//-Шульман А. 13.05.2025 #UT10-5232
	
КонецПроцедуры

Процедура СформироватьВыгрузкуТоварВЗаказахПоставщикамДляSM(ДатаОстатка = Неопределено) Экспорт 
	
	//+Шульман А. 08.09.2025 #UT10-5415	
	Если ДатаОстатка = Неопределено Тогда 
		ДатаОстатка = ТекущаяДата(); 
	КонецЕсли;                            
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ВидОстатка", "ТоварВЗаказахПоставщикам");
	ПараметрыВыгрузки.Вставить("ДатаСостояния", ДатаОстатка); 
	ПараметрыВыгрузки.Вставить("ДатаВыгрузки", ДатаОстатка);
	
	РезультатЗапроса = ВернутьЗапросТоварыВЗаказахПоставщикам(ДатаОстатка);
	ТаблицаТовара = РезультатЗапроса.Выгрузить(); 
	
	ПараметрыВыгрузки.Вставить("Товары", ТаблицаТовара);  
	
	СоздатьИсходящееСообщениеТоварыSM(ПараметрыВыгрузки);  
	//-Шульман А. 08.09.2025 #UT10-5415	  
	
КонецПроцедуры

Функция ВернутьЗапросТоварыВЗаказахПоставщикамТоварВПути(ДатаОстатка)
	
	//+Шульман А. 13.05.2025 #UT10-5232
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад КАК Склад,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент КАК Контрагент,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления КАК ДатаПоступления,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК ЗаказаноОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиСуммы
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата,    
	//+Шульман А. 02.06.2025 #UT10-5270 
	|          НЕ ЗаказПоставщику.Экспресс  
	//-Шульман А. 02.06.2025 #UT10-5270 
	|) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДатаПоступления,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Контрагент,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиСуммы.Склад.КодМДМ,
	|	ВТ_ОстаткиСуммы.Контрагент.КодМДМ,
	|	ВТ_ОстаткиСуммы.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ВТ_ОстаткиСуммы.ДатаПоступления КАК ПлановаяДатаПоставки,
	|	ВТ_ОстаткиСуммы.ЗаказаноОстаток КАК Бэкордер,
	|	0 КАК ВПути
	|ИЗ
	|	ВТ_ОстаткиСуммы КАК ВТ_ОстаткиСуммы";  
	
	Запрос.УстановитьПараметр("Дата", ДатаОстатка);
	
	Возврат Запрос.Выполнить();  
	//-Шульман А. 13.05.2025 #UT10-5232

КонецФункции // ()

Функция ВернутьЗапросТоварыВЗаказахПоставщикам(ДатаОстатка)
	
	//+Шульман А. 08.09.2025 #UT10-5415
	Запрос = Новый Запрос;
	//Марков И. 17.09.2025 #UT10-5426 Изменен выбор КодМДМ Организации в запросе
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК ЗаказаноОстаток,
	|	СУММА(ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток) КАК СуммаВзаиморасчетовОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиСуммы
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВТ_ОстаткиСуммы.ЗаказПоставщику)) КАК ЗаказПоставщикуКодМДМ,
	|	ВЫБОР
	|		КОГДА ВТ_ОстаткиСуммы.ЗаказПоставщику.Организация.КодМДМГоловнойОрганизации <> """"
	|			ТОГДА ВТ_ОстаткиСуммы.ЗаказПоставщику.Организация.КодМДМГоловнойОрганизации
	|		ИНАЧЕ ВТ_ОстаткиСуммы.ЗаказПоставщику.Организация.КодМДМ
	|	КОНЕЦ КАК ОрганизацияКодМДМ,
	|	ВТ_ОстаткиСуммы.ЗаказПоставщику.Склад.КодМДМ КАК СкладКодМДМ,
	|	ВТ_ОстаткиСуммы.ЗаказПоставщику.Контрагент.КодМДМ КАК КонтрагентКодМДМ,
	|	ВТ_ОстаткиСуммы.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ВТ_ОстаткиСуммы.Номенклатура.КодПроизводителя КАК Артикул,
	|	ВТ_ОстаткиСуммы.ЗаказаноОстаток КАК КолвоЗаказано,
	|	ВТ_ОстаткиСуммы.СуммаВзаиморасчетовОстаток КАК СуммаЗаказано
	|ИЗ
	|	ВТ_ОстаткиСуммы КАК ВТ_ОстаткиСуммы";  
	
	Запрос.УстановитьПараметр("Дата", ДатаОстатка);
	
	Возврат Запрос.Выполнить(); 
	//-Шульман А. 08.09.2025 #UT10-5415

КонецФункции // ()



///////////////////Биллинг///////////////////
Функция ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, ТипЗапроса = "POST", ЗаписыватьВЖурнал = Истина, 
	           Данные = Неопределено, ВыводитьСообщение = Истина, Тело = "") Экспорт
	
	ЗаписьЖурналаРегистрации("Биллинг_АПИ", УровеньЖурналаРегистрации.Информация,,, "Биллинг_АПИ:Запуск. " + СокрЛП(ПредставлениеЗапроса) + "");
	
	СтруктураРезультата = Новый Структура;	
	СтруктураРезультата.Вставить("Данные", Неопределено);
	СтруктураРезультата.Вставить("Результат", 2); //2 - ошибка связи с биллингом, 1 - ошибка на строне биллинга, 0 - успешно
	СтруктураРезультата.Вставить("Сообщение", "");
	
	АдресСервера = Константы.AMQP_АдресСервераБиллинга.Получить();
	
	HTTPСоединение = Новый HTTPСоединение(АдресСервера, , , , , Константы.AMQP_ТаймаутЗапросовВБиллинг.Получить(), Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса); 	
	HTTPЗапрос.Заголовки.Вставить("Cookie", "token=" + Константы.AMQP_ТокенБиллинга.Получить());
	HTTPЗапрос.Заголовки.Вставить("Cache-Control", "no-cache");  
	
	Если Тело <> "" Тогда 
		
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json"); 
		HTTPЗапрос.УстановитьТелоИзСтроки(Тело, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
	КонецЕсли;
	
	ОтветJSONСтрока = "";                                                                                                         
	ЗаписьЖурналаРегистрации("Биллинг_АПИ", УровеньЖурналаРегистрации.Информация,,, "Биллинг_АПИ:Выполнение. " + СокрЛП(ПредставлениеЗапроса) + " Текст запроса: " + СтрокаЗапроса);
	
	Попытка
				
		Если ТипЗапроса = "POST" Тогда
			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Иначе
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
		КонецЕсли;
		
		ОтветJSONСтрока = Ответ.ПолучитьТелоКакСтроку();
		
		Если ЗначениеЗаполнено(СокрЛП(ОтветJSONСтрока)) Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветJSONСтрока);
			СтруктураВозврата = ПрочитатьJSON(ЧтениеJSON);	
			
			Если СтруктураВозврата.status = "OK" Тогда
				
				СтруктураРезультата.Результат = 0;
				
				Если СтруктураВозврата.Свойство("data") Тогда
					СтруктураРезультата.Данные = СтруктураВозврата.data;	
				КонецЕсли;
				
			ИначеЕсли СтруктураВозврата.status = "ERROR" Тогда
				СтруктураРезультата.Результат = 1;
			КонецЕсли;

			Если СтруктураВозврата.Свойство("message") Тогда
				СтруктураРезультата.Сообщение = СтруктураВозврата.message;		
			КонецЕсли;
						
		КонецЕсли;
		
	Исключение
		СтруктураРезультата.Сообщение = "Ошибка связи с биллингом: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(СтруктураРезультата.Сообщение) И СтруктураРезультата.Результат = 2 Тогда
		СтруктураРезультата.Сообщение = "Ошибка связи с биллингом";	
	КонецЕсли;
	
	Если СтруктураРезультата.Результат <> 0 И ЗаписыватьВЖурнал Тогда
		ЗаписьЖурналаРегистрации("Биллинг_АПИ", УровеньЖурналаРегистрации.Информация,,, "Биллинг_АПИ:Ошибка. " + СокрЛП(ПредставлениеЗапроса) +
		"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: " + СтруктураРезультата.Сообщение + ""); 		
	КонецЕсли;
	
	Если ВыводитьСообщение И СтруктураРезультата.Результат = 2 Тогда
		#Если Клиент Тогда
			Сообщить(СтруктураРезультата.Сообщение);
		#КонецЕсли
	КонецЕсли; 
	
	ЗаписьЖурналаРегистрации("Биллинг_АПИ", УровеньЖурналаРегистрации.Информация,,, "Биллинг_АПИ:Завершение. " + СокрЛП(ПредставлениеЗапроса) 
	               + " Текст ответа: " + СокрЛП(ОтветJSONСтрока));

	Возврат СтруктураРезультата; 
	
КонецФункции

Функция ПроверкаДокументаВБиллинге(Документ, Принудительно = Ложь) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;
	
	Тело = "";
	
	Если Константы.ИспользоватьМетодV2ПроверкиСборок.Получить() Тогда
		
		СтрокаЗапроса = "/api/v2/client/assemble";
		
		ТелоСтруктура = Новый Структура; 
		ТелоСтруктура.Вставить("skip_shipment_control", ?(Принудительно, Истина, Ложь));
		ТелоСтруктура.Вставить("kontragent_mdm_id", Документ.Контрагент.КодМДМ);
		ТелоСтруктура.Вставить("agreement_mdm_id", Документ.Договор.КодМДМ);
		ТелоСтруктура.Вставить("request_id", ?(ТипЗнч(Документ) = Тип("ДокументОбъект.СборкаЗаказовПокупателя"), 
		                       Строка(Документ.ПолучитьСсылкуНового().УникальныйИдентификатор()), Строка(Документ.УникальныйИдентификатор())));
		ТелоСтруктура.Вставить("request_id_name", Документ.Номер);
		ТелоСтруктура.Вставить("request_id_date", Формат(Документ.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
		ТелоСтруктура.Вставить("app_id", Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
		
		МассивСтруктураЗаказов = Новый Массив;  
		
		ТЗ = СформироватьСтрокуЗаказов(Документ, Истина); 
		
		Для каждого СтрокаЗаказа Из ТЗ Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаЗаказа.Ссылка) Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураЗаказа = Новый Структура;
			СтруктураЗаказа.Вставить("id", Строка(СтрокаЗаказа.Ссылка.УникальныйИдентификатор()));
			СтруктураЗаказа.Вставить("amount", СтрокаЗаказа.Сумма); 
			СтруктураЗаказа.Вставить("name", СтрокаЗаказа.Ссылка.Номер); 
			СтруктураЗаказа.Вставить("date", Формат(СтрокаЗаказа.Ссылка.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""")); 
			
			МассивСтруктураЗаказов.Добавить(СтруктураЗаказа);

		КонецЦикла;
		
		ТелоСтруктура.Вставить("orders", МассивСтруктураЗаказов);
		
		Тело = ОбщегоНазначения.ВернутьJSON(ТелоСтруктура);	
		
	Иначе
		
		СтрокаЗапроса = "/api/v1/client/assemble?kontragent_mdm_id=" + Документ.Контрагент.КодМДМ + 
					"&agreement_mdm_id=" + Документ.Договор.КодМДМ + 
					"&app_id=" + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()) + 
					"&request_id=" + ?(ТипЗнч(Документ) = Тип("ДокументОбъект.СборкаЗаказовПокупателя"), 
						Строка(Документ.получитьСсылкуНового().УникальныйИдентификатор()),
						Строка(Документ.УникальныйИдентификатор())) + 
					"&request_id_name=" + Документ.Номер + 
					"&request_id_date=" + Формат(Документ.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""") +
					?(Принудительно, "&skip_shipment_control=Y", "") + 
					СформироватьСтрокуЗаказов(Документ);

	КонецЕсли;	
						
	ПредставлениеЗапроса = "Проверка документа в Биллинге";
			
	Для Сч = 1 По КолвоПопыток Цикл		
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса,,, Документ.Ссылка,, Тело);
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли;  
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;
		
	КонецЦикла; 		
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		Для каждого Строка из СтруктураРезультата.Данные Цикл

			Если Не Строка.status Тогда	

				СтруктураРезультата.Результат = 1;
				СтруктураРезультата.Сообщение = "По клиенту " + Документ.Контрагент + " сборка не создана. По данным Биллинга у клиента имеется задолженность";
				Прервать; 
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли; 

	
	Если СтруктураРезультата.Результат = 2 Тогда
		
		Попытка
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			ДокументОбъект.ДополнительныеСвойства.Вставить("api_v1_client_assemble", Истина);
			ДокументОбъект.ДополнительныеСвойства.Вставить("Принудительно", Принудительно);
			
			ДополнЗаголовки = Новый СписокЗначений;
			ДополнЗаголовки.Добавить("DirectSaveDocument", "true");
			СоздатьИсходящееСообщение(ДокументОбъект, Ложь, Ложь, Неопределено, ДополнЗаголовки); 
			
		Исключение
			ЗаписьЖурналаРегистрации("СозданиеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не записано исходящее сообщение для документа: " + Строка(ДокументОбъект) + Символы.ПС + ОписаниеОшибки());			
		КонецПопытки;
		
		ДобавитьЗаписьВНеотправленныеДокументы(Документ.Ссылка, Ложь, СтруктураРезультата.Сообщение); 
		
	КонецЕсли;

	Возврат СтруктураРезультата;                                           
	
КонецФункции
                                    
Функция ПодтверждениеДокументаВБиллинге(Документ) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;
	
	СтрокаЗапроса = "/api/v1/client/confirm-request?request_id=" + Документ.Ссылка.УникальныйИдентификатор() + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()) + "&request_id_name=" + Документ.Номер;
	ПредставлениеЗапроса = "Подтверждение документа в Биллинге";     
	
	Для Сч = 1 По КолвоПопыток Цикл		
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса,,, Документ.Ссылка);  
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли;  
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 		

	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		Для каждого Строка из СтруктураРезультата.Данные Цикл
			
			Если Не Строка.confirmed тогда				
				
				СтруктураРезультата.Результат = 1;
				СтруктураРезультата.Сообщение = "По клиенту " + Документ.Контрагент + " сборка не подтверждена. По данным Биллинга у клиента имеется задолженность";
				Прервать; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли;

	Если СтруктураРезультата.Результат = 2 Тогда
		ДобавитьЗаписьВНеотправленныеДокументы(Документ.Ссылка, Истина, СтруктураРезультата.Сообщение);
	КонецЕсли;       
	
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция ОтменитьДокументБлокировкиВБиллинге(Документ) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;
	
	СтрокаЗапроса = "/api/v1/client/cancel-request?request_id=" + Документ.Ссылка.УникальныйИдентификатор() + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	ПредставлениеЗапроса = "Отменить документ блокировки в Биллинге";
		
	Для Сч = 1 По КолвоПопыток Цикл		
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса,,, Документ.Ссылка);	
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли;  
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;
		
	КонецЦикла; 			
	
	Если СтруктураРезультата.Результат = 2 Тогда
		ДобавитьЗаписьВНеотправленныеДокументы(Документ.Ссылка, Ложь, СтруктураРезультата.Сообщение);
	КонецЕсли;
	
	Возврат СтруктураРезультата; 
	
КонецФункции 

Функция ОтправитьДокументКорректировкиВБиллинг(Документ) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтрокаЗапроса = "/api/v1/client/assemble-change?request_id=" + Документ.СборкаЗаказовПокупателя.УникальныйИдентификатор() + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()) + "&correction_request_id=" + Строка(Документ.УникальныйИдентификатор()) 
				  + СформироватьСтрокуКорректировкиЗаказов(Документ);
	ПредставлениеЗапроса = "Отправить документ корректировки в Биллинг";
	
	Для Сч = 1 По КолвоПопыток Цикл		
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса,,, Документ.Ссылка);	
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если СтруктураРезультата.Результат = 2 Тогда 
		
		Попытка
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			СоздатьИсходящееСообщение(ДокументОбъект, Ложь, Ложь); 
			
		Исключение
			ЗаписьЖурналаРегистрации("СозданиеСообщений.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не записано исходящее сообщение для документа: " + Строка(ДокументОбъект) + Символы.ПС + ОписаниеОшибки());			
		КонецПопытки;
		
		ДобавитьЗаписьВНеотправленныеДокументы(Документ.Ссылка, Ложь, СтруктураРезультата.Сообщение);    
		
	КонецЕсли;
	
	Возврат СтруктураРезультата; 
		                                                      
КонецФункции

Функция ОтменитьДокументКорректировкиБлокировкиВБиллинге(Документ) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
		
	СтрокаЗапроса = "/api/v1/client/cancel-correction-request?correction_request_id=" + Документ.Ссылка.УникальныйИдентификатор() + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	ПредставлениеЗапроса = "Отменить документ корректировки блокировки в Биллинге";
		
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса,,, Документ.Ссылка);
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;  
		
	КонецЦикла; 			
	
	Если СтруктураРезультата.Результат = 2 Тогда
		ДобавитьЗаписьВНеотправленныеДокументы(Документ.Ссылка, Ложь, СтруктураРезультата.Сообщение);
	КонецЕсли; 
	
	Возврат СтруктураРезультата; 

КонецФункции

Функция ПолучитьНеоплаченныеДокументы(Контрагент, ДоговорКонтрагента, ЗаписыватьВЖурнал = Истина) Экспорт 
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтрокаЗапроса = "/api/v1/client/debt-documents?kontragent_mdm_id=" + Контрагент.КодМДМ+"&agreement_mdm_id=" + ДоговорКонтрагента.КодМДМ + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	ПредставлениеЗапроса = "Получение неоплаченных документов";
		
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "GET", ЗаписыватьВЖурнал, Контрагент.Ссылка);
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 			
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		НеоплаченныеДокументы = Новый ТаблицаЗначений;
		НеоплаченныеДокументы.Колонки.Добавить("Контрагент");
		НеоплаченныеДокументы.Колонки.Добавить("ДоговорКонтрагента");
		НеоплаченныеДокументы.Колонки.Добавить("Документ");
		НеоплаченныеДокументы.Колонки.Добавить("ДатаДокумента");
		НеоплаченныеДокументы.Колонки.Добавить("Сумма");
		НеоплаченныеДокументы.Колонки.Добавить("ПросроченоДней");
		НеоплаченныеДокументы.Колонки.Добавить("Грузополучатель");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимоеЧислоДнейЗадолженности");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимаяСуммаЗадолженности");
		
		ИмяБазы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
		
		БылиОшибки = Ложь;
		ТекстОшибок = "";
		
		Для каждого Долг ИЗ СтруктураРезультата.Данные Цикл
						
			Попытка
				
				Дата = ПреобразоватьДатуБиллинг(Долг.Date);
				
				НоваяСтрока = НеоплаченныеДокументы.Добавить();
				НоваяСтрока.Контрагент = Контрагент;
				НоваяСтрока.ДоговорКонтрагента = ДоговорКонтрагента;
				
				ИмяБазыБиллинг = Долг.AppID;
				ТипДокумента = "";
				ТипДокументаПредставление = "";
				
				Если НРег(Долг.TypeCode) = "realization" Тогда
					
					ТипДокумента = "РеализацияТоваровУслуг";
					ТипДокументаПредставление = Метаданные.Документы[ТипДокумента].Синоним; 
					
				КонецЕсли;
				
				Если НРег(ИмяБазыБиллинг) = НРег(Строка(ИмяБазы)) ИЛИ НРег(ИмяБазыБиллинг) = НРег(Строка(Константы.База.Получить())) Тогда
					
					Если ТипДокумента <> "" Тогда
						
						НоваяСтрока.Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Долг.SourceID));
						
						ОбъектДокумент = НоваяСтрока.Документ.ПолучитьОбъект();
						
						Если ОбъектДокумент = Неопределено Тогда
							НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.Number + " от " + Формат(Дата, "ДЛФ=DT") + " - документ не найден";	
						Иначе  
							
							Если ТипДокумента = "РеализацияТоваровУслуг" Тогда 
								НоваяСтрока.Грузополучатель = НоваяСтрока.Документ.Грузополучатель;
							КонецЕсли;   
							
						КонецЕсли;
						
					КонецЕсли; 									
					
				Иначе
					НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.Number + " от " + Формат(Дата, "ДЛФ=DT") + " - " + ИмяБазыБиллинг;
				КонецЕсли;	
				
				НоваяСтрока.ДатаДокумента = Дата;
				
				НоваяСтрока.Сумма = -Число(Долг.Amount);
				НоваяСтрока.ПросроченоДней = -Окр((ПреобразоватьДатуБиллинг(Долг.PayDelayDate) - НачалоДня(ТекущаяДата())) / 86400, 0, РежимОкругления.Окр15как20);
				
			Исключение
				
				БылиОшибки = Истина;
				ТекстОшибок = ТекстОшибок + Символы.ПС + ОписаниеОшибки();
				
			КонецПопытки;
			
		КонецЦикла;	
		
		Если БылиОшибки И ЗаписыватьВЖурнал Тогда
			
			ЗаписьЖурналаРегистрации("РаботаСБиллингом.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: " + ТекстОшибок + Символы.ПС + "Текст запроса: " + СтрокаЗапроса);
			
		КонецЕсли;
		
		СтруктураРезультата.Данные = НеоплаченныеДокументы;		
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
		
КонецФункции

Функция ПолучитьДанныеПоКонтрагенту(Контрагент, ДоговорКонтрагента) Экспорт

	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтрокаЗапроса = "/api/v1/client/get-data?kontragent_mdm_id=" + Контрагент.КодМДМ + "&agreement_mdm_id=" + ДоговорКонтрагента.КодМДМ + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	ПредставлениеЗапроса = "Получение данных по контрагенту";
	
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "GET",, Контрагент.Ссылка);
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли;  
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 		
		
	Возврат СтруктураРезультата;
	
КонецФУнкции

Функция ПолучитьДанныеПоМассивуДоговоров(МассивДоговоров) Экспорт 

	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;      
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("agreements", МассивДоговоров);

	СтрокаЗапроса = "/api/v1/client/get-data-batch";
	ПредставлениеЗапроса = "Получение данных по контрагенту";
		
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "POST",,,, Чеки.ВернутьJSON(СтруктураЗапроса));
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			AMQP_РаботаСДокументами.ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 			
		
	Возврат СтруктураРезультата;
	
КонецФУнкции 

Функция ПолучитьДанныеПоМассивуДоговоров_V2(МассивДоговоров,МассивЗапрашиваемыхПараметров = Неопределено) Экспорт  

	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;      
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("agreements", МассивДоговоров);
	
	Если НЕ МассивЗапрашиваемыхПараметров = Неопределено И НЕ МассивЗапрашиваемыхПараметров.Количество() = 0 Тогда
		СтруктураЗапроса.Вставить("fields", МассивЗапрашиваемыхПараметров);
	КонецЕсли;

	СтрокаЗапроса = "/api/v1/client/get-data-batch-v2";
	ПредставлениеЗапроса = "Получение данных по контрагенту";
		
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "POST",,,, Чеки.ВернутьJSON(СтруктураЗапроса));
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			AMQP_РаботаСДокументами.ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 			
		
	Возврат СтруктураРезультата;
	
КонецФУнкции 

Функция ПолучитьЗаблокированныеЗаказы(Контрагент, ДоговорКонтрагента, ЗаписыватьВЖурнал = Истина) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтрокаЗапроса = "/api/v1/client/hold-orders?kontragent_mdm_id=" + Контрагент.КодМДМ + "&agreement_mdm_id=" + ДоговорКонтрагента.КодМДМ + "&app_id=" 
	              + Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	ПредставлениеЗапроса = "Получение заблокированных заказов";
			
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "GET", , Контрагент.Ссылка, Ложь);	
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли;  
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли; 
		
	КонецЦикла; 			
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		ЗаблокированныеЗаказы = Новый ТаблицаЗначений;
		ЗаблокированныеЗаказы.Колонки.Добавить("Контрагент");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДоговорКонтрагента");
		ЗаблокированныеЗаказы.Колонки.Добавить("Документ");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДатаДокумента");
		ЗаблокированныеЗаказы.Колонки.Добавить("Сумма");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДопустимоеЧислоДнейЗадолженности");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДопустимаяСуммаЗадолженности");  
		
		ИмяБазы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
		
		БылиОшибки = Ложь;
		ТекстОшибок = "";
		
		Для каждого Долг ИЗ СтруктураРезультата.Данные Цикл
			
			Попытка
				
				Дата = ПреобразоватьДатуБиллинг(Долг.OrderIdDate);
				
				НоваяСтрока = ЗаблокированныеЗаказы.Добавить();
				НоваяСтрока.Контрагент = Контрагент;
				НоваяСтрока.ДоговорКонтрагента = ДоговорКонтрагента;
				
				ИмяБазыБиллинг = Долг.AppID;
				
				ТипДокумента = "ЗаказПокупателя";
				ТипДокументаПредставление = Метаданные.Документы.ЗаказПокупателя.Синоним;
				
				Если НРег(ИмяБазыБиллинг) = НРег(Строка(ИмяБазы)) ИЛИ НРег(ИмяБазыБиллинг) = НРег(Строка(Константы.База.Получить())) Тогда
					
					Если ТипДокумента <> "" Тогда       					
						
						НоваяСтрока.Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Долг.SourceOrderID));
						
						ОбъектДокумент = НоваяСтрока.Документ.ПолучитьОбъект();
						
						Если ОбъектДокумент = Неопределено Тогда
							НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.OrderIdName + " от " + Формат(Дата, "ДЛФ=DT") + " - документ не найден";	
						Иначе
							
							Если ТипДокумента = "РеализацияТоваровУслуг" Тогда 
								НоваяСтрока.Грузополучатель = НоваяСтрока.Документ.Грузополучатель;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли; 
					
				Иначе
					НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.OrderIdName + " от " + Формат(Дата, "ДЛФ=DT") + " - " + ИмяБазыБиллинг;
				КонецЕсли;	
				
				НоваяСтрока.ДатаДокумента = Дата;									
				НоваяСтрока.Сумма = Число(Долг.AmountHoldSubRealization);
				
			Исключение
				
				БылиОшибки = Истина;
				ТекстОшибок = ТекстОшибок + Символы.ПС + ОписаниеОшибки();
				
			КонецПопытки;
			
		КонецЦикла;
		
		Если БылиОшибки И ЗаписыватьВЖурнал Тогда
			
			ЗаписьЖурналаРегистрации("РаботаСБиллингом.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: " + ТекстОшибок + Символы.ПС + "Текст запроса: " + СтрокаЗапроса);
			
		КонецЕсли;
		
		СтруктураРезультата.Данные = ЗаблокированныеЗаказы; 
		
	КонецЕсли;
	
	Возврат СтруктураРезультата;
		
КонецФункции

Функция ПолучитьЗаблокированныеЗаказы_V2(МассивДоговоров, ЗаписыватьВЖурнал = Истина) Экспорт
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2; 
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("agreements", МассивДоговоров);
	
	СтрокаЗапроса = "/api/v2/client/hold-orders";
	ПредставлениеЗапроса = "Получение заблокированных заказов";
		
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "POST",,,, Чеки.ВернутьJSON(СтруктураЗапроса));
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;      		
		
	КонецЦикла; 		
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		ЗаблокированныеЗаказы = Новый ТаблицаЗначений;
		ЗаблокированныеЗаказы.Колонки.Добавить("Контрагент");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДоговорКонтрагента");
		ЗаблокированныеЗаказы.Колонки.Добавить("Документ");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДатаДокумента");
		ЗаблокированныеЗаказы.Колонки.Добавить("Сумма");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДопустимоеЧислоДнейЗадолженности");
		ЗаблокированныеЗаказы.Колонки.Добавить("ДопустимаяСуммаЗадолженности"); 
		ЗаблокированныеЗаказы.Колонки.Добавить("Грузополучатель");

		
		ИмяБазы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
		
		БылиОшибки = Ложь;
		ТекстОшибок = "";
		
		Для Каждого СтрокаДанных ИЗ СтруктураРезультата.Данные Цикл
			
			Если НЕ СтрокаДанных.hold_orders.Количество() = 0 Тогда
				
				Для Каждого Долг Из  СтрокаДанных.hold_orders Цикл
					
					Попытка
						
						Дата = ПреобразоватьДатуБиллинг(Долг.order_id_date);
						
						НоваяСтрока = ЗаблокированныеЗаказы.Добавить();
						НоваяСтрока.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СтрокаДанных.kontragent_mdm_id);
						НоваяСтрока.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СтрокаДанных.agreement_mdm_id);
						
						ИмяБазыБиллинг = Долг.app_id;
						ТипДокумента = "ЗаказПокупателя";
						ТипДокументаПредставление = Метаданные.Документы.ЗаказПокупателя.Синоним;
						
						Если НРег(ИмяБазыБиллинг) = НРег(Строка(ИмяБазы)) ИЛИ НРег(ИмяБазыБиллинг) = НРег(Строка(Константы.База.Получить())) Тогда
							
							Если ТипДокумента <> "" Тогда       					
								
								НоваяСтрока.Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Долг.source_order_id));
								ОбъектДокумент = НоваяСтрока.Документ.ПолучитьОбъект();
								
								Если ОбъектДокумент = Неопределено Тогда
									НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.order_id_name + " от " + Формат(Дата, "ДЛФ=DT") + " - документ не найден";	
								Иначе
									НоваяСтрока.Грузополучатель = НоваяСтрока.Документ.Грузополучатель;
								КонецЕсли; 	
								
							КонецЕсли; 
							
						Иначе
							НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.order_id_name + " от " + Формат(Дата, "ДЛФ=DT") + " - " + ИмяБазыБиллинг;
						КонецЕсли;	
						
						НоваяСтрока.ДатаДокумента = Дата;									
						НоваяСтрока.Сумма = Число(Долг.amount); 
						
					Исключение   
						
						БылиОшибки = Истина;
						ТекстОшибок = ТекстОшибок + Символы.ПС + ОписаниеОшибки();   
						
					КонецПопытки;
					
				КонецЦикла; 
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если БылиОшибки И ЗаписыватьВЖурнал Тогда
			ЗаписьЖурналаРегистрации("РаботаСБиллингом.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: "+ ТекстОшибок + Символы.ПС + "Текст запроса: " + СтрокаЗапроса);
		КонецЕсли; 
		
		СтруктураРезультата.Данные = ЗаблокированныеЗаказы;    
		
	КонецЕсли;  
	
	Возврат СтруктураРезультата;   
	
КонецФункции

Функция ПолучитьНеоплаченныеДокументы_V2(МассивДоговоров, ЗаписыватьВЖурнал = Истина) Экспорт 
	
	КолвоПопыток = 2;
	ЗадержкаПоВремени = 2;              
	
	СтруктураЗапроса = Новый Структура();
	СтруктураЗапроса.Вставить("agreements", МассивДоговоров);
	СтруктураЗапроса.Вставить("date_from" , СокрЛП(Формат(ДобавитьМесяц(ТекущаяДата(), -2), "ДЛФ=D")));
	СтруктураЗапроса.Вставить("date_to"   , Формат(ТекущаяДата(), "ДЛФ=D"));

	СтрокаЗапроса = "/api/v2/client/debt-documents";
	ПредставлениеЗапроса = "Получение неоплаченных документов";
	
	Для Сч = 1 По КолвоПопыток Цикл				
		
		СтруктураРезультата = AMQP_РаботаСДокументами.ОтправитьЗапросВБиллинг(СтрокаЗапроса, ПредставлениеЗапроса, "POST",,,, Чеки.ВернутьJSON(СтруктураЗапроса));
		
		Если СтруктураРезультата.Результат < 2 Тогда
			Прервать;
		КонецЕсли; 
		
		Если СтруктураРезультата.Результат = 2 И Сч <> КолвоПопыток Тогда
			AMQP_РаботаСДокументами.ПаузаИсполнения(ЗадержкаПоВремени);	
		КонецЕсли;  
		
	КонецЦикла; 		
	
	Если СтруктураРезультата.Данные <> Неопределено И ТипЗнч(СтруктураРезультата.Данные) = Тип("Массив") Тогда
		
		НеоплаченныеДокументы = Новый ТаблицаЗначений;
		НеоплаченныеДокументы.Колонки.Добавить("Контрагент");
		НеоплаченныеДокументы.Колонки.Добавить("ДоговорКонтрагента");
		НеоплаченныеДокументы.Колонки.Добавить("Документ");
		НеоплаченныеДокументы.Колонки.Добавить("ДатаДокумента");
		НеоплаченныеДокументы.Колонки.Добавить("Сумма");
		НеоплаченныеДокументы.Колонки.Добавить("ПросроченоДней");
		НеоплаченныеДокументы.Колонки.Добавить("Грузополучатель");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимоеЧислоДнейЗадолженности");
		НеоплаченныеДокументы.Колонки.Добавить("ДопустимаяСуммаЗадолженности");
		
		ИмяБазы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
		
		БылиОшибки = Ложь;
		ТекстОшибок = "";
		
		Для Каждого Долг ИЗ СтруктураРезультата.Данные Цикл
			
			Попытка
				
				Дата = XmlЗначение(Тип("Дата"), Долг.date);
				
				НоваяСтрока = НеоплаченныеДокументы.Добавить();
				НоваяСтрока.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", Долг.kontragent_mdm_id);
				НоваяСтрока.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", Долг.agreement_mdm_id);
				
				ИмяБазыБиллинг = Долг.app_id;
				ТипДокумента = "";
				ТипДокументаПредставление = "";
				
				Если НРег(Долг.Type_Code) = "realization" Тогда
					
					ТипДокумента = "РеализацияТоваровУслуг";
					ТипДокументаПредставление = Метаданные.Документы[ТипДокумента].Синоним;
					
				КонецЕсли;
				
				Если НРег(ИмяБазыБиллинг) = НРег(Строка(ИмяБазы)) ИЛИ НРег(ИмяБазыБиллинг) = НРег(Строка(Константы.База.Получить())) Тогда
					
					Если ТипДокумента <> "" Тогда
						
						НоваяСтрока.Документ = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(Долг.source_id));
						ОбъектДокумент = НоваяСтрока.Документ.ПолучитьОбъект();
						
						Если ОбъектДокумент = Неопределено Тогда
							НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.number + " от " + Формат(Дата, "ДЛФ=DT") + " - документ не найден";	
						Иначе
							НоваяСтрока.Грузополучатель = НоваяСтрока.Документ.Грузополучатель;
						КонецЕсли; 
						
					КонецЕсли; 
					
				Иначе
					НоваяСтрока.Документ = ТипДокументаПредставление + " " + Долг.number + " от " + Формат(Дата, "ДЛФ=DT") + " - " + ИмяБазыБиллинг;
				КонецЕсли;
				
				НоваяСтрока.ДатаДокумента = Дата;
				НоваяСтрока.Сумма = -Число(Долг.amount);
				НоваяСтрока.ПросроченоДней = Долг.overdue_days;  
				
			Исключение
				БылиОшибки = Истина;
				ТекстОшибок = ТекстОшибок + Символы.ПС + ОписаниеОшибки();
			КонецПопытки; 
			
		КонецЦикла;	
		
		Если БылиОшибки И ЗаписыватьВЖурнал Тогда
			ЗаписьЖурналаРегистрации("РаботаСБиллингом.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Ошибка выполнения запроса: " + ПредставлениеЗапроса + Символы.ПС + "Текст ошибки: " + ТекстОшибок + Символы.ПС + "Текст запроса: " + СтрокаЗапроса);
		КонецЕсли;
		
		СтруктураРезультата.Данные = НеоплаченныеДокументы;	
		
	КонецЕсли;     
	
	Возврат СтруктураРезультата; 
	
КонецФункции

Функция СформироватьСтрокуКорректировкиЗаказов(Документ, ПолучитьТЗ = Ложь ) Экспорт
	
	Рез = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ЗаказПокупателя",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));

	Т1 = Документ.Товары.Выгрузить(,"ЗаказПокупателя,Номенклатура,Количество");
	Т1.Свернуть("ЗаказПокупателя,Номенклатура","Количество");
	
	Для каждого стр из Т1 Цикл
		
		Строка = Тз.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Стр);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ЗаказПокупателя,
	|	ТЗ.Номенклатура,
	|	ТЗ.Количество                           
	|ПОМЕСТИТЬ ИсхТабл
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.Ссылка,
	|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	|	СУММА(ЗаказПокупателяТовары.Сумма) / СУММА(ЗаказПокупателяТовары.Количество) КАК ЦенаЗаОднуНоменклатуру,
	|	СУММА(ЗаказПокупателяТовары.Сумма) / СУММА(ЗаказПокупателяТовары.Количество) * МАКСИМУМ(ИсхТабл.Количество) КАК Сумма	
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	ИсхТабл КАК ИсхТабл
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ИсхТабл.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
	|			И ИсхТабл.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	СУММА(ВТ.Сумма) КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);

	Если ПолучитьТЗ Тогда
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;                                                  
	
	Выб = Запрос.Выполнить().Выбрать();
	Сч = 0;  
	
	Пока Выб.Следующий() Цикл
		
		Рез = Рез + "&transactions[" + Строка(сч) + "][source_order_id]=" + Выб.Ссылка.УникальныйИдентификатор() + "&transactions[" + Строка(сч) 
		    + "][amount]=-" + ПреобразоватьЧисло(Выб.Сумма);
		сч = сч + 1; 
		
	КонецЦикла;  
	
	Возврат Рез;
	
КонецФункции

Процедура ДобавитьЗаписьВНеотправленныеДокументы(Документ, Проведение, Сообщение = "") Экспорт
	
	Рег = РегистрыСведений.НеотправленныеВБиллингДокументы.СоздатьНаборЗаписей();
	Рег.Отбор.Документ.Установить(Документ);
	Рег.Отбор.Проведение.Установить(Проведение);
	Рег.Прочитать();
	
	Если Рег.Количество() = 0 тогда
		
		Запись = Рег.Добавить();
		Запись.Документ = Документ;
		Запись.Проведение = Проведение;
		
	Иначе
		Запись = Рег[0];
	КонецЕсли;
	
	Запись.Сообщение = Сообщение;
	
	Запись.Дата = ТекущаяДата();
	Рег.Записать();
	
КонецПроцедуры

Функция СформироватьСтрокуЗаказов(Документ, ПолучитьТЗ = Ложь) Экспорт
	
	Рез = "";
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Т1 = Документ.Заказано.Выгрузить(,"Заказ,Номенклатура,Количество");
	Т1.Свернуть("Заказ,Номенклатура","Количество");
	
	Для каждого стр из Т1 Цикл
		
		Строка = Тз.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Стр);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.Заказ,
	               |	ТЗ.Номенклатура,
	               |	ТЗ.Количество
	               |ПОМЕСТИТЬ ИсхТабл
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаказПокупателяТовары.Номенклатура,
	               |	ЗаказПокупателяТовары.Ссылка,
	               |	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	               |	СУММА(ЗаказПокупателяТовары.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ТаблТов
	               |ИЗ
	               |	ИсхТабл КАК ИсхТабл
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ПО ИсхТабл.Заказ = ЗаказПокупателяТовары.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказПокупателяТовары.Ссылка,
	               |	ЗаказПокупателяТовары.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблТов.Ссылка,
	               |	ТаблТов.Номенклатура,
	               |	СУММА(ТаблТов.Количество) КАК Количество,
	               |	СУММА(ТаблТов.Сумма / ТаблТов.Количество * ИсхТабл.Количество) КАК Сумма
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	ИсхТабл КАК ИсхТабл
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблТов КАК ТаблТов
	               |		ПО ИсхТабл.Номенклатура = ТаблТов.Номенклатура
	               |			И ИсхТабл.Заказ = ТаблТов.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТаблТов.Номенклатура,
	               |	ТаблТов.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Ссылка,
	               |	СУММА(ВТ.Сумма) КАК Сумма
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Ссылка";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
		
	Если ПолучитьТЗ Тогда
		Возврат Запрос.Выполнить().Выгрузить();	
	КонецЕсли; 			
	
	Выб = Запрос.Выполнить().Выбрать();
	Сч = 0;
	
	Пока Выб.Следующий() Цикл

		Если ЗначениеЗаполнено(Выб.Ссылка) Тогда		
			
			Рез = Рез + 
			      "&orders[" + Строка(сч) + "][order_id]=" + Выб.Ссылка.УникальныйИдентификатор() +
			      "&orders[" + Строка(сч) + "][amount]=" + ПреобразоватьЧисло(Выб.Сумма)+
			      "&orders[" + Строка(сч) + "][order_id_name]=" + Выб.Ссылка.Номер + 
			      "&orders[" + Строка(сч) + "][order_id_date]=" + Формат(Выб.Ссылка.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс""");
			сч = сч + 1;	
			
		КонецЕсли; 	
	
	КонецЦикла;
	
	Возврат Рез; 
	
КонецФункции

Функция ПолучитьДолгПоДоговору(КодМДМДоговора,ПолучилиИзБиллинга = Истина) Экспорт
	
	ДолгПоДоговору = 0;
	
	МассивДоговоров = Новый  Массив;
	МассивДоговоров.Добавить(КодМДМДоговора);
	
	МассивЗапрашиваемыхПараметров = Новый Массив;
	МассивЗапрашиваемыхПараметров.Добавить("document_sum");
	
	СтруктураРезультатаДанныеКонтрагента = ПолучитьДанныеПоМассивуДоговоров_V2(МассивДоговоров,МассивЗапрашиваемыхПараметров); 
	
	Если СтруктураРезультатаДанныеКонтрагента.Результат = 0 Тогда                                                     		
		
		Если СтруктураРезультатаДанныеКонтрагента.Данные <> Неопределено И ТипЗнч(СтруктураРезультатаДанныеКонтрагента.Данные) = Тип("Массив") Тогда	
			
			ДанныеМассив = СтруктураРезультатаДанныеКонтрагента.Данные;                                                   			
			ТаблицаДанныхДолговБиллинг = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ДанныеМассив);
			
			Если НЕ ТаблицаДанныхДолговБиллинг.Количество() = 0 Тогда
				ДолгПоДоговору = ТаблицаДанныхДолговБиллинг.Итог("document_sum") * -1;
			КонецЕсли; 
			
		Иначе
			ПолучилиИзБиллинга = Ложь;		
		КонецЕсли;	
		
	Иначе
		ПолучилиИзБиллинга = Ложь;		
	КонецЕсли;             
	
	Возврат ДолгПоДоговору;

КонецФункции

Функция ПовторноВыгрузитьСборкиВБиллинг(НомерЗаказаКлиента, ИдентификаторЗаказа, ИдентификаторКонтрагента) Экспорт 
	
	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЗаказа));	
	
	Если ЗаказПокупателя.ПолучитьОбъект() = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли; 
	                                                    
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИдентификаторКонтрагента);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Сборка
	|ПОМЕСТИТЬ ВТСборка
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|ГДЕ
	|	ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|	И ТоварыВСборкеОбороты.ЗаказПокупателя = &ЗаказПокупателя
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Регистратор КАК ДокументЗаписи,
	|	ВЫБОР
	|		КОГДА ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректировка,
	|	ТоварыВСборкеОбороты.Сборка КАК Сборка,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ КАК Контрагент,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ КАК Договор,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер КАК Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата КАК Дата,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	СУММА(ТоварыВСборкеОбороты.СуммаСобрано) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСборка КАК ВТСборка
	|		ПО ТоварыВСборкеОбороты.Сборка = ВТСборка.Сборка
	|ГДЕ
	|	(ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|			ИЛИ ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя)
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка,
	|	ТоварыВСборкеОбороты.Контрагент,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата,
	|	ТоварыВСборкеОбороты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ЭтоКорректировка
	|ИТОГИ ПО
	|	Сборка";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
			
	РезультатЗапроса = Запрос.Выполнить();
	Попытка
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		Иначе
			
			ВыборкаСборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сборка");								       
			
			Пока ВыборкаСборка.Следующий() Цикл
				
				ПроверкаДокументаВБиллинге(ВыборкаСборка.Сборка, Истина);
				ПодтверждениеДокументаВБиллинге(ВыборкаСборка.Сборка);
				
				Выборка = ВыборкаСборка.Выбрать();
				
				Пока Выборка.Следующий() Цикл										
					
					Если Выборка.ЭтоКорректировка  Тогда
						ОтправитьДокументКорректировкиВБиллинг(Выборка.ДокументЗаписи);	
					КонецЕсли; 										
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат Истина;
		
	Исключение 
		Возврат Ложь;
	КонецПопытки; 

КонецФункции


///////////////////Вспомогательные процедуры///////////////////
Функция ДатуВTimestamp(Знач пДата = Неопределено) Экспорт
	
	Если ТипЗнч(пДата) = Тип("Дата") Тогда
		пДата = УниверсальноеВремя(пДата);	
	КонецЕсли;
	
	Возврат Формат(Число(?(ТипЗнч(пДата) = Тип("Дата"), пДата, УниверсальноеВремя(ТекущаяДата())) - Дата("19700101")), "ЧН=0; ЧГ=0");
	
КонецФункции

Процедура ОповеститьСерверМониторинга(Успешно, ЗаписыватьВЖурналОшибку = Истина, ИсходящееСообщение = Неопределено, ТекстОшибки = "", НомерСообщения = "") Экспорт 
	
КонецПроцедуры

Функция ПолучитьКодПрикладнойСистемы()
	
	Выборка = Справочники.ПодпискиНаОчередиСообщений.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Лев(Выборка.ИмяОчереди, Найти(Выборка.ИмяОчереди, ".") - 1);
	Иначе
		Возврат "Test";
	КонецЕсли;
	
КонецФункции

Функция ЭтоСсылка(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьРеквизитДокументаВСтруктуру(Структура, Документ, ИмяРеквизита, ИмяРеквизитаДоп = "", Представление = "") 	
		
	Если ОбщегоНазначения.ЕстьРеквизитДокумента(ИмяРеквизита, Документ.Метаданные()) Тогда
		
		Значение = Документ[ИмяРеквизита];
		ЭтоСсылка = ЭтоСсылка(Значение);			
		
		Если Не ЭтоСсылка Тогда
			Структура.Вставить(?(ЗначениеЗаполнено(ИмяРеквизитаДоп), ИмяРеквизитаДоп, ИмяРеквизита), Значение);	
		Иначе 
			
			Если ЗначениеЗаполнено(ИмяРеквизитаДоп) Тогда 
				
				ЗначениеДоп = Значение[ИмяРеквизитаДоп];  					   					
				Структура.Вставить(?(ЗначениеЗаполнено(Представление), Представление, ИмяРеквизитаДоп), ЗначениеДоп);
				
			КонецЕсли; 
			
		КонецЕсли;   
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПрисвоитьШтрихКод(Владелец) Экспорт
	
	ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	ТекЗапись.Владелец = Владелец;
	ТекЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	ШК = РаботаСТорговымОборудованием.СформироватьШтрихКод();
	ТекЗапись.Штрихкод = ?(ШК = Неопределено, "", ШК); 
	
	Попытка
		
		ТекЗапись.Записать();
		Возврат Истина; 
		
	Исключение
		Возврат Ложь;
	КонецПопытки;    	
	
КонецФУнкции

Процедура ПаузаИсполнения(Секунд) Экспорт	
	
	Перем ИмяВременногоФайла;
	
	//имя файла, куда сохраним скрипт
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("vbs");
	
	Попытка
		
		Скрипт = Новый ТекстовыйДокумент;
		Скрипт.УстановитьТекст("WScript.sleep " + XMLСтрока(Цел(Секунд * 1000)));
		Скрипт.Вывод = ИспользованиеВывода.Разрешить;
		Скрипт.Записать(ИмяВременногоФайла, КодировкаТекста.Системная);
		
		WshShell = Новый COMОбъект("WScript.Shell");
		WshShell.Run("wscript.exe """ + ИмяВременногоФайла + """", 0, -1);
		
		УдалитьФайлы(ИмяВременногоФайла);
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры //ПаузаИсполнения()

Функция ПреобразоватьЧисло(Знач Число) Экспорт
	
	Число = Окр(Число, 2);
	Строка = Строка(Число);
	Строка = СтрЗаменить(Строка, ",", ".");
	Строка = СтрЗаменить(Строка, " ", "");
	Возврат Строка; 
	
КонецФункции 

Функция ПреобразоватьДатуБиллинг(СтроковаяДата)	
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата, "-", ""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата, ":", "");
	СтроковаяДата = СтрЗаменить(СтроковаяДата, "T", "");
	СтроковаяДата = СтрЗаменить(СтроковаяДата, "Z", "");
	СтроковаяДата = СтрЗаменить(СтроковаяДата, "+", "");
	
	Возврат Дата(Лев(СтроковаяДата, 14)); 
	
КонецФункции

