&НаКлиенте
Процедура УстановитьВидимость()
	
	//+Сёмин Р.И. 09.06.2026 #UT10-5900
	//Элементы.ТекстОшибки.Видимость = Объект.ОбработаноСОшибкой;
	//-Сёмин Р.И. 09.06.2026 #UT10-5900
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработаноСОшибкойПриИзменении(Элемент)
	
	УстановитьВидимость();    
	
	Если НЕ Объект.ОбработаноСОшибкой Тогда
		Объект.ТекстОшибки = "";		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщение(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
	
		ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВопросаОбИзмененииИОбработке", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Сообщение было изменено. Записать и обработать?",РежимДиалогаВопрос.ДаНет, 60);	
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВопросаООбработке", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, "Обработать сообщение?",РежимДиалогаВопрос.ДаНет, 60);
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОкончаниеВопросаООбработке(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Записать();
		ОбработатьВыделенныеСтрокиНаСервере(Объект.Ссылка);     
		ЭтаФорма.Прочитать();
		ЭтаФорма.ОбновитьОтображениеДанных();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВопросаОбИзмененииИОбработке(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Записать();
		
		ЗначениеДляПоказа = ОбработатьВыделенныеСтрокиНаСервере(Объект.Ссылка);
		
		Если ЗначениеДляПоказа <> Неопределено Тогда
			ПоказатьЗначение(, ЗначениеДляПоказа);	
		КонецЕсли;
		
	КонецЕсли; 

КонецПроцедуры     

&НаСервере
Функция ОбработатьВыделенныеСтрокиНаСервере(Сообщение) 
		
	Если Сообщение <> Неопределено Тогда
		
		Ссылка = Неопределено;
		
		Если Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Регистр Тогда
			
			//Ссылка = Р_ЗагрузкаРегистров.ЗагрузитьРегистр(Сообщение); 
			
		ИначеЕсли Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Справочник Тогда
			
			//Ссылка = Р_ЗагрузкаСправочников.ЗагрузитьСправочник(Сообщение);
			
		ИначеЕсли Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Документ Тогда
			
			//+Шульман А. 21.11.2024 #UT10-4912      
			ИмяОчереди = Сообщение.Подписка.ИмяОчереди;
			
			Если МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) Тогда  
				
				Отказ = Ложь;                    
				//-Шульман А. 01.04.2025 #UT10-5173
				//МСК.ОбработатьСообщениеPricePM(Сообщение, Отказ);  
				МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);
				//-Шульман А. 01.04.2025 #UT10-5173
			//-Шульман А. 21.11.2024 #UT10-4912      
			//+Белов А. 14.09.2026 #UT10-6038
			ИначеЕсли МСК.ЭтоОчередьУТ10ВУТ10(ИмяОчереди) Тогда
			   
				Отказ = Ложь;     
				МСК.ОбработатьСообщениеJSON(Сообщение, Отказ); 
			//-Белов А. 14.09.2026 #UT10-6038
				
			Иначе	
			
				Отказ = Ложь;           
				
				//+Шульман А. 01.04.2025 #UT10-5173
				ТекстСообщения = Сообщение.Данные;
				ЭтоСообщениеJSON = Найти(ТекстСообщения, "/json") 
				//+Шульман А. 18.04.2025 #UT10-5201
				Или Найти(ВРЕГ(ТекстСообщения), "ID_EDI") 
				//-Шульман А. 18.04.2025 #UT10-5201       
				//+Шульман А. 02.07.2025 #UT10-5329
				Или Маркировка.ЭтоОчередьПоМаркировке(ИмяОчереди);  
				//-Шульман А. 02.07.2025 #UT10-5329				
				
				Если ЭтоСообщениеJSON Тогда
					МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);   
				//-Шульман А. 01.04.2025 #UT10-5173    
				Иначе
					МСК.ОбработатьСообщениеИзОчереди(ИмяОчереди, Сообщение.Данные, Отказ, Сообщение.КоличествоПопытокПовторнойОбработки);    
				КонецЕсли;
			
			КонецЕсли;
			
		Иначе 
			
			Сообщить("Не определен тип сообщения: " + Строка(Сообщение)); 
			
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(Ссылка) Тогда
		//	Возврат Ссылка;
		//КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Неопределено;

КонецФункции



