
Функция PM_6951_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_6951_FOR_PORTAL");
	
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_6951_FOR_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_6951_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_6951_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_GET_ZP_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_ZP_PORTAL");

	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK",УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_GET_ZP_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	Результат = МСКWEB.PM_GET_ZP_PORTAL(IncomingSettings);	

	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_ZP_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_GET_RNS_STR_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_RNS_STR_FOR_PORTAL_OLD");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_GET_RNS_STR_FOR_PORTAL_OLD: " + Символы.ПС 
	+ МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_GET_RNS_STR_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_RNS_STR_FOR_PORTAL_OLD " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_GET_RNS_STR_FOR_PORTAL_2021(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_RNS_STR_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK",УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_GET_RNS_STR_FOR_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_GET_RNS_STR_FOR_PORTAL_2021(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_RNS_STR_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_6051_DOC_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_6051_DOC_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_6051_DOC_FOR_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_6051_DOC_FOR_PORTAL(IncomingSettings);

	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_6051_DOC_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция RA_R_RN_LIN(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. RA_R_RN_LIN");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. RA_R_RN_LIN: "+Символы.ПС+МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.RA_R_RN_LIN(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. RA_R_RN_LIN " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция RA_MOVE_DOC_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. RA_MOVE_DOC_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. RA_MOVE_DOC_FOR_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.RA_MOVE_DOC_FOR_PORTAL(IncomingSettings);

	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. RA_MOVE_DOC_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция AZ_A_DOC_6951_DEL_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AZ_A_DOC_6951_DEL_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. AZ_A_DOC_6951_DEL_PORTAL: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.AZ_A_DOC_6951_DEL_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AZ_A_DOC_6951_DEL_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция RA_INS_UPDATE_STROKA_IZ_PORTALA(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. RA_INS_UPDATE_STROKA_IZ_PORTALA");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. RA_INS_UPDATE_STROKA_IZ_PORTALA: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.RA_INS_UPDATE_STROKA_IZ_PORTALA(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. RA_INS_UPDATE_STROKA_IZ_PORTALA " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_GET_CHANGES_FOR_ORDER(Header, Lines)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_CHANGES_FOR_ORDER");
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_GET_CHANGES_FOR_ORDER: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Header) + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(Lines)); 
	
	Результат = МСКWEB.PM_GET_CHANGES_FOR_ORDER(Header,Lines);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PORTAL_MSK", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_CHANGES_FOR_ORDER " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

