
&НаСервере
Процедура КомандаЗаполнитьНаСервере()    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиМониторингаРегламентныхЗаданий.РегламентноеЗадание
	|ИЗ
	|	РегистрСведений.НастройкиМониторингаРегламентныхЗаданий КАК НастройкиМониторингаРегламентныхЗаданий";
	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	
	
	Для Каждого МетаЗадание Из Метаданные.РегламентныеЗадания Цикл 
		
    	СтрокаПоиска = ТаблицаЗаданий.Найти(МетаЗадание.Имя, "РегламентноеЗадание");
		Если СтрокаПоиска = Неопределено Тогда
			НоваяЗапись = РегистрыСведений.НастройкиМониторингаРегламентныхЗаданий.СоздатьМенеджерЗаписи();
			НоваяЗапись.РегламентноеЗадание = МетаЗадание.Имя; 
			НоваяЗапись.Записать();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	КомандаЗаполнитьНаСервере();	
КонецПроцедуры
