Функция СоздатьНовыйДокумент(СписокЦен , Основание = Неопределено) Экспорт 
	
	НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;     
	
	Если Не Основание = Неопределено Тогда
		НовыйДокумент.Комментарий = "Создан на основании " + СокрЛП(Основание);
	КонецЕсли;
	
	Для Каждого ЗначениеСоответствия Из СписокЦен Цикл
		
		НовСтр = НовыйДокумент.ТипыЦен.Добавить();
		НовСтр.ТипЦен = ЗначениеСоответствия.Значение; 
		
	КонецЦикла;
	
	Возврат НовыйДокумент;  
	
КонецФункции
