

#Область ОсновныеПроцедурыИФункцииМодуля

&НаСервереБезКонтекста
Процедура УдалитьВсеОповещенияНаСервере()
	
	РегистрыСведений.ОповещенияПользователей.УдалитьВсеОповещенияНаСервере();
	
КонецПроцедуры

#КонецОбласти  


#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	//ПодключитьОбработчикОжидания("ОбновитьИнтерфейс",10);   
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	//ОтключитьОбработчикОжидания("ОбновитьИнтерфейс");
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбновитьИнтерфейс();
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ОтладкаПоказатьСообщение(Команда)
	
	СтруктураОбработкиОповещения=СтруктураОбработкиОповещения();
	СтруктураОбработкиОповещения.Вставить("Толькопросмотр",Истина);
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
		
		Форма = ПолучитьФорму("РегистрСведений.ОповещенияПользователей.Форма.ОповещениеУпр");
		Если Не Форма.Открыта() Тогда
			ЗаполнитьЗначенияСвойств(Форма,Элементы.Список.ТекущиеДанные);
			Форма.ТолькоПросмотр = Истина;
			Форма.Открыть();
		Иначе
			Форма.Активировать();
		КонецЕсли; 
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсеОповещения(Команда)
	
	УдалитьВсеОповещенияНаСервере();
	
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФормуОтправкиСообщения()
	
	СтруктураОбработкиОповещения=СтруктураОбработкиОповещения();
	СтруктураОбработкиОповещения.Вставить("Толькопросмотр",Толькопросмотр);
	Если Элементы.Список.ТекущиеДанные<>Неопределено Тогда
	
		ЗаполнитьЗначенияСвойств(СтруктураОбработкиОповещения,Элементы.Список.ТекущиеДанные);
	
	КонецЕсли; 
	
	ОткрытьФорму("РегистрСведений.ОповещенияПользователей.Форма.ФормаОтправкиУпр", СтруктураОбработкиОповещения);
	
КонецПроцедуры

#КонецОбласти   


#Область  ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьФормуОтправкиСообщения();	
КонецПроцедуры
		
#КонецОбласти   


#Область ДополнительныеПроцедурыИФункции

&НаСервере
Функция СтруктураОбработкиОповещения()
	
	Возврат РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();
	
КонецФункции

&НаКлиенте
Процедура СОЧИСОФТ(Команда)
    
    ЗапуститьПриложение("http://www.sochisoft.ru/")
    
КонецПроцедуры

 	
#КонецОбласти  


