Функция Печать(СсылкаНаОбъект) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка  = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	СУММА(ЗаказПоставщикуТовары.Количество) КАК Количество,
	               |	СпрНоменклатура.Родитель КАК Производитель,
	               |	СпрНоменклатура.КодПроизводителя КАК КодПроизводителя,
	               |	СпрНоменклатура.Родитель.Наименование КАК РодительНаименование
	               |ИЗ
	               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	               |		ПО ЗаказПоставщикуТовары.Номенклатура = СпрНоменклатура.Ссылка
	               |ГДЕ
	               |	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СпрНоменклатура.КодПроизводителя,
	               |	ЗаказПоставщикуТовары.Номенклатура,
	               |	СпрНоменклатура.Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	РодительНаименование,
	               |	КодПроизводителя";
				   
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ВыборкаТоваров = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 1;	
	
	Пока ВыборкаТоваров.Следующий() Цикл
		ОбластьСтрока.Параметры.НомерСтроки = НомерСтроки;
		ОбластьСтрока.Параметры.Заполнить(ВыборкаТоваров);
		ТабДокумент.Вывести(ОбластьСтрока);
		НомерСтроки = НомерСтроки + 1 ;
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;		
	
КонецФункции