
Процедура СформироватьвыкупПоКонтрагенту(ПоставщикТОХ, Контрагент, ДоговорКонтрагента)
	
	ПериодФормирования = НачалоДня(НачалоДня(ТекущаяДата()) - 1);  
	
	ЕстьДокумент = Ложь; 
	
	ЗапросДокумента = Новый Запрос; 
	
	ЗапросДокумента.Текст =
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|ГДЕ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка.ДоговорКонтрагента = &ДоговорКонтрагента
	|	И ВыкупСОтветственногоХраненияТовары.Ссылка.НачалоПериода = &НачалоПериода
	|	И ВыкупСОтветственногоХраненияТовары.Ссылка.КонецПериода = &КонецПериода
	|	И ВыкупСОтветственногоХраненияТовары.Ссылка.Проведен
	|	И ВыкупСОтветственногоХраненияТовары.Ссылка.Филиал = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)"; 
	
	ЗапросДокумента.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	ЗапросДокумента.УстановитьПараметр("НачалоПериода", НачалоДня(ПериодФормирования));
	ЗапросДокумента.УстановитьПараметр("КонецПериода", КонецДня(ПериодФормирования));
	
	ЕстьДокумент = НЕ ЗапросДокумента.Выполнить().Пустой();
	
	Если ЕстьДокумент Тогда
		Возврат;
	КонецЕсли;
		
	Обработка = Обработки.ОформлениеПроданныхТОХ.Создать();
	Результат = Обработка.ПолучитьТоварыТОХДляВыкупа(ПериодФормирования, ПериодФормирования, ПоставщикТОХ, Контрагент, ДоговорКонтрагента);  
	
	Если Не Результат.ТоварыКВыкупу = Неопределено Тогда 
		
		ТоварыКВыкупу = Результат.ТоварыКВыкупу;
		ТоварыКВыкупуСРегистраторами = Результат.ТоварыКВыкупуСРегистраторами;   
		
		Обработка.СоздатьДокументыВыкупа(ПериодФормирования, ПериодФормирования, Контрагент, ДоговорКонтрагента, ТоварыКВыкупу, ТоварыКВыкупуСРегистраторами, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьВыкупы() Экспорт
	
	ЗапросКонтрагентовТОХ = Новый Запрос;
	ЗапросКонтрагентовТОХ.Текст =
	"ВЫБРАТЬ
	|	ПоставщикиТОХ.Ссылка КАК ПоставщикТОХ,
	|	ПоставщикиТОХ.Контрагент,
	|	ПоставщикиТОХ.ДоговорКонтрагента
	|ИЗ
	|	Справочник.ПоставщикиТОХ КАК ПоставщикиТОХ
	|ГДЕ
	|	НЕ ПоставщикиТОХ.ПометкаУдаления";
	
	РезультатЗапросаКонтрагентовТОХ = ЗапросКонтрагентовТОХ.Выполнить();
	
	Если НЕ РезультатЗапросаКонтрагентовТОХ.Пустой() Тогда
		
		ВыборкаКонтрагентовТОХ = РезультатЗапросаКонтрагентовТОХ.Выбрать();
		
		Пока ВыборкаКонтрагентовТОХ.Следующий() Цикл
			СформироватьвыкупПоКонтрагенту(ВыборкаКонтрагентовТОх.ПоставщикТОХ, ВыборкаКонтрагентовТОх.Контрагент, ВыборкаКонтрагентовТОХ.ДоговорКонтрагента);			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РегламентноеВыполнение()Экспорт
	
	СформироватьВыкупы();	

КонецПроцедуры
