
Функция GetVesionWebService()
	
	Возврат 5.0;

КонецФункции

// Получить список товаров определенного документа ПТУ
Функция GetListGoodsFromPTU(GUIDPTU, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListGoodsFromPTU");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокТоваровДокументаПТУ(GUIDPTU, UserGUID);		
	Исключение		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

// Получить список документов ПТУ
Функция GetListOfDocumentsPTU(DocumentLink, DocumentGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfDocumentsPTU");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокДокументовПТУ(DocumentLink, DocumentGUID, UserGUID);
	Исключение		
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки()); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfDocumentsPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListOfDocumentsPTUHS()
//+Белов А. 05.06.2026 #UT10-5895

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfDocumentsPTUHS");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокДокументовПТУ_ЧЗ();
	Исключение		
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки()); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfDocumentsPTUHS " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

//-Белов А. 05.06.2026 #UT10-5895 
КонецФункции


// Получить описание товара
Функция GetDescriptionGood(GUIDGood, UserGUID)     

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetDescriptionGood");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОписаниеТовара(GUIDGood, UserGUID);		
	Исключение		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDescriptionGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции


// Корректна ли отсканированная ячейка
Функция GetCell(NameCell, UserGUID)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetCell");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьЯчейкуПоШтрихКоду(NameCell, UserGUID);		
	Исключение		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

// Поиск товара по различным видам поиска
Функция FindGoodByBarcodeForSearchType(UserGUID, Barcode, TypeDocument, GUIDDocument, SearchType )
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcodeForSearchType");
	
	РезультатВыполнения = Неопределено;
	
	Попытка
		
		Если SearchType = "ПоискШтрихкодов"  Тогда
			                                                                                             
			ТЗ = ARMStoreKeeper.ПолучитьТоварПоШтрихкоду(UserGUID, Barcode, TypeDocument, GUIDDocument);
			МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
			РезультатВыполнения = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
			
		ИначеЕсли SearchType = "ПоискПоНормализованномуКоду"  Тогда
			
			ТЗ = ARMStoreKeeper.ПолучитьТоварПоНормализованномуКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
			
			МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
			РезультатВыполнения = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
			
		ИначеЕсли SearchType = "ПоискПоКоду" Тогда
			
			ТЗ =  ARMStoreKeeper.ПолучитьТоварПоКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
			МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
			РезультатВыполнения = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
			
		КонецЕсли;                                                      
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcodeForSearchType " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
		
КонецФункции

// используется при работе сканера
Функция GetDocumentByBarcode(Barcode, UserIdGUID)   
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetDocumentByBarcode");
	
	РезультатВыполнения = Неопределено;
	
	UserIdСсылка = ARMStoreKeeper.ПолучитьПользователя(UserIdGUID);
	
	Попытка
		
		МассивДокументов = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Barcode);
		
		Если МассивДокументов.Количество() > 0 Тогда
			
			ДокументСсылка = МассивДокументов.Получить(0);		
			ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить документ по штрихкоду", Barcode); 
			РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокДокументовПТУ( ДокументСсылка, Неопределено);
			
		КонецЕсли;  
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDocumentByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	
КонецФункции

// Присвоить штрихкод выбранному товару
Функция AddBarcodeForGood(Barcode, GoodGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBarcodeForGood");
	
	Попытка
		
		РезультатВыполнения = ARMStoreKeeper.ДобавитьШтрихкод(Barcode, GoodGUID, UserGUID);		
		
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBarcodeForGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

// Добавить запись в регистр сведений Буффер арм кладовщика                                                               
Функция AddBufferARMStoreKeeper(ObjectGUID, GoodGUID, UserIdGUID, CreateDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBufferARMStoreKeeper");
		
	Попытка
		
		ОбъектСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));

		Если ОбъектСсылка.ПолучитьОбъект() = Неопределено Тогда
			ОбъектСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));
		КонецЕсли;

		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КодПроизводителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		
		ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
		
		Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
			UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));				
		Иначе 
			UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
		КонецЕсли; 
		
		
		МЗ = РегистрыСведений.БуферАрмКладовщика.СоздатьМенеджерЗаписи();	
		МЗ.Объект = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;                      		
		МЗ.Номенклатура = НоменклатураСсылка;		
		МЗ.CreateDate = CreateDate;
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			
			МЗ.Quantity = МЗ.Quantity + Quantity;
			
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
			
		Иначе
			
			МЗ.Объект = ОбъектСсылка;
			МЗ.UserId = UserIdСсылка;
			МЗ.CreateDate = CreateDate;			
			МЗ.Номенклатура = НоменклатураСсылка;		
			МЗ.Barcode = Barcode;
			МЗ.Quantity = Quantity;
			МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;
			МЗ.Ячейка = ЯчейкаСсылка;
			МЗ.ВведеноВРучную = PutIntoManual;
			
		КонецЕсли;	
		
		МЗ.Записать();
		
		ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в БуферАРМКладовщика" , 
			"ПТУ " + Строка(ОбъектСсылка.Номер) + ","+ Строка(ОбъектСсылка.НомерСкладскогоДокумента) + 
			"Номенклатура " + НоменклатураСсылка.КодПроизводителя + ", " + НоменклатураСсылка);
		
		РезультатВыполнения = Истина;
		
	Исключение

		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция AddBufferARMStoreKeeperUnion(ObjectGUID, UserIdGUID, CreatedDate, Barcode, GMGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBufferARMStoreKeeperUnion");
	
	Попытка
					
		ОбъектСсылка = Документы.ОбъединениеГМВТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));

		Если ОбъектСсылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;  
		
		ГМСсылка = Документы.ГрузовоеМесто.ПолучитьСсылку(Новый УникальныйИдентификатор(GMGUID));

		Если ГМСсылка.ПолучитьОбъект() = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;   
		
		UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
		
		МЗ = РегистрыСведений.БуферАРМКладовщикаОбъединениеТЕ.СоздатьМенеджерЗаписи();	
		МЗ.Объединение = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;                      				
		МЗ.ГрузовоеМесто = ГМСсылка;
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
			
		Иначе
			
			МЗ.Объединение = ОбъектСсылка;    
			МЗ.ГрузовоеМесто = ГМСсылка;
			МЗ.UserId = UserIdСсылка;
			МЗ.CreatedDate = CreatedDate;				
			МЗ.Barcode = Barcode;
			МЗ.ВведеноВРучную = PutIntoManual;
			
		КонецЕсли;	
		
		МЗ.Записать();    
		
		ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в БуферАРМКладовщикаОбъединениеТЕ",	"Объединение " + Строка(ОбъектСсылка.Номер) + ", ГМ " + Строка(ГМСсылка.Номер));
		
		РезультатВыполнения = Истина;
		
	Исключение   
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());

	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferARMStoreKeeperUnion " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetRemainderForGoodFromDocument(UserGUID, ОbjectIdGUID, Barcode, SelectedProductIdGUID) 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemainderForGoodFromDocument");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстатокПоТоваруИзДокумента( UserGUID, ОbjectIdGUID, Barcode, SelectedProductIdGUID );
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderForGoodFromDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция FindGoodByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues = False)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcode");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.FindGoodByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция FindGoodByBarcode50(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues = False)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcode50");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.FindGoodByBarcode50(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcode50 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция FindGoodByGTIN(UserGUID, GTIN, TypeDocument, GUIDDocument, GoodGUID)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcode50");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.FindGoodByGTIN(UserGUID, GTIN, TypeDocument, GUIDDocument, GoodGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcode50 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(РезультатВыполнения);
    Возврат Результат;
	
КонецФункции

Функция FindGoodByMark(UserGUID , Barcode , BarcodeFull , TypeDocument, GUIDDocument , GoodGUID , GetTableValues = False) 
	
	//+Кабанов А.В. 15.08.2025 # # UT10-5360 
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcode50");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.FindGoodByMark(UserGUID , Barcode , BarcodeFull , TypeDocument , GUIDDocument , GoodGUID , GetTableValues);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcode50 " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	//+Кабанов А.В. 15.08.2025 # # UT10-5360	

КонецФункции

Функция GetRemainderForAllGoodsFromDocument(ОbjectIdGUID, UserGUID) 
		
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemainderForAllGoodsFromDocument");
		
	Попытка
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстатокПоВсемТоварамИзДокумента( ОbjectIdGUID, UserGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderForAllGoodsFromDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции                                                  

Функция ПолучитьОписаниеОшибки(Ошибка)
	
	СтруктураОшибки = Новый Структура;
	СтруктураОшибки.Вставить("Ошибка", Ошибка); 
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
    Возврат Результат;
		
КонецФункции

Функция CreateDocument(DocumentBaseGUID, UserIdGUID, TypeOperation, DeleteRecordsFromBuffer)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CreateDocument");
	
	РезультатВыполнения = Неопределено;
	
	Если TypeOperation = "ПриемкаТовара" Тогда
		РезультатВыполнения = ARMStoreKeeper.СоздатьДокументРазмещенияПоМестамХранения( DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer);			
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
		
КонецФункции                           

Функция RecordMarksFromPTU(DocumentBaseGUID , UserIdGUID , DeleteRecordsFromBuffer)
	//+Кабанов А.В. 29.08.2025 # UT10-5361	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. RecordMarksFromPTU");
	
	РезультатВыполнения = Неопределено;
	
	РезультатВыполнения = ARMStoreKeeper.ЗаписатьМаркировкиВДокументПТУ( DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer);			
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. RecordMarksFromPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	//-Кабанов А.В. 29.08.2025 # UT10-5361	
КонецФункции 

Функция CreateDocumentMoveGood(UserIdGUID, CellFromGUID, CellToGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CreateDocumentMoveGood");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.СоздатьДокументПеремещенияТоваровМеждуЯчейками(UserIdGUID, CellFromGUID, CellToGUID);	
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateDocumentMoveGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция AuthenticationUser(Barcode, Password)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AuthenticationUser");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПроверитьДоступКARMStoreKeeper( Barcode, Password );
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AuthenticationUser " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция FindUser(Barcode, Password)
	
	//+Шульман А. 28.11.2025 #UT10-5548
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindUser");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.НайтиПользователя(Barcode, Password);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindUser " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения; 
	//-Шульман А. 28.11.2025 #UT10-5548

КонецФункции

Функция IsGoodsInCell(CellGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. IsGoodsInCell");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ЕстьЛиТоварыВЯчейке(CellGUID, UserGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. IsGoodsInCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetRemainderGoodFromCell(UserIdGUID, CellGUID, Barcode, GoodGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemainderGoodFromCell");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстатокНоменклатурыПоЯчейке(UserIdGUID, CellGUID, Barcode, GoodGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderGoodFromCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
		
КонецФункции

Функция GetListGoodsFromCell(UserGUID, CellGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListGoodsFromCell");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокНоменклатурПоЯчейке( UserGUID, CellGUID );
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
		
КонецФункции
                                                                     
Функция GetRemainderGood(GoodGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemainderGood");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстатокТовара( GoodGUID, UserGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderGood " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция AddBufferMovingARMStoreKeeper(UserIdGUID, CellFromGUID, GoodGUID, CreatedDate, Barcode, Quantity, CellWhereGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBufferMovingARMStoreKeeper");
	
	Попытка
		
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку( Новый УникальныйИдентификатор(GoodGUID));
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.КодПроизводителя
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellFromGUID));
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellWhereGUID));
		
		Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
			UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку( Новый УникальныйИдентификатор(UserIdGUID));				
		Иначе 
			UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
		КонецЕсли; 
				
		МЗ = РегистрыСведений.БуферАРМКладовшикаПеремещение.СоздатьМенеджерЗаписи();	
		
		МЗ.UserId = UserIdСсылка;                      		
		МЗ.ЯчейкаОткуда = ЯчейкаОткудаСсылка;
		МЗ.Номенклатура = НоменклатураСсылка;
		МЗ.CreatedDate = CreatedDate;                                                 
		
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			
			МЗ.Quantity = МЗ.Quantity + Quantity;
			
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
			
		Иначе
			
			МЗ.UserId = UserIdСсылка;                      		
			МЗ.ЯчейкаОткуда = ЯчейкаОткудаСсылка;
			МЗ.Номенклатура = НоменклатураСсылка;
			МЗ.CreatedDate = CreatedDate;
			МЗ.Barcode = Barcode;
			МЗ.Quantity = Quantity;
			МЗ.ЯчейкаКуда = ЯчейкаКудаСсылка;
			МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;
			МЗ.ВведеноВРучную = PutIntoManual;
			
		КонецЕсли;	
		                                                                                         
		МЗ.Записать();
		
		ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Добавить запись в БуферАРМКладовшикаПеремещение", 
			"Откуда " + ЯчейкаОткудаСсылка.Код + " Куда " + ЯчейкаКудаСсылка.Код + "; Штрихкод " + Barcode + "; КодПроизводителя " + РезультатЗапроса.КодПроизводителя +
			НоменклатураСсылка + ", КодПроивзодителя " + НоменклатураСсылка.КодПроизводителя);  
		
		РезультатВыполнения = Истина;
		
	Исключение

		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferMovingARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция IsGoodInCell(CellGUID, GoodGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. IsGoodInCell");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ЕстьЛиТоварВЯчейке(CellGUID, GoodGUID, UserGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. IsGoodInCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListMovesForCreateDocument(UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListMovesForCreateDocument");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЯчеекДляПеремещения(UserIdGUID); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListMovesForCreateDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListDeliveryOrders(UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListDeliveryOrders");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаданийНаДоставку(UserIdGUID); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListDeliveryOrders " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetRemaindersGoodFromCells(Barcode, GoodGUID, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemaindersGoodFromCells");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстаткиНоменклатуры(Barcode, GoodGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemaindersGoodFromCells " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListCargoPlaces(DocumentGUID, GetAllRecords, UserIdGUID)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListCargoPlaces");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокГрузовыхМест(DocumentGUID, GetAllRecords, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ProcessingCargoPlace(DeliveryOrderGUID, CargoPlaceGUID, UserIDGUID )
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingCargoPlace");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ОбработатьГрузовоеМесто(DeliveryOrderGUID, CargoPlaceGUID, UserIDGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlace " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListsRecorfdsFromBufferPlacing(UserIdGUID, ОbjectIdGUID)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListsRecorfdsFromBufferPlacing");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаписейИзБуфераРазмещения(UserIdGUID, ОbjectIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListsRecorfdsFromBufferPlacing " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция WriteBufferWithCheckRemainder(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. WriteBufferWithCheckRemainder");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.ЗаписатьВБуферРазмещенияСПроверкойОстатков(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, 
																	      Quantity, CellGUID, PutIntoManual);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. WriteBufferWithCheckRemainder " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции
              
Функция FindGoodByBarcodeWithRemains(Barcode, GoodGUID, UserIDGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGoodByBarcodeWithRemains");
	
	Попытка
		РезультатВыполнения = ARMStoreKeeper.FindGoodByBarcodeWithRemains(Barcode, GoodGUID, UserIDGUID);
	Исключение
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGoodByBarcodeWithRemains " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListsRecorfdsFromBufferMoving(UserIdGUID, FromCellIdGUID, WhereCellGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListsRecorfdsFromBufferMoving");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаписейИзБуфераПеремещения(UserIdGUID, FromCellIdGUID, WhereCellGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListsRecorfdsFromBufferMoving " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
			
КонецФункции

Функция GetDescriptionForMoving(UserIdGUID, FromCellIdGUID, WhereCellIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetDescriptionForMoving");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.GetDescriptionForMoving(UserIdGUID, FromCellIdGUID, WhereCellIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetDescriptionForMoving " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция SendLogsFromTSD(UserIdGUID, Logs)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. SendLogsFromTSD");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.SendLogsFromTSD(UserIdGUID, Logs );
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SendLogsFromTSD " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция CheckCellsForLockDuringInventory(ObjectGUID, Cells, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CheckCellsForLockDuringInventory");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПроверитьЯчейкиДляБлокировкиПриИнвентаризации(ObjectGUID, Cells, UserIdGUID);
	Исключение                      
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CheckCellsForLockDuringInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция SetLockCellsForInventory(ObjectGUID, Cells, SetLock, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. SetLockCellsForInventory");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.УстановитьБлокирокуЯчеек(ObjectGUID, Cells, SetLock, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetLockCellsForInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
		
КонецФункции

Функция GetInventoryForJobs(UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetInventoryForJobs");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаданийНаИнвентаризацию(UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetInventoryForJobs " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	                                     
КонецФункции

// Добавить запись в РС БуферАРМКладовщикаИнвентПоЯчейкам
Функция AddBufferInventoryARMStoreKeeper(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBufferInventoryARMStoreKeeper");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ДобавитьЗаписьВБуферИнвентаризации(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferInventoryARMStoreKeeper " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetCollectAmountGoodFromCellInventory(UserIdGUID, ObjectGUID, CellGUID, Barcode, GoodGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetCollectAmountGoodFromCellInventory");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.GetCollectAmountGoodFromCellInventory(UserIdGUID, ObjectGUID, CellGUID, Barcode, GoodGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetCollectAmountGoodFromCellInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция CheckCanUnlockCellsFromJobInventory(UserIdGUID, ObjectGUID, Cells)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CheckCanUnlockCellsFromJobInventory");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.CheckCanUnlockCellsFromJobInventory(UserIdGUID, ObjectGUID, Cells);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CheckCanUnlockCellsFromJobInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
		
КонецФункции

Функция GetListGoodsFromBufferInventory(UserIdGUID, ObjectGUID, Cell)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListGoodsFromBufferInventory");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаписейИзБуфераИнвентаризации(UserIdGUID, ObjectGUID, Cell);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListGoodsFromBufferInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция ImportDataToJobInventory(UserIdGUID, DocumentGUID, Cells, DeleteRecordsFromBuffer)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ImportDataToJobInventory");
	
	Попытка                                                                            
		РезультатВыполнения = ARMStoreKeeper.ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию(UserIdGUID, DocumentGUID, Cells, DeleteRecordsFromBuffer);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ImportDataToJobInventory " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция SetStatusForInventoryCell(UserIdGUID, DocumentGUID, Cell, StatusId)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. SetStatusForInventoryCell");
	
	Попытка                                                                            
		РезультатВыполнения = ARMStoreKeeper.УстановитьСтатусИнвентаризируемойЯчейки(UserIdGUID, DocumentGUID, Cell, StatusId);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetStatusForInventoryCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListDeliveryOrdersFromUnloadAuto(UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListDeliveryOrdersFromUnloadAuto");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаданийНаДоставкуИзДокументовРазгрузкаАвто(UserIdGUID); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListDeliveryOrdersFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция ProcessingCargoPlaceFromUnloadAuto(DeliveryOrderGUID, DocumentGUID, CargoPlaceGUID, UserIdGUID, CreatedDate)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingCargoPlaceFromUnloadAuto");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ОбработатьГрузовоеМестоИзРазгрузкаАвто(DeliveryOrderGUID, DocumentGUID, CargoPlaceGUID, UserIdGUID, CreatedDate); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlaceFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetInfoOnUserId(UserIdGUID, Password)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetInfoOnUserId");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьИнформациюПоПользователю(UserIdGUID, Password); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetInfoOnUserId " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция FinishUnloadingCargoPlaces(DeliveryOrderGUID, UserIdGUID, StoreKeeperGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FinishUnloadingCargoPlaces");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто(DeliveryOrderGUID, UserIdGUID, StoreKeeperGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FinishUnloadingCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListRouteFromUnloadAutoForSetRoute(UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListRouteFromUnloadAutoForSetRoute");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокМаршрутовИзРазгрузкаАвтоДляПостановкиНаМаршрут(UserIdGUID);		
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListRouteFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
		
КонецФункции

Функция SetLockOnRouteForUnloadAuto(StoreKeeperGUID, UnloadAutoGUID, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. SetLockOnRouteForUnloadAuto");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто(StoreKeeperGUID, UnloadAutoGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. SetLockOnRouteForUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
			
КонецФункции

Функция FinishSetOnRouteCargoPlaces(DeliveryOrderGUID, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FinishSetOnRouteCargoPlaces");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FinishSetOnRouteCargoPlaces " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция ProcessingCargoPlaceFromUnloadAutoForSetRoute(DeliveryOrderGUID, UnloadAutoGUID, CargoPlaceGUID, UserIdGUID, CreatedDate)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingCargoPlaceFromUnloadAutoForSetRoute");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ОбработатьГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UnloadAutoGUID, CargoPlaceGUID, UserIdGUID, CreatedDate);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingCargoPlaceFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListCargoPlacesFromUnloadAuto(DocumentGUID, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListCargoPlacesFromUnloadAuto");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвто(DocumentGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlacesFromUnloadAuto " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListCargoPlacesFromUnloadAutoForSetRoute(UnloadAutoGUID, UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListCargoPlacesFromUnloadAutoForSetRoute");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвтоДляПостановкиНаМаршрут(UnloadAutoGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListCargoPlacesFromUnloadAutoForSetRoute " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListOrderPickingForLockCell(CellGUID, UserIdGUID)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOrderPickingForLockCell");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокСборокДляЗаблокированнойЯчейки(CellGUID, UserIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 	
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOrderPickingForLockCell " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	
КонецФункции

Функция FindGMByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GetTableValues)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. FindGMByBarcode");
	
	Попытка
		
		ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDDocument));    
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.ГМ
		|ПОМЕСТИТЬ ВТ_ГМПоступлений
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.ГМ = &ГМ
		|	И ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.ГМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РазмещениеПоЯчейкамТовары.ГМ
		|ПОМЕСТИТЬ ВТ_ГМРазмещений
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
		|ГДЕ
		|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &Ссылка
		|	И РазмещениеПоЯчейкамТовары.ГМ = &ГМ
		|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмещениеПоЯчейкамТовары.ГМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БуферАрмКладовщикаГМ.ГМ
		|ПОМЕСТИТЬ ВТ_ГМВБуфере
		|ИЗ
		|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщикаГМ
		|ГДЕ
		|	БуферАрмКладовщикаГМ.ГМ = &ГМ
		|	И БуферАрмКладовщикаГМ.Объект = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	БуферАрмКладовщикаГМ.ГМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ГМПоступлений.ГМ,
		|	ЕСТЬNULL(ВТ_ГМРазмещений.ГМ, """") КАК ГМРазмещения,
		|	ЕСТЬNULL(ВТ_ГМВБуфере.ГМ, """") КАК ГМБуфера
		|ИЗ
		|	ВТ_ГМПоступлений КАК ВТ_ГМПоступлений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГМРазмещений КАК ВТ_ГМРазмещений
		|		ПО ВТ_ГМПоступлений.ГМ = ВТ_ГМРазмещений.ГМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГМВБуфере КАК ВТ_ГМВБуфере
		|		ПО ВТ_ГМПоступлений.ГМ = ВТ_ГМВБуфере.ГМ";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ГМ", Barcode);
		
		МассивВозврата = Новый Массив;
		СтруктураВозврата = Новый Структура;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.ГМРазмещения <> "" ИЛИ Выборка.ГМБуфера <> "" Тогда
				
				Если Выборка.ГМРазмещения <> "" Тогда
					СтруктураВозврата = Новый Структура("Ошибка", "По данному штрихкоду уже создано размещение");
				Иначе
					СтруктураВозврата = Новый Структура("Ошибка", "Данный штрих код уже есть в буфере отсканированных штрихкодов");
				КонецЕсли;
					
			Иначе
				МассивВозврата.Добавить(Новый Структура("ГМ, ТипСтрокиЗапроса", Barcode, ""));
			КонецЕсли;   
			
		Иначе
			СтруктураВозврата = Новый Структура("Ошибка", "Не найдено грузоместо в поступлении по такому штрихкоду");
		КонецЕсли;
		
		Если МассивВозврата.Количество() = 0 Тогда
			РезультатВыполнения = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураВозврата);	
		Иначе
			РезультатВыполнения = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВозврата);
		КонецЕсли;
			
	Исключение
		
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. FindGMByBarcode " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения; 
	
КонецФункции

Функция AddBufferARMStoreKeeperGM(ObjectGUID, UserIdGUID, CreatedDate, Barcode, CellGUID, PutIntoManual)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. AddBufferARMStoreKeeperGM");
		
	Попытка
		
		ОбъектСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID) );
		
		ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
		
		Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
			UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));				
		Иначе 
			UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
		КонецЕсли; 
		
		
		МЗ = РегистрыСведений.БуферАрмКладовщикаГМ.СоздатьМенеджерЗаписи();	
		МЗ.Объект = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;
		МЗ.ГМ = Barcode;
		МЗ.CreateDate = CreatedDate;
		МЗ.Прочитать();
		
		Если МЗ.Выбран() Тогда
			
			Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
				МЗ.ВведеноВРучную = PutIntoManual;
			КонецЕсли; 
			
		Иначе
			
			МЗ.Объект = ОбъектСсылка;
			МЗ.UserId = UserIdСсылка;
			МЗ.CreateDate = CreatedDate;
			МЗ.ГМ = Barcode;
			МЗ.Barcode = Barcode;
			МЗ.Ячейка = ЯчейкаСсылка;
			МЗ.ВведеноВРучную = PutIntoManual;
			
		КонецЕсли;	
		
		МЗ.Записать();
		
		ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в БуферАРМКладовщикаГМ" , 
			"ПТУ " + Строка(ОбъектСсылка.Номер) + ","+ Строка(ОбъектСсылка.НомерСкладскогоДокумента) + 
			"ГМ " + Barcode);
		
		РезультатВыполнения = Истина;
		
	Исключение

		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. AddBufferARMStoreKeeperGM " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListsRecorfdsFromBufferPlacingGM(UserIdGUID, ОbjectIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListsRecorfdsFromBufferPlacing");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокЗаписейИзБуфераРазмещенияГМ(UserIdGUID, ОbjectIdGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListsRecorfdsFromBufferPlacing " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция CreateDocumentGM(DocumentBaseGUID, UserIdGUID, TypeOperation, DeleteRecordsFromBuffer)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CreateDocumentGM");
	
	РезультатВыполнения = Неопределено;
	
	Если TypeOperation = "ПриемкаТовара" Тогда
		РезультатВыполнения = ARMStoreKeeper.СоздатьДокументРазмещенияПоМестамХраненияГМ( DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer);				
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CreateDocumentGM " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Если Не РезультатВыполнения = Неопределено Тогда
		Возврат РезультатВыполнения;
	КонецЕсли; 
	
КонецФункции

Функция GetRemainderForAllGMFromDocument(ОbjectIdGUID, UserGUID)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetRemainderForAllGMFromDocument");
		
	Попытка
		РезультатВыполнения = ARMStoreKeeper.ПолучитьОстатокПоВсемГМИзДокумента( ОbjectIdGUID, UserGUID);
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetRemainderForAllGMFromDocument " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListOfUnverifiedDocumentsPTU(UserGUID, DocumentLink, DocumentGUID)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfGetListOfUnverifiedDocumentsPTU");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокНепроведенныхДокументовПТУ(DocumentLink, DocumentGUID, UserGUID);
	Исключение		
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки()); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfGetListOfUnverifiedDocumentsPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция GetListOfUnverifiedDocumentsPTUTransit(UserGUID, DocumentLink, DocumentGUID)
   	//+Кабанов А.В. 10.12.2024 # UT10-4950
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfUnverifiedDocumentsPTUTransit");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокНепроведенныхДокументовПТУ(DocumentLink, DocumentGUID, UserGUID , Истина);
	Исключение		
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки()); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfUnverifiedDocumentsPTUTransit " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
   	//-Кабанов А.В. 10.12.2024 # UT10-4950
КонецФункции

Функция ProcessingUnverifiedPTU(DocumentGUID , UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingunverifiedPTU");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПровестиДокументПТУ(DocumentGUID , UserIdGUID); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingunverifiedPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

КонецФункции

Функция ProcessingUnverifiedPTUTransit(DocumentGUID , UserIdGUID , ComingDate , QuantityPlaces)
	//+Кабанов А.В. 10.12.2024 # UT10-4950
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingUnverifiedPTUTransit");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПровестиДокументПТУТранзит(DocumentGUID , UserIdGUID , ComingDate , QuantityPlaces); 
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingUnverifiedPTUTransit " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	//-Кабанов А.В. 10.12.2024 # UT10-4950
КонецФункции

Функция GetListOfIncomingMemo(UserGUID, DocumentLink, DocumentGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfIncomingMemo");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокВходящихСлужебныхЗаписок(DocumentLink, DocumentGUID, UserGUID); 
	Исключение
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfIncomingMemo " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция GetListCargoIncomingMemo(DocumentGUID , UserIdGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfIncomingMemo");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокГрузовыхМестСлужебныхЗаписок(DocumentGUID, UserIdGUID); 
	Исключение
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfIncomingMemo " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ProcessingIncomingMemo(DocumentGUID , UserIDGUID)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ProcessingIncomingMemo");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ОбработатьСлужебнуюЗапискуВходящую(DocumentGUID, UserIdGUID); 
	Исключение
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ProcessingIncomingMemo " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения; 

КонецФункции

Функция GetListOfUnion(UserGUID, UnionGUID, Завершенные)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfUnion");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокОбъединений(UserGUID, UnionGUID, Завершенные); 
	Исключение
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfUnion " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция OpenCloseTE(UnionGUID, UserGUID)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. OpenCloseTE");  
	
	Попытка
		СтруктураОтвета = ARMStoreKeeper.ОткрытьЗакрытьТЕ(UnionGUID, UserGUID); 	
	Исключение
		СтруктураОтвета = Новый Структура("Результат, Сообщение", Ложь, ОписаниеОшибки()); 
	КонецПопытки;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. OpenCloseTE " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));

	Возврат ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОтвета);  

КонецФункции

Функция GetMarksListFromPTU(GUIDPTU, UserGUID)
	//+Кабанов А.В. 01.09.2025 # UT10-5361
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetMarksListFromPTU");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ПолучитьМаркировкиПоДокументуПТУ(GUIDPTU , UserGUID);		
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetMarksListFromPTU " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

	//-Кабанов А.В. 01.09.2025 # UT10-5361
КонецФункции

Функция WriteBufferMark(ObjectGUID, UserIdGUID, CreatedDate, GoodGUID, MarkData)    
	
	//+Кабанов А.В. 05.09.2025 # UT10-5361
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. WriteBufferMark");
	
	Попытка                            
		РезультатВыполнения = ARMStoreKeeper.ЗаписатьВБуферМаркировок(ObjectGUID , UserIdGUID , CreatedDate , GoodGUID , MarkData);		
	Исключение
	    РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки());
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. WriteBufferMark " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;

	//-Кабанов А.В. 05.09.2025 # UT10-5361
КонецФункции

Функция GetListOfTE(DocumentGUID, UserGUID)
	
	//+Сёмин Р. 19.12.2025 #UT10-5593
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetListOfTE");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСписокТранспортныхЕдиниц(DocumentGUID, UserGUID);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetListOfTE " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	//-Сёмин Р. 19.12.2025 #UT10-5593
	
КонецФункции

Функция GetPTUEDOStatus(DocumentGUID, UserGUID)
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5901
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. GetPTUEDOStatus");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПолучитьСтатусЭДОПТУ(DocumentGUID, UserGUID);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. GetPTUEDOStatus " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	//-Сёмин Р.И. 08.06.2026 #UT10-5901
	
КонецФункции

Функция CheckPTUContainsExpiredKIZ(DocumentGUID, UserGUID)
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5915
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. CheckPTUContainsExpiredKIZ");
	
	Попытка		
		РезультатВыполнения = ARMStoreKeeper.ПТУСодержитКодыМаркировкиСНарушеннымСроком(DocumentGUID, UserGUID);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		РезультатВыполнения = ПолучитьОписаниеОшибки(ОписаниеОшибки); 		
	КонецПопытки; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMStoreKeeper", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. CheckPTUContainsExpiredKIZ " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат РезультатВыполнения;
	//-Сёмин Р.И. 24.06.2026 #UT10-5915
	
КонецФункции
