////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.ПараметрыПодключения);
	
	Если СервисПочтовойРассылки = Перечисления.ПЛ_СервисыПочтовойРассылки.UniSender Тогда
		Элементы.Логин.Заголовок = НСтр("ru = 'Ключ доступа к API'");
		Элементы.Пароль.Видимость = Ложь;
		Элементы.ПоказатьПароль.Видимость = Ложь;
	КонецЕсли;
	
	Заголовок = Строка(СервисПочтовойРассылки);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Если Модифицированность Тогда
		
		ПараметрыПодключения = Новый Структура;
		ПараметрыПодключения.Вставить("ЛогинПочтовойРассылки",      ЛогинПочтовойРассылки);
		ПараметрыПодключения.Вставить("ПарольПочтовойРассылки",     ПарольПочтовойРассылки);
		
		Оповестить("Настроены_Параметры_Подключения", ПараметрыПодключения, ЭтаФорма);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьПароль(Команда)
	
	ПарольВиден = Не ПарольВиден;
	Элементы.Пароль.РежимПароля = Не ПарольВиден;
	Если ПарольВиден Тогда
		Элементы.ПоказатьПароль.Заголовок = НСтр("ru = 'Скрыть'");
	Иначе
		Элементы.ПоказатьПароль.Заголовок = НСтр("ru = 'Показать'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	ПроверитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	Если ПЛ_Рассылки.ПроверитьПодключение(СервисПочтовойРассылки, ЛогинПочтовойРассылки, ПарольПочтовойРассылки) Тогда
		Элементы.Декорация1.Заголовок = НСтр("ru = 'Соединение успешно'");
		Элементы.Декорация1.ЦветТекста = Новый Цвет(0, 128, 0);
	Иначе
		Элементы.Декорация1.Заголовок = НСтр("ru = 'Ошибка при соединении'");
		Элементы.Декорация1.ЦветТекста = Новый Цвет(128, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


