
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Отправляет SMS через настроенного поставщика услуги, возвращает идентификатор сообщения.
//
// Параметры:
//    Сообщение - Структура - структура сообщения, номера получателей должны быть в формате 7ХХХХХХХХХХ
//    НастройкиСМС - Структура структура настроек подключения к провайдеру услуги
//
// Возвращаемое значение:
//  Структура:
//    * ОтправленныеСообщения - Массив - массив структур:
//      ** НомерПолучателя - Строка.
//      ** ИдентификаторСообщения - Строка.
//    * ОписаниеОшибки - Строка - пользовательское представление ошибки, если пустая строка, то ошибки нет.
//
Функция ОтправитьСМС(Сообщение, НастройкиСМС) Экспорт
	
	Результат = Неопределено;
	
	Если НастройкиСМС.ПровайдерСМС = Перечисления.ПЛ_ПровайдерыСМС.МТС Тогда
		
		Результат = ОтправитьСМСЧерезМТС(
			Сообщение.НомераПолучателей,
			Сообщение.Текст,
			НастройкиСМС.ИмяОтправителяСМС,
			НастройкиСМС.ЛогинСМС,
			НастройкиСМС.ПарольСМС,
			НастройкиСМС.ТелефонныйКодСтраны);
		
	ИначеЕсли НастройкиСМС.ПровайдерСМС = Перечисления.ПЛ_ПровайдерыСМС.Билайн Тогда
		
		Результат = ОтправитьСМСЧерезБилайн(
			Сообщение.НомераПолучателей,
			Сообщение.Текст,
			НастройкиСМС.ИмяОтправителяСМС,
			НастройкиСМС.ЛогинСМС,
			НастройкиСМС.ПарольСМС,
			НастройкиСМС.ТелефонныйКодСтраны);
			
	ИначеЕсли НастройкиСМС.ПровайдерСМС = Перечисления.ПЛ_ПровайдерыСМС.TurboSMS Тогда
		
		Результат = ОтправитьСМСЧерезТурбоСМС(
			Сообщение.НомераПолучателей,
			Сообщение.Текст,
			НастройкиСМС.ИмяОтправителяСМС,
			НастройкиСМС.ЛогинСМС,
			НастройкиСМС.ПарольСМС,
			НастройкиСМС.ТелефонныйКодСтраны);
			
	ИначеЕсли НастройкиСМС.ПровайдерСМС = Перечисления.ПЛ_ПровайдерыСМС.СМСРу Тогда
		
		Результат = ОтправитьСМСЧерезСМСРУ(
			Сообщение.НомераПолучателей,
			Сообщение.Текст,
			НастройкиСМС.ИмяОтправителяСМС,
			НастройкиСМС.ЛогинСМС,
			НастройкиСМС.ПарольСМС,
			НастройкиСМС.ТелефонныйКодСтраны);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// МТС

// Отправляет SMS через веб-сервис МТС, возвращает идентификатор сообщения.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ (строкой);
//  Текст             - Строка - текст сообщения, длиной не более 1000 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин             - Строка - логин пользователя услуги отправки sms;
//  Пароль            - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки    - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьСМСЧерезМТС(НомераПолучателей, Текст, ИмяОтправителя, Логин, Знач Пароль, КодСтраны)
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	Пароль = ВычислитьХешСтрокиПоАлгоритмуMD5(Пароль);
	
	ВебСервис = ПодключитьВебСервисМТС();
	
	Для Каждого Элемент Из НомераПолучателей Цикл
		НомерПолучателя = ФорматироватьНомер(Элемент, КодСтраны);
		Если Не ПустаяСтрока(НомерПолучателя) Тогда
			Попытка
				ИдентификаторСообщения = ВебСервис.SendMessage(НомерПолучателя, Лев(Текст, 1000), ИмяОтправителя, Логин, Пароль);
				Результат.ОтправленныеСообщения.Добавить(Новый Структура("НомерПолучателя,ИдентификаторСообщения",
					"+" +  НомерПолучателя, Формат(ИдентификаторСообщения, "ЧГ=")));
			Исключение
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Отправка SMS'"),
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Результат.ОписаниеОшибки = Результат.ОписаниеОшибки
										 + СтрЗаменить(НСтр("ru = 'SMS на номер %1 не отправлено'"), "%1", Элемент)
										 + ": " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке())
										 + Символы.ПС;
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Результат.ОписаниеОшибки = СокрП(Результат.ОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  Логин                  - Строка - логин пользователя услуги отправки sms;
//  Пароль                 - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставкиМТС(ИдентификаторСообщения, Логин, Знач Пароль)
	
	Пароль = ВычислитьХешСтрокиПоАлгоритмуMD5(Пароль);
	ВебСервис = ПодключитьВебСервисМТС();
	ArrayOfDeliveryInfo = ВебСервис.GetMessageStatus(ИдентификаторСообщения, Логин, Пароль);
	Для Каждого DeliveryInfo Из ArrayOfDeliveryInfo.DeliveryInfo Цикл
		Возврат СтатусДоставкиSMSМТС(DeliveryInfo.DeliveryStatus);
	КонецЦикла;
	Возврат "Ошибка";
	
КонецФункции

Функция СтатусДоставкиSMSМТС(СтатусСтрокой)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("Pending", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("Sending", "Отправляется");
	СоответствиеСтатусов.Вставить("Sent", "Отправлено");
	СоответствиеСтатусов.Вставить("NotSent", "НеОтправлено");
	СоответствиеСтатусов.Вставить("Delivered", "Доставлено");
	СоответствиеСтатусов.Вставить("NotDelivered", "НеДоставлено");
	
	Результат = СоответствиеСтатусов[СтатусСтрокой];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
	
КонецФункции

Функция ПодключитьВебСервисМТС()
	
	Возврат WSПрокси(
		"http://www.mcommunicator.ru/m2m/m2m_api.asmx?WSDL",
		"http://mcommunicator.ru/M2M", 
		"MTS_x0020_Communicator_x0020_M2M_x0020_XML_x0020_API", 
		"MTS_x0020_Communicator_x0020_M2M_x0020_XML_x0020_APISoap12", 
		"",
		"",
		60,
		Ложь);
		
КонецФункции

Функция ВычислитьХешСтрокиПоАлгоритмуMD5(Знач Строка)
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(Строка);
	Возврат СтрЗаменить(ХешированиеДанных.ХешСумма, " ", "");
	
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция РазрешенияМТС() Экспорт
	
	Протокол = "HTTP";
	Адрес = "http://mcommunicator.ru";
	Порт = Неопределено;
	Описание = НСтр("ru = 'Отправка SMS через МТС.'");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Билайн

// Отправляет SMS через веб-сервис Билайн, возвращает идентификатор сообщения.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст 			  - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя 	  - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин			  - Строка - логин пользователя услуги отправки sms;
//  Пароль			  - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьСМСЧерезБилайн(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль, КодСтраны)
	
	Результат = Новый Структура("ОтправленныеСообщения,ОписаниеОшибки", Новый Массив, "");
	
	// Подготовка строки получателей.
	СтрокаПолучателей = МассивПолучателейСтрокой(НомераПолучателей, КодСтраны);
	
	// Проверка на заполнение обязательных параметров.
	Если ПустаяСтрока(СтрокаПолучателей) Или ПустаяСтрока(Текст) Тогда
		Результат.ОписаниеОшибки = НСтр("ru = 'Неверные параметры сообщения'");
		Возврат Результат;
	КонецЕсли;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("user",	 Логин);
	ПараметрыЗапроса.Вставить("pass",	 Пароль);
	ПараметрыЗапроса.Вставить("gzip",	 "none");
	ПараметрыЗапроса.Вставить("action",	 "post_sms");
	ПараметрыЗапроса.Вставить("message", Текст);
	ПараметрыЗапроса.Вставить("target",	 СтрокаПолучателей);
	ПараметрыЗапроса.Вставить("sender",	 ИмяОтправителя);
	
	// отправка запроса
	ИмяФайлаОтвета = ВыполнитьЗапрос(ПараметрыЗапроса);
	Если ПустаяСтрока(ИмяФайлаОтвета) Тогда
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("ru = 'Соединение не установлено'");
		Возврат Результат;
	КонецЕсли;		
	
	// Обработка результата запроса (получение идентификаторов сообщений).
	СтруктураОтвета = Новый ЧтениеXML;
	СтруктураОтвета.ОткрытьФайл(ИмяФайлаОтвета);
	ОписаниеОшибки = "";
	Пока СтруктураОтвета.Прочитать() Цикл 
		Если СтруктураОтвета.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если СтруктураОтвета.Имя = "sms" Тогда 
				ИдентификаторСообщения = "";
				НомерПолучателя = "";
				Пока СтруктураОтвета.ПрочитатьАтрибут() Цикл 
					Если СтруктураОтвета.Имя = "id" Тогда 
						ИдентификаторСообщения = СтруктураОтвета.Значение;
					ИначеЕсли СтруктураОтвета.Имя = "phone" Тогда
						НомерПолучателя = СтруктураОтвета.Значение;
					КонецЕсли;
				КонецЦикла;
				Если Не ПустаяСтрока(НомерПолучателя) Тогда
					ОтправленноеСообщение = Новый Структура("НомерПолучателя,ИдентификаторСообщения",
														 НомерПолучателя,ИдентификаторСообщения);
					Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
				КонецЕсли;
			ИначеЕсли СтруктураОтвета.Имя = "error" Тогда
				СтруктураОтвета.Прочитать();
				ОписаниеОшибки = ОписаниеОшибки + СтруктураОтвета.Значение + Символы.ПС;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СтруктураОтвета.Закрыть();
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Результат.ОписаниеОшибки = СокрП(ОписаниеОшибки);
	
	Возврат Результат;
	
КонецФункции

// Возвращает текстовое представление статуса доставки сообщения.
//
// Параметры:
//  ИдентификаторСообщения - Строка - идентификатор, присвоенный sms при отправке;
//  Логин			- Строка - логин пользователя услуги отправки sms;
//  Пароль			- Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Строка - статус доставки. См. описание функции ОтправкаSMS.СтатусДоставки.
Функция СтатусДоставкиБилайн(ИдентификаторСообщения, Логин, Пароль)
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("user",	 Логин);
	ПараметрыЗапроса.Вставить("pass",	 Пароль);
	ПараметрыЗапроса.Вставить("gzip",	 "none");
	ПараметрыЗапроса.Вставить("action",	 "status");
	ПараметрыЗапроса.Вставить("sms_id",	 ИдентификаторСообщения);
	
	// отправка запроса
	ИмяФайлаОтвета = ВыполнитьЗапрос(ПараметрыЗапроса);
	Если ПустаяСтрока(ИмяФайлаОтвета) Тогда
		Возврат "Ошибка";
	КонецЕсли;
	
	// Обработка результата запроса.
	SMSSTS_CODE = "";
	ТекущийSMS_ID = "";
	СтруктураОтвета = Новый ЧтениеXML;
	СтруктураОтвета.ОткрытьФайл(ИмяФайлаОтвета);
	Пока СтруктураОтвета.Прочитать() Цикл 
		Если СтруктураОтвета.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если СтруктураОтвета.Имя = "MESSAGE" Тогда 
				Пока СтруктураОтвета.ПрочитатьАтрибут() Цикл 
					Если СтруктураОтвета.Имя = "SMS_ID" Тогда 
						ТекущийSMS_ID = СтруктураОтвета.Значение;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли СтруктураОтвета.Имя = "SMSSTC_CODE" И ИдентификаторСообщения = ТекущийSMS_ID Тогда
				СтруктураОтвета.Прочитать();
				SMSSTS_CODE = СтруктураОтвета.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СтруктураОтвета.Закрыть();
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Возврат СтатусДоставкиSMSМТС(SMSSTS_CODE); 
	
КонецФункции

Функция СтатусДоставкиSMSБилайн(СтатусСтрокой)
	
	СоответствиеСтатусов = Новый Соответствие;
	СоответствиеСтатусов.Вставить("", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("queued", "НеОтправлялось");
	СоответствиеСтатусов.Вставить("wait", "Отправляется");
	СоответствиеСтатусов.Вставить("accepted", "Отправлено");
	СоответствиеСтатусов.Вставить("delivered", "Доставлено");
	СоответствиеСтатусов.Вставить("failed", "НеДоставлено");
	
	Результат = СоответствиеСтатусов[НРег(СтатусСтрокой)];
	Возврат ?(Результат = Неопределено, "Ошибка", Результат);
	
КонецФункции

Функция ВыполнитьЗапрос(ПараметрыЗапроса)
	
	Результат = "";
	
	ИмяФайлаЗапроса = СформироватьФайлДляPOSTЗапроса(ПараметрыЗапроса);
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("xml");
	
	// формирование заголовка
	Заголовок = Новый Соответствие;
	Заголовок.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовок.Вставить("Content-Length", XMLСтрока(РазмерФайла(ИмяФайлаЗапроса)));
	
	// Отправка запроса и получение ответа.
	Попытка
		Соединение = Новый HTTPСоединение("beeline.amega-inform.ru", , , , ПолучитьПрокси("http"), 60);
		Соединение.ОтправитьДляОбработки(ИмяФайлаЗапроса, "/sendsms/", ИмяФайлаОтвета, Заголовок);
		Результат = ИмяФайлаОтвета;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отправка SMS'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаЗапроса);
	
	Возврат Результат;
	
КонецФункции

Функция РазмерФайла(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	Возврат Файл.Размер();
	
КонецФункции

Функция МассивПолучателейСтрокой(Массив, КодСтраны = "")
	
	Результат = "";
	Для Каждого Элемент Из Массив Цикл
		Номер = ФорматироватьНомер(Элемент, КодСтраны);
		Если Не ПустаяСтрока(Номер) Тогда 
			Если Не ПустаяСтрока(Результат) Тогда
				Результат = Результат + ",";
			КонецЕсли;
			Результат = Результат + Номер;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
	
КонецФункции

// Возвращает список разрешений для отправки SMS с использованием всех доступных провайдеров.
//
// Возвращаемое значение:
//  Массив.
//
Функция РазрешенияБилайн() Экспорт
	
	Протокол = "HTTP";
	Адрес = "beeline.amega-inform.ru";
	Порт = Неопределено;
	Описание = НСтр("ru = 'Отправка SMS через Билайн.'");
	
	Разрешения = Новый Массив;
	Разрешения.Добавить(РазрешениеНаИспользованиеИнтернетРесурса(Протокол, Адрес, Порт, Описание));
	
	Возврат Разрешения;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ТурбоСМС

// Отправляет SMS через веб-сервис Turbo SMS, возвращает идентификатор сообщения.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ (строкой);
//  Текст             - Строка - текст сообщения, длиной не более 1000 символов;
//  ИмяОтправителя    - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин             - Строка - логин пользователя услуги отправки sms;
//  Пароль            - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки    - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьСМСЧерезТурбоСМС(НомераПолучателей, Текст, ИмяОтправителя, Логин, Знач Пароль, КодСтраны)
	
	ТекстСообщения = НСтр("ru = 'Не удалось отправить смс по причине: %Причина%'");
	
	Результат = Новый Структура("ОтправленныеСообщения, ОписаниеОшибки", Новый Массив, "");
	
	Cookie = Auth(Логин, Пароль);
	
	Если Cookie <> Неопределено Тогда
		
		WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		WinHttp.Open("POST", "http://turbosms.in.ua/api/soap.html", Ложь);
		WinHttp.setRequestHeader("COOKIE", Cookie);
		
		Для каждого Элемент Из НомераПолучателей Цикл
			
			НомерПолучателя = ФорматироватьНомер(Элемент, КодСтраны);
			
			sXML =
			"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
			|    <soapenv:Header/>
			|    <soapenv:Body>
			|       <tur:SendSMS>
			|           <tur:sender>" + СокрЛП(ИмяОтправителя) + "</tur:sender>
			|           <tur:destination>" + СокрЛП(НомерПолучателя) + "</tur:destination>
			|           <tur:text>" + СокрЛП(Текст) + "</tur:text>
			|       </tur:SendSMS>
			|    </soapenv:Body>
			|</soapenv:Envelope>";
			
			WinHttp.Send(sXML);
			Если WinHttp.Status = 200 Тогда
				ОтветСервера = WinHttp.ResponseText();
				Если Найти(ОтветСервера, "Сообщения успешно отправлены") > 0 Тогда
					Результат.ОтправленныеСообщения.Добавить(ОтветСервера);
				Иначе
					Результат.ОписаниеОшибки = ОтветСервера;
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОтветСервера);
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
						УровеньЖурналаРегистрации.Предупреждение,
						,
						,
						ТекстСообщения);
				КонецЕсли;
			Иначе
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", НСтр("ru = 'не удалось установить соединение с сервером провайдера. Проверьте настройки соединения.'"));
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
					УровеньЖурналаРегистрации.Предупреждение,
					,
					,
					ТекстСообщения);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", НСтр("ru = 'не удалось авторизоваться на сервере провайдера. Проверьте настройки соединения.'"));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Auth(Логин, Пароль)
	
	WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
	WinHttp.Open("POST", "http://turbosms.in.ua/api/soap.html", Ложь);
	sXML =
	"<soapenv:Envelope xmlns:soapenv=""http://schemas.xmlsoap.org/soap/envelope/"" xmlns:tur=""http://turbosms.in.ua/api/Turbo"">
	|    <soapenv:Header/>
	|    <soapenv:Body>
	|        <tur:Auth>
	|           <tur:login>" + СокрЛП(Логин) + "</tur:login>
	|           <tur:password>" + СокрЛП(Пароль) + "</tur:password>
	|        </tur:Auth>
	|    </soapenv:Body>
	|</soapenv:Envelope>";
	
	WinHttp.Send(sXML);
	Если WinHttp.Status = 200 Тогда
		Если Найти(WinHttp.ResponseText(), "Вы успешно авторизировались") > 0 Тогда
			Возврат WinHttp.getResponseHeader("Set-Cookie");
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// SMS.ru

// Отправляет SMS через SMS.RU.
//
// Параметры:
//  НомераПолучателей - Массив - номера получателей в формате +7ХХХХХХХХХХ;
//  Текст             - Строка - текст сообщения, длиной не более 480 символов;
//  ИмяОтправителя    - Строка - имя отправителя, которое будет отображаться вместо номера входящего SMS;
//  Логин             - Строка - логин пользователя услуги отправки sms;
//  Пароль            - Строка - пароль пользователя услуги отправки sms.
//
// Возвращаемое значение:
//  Структура: ОтправленныеСообщения - Массив структур: НомерОтправителя.
//                                                  ИдентификаторСообщения.
//             ОписаниеОшибки        - Строка - пользовательское представление ошибки, если пустая строка,
//                                          то ошибки нет.
Функция ОтправитьСМСЧерезСМСРУ(НомераПолучателей, Текст, ИмяОтправителя, Логин, Пароль, КодСтраны) Экспорт
	
	Результат = Новый Структура("ОтправленныеСообщения, ОписаниеОшибки", Новый Массив, "");
	
	// Подготовка строки получателей.
	СтрокаПолучателей = МассивПолучателейСтрокой(НомераПолучателей, КодСтраны);
	
	// Проверка на заполнение обязательных параметров.
	Если ПустаяСтрока(СтрокаПолучателей) Или ПустаяСтрока(Текст) Тогда
		Результат.ОписаниеОшибки = НСтр("ru = 'Неверные параметры сообщения'");
		Возврат Результат;
	КонецЕсли;
	
	// Подготовка параметров запроса.
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("login", Логин);
	ПараметрыЗапроса.Вставить("password", Пароль);
	ПараметрыЗапроса.Вставить("text", Текст);
	ПараметрыЗапроса.Вставить("to", СтрокаПолучателей);
	ПараметрыЗапроса.Вставить("from", ИмяОтправителя);
	
	// отправка запроса
	ИмяФайлаОтвета = ВыполнитьЗапросСМСРУ("sms/send", ПараметрыЗапроса);
	Если ПустаяСтрока(ИмяФайлаОтвета) Тогда
		Результат.ОписаниеОшибки = Результат.ОписаниеОшибки + НСтр("ru = 'Соединение не установлено'");
		Возврат Результат;
	КонецЕсли;
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаОтвета);
	ОтветСервера = ЧтениеТекста.ПрочитатьСтроку();
	Если ОтветСервера = "100" Тогда
		Для Каждого НомерПолучателя Из НомераПолучателей Цикл
			ИдентификаторСообщения = ЧтениеТекста.ПрочитатьСтроку();
			Если ИдентификаторСообщения = Неопределено Тогда
				Результат.ОписаниеОшибки = НСтр("ru = 'Ответ сервера не распознан'");
				Прервать;
			КонецЕсли;
			
			Если Не ПустаяСтрока(НомерПолучателя) Тогда
				ОтправленноеСообщение = Новый Структура("НомерПолучателя, ИдентификаторСообщения",
					НомерПолучателя, ИдентификаторСообщения);
				Результат.ОтправленныеСообщения.Добавить(ОтправленноеСообщение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка SMS'"), УровеньЖурналаРегистрации.Ошибка,,, НСтр("ru = 'Код ошибки:'") + " " + ОтветСервера);
	КонецЕсли;
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяФайлаОтвета);
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьЗапросСМСРУ(ИмяМетода, ПараметрыЗапроса)
	
	Результат = "";
	
	ИмяФайлаЗапроса = СформироватьФайлДляPOSTЗапроса(ПараметрыЗапроса);
	ИмяФайлаОтвета = ПолучитьИмяВременногоФайла("txt");
	
	// формирование заголовка
	Заголовок = Новый Соответствие;
	Заголовок.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Заголовок.Вставить("Content-Length", XMLСтрока(РазмерФайла(ИмяФайлаЗапроса)));
	
	// Отправка запроса и получение ответа.
	Попытка
		Соединение = Новый HTTPСоединение("sms.ru", , , , ПолучитьПрокси("http"), 60, Новый ЗащищенноеСоединениеOpenSSL);
		Соединение.ОтправитьДляОбработки(ИмяФайлаЗапроса, "/" + ИмяМетода, ИмяФайлаОтвета, Заголовок);
		Результат = ИмяФайлаОтвета;
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отправка SMS'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	УдалитьФайлы(ИмяФайлаЗапроса);
	
	Возврат Результат;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Служебные процедуры и функции

Функция ФорматироватьНомер(Номер, Знач КодСтраны = "")
	
	Результат = "";
	ДопустимыеСимволы = "1234567890";
	Для Позиция = 1 По СтрДлина(Номер) Цикл
		Символ = Сред(Номер, Позиция, 1);
		Если Найти(ДопустимыеСимволы, Символ) > 0 Тогда
			Результат = Результат + Символ;
		КонецЕсли;
	КонецЦикла;
	
	КодСтраны = СокрЛП(КодСтраны);
	Если ЗначениеЗаполнено(КодСтраны) Тогда
		Если Лев(Результат, СтрДлина(КодСтраны)) <> КодСтраны Тогда
			Результат = КодСтраны + Результат;
		КонецЕсли;
	ИначеЕсли СтрДлина(Результат) = 10 И Лев(Результат, 1) <> 7 Тогда
		Результат = "7" + Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает внутреннее описание разрешения на использование интернет-ресурса.
//
// Параметры:
//  Протокол: Строка - протокол, по которому выполняется взаимодействие с ресурсом. Допустимые
//    значения:
//      IMAP,
//      POP3,
//      SMTP,
//      HTTP,
//      HTTPS,
//      FTP,
//      FTPS,
//  Адрес - Строка - адрес ресурса без указания протокола,
//  Порт - Число - номер порта через который выполняется взаимодействие с ресурсом,
//  Описание - Строка - описание причины, по которой требуется предоставление разрешения.
//
// Возвращаемое значение:
//  ОбъектXDTO - внутреннее описание запрашиваемого разрешения.
//  Предназначен только для передачи в качестве параметра в функции.
//  РаботаВБезопасномРежиме.ЗапросНаИспользованиеВнешнихРесурсов(),
//  РаботаВБезопасномРежиме.ЗапросНаОтменуРазрешенийИспользованияВнешнихРесурсов() и
//  РаботаВБезопасномРежиме.ЗапросНаОчисткуРазрешенийИспользованияВнешнихРесурсов().
//
Функция РазрешениеНаИспользованиеИнтернетРесурса(Знач Протокол, Знач Адрес, Знач Порт = Неопределено, Знач Описание = "")
	
	Если Порт = Неопределено Тогда
		СтандартныеПорты = СтандартныеПортыИнтернетПротоколов();
		Если СтандартныеПорты.Свойство(ВРег(Протокол)) <> Неопределено Тогда
			Порт = СтандартныеПорты[ВРег(Протокол)];
		КонецЕсли;
	КонецЕсли;
	
	Пакет = Метаданные.ПакетыXDTO.PL_ApplicationPermissions_1_0_0_2.ПространствоИмен;
	Результат = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(Пакет, "InternetResourceAccess"));
	Результат.Description = Описание;
	
	Результат.Protocol = Протокол;
	Результат.Host = Адрес;
	Результат.Port = Порт;
	
	Возврат Результат;
	
КонецФункции

// Возвращает стандартные сетевые порты для Интернет-протоколов, инструменты для использования которых
//  есть во встроенном языке 1С:Предприятия. Используется для определения сетевого порта в тех
//  случаях, когда из прикладного кода запрашивается разрешение без указания сетевого порта.
//
// Возвращаемое значение: ФиксированнаяСтруктура:
//                          * Ключ - Строка, имя Интернет-протокола,
//                          * Значение - Число, номер сетевого порта.
//
Функция СтандартныеПортыИнтернетПротоколов()
	
	Результат = Новый Структура();
	
	Результат.Вставить("IMAP",  143);
	Результат.Вставить("POP3",  110);
	Результат.Вставить("SMTP",  25);
	Результат.Вставить("HTTP",  80);
	Результат.Вставить("HTTPS", 443);
	Результат.Вставить("FTP",   21);
	Результат.Вставить("FTPS",  21);
	
	Возврат Новый ФиксированнаяСтруктура(Результат);
	
КонецФункции

Функция СформироватьФайлДляPOSTЗапроса(ПараметрыЗапроса)
	
	СтрокаЗапроса = "";
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Если Не ПустаяСтрока(СтрокаЗапроса) Тогда
			СтрокаЗапроса = СтрокаЗапроса + "&";
		КонецЕсли;
		СтрокаЗапроса = СтрокаЗапроса + Параметр.Ключ + "=" + КодироватьСтроку(Параметр.Значение, СпособКодированияСтроки.КодировкаURL);
	КонецЦикла;
	
	ИмяФайлаЗапроса = ПолучитьИмяВременногоФайла("txt");
	
	ФайлЗапроса = Новый ЗаписьТекста(ИмяФайлаЗапроса, КодировкаТекста.ANSI);
	ФайлЗапроса.Записать(СтрокаЗапроса);
	ФайлЗапроса.Закрыть();
	
	Возврат ИмяФайлаЗапроса;
	
КонецФункции

// Создает экземпляр ИнтернетПрокси по сохраненным настройкам.
Функция ПолучитьПрокси(Протокол)
	
	НастройкаПроксиСервера = ПустыеНастройкиПроксиСервера();
	
	ИспользоватьПрокси = НастройкаПроксиСервера.Получить("ИспользоватьПрокси");
	ИспользоватьСистемныеНастройки = НастройкаПроксиСервера.Получить("ИспользоватьСистемныеНастройки");
	Если ИспользоватьПрокси Тогда
		Если ИспользоватьСистемныеНастройки Тогда
			// Системные настройки прокси-сервера
			Прокси = Новый ИнтернетПрокси(Истина);
		Иначе
			
			// Настройки прокси-сервера, заданные вручную
			Прокси = Новый ИнтернетПрокси;
			
			// Определение адреса и порта прокси-сервера
			ДополнительныеНастройки = НастройкаПроксиСервера.Получить("ДополнительныеНастройкиПрокси");
			ПроксиПоПротоколу = Неопределено;
			Если ТипЗнч(ДополнительныеНастройки) = Тип("Соответствие") Тогда
				ПроксиПоПротоколу = ДополнительныеНастройки.Получить(Протокол);
			КонецЕсли;
			
			Если ТипЗнч(ПроксиПоПротоколу) = Тип("Структура") Тогда
				Прокси.Установить(Протокол, ПроксиПоПротоколу.Адрес, ПроксиПоПротоколу.Порт);
			Иначе
				Прокси.Установить(Протокол, НастройкаПроксиСервера["Сервер"], НастройкаПроксиСервера["Порт"]);
			КонецЕсли;
			
			Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = НастройкаПроксиСервера["НеИспользоватьПроксиДляЛокальныхАдресов"];
			Прокси.Пользователь = НастройкаПроксиСервера["Пользователь"];
			Прокси.Пароль       = НастройкаПроксиСервера["Пароль"];
			
			АдресаИсключений = НастройкаПроксиСервера.Получить("НеИспользоватьПроксиДляАдресов");
			Если ТипЗнч(АдресаИсключений) = Тип("Массив") Тогда
				Для каждого АдресИсключения Из АдресаИсключений Цикл
					Прокси.НеИспользоватьПроксиДляАдресов.Добавить(АдресИсключения);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		// Не использовать прокси-сервер
		Прокси = Новый ИнтернетПрокси(Ложь);
	КонецЕсли;
	
	Возврат Прокси;
	
КонецФункции

Функция ПустыеНастройкиПроксиСервера()
	
	НастройкаПроксиСервера = Новый Соответствие;
	НастройкаПроксиСервера.Вставить("ИспользоватьПрокси", Ложь);
	НастройкаПроксиСервера.Вставить("Пользователь", "");
	НастройкаПроксиСервера.Вставить("Пароль", "");
	НастройкаПроксиСервера.Вставить("Порт", "");
	НастройкаПроксиСервера.Вставить("Сервер", "");
	НастройкаПроксиСервера.Вставить("НеИспользоватьПроксиДляЛокальныхАдресов", Ложь);
	НастройкаПроксиСервера.Вставить("ИспользоватьСистемныеНастройки", Ложь);
	
	Возврат НастройкаПроксиСервера;
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL - Строка - месторасположение wsdl
//  URIПространстваИмен - Строка - URI пространства имен web-сервиса
//  ИмяСервиса - Строка - имя сервиса
//  ИмяТочкиПодключения - Строка - если не задано, образуется как <ИмяСервиса>Soap
//  ИмяПользователя - Строка - имя пользователя для входа на сервер
//  Пароль - Строка - пароль пользователя
//  Таймаут - Число - таймаут на операции выполняемые через полученное прокси 
//
// Возвращаемое значение:
//  WSПрокси
//
Функция WSПрокси(
			Знач АдресWSDL,
			Знач URIПространстваИмен,
			Знач ИмяСервиса,
			Знач ИмяТочкиПодключения = "",
			Знач ИмяПользователя,
			Знач Пароль,
			Знач Таймаут = Неопределено,
			Знач ДелатьКонтрольныйВызов = Ложь
	)
	
	Если ДелатьКонтрольныйВызов И Таймаут <> Неопределено И Таймаут > 20 Тогда
		
		WSПроксиPing = ВнутренняяWSПрокси(
			АдресWSDL,
			URIПространстваИмен,
			ИмяСервиса,
			ИмяТочкиПодключения,
			ИмяПользователя,
			Пароль,
			3);
		
		Попытка
			WSПроксиPing.Ping();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'WSПрокси'"),
				УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат ВнутренняяWSПрокси(
		АдресWSDL,
		URIПространстваИмен,
		ИмяСервиса,
		ИмяТочкиПодключения,
		ИмяПользователя,
		Пароль,
		Таймаут);
	
КонецФункции

// Функция возвращает объект WSПрокси созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL - Строка - месторасположение wsdl
//  URIПространстваИмен - Строка - URI пространства имен web-сервиса
//  ИмяСервиса - Строка - имя сервиса
//  ИмяТочкиПодключения - Строка - если не задано, образуется как <ИмяСервиса>Soap
//  ИмяПользователя - Строка - имя пользователя для входа на сервер
//  Пароль - Строка - пароль пользователя
//  Таймаут - Число - таймаут на операции выполняемые через полученное прокси 
//
// Возвращаемое значение:
//  WSПрокси
//
Функция ВнутренняяWSПрокси(Знач АдресWSDL, Знач URIПространстваИмен, Знач ИмяСервиса,
	Знач ИмяТочкиПодключения = "", Знач ИмяПользователя, Знач Пароль,
	Знач Таймаут = Неопределено)
	
	WSОпределения = WSОпределения(АдресWSDL, ИмяПользователя, Пароль);
	
	Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
		ИмяТочкиПодключения = ИмяСервиса + "Soap";
	КонецЕсли;
	
	Параметры = Новый Массив;
	Параметры.Добавить(WSОпределения);
	Параметры.Добавить(URIПространстваИмен);
	Параметры.Добавить(ИмяСервиса);
	Параметры.Добавить(ИмяТочкиПодключения);
	Параметры.Добавить(Таймаут);
	
	Прокси = Новый(Тип("WSПрокси"), Параметры);
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль = Пароль;
	
	Возврат Прокси;
	
КонецФункции

// Функция возвращает объект WSОпределения созданный с переданными параметрами.
//
// Параметры:
//  АдресWSDL - Строка - месторасположение wsdl
//  ИмяПользователя - Строка - имя пользователя для входа на сервер
//  Пароль - Строка - пароль пользователя
//  Таймаут - Число - таймаут на получение wsdl
//
// Примечание: при получении определения используется кэш, обновление которого осуществляется
//  при смене версии конфигурации. Если для целей отладки требуется обновить
//  значения в кэше, раньше этого времени, следует удалить из регистра сведений 
//  КэшПрограммныхИнтерфейсов соответствующие записи.
//
Функция WSОпределения(Знач АдресWSDL, Знач ИмяПользователя, Знач Пароль, Знач Таймаут = 10)
	
	ДоступноПолучениеФайловИзИнтернета = Ложь;
	Попытка
		Выполнить("ДоступноПолучениеФайловИзИнтернета = ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует(""СтандартныеПодсистемы.ПолучениеФайловИзИнтернета"")");
	Исключение
		ДоступноПолучениеФайловИзИнтернета = Ложь;
	КонецПопытки;
	
	Если ДоступноПолучениеФайловИзИнтернета Тогда
	
		ПараметрыПолучения = Новый Массив;
		ПараметрыПолучения.Добавить(АдресWSDL);
		ПараметрыПолучения.Добавить(ИмяПользователя);
		ПараметрыПолучения.Добавить(Пароль);
		ПараметрыПолучения.Добавить(Таймаут);
		
		ДанныеWSDL = Неопределено;
		Попытка
			Выполнить("ДанныеWSDL = ОбщегоНазначенияПовтИсп.ПолучитьДанныеКэшаВерсий(
				|АдресWSDL,
				|Перечисления.ТипыДанныхКэшаПрограммныхИнтерфейсов.ОписаниеWebСервиса,
				|ЗначениеВСтрокуXML(ПараметрыПолучения),
				|Ложь)");
		Исключение
			
			Параметры = Новый Массив;
			Параметры.Добавить(АдресWSDL);
			Параметры.Добавить(ИмяПользователя);
			Параметры.Добавить(Пароль);
			Параметры.Добавить(Таймаут);
			
			Возврат Новый(Тип("WSОпределения"), Параметры);
		КонецПопытки;
		
		ИмяФайлаWSDL = ПолучитьИмяВременногоФайла("wsdl");
		
		ДанныеWSDL.Записать(ИмяФайлаWSDL);
		
		Определения = Новый WSОпределения(ИмяФайлаWSDL);
		
		Попытка
			УдалитьФайлы(ИмяФайлаWSDL);
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Получение WSDL'"),
				УровеньЖурналаРегистрации.Ошибка, , , ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		Возврат Определения;
	Иначе
		
		Параметры = Новый Массив;
		Параметры.Добавить(АдресWSDL);
		Параметры.Добавить(ИмяПользователя);
		Параметры.Добавить(Пароль);
		Параметры.Добавить(Таймаут);
		
		Возврат Новый(Тип("WSОпределения"), Параметры);
	КонецЕсли;
	
КонецФункции

// Возвращает значение в виде XML-строки.
// Преобразованы в XML-строку (сериализованы) могут быть только те объекты, 
// для которых в описании указано, что они сериализуются.
//
// Параметры:
// Значение – Произвольный. Значение, которое необходимо сериализовать в XML-строку.
//
// Возвращаемое значение:
// XML-строка представления значения в сериализованном виде.
//
Функция ЗначениеВСтрокуXML(Значение)
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	СериализаторXDTO.ЗаписатьXML(ЗаписьXML, Значение, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции
