
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ЗаполнитьДекорации();
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДекорации()
	Попытка
		Элементы.ДекорацияИНН.Заголовок = "ИНН: " + Организация.ИНН;
	Исключение
	КонецПопытки;
	Попытка
		Элементы.ДекорацияОГРН.Заголовок = "ОГРН: " + Организация.ОГРН;
	Исключение
	КонецПопытки;
	Попытка
		Элементы.ДекорацияОГРН.Заголовок = "ОГРН: " + Организация.РегистрационныйНомер;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ДекорацияИНН.Заголовок = "Выберите организацию";
	Элементы.ДекорацияОГРН.Заголовок = "";
КонецПроцедуры

&НаКлиенте
Процедура Активировать(Команда)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ПинКод", ПинКод);
	СтруктураОтвета.Вставить("ОрганизацияРегистрации", Организация);
	Закрыть(СтруктураОтвета);
КонецПроцедуры
