////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторВладельца = Параметры.УникальныйИдентификатор;
	
	Если ЗначениеЗаполнено(Параметры.АдресСхемыКомпоновкиДанных) Тогда
		ПЛ_УведомленияОСобытиях.СкопироватьСхемуКомпоновкиДанных(АдресСхемыКомпоновкиДанных, Параметры.АдресСхемыКомпоновкиДанных);
		ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных, Параметры.АдресНастроекКомпоновкиДанных);
	Иначе
		СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
		АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ИдентификаторВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		ИзмененаСхемаКомпоновкиДанных(ВыбранноеЗначение, АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, ИдентификаторВладельца);
	#КонецЕсли
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "Проверка" Тогда
		ПроверитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатКомпоновкиОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЭтоАдресВременногоХранилища(АдресДанныхРасшифровки) Тогда
		ЗначениеПоля = ЗначениеПоляРасшифровки(Расшифровка, АдресДанныхРасшифровки);
		Если ЗначениеПоля <> Неопределено Тогда
			ПоказатьЗначение(, ЗначениеПоля);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	ЗавершитьРедактированиеНастроек();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхему(Команда)
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
			
			ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
			// Создается копия редактируемой схемы
			СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXDTO(СериализаторXDTO.ЗаписатьXDTO(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных)));
			
		Иначе
			
			СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных;
			
		КонецЕсли;
		
		// Копия редактируемой схемы открывается в конструкторе
		Конструктор = Новый КонструкторСхемыКомпоновкиДанных(СхемаКомпоновкиДанных);
		Конструктор.Редактировать(ЭтаФорма);
		
	#Иначе
		
		Предупреждение(НСтр("ru='Для редактирования схемы компоновки необходимо запустить конфигурацию в режиме толстого клиента.'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСхемуИзФайла(Команда)
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		
		ВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ВыборФайла.ПолноеИмяФайла = "";
		ВыборФайла.Заголовок = НСтр("ru = 'Выбор схемы компоновки данных'");
		ВыборФайла.Фильтр = НСтр("ru = 'Схема компоновки данных (*.xml)|*.xml'");
		
		Если ВыборФайла.Выбрать() Тогда
			
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ВыборФайла.ПолноеИмяФайла, КодировкаТекста.UTF8);
			Текст = ТекстовыйДокумент.ПолучитьТекст();
			
			ЗагрузитьСхемуИзФайлаНаСервере(Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, УникальныйИдентификатор)
	
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	
	Возврат ПоместитьВоВременноеХранилище(КомпоновщикНастроек.ПолучитьНастройки(), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСхемуИзФайлаНаСервере(ТекстXML)
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML();
		ЧтениеXML.УстановитьСтроку(ТекстXML);
		СхемаКомпоновкиДанных = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
		ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, ИдентификаторВладельца);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзмененаСхемаКомпоновкиДанных(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных, КомпоновщикНастроек, ИдентификаторВладельца)
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСхемыКомпоновкиДанных);
	
	// Компоновщик настроек инициализируется редактируемой схемой
	ПЛ_УведомленияОСобытиях.ИнициализироватьКомпоновщикНастроек(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных)
	
	ПЛ_УведомленияОСобытиях.ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактированиеНастроек()
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		
		ПоместитьНастройкиВСхемуКомпоновкиДанных(КомпоновщикНастроек, АдресСхемыКомпоновкиДанных);
		
		Результат = Новый Структура("АдресСхемы, АдресНастроек",
			АдресСхемыКомпоновкиДанных,
			ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек, ИдентификаторВладельца));
		
		Оповестить("Завершено_редактирование_схемы_регламентной_проверки", Результат, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаСервере()
	
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиДанных) Тогда
		
		РезультатКомпоновки.Очистить();
		
		Попытка
			
			ДанныеРасшифровки = Неопределено;
			
			СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
			
			НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
			
			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
			
			ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			ПроцессорВывода.УстановитьДокумент(РезультатКомпоновки);
			ПроцессорВывода.Вывести(ПроцессорКомпоновки);
			
			Если ДанныеРасшифровки <> Неопределено Тогда
				АдресДанныхРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, УникальныйИдентификатор);
			КонецЕсли;
			
		Исключение
			
			Элементы.РезультатКомпоновки.ОтображениеСостояния.Текст = "Не удалось вывести результат компоновки";
			Элементы.РезультатКомпоновки.ОтображениеСостояния.Видимость = Истина;
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеПоляРасшифровки(Расшифровка, АдресДанныхРасшифровки)
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(АдресДанныхРасшифровки);
	
	ПоляРасшифровки = ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
	
	Если ПоляРасшифровки.Количество()
		И ЗначениеЗаполнено(ПоляРасшифровки[0].Значение) Тогда
		Возврат ПоляРасшифровки[0].Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции



