
Функция ТоварыНаДоставке(АктВозвратаТоваровНаСклад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаДоставкеОстатки.ЗаданиеНаДоставку,
	|	ТоварыНаДоставкеОстатки.ДокументРеализации,
	|	ТоварыНаДоставкеОстатки.Номенклатура,
	|	ТоварыНаДоставкеОстатки.КоличествоОстаток КАК Количество,
	|	ТоварыНаДоставкеОстатки.КоличествоВозвращенногоТовараОстаток КАК КоличествоВозвращенногоТовара
	|ИЗ
	|	РегистрНакопления.ТоварыНаДоставке.Остатки(
	|			,
	|			ЗаданиеНаДоставку В
	|					(ВЫБРАТЬ
	|						АктВозвратаТоваровНаСклад.ЗаданиеНаДоставку
	|					ИЗ
	|						Документ.АктВозвратаТоваровНаСклад КАК АктВозвратаТоваровНаСклад
	|					ГДЕ
	|						АктВозвратаТоваровНаСклад.Ссылка = &АктВозвратаТоваровНаСклад)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						АктВозвратаТоваровНаСкладТовары.Номенклатура
	|					ИЗ
	|						Документ.АктВозвратаТоваровНаСклад.Товары КАК АктВозвратаТоваровНаСкладТовары
	|					ГДЕ
	|						АктВозвратаТоваровНаСкладТовары.Ссылка = &АктВозвратаТоваровНаСклад)) КАК ТоварыНаДоставкеОстатки";
	
	Запрос.УстановитьПараметр("АктВозвратаТоваровНаСклад", АктВозвратаТоваровНаСклад);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата
	
КонецФункции

Функция ЗаданияРеализацииНоменклатура_ПоЗаданию(ЗаданиеНаДоставку) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки
		|ПОМЕСТИТЬ ДокументыСборки
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ЗаданиеНаДоставку,
		|	СборкаЗаказовПокупателяЗаказано.Ссылка КАК Сборка
		|ПОМЕСТИТЬ ЗаданиеиСборка
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|ГДЕ
		|	СборкаЗаказовПокупателяЗаказано.Ссылка В
		|			(ВЫБРАТЬ
		|				ДокументыСборки.ДокументСборки
		|			ИЗ
		|				ДокументыСборки КАК ДокументыСборки)
		|	И СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки КАК Сборка
		|ПОМЕСТИТЬ РеализацияИСборки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|ГДЕ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
		|	И РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки В
		|			(ВЫБРАТЬ
		|				ЗаданиеиСборка.Сборка
		|			ИЗ
		|				ЗаданиеиСборка КАК ЗаданиеиСборка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК ЗаявкаНаВозврат,
		|	ЗаданиеНаДоставкуДоставка.Ссылка КАК ЗаданиеНаДоставку
		|ПОМЕСТИТЬ ЗаданияИЗаявкиНаВозврат
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки ССЫЛКА Документ.ЗаявкаНаВозврат
		|	И ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияИСборки.Реализация,
		|	ЗаданиеиСборка.ЗаданиеНаДоставку
		|ПОМЕСТИТЬ ЗаданияИРеализации
		|ИЗ
		|	РеализацияИСборки КАК РеализацияИСборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаданиеиСборка КАК ЗаданиеиСборка
		|		ПО РеализацияИСборки.Сборка = ЗаданиеиСборка.Сборка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияИСборки.Реализация,
		|	ЗаданиеиСборка.ЗаданиеНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданияИРеализации.ЗаданиеНаДоставку,
		|	ЗаданияИРеализации.Реализация КАК ДокументРеализации,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	0 КАК КоличествоВозвращенногоТовара
		|ИЗ
		|	ЗаданияИРеализации КАК ЗаданияИРеализации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ЗаданияИРеализации.Реализация = РеализацияТоваровУслугТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданияИРеализации.Реализация,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	ЗаданияИРеализации.ЗаданиеНаДоставку
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗаданияИЗаявкиНаВозврат.ЗаданиеНаДоставку,
		|	ЗаданияИЗаявкиНаВозврат.ЗаявкаНаВозврат,
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	0,
		|	СУММА(ЗаявкаНаВозвратТовары.Количество)
		|ИЗ
		|	ЗаданияИЗаявкиНаВозврат КАК ЗаданияИЗаявкиНаВозврат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
		|		ПО ЗаданияИЗаявкиНаВозврат.ЗаявкаНаВозврат = ЗаявкаНаВозвратТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	ЗаданияИЗаявкиНаВозврат.ЗаданиеНаДоставку,
		|	ЗаданияИЗаявкиНаВозврат.ЗаявкаНаВозврат";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата
	
КонецФункции

Функция ЗаданияРеализацияНоменклатура_ПоРеализации(Реализация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Реализация
		|	И РеализацияТоваровУслуг.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки КАК Сборка
		|ПОМЕСТИТЬ РеализацияИСборки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|ГДЕ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка В
		|			(ВЫБРАТЬ
		|				Реализации.Ссылка
		|			ИЗ
		|				Реализации КАК Реализации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Сборка,
		|	ЗаданиеНаДоставкуДоставка.Ссылка КАК Доставка
		|ПОМЕСТИТЬ СборкиИДоставки
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
		|			(ВЫБРАТЬ
		|				РеализацияИСборки.Сборка
		|			ИЗ
		|				РеализацияИСборки КАК РеализацияИСборки)
		|	И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияИСборки.Реализация КАК ДокументРеализации,
		|	СборкиИДоставки.Доставка КАК ЗаданиеНаДоставку
		|ПОМЕСТИТЬ РеализацииИДоставки
		|ИЗ
		|	РеализацияИСборки КАК РеализацияИСборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СборкиИДоставки КАК СборкиИДоставки
		|		ПО РеализацияИСборки.Сборка = СборкиИДоставки.Сборка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	РеализацииИДоставки.ДокументРеализации,
		|	РеализацииИДоставки.ЗаданиеНаДоставку,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		|ИЗ
		|	РеализацииИДоставки КАК РеализацииИДоставки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацииИДоставки.ДокументРеализации = РеализацияТоваровУслугТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацииИДоставки.ДокументРеализации,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацииИДоставки.ЗаданиеНаДоставку";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата
		
КонецФункции

Функция ЗаданияРеализацияНоменклатура_ПоВозврату(ВозвратОтПокупателя, СвязаннаяРТУ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &СвязаннаяРТУ
		|	И РеализацияТоваровУслуг.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки КАК Сборка
		|ПОМЕСТИТЬ РеализацияИСборки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|ГДЕ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка В
		|			(ВЫБРАТЬ
		|				Реализации.Ссылка
		|			ИЗ
		|				Реализации КАК Реализации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Сборка,
		|	ЗаданиеНаДоставкуДоставка.Ссылка КАК Доставка
		|ПОМЕСТИТЬ СборкиИДоставки
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
		|			(ВЫБРАТЬ
		|				РеализацияИСборки.Сборка
		|			ИЗ
		|				РеализацияИСборки КАК РеализацияИСборки)
		|	И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	РеализацияИСборки.Реализация КАК ДокументРеализации,
		|	СборкиИДоставки.Доставка КАК ЗаданиеНаДоставку,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК КоличествоВозвращенногоТовара
		|ИЗ
		|	РеализацияИСборки КАК РеализацияИСборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СборкиИДоставки КАК СборкиИДоставки
		|		ПО РеализацияИСборки.Сборка = СборкиИДоставки.Сборка,
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка = &ВозвратОтПокупателя
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияИСборки.Реализация,
		|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
		|	СборкиИДоставки.Доставка";
	
	Запрос.УстановитьПараметр("СвязаннаяРТУ", СвязаннаяРТУ);
	Запрос.УстановитьПараметр("ВозвратОтПокупателя", ВозвратОтПокупателя);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата	
	
КонецФункции

Функция ЗаданияРеализацияНоменклатура_ПоКорректировке(Корректировка, СвязаннаяРТУ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &СвязаннаяРТУ
		|	И РеализацияТоваровУслуг.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки КАК Сборка
		|ПОМЕСТИТЬ РеализацияИСборки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
		|ГДЕ
		|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка В
		|			(ВЫБРАТЬ
		|				Реализации.Ссылка
		|			ИЗ
		|				Реализации КАК Реализации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Сборка,
		|	ЗаданиеНаДоставкуДоставка.Ссылка КАК Доставка
		|ПОМЕСТИТЬ СборкиИДоставки
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
		|			(ВЫБРАТЬ
		|				РеализацияИСборки.Сборка
		|			ИЗ
		|				РеализацияИСборки КАК РеализацияИСборки)
		|	И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияИСборки.Реализация КАК ДокументРеализации,
		|	СборкиИДоставки.Доставка КАК ЗаданиеНаДоставку
		|ПОМЕСТИТЬ РеализацииИДоставки
		|ИЗ
		|	РеализацияИСборки КАК РеализацияИСборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СборкиИДоставки КАК СборкиИДоставки
		|		ПО РеализацияИСборки.Сборка = СборкиИДоставки.Сборка,
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Корректировка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияИСборки.Реализация,
		|	СборкиИДоставки.Доставка
		|
		|ИМЕЮЩИЕ
		|	СУММА(КорректировкаРеализацииТовары.КоличествоДоИзменения - КорректировкаРеализацииТовары.Количество) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	РеализацииИДоставки.ЗаданиеНаДоставку,
		|	РеализацииИДоставки.ДокументРеализации,
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	СУММА(КорректировкаРеализацииТовары.КоличествоДоИзменения - КорректировкаРеализацииТовары.Количество) КАК КоличествоВозвращенногоТовара
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары,
		|	РеализацииИДоставки КАК РеализацииИДоставки
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка = &Корректировка
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииТовары.Номенклатура,
		|	РеализацииИДоставки.ЗаданиеНаДоставку,
		|	РеализацииИДоставки.ДокументРеализации
		|
		|ИМЕЮЩИЕ
		|	СУММА(КорректировкаРеализацииТовары.КоличествоДоИзменения - КорректировкаРеализацииТовары.Количество) > 0";
	
	Запрос.УстановитьПараметр("СвязаннаяРТУ", СвязаннаяРТУ);
	Запрос.УстановитьПараметр("Корректировка", Корректировка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата
		
КонецФункции

Функция ПроведениеВозвратаИлиКорректировкиРазрешено(ВозвратИлирректировка, СвязаннаяРТУ) Экспорт
	
	ПроведениеПоРНТоварыНаДоставкеРазрешено = Ложь;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыНаДоставкеОбороты.ЗаданиеНаДоставку,
	|	ТоварыНаДоставкеОбороты.ДокументРеализации
	|ИЗ
	|	РегистрНакопления.ТоварыНаДоставке.Обороты(, , , ДокументРеализации = &СвязаннаяРТУ) КАК ТоварыНаДоставкеОбороты";
	
	Запрос.УстановитьПараметр("СвязаннаяРТУ", СвязаннаяРТУ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЗаданиеНаДоставкуДляПроверки = ВыборкаДетальныеЗаписи.ЗаданиеНаДоставку;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект,
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект
		|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусВыполнения)
		|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыВыполнения.Выполнено)";
		
		Запрос.УстановитьПараметр("Объект", ЗаданиеНаДоставкуДляПроверки);
		
		Если Запрос.Выполнить().Пустой() Тогда
			ПроведениеПоРНТоварыНаДоставкеРазрешено = Истина;		
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ПроведениеПоРНТоварыНаДоставкеРазрешено;
	
КонецФункции

Функция ПолучитьДвиженияПоДокументу(Ссылка) Экспорт

	ЗапросПоДвижениям = Новый Запрос;
	ЗапросПоДвижениям.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаДоставке.Период,
		|	ТоварыНаДоставке.Регистратор,
		|	ТоварыНаДоставке.НомерСтроки,
		|	ТоварыНаДоставке.Активность,
		|	ТоварыНаДоставке.ВидДвижения,
		|	ТоварыНаДоставке.ЗаданиеНаДоставку,
		|	ТоварыНаДоставке.ДокументРеализации,
		|	ТоварыНаДоставке.Номенклатура,
		|	ТоварыНаДоставке.Количество,
		|	ТоварыНаДоставке.КоличествоВозвращенногоТовара,
		|	ТоварыНаДоставке.МоментВремени
		|ИЗ
		|	РегистрНакопления.ТоварыНаДоставке КАК ТоварыНаДоставке
		|ГДЕ
		|	ТоварыНаДоставке.Регистратор = &Ссылка";
		
	ЗапросПоДвижениям.УстановитьПараметр("Ссылка", Ссылка);
		
	СтарыеДвиженияПоТоварамНаДоставке = ЗапросПоДвижениям.Выполнить().Выгрузить();

	Возврат СтарыеДвиженияПоТоварамНаДоставке;
	
КонецФункции

Функция ТоварПередан(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)
	|	И ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);  
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

Процедура ИзменитьДатуПередачи(Реализация) Экспорт
	
	ВремяДоставки = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	ВремяДоставки.Отбор.Объект.Установить(Реализация);
	ВремяДоставки.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПередачи);
	
	УстановитьПривилегированныйРежим(Истина);	
	ВремяДоставки.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);  
	
	Если ВремяДоставки.Количество() = 0 Тогда
		
		НовоеВремяДоставки = ВремяДоставки.Добавить();
		НовоеВремяДоставки.Объект = Реализация;
		НовоеВремяДоставки.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПередачи;  
		
	Иначе
		НовоеВремяДоставки = ВремяДоставки[0];
	КонецЕсли;
	
	НовоеВремяДоставки.Значение = ТекущаяДата();
	
	УстановитьПривилегированныйРежим(Истина);	
	ВремяДоставки.Записать();
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры

Функция ТаблицаСобранныхСборокПоКонтрагенту(Контрагент, ТипДоставки,мТаксиДоставка = Ложь, Договор, СписокСборок = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Сборка,
	|	МАКСИМУМ(НЕ ТоварыВСборкеОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)) КАК СторСклад
	|ПОМЕСТИТЬ СторСкладыВСборках
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			Сборка.Грузополучатель = &Грузополучатель
	|				И Сборка.СпособДоставки = &ТипДоставки
	|				И Сборка.ТаксиДоставка = &ТаксиДоставка
	|				И Сборка.Договор = &Договор
	|				И (&БезОтбораПоСборкам
	|					ИЛИ ВЫБОР
	|						КОГДА Сборка.Грузополучатель.ОбъединятьГМВТЕ
	|							ТОГДА Сборка В (&СписокСборок)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ)) КАК ТоварыВСборкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОстатки.Сборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.Сборка.Ответственный КАК Ответственный,
	|	ТоварыВСборкеОстатки.Сборка.ВремяНачалаСборки КАК НачалоСборки,
	|	ТоварыВСборкеОстатки.Сборка.ВремяНачалаКомплектации КАК НачалоКомплектации,
	|	ТоварыВСборкеОстатки.Сборка.УпаковыватьСамовывоз КАК УпаковыватьСамовывоз,
	|	ЕСТЬNULL(СторСкладыВСборках.СторСклад, ЛОЖЬ) КАК ЕстьСторСклад
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			Сборка.Грузополучатель = &Грузополучатель
	|				И Сборка.СпособДоставки = &ТипДоставки
	|				И Сборка.ТаксиДоставка = &ТаксиДоставка
	|				И Сборка.Договор = &Договор
	|				И (&БезОтбораПоСборкам
	|					ИЛИ ВЫБОР
	|						КОГДА Сборка.Грузополучатель.ОбъединятьГМВТЕ
	|							ТОГДА Сборка В (&СписокСборок)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ)) КАК ТоварыВСборкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ СторСкладыВСборках КАК СторСкладыВСборках
	|		ПО ТоварыВСборкеОстатки.Сборка = СторСкладыВСборках.Сборка";

	Запрос.УстановитьПараметр("Грузополучатель", Контрагент);
	Запрос.УстановитьПараметр("ТипДоставки", ТипДоставки); 
	Запрос.УстановитьПараметр("Договор", Договор); 
	
	//+Белов А. 10.02.2025 #UT10-5077
	Запрос.УстановитьПараметр("СписокСборок", ?(СписокСборок = Неопределено, Новый СписокЗначений, СписокСборок)); 
	Запрос.УстановитьПараметр("БезОтбораПоСборкам", ?(СписокСборок <> Неопределено, СписокСборок.Количество() = 0, Истина));
	//-Белов А. 10.02.2025 #UT10-5077

	Если НЕ мТаксиДоставка = Неопределено И ТипДоставки = Перечисления.СпособДоставки.Самовывоз Тогда
		Запрос.УстановитьПараметр("ТаксиДоставка", мТаксиДоставка);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Сборка.ТаксиДоставка = &ТаксиДоставка", "");
	КонецЕсли;

	СобранныеСборки = Запрос.Выполнить().Выгрузить();
	
	Возврат СобранныеСборки
	
КонецФункции

Процедура ОтправкаДокументовВ_СБИС() Экспорт   
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Работа с товарами на доставке", УровеньЖурналаРегистрации.Предупреждение, , ,"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");	
		Возврат; 
		
	КонецЕсли;
	
	Обработки.ОтправкаДокументовСБИС.ВыполнитьКоманду();
	
КонецПроцедуры