
Процедура ИсправитьТоварыОрганизаций() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Месяц));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(НачалоМесяца(Месяц)));
	Запрос.Текст = "ВЫБРАТЬ
	               |	КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка
	               |ИЗ
	               |	Документ.КорректировкаЗаписейРегистров.ТаблицаРегистровНакопления КАК КорректировкаЗаписейРегистровТаблицаРегистровНакопления
	               |ГДЕ
	               |	КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Имя ПОДОБНО ""ТоварыОрганизаций""
	               |	И КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.Комментарий ПОДОБНО ""Исправление регистра Товары орагнизаций, создан автоматически""
	               |	И НЕ КорректировкаЗаписейРегистровТаблицаРегистровНакопления.Ссылка.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		 ДокКорректировка = Выборка.Ссылка.ПолучитьОбъект();
		 НЗ = РегистрыНакопления.ТоварыОрганизаций.СоздатьНаборЗаписей();
		 НЗ.Отбор.Регистратор.Установить(Выборка.Ссылка);
		 НЗ.Записать();
	Иначе
		 ДокКорректировка = Документы.КорректировкаЗаписейРегистров.СоздатьДокумент();		 
	КонецЕсли;
	
	СоздатьДОкументКорректировки(ДокКорректировка);
	
КонецПроцедуры

Процедура СоздатьДОкументКорректировки(ДокКорректировка)
    
	ДокКорректировка.Дата =  НачалоМесяца(Месяц);
	Движения = ДокКорректировка.Движения; 
	 
	НС = ДокКорректировка.ТаблицаРегистровНакопления.Добавить(); 
	НС.Имя = "ТоварыОрганизаций";
	НС.Представление = "Товары организаций";
	Движения_ТО = Движения.ТоварыОрганизаций;
	ДокКорректировка.Комментарий = "Исправление регистра Товары орагнизаций, создан автоматически";
	ДокКорректировка.Записать(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДокКорректировка.Дата);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыОрганизацийОстатки.Организация,
	               |	ТоварыОрганизацийОстатки.Комиссионер,
	               |	ТоварыОрганизацийОстатки.Номенклатура,
	               |	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры,
	               |	ТоварыОрганизацийОстатки.СерияНоменклатуры,
	               |	ТоварыОрганизацийОстатки.Качество,
	               |	ТоварыОрганизацийОстатки.Склад,
	               |	ТоварыОрганизацийОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_Организация1
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(
	               |			&Дата,
	               |			Организация В
	               |				(ВЫБРАТЬ
	               |					КатегорииОбъектов.Объект
	               |				ИЗ
	               |					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |				ГДЕ
	               |					КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УправленческийУчет))) КАК ТоварыОрганизацийОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыОрганизацийОстатки.Организация,
	               |	ТоварыОрганизацийОстатки.Комиссионер,
	               |	ТоварыОрганизацийОстатки.Номенклатура,
	               |	ТоварыОрганизацийОстатки.ХарактеристикаНоменклатуры,
	               |	ТоварыОрганизацийОстатки.СерияНоменклатуры,
	               |	ТоварыОрганизацийОстатки.Качество,
	               |	ТоварыОрганизацийОстатки.Склад,
	               |	ТоварыОрганизацийОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ ВТ_Организация2
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(
	               |			&Дата,
	               |			Организация В
	               |				(ВЫБРАТЬ
	               |					КатегорииОбъектов.Объект
	               |				ИЗ
	               |					РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |				ГДЕ
	               |					КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.РегламентированныйУчет))) КАК ТоварыОрганизацийОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Организация1.Номенклатура,
	               |	ВТ_Организация1.ХарактеристикаНоменклатуры,
	               |	ВТ_Организация1.СерияНоменклатуры,
	               |	ВТ_Организация1.Качество,
	               |	ВТ_Организация1.Склад,
	               |	ВТ_Организация1.КоличествоОстаток КАК ОстатокОрганизация1,
	               |	ВТ_Организация2.КоличествоОстаток КАК ОстатокОрганизация2
	               |ПОМЕСТИТЬ ВТ_СвернутыеСтроки
	               |ИЗ
	               |	ВТ_Организация1 КАК ВТ_Организация1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Организация2 КАК ВТ_Организация2
	               |		ПО ВТ_Организация1.Номенклатура = ВТ_Организация2.Номенклатура
	               |			И ВТ_Организация1.ХарактеристикаНоменклатуры = ВТ_Организация2.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация1.СерияНоменклатуры = ВТ_Организация2.СерияНоменклатуры
	               |			И ВТ_Организация1.Качество = ВТ_Организация2.Качество
	               |			И ВТ_Организация1.Склад = ВТ_Организация2.Склад
	               |ГДЕ
	               |	ВТ_Организация1.КоличествоОстаток + ВТ_Организация2.КоличествоОстаток = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Организация1.Организация КАК Организация,
	               |	ВТ_Организация1.Комиссионер,
	               |	ВТ_Организация1.Номенклатура КАК Номенклатура,
	               |	ВТ_Организация1.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВТ_Организация1.СерияНоменклатуры КАК СерияНоменклатуры,
	               |	ВТ_Организация1.Качество,
	               |	ВТ_Организация1.Склад,
	               |	ВТ_Организация1.КоличествоОстаток
	               |ИЗ
	               |	ВТ_Организация1 КАК ВТ_Организация1
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвернутыеСтроки КАК ВТ_СвернутыеСтроки
	               |		ПО ВТ_Организация1.Номенклатура = ВТ_СвернутыеСтроки.Номенклатура
	               |			И ВТ_Организация1.ХарактеристикаНоменклатуры = ВТ_СвернутыеСтроки.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация1.СерияНоменклатуры = ВТ_СвернутыеСтроки.СерияНоменклатуры
	               |			И ВТ_Организация1.Качество = ВТ_СвернутыеСтроки.Качество
	               |			И ВТ_Организация1.Склад = ВТ_СвернутыеСтроки.Склад
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Организация2.Организация,
	               |	ВТ_Организация2.Комиссионер,
	               |	ВТ_Организация2.Номенклатура,
	               |	ВТ_Организация2.ХарактеристикаНоменклатуры,
	               |	ВТ_Организация2.СерияНоменклатуры,
	               |	ВТ_Организация2.Качество,
	               |	ВТ_Организация2.Склад,
	               |	ВТ_Организация2.КоличествоОстаток
	               |ИЗ
	               |	ВТ_Организация2 КАК ВТ_Организация2
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СвернутыеСтроки КАК ВТ_СвернутыеСтроки
	               |		ПО ВТ_Организация2.Номенклатура = ВТ_СвернутыеСтроки.Номенклатура
	               |			И ВТ_Организация2.ХарактеристикаНоменклатуры = ВТ_СвернутыеСтроки.ХарактеристикаНоменклатуры
	               |			И ВТ_Организация2.СерияНоменклатуры = ВТ_СвернутыеСтроки.СерияНоменклатуры
	               |			И ВТ_Организация2.Качество = ВТ_СвернутыеСтроки.Качество
	               |			И ВТ_Организация2.Склад = ВТ_СвернутыеСтроки.Склад
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура,
	               |	ХарактеристикаНоменклатуры,
	               |	СерияНоменклатуры,
	               |	Организация";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	    Движение = Движения_ТО.Добавить();
	    Движение.Период 			= ДокКорректировка.Дата;
	    Движение.Регистратор 		= ДокКорректировка.Ссылка;
	    Движение.ВидДвижения 		= ?(Выборка.КоличествоОстаток > 0, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		Движение.Количество 		= ?(Выборка.КоличествоОстаток > 0, Выборка.КоличествоОстаток, -Выборка.КоличествоОстаток);
	    Движение.Активность			= Истина;
	    Движение.Организация		= Выборка.Организация;
	    Движение.Комиссионер  		= Выборка.Комиссионер;
	    Движение.Номенклатура		= Выборка.Номенклатура; 
		Движение.ХарактеристикаНоменклатуры	= Выборка.ХарактеристикаНоменклатуры;
		Движение.СерияНоменклатуры	= Выборка.СерияНоменклатуры;
		Движение.Качество			= Выборка.Качество;
		Движение.Склад				= Выборка.Склад;
		//Движение.Количество 		= Выборка.КоличествоОстаток;
	КонецЦикла;
	
	Движения_ТО.Записать();
	ДокКорректировка.Записать();
	
КонецПроцедуры
