
Функция PM_6951_FOR_PORTAL(IncomingSettings)
	
	// +++ Гавриленков, 12.11.2021, WARES-215
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6951_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Запуск. PM_6951_FOR_PORTAL");
	
	Результат = МСКWEB.PM_6951_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6951_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_6951_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	// --- Гавриленков, 12.11.2021
	Возврат Результат;
КонецФункции
