
Процедура ПриЗаписи(Отказ, Замещение)
	//+Сёмин Р. 17.11.2025 #UT10-5529
	Если НЕ Отказ Тогда
		ПроверитьНеобходимостьИПоместитьСтатусВОчередь();
	КонецЕсли;
	//-Сёмин Р. 17.11.2025 #UT10-5529
КонецПроцедуры

Процедура ПроверитьНеобходимостьИПоместитьСтатусВОчередь()
	//+Сёмин Р. 17.11.2025 #UT10-5529
	Если Константы.ЗаписыватьДанныеВРегистрСтатусыЗаказов.Получить() Тогда
		
		Для Каждого Стр Из ЭтотОбъект Цикл
			
			Если ТипЗнч(Стр.Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				И Стр.Свойство = ПредопределенноеЗначение("ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки")
				И Стр.Значение = Перечисления.СтатусыДоставки.ТоварПередан Тогда
				
				СтатусыЗаказов.ПоместитьВОчередьВФоне(Стр.Объект);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//-Сёмин Р. 17.11.2025 #UT10-5529
КонецПроцедуры

