Перем Почта;
Перем УчетнаяЗапись;

Функция  ПолучитьЗапрос(ПромДата)
	
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.УстановитьПараметр("ДатаПроверки", ПромДата);
	ЗапросТоваров.Текст =
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацииСрезПоследних.ФизическоеЛицо
	|ПОМЕСТИТЬ ОсновнаяОрганизация
	|ИЗ
	|	Константы КАК Константы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(, ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизации.Руководитель)) КАК ОтветственныеЛицаОрганизацииСрезПоследних
	|		ПО Константы.ОсновнаяОрганизация = ОтветственныеЛицаОрганизацииСрезПоследних.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК ОстатокЗаказано,
	|	ТоварыГотовыеКСборкеОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОстатокКСборке,
	|	ЗаказыПокупателейОстатки.СуммаВзаиморасчетовОстаток,
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя.СпособДоставки КАК СпособДоставки
	|ПОМЕСТИТЬ Неотгружено
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, НЕ ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)) КАК ЗаказыПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.ОстаткиИОбороты(, , , , НЕ ЗаказПокупателя.IDЗаказаПортал = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)) КАК ТоварыГотовыеКСборкеОстаткиИОбороты
	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыГотовыеКСборкеОстаткиИОбороты.ЗаказПокупателя
	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыГотовыеКСборкеОстаткиИОбороты.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Неотгружено.Номенклатура,
	|	Неотгружено.ЗаказПокупателя,
	|	Неотгружено.ОстатокЗаказано,
	|	Неотгружено.ОстатокКСборке,
	|	Неотгружено.СуммаВзаиморасчетовОстаток КАК СуммаОстаток,
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	Неотгружено.СпособДоставки
	|ПОМЕСТИТЬ НеотгруженоСПТУ
	|ИЗ
	|	Неотгружено КАК Неотгружено
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО Неотгружено.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И Неотгружено.ЗаказПокупателя = ПоступлениеТоваровУслугТовары.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеотгруженоСПТУ.ЗаказПокупателя.Контрагент КАК Контрагент,
	|	НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель КАК Филиал,
	|	НеотгруженоСПТУ.ЗаказПокупателя,
	|	НеотгруженоСПТУ.ЗаказПокупателя.ДатаОтгрузки КАК ДатаОтгрузки,
	|	НеотгруженоСПТУ.Номенклатура.Родитель КАК Производитель,
	|	НеотгруженоСПТУ.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	НеотгруженоСПТУ.Номенклатура,
	|	НеотгруженоСПТУ.ОстатокЗаказано КАК КоличествоОстаток,
	|	НеотгруженоСПТУ.СуммаОстаток,
	|	ТоварыВЯчейкахОстаткиИОбороты.Период КАК Оприходованно,
	|	ЕСТЬNULL(НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ОсновнойМенеджер,
	|	ВЫБОР
	|		КОГДА НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо = НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.МенеджерМСК
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|		ИНАЧЕ НеотгруженоСПТУ.ЗаказПокупателя.Грузополучатель.МенеджерМСК
	|	КОНЕЦ КАК АссистентТП,
	|	НеотгруженоСПТУ.СпособДоставки
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	НеотгруженоСПТУ КАК НеотгруженоСПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(
	|				,
	|				,
	|				Регистратор,
	|				,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						НеотгруженоСПТУ.Номенклатура
	|					ИЗ
	|						НеотгруженоСПТУ КАК НеотгруженоСПТУ)) КАК ТоварыВЯчейкахОстаткиИОбороты
	|		ПО НеотгруженоСПТУ.Ссылка = ТоварыВЯчейкахОстаткиИОбороты.Регистратор.ДокументОснование
	|			И НеотгруженоСПТУ.Номенклатура = ТоварыВЯчейкахОстаткиИОбороты.Номенклатура
	|ГДЕ
	|	ТоварыВЯчейкахОстаткиИОбороты.Период < &ДатаПроверки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновнаяОрганизация.ФизическоеЛицо КАК РуководительОрганизации,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.ОсновнойМенеджер = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|			ТОГДА ИтоговаяТаблица.АссистентТП
	|		ИНАЧЕ ИтоговаяТаблица.ОсновнойМенеджер
	|	КОНЕЦ КАК Ответственный,
	|	ИтоговаяТаблица.Контрагент,
	|	ИтоговаяТаблица.Филиал,
	|	ИтоговаяТаблица.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ИтоговаяТаблица.ДатаОтгрузки,
	|	ИтоговаяТаблица.Производитель,
	|	ИтоговаяТаблица.КодПроизводителя,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.КоличествоОстаток,
	|	ИтоговаяТаблица.СуммаОстаток,
	|	ИтоговаяТаблица.Оприходованно,
	|	ИтоговаяТаблица.СпособДоставки
	|ПОМЕСТИТЬ ТаблицаОтправки
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица,
	|	ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтправки.РуководительОрганизации КАК РуководительОрганизации,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100)) КАК АдресЭлПочты,
	|	ТаблицаОтправки.Ответственный КАК Ответственный,
	|	ТаблицаОтправки.Контрагент,
	|	ТаблицаОтправки.Филиал,
	|	ТаблицаОтправки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаОтправки.ДатаОтгрузки,
	|	ТаблицаОтправки.Производитель,
	|	ТаблицаОтправки.КодПроизводителя,
	|	ТаблицаОтправки.Номенклатура,
	|	ТаблицаОтправки.КоличествоОстаток,
	|	ТаблицаОтправки.СуммаОстаток,
	|	ТаблицаОтправки.Оприходованно,
	|	ТаблицаОтправки.СпособДоставки
	|ИЗ
	|	ТаблицаОтправки КАК ТаблицаОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|			ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
	|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УведомлениеОНеотгруженныхТоварахСтороннихСкладов))
	|		ПО ТаблицаОтправки.РуководительОрганизации = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтправки.Ответственный КАК Ответственный,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100)) КАК АдресЭлПочты,
	|	ТаблицаОтправки.Контрагент,
	|	ТаблицаОтправки.Филиал,
	|	ТаблицаОтправки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТаблицаОтправки.ДатаОтгрузки,
	|	ТаблицаОтправки.Производитель,
	|	ТаблицаОтправки.КодПроизводителя,
	|	ТаблицаОтправки.Номенклатура,
	|	ТаблицаОтправки.КоличествоОстаток,
	|	ТаблицаОтправки.СуммаОстаток,
	|	ТаблицаОтправки.Оприходованно,
	|	ТаблицаОтправки.СпособДоставки
	|ИЗ
	|	ТаблицаОтправки КАК ТаблицаОтправки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|			ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
	|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.УведомлениеОНеотгруженныхТоварахСтороннихСкладов))
	|		ПО ТаблицаОтправки.Ответственный = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ответственный,
	|	ЗаказПокупателя
	|ИТОГИ
	|	МАКСИМУМ(АдресЭлПочты)
	|ПО
	|	Ответственный";
	
	Возврат ЗапросТоваров;

КонецФункции		

Процедура СформироватьОтчет(ДатаОтчета) Экспорт
	
	ЗапросТоваров = ПолучитьЗапрос(ДатаОтчета); 
	ДанныеДляОтчета = ЗапросТоваров.ВыполнитьПакет()[5].Выгрузить();
	
	Если НЕ ДанныеДляОтчета.Количество() = 0 Тогда
		
		МакетОтчета = ЭтотОбъект.ПолучитьМакет("Макет");
		ТекБаза = Константы.База.Получить();
		
		ТаблДокРуководителя = Новый ТабличныйДокумент; 
		ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
		ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
		ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
		ТаблДокРуководителя.Вывести(ШапкаОтчета);
		
		Для Каждого СтрокаРезультата Из ДанныеДляОтчета Цикл
			
			СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
			СтрокаОтчета.Параметры.Заполнить(СтрокаРезультата);
			ТаблДокРуководителя.Вывести(СтрокаОтчета);			
			
		КонецЦикла;		
		
		ТаблДокРуководителя.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТаблДокРуководителя.АвтоМасштаб = Истина;
		ТаблДокРуководителя.Показать();	
		
	КонецЕсли;	

КонецПроцедуры

Процедура СформироватьРегламентом() Экспорт 
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	Почта = Новый ИнтернетПочта; 	
	
	Попытка
		
		Почта.Подключиться(Профиль);
		УдалосьПодключиться = Истина;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу");
		Возврат;
		
	КонецПопытки;
	
	МакетОтчета = ЭтотОбъект.ПолучитьМакет("Макет");
	ТекБаза = Константы.База.Получить();
	
	//Отправим сводный отчет руководителю филиала
	ЗапросТоваров = ПолучитьЗапрос(НачалоДня(ТекущаяДата() - 86400 * 3));
	ДанныеДляОтчетаРуководителю = ЗапросТоваров.ВыполнитьПакет()[5].Выгрузить();
	
	Если НЕ ДанныеДляОтчетаРуководителю.Количество() = 0 Тогда
		
		Если ЗначениеЗаполнено(ДанныеДляОтчетаРуководителю[0].АдресЭлПочты) Тогда			
			
			ТаблДокРуководителя = Новый ТабличныйДокумент;
			
			ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
			ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
			ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
			ТаблДокРуководителя.Вывести(ШапкаОтчета);
			
			Для Каждого СтрокаРезультата Из ДанныеДляОтчетаРуководителю Цикл
				
				СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
				СтрокаОтчета.Параметры.Заполнить(СтрокаРезультата);
				ТаблДокРуководителя.Вывести(СтрокаОтчета);			
				
			КонецЦикла;			
			
			ТаблДокРуководителя.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
			ТаблДокРуководителя.АвтоМасштаб = Истина; 
			
			СтруктураФайла = Новый Структура("ИмяВременногоФайла,ИмяДляОтправки", ПолучитьИмяВременногоФайла(".XLSX"), 
			                "Отчет по неотгруженным товарам сторонних складов (сводный) от " + Формат(ТекущаяДата(), "ДФ=dd_MM_yyyy") + ".XLSX");
			ТаблДокРуководителя.Записать(СтруктураФайла.ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
			
			ОтправитьПисьмо(СокрЛП(ДанныеДляОтчетаРуководителю[0].АдресЭлПочты), СтруктураФайла);
			
			Попытка	
				УдалитьФайлы(СтруктураФайла.ИмяВременногоФайла); 
			Исключение 
			КонецПопытки;
			
			СтруктураФайла.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Отправим отчеты ответственным менеджерам	
	ДанныедляОтчетаМенеджеров = ЗапросТоваров.Выполнить();
	
	Если НЕ ДанныедляОтчетаМенеджеров.Пустой() Тогда
		
		ВыборкаМенеджеров = ДанныедляОтчетаМенеджеров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаМенеджеров.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаМенеджеров.АдресЭлПочты) Тогда
				
				ТаблДокМенеджера = Новый ТабличныйДокумент;
				
				ШапкаОтчета = МакетОтчета.ПолучитьОбласть("ШапкаОтчета");
				ШапкаОтчета.Параметры.Филиал = СокрЛП(ТекБаза); 
				ШапкаОтчета.Параметры.ДатаОтчета = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
				ТаблДокМенеджера.Вывести(ШапкаОтчета);
				
				ВыборкаЗаказы = ВыборкаМенеджеров.Выбрать();
				
				Пока ВыборкаЗаказы.Следующий() Цикл
					
					СтрокаОтчета = МакетОтчета.ПолучитьОбласть("СтрокаОтчета");
					СтрокаОтчета.Параметры.Заполнить(ВыборкаЗаказы);
					ТаблДокМенеджера.Вывести(СтрокаОтчета);				
					
				КонецЦикла;		
				
				ТаблДокМенеджера.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
				ТаблДокМенеджера.АвтоМасштаб = Истина;
				
				СтруктураФайла = Новый Структура("ИмяВременногоФайла,ИмяДляОтправки", ПолучитьИмяВременногоФайла(".XLSX"), 
				                "Отчет по неотгруженным товарам сторонних складов от " + Формат(ТекущаяДата(), "ДФ=dd_MM_yyyy") + ".XLSX");
				ТаблДокМенеджера.Записать(СтруктураФайла.ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
				
				ОтправитьПисьмо(СокрЛП(ВыборкаМенеджеров.АдресЭлПочты),СтруктураФайла);
				
				Попытка	
					УдалитьФайлы(СтруктураФайла.ИмяВременногоФайла); 
				Исключение 
				КонецПопытки;
				
				СтруктураФайла.Очистить();
				
			КонецЕсли;	
			
		КонецЦикла; 
		
	КонецЕсли;
	
	УчетнаяЗапись = Неопределено;
	Почта = Неопределено;

КонецПроцедуры

Процедура ОтправитьПисьмо(АдресЭлПочты,СтруктураФайла)  
	
	Сообщение = Новый ИнтернетПочтовоеСообщение;
	Сообщение.Тема = "Отчет по неотгруженным товарам сторонних складов на " + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy") + "";
	
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(АдресЭлПочты, ";");
	
	Для Каждого ТекАдрес Из МассивАдресов Цикл
		Сообщение.Получатели.Добавить(ТекАдрес); 
	КонецЦикла; 
	
	Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
	Сообщение.Вложения.Добавить(Новый ДвоичныеДанные(СтруктураФайла.ИмяВременногоФайла), СтруктураФайла.ИмяДляОтправки);
	
	Попытка
		
		Почта.Послать(Сообщение);
		ТекстСообщения = "Отправлен отчета по неотгруженным товарам сторонних складов на адрес : " + АдресЭлПочты;
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
		
	Исключение
		
		ТекстСообщения = "Не отправлен отчета по неотгруженным товарам сторонних складов на адрес : " + АдресЭлПочты;
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		
	КонецПопытки;
	
	Сообщение.Получатели.Очистить();
	Сообщение.Вложения.Очистить();	

КонецПроцедуры
