#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВопроса(ТекстВопроса, ОписаниеОповещения)

	ПараметрыФормыВопроса = Новый Структура("ТекстВопроса", ТекстВопроса);
	ФормаВопроса = ПолучитьФорму(ПолучитьПутьКОбработке() + "ФормаВопроса", ПараметрыФормыВопроса, ЭтаФорма);
	ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВопроса.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции
&НаСервере
Функция ПолучитьПутьКОбработке()	
	ПутьКФормам = ПолучитьОбъектОбработки().Метаданные().ПолноеИмя() + ".Форма.";	
	Возврат ПутьКФормам;
КонецФункции
&НаКлиенте
Функция ПолучитьОбщийМодульКлиента()
	Возврат ПолучитьФорму(ПолучитьПутьКОбработке() + "ОбщийМодульКлиент");	
КонецФункции

&НаСервере
Процедура ВывестиУведомлениеПользователю(Знач ТекстСообщенияПользователю)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	ПолучитьОбъектОбработки().ДобавитьВЖурнал(ТекстСообщенияПользователю, "Модуль формы");
КонецПроцедуры


#КонецОбласти


#Область Интерфейс


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Организация", Объект.Организация);
	Параметры.Свойство("СопоставлениеПриЗагрузке", СопоставлениеПриЗагрузке);
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ТаблицаДанных = ОбработкаОбъект.ПолучитьТаблицуСопоставленияНоменклатур();
	ТаблицаСопоставления.Загрузить(ТаблицаДанных);
	Если СопоставлениеПриЗагрузке Тогда
		Элементы.ТаблицаСопоставления.Видимость = Ложь;
		МассивСтруктурыДанных = Параметры.ДанныеСопоставления;
		Для Каждого СтруктураДанных Из МассивСтруктурыДанных Цикл
			СтрокаТЧ = СопоставляемаяНоменклатура.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураДанных);
			СтрокаТЧ.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(СтрокаТЧ.ВнешняяНоменклатура);
		КонецЦикла;
	Иначе
		Элементы.СопоставляемаяНоменклатура.Видимость = Ложь;
		Элементы.УведомлениеОПроверке.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СохранитьТаблицуСопоставленияНаСервере()
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ТаблицаДанных = ТаблицаСопоставления.Выгрузить();
	Если СопоставлениеПриЗагрузке Тогда
		Для Каждого СтрокаТЧ Из СопоставляемаяНоменклатура Цикл
			СтрокаТД = ТаблицаДанных.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТД, СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	Результат = ОбработкаОбъект.СохранитьТаблицуСопоставленияНоменклатур(ТаблицаДанных);
	Возврат Результат;
КонецФункции
&НаКлиенте
Процедура СохранитьТаблицуСопоставления(Команда)
	Результат = СохранитьТаблицуСопоставленияНаСервере();
	Если НЕ Результат Тогда
		Сообщить("Ошибка сохранения! Проверьте журнал регистрации");
	Иначе
		Если СопоставлениеПриЗагрузке Тогда
			Закрыть();
		Иначе
			Сообщить("Сохранено успешно");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти