
Процедура ПередЗаписью(Отказ)
	
	Если ДатаНачала > ДатаОкончания И ЗначениеЗаполнено(ДатаОкончания) Тогда 
		
		Отказ = Истина;
		Сообщить("Дата начала действия доверенности не может быть больше даты окончания действия доверенности!");
		
	КонецЕсли;
	
	ЕстьОшибка = Ложь;
	
	Для Каждого Реквизит Из Метаданные.Справочники.ДоверенностиКонтрагентов.Реквизиты Цикл
		
		Если НЕ Реквизит.Имя = "Грузополучатель" И НЕ Реквизит.Имя = "Должность" 
			И НЕ Реквизит.Имя = "ДатаВыдачи" И НЕ Реквизит.Имя = "КемВыдана" И НЕ ЗначениеЗаполнено(ЭтотОбъект[Реквизит.Имя]) Тогда		
			
			Сообщить("Не заполнен реквизит " + СокрЛП(Реквизит.Синоним) + " !", СтатусСообщения.Внимание);
			ЕстьОшибка = Истина;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Отказ = ЕстьОшибка; 	
	
	Если НЕ Отказ И СокрЛП(Наименование) = "Доверенность" Тогда
		Наименование = "Доверенность № " + Номер + " от " + Формат(ДатаВыдачи, "ДЛФ = Д");
	КонецЕсли;   

КонецПроцедуры
