Функция ПолучитьРазмещение(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	МАКСИМУМ(ТоварыВЯчейкахОбороты.Период) КАК Период
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(
	|			,
	|			&ТекДата,
	|			Запись,
	|			Ячейка.Этаж > 0
	|				И Номенклатура = &Номенклатура
	|				И НЕ Ячейка.Код = ""Палета"") КАК ТоварыВЯчейкахОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОбороты.Ячейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Результат = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Результат + ", ";
		Результат = Результат + Выборка.Ячейка;		
	КонецЦикла;
	Если Результат = "" Тогда
		Результат = "ячейки неопределены";
	Иначе
		Результат = "ячейки: " + Сред(Результат, 3);
	КонецЕсли;
	Возврат Результат;
	
	
КонецФункции

Функция ПолучитьКодДляПоиска(Знач КодИсходный) Экспорт
	
	//+Шульман А. 31.03.2025 #UT10-5168    
	СтрокаПроверки = СокрЛП(КодИсходный);
	Длина          = СтрДлина(КодИсходный);  
	КодРезультат   = "";

	ДопустимыеСимволы = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	
	Для А = 1 По Длина Цикл
		
		Если Не Найти(ДопустимыеСимволы, Сред(СтрокаПроверки, А, 1)) = 0 Тогда
			КодРезультат = КодРезультат + Сред(СтрокаПроверки, А, 1);
		КонецЕсли; 
		
	КонецЦикла;    
	
	КодРезультат = ВРЕГ(КодРезультат);
	
	Возврат КодРезультат;
	//-Шульман А. 31.03.2025 #UT10-5168  

КонецФункции 

