Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;
Перем мЭтоНеНовый;

// Обработчик события элемента ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НазначениеИспользования = Неопределено;
		Артикул 				= "";
		КодПоБазеМоскоречье		= "";
		КодМДМ = "";
		КодАварда = "";

	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()


Функция РеквизитНеУникален(ТекРеквизит, ИмяРеквизита, ЗначениеТекст) 
	
	Если СокрЛП(ТекРеквизит)= "" Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура." + ИмяРеквизита + ",
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура.Ссылка) КАК Количество
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И Номенклатура." + ИмяРеквизита + " = &" + ИмяРеквизита + "
	|	И НЕ Номенклатура.Услуга
	|   И Номенклатура.Ссылка <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура."+ИмяРеквизита+"";
	
	Запрос.УстановитьПараметр(ИмяРеквизита,ТекРеквизит);
	
	Если ЭтоНовый() Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура.Ссылка <> &Ссылка", "");
	Иначе 
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Количество  <> 0  Тогда 
			#Если Клиент Тогда
				ТекстСообщения = "Уже существует номенклатура с реквизитом " + ЗначениеТекст + "  ='" + ТекРеквизит + "'
				|Запрещено создавать номенклатуру с дублирующимся реквизитом " + ЗначениеТекст + "!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);		
			#КонецЕсли
			
			Возврат Истина;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции 

Функция ПолучитьНормализованныйКод() Экспорт 
	
	Если ЗначениеЗаполнено(Родитель) Тогда 
		ПроизводительНоменклатуры = ВРег(СокрЛП(Родитель));
	Иначе
		ПроизводительНоменклатуры = "";
	КонецЕсли;
	
	//+Шульман А. 31.03.2025 #UT10-5168
	//ОчищенныйПроизводитель = "";
	//СтрокаПроверки = ПроизводительНоменклатуры;
	//Длина = СтрДлина(СтрокаПроверки);
	//
	//Для а = 1 По Длина Цикл
	//	
	//	Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
	//		ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
	//	КонецЕсли; 
	//	
	//КонецЦикла;	
	//
	//ОчищенныйКодПроизводителя = "";
	//СтрокаПроверки = СокрЛП(КодПроизводителя);
	//Длина = СтрДлина(СтрокаПроверки);
	//
	//Для а = 1 По Длина Цикл
	//	
	//	Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
	//		ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
	//	КонецЕсли; 
	//	
	//КонецЦикла;    
	
	ОчищенныйПроизводитель = Справочники.Номенклатура.ПолучитьКодДляПоиска(ПроизводительНоменклатуры);
	ОчищенныйКодПроизводителя = Справочники.Номенклатура.ПолучитьКодДляПоиска(КодПроизводителя);
	//-Шульман А. 31.03.2025 #UT10-5168
	
	Возврат ОчищенныйПроизводитель+ОчищенныйКодПроизводителя;

КонецФункции // ПолучитьНормализованныйКод()

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)
	
	Если мЭтоНеНовый = Неопределено Тогда
		мЭтоНеНовый = Не ЭтоНовый();
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
				РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
			#КонецЕсли
			Отказ = Истина;
			
		Иначе
			
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
				И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				
				ТекстСообщения = "У единицы хранения остатков номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;
		
		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
			И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			
			ТекстСообщения = "У единицы для отчетов номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			
		КонецЕсли;
		
		Если мЭтоНеНовый Тогда
			
			СуществуютСсылки = Неопределено;
			
			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				
				ТекстСообщения = "Единица """ + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + """ является единицей хранения остатков для """ + Наименование + """
				|и уже участвует в товародвижении. 
				|Изменить эту единицу уже нельзя!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				
			КонецЕсли;
			
			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
				И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				
			КонецЕсли;
			
			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|признак учета по сериям не может быть изменен!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
				РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "вид номенклатуры");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЭтоГруппа И НЕ ЗначениеЗаполнено(КодПоБазеМоскоречье) Тогда 
			КодПоБазеМоскоречье = Артикул;
		КонецЕсли;
		
		Если РеквизитНеУникален(Артикул, "Артикул", "артикул") ИЛИ  РеквизитНеУникален(КодПоБазеМоскоречье, "КодПоБазеМоскоречье", "код по базе Москворечье")
			ИЛИ РеквизитНеУникален(КодМДМ, "КодМДМ", "Код МДМ") Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			Наименование = МСК.ВычиститьНепечатныеСимволы(Наименование);
			НаименованиеПолное = МСК.ВычиститьНепечатныеСимволы(НаименованиеПолное);
			Артикул = МСК.ВычиститьНепечатныеСимволы(Артикул);
			КодПроизводителя = МСК.ВычиститьНепечатныеСимволы(КодПроизводителя);
			
			Если Не ВестиУчетПоСериям Тогда
				
				Если ЗначениеЗаполнено(НомерГТД) Тогда
					НомерГТД = Справочники.НомераГТД.ПустаяСсылка();
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
					СтранаПроисхождения = Справочники.КлассификаторСтранМира.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ПересчитыватьНормализованныйКод = Истина;
		
		Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() Тогда 
			
			ГруппаУценка = Константы.ГруппаНоменклатурыУценка.Получить();
			
			Если ЗначениеЗаполнено(ГруппаУценка) И Ссылка.Родитель <> Родитель Тогда
				
				Если Родитель = ГруппаУценка Тогда 
					ПредыдущийРодитель = Ссылка.Родитель;
				ИначеЕсли  Ссылка.Родитель = ГруппаУценка Тогда
					ПредыдущийРодитель = Справочники.Номенклатура.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;  
			
			Если Родитель = ГруппаУценка Тогда  
				ПересчитыватьНормализованныйКод = Ложь;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ПересчитыватьНормализованныйКод Тогда   
			
			НормализованныйКод_Эталон = ПолучитьНормализованныйКод();
			
			Если НормализованныйКод <> НормализованныйКод_Эталон Тогда 
				НормализованныйКод = НормализованныйКод_Эталон;
			КонецЕсли;
			
		КонецЕсли;
		
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, ";", " "); 
		
		//+Кабанов А.В. 27.08.2025 # UT10-5395
		//+Марков И. 11.07.2025 #UT10-5332
		Если Не ЭтоГруппа Тогда
			ПроверкаЗаполненияПоМаркировке(Отказ);
		КонецЕсли;
		//-Марков И. 11.07.2025 #UT10-5332
		//-Кабанов А.В. 27.08.2025 # UT10-5395
		
	КонецЕсли;
	
	Наименование = СтрЗаменить(Наименование, ";", " ");
	
	
	
КонецПроцедуры // ПередЗаписью()   

Процедура ПроверкаЗаполненияПоМаркировке(Отказ) 
//+Пашкин О. 10.06.2025 #UT10-5280
	
	Если ТребуетсяМаркировка Тогда
		
		Если НЕ ЗначениеЗаполнено(ТоварнаяГруппаЧестногоЗнака) Тогда
			
			#Если Клиент Тогда
				РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "Товарная группа честного знака");
			#КонецЕсли
			Отказ = Истина;
			
		Иначе
			
			Если ТоварнаяГруппаЧестногоЗнака.УказыватьДатуПроизводства И НЕ ЗначениеЗаполнено(СрокГодности) Тогда
				#Если Клиент Тогда
					РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "Срок годности (дни)");
				#КонецЕсли
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;   
		
		Если НЕ ЗначениеЗаполнено(GTIN) Тогда
			
			#Если Клиент Тогда
				РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "GTIN");
			#КонецЕсли
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
//-Пашкин О. 10.06.2025 #UT10-5280  
КонецПроцедуры
