
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает сохраненные ранее настройки уведомлений. Если настройки отсутствуют, то
// возвращается пустая структура настроек.
//
// Возвращаемое значение
//    Структура - значения настроек уведомлений
//
Функция ПолучитьНастройки() Экспорт
	
	Прочитать();
	СтруктураНастроек = Значение.Получить();
	
	Если СтруктураНастроек = Неопределено Тогда
		СтруктураНастроек = ПолучитьСтруктуруНастроек();
	КонецЕсли;
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Возвращает настройку уведомлений по имени
//
// Параметры
//    Имя - Строка- имя настройки
//
// Возвращаемое значение: значение настройки или Неопределено, если настройка не найдена
//
Функция ПолучитьНастройку(ИмяНастройки) Экспорт
	
	Настройка = Неопределено;
	
	Прочитать();
	СтруктураНастроек = Значение.Получить();
	
	Если СтруктураНастроек <> Неопределено Тогда
		СтруктураНастроек.Свойство(ИмяНастройки, Настройка);
	КонецЕсли;
	
	Возврат Настройка;
	
КонецФункции

// Сохраняет переданные в параметре настройки уведомлений
//
// Параметры
//    НастройкиУведомлений - Структура - значения сохраняемых настроек уведомлений
//
Процедура СохранитьНастройки(СтруктураНастроек) Экспорт
	
	Значение = Новый ХранилищеЗначения(СтруктураНастроек);
	Записать();
	
КонецПроцедуры

// Добавляет или заменяет существующую настройку в структуре настроек уведомлений
//
// Параметры
//    Имя - Строка - имя настройки
//    Значение - Произвольное - значение настройки
//
Процедура СохранитьНастройку(ИмяНастройки, ЗначениеНастройки) Экспорт
	
	Прочитать();
	СтруктураНастроек = Значение.Получить();
	
	Если СтруктураНастроек = Неопределено Тогда
		СтруктураНастроек = ПолучитьСтруктуруНастроек();
	КонецЕсли;
	
	СтруктураНастроек.Вставить(ИмяНастройки, ЗначениеНастройки);
	
	Значение = Новый ХранилищеЗначения(СтруктураНастроек);
	Записать();
	
КонецПроцедуры

// Заполняет настройки уведомлений значениями по умолчанию
//
Процедура ЗаполнитьНастройкиЗначениямиПоУмолчанию() Экспорт
	
	СтруктураНастроек = ПолучитьНастройки();
	
	// Почта
	ИмяСправочника = "УчетныеЗаписиЭлектроннойПочты";
	МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
	Если МетаданныеСправочника <> Неопределено Тогда
		Попытка
			СистемнаяУчетнаяЗаписьЭлектроннойПочты = Справочники[ИмяСправочника].СистемнаяУчетнаяЗаписьЭлектроннойПочты;
			СтруктураНастроек.Вставить("СистемнаяУчетнаяЗапись", СистемнаяУчетнаяЗаписьЭлектроннойПочты);
		Исключение
			СтруктураНастроек.Вставить("СистемнаяУчетнаяЗапись", Справочники[ИмяСправочника].ПустаяСсылка());
		КонецПопытки;
	КонецЕсли;
	
	СтруктураНастроек.Вставить("СохранятьЭлектронныеПисьма", Ложь);
	
	СтруктураНастроек.Вставить("ПодключенСервисПочтовойРассылки", Ложь);
	НастройкиСервисаПочтовойРассылки = Новый Структура;
	НастройкиСервисаПочтовойРассылки.Вставить("СервисПочтовойРассылки", Неопределено);
	НастройкиСервисаПочтовойРассылки.Вставить("ЛогинПочтовойРассылки", "");
	НастройкиСервисаПочтовойРассылки.Вставить("ПарольПочтовойРассылки", "");
	СтруктураНастроек.Вставить("НастройкиСервисаПочтовойРассылки", НастройкиСервисаПочтовойРассылки);
	
	// Подписи
	Структураподписей = Новый Структура;
	СтруктураПодписей.Вставить("ПрефиксТемы", "[1С]");
	СтруктураПодписей.Вставить("ПодписьСообщения", "
	|--
	|Это сообщение автоматически создано 1С.
	|Если вы считаете, что оно было отправлено некорректно, пожалуйста, свяжитесь со специалистами, осуществляющими сопровождение 1С.");
	СтруктураНастроек.Вставить("ПодписиСообщений", Структураподписей);
	
	// Использование подсистемы
	СтруктураНастроек.Вставить("СтрокаСоединенияРабочейБазы", ВРег(СтрокаСоединенияИнформационнойБазы()));
	
	// СМС
	НастройкиСМС = Новый Структура;
	НастройкиСМС.Вставить("ПровайдерСМС", Неопределено);
	НастройкиСМС.Вставить("ЛогинСМС", "");
	НастройкиСМС.Вставить("ПарольСМС", "");
	НастройкиСМС.Вставить("ИмяОтправителяСМС", "");
	НастройкиСМС.Вставить("ТелефонныйКодСтраны", "");
	НастройкиСМС.Вставить("СохранятьСообщенияСМС", Ложь);
	СтруктураНастроек.Вставить("НастройкиСМС", НастройкиСМС);
	
	СтруктураНастроек.Вставить("НоваяФормаУведомлений", Истина);
	
	СохранитьНастройки(СтруктураНастроек);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает настройки подсистемы уведомлений в виде незаполненной структуры
//
Функция ПолучитьСтруктуруНастроек()
	
	НастройкиУчетнойЗаписи = Новый Структура("Пользователь,
		|Пароль,
		|АдресСервераPOP3,
		|АдресСервераSMTP,
		|ПортPOP3,
		|ПортSMTP,
		|ТребуетсяSMTPАутентификация,
		|ИспользоватьSSLSMTP");
	
	НастройкиУчетнойЗаписи.ИспользоватьSSLSMTP = Истина;
	НастройкиСервисаПочтовойРассылки = Новый Структура("СервисПочтовойРассылки, ЛогинПочтовойРассылки, ПарольПочтовойРассылки", Неопределено, "", "");
	ПодписиСообщений = Новый Структура("ПрефиксТемы, ПодписьСообщения", "", "");
	Версия = Новый Структура("НомерВерсии, Вес", "0.0.0.0", 0);
	НастройкиСМС = Новый Структура("ИмяОтправителяСМС, ПровайдерСМС, ЛогинСМС, ПарольСМС, ТелефонныйКодСтраны, СохранятьСообщенияСМС",
		"", Неопределено, "", "", "", Ложь);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("НастройкиУчетнойЗаписи",             НастройкиУчетнойЗаписи);
	СтруктураНастроек.Вставить("СистемнаяУчетнаяЗапись",             Неопределено);
	СтруктураНастроек.Вставить("СохранятьЭлектронныеПисьма",         Ложь);
	СтруктураНастроек.Вставить("ПодключенСервисПочтовойРассылки",    Ложь);
	СтруктураНастроек.Вставить("НастройкиСервисаПочтовойРассылки",   НастройкиСервисаПочтовойРассылки);
	СтруктураНастроек.Вставить("ПодписиСообщений",                   ПодписиСообщений);
	СтруктураНастроек.Вставить("Версия",                             Версия);
	СтруктураНастроек.Вставить("СтрокаСоединенияРабочейБазы",        "");
	СтруктураНастроек.Вставить("НастройкиСМС",                       НастройкиСМС);
	СтруктураНастроек.Вставить("НоваяФормаУведомлений",              Истина);
	
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецЕсли