////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	ОтборУведомленийПоСобытию = Истина;
	
	РезультатОбновления = ПЛ_УведомленияОСобытиях.ВыполнитьОбновление();
	
	ЭтоПервыйЗапуск     = РезультатОбновления.ЭтоПервыйЗапуск;
	ЕстьИзменениеВерсии = РезультатОбновления.ЕстьИзменениеВерсии;
	ВесПредыдущейВерсии = РезультатОбновления.Версия.Вес;
	ТекущаяВерсия       = РезультатОбновления.ТекущаяВерсия;
	
	ПочтаНастроена = Ложь;
	РассылкиНастроены = Ложь;
	СМСДоступны = Ложь;
	СМСНастроены = Ложь;
	НапоминанияДоступны = Ложь;
	ПЛ_УведомленияОСобытиях.ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены);
	
	Элементы.СМС.Видимость = Платформа83;
	Элементы.Напоминание.Видимость = НапоминанияДоступны;
	
	Если ЭтоПервыйЗапуск Тогда
		ГруппироватьПоСобытиям = Истина;
		Элементы.Группировать.Пометка = Истина;
	КонецЕсли;
	
	Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().СохранитьНастройку("НоваяФормаУведомлений", Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Элементы.Событие.Видимость = Не ГруппироватьПоСобытиям;
	Элементы.Группировать.Пометка = ГруппироватьПоСобытиям;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоПервыйЗапуск Или ЕстьИзменениеВерсии Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Ложь);
		СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      ЭтоПервыйЗапуск);
		СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  ЕстьИзменениеВерсии);
		СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  ВесПредыдущейВерсии);
		СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров);
		#Иначе
			ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров,,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
		И ВыбраннаяСтрока.ИмяГруппировки = "Событие" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьЗначение(, ВыбраннаяСтрока.Ключ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	СтруктураСписка = Список.КомпоновщикНастроек.Настройки.Структура;
	Если СтруктураСписка.Количество() Тогда
		ПерваяГруппировка = СтруктураСписка[0];
		Если ТипЗнч(ПерваяГруппировка) = Тип("ГруппировкаКомпоновкиДанных")
			И ПерваяГруппировка.ПоляГруппировки.Элементы.Количество() Тогда
			
			Если Строка(ПерваяГруппировка.ПоляГруппировки.Элементы[0].Поле) = "Событие" Тогда
				ГруппироватьПоСобытиям = Истина;
				Элементы.Событие.Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Создать(Команда)
	
	Если ГруппироватьПоСобытиям Тогда
		
		ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
		
		СтруктураПараметры = Новый Структура;
		
		Если ТипЗнч(ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
			И ТекущаяСтрока.ИмяГруппировки = "Событие" Тогда
			
			СтруктураОтбор = Новый Структура;
			СтруктураОтбор.Вставить("Событие", ТекущаяСтрока.Ключ);
			СтруктураПараметры.Вставить("Основание", СтруктураОтбор);
			
		ИначеЕсли ТипЗнч(ТекущаяСтрока) = Тип("СправочникСсылка.ПЛ_УведомленияОСобытиях") Тогда
			ТекущиеДанные = Элементы.Список.ТекущиеДанные;
			Если ТекущиеДанные <> Неопределено
				И ТипЗнч(ТекущиеДанные.РодительскаяГруппировкаСтроки) = Тип("СтрокаГруппировкиДинамическогоСписка")
				И ТекущиеДанные.РодительскаяГруппировкаСтроки.ИмяГруппировки = "Событие" Тогда
			
				СтруктураОтбор = Новый Структура;
				СтруктураОтбор.Вставить("Событие", ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ);
				СтруктураПараметры.Вставить("Основание", СтруктураОтбор);
			КонецЕсли;
		КонецЕсли;
		
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ФормаЭлемента", СтруктураПараметры, ЭтаФорма);
	Иначе
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ФормаЭлемента",, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений",,
		ЭтаФорма,,
		ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВерсий(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Истина);
	СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      Ложь);
	СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  Истина);
	СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  1000000);
	СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
		СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	Если Платформа83 Тогда
		Выполнить("ОткрытьФорму(""Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме"",,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
	Иначе
		ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВСтаруюФорму(Команда)
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.УведомленияОСобытияхУстар");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоСобытиям(Команда)
	
	ГруппироватьПоСобытиям = Не ГруппироватьПоСобытиям;
	
	ПользовательскиеНастройки = Список.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Если ПользовательскиеНастройки.Элементы.Количество() Тогда
		НастройкаГруппировки = ПользовательскиеНастройки.Элементы[ПользовательскиеНастройки.Элементы.Количество() - 1];
		НастройкаГруппировки.Структура.Очистить();
		
		Если ГруппироватьПоСобытиям Тогда
			Поле = Новый ПолеКомпоновкиДанных("Событие");
			НоваяГруппировка = НастройкаГруппировки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			ПолеГруппировки = НоваяГруппировка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
			ПолеГруппировки.Поле = Поле;
		КонецЕсли;
		
		Элементы.Событие.Видимость = Не ГруппироватьПоСобытиям;
		Элементы.Группировать.Пометка = ГруппироватьПоСобытиям;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Список.УсловноеОформление.Элементы.Очистить();
	
	// Уведомления неактивных событий
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	
	// Уведомления ошибок отправки
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -1;
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);
	
	// Статусы
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Черновик'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 1;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Включено'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 2;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Отправлено'"));
	
	Элемент = Список.УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Статус.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Статус");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = -1;
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = 'Ошибка'"));
	
КонецПроцедуры

