Процедура СохранитьНастройкиПользователейВСтруктуру(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Вставить("ИспользоватьМакет", ИспользоватьМакет);

КонецПроцедуры

Процедура ЗагрузитьНастройкиДляПользователей() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь"			    , Справочники.Пользователи.НайтиПоКоду("webadmin"));
	СтруктураНастройки.Вставить("ИмяОбъекта"				, "ОбработкаОбъект.РаботаСДокументамиСборкаЗаказов");
	СтруктураНастройки.Вставить("НаименованиеНастройки"		, "Основная");
	
	Если УниверсальныеМеханизмы.ПолучитьНастройку(СтруктураНастройки) Тогда
		
		ЭтотОбъект.мТекущаяНастройка = СтруктураНастройки;
		ВосстановитьНастройкиПользователейИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);		
		
	КонецЕсли; 	
	
КонецПроцедуры

Процедура ВосстановитьНастройкиПользователейИзСтруктуры(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Свойство("ИспользоватьМакет", ИспользоватьМакет);

КонецПроцедуры
