
Перем мДлинаСуток;

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		ОсновноеИзображение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	//+Сёмин Р. 15.01.2026 #UT10-5618
	ЗаполнитьОсновнойАвтомобиль();
	//-Сёмин Р. 15.01.2026 #UT10-5618
	
КонецПроцедуры

Процедура ЗаполнитьОсновнойАвтомобиль() Экспорт
	
	//+Сёмин Р. 15.01.2026 #UT10-5618
	Если НЕ ЗначениеЗаполнено(ОсновнойАвтомобиль) Тогда
		
		РезультатЗапросаАвтомобилейФизЛица = Справочники.ТранспортныеСредства.ЗапросАвтомобилейФизЛица(Ссылка);
		АвтомобилиФизЛица = РезультатЗапросаАвтомобилейФизЛица.Выгрузить();
		
		Если АвтомобилиФизЛица.Количество() = 1 Тогда
			ОсновнойАвтомобиль = АвтомобилиФизЛица.Получить(0).Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	//-Сёмин Р. 15.01.2026 #UT10-5618
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мДлинаСуток = 86400;
