
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		НСтр = ДокументыОснования.Добавить();
		НСтр.ДокументОснование = ДанныеЗаполнения;
			
		Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Организация");
		Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Контрагент");
		
		ДоговорГрузополучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "ДоговорКонтрагента");
		Грузополучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Грузополучатель");
		
		Если Не ЗначениеЗаполнено(Грузополучатель) Тогда
			Грузополучатель = Контрагент; 	
		КонецЕсли;                       
		
		Грузоотправитель = Организация;
		
		Если Не ЗначениеЗаполнено(ЗаданиеНаДоставку) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
			|ПОМЕСТИТЬ ВТ_Сборки
			|ИЗ
			|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
			|ГДЕ
			|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &Реализация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаданиеНаДоставкуДоставка.Ссылка
			|ИЗ
			|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
			|ГДЕ
			|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
			|			(ВЫБРАТЬ
			|				ВТ_Сборки.ДокументСборки
			|			ИЗ
			|				ВТ_Сборки)
			|	И НЕ ЗаданиеНаДоставкуДоставка.Ссылка.ПометкаУдаления";
			
			Запрос.УстановитьПараметр("Реализация", ДанныеЗаполнения);  
			
			Выборка = Запрос.Выполнить().Выбрать();                 
			
			Если Выборка.Следующий() Тогда
				ЗаданиеНаДоставку = Выборка.Ссылка;	
			КонецЕсли; 
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаданиеНаДоставку) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказЗаявка.Ссылка
			|ИЗ
			|	Документ.ЗаказЗаявка КАК ЗаказЗаявка
			|ГДЕ
			|	НЕ ЗаказЗаявка.ПометкаУдаления
			|	И ЗаказЗаявка.ЗаданиеНаДоставку = &ЗаданиеНаДоставку";
			
			Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);  
			
			Выборка = Запрос.Выполнить().Выбрать();                         
			
			Если Выборка.Следующий() Тогда
				ЗаказЗаявка = Выборка.Ссылка;	
			КонецЕсли;                       		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
