// Обработчик регламентного задания ЗаданиеАвтономноеРешение.
Процедура ВыполнитьОбменДаннымиДляНастройкиОбмена(КодНастройки) Экспорт
	
	// Оставлен для совместимости с версиями ранее 10.3.5.
	
КонецПроцедуры

// Обработчик регламентного задания ЗаданиеОтложенныеДвижения.
Процедура ВыполнитьОтложенныеДвиженияДляНастройкиОбмена(КодНастройки) Экспорт
	
	// Оставлен для совместимости с версиями ранее 10.3.5.
	
КонецПроцедуры

Процедура ВыполнитьОбменДаннымиДляНастройкиАвтоматическогоОбменаДанными(КодНастройки) Экспорт   
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Выполнение обмена", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;    
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиВыполненияОбмена.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменПоНастройкеАвтоматическогоВыполненияОбменаДанными(НастройкаОбмена, Ложь);
	
КонецПроцедуры

Процедура ВыполнитьОбменДаннымиЭлектроннымиДокументами(КодНастройки) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда    
		
		ЗаписьЖурналаРегистрации("Задание обмен электронными документами", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;     
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.УчетныеЗаписиЭлектронногоОбмена.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена) Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ЭлектронныеДокументы.ПолучитьЭлектронныеДокументы(НастройкаОбмена);	
	
КонецПроцедуры

// Процедура выполняет пересчет регистров накопления, для удаления нулевых записей
Процедура ПересчетИтоговРегистровНакопления() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Пересчет итогов регистров накопления", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;           
		
	КонецЕсли;
	
	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл  
		
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;         
		
		ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
	
	Если МенеджерРегистра.ПолучитьМаксимальныйПериодРассчитанныхИтогов() >= НаДату Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерРегистра.УстановитьМаксимальныйПериодРассчитанныхИтогов(НаДату); 
	
	Если Не МенеджерРегистра.ПолучитьИспользованиеИтогов() 
		Или Не МенеджерРегистра.ПолучитьИспользованиеТекущихИтогов() Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерРегистра.ПересчитатьТекущиеИтоги();
	
КонецПроцедуры

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление индекса полнотекстового поиска", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;             
		
	КонецЕсли;
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда 
			
			Попытка	
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Начато регламентное индексирование порции");
				
				ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
				
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Закончено регламентное  индексирование порции");
			Исключение
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Во время регламентного обновления индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
			КонецПопытки;  
			
		КонецЕсли;
		
	КонецЕсли;
	
Конецпроцедуры

Процедура СлияниеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда   
		
		ЗаписьЖурналаРегистрации("Слияние индекса полнотекстового поиска", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;   
		
	КонецЕсли;
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Попытка	
			
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Начато регламентное слияние индексов");
			
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
			
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Закончено регламентное слияние индексов");
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Во время регламентного слияния индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
Конецпроцедуры

Процедура СоздатьЗадачиПоздравленияСДнемРождения() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Формирование поздравлений с днем рождения", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;       
		
	КонецЕсли;
	
	УсловиеЗадачи = УправлениеКонтактами.ПолучитьСтрокуУсловияДР();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.КонтактноеЛицо                             КАК КонтактноеЛицо,
	|	Контакты.Владелец.ОсновнойМенеджерПокупателя        КАК Исполнитель,
	|	Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания КАК ИнтервалДней,
	|	Контакты.КонтактноеЛицо.ДатаРождения                КАК ДатаРождения,
	|	Задачи.СрокИсполнения                               КАК Срок
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК Контакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = Контакты.КонтактноеЛицо
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, РАЗНОСТЬДАТ(Контакты.КонтактноеЛицо.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	Контакты.КонтактноеЛицо.НапоминатьОДнеРождения = ИСТИНА
	|	И Контакты.КонтактноеЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Контакты.Владелец ССЫЛКА Справочник.Контрагенты
	|	И Контакты.Владелец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контакты.Владелец.ОсновнойМенеджерПокупателя <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЛичныеКонтакты.Ссылка,
	|	ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа,
	|	ЛичныеКонтакты.КоличествоДнейДоНапоминания,
	|	ЛичныеКонтакты.ДатаРождения,
	|	Задачи.СрокИсполнения
	|ИЗ
	|	Справочник.ЛичныеКонтакты КАК ЛичныеКонтакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = ЛичныеКонтакты.Ссылка
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, РАЗНОСТЬДАТ(ЛичныеКонтакты.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ЛичныеКонтакты.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	ЛичныеКонтакты.НапоминатьОДнеРождения = ИСТИНА
	|	И ЛичныеКонтакты.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Пока Выборка.Следующий()Цикл
		
		НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		НоваяЗадача.Дата           = ТекущаяДата();
		НоваяЗадача.Наименование   = Строка(Выборка.КонтактноеЛицо) + ". " + УсловиеЗадачи;
		НоваяЗадача.ПамятнаяДата   = Истина;
		НоваяЗадача.Исполнитель    = Выборка.Исполнитель;
		НоваяЗадача.Инициатор      = Выборка.Исполнитель;
		НоваяЗадача.СрокИсполнения = Дата(Год(ТекущаяДата() + (Выборка.ИнтервалДней * 24 * 60 * 60)), Месяц(Выборка.ДатаРождения), День(Выборка.ДатаРождения), 00, 00, 00);
		НоваяЗадача.Оповещение     = Истина;
		НоваяЗадача.СрокОповещения = НоваяЗадача.СрокИсполнения - (Выборка.ИнтервалДней * 24 * 60 * 60);
		НоваяЗадача.Объект         = Выборка.КонтактноеЛицо;
		
		Попытка
			НоваяЗадача.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // СоздатьЗадачиПоздравленияСДнемРождения()

Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда  
		
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;   
		
	КонецЕсли;
	
	Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.АвтоПолучениеОтправкаСообщений";  
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;           
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);  
	
	УчетныеЗаписиДляПроверки = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		УчетныеЗаписиДляПроверки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),УчетныеЗаписиДляПроверки,,, Истина, Ложь, ТекстОшибок);
	
	Если ПустаяСтрока(ТекстОшибок) Тогда
		
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
		УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЭлектронноеПисьмо, ,
		"Получение электронных сообщений выполнено успешно");
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
		УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
		"Получение электронных сообщений выполнено с ошибками:" + Символы.ПС + ТекстОшибок);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОтправитьЧеки() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда       
		
		ЗаписьЖурналаРегистрации("Отправка электронных чеков", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;      
		
	КонецЕсли;
	
	ОтправитьЧекиИзОчереди();   
	
КонецПроцедуры

Процедура ОтправитьЧекиИзОчереди(Интерактивно = Ложь) Экспорт
	
	ПривилегированныйРежимБылУстановлен = ПривилегированныйРежим();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// I. Удаление отправленных записей с битыми ссылками
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектронныеЧекиККМ.Источник,
	|	ЭлектронныеЧекиККМ.ПорядковыйНомер,
	|	ЭлектронныеЧекиККМ.ТекстЧека,
	|	ЭлектронныеЧекиККМ.АдресПолучателя,
	|	ЭлектронныеЧекиККМ.ДатаПостановкиВОчередь КАК ДатаПостановкиВОчередь,
	|	ЭлектронныеЧекиККМ.ДатаОтправки КАК ДатаОтправки,
	|	ЭлектронныеЧекиККМ.ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.ЭлектронныеЧекиККМ КАК ЭлектронныеЧекиККМ
	|ГДЕ
	|	ЭлектронныеЧекиККМ.ДатаОтправки <> &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОтправки";  
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));   
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	нзЭЧ = РегистрыСведений.ЭлектронныеЧекиККМ.СоздатьНаборЗаписей();
	нзЭЧ.Отбор.Источник.Использование = Истина;
	нзЭЧ.Отбор.ПорядковыйНомер.Использование = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ОбщегоНазначения.СсылкаСуществует(Выборка.Источник) Тогда
			
			нзЭЧ.Отбор.Источник.Значение = Выборка.Источник;
			нзЭЧ.Отбор.ПорядковыйНомер.Значение = Выборка.ПорядковыйНомер;
			нзЭЧ.Прочитать();
			нзЭЧ.Очистить();
			нзЭЧ.Записать(Истина);
			
		КонецЕсли;
	КонецЦикла;
	
	// II.Отправка чеков
	
	// 1. Выбрать чеки для отправки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектронныеЧекиККМ.Источник,
	|	ЭлектронныеЧекиККМ.ПорядковыйНомер,
	|	ЭлектронныеЧекиККМ.ТекстЧека,
	|	ЭлектронныеЧекиККМ.АдресПолучателя,
	|	ЭлектронныеЧекиККМ.ДатаПостановкиВОчередь КАК ДатаПостановкиВОчередь,
	|	ЭлектронныеЧекиККМ.ДатаОтправки,
	|	ЭлектронныеЧекиККМ.ОписаниеОшибки
	|ИЗ
	|	РегистрСведений.ЭлектронныеЧекиККМ КАК ЭлектронныеЧекиККМ
	|ГДЕ
	|	ЭлектронныеЧекиККМ.ДатаОтправки = &ПустаяДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПостановкиВОчередь";         
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
	
	Выборка = Запрос.Выполнить().Выбрать();     
	
	Если Не Выборка.Следующий() Тогда
		Возврат; // Нет чеков для отправки
	Иначе
		Выборка.Сбросить(); // Переход в начало
	КонецЕсли;
	
	// 2.Определить учетную запись для отправки
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда 
		
		ТекстОшибки = "Не определена учетная запись электронной почты для рассылки чеков";
		ЗаписьЖурналаРегистрации("ОтправкаЧековИзОчереди", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.ОтправкаЭлектронныхЧеков, ,
		ТекстОшибки);  
		
		Если Интерактивно Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		КонецЕсли;    
		
		Возврат; 
		
	КонецЕсли;
	
	// 3. Сформировать профиль подключения
	ПрофильПодключения = ЭлектроннаяПочта.СформироватьИнтернетПрофиль(УчетнаяЗапись);
	
	// 4. Подключиться
	Соединение = Новый ИнтернетПочта; 
	
	Попытка
		Соединение.Подключиться(ПрофильПодключения);
	Исключение
		
		Инфо = ИнформацияОбОшибке();
		ТекстОшибки = "Не удалось подключиться с параметрами, заданными в учетной записи " + """" + СокрЛП(УчетнаяЗапись.Наименование) + """:" 
		+ Символы.ПС + Инфо.Описание;
		ЗаписьЖурналаРегистрации("ОтправкаЧековИзОчереди", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.ОтправкаЭлектронныхЧеков, ,
		ТекстОшибки); 
		
		Если Интерактивно Тогда
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		КонецЕсли;
		
		Возврат;    
		
	КонецПопытки;
	
	// 5.Отправить чеки
	нзЭЧ = РегистрыСведений.ЭлектронныеЧекиККМ.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		нзЭЧ.Очистить();
		нзЭЧ.Отбор.Источник.Значение = Выборка.Источник;
		нзЭЧ.Отбор.Источник.Использование = Истина;
		нзЭЧ.Отбор.ПорядковыйНомер.Значение = Выборка.ПорядковыйНомер;
		нзЭЧ.Отбор.ПорядковыйНомер.Использование = Истина;
		
		ЭлектронныйЧек = нзЭЧ.Добавить();
		ЗаполнитьЗначенияСвойств(ЭлектронныйЧек, Выборка);
		
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", Выборка.АдресПолучателя);
		ПараметрыПисьма.Вставить("Тема", "Электронный чек");
		ПараметрыПисьма.Вставить("Тело", Выборка.ТекстЧека);
		
		Попытка
			
			ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма, Соединение);
			ЭлектронныйЧек.ДатаОтправки = ТекущаяДата();
			ЭлектронныйЧек.ОписаниеОшибки = "";
			
		Исключение
			
			Инфо = ИнформацияОбОшибке();
			ЭлектронныйЧек.ОписаниеОшибки = Инфо.Описание;
			
		КонецПопытки;
		
		нзЭЧ.Записать(Истина);
		
	КонецЦикла;
	
	// 6.Отключиться
	Соединение.Отключиться();
	
	Если Не ПривилегированныйРежимБылУстановлен Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаЦенНоменклатуры() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка цен номенклатуры", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;      
		
	КонецЕсли;
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPЗагрузкаЦенЛогин.Получить(), Константы.FTPЗагрузкаЦенПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	
	Попытка
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "*.txt");
	Исключение
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	ДопТаблицаОстатков = Неопределено;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Для Каждого ТекСтр ИЗ МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("price.txt") Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
			
			Попытка
				
				ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Начало обработки файла: " + ТекСтр.Имя);
				
				Соединение.Получить(ИмяКаталогаСервера + "price.txt", ИмяВременногоФайла);
				СозданиеДокумента_Новый(ИмяВременногоФайла, Истина, ДопТаблицаОстатков);
				Прервать;    
				
			Исключение
				
				ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
				Прервать;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Завершение", УровеньЖурналаРегистрации.Информация,,,);
	
	// для тестов
	//СозданиеДокумента_Новый("C:\price.txt", Ложь);
	
КонецПроцедуры

Процедура ЗагрузкаЦенНоменклатурыЕдиныйПрайсЛист() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда   
		
		ЗаписьЖурналаРегистрации("Загрузка цен номенклатуры единый прайс-лист", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;   
		
	КонецЕсли;
	
	ИмяРегЗадания = "Загрузка цен единый прайс-лист";
	МассивОшибок = Новый Массив;
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPЗагрузкаЦенЛогин.Получить(),  Константы.FTPЗагрузкаЦенПароль.Получить(), , Истина);
	Исключение                
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
		Возврат;  
		
	КонецПопытки; 
	
	Попытка
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "*.txt");
	Исключение               
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
		Возврат;      
		
	КонецПопытки;  
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Начало", УровеньЖурналаРегистрации.Информация,,,);    
	
	Для Каждого ТекСтр ИЗ МассивНайденныхФайловНаСервере Цикл 
		
		Если ВРег(ТекСтр.Имя) = ВРег("PricePM2.txt") Тогда  
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");   
			
			Попытка
			
				ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Обработка", УровеньЖурналаРегистрации.Информация,,, "Начало обработки файла: " + ТекСтр.Имя);
				Соединение.Получить(ИмяКаталогаСервера + "PricePM2.txt", ИмяВременногоФайла);
				СозданиеДокументаЕдиныйПрайсЛист(ИмяВременногоФайла, Истина, ТекСтр.Имя, Ложь, Соединение);
				Прервать;      
				
			Исключение  
				
				ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());
				МассивОшибок.Добавить("Не удалось выполнить рег задание" + Символы.ПС + ОписаниеОшибки());
				ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
				Прервать;     
				
			КонецПопытки;       
			
		КонецЕсли;    
		
	КонецЦикла;            
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Завершение", УровеньЖурналаРегистрации.Информация,,,);      
	
КонецПроцедуры

Процедура ЗагрузкаЦенНоменклатурыИзГоловногоФилиала() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда   
		
		ЗаписьЖурналаРегистрации("Загрузка цен номенклатуры из головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;   
		
	КонецЕсли;
	
	ИмяРегЗадания = "Загрузка цен номенклатуры из головного филиала";
	МассивОшибок = Новый Массив;
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPЗагрузкаЦенЛогин.Получить(),  Константы.FTPЗагрузкаЦенПароль.Получить(), , Истина);
	Исключение                
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок); 
		Возврат;  
		
	КонецПопытки; 
	
	Попытка
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "*.txt");
	Исключение               
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
		Возврат;      
		
	КонецПопытки;  
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Начало", УровеньЖурналаРегистрации.Информация,,,);    
	
	Для Каждого ТекСтр ИЗ МассивНайденныхФайловНаСервере Цикл 
		
		Если ВРег(ТекСтр.Имя) = ВРег("PriceGF.txt") Тогда  
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");   
			
			Попытка
			
				ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Обработка", УровеньЖурналаРегистрации.Информация,,, "Начало обработки файла: " + ТекСтр.Имя);
				Соединение.Получить(ИмяКаталогаСервера + "PriceGF.txt", ИмяВременногоФайла);
				СозданиеДокументаИзГоловногоФилиала(ИмяВременногоФайла , Истина , ТекСтр.Имя , Соединение);
				Прервать;      
				
			Исключение  
				
				ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
				МассивОшибок.Добавить("Не удалось выполнить рег задание" + Символы.ПС + ОписаниеОшибки());
				ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
				Прервать;     
				
			КонецПопытки; 			
			
		КонецЕсли;    
		
	КонецЦикла;            
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Завершение", УровеньЖурналаРегистрации.Информация,,,);      
	
КонецПроцедуры

Процедура ЗагрузкаЦенНоменклатурыЕдиныйПрайсЛистЧастично() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда   
		
		ЗаписьЖурналаРегистрации("Загрузка цен единый прайс-лист ЧАСТИЧНО", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;          
		
	КонецЕсли;
	
	ИмяРегЗадания = "Загрузка цен единый прайс-лист ЧАСТИЧНО";
	МассивОшибок = Новый Массив;
	ИмяКаталогаСервера = "PartialPriceUpdates/";
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPЗагрузкаЦенЛогин.Получить(),  Константы.FTPЗагрузкаЦенПароль.Получить(), , Истина);
	Исключение            
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка соединения с сервером ftp: " + ИмяFTPСервера + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
		Возврат;  
		
	КонецПопытки;  
	
	Попытка
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "*.txt");
	Исключение       
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		МассивОшибок.Добавить("Ошибка при вызове метода Найти файлы" + Символы.ПС + ОписаниеОшибки());
		ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
		Возврат; 
		
	КонецПопытки;
	
	//Сортируем по наименованию и оставляем только файлы текущего дня
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(МассивНайденныхФайловНаСервере);
	Список.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	МассивНайденныхФайловНаСервере = Список.ВыгрузитьЗначения();
	
	ТекущаяДата = Формат(ТекущаяДата(), "ДФ=yyyyMMdd");
	
	н = МассивНайденныхФайловНаСервере.Количество() - 1;  
	
	Пока н >= 0 Цикл          
		
		ИмяФайла = МассивНайденныхФайловНаСервере[н].Имя; 
		
		Если Найти(ИмяФайла,ТекущаяДата) = 0 или Найти(ИмяФайла, "PricePM2") = 0
			//Данные из этого файла уже загружали
			Или Документы.УстановкаЦенНоменклатуры.НайтиПоРеквизиту("ИмяФайлазагрузки", ИмяФайла) <> Документы.УстановкаЦенНоменклатуры.ПустаяСсылка() Тогда
			МассивНайденныхФайловНаСервере.Удалить(н);
		КонецЕсли;             
		
		н = н - 1;     
		
	КонецЦикла;
	
	Если МассивНайденныхФайловНаСервере.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Для Каждого ТекСтр ИЗ МассивНайденныхФайловНаСервере Цикл  
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");    
		
		Попытка
		
			ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Обработка", УровеньЖурналаРегистрации.Информация,,, "Начало обработки файла: " + ТекСтр.Имя);
			Соединение.Получить(ИмяКаталогаСервера+ТекСтр.Имя, ИмяВременногоФайла);
			СозданиеДокументаЕдиныйПрайсЛист(ИмяВременногоФайла, Ложь, ТекСтр.Имя, Истина, Соединение);   
			
		Исключение            
			
			ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			МассивОшибок.Добавить("Не удалось выполнить рег задание" + Символы.ПС + ОписаниеОшибки());
			ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);
			Прервать;  
			
		КонецПопытки;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания+".Завершение", УровеньЖурналаРегистрации.Информация,,,); 
	
КонецПроцедуры

Процедура СозданиеДокумента_Новый(Файл, УдалятьПредыдущиеДокументы = Истина, ДопТаблицаОстатков)   
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	КоличествоСтрокВДокументе = 25000;
	Робот = Справочники.Пользователи.НайтиПоКоду("robot");
	//Удаление предыдущих перенесем после загрузки
	
	МассивТиповЦен =  Новый Массив;
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();	
	СпецЦена        = Константы.СпецЦена.Получить();
	
	АДУрал			= Константы.АДУрал.Получить();
	ЗагружатьАДУрал = ЗначениеЗаполнено(АДУрал);
	ТекущаяБаза     = Константы.База.Получить();       
	
	ЗагружатьЗакупочнуюЦену = Истина; //(ТекущаяБаза = Перечисления.НазваниеБазы.Казань Или ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж)
	ЗагружатьЦенуДляРекламнойПродукции = Истина;
	
	МассивТиповЦен.Добавить(Скидка35);
	МассивТиповЦен.Добавить(Базовая); 
	
	Если ЗагружатьЗакупочнуюЦену Тогда 
		МассивТиповЦен.Добавить(ЗакупочнаяЦена);
	КонецЕсли;                        
	
	МассивТиповЦен.Добавить(Скидка36);
	МассивТиповЦен.Добавить(Скидка37);
	МассивТиповЦен.Добавить(Скидка38);
	
	МассивТиповЦен.Добавить(СпецЦена);
	
	Если ЗагружатьАДУрал Тогда
		МассивТиповЦен.Добавить(АДУрал);
	КонецЕсли;
	
	// ТаблицаЗагрузки
	ТабЗагрузки = Новый ТаблицаЗначений;
	ТабЗагрузки.Колонки.Добавить("Артикул"				,Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(25)));
	ТабЗагрузки.Колонки.Добавить("ЦенаСкидка35"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТабЗагрузки.Колонки.Добавить("ЦенаБазовая"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	// закупочная цена для Самары и Владимира не актуальна
	Если ЗагружатьЗакупочнуюЦену Тогда 
		ТабЗагрузки.Колонки.Добавить("ЦенаЗакупочная"	,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	КонецЕсли;
	
	ТабЗагрузки.Колонки.Добавить("ЦенаСкидка36"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТабЗагрузки.Колонки.Добавить("ЦенаСкидка37"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТабЗагрузки.Колонки.Добавить("ЦенаСкидка38"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТабЗагрузки.Колонки.Добавить("ЦенаСпециальная"		,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Если ЗагружатьАДУрал Тогда
		ТабЗагрузки.Колонки.Добавить("ЦенаАДУрал"		,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	КонецЕсли;
	
	ТабЗагрузки.Колонки.Добавить("ОстатокВМоскве"		,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТабЗагрузки.Колонки.Добавить("КодНоменклатурнойГруппы",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(9)));
	ТабЗагрузки.Колонки.Добавить("ИмяНоменклатурнойГруппы",Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(100)));
	ТабЗагрузки.Колонки.Добавить("КатегорияАВС"			,Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(4)));
	ТабЗагрузки.Колонки.Добавить("КоэфНоменклатуры"		,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));	
	
	ТабЗакупки = Новый ТаблицаЗначений;
	ТабЗакупки.Колонки.Добавить("Артикул"				,Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(25)));
	ТабЗакупки.Колонки.Добавить("Цена"			,Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Текст = Новый ТекстовыйДокумент; 
	Текст.Прочитать(Файл); 
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Количество строк файла: " + Строка(Текст.КоличествоСтрок()));
	
	//КоличествоСтрок = 3000;
	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл  
		
		Стр = Текст.ПолучитьСтроку(НомерСтроки);
		
		// Для отладки
		//Если НомерСтроки = 300 Тогда
		//	Прервать;
		//КонецЕсли;
		
		Попытка
			
			//ID
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда
				Стр = Сред(Стр, НомерСобаки + 1);
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//Inv
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда 
				
				НС = ТабЗагрузки.Добавить();
				НС.Артикул = Лев(Стр, НомерСобаки-1);
				НСЗ = ТабЗакупки.Добавить();
				НСЗ.Артикул = Лев(Стр, НомерСобаки-1);
				
				Стр = Сред(Стр, НомерСобаки + 1); 
				
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//BREND(Производитель) , ARTICUL(Номер товара)  , TOV_NAME(Наименование)
			Для  Х = 1  по 3 Цикл        
				
				НомерСобаки = Найти(Стр, "@"); 
				
				Если НомерСобаки > 0 Тогда 
					Стр = Сред(Стр, НомерСобаки + 1);
				Иначе 
					Продолжить;
				КонецЕсли;      
				
			КонецЦикла;
			
			//GRUPPA  (Группа)
			НомерСобаки = Найти(Стр, "@");
			
			Если НомерСобаки > 0 Тогда     
				
				НС.КатегорияАВС = Лев(Стр, НомерСобаки-1);
				Стр = Сред(Стр, НомерСобаки + 1);  
				
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//PACK_NAME(ЕдИзм МИНИУПАКОВКА)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//PACK (Коэфф МИНИУПАКОВКИ)
			НомерСобаки = Найти(Стр, "@");  
			
			Если НомерСобаки > 1 Тогда 
				КоэфНоменклатуры = Число(Лев(Стр,  НомерСобаки - 1));
			Иначе 
				КоэфНоменклатуры = 0;
			КонецЕсли;  
			
			НС.КоэфНоменклатуры = КоэфНоменклатуры;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//VALUTA_NAME(Валюта)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//AD_URAL(АД Урал)
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда      
				
				Если ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж Или ТекущаяБаза = Перечисления.НазваниеБазы.Казань 
					Или ТекущаяБаза = Перечисления.НазваниеБазы.Ростов 
					Или ТекущаяБаза = Перечисления.НазваниеБазы.Краснодар Тогда 
					
					КолЗнаков = СтрДлина(Лев(Стр, НомерСобаки - 1));  
					
					Если КолЗнаков = 0 Тогда
						ЦенаЗакупочная = 0;
					Иначе
						ЦенаЗакупочная = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
					КонецЕсли;                
					
					Стр = Сред(Стр, НомерСобаки + 1);  
					
					Если ЗагружатьЗакупочнуюЦену Тогда 
						НС.ЦенаЗакупочная = ЦенаЗакупочная;
					КонецЕсли;   
					
				ИначеЕсли ЗагружатьАДУрал Тогда		
					
					КолЗнаков = СтрДлина(Лев(Стр, НомерСобаки - 1)); 
					
					Если КолЗнаков = 0 Тогда
						ЦенаАДУрал = 0;
					Иначе
						ЦенаАДУрал = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
					КонецЕсли;                     
					
					Стр = Сред(Стр, НомерСобаки + 1);
					НС.ЦенаАДУрал = ЦенаАДУрал;  
					
				Иначе					
					// пропускаем эту цену
					Стр = Сред(Стр, НомерСобаки + 1);
				КонецЕсли;
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//AUTOEUROPE (АвтоЕвропа)
			НомерСобаки = Найти(Стр, "@");  
			
			Если НомерСобаки > 0 Тогда
				Стр = Сред(Стр, НомерСобаки + 1);
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//VIP BMW
			НомерСобаки = Найти(Стр, "@");   
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка35 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка35 = 0;
			КонецЕсли;                     
			
			НС.ЦенаСкидка35 = ЦенаСкидка35;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//БАЗА 0%
			НомерСобаки = Найти(Стр, "@");
			
			Если НомерСобаки > 1 Тогда 
				ЦенаБазовая = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаБазовая =  0;
			КонецЕсли;                 
			
			НС.ЦенаБазовая = ЦенаБазовая;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//MSKNN
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда
				Стр = Сред(Стр, НомерСобаки + 1);
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//MSKKAZ
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда     
				
				Если НомерСобаки > 1 Тогда 
					ЦенаБазовая = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
				Иначе 
					ЦенаБазовая =  0;
				КонецЕсли;          
				
				НСЗ.Цена = ЦенаБазовая;
				
				Если ТекущаяБаза <> Перечисления.НазваниеБазы.Казань И ТекущаяБаза <> Перечисления.НазваниеБазы.Воронеж 
				   И ТекущаяБаза <> Перечисления.НазваниеБазы.Ростов
					Или ТекущаяБаза = Перечисления.НазваниеБазы.Краснодар Тогда 
					
					КолЗнаков = СтрДлина(Лев(Стр, НомерСобаки - 1));  
					
					Если КолЗнаков = 0 Тогда
						ЦенаЗакупочная = 0;
					Иначе
						ЦенаЗакупочная = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
					КонецЕсли;            
					
					Стр = Сред(Стр, НомерСобаки + 1);    
					
					Если ЗагружатьЗакупочнуюЦену Тогда 
						НС.ЦенаЗакупочная = ЦенаЗакупочная;
					КонецЕсли;     
					
				Иначе
					// пропускаем эту цену
					Стр = Сред(Стр, НомерСобаки + 1);
				КонецЕсли;
			Иначе 
				Продолжить;
			КонецЕсли;
			
			//ОП КОРЕЯ
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//36% (ОП ЯПОНИЯ)
			НомерСобаки = Найти(Стр, "@");
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка36 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка36  = 0 ;
			КонецЕсли;             
			
			НС.ЦенаСкидка36 = ЦенаСкидка36;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			// 37% (VIP/VIP LADA)
			НомерСобаки = Найти(Стр, "@");
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка37 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка37 = 0 ;
			КонецЕсли;            
			
			НС.ЦенаСкидка37 = ЦенаСкидка37;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//ОП РЕНО
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//38% (VIP VW)
			НомерСобаки = Найти(Стр, "@");  
			
			Если НомерСобаки > 1  Тогда 
				ЦенаСкидка38 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);	 
			Иначе 
				ЦенаСкидка38 = 0;
			КонецЕсли;      
			
			НС.ЦенаСкидка38 = ЦенаСкидка38;
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@");   
			
			Если НомерСобаки > 1 Тогда 
				НС.ОстатокВМоскве = 0;
			КонецЕсли;            
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//В пути ( поле NA_SKLADE )
			НомерСобаки = Найти(Стр, "@");	
			
			Если НомерСобаки > 1 Тогда   
				
				Если Лев(Стр,  НомерСобаки - 1) <> "" Тогда
					СпецЦена = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
					НС.ЦенаСпециальная = СпецЦена;
				Иначе 
					НС.ЦенаСпециальная = 0;
				КонецЕсли;       
				
			Иначе 
				НС.ЦенаСпециальная = 0;
			КонецЕсли; 
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//Осн. ед. изм. ( поле OSN_ED_IZM)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);	
			
			//Оригинальный номер ( поле ORIG_NUM)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//ID Бренда ( поле BREND_ID)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//Исключение ( полеISKLUCHENIE)
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//ID Товарной Группы. ( поле OSN_ED_IZM)
			НомерСобаки = Найти(Стр, "@");
			
			Если НомерСобаки > 0 Тогда
				НС.КодНоменклатурнойГруппы = Лев(Стр,  НомерСобаки-1);
			КонецЕсли;         
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			//Товарная Группа
			НомерСобаки = Найти(Стр, "@");
			НС.ИмяНоменклатурнойГруппы = Сред(Стр, НомерСобаки + 1);
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	СтрокСЦенамиВременной = 0;
	
	Для каждого СтрЗагрузки ИЗ ТабЗагрузки Цикл
		
		Если ЗначениеЗаполнено(СтрЗагрузки.ЦенаСкидка35) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗначениеЗаполнено(СтрЗагрузки.ЦенаБазовая) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗагружатьЗакупочнуюЦену И ЗначениеЗаполнено(СтрЗагрузки.ЦенаЗакупочная) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗначениеЗаполнено(СтрЗагрузки.ЦенаСкидка36) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗначениеЗаполнено(СтрЗагрузки.ЦенаСкидка37) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗначениеЗаполнено(СтрЗагрузки.ЦенаСкидка38) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗначениеЗаполнено(СтрЗагрузки.ЦенаСпециальная) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		ИначеЕсли ЗагружатьАДУрал И ЗначениеЗаполнено(СтрЗагрузки.ЦенаАДУрал) Тогда
			СтрокСЦенамиВременной = СтрокСЦенамиВременной + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Количество строк в полученной таблице: " + Строка(ТабЗагрузки.Количество()));
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Количество строк с ценами: " + Строка(СтрокСЦенамиВременной));	
	
	Запрос = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	
	ГруппаНоменклатурыУценка = Константы.ГруппаНоменклатурыУценка.Получить(); 
	КоэффициентДляТаблиц = 0;  
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() и ЗначениеЗаполнено(ГруппаНоменклатурыУценка) Тогда  
		
		ТекстЗапросаУценкаВыбор = "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ПОМЕСТИТЬ НеЗагружаемыеТоварыУценка
		|ИЗ
		|	Константы КАК Константы,
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Уценка)"; 
		
		КоэффициентДляТаблиц = 1;
		
		Запрос.УстановитьПараметр("Уценка", ГруппаНоменклатурыУценка); 
		
		УсловиеУценка = "
		|	И НЕ ВсеТовары.Ссылка В
		|				(ВЫБРАТЬ
		|					НеЗагружаемыеТоварыУценка.Ссылка
		|				ИЗ
		|					НеЗагружаемыеТоварыУценка КАК НеЗагружаемыеТоварыУценка) ";   
		
	Иначе         
		
		ТекстЗапросаУценкаВыбор = "";
		УсловиеУценка = ""; 
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТабЗагрузки.Артикул,
	|	ТабЗагрузки.ЦенаСкидка35,
	|	ТабЗагрузки.ЦенаБазовая,
	|	ТабЗагрузки.ЦенаЗакупочная,
	|	ТабЗагрузки.ЦенаСкидка36,
	|	ТабЗагрузки.ЦенаСкидка37,
	|	ТабЗагрузки.ЦенаСкидка38,
	|	ТабЗагрузки.ЦенаСпециальная,	
	|	ТабЗагрузки.ЦенаАДУрал,
	|	ТабЗагрузки.ОстатокВМоскве,
	|	ТабЗагрузки.КодНоменклатурнойГруппы,
	|	ТабЗагрузки.ИмяНоменклатурнойГруппы,
	|	ТабЗагрузки.КоэфНоменклатуры,
	|	ТабЗагрузки.КатегорияАВС
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&ТабЗагрузки КАК ТабЗагрузки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабЗагрузки.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка,
	|	СправочникНоменклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара,
	|	СправочникНоменклатура.Кратность,
	|	СправочникНоменклатура.НеПроверятьКратностьПриЗагрузкеЦен,
	|	Таб.Артикул,
	|	Таб.ЦенаСкидка35,
	|	Таб.ЦенаБазовая,
	|	Таб.ЦенаЗакупочная,
	|	Таб.ЦенаСкидка36,
	|	Таб.ЦенаСкидка37,
	|	Таб.ЦенаСкидка38,
	|	Таб.ЦенаСпециальная,	
	|	Таб.ЦенаАДУрал,
	|	Таб.ОстатокВМоскве,
	|	Таб.КодНоменклатурнойГруппы,
	|	Таб.ИмяНоменклатурнойГруппы,
	|	Таб.КоэфНоменклатуры,
	|	Таб.КатегорияАВС
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ 
	|	Таб КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Таб.Артикул = СправочникНоменклатура.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ НеЗагружаемыеТовары
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВсеТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВРезервеНаСкладахОстатки.Номенклатура = ВсеТовары.Ссылка)
	|ГДЕ
	|	ВсеТовары.НеЗагружатьЦеныЕслиЕстьОстатокТовара
	|
	|" + ТекстЗапросаУценкаВыбор + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ПОМЕСТИТЬ ТабРеклама
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				Константы.НоменклатураРеклама.Ссылка
	|			ИЗ
	|				Константы КАК Константы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ВсеТовары.Артикул,
	|	ВсеТовары.ЦенаСкидка35,
	|	ВсеТовары.ЦенаБазовая,
	|	ВсеТовары.ЦенаЗакупочная,
	|	ВсеТовары.ЦенаСкидка36,
	|	ВсеТовары.ЦенаСкидка37,
	|	ВсеТовары.ЦенаСкидка38,
	|	ВсеТовары.ЦенаСпециальная,	
	|	ВсеТовары.ЦенаАДУрал,
	|	ВсеТовары.ОстатокВМоскве,
	|	ВсеТовары.КодНоменклатурнойГруппы,
	|	ВсеТовары.ИмяНоменклатурнойГруппы,
	|	ВсеТовары.КатегорияАВС
	|ПОМЕСТИТЬ ТабНоменклатуры
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|ГДЕ
	|	НЕ ВсеТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					НеЗагружаемыеТовары.Ссылка
	|				ИЗ  
	|  					Константы КАК Константы,
	|					НеЗагружаемыеТовары КАК НеЗагружаемыеТовары
	|				ГДЕ
	|					ВЫБОР
	|					КОГДА Константы.НеСниматьФлагНеЗагружатьЦеныПриЗагрузкеЦен
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ НеЗагружаемыеТовары.Остаток > 0
	|   				КОНЕЦ )   
	|	И НЕ ВсеТовары.Ссылка В (ВЫБРАТЬ ТабРеклама.Ссылка ИЗ ТабРеклама КАК ТабРеклама)
	|
	| " + УсловиеУценка + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.КодНоменклатурнойГруппы,
	|	Таб.ИмяНоменклатурнойГруппы
	|ИЗ
	|	Таб КАК Таб
	|ГДЕ
	|	НЕ Таб.КодНоменклатурнойГруппы В
	|				(ВЫБРАТЬ
	|					НоменклатурныеГруппы.Код
	|				ИЗ
	|					Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы)
	|	И Таб.КодНоменклатурнойГруппы <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.КатегорияАВС
	|ИЗ
	|	Таб КАК Таб
	|ГДЕ
	|	НЕ Таб.КатегорияАВС В
	|				(ВЫБРАТЬ
	|					АВСКлассификацияНоменклатуры.Код
	|				ИЗ
	|					Справочник.АВСКлассификацияНоменклатуры КАК АВСКлассификацияНоменклатуры)
	|	И Таб.КатегорияАВС <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНоменклатуры.Ссылка,
	|	ТабНоменклатуры.Артикул,
	|	ТабНоменклатуры.Ссылка.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	ТабНоменклатуры.ЦенаСкидка35,
	|	ТабНоменклатуры.ЦенаБазовая,
	|	ТабНоменклатуры.ЦенаЗакупочная,
	|	ТабНоменклатуры.ЦенаСкидка36,
	|	ТабНоменклатуры.ЦенаСкидка37,
	|	ТабНоменклатуры.ЦенаСкидка38,
	|	ТабНоменклатуры.ЦенаСпециальная,	
	|	ТабНоменклатуры.ЦенаАДУрал,
	|	ТабНоменклатуры.ОстатокВМоскве,
	|	ТабНоменклатуры.КодНоменклатурнойГруппы,
	|	ТабНоменклатуры.ИмяНоменклатурнойГруппы,
	|	ТабНоменклатуры.КатегорияАВС
	|ИЗ
	|	ТабНоменклатуры КАК ТабНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка КАК Номенклатура,
	|	ВсеТовары.ОстатокВМоскве КАК Количество
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|ГДЕ
	|	ВсеТовары.ОстатокВМоскве <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеЗагружаемыеТовары.Ссылка КАК Номенклатура
	|ИЗ
	|	НеЗагружаемыеТовары КАК НеЗагружаемыеТовары
	|ГДЕ
	|	НеЗагружаемыеТовары.Остаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ВсеТовары.Кратность,
	|	ВсеТовары.КоэфНоменклатуры
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|ГДЕ
	|	ВсеТовары.Кратность <> ВсеТовары.КоэфНоменклатуры
	|	И НЕ ВсеТовары.НеПроверятьКратностьПриЗагрузкеЦен";
	
	
	Запрос.УстановитьПараметр("ТабЗагрузки", ТабЗагрузки);
	
	Если Не ЗагружатьЗакупочнуюЦену Тогда  
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабЗагрузки.ЦенаЗакупочная, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таб.ЦенаЗакупочная, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеТовары.ЦенаЗакупочная, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабНоменклатуры.ЦенаЗакупочная, ", "");   
		
	КонецЕсли;
	
	Если Не ЗагружатьАДУрал Тогда           
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабЗагрузки.ЦенаАДУрал, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Таб.ЦенаАДУрал, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеТовары.ЦенаАДУрал, ", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТабНоменклатуры.ЦенаАДУрал, ", "");      
		
	КонецЕсли;
	
	Если ЗагружатьЦенуДляРекламнойПродукции Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ВсеТовары.Ссылка В (ВЫБРАТЬ ТабРеклама.Ссылка ИЗ ТабРеклама КАК ТабРеклама)", "");
	КонецЕсли;
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицаСопоставилосьПоАртикулу = Пакет[1].Выгрузить();
	
	КоличествоСопоставилосьПоАртикулу = 0;
	
	Если ТаблицаСопоставилосьПоАртикулу.Количество() > 0 Тогда
		КоличествоСопоставилосьПоАртикулу = ТаблицаСопоставилосьПоАртикулу[0].Количество;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Товаров сопоставилось по артикулу: " + Строка(КоличествоСопоставилосьПоАртикулу));
	
	ТаблицаНГ = Пакет[5 + КоэффициентДляТаблиц].Выгрузить(); 
	
	Для Каждого ТекСтр ИЗ ТаблицаНГ Цикл            
		
		Попытка
			
			ЭлементНГ 				= Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
			ЭлементНГ.Код 			= ТекСтр.КодНоменклатурнойГруппы ;
			ЭлементНГ.Наименование 	= ТекСтр.ИмяНоменклатурнойГруппы;
			ЭлементНГ.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
			ЭлементНГ.Записать(); 
			
		Исключение
		КонецПопытки;  
		
	КонецЦикла;	
	
	ТаблицаАБС = Пакет[6 + КоэффициентДляТаблиц].Выгрузить();
	
	Для Каждого ТекСтр ИЗ ТаблицаАБС Цикл            
		
		Попытка
		
			ЭлементАВС 		= Справочники.АВСКлассификацияНоменклатуры.СоздатьЭлемент();
			ЭлементАВС.Код 	= ТекСтр.КатегорияАВС;
			ЭлементАВС.наименование = ТекСтр.КатегорияАВС;
			ЭлементАВС.Записать();    
			
		Исключение
		КонецПопытки;           
		
	КонецЦикла;	
	
	
	ТаблицаЦен = Пакет[7 + КоэффициентДляТаблиц].Выгрузить();
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Товаров для установки цен: " + Строка(ТаблицаЦен.Количество()));
	
	ТаблицаВГруппеРеклама = Пакет[3 + КоэффициентДляТаблиц].Выгрузить();
	
	КоличествоВГруппеРеклама = 0;
	
	Если ТаблицаВГруппеРеклама.Количество() > 0 Тогда
		КоличествоВГруппеРеклама = ТаблицаВГруппеРеклама[0].Количество;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Товаров в группе реклама: " + Строка(КоличествоВГруппеРеклама));
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() и ЗначениеЗаполнено(ГруппаНоменклатурыУценка) Тогда
		
		ТаблицаВГруппеУценка = Пакет[3].Выгрузить();
		
		КоличествоВГруппеУценка = 0;
		
		Если ТаблицаВГруппеУценка.Количество() > 0 Тогда
			КоличествоВГруппеУценка = ТаблицаВГруппеУценка[0].Количество;
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Товаров в группе распродажа: " + Строка(КоличествоВГруппеУценка));
		
	КонецЕсли;
	
	ТаблицаНоменклатурыКСнятиюПометки = Пакет[9 + КоэффициентДляТаблиц].Выгрузить();
	
	// Номенклатура, у которой изменилась Номенклатурная группа или АБС
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ВсеТовары.Артикул,
	|	ВсеТовары.ЦенаСкидка35,
	|	ВсеТовары.ЦенаБазовая,
	|	ВсеТовары.ЦенаЗакупочная,
	|	ВсеТовары.ЦенаСкидка36,
	|	ВсеТовары.ЦенаСкидка37,
	|	ВсеТовары.ЦенаСкидка38,
	|	ВсеТовары.ЦенаСпециальная,	
	|	ВсеТовары.ЦенаАДУрал,
	|	ВсеТовары.ОстатокВМоскве,
	|	ВсеТовары.КодНоменклатурнойГруппы,
	|	ВсеТовары.ИмяНоменклатурнойГруппы,
	|	ВсеТовары.КатегорияАВС,
	|	ЕСТЬNULL(НоменклатурныеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.Прочее)) КАК НГНовая,
	|	ВсеТовары.Ссылка.НоменклатурнаяГруппа КАК НГСтарая,
	|	ЕСТЬNULL(АВСКлассификацияНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.АВСКлассификацияНоменклатуры.ПустаяСсылка)) КАК КатегорияНовая,
	|	ВсеТовары.Ссылка.ГруппаАВС КАК КатегорияСтарая
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|		ПО ВсеТовары.КодНоменклатурнойГруппы = НоменклатурныеГруппы.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.АВСКлассификацияНоменклатуры КАК АВСКлассификацияНоменклатуры
	|		ПО ВсеТовары.КатегорияАВС = АВСКлассификацияНоменклатуры.Код
	|ГДЕ
	|	(ЕСТЬNULL(НоменклатурныеГруппы.Ссылка, ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)) <> ВсеТовары.Ссылка.НоменклатурнаяГруппа
	|   ИЛИ ВсеТовары.Ссылка.НоменклатурнаяГруппа = ЗНАЧЕНИЕ(Справочник.НоменклатурныеГруппы.ПустаяСсылка)
	|			ИЛИ ЕСТЬNULL(АВСКлассификацияНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.АВСКлассификацияНоменклатуры.ПустаяСсылка)) <> ВсеТовары.Ссылка.ГруппаАВС)";
	
	Если Не ЗагружатьЗакупочнуюЦену Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеТовары.ЦенаЗакупочная, ", "");
	КонецЕсли;
	
	Если Не ЗагружатьАДУрал Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВсеТовары.ЦенаАДУрал, ", "");
	КонецЕсли;
	
	НоменклатураКИзменению =  Запрос.Выполнить().Выгрузить();
	
	Если НЕ Константы.ЗапретитьОбновлениеГруппыABCНоменклатуры.Получить() Тогда	
		
		Попытка
			
			Для Каждого ТекСтр ИЗ НоменклатураКИзменению Цикл   
				
				Об = ТекСтр.Ссылка.ПолучитьОбъект();
				Об.ГруппаАВС = ТекСтр.КатегорияНовая;
				Об.НоменклатурнаяГруппа = ТекСтр.НГНовая;
				Об.Записать();           
				
			КонецЦикла;	
			
		Исключение
		КонецПопытки;   
		
	КонецЕсли;		 
	
	// создание документов Цен
	
	ЗагружатьЦеныВРублях = Ложь;
	ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();  
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		ЗагружатьЦеныВРублях = Истина;
	КонецЕсли;                  
	
	ДатаНачалаУдаления = ТекущаяДата()-1;
	
	ЗапросЦенНаДату = Новый Запрос;
	ЗапросЦенНаДату.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.ТипЦен,
	|	ЦеныНоменклатуры.Период
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Период МЕЖДУ &НачДата И &КонДата
	|	И ЦеныНоменклатуры.Цена <> 0
	|	И ЦеныНоменклатуры.ТипЦен В(&МассивТиповЦен)"; 
	
	ЗапросЦенНаДату.УстановитьПараметр("НачДата", НачалоДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("КонДата", КонецДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("МассивТиповЦен", МассивТиповЦен);   
	
	РезультатЗапросаЦенНаДату = ЗапросЦенНаДату.Выполнить().Выгрузить();
	ЕстьЦеныНаДату = РезультатЗапросаЦенНаДату.Количество() > 0;      
	
	МаксимальнаяДатаДокумента = КонецДня(ТекущаяДата());      
	
	НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот, МаксимальнаяДатаДокумента);  
	
	СчетчикСтрокВДокументе = 0;
	СтрокСЦенами = 0;
	КоличествоДокументовУстановкиЦен = 0;  
	
	Для Каждого ТекСтр Из ТаблицаЦен Цикл
		
		ЕстьЦенаВСтроке = Ложь;
		
		Для сч = 3 По 8 + ?(ЗагружатьЗакупочнуюЦену, 1, 0) + ?(ЗагружатьАДУрал, 1, 0) Цикл 
			
			НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
			НоваяСтрокаДокумента.Номенклатура 		= ТекСтр.Ссылка;
			НоваяСтрокаДокумента.ЕдиницаИзмерения  	= ТекСтр.ЕдиницаХраненияОстатков;  
			
			ТекТипЦен = МассивТиповЦен[сч-3];
			ЕстьУстановленнаяЦенаНаДату = Ложь;   
			
			Если ЕстьЦеныНаДату Тогда
				ЕстьУстановленнаяЦенаНаДату = РезультатЗапросаЦенНаДату.НайтиСтроки(Новый Структура("ТипЦен,Номенклатура", ТекТипЦен, ТекСтр.Ссылка)).Количество() > 0;
			КонецЕсли;			
			
			Если ЕстьУстановленнаяЦенаНаДату  Тогда
				НоваяСтрокаДокумента.Цена = 0;
			Иначе				
				НоваяСтрокаДокумента.Цена = ТекСтр[сч];
			КонецЕсли;    
			
			НоваяСтрокаДокумента.ТипЦен = ТекТипЦен;        
			
			Если ЗагружатьЦеныВРублях Тогда 
				НоваяСтрокаДокумента.Валюта = ВалютаРубль;
			Иначе
				НоваяСтрокаДокумента.Валюта = ТекТипЦен.ВалютаЦены;
			КонецЕсли;               
			
			НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = ТаблицаЦен.Индекс(ТекСтр);
			
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
			
			Если НЕ ЕстьЦенаВСтроке Тогда
				Если ЗначениеЗаполнено(ТекСтр[сч]) Тогда
					ЕстьЦенаВСтроке = Истина;		
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьЦенаВСтроке Тогда
			СтрокСЦенами = СтрокСЦенами + 1;
		КонецЕсли;
		
		Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда    
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 				
				КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;				
				
			Исключение
				
				НовыйДокумент.Записать();
				УдалятьПредыдущиеДокументы = Ложь;
				ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Записан документ установки цен с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
				
			КонецПопытки;              
			
			НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот,МаксимальнаяДатаДокумента);
			СчетчикСтрокВДокументе = 0;  
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если НовыйДокумент.Товары.Количество()> 0 Тогда      
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;   
			
		Исключение
			
			НовыйДокумент.Записать();
			УдалятьПредыдущиеДокументы = Ложь;
			ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Записан документ установки цен с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());   
			
		КонецПопытки;  
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Проведено " + Строка(КоличествоДокументовУстановкиЦен) + " документов установки цен (строк с ценами: " + Строка(СтрокСЦенами) 
	+ " всего: " + Строка(ТаблицаЦен.Количество()) + ")");
	
	Если НЕ Константы.НеСниматьФлагНеЗагружатьЦеныПриЗагрузкеЦен.Получить() Тогда
		
		Для Каждого ТекСтр ИЗ ТаблицаНоменклатурыКСнятиюПометки Цикл   
			
			ЭлементНоменклатура	= ТекСтр.Номенклатура.ПолучитьОбъект();
			ЭлементНоменклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара = Ложь;   
			
			Попытка
				ЭлементНоменклатура.Записать();
			Исключение
			КонецПопытки;	
			
		КонецЦикла; 
		
	КонецЕсли;

	Орг = Константы.ОсновнаяОрганизация.Получить();
	Контр = Константы.ОсновнойПоставщик.Получить();
	ТипЦен = Константы.ОсновнаяЦенаЗакупкиПоставщика.Получить();           
	
	Если ЗначениеЗаполнено(Орг) И ЗначениеЗаполнено(Контр) И ЗначениеЗаполнено(ТипЦен) Тогда     
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Артикул,
		|	ТЗ.Цена
		|ПОМЕСТИТЬ Табл
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Табл.Артикул,
		|	Табл.Цена,
		|	Номенклатура.Ссылка,
		|	Номенклатура.ЕдиницаХраненияОстатков КАК ЕдХраненияОстатков
		|ИЗ
		|	Табл КАК Табл
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО Табл.Артикул = Номенклатура.Артикул";  
		
		Запрос.УстановитьПараметр("ТЗ", ТабЗакупки);  
		
		Выб = Запрос.Выполнить().Выбрать();   
		
		СчетчикСтрокВДокументе = 0; 
		
		НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
		НовыйДокумент.Дата = Мин(ТекущаяДата(),МаксимальнаяДатаДокумента);
		НовыйДокумент.Контрагент = Контр;
		НовыйДокумент.Ответственный = Робот;
		НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;  
		
		СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
		СтрТипов.ТипЦен = ТипЦен;
		
		СтрокСЦенамиКонтрагентов = 0;
		КоличествоДокументовУстановкиЦенКонтрагентов = 0;
		
		Пока Выб.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выб.Ссылка) И ЗначениеЗаполнено(Выб.ЕдХраненияОстатков) И ЗначениеЗаполнено(Выб.Цена) Тогда
				
				НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
				НоваяСтрокаДокумента.Номенклатура 		= Выб.Ссылка;
				НоваяСтрокаДокумента.ЕдиницаИзмерения  	= Выб.ЕдХраненияОстатков;
				НоваяСтрокаДокумента.Цена 				= Выб.Цена;
				НоваяСтрокаДокумента.ТипЦен 			= ТипЦен ;       
				
				Если ЗагружатьЦеныВРублях Тогда 
					НоваяСтрокаДокумента.Валюта 		= ВалютаРубль;
				Иначе
					НоваяСтрокаДокумента.Валюта 		= ТипЦен.ВалютаЦены;
				КонецЕсли;       
				
				НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = 0;
				
				СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
				СтрокСЦенамиКонтрагентов = СтрокСЦенамиКонтрагентов + 1;
				
			КонецЕсли;
			
			Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда
				
				Попытка
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
					
				Исключение
					
					НовыйДокумент.Записать();
					ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;  
				
				НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
				НовыйДокумент.Дата = Мин(ТекущаяДата(), МаксимальнаяДатаДокумента);
				НовыйДокумент.Контрагент = Контр;
				НовыйДокумент.Ответственный = Робот;
				НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;  
				
				СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
				СтрТипов.ТипЦен = ТипЦен;
				СчетчикСтрокВДокументе = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если НовыйДокумент.Товары.Количество()> 0 Тогда  
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
				
			Исключение
				
				НовыйДокумент.Записать();
				ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
				
			КонецПопытки;        
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Проведено " + Строка(КоличествоДокументовУстановкиЦенКонтрагентов) + " документов установки цен контрагентов (строк с ценами: " 
		+ Строка(СтрокСЦенамиКонтрагентов) + " всего: " + Строка(Выб.Количество()) + ")");
		
	КонецЕсли;
	
	Если УдалятьПредыдущиеДокументы И ЗначениеЗаполнено(Робот) Тогда
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Начало удаления предыдущих цен на дату меньшую: " + Формат(ДатаНачалаУдаления, "ДЛФ=DT"));
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Ответственный = &Ответственный
		|	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", Робот);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		УдаленоЦенНоменклатуры = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатуры = УдаленоЦенНоменклатуры + 1;
				
			Исключение
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометке на удаление документа: " + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
			КонецПопытки;       
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатуры) + " документов установки цен");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов.ТипыЦен КАК УстановкаЦенНоменклатурыКонтрагентовТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Ответственный = &Ответственный
		|	И УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", Робот);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		УдаленоЦенНоменклатурыКонтрагентов = 0;
		
		Пока Выборка.Следующий() Цикл 
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатурыКонтрагентов = УдаленоЦенНоменклатурыКонтрагентов + 1;  
				
			Исключение            
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					ЗаписьЖурналаРегистрации("Загрузка цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометке на удаление документа: " + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;      
				
			КонецПопытки;
			
		КонецЦикла;      
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатурыКонтрагентов) + " документов установки цен контрагентов");
		
		ЗаписьЖурналаРегистрации("Загрузка цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Окончание удаления предыдущих цен");
		
	КонецЕсли;
	
КонецПроцедуры   

Процедура СозданиеДокументаЕдиныйПрайсЛист(Файл, УдалятьПредыдущиеДокументы = Истина, ИмяФайлаЗагрузки = "", Частично = Истина, Соединение = Неопределено)  
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяРегЗадания = "Загрузка цен единый прайс-лист" + ?(Частично, " ЧАСТИЧНО", "");
	
	ДатаЗагрузки = ТекущаяДата();
	МассивДокументов = Новый Массив;
	МассивОшибок = Новый Массив;
	
	КоличествоСтрокВДокументе = 25000;
	Робот = Справочники.Пользователи.НайтиПоКоду("robot");

	ТекущаяБаза = Константы.База.Получить();
	ОтдельноеЮрЛицо = ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж
	Или ТекущаяБаза = Перечисления.НазваниеБазы.Казань
	Или ТекущаяБаза = Перечисления.НазваниеБазы.Ростов
	Или ТекущаяБаза = Перечисления.НазваниеБазы.Краснодар
	Или ТекущаяБаза = Перечисления.НазваниеБазы.Краснодар2
	Или ТекущаяБаза = Перечисления.НазваниеБазы.НижнийНовгород;
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();	
	СпецЦена        = Константы.СпецЦена.Получить();
	АДУрал			= Константы.АДУрал.Получить();
	Акция			= Константы.Акция.Получить();
	Уцененные		= Константы.Уцененные.Получить();
	Резерв4  		= Константы.Резерв4.Получить();   
	АвтоЕвропа      = Константы.АвтоЕвропа.Получить();
	
	ЗагружатьЗакупочнуюЦену = Истина; 
	ЗагружатьЦенуДляРекламнойПродукции = Истина;
	
	МассивТиповЦен =  Новый Массив;
	СоотвествиеТиповИКолонок = Новый Соответствие; 
	
	Если ЗначениеЗаполнено(АДУрал) Тогда       
		
		МассивТиповЦен.Добавить(АДУрал);
		СоотвествиеТиповИКолонок.Вставить(АДУрал, 3);  
		
	КонецЕсли;  	
	
	МассивТиповЦен.Добавить(Скидка35);
	СоотвествиеТиповИКолонок.Вставить(Скидка35, 6); 	
	МассивТиповЦен.Добавить(Базовая);
	СоотвествиеТиповИКолонок.Вставить(Базовая, 7);
	МассивТиповЦен.Добавить(ЗакупочнаяЦена);
	СоотвествиеТиповИКолонок.Вставить(ЗакупочнаяЦена, ?(ОтдельноеЮрЛицо, 3, 9)); 	
	МассивТиповЦен.Добавить(Скидка36);
	СоотвествиеТиповИКолонок.Вставить(Скидка36, 11);
	МассивТиповЦен.Добавить(Скидка37);
	СоотвествиеТиповИКолонок.Вставить(Скидка37, 12);
	МассивТиповЦен.Добавить(Скидка38);
	СоотвествиеТиповИКолонок.Вставить(Скидка38, 14);
	
	Если ЗначениеЗаполнено(Уцененные) Тогда
		
		МассивТиповЦен.Добавить(Уцененные);		
		СоотвествиеТиповИКолонок.Вставить(Уцененные, 16);
		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Акция) Тогда
		
		МассивТиповЦен.Добавить(Акция);
		СоотвествиеТиповИКолонок.Вставить(Акция, 17);
		
	КонецЕсли;
	
	МассивТиповЦен.Добавить(СпецЦена);
	СоотвествиеТиповИКолонок.Вставить(СпецЦена, 19);

	Если ЗначениеЗаполнено(Резерв4) Тогда
		
		МассивТиповЦен.Добавить(Резерв4);
		СоотвествиеТиповИКолонок.Вставить(Резерв4, 20); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АвтоЕвропа) Тогда
		
		МассивТиповЦен.Добавить(АвтоЕвропа);
		СоотвествиеТиповИКолонок.Вставить(АвтоЕвропа, 4); 
		
	КонецЕсли;
	
	ТаблицаТоваровИЦен = Новый ТаблицаЗначений;
	ТаблицаТоваровИЦен.Колонки.Добавить("КодМДМ", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36))); 
	
	ТаблицаЗакупка = Новый ТаблицаЗначений;
	ТаблицаЗакупка.Колонки.Добавить("КодМДМ", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаЗакупка.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		
		Если ТаблицаТоваровИЦен.Колонки.Найти("Кол_" + СокрЛП(СтрокаСоответствия.Значение)) = Неопределено Тогда    
			
			ТаблицаТоваровИЦен.Колонки.Добавить("Кол_" + СокрЛП(СтрокаСоответствия.Значение),
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), СокрЛП(СтрокаСоответствия.Ключ));  
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ForReading = 1;
	
	objFSO = Новый COMОбъект("Scripting.FileSystemObject");
	Текст = objFSO.OpenTextFile(Файл,ForReading,1);   
	
	КолонкаЦеныЗакупки = ?(ОтдельноеЮрЛицо,2,8); 
	
	Пока Текст.atEndOfStream()=0 Цикл 
		
		СтрокаФайла=Текст.ReadLine();
		МассивСтрокиДанных = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаФайла, Символы.Таб);    
		
		НоваяСтрокаТаблицы = ТаблицаТоваровИЦен.Добавить();
		НоваяСтрокаТаблицы.КодМДМ = МассивСтрокиДанных[0];
		
		Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл			
			НоваяСтрокаТаблицы["Кол_" + СокрЛП(СтрокаСоответствия.Значение)] = МассивСтрокиДанных[СтрокаСоответствия.Значение - 1];
		КонецЦикла;                             
		
		Попытка
			ЦенаЗакупки = Число(МассивСтрокиДанных[КолонкаЦеныЗакупки]); 
		Исключение
			ЦенаЗакупки = 0;
		КонецПопытки;
		
		Если НЕ ЦенаЗакупки = 0 Тогда
			
			НоваяСтрокаЗакупка = ТаблицаЗакупка.Добавить();
			НоваяСтрокаЗакупка.КодМДМ = МассивСтрокиДанных[0]; 
			НоваяСтрокаЗакупка.Цена = ЦенаЗакупки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Текст.Close();
	УдалитьФайлы(Файл); 
	
	Сообщить("В файле " + СокрЛП(ТаблицаТоваровИЦен.Количество()) + " строк");
	Сообщить("В файле закупка " + СокрЛП(ТаблицаЗакупка.Количество()) + " строк");     
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк в полученной таблице: " + Строка(ТаблицаТоваровИЦен.Количество()));	
	
	ЗапросТаблицыДляЗагрузки = Новый Запрос;
	ЗапросТаблицыДляЗагрузки.УстановитьПараметр("ТаблицаТоваровИЦен",ТаблицаТоваровИЦен);
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() И ЗначениеЗаполнено(Константы.ГруппаНоменклатурыУценка.Получить()) Тогда
		ЗапросТаблицыДляЗагрузки.УстановитьПараметр("Уценка", Константы.ГруппаНоменклатурыУценка.Получить());
	Иначе
		ЗапросТаблицыДляЗагрузки.УстановитьПараметр("Уценка", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТабЗагрузки.КодМДМ, ";      
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ТабЗагрузки.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                  
	
	ТекстЗапроса = Лев(ТекстЗапроса,стрДлина(ТекстЗапроса)-1) + " 
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&ТаблицаТоваровИЦен КАК ТабЗагрузки
	| ГДЕ ";             
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "НЕ ТабЗагрузки.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + " = 0 ИЛИ "
	КонецЦикла; 	   
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 4) + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабЗагрузки.КодМДМ  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка,
	|	СправочникНоменклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара,
	|	Таб.КодМДМ, ";                                               
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	Таб.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                                         
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1) + " 
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ
	|	Таб КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Таб.КодМДМ = СправочникНоменклатура.КодМДМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ НеЗагружаемыеТовары
	|ИЗ 
	|	ВсеТовары КАК ВсеТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВсеТовары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВРезервеНаСкладахОстатки.Номенклатура = ВсеТовары.Ссылка)
	|ГДЕ
	|	ВсеТовары.НеЗагружатьЦеныЕслиЕстьОстатокТовара
	|	И ВЫБОР
	|			КОГДА НЕ &Уценка = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА НЕ ВсеТовары.Ссылка В ИЕРАРХИИ (&Уценка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ  	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ВсеТовары.КодМДМ, "; 
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ВсеТовары.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;              
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1) + " 
	|ПОМЕСТИТЬ ТабНоменклатуры
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|ГДЕ
	|	НЕ ВсеТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					НеЗагружаемыеТовары.Ссылка
	|				ИЗ 
	|  	                Константы КАК Константы,
	|					НеЗагружаемыеТовары КАК НеЗагружаемыеТовары
	|				ГДЕ
	|					ВЫБОР
	|					КОГДА Константы.НеСниматьФлагНеЗагружатьЦеныПриЗагрузкеЦен
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ НеЗагружаемыеТовары.Остаток > 0
	|   				КОНЕЦ) 
	|	И ВЫБОР
	|			КОГДА НЕ &Уценка = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА НЕ ВсеТовары.Ссылка В ИЕРАРХИИ (&Уценка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ  	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНоменклатуры.Ссылка,
	|	ТабНоменклатуры.КодМДМ,
	|	ТабНоменклатуры.Ссылка.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков, ";
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ТабНоменклатуры.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                            
	
	ТекстЗапроса = Лев(ТекстЗапроса,стрДлина(ТекстЗапроса) - 1) + "
	|ИЗ
	|	ТабНоменклатуры КАК ТабНоменклатуры ";        
	
	ЗапросТаблицыДляЗагрузки.Текст = ТекстЗапроса;
	ПакетРезультата = ЗапросТаблицыДляЗагрузки.ВыполнитьПакет();
	ТаблицаЦен = ПакетРезультата[4].Выгрузить();   
	
	Сообщить("В запросе " + СокрЛП(ТаблицаЦен.Количество()) + " строк");
	ЗаписьЖурналаРегистрации("Загрузка цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк с ценами: " + Строка(ТаблицаЦен.Количество()));
	
	ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
	ДатаНачалаУдаления = ТекущаяДата() - 1; 
	
	ЗапросЦенНаДату = Новый Запрос;
	ЗапросЦенНаДату.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.ТипЦен,
	|	ЦеныНоменклатуры.Период
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Период МЕЖДУ &НачДата И &КонДата
	|	И ЦеныНоменклатуры.Цена <> 0
	|	И ЦеныНоменклатуры.ТипЦен В(&МассивТиповЦен)";  
	
	ЗапросЦенНаДату.УстановитьПараметр("НачДата", НачалоДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("КонДата", КонецДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("МассивТиповЦен", МассивТиповЦен);  
	
	РезультатЗапросаЦенНаДату = ЗапросЦенНаДату.Выполнить().Выгрузить();
	ЕстьЦеныНаДату = РезультатЗапросаЦенНаДату.Количество() > 0;
	
	МаксимальнаяДатаДокумента = КонецДня(ТекущаяДата());         
	
	НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот, МаксимальнаяДатаДокумента);
	НовыйДокумент.ИмяФайлаЗагрузки = ИмяФайлаЗагрузки;		    
	
	СчетчикСтрокВДокументе = 0;
	СтрокСЦенами = 0;
	КоличествоДокументовУстановкиЦен = 0; 
	
	Для каждого ТекСтр Из ТаблицаЦен Цикл  
		
		Если ЗначениеЗаполнено(ТекСтр.Ссылка) И ЗначениеЗаполнено(ТекСтр.ЕдиницаХраненияОстатков) Тогда 
			
			ЕстьЦенаВСтроке = Ложь;                                     
			
			Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл      
				
				НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
				НоваяСтрокаДокумента.Номенклатура 		= ТекСтр.Ссылка;
				НоваяСтрокаДокумента.ЕдиницаИзмерения  	= ТекСтр.ЕдиницаХраненияОстатков; 
				
				ТекТипЦен = СтрокаСоответствия.Ключ;
				ЕстьУстановленнаяЦенаНаДату = Ложь;

				Если ЕстьУстановленнаяЦенаНаДату  Тогда
					НоваяСтрокаДокумента.Цена = 0;
				Иначе				
					НоваяСтрокаДокумента.Цена = ТекСтр["Кол_" + СтрокаСоответствия.Значение];
				КонецЕсли;
				
				НоваяСтрокаДокумента.ТипЦен = ТекТипЦен ;
				НоваяСтрокаДокумента.Валюта = ВалютаРубль;
				
				НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = ТаблицаЦен.Индекс(ТекСтр);
				
				СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
				
				Если НЕ ЕстьЦенаВСтроке Тогда           
					
					Если ЗначениеЗаполнено(ТекСтр["Кол_" + СтрокаСоответствия.Значение]) Тогда
						ЕстьЦенаВСтроке = Истина;		
					КонецЕсли;                  
					
				КонецЕсли;   
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		Если ЕстьЦенаВСтроке Тогда
			СтрокСЦенами = СтрокСЦенами + 1;
		КонецЕсли;                    
		
		Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда 
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 				
				КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;	
				
			Исключение                   
				
				НовыйДокумент.Записать();
				УдалятьПредыдущиеДокументы = Ложь;     
				
				ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Записан документ установки цен с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество() / СоотвествиеТиповИКолонок.Количество()) 
				+ Символы.ПС + ОписаниеОшибки());     
				
				МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());  
				
			КонецПопытки;                  
			
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);	
			НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот,МаксимальнаяДатаДокумента);
			НовыйДокумент.ИмяФайлаЗагрузки = ИмяФайлаЗагрузки;		
			СчетчикСтрокВДокументе = 0;    
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	Если НовыйДокумент.Товары.Количество() > 0 Тогда   
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;
			
		Исключение
			
			НовыйДокумент.Записать();
			УдалятьПредыдущиеДокументы = Ложь;
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Записан документ установки цен с количеством товаров: " 
			+ Строка(НовыйДокумент.Товары.Количество() / СоотвествиеТиповИКолонок.Количество()) + Символы.ПС + ОписаниеОшибки());
			МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
			
		КонецПопытки;
		
		МассивДокументов.Добавить(НовыйДокумент.Ссылка);	
		
	КонецЕсли;
	
	Если Не Частично Тогда
		
		Орг = Константы.ОсновнаяОрганизация.Получить();
		Контр = Константы.ОсновнойПоставщик.Получить();
		ТипЦен = Константы.ОсновнаяЦенаЗакупкиПоставщика.Получить(); 
		
		Если ЗначениеЗаполнено(Орг) И ЗначениеЗаполнено(Контр) И ЗначениеЗаполнено(ТипЦен) И ТаблицаЗакупка.Количество() > 0 Тогда  
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ТЗ.КодМДМ,
			|	ТЗ.Цена
			|ПОМЕСТИТЬ Табл
			|ИЗ
			|	&ТЗ КАК ТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Табл.КодМДМ,
			|	Табл.Цена,
			|	Номенклатура.Ссылка,
			|	Номенклатура.ЕдиницаХраненияОстатков КАК ЕдХраненияОстатков
			|ИЗ
			|	Табл КАК Табл
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО Табл.КодМДМ = Номенклатура.КодМДМ";  
			
			Запрос.УстановитьПараметр("ТЗ", ТаблицаЗакупка);
			Выб = Запрос.Выполнить().Выбрать();      
			
			СчетчикСтрокВДокументе = 0;              
			
			НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
			НовыйДокумент.Дата = Мин(ТекущаяДата(), МаксимальнаяДатаДокумента);
			НовыйДокумент.Контрагент = Контр;
			НовыйДокумент.Ответственный = Робот;
			НовыйДокумент.НеПроводитьНулевыеЗначения = Истина; 
			
			СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
			СтрТипов.ТипЦен = ТипЦен;            
			
			СтрокСЦенамиКонтрагентов = 0;
			КоличествоДокументовУстановкиЦенКонтрагентов = 0; 
			
			Пока Выб.Следующий() Цикл        
				
				Если ЗначениеЗаполнено(Выб.Ссылка) И ЗначениеЗаполнено(Выб.ЕдХраненияОстатков) И ЗначениеЗаполнено(Выб.Цена) Тогда   
					
					НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
					НоваяСтрокаДокумента.Номенклатура 		= Выб.Ссылка;
					НоваяСтрокаДокумента.ЕдиницаИзмерения  	= Выб.ЕдХраненияОстатков;
					НоваяСтрокаДокумента.Цена 				= Выб.Цена;
					НоваяСтрокаДокумента.ТипЦен 			= ТипЦен;
					НоваяСтрокаДокумента.Валюта 		    = ВалютаРубль;
					НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = 0;
					СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
					СтрокСЦенамиКонтрагентов = СтрокСЦенамиКонтрагентов + 1;     
					
				КонецЕсли;                                                    
				
				Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда  
					
					Попытка
						
						НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
						КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
						
					Исключение
						
						НовыйДокумент.Записать();
						ЗаписьЖурналаРегистрации("Загрузка цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
						МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
						
						
					КонецПопытки;
					
					НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
					НовыйДокумент.Дата = Мин(ТекущаяДата(),МаксимальнаяДатаДокумента);
					НовыйДокумент.Контрагент = Контр;
					НовыйДокумент.Ответственный = Робот;
					НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;
					
					СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
					СтрТипов.ТипЦен = ТипЦен;
					
					СчетчикСтрокВДокументе = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если НовыйДокумент.Товары.Количество()> 0 Тогда
				
				Попытка
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
					
				Исключение
					
					НовыйДокумент.Записать();
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
					МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;
				
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
			"Проведено " + Строка(КоличествоДокументовУстановкиЦенКонтрагентов) + " документов установки цен контрагентов (строк с ценами: " 
			+ Строка(СтрокСЦенамиКонтрагентов) + " всего: " + Строка(Выб.Количество()) + ")");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Частично и УдалятьПредыдущиеДокументы И ЗначениеЗаполнено(Робот) Тогда     
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Начало удаления предыдущих цен на дату меньшую: " + Формат(ДатаНачалаУдаления, "ДЛФ=DT"));  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Ответственный = &Ответственный
		|	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка";  
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", Робот);
		
		Выборка = Запрос.Выполнить().Выбрать();
		УдаленоЦенНоменклатуры = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатуры = УдаленоЦенНоменклатуры + 1;
				
			Исключение
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометки на удаление документа: " + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатуры) + " документов установки цен");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов.ТипыЦен КАК УстановкаЦенНоменклатурыКонтрагентовТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Ответственный = &Ответственный
		|	И УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка"; 
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", Робот);
		
		Выборка = Запрос.Выполнить().Выбрать();
		УдаленоЦенНоменклатурыКонтрагентов = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатурыКонтрагентов = УдаленоЦенНоменклатурыКонтрагентов + 1;
				
			Исключение
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
					МассивОшибок.Добавить("Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометке на удаление документа: " + Символы.ПС + ОписаниеОшибки());
					МассивОшибок.Добавить("Ошибка при установке пометки на удаление документа: " + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;
				
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатурыКонтрагентов) + " документов установки цен контрагентов");
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, "Окончание удаления предыдущих цен");
		
	КонецЕсли; 
	
	ЗаписатьЛогЗагрузкиЕдиныйПрайсЛистЧастично(Соединение, ДатаЗагрузки, ИмяФайлаЗагрузки, МассивДокументов, ТаблицаТоваровИЦен.Количество());
	ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);        
	
Конецпроцедуры

Процедура УдалениеДокументовУстановкаЦенНоменклатуры() Экспорт
//+Гавриленков В. 13.02.2026 #UT10-5690

	ДатаДо = ДобавитьМесяц(ТекущаяДата(), - 6);
	
	ЗаписьЖурналаРегистрации("Удаление цен номенклатуры", УровеньЖурналаРегистрации.Информация,,, "Начало удаления предыдущих цен на дату меньше: " + Формат(ДатаДо, "ДЛФ=DT"));  
	
	КоличествоДокументов = 100;
	
	ТаблицаСвойствЗначений = Справочники.МТ_ПредопределенныеЗначения.ПолучитьТаблицуВсехСвойствЗначений(Справочники.МТ_ПредопределенныеЗначения.УдалениеДокументовУстановкаЦенНоменклатуры);
	
	Если ТипЗнч(ТаблицаСвойствЗначений) = Тип("ТаблицаЗначений") Тогда
		
		СтрокаДата = ТаблицаСвойствЗначений.Найти("Количество месяцев хранения цен", "Свойство");
		Если (Не СтрокаДата = Неопределено) И ЗначениеЗаполнено(СтрокаДата.Значение) И (ТипЗнч(СтрокаДата.Значение) = Тип("Число")) Тогда
			ДатаДо = ДобавитьМесяц(ТекущаяДата(), - СтрокаДата.Значение);
		КонецЕсли;
		
		СтрокаКоличествоДокументов = ТаблицаСвойствЗначений.Найти("Количество документов", "Свойство");
		Если (Не СтрокаКоличествоДокументов = Неопределено) И ЗначениеЗаполнено(СтрокаКоличествоДокументов.Значение) И (ТипЗнч(СтрокаКоличествоДокументов.Значение) = Тип("Число")) Тогда
			КоличествоДокументов = СтрокаКоличествоДокументов.Значение;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоДокументов, "ЧГ=0") + "
	|	УстановкаЦенНоменклатуры.Ссылка
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Дата < &Дата";  
	
	Запрос.УстановитьПараметр("Дата", ДатаДо);
	
	Выборка = Запрос.Выполнить().Выбрать();
	УдаленоЦенНоменклатуры = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		КоличествоТоваров = Об.Товары.Количество();
		
		Попытка
			
			Об.Удалить();
			УдаленоЦенНоменклатуры = УдаленоЦенНоменклатуры + 1;
			
		Исключение
			
			Попытка
				
				Об.УстановитьПометкуУдаления(Истина);
				ЗаписьЖурналаРегистрации("Удаление цен номенклатуры", УровеньЖурналаРегистрации.Ошибка,,, "Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
				
			Исключение
				ЗаписьЖурналаРегистрации("Удаление цен номенклатуры", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при установке пометки на удаление документа: " + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Удаление цен номенклатуры", УровеньЖурналаРегистрации.Информация,,, "Удалено " + Строка(УдаленоЦенНоменклатуры) + " документов установки цен");
	
	ЗаписьЖурналаРегистрации("Удаление цен номенклатуры", УровеньЖурналаРегистрации.Информация,,, "Окончание удаления предыдущих цен");
	
//-Гавриленков В. 13.02.2026 #UT10-5690	
КонецПроцедуры

Процедура ЗаполнитьЗначенияДляЗагрузкиИзГоловногоФилиала(МассивСтрокиДанных, МассивТиповЦен, СоотвествиеТиповИКолонок, ТаблицаТоваровИЦен, КолонкаЗакупки)
	
    СтрокВМассиве = МассивСтрокиДанных.Количество()-1;
	ИндексСтрокиМассива = 2;
	
	КонстантаЗакупочнаяЦена = Константы.ЗакупочнаяЦена.Получить();
	
	Пока ИндексСтрокиМассива <= СтрокВМассиве Цикл
		
		КодМДМТипаЦен = МассивСтрокиДанных[ИндексСтрокиМассива]; 
		
		ЕстьТипЦенПоКодуМДМ = Справочники.ТипыЦенНоменклатуры.НайтиПоРеквизиту("КодМДМ", КодМДМТипаЦен);
		
		Если ЕстьТипЦенПоКодуМДМ.Пустая() Тогда
			
			ЗаписьЖурналаРегистрации("Загрузка цен номенклатуры из головного филиала.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Не найден тип цены с кодом МДМ " + СокрЛП(КодМДМТипаЦен));
			
		Иначе
			
			МассивТиповЦен.Добавить(ЕстьТипЦенПоКодуМДМ);
			СоотвествиеТиповИКолонок.Вставить(ЕстьТипЦенПоКодуМДМ, ИндексСтрокиМассива);
			
			Если ЕстьТипЦенПоКодуМДМ = КонстантаЗакупочнаяЦена Тогда
				КолонкаЗакупки = ИндексСтрокиМассива;			
			КонецЕсли;
			
		КонецЕсли;
		
		ИндексСтрокиМассива = ИндексСтрокиМассива + 1;
		
	КонецЦикла;
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		
		Если ТаблицаТоваровИЦен.Колонки.Найти("Кол_" + СокрЛП(СтрокаСоответствия.Значение)) = Неопределено Тогда    
			
			ТаблицаТоваровИЦен.Колонки.Добавить("Кол_" + СокрЛП(СтрокаСоответствия.Значение),
			Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)), СокрЛП(СтрокаСоответствия.Ключ));  
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СозданиеДокументаИзГоловногоФилиала(Файл, УдалятьПредыдущиеДокументы = Истина, ИмяФайлаЗагрузки = "", Соединение = Неопределено)  
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяРегЗадания = "Загрузка цен номенклатуры из головного филиала";
	
	ДатаЗагрузки = ТекущаяДата();
	МассивДокументов = Новый Массив;
	МассивОшибок = Новый Массив;
	
	КоличествоСтрокВДокументе = 25000;
	Робот = Справочники.Пользователи.НайтиПоКоду("robot_op");
	
	Если Робот.Пустая() Тогда
		Робот = Справочники.Пользователи.НайтиПоКоду("robot");
	КонецЕсли;
	
	ЗагружатьЗакупочнуюЦену = Истина; 
	ЗагружатьЦенуДляРекламнойПродукции = Истина;
	
	МассивТиповЦен =  Новый Массив;
	СоотвествиеТиповИКолонок = Новый Соответствие; 
	
	ТаблицаТоваровИЦен = Новый ТаблицаЗначений;
	ТаблицаТоваровИЦен.Колонки.Добавить("КодМДМ"		   , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36))); 
	ТаблицаТоваровИЦен.Колонки.Добавить("КратностьФилиала" , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	
	ТаблицаЗакупка = Новый ТаблицаЗначений;
	ТаблицаЗакупка.Колонки.Добавить("КодМДМ"			   , Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ТаблицаЗакупка.Колонки.Добавить("Цена"				   , Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	
	
	ForReading = 1;
	
	objFSO = Новый COMОбъект("Scripting.FileSystemObject");
	Текст = objFSO.OpenTextFile(Файл,ForReading,1);   
	
	КолонкаЦеныЗакупки = 0; 
	
	СтрокаЗаголовка = Истина;
	
	Пока Текст.atEndOfStream()=0 Цикл 
		
		СтрокаФайла=Текст.ReadLine();
		
		МассивСтрокиДанных = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СтрокаФайла, Символы.Таб);    
		
		Если СтрокаЗаголовка Тогда
			
			ЗаполнитьЗначенияДляЗагрузкиИзГоловногоФилиала(МассивСтрокиДанных, МассивТиповЦен, СоотвествиеТиповИКолонок, ТаблицаТоваровИЦен, КолонкаЦеныЗакупки);
			
			Если СоотвествиеТиповИКолонок.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаЗаголовка = Ложь;
			
			Продолжить; 
			
		КонецЕсли;		
		
		НоваяСтрокаТаблицы = ТаблицаТоваровИЦен.Добавить();       
		
		НоваяСтрокаТаблицы.КодМДМ = МассивСтрокиДанных[0];
		НоваяСтрокаТаблицы.КратностьФилиала = МассивСтрокиДанных[1];
		
		Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл			
			НоваяСтрокаТаблицы["Кол_" + СокрЛП(СтрокаСоответствия.Значение)] = МассивСтрокиДанных[СтрокаСоответствия.Значение];
		КонецЦикла;                             
		
		Попытка
			ЦенаЗакупки = Число(МассивСтрокиДанных[КолонкаЦеныЗакупки]); 
		Исключение
			ЦенаЗакупки = 0;
		КонецПопытки;
		
		Если НЕ ЦенаЗакупки = 0 Тогда
			
			НоваяСтрокаЗакупка = ТаблицаЗакупка.Добавить();
			НоваяСтрокаЗакупка.КодМДМ = МассивСтрокиДанных[0]; 
			НоваяСтрокаЗакупка.Цена = ЦенаЗакупки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Текст.Close();
	УдалитьФайлы(Файл); 
	
	Сообщить("В файле " + СокрЛП(ТаблицаТоваровИЦен.Количество()) + " строк");
	Сообщить("В файле закупка " + СокрЛП(ТаблицаЗакупка.Количество()) + " строк");     
	
	ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк в полученной таблице: " + Строка(ТаблицаТоваровИЦен.Количество()));	
	
	ЗапросТаблицыДляЗагрузки = Новый Запрос;
	ЗапросТаблицыДляЗагрузки.УстановитьПараметр("ТаблицаТоваровИЦен",ТаблицаТоваровИЦен);
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() И ЗначениеЗаполнено(Константы.ГруппаНоменклатурыУценка.Получить()) Тогда
		ЗапросТаблицыДляЗагрузки.УстановитьПараметр("Уценка", Константы.ГруппаНоменклатурыУценка.Получить());
	Иначе
		ЗапросТаблицыДляЗагрузки.УстановитьПараметр("Уценка", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли;	
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТабЗагрузки.КодМДМ, 
	|	ТабЗагрузки.КратностьФилиала, ";      
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ТабЗагрузки.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                  
	
	ТекстЗапроса = Лев(ТекстЗапроса,стрДлина(ТекстЗапроса)-1) + " 
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&ТаблицаТоваровИЦен КАК ТабЗагрузки
	| ГДЕ ";             
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "НЕ ТабЗагрузки.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + " = 0 ИЛИ "
	КонецЦикла; 	   
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 4) + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТабЗагрузки.КодМДМ  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка,
	|	СправочникНоменклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара,
	|	Таб.КодМДМ, 
	|	Таб.КратностьФилиала, ";                                               
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	Таб.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                                         
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 1) + " 
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ
	|	Таб КАК Таб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Таб.КодМДМ = СправочникНоменклатура.КодМДМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеТовары.Ссылка,
	|	ВсеТовары.КодМДМ, 
	|	ВсеТовары.КратностьФилиала, "; 
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ВсеТовары.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;              
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса)-1) + " 
	|ПОМЕСТИТЬ ТабНоменклатуры
	|ИЗ
	|	ВсеТовары КАК ВсеТовары 
	|ГДЕ 
	|	ВЫБОР
	|			КОГДА НЕ &Уценка = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|				ТОГДА НЕ ВсеТовары.Ссылка В ИЕРАРХИИ (&Уценка)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ  	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабНоменклатуры.Ссылка,
	|	ТабНоменклатуры.КодМДМ,
	|	ТабНоменклатуры.Ссылка.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков, 
	|	ТабНоменклатуры.КратностьФилиала, ";
	
	Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "	ТабНоменклатуры.Кол_" + СокрЛП(СтрокаСоответствия.Значение) + ","
	КонецЦикла;                            
	
	ТекстЗапроса = Лев(ТекстЗапроса,стрДлина(ТекстЗапроса) - 1) + "
	|ИЗ
	|	ТабНоменклатуры КАК ТабНоменклатуры ";        
	
	ЗапросТаблицыДляЗагрузки.Текст = ТекстЗапроса;
	ПакетРезультата = ЗапросТаблицыДляЗагрузки.ВыполнитьПакет();
	ТаблицаЦен = ПакетРезультата[3].Выгрузить();   
	
	Сообщить("В запросе " + СокрЛП(ТаблицаЦен.Количество()) + " строк");
	ЗаписьЖурналаРегистрации("Загрузка цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк с ценами: " + Строка(ТаблицаЦен.Количество()));
	
	ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
	ДатаНачалаУдаления = ТекущаяДата()-1; 
	
	ЗапросЦенНаДату = Новый Запрос;
	ЗапросЦенНаДату.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.ТипЦен,
	|	ЦеныНоменклатуры.Период
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Период МЕЖДУ &НачДата И &КонДата
	|	И ЦеныНоменклатуры.Цена <> 0
	|	И ЦеныНоменклатуры.ТипЦен В(&МассивТиповЦен)";  
	
	ЗапросЦенНаДату.УстановитьПараметр("НачДата", НачалоДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("КонДата", КонецДня(ТекущаяДата()));
	ЗапросЦенНаДату.УстановитьПараметр("МассивТиповЦен", МассивТиповЦен);  
	
	РезультатЗапросаЦенНаДату = ЗапросЦенНаДату.Выполнить().Выгрузить();
	ЕстьЦеныНаДату = РезультатЗапросаЦенНаДату.Количество() > 0;
	
	МаксимальнаяДатаДокумента = КонецДня(ТекущаяДата());         
	
	НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот, МаксимальнаяДатаДокумента);
	НовыйДокумент.ИмяФайлаЗагрузки = ИмяФайлаЗагрузки;		    
	
	СчетчикСтрокВДокументе = 0;
	СтрокСЦенами = 0;
	КоличествоДокументовУстановкиЦен = 0; 
	
	Для каждого ТекСтр Из ТаблицаЦен Цикл  
		
		Если ЗначениеЗаполнено(ТекСтр.Ссылка) И ЗначениеЗаполнено(ТекСтр.ЕдиницаХраненияОстатков) Тогда 
			
			ЕстьЦенаВСтроке = Ложь;                                     
			
			Для Каждого СтрокаСоответствия Из СоотвествиеТиповИКолонок Цикл      
				
				НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
				НоваяСтрокаДокумента.Номенклатура 		= ТекСтр.Ссылка;
				НоваяСтрокаДокумента.ЕдиницаИзмерения  	= ТекСтр.ЕдиницаХраненияОстатков; 
				
				ТекТипЦен = СтрокаСоответствия.Ключ;
				ЕстьУстановленнаяЦенаНаДату = Ложь;
				
				Если ЕстьУстановленнаяЦенаНаДату  Тогда
					НоваяСтрокаДокумента.Цена = 0;
				Иначе				
					НоваяСтрокаДокумента.Цена = ТекСтр["Кол_" + СтрокаСоответствия.Значение];
				КонецЕсли;
				
				НоваяСтрокаДокумента.ТипЦен = ТекТипЦен ;
				НоваяСтрокаДокумента.Валюта = ВалютаРубль;
				
				НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = ТаблицаЦен.Индекс(ТекСтр);
				
				СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
				
				Если НЕ ЕстьЦенаВСтроке Тогда           
					
					Если ЗначениеЗаполнено(ТекСтр["Кол_" + СтрокаСоответствия.Значение]) Тогда
						ЕстьЦенаВСтроке = Истина;		
					КонецЕсли;                  
					
				КонецЕсли;   
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		Если ЕстьЦенаВСтроке Тогда
			СтрокСЦенами = СтрокСЦенами + 1;
		КонецЕсли;                    
		
		Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда 
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 				
				КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;	
				
			Исключение                   
				
				НовыйДокумент.Записать();
				УдалятьПредыдущиеДокументы = Ложь;     
				
				ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Записан документ установки цен с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество() / СоотвествиеТиповИКолонок.Количество()) 
				+ Символы.ПС + ОписаниеОшибки());     
				
				МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());  
				
			КонецПопытки;                  
			
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);	
			НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Робот, МаксимальнаяДатаДокумента);
			НовыйДокумент.ИмяФайлаЗагрузки = ИмяФайлаЗагрузки;		
			СчетчикСтрокВДокументе = 0;    
			
		КонецЕсли;  
		
	КонецЦикла; 
	
	Если НовыйДокумент.Товары.Количество() > 0 Тогда   
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КоличествоДокументовУстановкиЦен = КоличествоДокументовУстановкиЦен + 1;
			
		Исключение
			
			НовыйДокумент.Записать();
			УдалятьПредыдущиеДокументы = Ложь;
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Записан документ установки цен с количеством товаров: " 
			+ Строка(НовыйДокумент.Товары.Количество() / СоотвествиеТиповИКолонок.Количество()) + Символы.ПС + ОписаниеОшибки());
			МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
			
		КонецПопытки;
		
		МассивДокументов.Добавить(НовыйДокумент.Ссылка);	
		
	КонецЕсли;
	
	Орг = Константы.ОсновнаяОрганизация.Получить();
	Контр = Константы.ОсновнойПоставщик.Получить();
	ТипЦен = Константы.ОсновнаяЦенаЗакупкиПоставщика.Получить(); 
	
	Если ЗначениеЗаполнено(Орг) И ЗначениеЗаполнено(Контр) И ЗначениеЗаполнено(ТипЦен) И ТаблицаЗакупка.Количество() > 0 Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ.КодМДМ,
		|	ТЗ.Цена
		|ПОМЕСТИТЬ Табл
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Табл.КодМДМ,
		|	Табл.Цена,
		|	Номенклатура.Ссылка,
		|	Номенклатура.ЕдиницаХраненияОстатков КАК ЕдХраненияОстатков
		|ИЗ
		|	Табл КАК Табл
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО Табл.КодМДМ = Номенклатура.КодМДМ";  
		
		Запрос.УстановитьПараметр("ТЗ", ТаблицаЗакупка);
		Выб = Запрос.Выполнить().Выбрать();      
		
		СчетчикСтрокВДокументе = 0;              
		
		НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
		НовыйДокумент.Дата = Мин(ТекущаяДата(), МаксимальнаяДатаДокумента);
		НовыйДокумент.Контрагент = Контр;
		НовыйДокумент.Ответственный = Робот;
		НовыйДокумент.НеПроводитьНулевыеЗначения = Истина; 
		
		СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
		СтрТипов.ТипЦен = ТипЦен;            
		
		СтрокСЦенамиКонтрагентов = 0;
		КоличествоДокументовУстановкиЦенКонтрагентов = 0; 
		
		Пока Выб.Следующий() Цикл        
			
			Если ЗначениеЗаполнено(Выб.Ссылка) И ЗначениеЗаполнено(Выб.ЕдХраненияОстатков) И ЗначениеЗаполнено(Выб.Цена) Тогда   
				
				НоваяСтрокаДокумента = НовыйДокумент.Товары.Добавить();
				НоваяСтрокаДокумента.Номенклатура 		= Выб.Ссылка;
				НоваяСтрокаДокумента.ЕдиницаИзмерения  	= Выб.ЕдХраненияОстатков;
				НоваяСтрокаДокумента.Цена 				= Выб.Цена;
				НоваяСтрокаДокумента.ТипЦен 			= ТипЦен ;
				НоваяСтрокаДокумента.Валюта 		= ВалютаРубль;
				НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = 0;
				СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;
				СтрокСЦенамиКонтрагентов = СтрокСЦенамиКонтрагентов + 1;     
				
			КонецЕсли;                                                    
			
			Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда  
				
				Попытка
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
					
				Исключение
					
					НовыйДокумент.Записать();
					ЗаписьЖурналаРегистрации("Загрузка цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
					МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
					
					
				КонецПопытки;
				
				НовыйДокумент = Документы.УстановкаЦенНоменклатурыКонтрагентов.СоздатьДокумент();
				НовыйДокумент.Дата = Мин(ТекущаяДата(),МаксимальнаяДатаДокумента);
				НовыйДокумент.Контрагент = Контр;
				НовыйДокумент.Ответственный = Робот;
				НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;
				
				СтрТипов = НовыйДокумент.ТипыЦен.Добавить();
				СтрТипов.ТипЦен = ТипЦен;
				
				СчетчикСтрокВДокументе = 0;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НовыйДокумент.Товары.Количество()> 0 Тогда
			
			Попытка
				
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
				КоличествоДокументовУстановкиЦенКонтрагентов = КоличествоДокументовУстановкиЦенКонтрагентов + 1;
				
			Исключение
				
				НовыйДокумент.Записать();
				ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Записан документ установки цен контрагентов с количеством товаров: " + Строка(НовыйДокумент.Товары.Количество()) + Символы.ПС + ОписаниеОшибки());
				МассивОшибок.Добавить("Ошибка при проведении документа Установка цен номенклатуры " + НовыйДокумент.Номер + Символы.ПС + ОписаниеОшибки());
				
			КонецПопытки;
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Проведено " + Строка(КоличествоДокументовУстановкиЦенКонтрагентов) + " документов установки цен контрагентов (строк с ценами: " 
		+ Строка(СтрокСЦенамиКонтрагентов) + " всего: " + Строка(Выб.Количество()) + ")");
		
	КонецЕсли;
	
	Если УдалятьПредыдущиеДокументы И ЗначениеЗаполнено(Робот) Тогда     
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Начало удаления предыдущих цен на дату меньшую: " + Формат(ДатаНачалаУдаления, "ДЛФ=DT"));  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Ответственный В (&Ответственный)
		|	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата < &Дата 
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка";  
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		
		СписокОтветственных = Новый СписокЗначений;
		пРобот = Справочники.Пользователи.НайтиПоКоду("robot");
		
		Если НЕ пРобот.Пустая() Тогда
			СписокОтветственных.Добавить(пРобот);
		КонецЕсли;
		
		пРобот_ОП = Справочники.Пользователи.НайтиПоКоду("robot_op");
		Если НЕ пРобот_ОП.Пустая() Тогда
			СписокОтветственных.Добавить(пРобот_ОП);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Ответственный", СписокОтветственных);
		
		Выборка = Запрос.Выполнить().Выбрать();
		УдаленоЦенНоменклатуры = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатуры = УдаленоЦенНоменклатуры + 1;
				
			Исключение
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометки на удаление документа: " + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатуры) + " документов установки цен");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов.ТипыЦен КАК УстановкаЦенНоменклатурыКонтрагентовТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Ответственный  В (&Ответственный)
		|	И УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка"; 
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", СписокОтветственных);
		
		Выборка = Запрос.Выполнить().Выбрать();
		УдаленоЦенНоменклатурыКонтрагентов = 0;
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			КоличествоТоваров = Об.Товары.Количество();
			
			Попытка
				
				Об.Удалить();
				УдаленоЦенНоменклатурыКонтрагентов = УдаленоЦенНоменклатурыКонтрагентов + 1;
				
			Исключение
				
				Попытка
					
					Об.УстановитьПометкуУдаления(Истина);
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
					МассивОшибок.Добавить("Установлена пометка удаления докумена установки цен с количеством товаров: " + Строка(КоличествоТоваров) + Символы.ПС + ОписаниеОшибки());
					
				Исключение
					
					ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка при установке пометке на удаление документа: " + Символы.ПС + ОписаниеОшибки());
					МассивОшибок.Добавить("Ошибка при установке пометки на удаление документа: " + Символы.ПС + ОписаниеОшибки());
					
				КонецПопытки;
				
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Удалено " + Строка(УдаленоЦенНоменклатурыКонтрагентов) + " документов установки цен контрагентов");
		ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Обработка", УровеньЖурналаРегистрации.Информация,,, "Окончание удаления предыдущих цен");
		
	КонецЕсли; 
	
	ЗаписатьЛогЗагрузкиЕдиныйПрайсЛистЧастично(Соединение, ДатаЗагрузки, ИмяФайлаЗагрузки, МассивДокументов, ТаблицаТоваровИЦен.Количество());
	ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок);        
	
Конецпроцедуры   

Процедура ЗаписатьЛогЗагрузкиЕдиныйПрайсЛистЧастично(Соединение, ДатаЗагрузки, ИмяФайлаЗагрузки, МассивДокументов, КоличествоСтрокВФайле = 0)
	
	Если Соединение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МассивПодстрок = Новый Массив;
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	ИмяВременногоФайлаЛога = ПолучитьИмяВременногоФайла("txt");
	ИмяКаталогаСервера = "logs/";
	ИмяБазы = НРег(СтроковыеФункцииКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы()).Ref);
	ИмяФайлаЛога = ИмяКаталогаСервера + ИмяБазы + ".txt";  
	
	Если Соединение.НайтиФайлы(ИмяФайлаЛога).Количество() = 0 Тогда  
		
		//Добавим заголовки колонок файла
		МассивПодстрок.Очистить();
		МассивПодстрок.Добавить("ДатаЗагрузки");
		МассивПодстрок.Добавить("ИмяФайлаЗагрузки");
		МассивПодстрок.Добавить("КоличествоСтрокВФайле");
		МассивПодстрок.Добавить("КоличествоСтрокВДокументе");
		МассивПодстрок.Добавить("НомерДокумента");
		МассивПодстрок.Добавить("НаличиеОшибок");
		ТекстовыйДокумент.ДобавитьСтроку(СтрСоединить(МассивПодстрок, Символы.Таб)); 
		
	Иначе                                                
		
		Соединение.Получить(ИмяФайлаЛога, ИмяВременногоФайлаЛога);
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайлаЛога);    
		
	КонецЕсли;
	
	Если МассивДокументов.Количество() = 0 Тогда      
		
		МассивПодстрок.Очистить();
		МассивПодстрок.Добавить(ДатаЗагрузки);
		МассивПодстрок.Добавить(ИмяФайлаЗагрузки);
		МассивПодстрок.Добавить(Строка(КоличествоСтрокВФайле));
		МассивПодстрок.Добавить(Строка(КоличествоСтрокВФайле));
		МассивПодстрок.Добавить("");
		МассивПодстрок.Добавить(Ложь);
		ТекстовыйДокумент.ДобавитьСтроку(СтрСоединить(МассивПодстрок, Символы.Таб)); 
		
	Иначе
		Для Каждого Док Из МассивДокументов Цикл   
			
			МассивПодстрок.Очистить();
			МассивПодстрок.Добавить(ДатаЗагрузки);
			МассивПодстрок.Добавить(ИмяФайлаЗагрузки);
			МассивПодстрок.Добавить(Строка(КоличествоСтрокВФайле));
			МассивПодстрок.Добавить(Строка(Док.Товары.Количество() / Док.ТипыЦен.Количество()));
			МассивПодстрок.Добавить(Док.Номер);
			МассивПодстрок.Добавить(Не Док.Проведен);
			ТекстовыйДокумент.ДобавитьСтроку(СтрСоединить(МассивПодстрок, Символы.Таб));   
			
		КонецЦикла;
	КонецЕсли;
	
	ТекстовыйДокумент.Записать(ИмяВременногоФайлаЛога);
	Соединение.Записать(ИмяВременногоФайлаЛога, ИмяФайлаЛога);
	
	УдалитьФайлы(ИмяВременногоФайлаЛога);
	
КонецПроцедуры

Процедура ОтправитьЭлПисьмоОбОшибкахСозданияДокументаЕдиныйПрайсЛист(ИмяРегЗадания, МассивОшибок) Экспорт
	
	ЭлПочтаДляУведомленийОЗагрузкеЦенНоменклатурыЕдиныйПрайсЛист = Константы.ЭлПочтаДляУведомленийОЗагрузкеЦенНоменклатурыЕдиныйПрайсЛист.Получить(); 
	
	Если Не ЗначениеЗаполнено(ЭлПочтаДляУведомленийОЗагрузкеЦенНоменклатурыЕдиныйПрайсЛист) Тогда
		Возврат;
	КонецЕсли;
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		
		ИмяБазы = НРег(СтроковыеФункцииКлиентСервер.ПолучитьПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы()).Ref);
		
		ТекстСообщения = "Возникли ошибки при выполнении регламентного задания '" + ИмяРегЗадания + "'" + Символы.ПС;
		
		Для Каждого ТекстОшибки Из МассивОшибок Цикл
			ТекстСообщения = ТекстСообщения + ТекстОшибки + Символы.ПС;
		КонецЦикла;
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить(); 		
		
		Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
			Возврат;
		КонецЕсли; 		
		
		Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
		Почта = Новый ИнтернетПочта; 
		
		Попытка
			Почта.Подключиться(Профиль);
		Исключение
			Возврат;
		КонецПопытки;
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = ИмяРегЗадания + " " + ИмяБазы;
		Сообщение.Получатели.Добавить(ЭлПочтаДляУведомленийОЗагрузкеЦенНоменклатурыЕдиныйПрайсЛист); 
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Сообщение.Тексты.Добавить(ТекстСообщения);
		Почта.Послать(Сообщение);			
		Почта.Отключиться();  
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция СтрСоединить(МассивПодстрок, Разделитель) Экспорт
	
	ТекстСтрока = "";    
	
	Для н = 0 По МассивПодстрок.Количество()-1 Цикл
		ТекстСтрока = ТекстСтрока + МассивПодстрок[н] + ?(н = МассивПодстрок.Количество() - 1, "", Разделитель);		
	КонецЦикла;
	
	Возврат ТекстСтрока;
	
КонецФункции

Функция СоздатьНовыйДокументЦен(МассивТиповЦен , Ответственный ,МаксимальнаяДатаДокумента)
	
	НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовыйДокумент.Дата = Мин(ТекущаяДата(),МаксимальнаяДатаДокумента);
	НовыйДокумент.Ответственный = Ответственный;
	НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;
	
	Для Каждого Зн Из МассивТиповЦен Цикл      
		
		НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
		НовСтр.ТипЦен = Зн;		                
		
	КонецЦикла;	
	
	Возврат НовыйДокумент;    
	
КонецФункции

Процедура СозданиеДокумента(Файл)   
	
	Если Не ЗначениеЗаполнено(Файл) Тогда 
		Возврат;
	КонецЕсли;
	
	УдалятьПредыдущиеДокументы = Истина;
	КоличествоСтрокВДокументе = 25000;
	Робот = Справочники.Пользователи.НайтиПоКоду("robot");
	
	// !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! Очистка "Московских остатков"
	НаборЗаписей = РегистрыСведений.МосковскиеОстаткиНоменклатуры.СоздатьНаборЗаписей(); 
	НаборЗаписей.Записать();
	
	Если УдалятьПредыдущиеДокументы И ЗначениеЗаполнено(Робот) Тогда
		
		Закупочная 	= Константы.ЗакупочнаяЦена.Получить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	НЕ УстановкаЦенНоменклатурыТипыЦен.ТипЦен = &ТипЦен
		|	И НАЧАЛОПЕРИОДА(УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата, ДЕНЬ) < &Дата
		|	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Ответственный = &Ответственный
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ТипЦен",  Закупочная);
		Запрос.УстановитьПараметр("Ответственный", Робот);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл   
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			
			Если Об.Проведен Тогда 
				Об.УстановитьПометкуУдаления(Истина);
			Иначе 
				Об.Удалить();
			КонецЕсли;        
			
		КонецЦикла;
		
	КонецЕсли;
	
	ТЗ_МосковскиеОстатки = Новый ТаблицаЗначений;	
	ТЗ_МосковскиеОстатки.Колонки.Добавить("Номенклатура");
	ТЗ_МосковскиеОстатки.Колонки.Добавить("Количество");
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("ТипЦен");
	ТЗ.Колонки.Добавить("Цена");
	ТЗ.Колонки.Добавить("Индекс");
	
	МассивТиповЦен = Новый Массив;
	
	Рупь = Константы.ВалютаРегламентированногоУчета.Получить();
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	
	МассивТиповЦен.Добавить(Скидка35);
	МассивТиповЦен.Добавить(Базовая);
	МассивТиповЦен.Добавить(Скидка36);
	МассивТиповЦен.Добавить(Скидка37);
	МассивТиповЦен.Добавить(Скидка38);
	
	// Создаю новый документ 
	НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.Ответственный = Робот;
	НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;
	
	// Табличная часть "ТипыЦен"
	НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
	НовСтр.ТипЦен = Базовая ;
	
	НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
	НовСтр.ТипЦен = Скидка35;
	
	НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
	НовСтр.ТипЦен = Скидка36;
	
	НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
	НовСтр.ТипЦен = Скидка37;
	
	НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
	НовСтр.ТипЦен = Скидка38;
	
	Текст = Новый ТекстовыйДокумент; 
	Текст.Прочитать(Файл); 
	
	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
		
		Попытка
			
			Стр = Текст.ПолучитьСтроку(НомерСтроки); 
			НомерСобаки = Найти(Стр, "@");
			
			Если НомерСобаки > 0 Тогда
				Стр = Сред(Стр, НомерСобаки + 1);
			Иначе 
				Продолжить;
			КонецЕсли;
			
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 0 Тогда 
				
				Артикул = Лев(Стр ,  НомерСобаки - 1);
				Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул).Ссылка; 
				
				Если Номенклатура  = Справочники.Номенклатура.ПустаяСсылка() Тогда 
					Продолжить;
				КонецЕсли;    
				
				Стр = Сред(Стр, НомерСобаки + 1);
				
			Иначе 
				Продолжить;
			КонецЕсли;
			
			Для  Х = 1  по 3  Цикл    
				
				НомерСобаки = Найти(Стр, "@");   
				
				Если НомерСобаки > 0 Тогда
					Стр = Сред(Стр, НомерСобаки + 1);
				Иначе 
					Продолжить;
				КонецЕсли;     
				
			КонецЦикла; 
			
			НомерСобаки = Найти(Стр, "@");
			КатегорияАВС = Лев(Стр ,  НомерСобаки - 1);  
			
			Если НЕ ПустаяСтрока(КатегорияАВС) и НЕ Константы.ЗапретитьОбновлениеГруппыABCНоменклатуры.Получить() Тогда		 
				МанипуляцииСКатегорией(КатегорияАВС,Артикул);
			КонецЕсли;                         
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			Для  Х = 1  по 5 Цикл     
				
				НомерСобаки = Найти(Стр, "@"); 
				
				Если НомерСобаки > 0 Тогда 
					Стр = Сред(Стр, НомерСобаки + 1);
				Иначе 
					Продолжить;
				КонецЕсли;  
				
			КонецЦикла;
			
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка35 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка35 = 0;
			КонецЕсли;           
			
			Стр = Сред(Стр, НомерСобаки + 1);
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 1 Тогда 
				ЦенаБазовая = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаБазовая =  0;
			КонецЕсли;     
			
			Стр = Сред(Стр, НомерСобаки + 1);
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			Для  Х = 1  по 2 Цикл          
				
				НомерСобаки = Найти(Стр, "@");  
				
				Если НомерСобаки > 0 Тогда 
					Стр = Сред(Стр, НомерСобаки + 1);
				Иначе 
					Продолжить;
				КонецЕсли;  
				
			КонецЦикла;
			
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка36 = Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка36  = 0 ;
			КонецЕсли;       
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка37 =  Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ЦенаСкидка37 = 0 ;
			КонецЕсли;          
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@"); 
			
			Если НомерСобаки > 1 Тогда 
				ЦенаСкидка38 =  Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);	 
			Иначе 
				ЦенаСкидка38   = 0;
			КонецЕсли;    
			
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@");
			Стр = Сред(Стр, НомерСобаки + 1);
			
			НомерСобаки = Найти(Стр, "@");  
			
			Если НомерСобаки > 1 Тогда 
				ОстатокВМоскве =  Окр(Число(Лев(Стр, НомерСобаки - 1)), 2, 1);
			Иначе 
				ОстатокВМоскве = 0;
			КонецЕсли;
			
			НоваяСтрокаМО = ТЗ_МосковскиеОстатки.Добавить();
			НоваяСтрокаМО.Номенклатура  = Номенклатура ;
			НоваяСтрокаМО.Количество  =  ОстатокВМоскве;
			
			НоваяСтрокаТЗ =  ТЗ.Добавить();
			НоваяСтрокаТЗ.Номенклатура  = Номенклатура;
			НоваяСтрокаТЗ.Цена  = ЦенаСкидка35;
			НоваяСтрокаТЗ.ТипЦен =   Скидка35;
			НоваяСтрокаТЗ.Индекс = НомерСтроки - 1;
			
			НоваяСтрокаТЗ =  ТЗ.Добавить();
			НоваяСтрокаТЗ.Номенклатура  = Номенклатура;
			НоваяСтрокаТЗ.Цена  = ЦенаБазовая;
			НоваяСтрокаТЗ.ТипЦен =   Базовая;
			НоваяСтрокаТЗ.Индекс = НомерСтроки - 1;
			
			НоваяСтрокаТЗ =  ТЗ.Добавить();
			НоваяСтрокаТЗ.Номенклатура  = Номенклатура;
			НоваяСтрокаТЗ.Цена  = ЦенаСкидка36;
			НоваяСтрокаТЗ.ТипЦен =   Скидка36;
			НоваяСтрокаТЗ.Индекс = НомерСтроки - 1;
			
			НоваяСтрокаТЗ =  ТЗ.Добавить();
			НоваяСтрокаТЗ.Номенклатура  = Номенклатура;
			НоваяСтрокаТЗ.Цена  = ЦенаСкидка37;
			НоваяСтрокаТЗ.ТипЦен =   Скидка37;
			НоваяСтрокаТЗ.Индекс = НомерСтроки - 1;
			
			НоваяСтрокаТЗ =  ТЗ.Добавить();
			НоваяСтрокаТЗ.Номенклатура  = Номенклатура;
			НоваяСтрокаТЗ.Цена  = ЦенаСкидка38;
			НоваяСтрокаТЗ.ТипЦен =   Скидка38;
			НоваяСтрокаТЗ.Индекс = НомерСтроки - 1;
			
		Исключение
		КонецПопытки;    
		
	КонецЦикла;
	
	СчетчикСтрокВДокументе = 0;
	
	Для каждого ТекСтр Из ТЗ Цикл  
		
		НоваяСтрокаДокумента =  НовыйДокумент.Товары.Добавить();
		НоваяСтрокаДокумента.Номенклатура = ТекСтр.Номенклатура  ;
		НоваяСтрокаДокумента.ЕдиницаИзмерения  = НоваяСтрокаДокумента.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрокаДокумента.Цена = ТекСтр.Цена;
		НоваяСтрокаДокумента.ТипЦен = ТекСтр.ТипЦен ;
		НоваяСтрокаДокумента.СпособРасчетаЦены = ТекСтр.ТипЦен.СпособРасчетаЦены;
		НоваяСтрокаДокумента.Валюта = ТекСтр.ТипЦен.ВалютаЦены;
		НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = ТекСтр.Индекс;    
		
		СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;  
		
		Если СчетчикСтрокВДокументе = КоличествоСтрокВДокументе Тогда
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				НовыйДокумент.Записать();
			КонецПопытки;
			
			НовыйДокумент = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Ответственный = Робот;
			НовыйДокумент.НеПроводитьНулевыеЗначения = Истина;
			
			НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
			НовСтр.ТипЦен = Базовая;
			
			НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
			НовСтр.ТипЦен = Скидка35;
			
			НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
			НовСтр.ТипЦен = Скидка36;
			
			НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
			НовСтр.ТипЦен = Скидка37;
			
			НовСтр =  НовыйДокумент.ТипыЦен.Добавить();
			НовСтр.ТипЦен = Скидка38;
			
			СчетчикСтрокВДокументе = 0;   
			
		КонецЕсли;    
		
	КонецЦикла; 
	
	Если НовыйДокумент.Товары.Количество()> 0 Тогда  
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			НовыйДокумент.Записать();
		КонецПопытки;     
		
	КонецЕсли;
	
	// Заполню московские остатки
	Для каждого ТекСтр Из ТЗ_МосковскиеОстатки Цикл   
		
		Если ТекСтр.Количество > 0 Тогда
			
			НаборЗаписей = РегистрыСведений.МосковскиеОстаткиНоменклатуры.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Номенклатура.Установить(ТекСтр.Номенклатура); 
			
			НоваяЗапись = НаборЗаписей.Добавить(); 
			НоваяЗапись. Номенклатура = ТекСтр.Номенклатура; 
			НоваяЗапись.Количество = ТекСтр.Количество; 
			
			НаборЗаписей.Записать();
			
		КонецЕсли;   
		
	КонецЦикла; 
	
КонецПроцедуры

// ежедневные регламентные процедуры
Процедура ЕжедневныйРегламент() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда  
		
		ЗаписьЖурналаРегистрации("Ежедневный регламент", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;         
		
	КонецЕсли;
	
	УстановитьНовуюДатуЗапретаИзмененияДанных();
	
КонецПроцедуры

Процедура УстановитьНовуюДатуЗапретаИзмененияДанных()
	
	ДатаЗапрета = НачалоДня(ТекущаяДата() - 86400);
	
	УстановитьОбщуюГраницуЗапретаИзменений(ДатаЗапрета);
	УстановитьГраницуЗапретаПоОрганизациям(ДатаЗапрета);
	
	ДеньМесяцаДляЗакрытияПериода = Константы.ДеньМесяцаДляЗакрытияПериода.Получить();
	
	ИзменитьГраницуЗапретаИзмененияПоПользователям(ДеньМесяцаДляЗакрытияПериода);    
	ИзменитьГраницуЗапретаИзмененияПоПользователямИРазделамУчета(ДатаЗапрета, ДеньМесяцаДляЗакрытияПериода); 
	УстановитьГраницуЗапретаПоРазделамУчета(ДатаЗапрета);
	
	УдалитьПользователей();
	
КонецПроцедуры

Процедура УдалитьПользователей() 
	
	МенеджерРегистра = РегистрыСведений.ГраницыЗапретаИзмененияДанных; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ГраницыЗапретаИзмененияДанных.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	Пользователи.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Пользователи.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Набор = МенеджерРегистра.СоздатьНаборЗаписей();		
		Набор.Отбор.Пользователь.Установить(РезультатЗапроса.Ссылка);
		Набор.Записать();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Пользователи.Ссылка,
	|	ГраницыЗапретаИзмененияДанных.РазделУчета,
	|	ГраницыЗапретаИзмененияДанных.Организация
	|ИЗ
	|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ГраницыЗапретаИзмененияДанных.Пользователь = Пользователи.Ссылка,
	|	Константы КАК Константы
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Константы.ДеньМесяцаДляЗакрытияПериода = 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ Пользователи.РазрешенноеЧислоДнейДляРедактированияДанных = 0
	|		КОНЕЦ
	|	И ГраницыЗапретаИзмененияДанных.РазделУчета = ЗНАЧЕНИЕ(Справочник.РазделыУчета.ПустаяСсылка)"; 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		Набор = МенеджерРегистра.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Выборка.Ссылка);
		Набор.Отбор.РазделУчета.Установить(Выборка.РазделУчета);
		Набор.Отбор.Организация.Установить(Выборка.Организация);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьГраницуЗапретаИзмененияПоПользователям(ДеньМесяцаДляЗакрытияПериода) 
	
	МенеджерРегистра = РегистрыСведений.ГраницыЗапретаИзмененияДанных;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГраницыЗапретаИзмененияДанных.Организация
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
	|
	|СГРУППИРОВАТЬ ПО
	|	ГраницыЗапретаИзмененияДанных.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Ссылка,
	|	Пользователи.РазрешенноеЧислоДнейДляРедактированияДанных,
	|	ВТ.Организация
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи, ВТ
	|		
	|		
	|ГДЕ
	|	НЕ Пользователи.ПометкаУдаления
	|	И Пользователи.РазрешенноеЧислоДнейДляРедактированияДанных > 1";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДатаЗапрета = ОпределитьДатуЗапретаПоПользователю(РезультатЗапроса.РазрешенноеЧислоДнейДляРедактированияДанных, ДеньМесяцаДляЗакрытияПериода); 
		
		Набор = МенеджерРегистра.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.Установить(РезультатЗапроса.Организация);
		Набор.Отбор.Пользователь.Установить(РезультатЗапроса.Ссылка); 
		Набор.Отбор.РазделУчета.Установить(Справочники.РазделыУчета.ПустаяСсылка());
		
		Запись = Набор.Добавить();
		Запись.Организация = РезультатЗапроса.Организация;
		Запись.Пользователь = РезультатЗапроса.Ссылка;
		Запись.ГраницаЗапретаИзменений = ДатаЗапрета;
		Набор.Записать();
		
	КонецЦикла; 
	
КонецПроцедуры  

Функция ОпределитьДатуЗапретаПоПользователю(РазрешенноеЧислоДнейДляРедактированияДанных, ДеньМесяцаДляЗакрытияПериода)  
	
	Если ЗначениеЗаполнено(ДеньМесяцаДляЗакрытияПериода) Тогда   
		
		ТекущийДень = День(ТекущаяДата());
		
		Если ТекущийДень <= ДеньМесяцаДляЗакрытияПериода Тогда
			ДатаЗапрета = НачалоДня(ТекущаяДата() - РазрешенноеЧислоДнейДляРедактированияДанных * 86400);
		Иначе
			
			МинРазрешенноеЧислоДнейДляРедактированияДанных = Мин(РазрешенноеЧислоДнейДляРедактированияДанных, ТекущийДень);  
			ДатаЗапрета = НачалоДня(ТекущаяДата() - МинРазрешенноеЧислоДнейДляРедактированияДанных * 86400);
			
		КонецЕсли; 
		
		ДатаЗапрета = Макс(ДатаЗапрета, НачалоМесяца(НачалоМесяца(ТекущаяДата()) - 1));
		
	Иначе 		
		ДатаЗапрета = НачалоДня(ТекущаяДата() - РазрешенноеЧислоДнейДляРедактированияДанных * 86400);
	КонецЕсли;  
	
	Возврат ДатаЗапрета;
	
КонецФункции

Процедура ИзменитьГраницуЗапретаИзмененияПоПользователямИРазделамУчета(ДатаЗапрета, ДеньМесяцаДляЗакрытияПериода) 

	МенеджерРегистра = РегистрыСведений.ГраницыЗапретаИзмененияДанных;

	Если ЗначениеЗаполнено(ДеньМесяцаДляЗакрытияПериода) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапретаИзмененияДанных.Пользователь,
		|	ГраницыЗапретаИзмененияДанных.ВидДокумента,
		|	ГраницыЗапретаИзмененияДанных.РазделУчета,
		|	ГраницыЗапретаИзмененияДанных.Пользователь.РазрешенноеЧислоДнейДляРедактированияДанных КАК РазрешенноеЧислоДнейДляРедактированияДанных
		|ИЗ
		|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	НЕ ГраницыЗапретаИзмененияДанных.РазделУчета = ЗНАЧЕНИЕ(Справочник.РазделыУчета.ПустаяСсылка)
		|	И НЕ ГраницыЗапретаИзмененияДанных.ВидДокумента = """"
		|	И НЕ ГраницыЗапретаИзмененияДанных.Пользователь = НЕОПРЕДЕЛЕНО
		|	И ГраницыЗапретаИзмененияДанных.Пользователь ССЫЛКА Справочник.Пользователи";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл     

			Набор = МенеджерРегистра.СоздатьНаборЗаписей(); 
			Набор.Отбор.РазделУчета.Установить(Выборка.РазделУчета);
			Набор.Отбор.Пользователь.Установить(Выборка.Пользователь);
			Набор.Отбор.ВидДокумента.Установить(Выборка.ВидДокумента);
			
			Запись = Набор.Добавить();
			Запись.Организация = Справочники.Организации.ПустаяСсылка();
			Запись.Пользователь = Выборка.Пользователь; 
			Запись.РазделУчета = Выборка.РазделУчета;
			Запись.ВидДокумента = Выборка.ВидДокумента;
			Запись.ГраницаЗапретаИзменений = ?(ЗначениеЗаполнено(Выборка.РазрешенноеЧислоДнейДляРедактированияДанных), 
			               НачалоДня(ТекущаяДата() - Выборка.РазрешенноеЧислоДнейДляРедактированияДанных * 86400), ДатаЗапрета);  
			
			Набор.Записать();
			
		КонецЦикла;
	
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницыЗапретаИзмененияДанных.РазделУчета,
		|	ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений
		|ПОМЕСТИТЬ ВТ_РазделыДаты
		|ИЗ
		|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	НЕ ГраницыЗапретаИзмененияДанных.РазделУчета = ЗНАЧЕНИЕ(Справочник.РазделыУчета.ПустаяСсылка)
		|	И ГраницыЗапретаИзмененияДанных.Пользователь = НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РазделыДаты.РазделУчета,
		|	ГраницыЗапретаИзмененияДанных.ВидДокумента,
		|	ВТ_РазделыДаты.ГраницаЗапретаИзменений,
		|	ГраницыЗапретаИзмененияДанных.Пользователь,
		|	ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений КАК ГраницаЗапретаИзмененийПользователя
		|ИЗ
		|	ВТ_РазделыДаты КАК ВТ_РазделыДаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
		|		ПО ВТ_РазделыДаты.РазделУчета = ГраницыЗапретаИзмененияДанных.РазделУчета
		|			И (НЕ ГраницыЗапретаИзмененияДанных.Пользователь = НЕОПРЕДЕЛЕНО)
		|			И (НЕ ГраницыЗапретаИзмененияДанных.ВидДокумента = """")"; 
		
		Выборка = Запрос.Выполнить().Выбрать();    
		
		Пока Выборка.Следующий() Цикл         
			
			Если Выборка.ГраницаЗапретаИзмененийПользователя = Выборка.ГраницаЗапретаИзменений Тогда
				ТекДатаЗапрета = ДатаЗапрета;
			Иначе     
				ТекДатаЗапрета = Выборка.ГраницаЗапретаИзмененийПользователя;
			КонецЕсли;
			
			Набор = МенеджерРегистра.СоздатьНаборЗаписей();
			
			Набор.Отбор.РазделУчета.Установить(Выборка.РазделУчета);
			Набор.Отбор.Пользователь.Установить(Выборка.Пользователь);
			Набор.Отбор.ВидДокумента.Установить(Выборка.ВидДокумента);
			
			Запись = Набор.Добавить();
			Запись.Организация = Справочники.Организации.ПустаяСсылка();
			Запись.Пользователь = Выборка.Пользователь; 
			Запись.РазделУчета = Выборка.РазделУчета;
			Запись.ВидДокумента = Выборка.ВидДокумента;
			Запись.ГраницаЗапретаИзменений = ТекДатаЗапрета;  
			
			Набор.Записать();	
			
		КонецЦикла;  
	
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьОбщуюГраницуЗапретаИзменений(ДатаЗапрета)
	
	ПустаяОрганизация = Справочники.Организации.ПустаяСсылка();
	
	Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
	
	УстановитьГраницуЗапретаИзменений(Набор, ПустаяОрганизация, ДатаЗапрета);
	
	Набор.Записать();
	
КонецПроцедуры

Процедура УстановитьГраницуЗапретаПоОрганизациям(ДатаЗапрета)
	
	ВыборкаОрганизаций = Справочники.Организации.Выбрать();  
	
	Пока ВыборкаОрганизаций.Следующий() Цикл    
		
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		
		УстановитьГраницуЗапретаИзменений(Набор, ВыборкаОрганизаций.Ссылка, ДатаЗапрета);
		
		Набор.Записать(); 
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура УстановитьГраницуЗапретаПоРазделамУчета(ДатаЗапрета)

	ВыборкаРазделов = Справочники.РазделыУчета.Выбрать();
	
	Пока ВыборкаРазделов.Следующий() Цикл
		
		Если ВыборкаРазделов.Ссылка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();  
		
		Набор.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
		Набор.Отбор.Пользователь.Установить(Неопределено);    
		Набор.Отбор.РазделУчета.Установить(ВыборкаРазделов.Ссылка);  
		Набор.Отбор.ВидДокумента.Установить("");
		
		Запись = Набор.Добавить();
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Запись.Пользователь = Неопределено; 
		Запись.РазделУчета = ВыборкаРазделов.Ссылка;
		Запись.ВидДокумента = "";
		Запись.ГраницаЗапретаИзменений = ДатаЗапрета;	
		
		Набор.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьГраницуЗапретаИзменений(Набор, Организация, ДатаЗапрета)
	
	Набор.Отбор.Организация.Установить(Организация);
	Набор.Отбор.Пользователь.Установить(Неопределено);    
	Набор.Отбор.РазделУчета.Установить(Справочники.РазделыУчета.ПустаяСсылка());  
	
	Запись = Набор.Добавить();
	Запись.Организация = Организация;
	Запись.Пользователь = Неопределено;
	Запись.ГраницаЗапретаИзменений = ДатаЗапрета;
	
КонецПроцедуры

Процедура ПолноеОбновлениеОстатковИЦен_Казань() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда     
		
		ЗаписьЖурналаРегистрации("Обновление остатков и цен полное Казань", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;       
		
	КонецЕсли;
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда  
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;        
		
	КонецЕсли;
	
	ВремяНач = ТекущаяДата();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель) КАК Производитель,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Наименование),
	|	Номенклатура.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.КратностьФилиала = 0
	|				И НЕ Номенклатура.КратностьФилиала = Номенклатура.Кратность
	|			ТОГДА Номенклатура.КратностьФилиала
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Кратность = 0
	|					ТОГДА 1
	|				ИНАЧЕ Номенклатура.Кратность
	|			КОНЕЦ
	|	КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ПоТоварамНаСкладах,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отличается
	|ПОМЕСТИТЬ ТоварыОстатокСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК ПоТоварамНаСкладах,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отличается
	|ПОМЕСТИТЬ ТоварыОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Производитель,
	|	Товары.Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена,
	|	ЕСТЬNULL(ТоварыОстаток.Остаток, 0) КАК СвободныйОстаток_1,
	|	ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0) КАК СвободныйОстаток_2,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0) <= ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстатокСклад КАК ТоварыОстатокСклад
	|		ПО Товары.Номенклатура = ТоварыОстатокСклад.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|ГДЕ
	|	НЕ(ТоварыОстаток.Остаток ЕСТЬ NULL
	|				И БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыZСНулевымОстатком
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.Номенклатура.ГруппаАВС.Наименование ПОДОБНО ""Z%""
	|	И Итог.СвободныйОстаток_1 = 0
	|	И Итог.СвободныйОстаток_2 = 0
	|	И Итог.СвободныйОстаток = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Номенклатура,
	|	Итог.Производитель,
	|	Итог.Артикул КАК Артикул,
	|	Итог.КодПроизводителя,
	|	Итог.НаименованиеПредставление,
	|	Итог.ЕдИзм,
	|	Итог.Кратность,
	|	Итог.БазоваяценаМоскворечье,
	|	Итог.Скидка35,
	|	Итог.Скидка36,
	|	Итог.Скидка37,
	|	Итог.Скидка38,
	|	Итог.СпецЦена,
	|	Итог.СвободныйОстаток_1,
	|	Итог.СвободныйОстаток_2,
	|	Итог.СвободныйОстаток
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	НЕ Итог.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыZСНулевымОстатком.Номенклатура
	|				ИЗ
	|					ТоварыZСНулевымОстатком КАК ТоварыZСНулевымОстатком)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье", Базовая);  
	Запрос.УстановитьПараметр("Скидка35", 				Скидка35);  
	Запрос.УстановитьПараметр("Скидка36", 				Скидка36);  
	Запрос.УстановитьПараметр("Скидка37", 				Скидка37); 
	Запрос.УстановитьПараметр("Скидка38", 				Скидка38);   
	Запрос.УстановитьПараметр("СпецЦена", 				СпецЦена);   
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());      
	Запрос.УстановитьПараметр("ОрганизацияМК",		Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",		Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда   
		
		Выборка = Результат.Выбрать();   
		
		Пока Выборка.Следующий() Цикл 
			
			Подстрока = 
			Выборка.Производитель + Символы.Таб
			 + Выборка.Артикул + Символы.Таб
			 + Выборка.КодПроизводителя + Символы.Таб
			 + Выборка.Номенклатура + Символы.Таб
			 + Выборка.ЕдИзм + Символы.Таб
			 + Строка(Выборка.Кратность) + Символы.Таб
			 + Строка(СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.БазоваяценаМоскворечье,Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.Скидка35, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка36, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка37, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.Скидка38, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.СпецЦена, Символы.НПП, ""));			
			
			Текст.ДобавитьСтроку(Подстрока);
			
		КонецЦикла;  
		
	КонецЕсли;
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога); 
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Текст.Записать(ВременныйКаталог + ВремИмя,КодировкаТекста.ANSI);
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
		             Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка, , ,
		"Не удалось установить соединение с FTP. Запись данных на FTP  не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "*.lock");
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл   
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") 
		 Или ВРег(ТекСтр.Имя) = ВРег("connect.lock") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;  
		
	КонецЦикла;	    
	
	Если Отказ Тогда 
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;    
		
	КонецЕсли; 	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмяФайлаБлокировки = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
		"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение 
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
			              Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
						  
			Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, 
			?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock"); 
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Ошибка записи файла connect.lock записан в каталог: " + ЗаданаПапкаДляFTP + Символы.ПС + ОписаниеОшибки());	
			Возврат;
			
		КонецПопытки;
		
	КонецПопытки;
	
	ФайлЗаписанНаСервере = Истина;   
	
	Попытка
		
		Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,,
		"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
			             Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка,,, 
			"Блокировки НЕ БЫЛО. Но запись данных под временным имененм на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" 
			+ Символы.ПС + ОписаниеОшибки());   
			
			ФайлЗаписанНаСервере = Ложь;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Если ФайлЗаписанНаСервере Тогда
		
		Попытка
			
			Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя,
			?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");		  
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение     		
			
			Попытка
				
				Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
				             Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
				Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя,
				?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");
				
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
				"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
				
			Исключение
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка,,, 
				"Блокировки НЕ БЫЛО. Но запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЕсли; 
	
	// Удалить файлик
	Попытка
		
		Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
			             Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");    
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка при удалении файла connect.lock" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки;          
	
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	УдалитьФайлы(ВременныйКаталог);
	
КонецПроцедуры

Процедура ПолноеОбновлениеОстатковИЦен_КазаньЕдиныйПрайсЛист() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда  
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань единый прайс-лист", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли; 
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда        
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань  единый прайс-лист.Ошибка", 
		УровеньЖурналаРегистрации.Ошибка,,, "Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;     
		
	КонецЕсли;
	
	ВремяНач = ТекущаяДата();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ТоварыИДокументы
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул = """"
	|	И ЦеныНоменклатурыСрезПоследних.ТипЦен В(&СписокТиповЦен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИДокументы.Номенклатура,
	|	ТоварыИДокументы.Номенклатура.Артикул КАК Артикул
	|ПОМЕСТИТЬ ТоварыСЦенамиФилиала
	|ИЗ
	|	ТоварыИДокументы КАК ТоварыИДокументы
	|ГДЕ
	|	НЕ ТоварыИДокументы.Регистратор.Ответственный = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель) КАК Производитель,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Наименование),
	|	Номенклатура.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.КратностьФилиала = 0
	|				И НЕ Номенклатура.КратностьФилиала = Номенклатура.Кратность
	|			ТОГДА Номенклатура.КратностьФилиала
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Кратность = 0
	|					ТОГДА 1
	|				ИНАЧЕ Номенклатура.Кратность
	|			КОНЕЦ
	|	КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица8.Номенклатура,
	|	Таблица8.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Акция
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Акция
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица8
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица8.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица8.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица8.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица8.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица10.Номенклатура,
	|	Таблица10.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ АвтоЕвропа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &АвтоЕвропа
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица10
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица10.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица10.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица10.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица10.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ПоТоварамНаСкладах,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отличается
	|ПОМЕСТИТЬ ТоварыОстатокСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК ПоТоварамНаСкладах,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК Остаток,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Отличается
	|ПОМЕСТИТЬ ТоварыОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Производитель,
	|	Товары.Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена,
	|	ЕСТЬNULL(Акция.Цена, 0) КАК Акция,
	|	ЕСТЬNULL(АвтоЕвропа.Цена, 0) КАК АвтоЕвропа,
	|	ЕСТЬNULL(ТоварыОстаток.Остаток, 0) КАК СвободныйОстаток_1,
	|	ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0) КАК СвободныйОстаток_2,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0) <= ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыОстатокСклад.Остаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстатокСклад КАК ТоварыОстатокСклад
	|		ПО Товары.Номенклатура = ТоварыОстатокСклад.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акция КАК Акция
	|		ПО Товары.Номенклатура = Акция.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвтоЕвропа КАК АвтоЕвропа
	|		ПО Товары.Номенклатура = АвтоЕвропа.Номенклатура
	|ГДЕ
	|	НЕ(ТоварыОстаток.Остаток ЕСТЬ NULL
	|				И БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL
	|				И Акция.Цена ЕСТЬ NULL
	|				И АвтоЕвропа.Цена ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыZСНулевымОстатком
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.Номенклатура.ГруппаАВС.Наименование ПОДОБНО ""Z%""
	|	И Итог.СвободныйОстаток_1 = 0
	|	И Итог.СвободныйОстаток_2 = 0
	|	И Итог.СвободныйОстаток = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Номенклатура,
	|	Итог.Производитель,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(Итог.Номенклатура.КодМДМ КАК СТРОКА(36))) = """"
	|			ТОГДА Итог.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Артикул,
	|	Итог.КодПроизводителя,
	|	Итог.НаименованиеПредставление,
	|	Итог.ЕдИзм,
	|	Итог.Кратность,
	|	Итог.БазоваяценаМоскворечье,
	|	Итог.Скидка35,
	|	Итог.Скидка36,
	|	Итог.Скидка37,
	|	Итог.Скидка38,
	|	Итог.СпецЦена,
	|	Итог.Акция,
	|	Итог.АвтоЕвропа,
	|	Итог.СвободныйОстаток_1,
	|	Итог.СвободныйОстаток_2,
	|	Итог.СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(ТоварыСЦенамиФилиала.Артикул КАК СТРОКА(25))) = """"
	|			ТОГДА Итог.Номенклатура.КодМДМ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодМДМ
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенамиФилиала КАК ТоварыСЦенамиФилиала
	|		ПО Итог.Номенклатура = ТоварыСЦенамиФилиала.Номенклатура
	|ГДЕ
	|	НЕ Итог.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыZСНулевымОстатком.Номенклатура
	|				ИЗ
	|					ТоварыZСНулевымОстатком КАК ТоварыZСНулевымОстатком)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();
	Акция           = Константы.Акция.Получить();	
	АвтоЕвропа      = Константы.АвтоЕвропа.Получить();
	
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье",Базовая);  
	Запрос.УстановитьПараметр("Скидка35", 				Скидка35);  
	Запрос.УстановитьПараметр("Скидка36", 				Скидка36);  
	Запрос.УстановитьПараметр("Скидка37", 				Скидка37); 
	Запрос.УстановитьПараметр("Скидка38", 				Скидка38);   
	Запрос.УстановитьПараметр("СпецЦена", 				СпецЦена);   
	Запрос.УстановитьПараметр("Акция", 				    Акция);
	Запрос.УстановитьПараметр("АвтоЕвропа", 			АвтоЕвропа);
	
	СписокТиповЦен = Новый СписокЗначений;	
	СписокТиповЦен.Добавить(Базовая);
	СписокТиповЦен.Добавить(Скидка35);
	СписокТиповЦен.Добавить(Скидка36);
	СписокТиповЦен.Добавить(Скидка37);
	СписокТиповЦен.Добавить(Скидка38);
	СписокТиповЦен.Добавить(СпецЦена);
	СписокТиповЦен.Добавить(Акция);
	СписокТиповЦен.Добавить(АвтоЕвропа);
	
	Запрос.УстановитьПараметр("СписокТиповЦен", 	СписокТиповЦен);
	Запрос.УстановитьПараметр("Ответственный",      Справочники.Пользователи.НайтиПоКоду("robot"));
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();  
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());      
	Запрос.УстановитьПараметр("ОрганизацияМК",		Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",		Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда  
		
		Выборка = Результат.Выбрать();
		
		МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
		МаксимальноеКоличествоИтераций = 20000;
		ДанныеПоОстаткамСтрока = "";
		
		Инд = 0;         
		
		Пока Выборка.Следующий() Цикл	
			
			Если Инд = МаксимальноеКоличествоИтераций Тогда   
				
				МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
				Инд = 0;  
				ДанныеПоОстаткамСтрока = "";    
				
			КонецЕсли; 
			
			ВременнаяСтрока =  
			Выборка.Производитель + Символы.Таб
			 + Выборка.Артикул + Символы.Таб
			 + Выборка.КодПроизводителя + Символы.Таб
			 + Выборка.Номенклатура + Символы.Таб
			 + Выборка.ЕдИзм + Символы.Таб
			 + Строка(Выборка.Кратность) + Символы.Таб
			 + Строка(СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток),  Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.БазоваяценаМоскворечье, Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.Скидка35, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка36, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка37, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.Скидка38, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.СпецЦена, Символы.НПП, "")) + Символы.Таб					
			 + СокрЛП(Выборка.КодМДМ) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Акция, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.АвтоЕвропа, Символы.НПП, ""));
			
			ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
			
			Инд = Инд + 1;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
		КонецЕсли;
		
		ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
		
		Сч = 0;
		
		Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл 
			
			ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
			Сч = Сч + 1;          
			
		КонецЦикла;
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
		
		Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
		
	КонецЕсли;
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога); 
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Текст.Записать(ВременныйКаталог + ВремИмя,КодировкаТекста.ANSI);
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань единый прайс-лист", УровеньЖурналаРегистрации.Ошибка, , ,
		"Не удалось установить соединение с FTP. Запись данных на FTP  не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "*.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл      
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") 
			Или ВРег(ТекСтр.Имя) = ВРег("connect.lock") Тогда 
			
			Отказ = Истина;
			Прервать; 
			
		КонецЕсли;  
		
	КонецЦикла;	  
	
	Если Отказ Тогда  
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;  
		
	КонецЕсли; 	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмяФайлаБлокировки = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
		"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение 
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
			Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);		
			Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP),
			ЗаданаПапкаДляFTP + "\", "") + "connect.lock");                 
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Ошибка записи файла connect.lock записан в каталог: " + ЗаданаПапкаДляFTP + Символы.ПС + ОписаниеОшибки());	
			Возврат;
			
		КонецПопытки;
		
	КонецПопытки;
	
	ФайлЗаписанНаСервере = Истина; 
	
	Попытка
		
		Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,,
		"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), 
			Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);		  
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка,,, 
			"Блокировки НЕ БЫЛО. Но запись данных под временным имененм на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
			ФайлЗаписанНаСервере = Ложь;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Если ФайлЗаписанНаСервере Тогда
		
		Попытка
			
			Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "")  
			+ ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");		
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение     		
			
			Попытка
				
				Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  
				Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
				Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя,
				?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");		
				
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация,,, 
				"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
				
			Исключение
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка,,, 
				"Блокировки НЕ БЫЛО. Но запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецПопытки;
		
	КонецЕсли; // ФайлЗаписанНаСервере
	
	// Удалить файлик
	Попытка
		
		Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен Казань", УровеньЖурналаРегистрации.Ошибка, , ,
			"Ошибка при удалении файла connect.lock" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки;  
	
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	УдалитьФайлы(ВременныйКаталог);
	
КонецПроцедуры

Процедура ПолноеОбновлениеОстатковИЦен() Экспорт
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;
		
	КонецЕсли;
	
	ВыполнятьВыгрузку = Истина;
	ОшибкаПрошлойВыгрузки = Ложь;
	УдалитьЗаписи = Ложь;   
	
	Набор = РегистрыСведений.ЖурналОбновленияОстатковЦен.СоздатьНаборЗаписей();
	Набор.Отбор.Задание.Установить("ПолноеОбновлениеОстатковЦен");
	Набор.Прочитать();    
	
	Если Набор.Количество() > 0 Тогда   
		
		ДатаВыполнения = Набор[0].ДатаВыполнения;
		ОшибкаПрошлойВыгрузки = Набор[0].Ошибка;
		УдалитьЗаписи = Истина;                 
		
		Если ЗначениеЗаполнено(ДатаВыполнения) Тогда  
			
			Если (Не ОшибкаПрошлойВыгрузки) И ((ТекущаяДата() - Набор[0].ДатаВыполнения) < 21600) Тогда
				
				ВыполнятьВыгрузку = Ложь;
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Завершение", УровеньЖурналаРегистрации.Информация,,, 
				"Отмена запуска регламентного задания: прошло меньше 6 часов с момента прошлого запуска (РС ""Журнал обновления остатков и цен"").");
				
			КонецЕсли;  
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Не ВыполнятьВыгрузку Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНач = ТекущаяДата();
	
	Запрос = Новый Запрос; 	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель) КАК Производитель,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Наименование),
	|	Номенклатура.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.КратностьФилиала = 0
	|				И НЕ Номенклатура.КратностьФилиала = Номенклатура.Кратность
	|			ТОГДА Номенклатура.КратностьФилиала
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Кратность = 0
	|					ТОГДА 1
	|				ИНАЧЕ Номенклатура.Кратность
	|			КОНЕЦ
	|	КОНЕЦ КАК Кратность,
	|	ВЫБОР
	|		КОГДА Константы.ИспользоватьГруппуНоменклатурыУценка
	|				И Константы.ГруппаНоменклатурыУценка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Номенклатура.Родитель = Константы.ГруппаНоменклатурыУценка
	|						ТОГДА ВЫБОР
	|								КОГДА Номенклатура.ПредыдущийРодитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|									ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|								ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.ПредыдущийРодитель)
	|							КОНЕЦ
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|	КОНЕЦ КАК ЗаменяемыйРодитель,
	|	Номенклатура.КодМДМ
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Константы КАК Константы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица8.Номенклатура,
	|	Таблица8.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ АДУрал
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &АДУрал
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица8
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица8.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица8.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица8.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица8.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОстаток.Остаток, 0) - ЕСТЬNULL(ТоварыРезерв.КоличествоОстаток, 0) КАК СвободныйОстатокСклад
	|ПОМЕСТИТЬ ТоварыСвободныйОстаток
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыРезерв
	|		ПО Товары.Номенклатура = ТоварыРезерв.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Остаток,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0) <= ЕСТЬNULL(ТоварыСвободныйОстаток.СвободныйОстатокСклад, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыСвободныйОстаток.СвободныйОстатокСклад, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	Товары.Производитель,
	|	Товары.Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена,
	|	ЕСТЬNULL(АДУрал.Цена, 0) КАК АДУрал,
	|	Товары.ЗаменяемыйРодитель,
	|	Товары.КодМДМ,
	|	Товары.Номенклатура.ГруппаАВС
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСвободныйОстаток КАК ТоварыСвободныйОстаток
	|		ПО Товары.Номенклатура = ТоварыСвободныйОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АДУрал КАК АДУрал
	|		ПО Товары.Номенклатура = АДУрал.Номенклатура
	|ГДЕ
	|	НЕ(ТоварыОстаток.Остаток ЕСТЬ NULL
	|				И БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL
	|				И АДУрал.Цена ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыZСНулевымОстатком
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.НоменклатураГруппаАВС.Наименование ПОДОБНО ""Z%""
	|	И Итог.СвободныйОстаток = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Номенклатура КАК Номенклатура,
	|	Итог.СвободныйОстаток,
	|	Итог.Производитель,
	|	Итог.Артикул КАК Артикул,
	|	Итог.КодПроизводителя,
	|	Итог.НаименованиеПредставление,
	|	Итог.ЕдИзм,
	|	Итог.Кратность,
	|	Итог.БазоваяценаМоскворечье,
	|	Итог.Скидка35,
	|	Итог.Скидка36,
	|	Итог.Скидка37,
	|	Итог.Скидка38,
	|	Итог.СпецЦена,
	|	Итог.АДУрал,
	|	Итог.ЗаменяемыйРодитель,
	|	Итог.КодМДМ,
	|	Итог.НоменклатураГруппаАВС
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	НЕ Итог.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыZСНулевымОстатком.Номенклатура
	|				ИЗ
	|					ТоварыZСНулевымОстатком КАК ТоварыZСНулевымОстатком)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул
	|АВТОУПОРЯДОЧИВАНИЕ";  
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();                       
	АДУрал          = Константы.АДУрал.Получить();
	
	ЗаменятьРодителяДляГруппыУценка = 
	Константы.ИспользоватьГруппуНоменклатурыУценка.Получить()
	и ЗначениеЗаполнено(Константы.ГруппаНоменклатурыУценка.Получить());
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье", Базовая);  // Базовая цена Москворечье
	Запрос.УстановитьПараметр("Скидка35", 				Скидка35);  // Скидка 35%
	Запрос.УстановитьПараметр("Скидка36", 				Скидка36);  // Скидка 36%
	Запрос.УстановитьПараметр("Скидка37", 				Скидка37); // Скидка 37%
	Запрос.УстановитьПараметр("Скидка38", 				Скидка38);   // Скидка 38%
	Запрос.УстановитьПараметр("СпецЦена", 				СпецЦена);   // Скидка 38%
	Запрос.УстановитьПараметр("АДУрал", 				АДУрал);   // АД Урал
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();  
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());      
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить(); 
	
	Если НЕ Результат.Пустой() Тогда   
		
		Выборка = Результат.Выбрать(); 
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Количество строк в запросе: " + Строка(Выборка.Количество()));
		
		Пока Выборка.Следующий() Цикл 
			
			Подстрока = 
			Выборка.ЗаменяемыйРодитель + Символы.Таб
			 + Выборка.Артикул + Символы.Таб
			 + Выборка.КодПроизводителя + Символы.Таб
			 + Выборка.Номенклатура + Символы.Таб
			 + Выборка.ЕдИзм + Символы.Таб
			 + строка(Выборка.Кратность) + Символы.Таб
			 + Строка(СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.БазоваяценаМоскворечье, Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.Скидка35, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка36, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка37, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.Скидка38, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.СпецЦена, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.АДУрал, Символы.НПП, "")) + Символы.Таб
			 + Выборка.КодМДМ;                
			 
			Текст.ДобавитьСтроку(Подстрока);
			
		КонецЦикла;     
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк во временном документе: " + Строка(Текст.КоличествоСтрок()));
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ВремИмя = "TempPrice";
	Текст.Записать(ВременныйКаталог + ВремИмя,КодировкаТекста.ANSI);
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, "Документ записан во временный каталог");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не удалось установить соединение с FTP. Запись данных на FTP  не выполнена.");
		ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл     
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.lock") Тогда 
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	 
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ (daemon.lock).");
		ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
		Возврат;
		
	КонецЕсли;
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмяФайлаБлокировки = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки); 	
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ИмяКаталогаСервера + "connect.lock");		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение 
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Информация,,, 
		"Ошибка записи файла connect.lock в каталог: " + ЗаданаПапкаДляFTP + Символы.ПС + ОписаниеОшибки());	
		ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
		Возврат;
		
	КонецПопытки;
	
	ВременныйФайлЗаписанНаСервере = Истина;  
	
	Попытка
		
		ЗаписыватьВременныйФайл = Истина;
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "TempPrice");
		
		Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл   
			
			Если ВРег(ТекСтр.Имя) = ВРег("TempPrice") Тогда
				
				РазмерФайлаНаСервере = ТекСтр.Размер();
				ФайлНаДиске = Новый Файл(ВременныйКаталог + ВремИмя);  
				
				Если ФайлНаДиске.Существует() Тогда          
					
					РазмерФайлаНаДиске = ФайлНаДиске.Размер();
					ЗаписыватьВременныйФайл = (РазмерФайлаНаСервере <> РазмерФайлаНаДиске); 
					
				КонецЕсли;       
				
				Прервать;  
				
			КонецЕсли;     
			
		КонецЦикла;     
		
		Если ЗаписыватьВременныйФайл Тогда   
			
			Соединение.Записать(ВременныйКаталог + ВремИмя, ИмяКаталогаСервера + ВремИмя);		
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Иначе
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
			"На FTP: " + ИмяFTPСервера + " в каталоге: " + ЗаданаПапкаДляFTP + " существует временный файл, совпадающий по размеру с текущим. Файл не перезаписан.");
		КонецЕсли;       
		
	Исключение     		                                  
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Запись данных под временным имененм на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
		ВременныйФайлЗаписанНаСервере = Ложь;
		ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);   
		
	КонецПопытки;	
	
	Если ВременныйФайлЗаписанНаСервере Тогда  
		
		Попытка
			
			Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);	
			
		Исключение  
			
			Попытка
				
				// ошибка может возникать из-за того, что на сервере уже есть файл price.file
				// в этом случе необходимо сравнить файлы по размеру и, в случае несовпадения, удалить старый и записать новый
				СтарыйФайлНайденНаСервере = Ложь;
				РазмерСтарогоФайла = 0;
				МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "price.file"); 
				
				Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл       
					
					Если ВРег(ТекСтр.Имя) = ВРег("price.file") Тогда  
						
						СтарыйФайлНайденНаСервере = Истина;
						РазмерСтарогоФайла = ТекСтр.Размер();
						Прервать;     
						
					КонецЕсли;    
					
				КонецЦикла;     
				
				Если СтарыйФайлНайденНаСервере Тогда  
					
					РазмерНовогоФайла = 0;
					МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + ВремИмя);
					
					Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл   
						
						Если ВРег(ТекСтр.Имя) = ВРег(ВремИмя) Тогда    
							
							РазмерНовогоФайла = ТекСтр.Размер();	
							Прервать;   
							
						КонецЕсли;     
						
					КонецЦикла;	      
					
					Если РазмерНовогоФайла = РазмерСтарогоФайла Тогда      
						
						ЗаписьЖурналаРегистрации("Полное обновление остатков и цен. Обработка", УровеньЖурналаРегистрации.Информация,,, 
						"На FTP: " + ИмяFTPСервера + " в каталоге " + ЗаданаПапкаДляFTP 
						+ " есть файл ""price.file"", совпадающий по размеру с новым файлом. Новый файл не записан.");
						ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);
						
						Попытка
							Соединение.Удалить(ИмяКаталогаСервера + ВремИмя);
						Исключение
						КонецПопытки;    
						
					Иначе                   
						
						СтарыйФайлУдален = Истина; 
						
						Попытка
							Соединение.Удалить(ИмяКаталогаСервера + "price.file");
						Исключение
							
							Попытка
								
								Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(),  
								Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
								Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "price.file");
								
							Исключение
								
								СтарыйФайлУдален = Ложь;
								ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
								"Ошибка при удалении старого файла price.file" + Символы.ПС + ОписаниеОшибки());
								ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);	
								
							КонецПопытки;
							
						КонецПопытки;
						
						Если СтарыйФайлУдален Тогда  
							
							Попытка
								
								Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
								ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
								"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
								ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);
								
							Исключение
								
								ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
								"Запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
								ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
								
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					
					// сделать еще одну попытку
					Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
					
					ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
					"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
					ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);
					
				КонецЕсли;   
				
			Исключение
				
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
				ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
				
			КонецПопытки;
			
		КонецПопытки;	
		
		// Записать копию
		Если ЗначениеЗаполнено(Константы.FTPКопииФайловАдрес.Получить()) Тогда
			
			Попытка
				
				СоединениеДляКопии = Новый FTPСоединение(Константы.FTPКопииФайловАдрес.Получить(), "21", Константы.FTPКопииФайловЛогин.Получить(),  
				Константы.FTPКопииФайловПароль.Получить(), , Истина);
				
				СоединениеДляКопии.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(Константы.FTPКопииФайловКаталог.Получить()), 
				Константы.FTPКопииФайловКаталог.Получить() + "\", "") + "price.file" + "_ПолноеОбновлениеОстатковИЦен_" + Константы.База.Получить() 
				+ "_" + Формат(ТекущаяДата(), "ДФ=дд_мм_гггг_ЧЧ_мм_сс"));
				
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
				"Копия документа записана на FTP: " + Константы.FTPКопииФайловАдрес.Получить() + " в каталог: " + Константы.FTPКопииФайловКаталог.Получить());
				
			Исключение
				
				Попытка
					
					СоединениеДляКопии = Новый FTPСоединение(Константы.FTPКопииФайловАдрес.Получить(), "21", 
					Константы.FTPКопииФайловЛогин.Получить(),  Константы.FTPКопииФайловПароль.Получить(), , Истина);
					
					СоединениеДляКопии.Записать(ВременныйКаталог + ВремИмя, 
					?(ЗначениеЗаполнено(Константы.FTPКопииФайловКаталог.Получить()), Константы.FTPКопииФайловКаталог.Получить() + "\", "") 
					+ "price.file" + "_ПолноеОбновлениеОстатковИЦен_" + Константы.База.Получить() + "_" + Формат(ТекущаяДата(), "ДФ=дд_мм_гггг_ЧЧ_мм_сс"));
					
				Исключение
					ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Ошибка записи копии документа на FTP: " + Константы.FTPКопииФайловАдрес.Получить() + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
				
			КонецПопытки;
			
		Иначе
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , "Не заполнен FTP для выгрузки копий файлов");
		КонецЕсли;   
		
	КонецЕсли; // ВременныйФайлЗаписанНаСервере 
	
	// Удалить файлик
	Попытка
		
		Соединение.Удалить(ИмяКаталогаСервера + "connect.lock");
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
			Соединение.Удалить(ИмяКаталогаСервера + "connect.lock");
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при удалении файла connect.lock" 
			+ Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки; 
	
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	УдалитьФайлы(ВременныйКаталог);
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Завершение", УровеньЖурналаРегистрации.Информация,,,);
	
КонецПроцедуры

Процедура ПолноеОбновлениеОстатковИЦенЕдиныйПрайсЛист() Экспорт
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");  
	
	СписокКаталоговСервера = Новый СписокЗначений;
	
	Если ЗначениеЗаполнено(ИмяКаталогаСервера) Тогда
		СписокКаталоговСервера.Добавить(ЗаданаПапкаДляFTP , ИмяКаталогаСервера);
	КонецЕсли;
	
	КаталогиОбновленияЦенОП = Константы.FTPВыгрузкаОстатковКаталогиОП.Получить();
	
	Если ЗначениеЗаполнено(КаталогиОбновленияЦенОП) Тогда
		
		МассивКаталоговИзКонстанты = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(КаталогиОбновленияЦенОП, ";");
		
		Для Каждого СтрокаМассиваКаталогов Из МассивКаталоговИзКонстанты Цикл 
			 СписокКаталоговСервера.Добавить(СтрокаМассиваКаталогов , "" + СтрокаМассиваКаталогов + "/");
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;
		
	КонецЕсли;
	
	ВыполнятьВыгрузку = Истина;
	ОшибкаПрошлойВыгрузки = Ложь;
	УдалитьЗаписи = Ложь;     
	
	Набор = РегистрыСведений.ЖурналОбновленияОстатковЦен.СоздатьНаборЗаписей();
	Набор.Отбор.Задание.Установить("ПолноеОбновлениеОстатковЦен");
	Набор.Прочитать();   
	
	Если Набор.Количество() > 0 Тогда   
		
		ДатаВыполнения = Набор[0].ДатаВыполнения;
		ОшибкаПрошлойВыгрузки = Набор[0].Ошибка;
		УдалитьЗаписи = Истина;       
		
		Если ЗначениеЗаполнено(ДатаВыполнения) Тогда  
			
			Если (Не ОшибкаПрошлойВыгрузки) И ((ТекущаяДата() - Набор[0].ДатаВыполнения) < 21600) Тогда    
				
				ВыполнятьВыгрузку = Ложь;
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Завершение", УровеньЖурналаРегистрации.Информация,,, 
				"Отмена запуска регламентного заддания: прошло меньше 6 часов с момента прошлого запуска (РС ""Журнал обновления остатков и цен"").");
				
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если Не ВыполнятьВыгрузку Тогда
		Возврат;
	КонецЕсли;
	
	ВремяНач = ТекущаяДата();
	
	Запрос = Новый Запрос; 	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ТоварыИДокументы
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул = """"
	|	И ЦеныНоменклатурыСрезПоследних.ТипЦен В(&СписокТиповЦен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИДокументы.Номенклатура,
	|	ТоварыИДокументы.Номенклатура.Артикул КАК Артикул
	|ПОМЕСТИТЬ ТоварыСЦенамиФилиала
	|ИЗ
	|	ТоварыИДокументы КАК ТоварыИДокументы
	|ГДЕ
	|	НЕ ТоварыИДокументы.Регистратор.Ответственный = &Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель) КАК Производитель,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Наименование),
	|	Номенклатура.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.КратностьФилиала = 0
	|				И НЕ Номенклатура.КратностьФилиала = Номенклатура.Кратность
	|			ТОГДА Номенклатура.КратностьФилиала
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Кратность = 0
	|					ТОГДА 1
	|				ИНАЧЕ Номенклатура.Кратность
	|			КОНЕЦ
	|	КОНЕЦ КАК Кратность,
	|	ВЫБОР
	|		КОГДА Константы.ИспользоватьГруппуНоменклатурыУценка
	|				И Константы.ГруппаНоменклатурыУценка <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА Номенклатура.Родитель = Константы.ГруппаНоменклатурыУценка
	|						ТОГДА ВЫБОР
	|								КОГДА Номенклатура.ПредыдущийРодитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|									ТОГДА ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|								ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.ПредыдущийРодитель)
	|							КОНЕЦ
	|					ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|				КОНЕЦ
	|		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель)
	|	КОНЕЦ КАК ЗаменяемыйРодитель,
	|	Номенклатура.КодМДМ
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Константы КАК Константы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица8.Номенклатура,
	|	Таблица8.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ АДУрал
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &АДУрал
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица8
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица8.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица8.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица8.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица8.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица9.Номенклатура,
	|	Таблица9.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Акция
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Акция
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица9
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица9.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица9.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица9.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица9.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица10.Номенклатура,
	|	Таблица10.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ АвтоЕвропа
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &АвтоЕвропа
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица10
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица10.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица10.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица10.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица10.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица11.Номенклатура,
	|	Таблица11.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Резерв4
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Резерв4
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица11
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица11.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица11.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица11.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица11.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыНаСкладахОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыОстаток.Остаток, 0) - ЕСТЬNULL(ТоварыРезерв.КоличествоОстаток, 0) КАК СвободныйОстатокСклад
	|ПОМЕСТИТЬ ТоварыСвободныйОстаток
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаСкладахОстатки КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Товары.Номенклатура
	|						ИЗ
	|							Товары КАК Товары)
	|					И Склад = &Склад) КАК ТоварыРезерв
	|		ПО Товары.Номенклатура = ТоварыРезерв.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Остаток,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0) <= ЕСТЬNULL(ТоварыСвободныйОстаток.СвободныйОстатокСклад, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыСвободныйОстаток.СвободныйОстатокСклад, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	Товары.Производитель,
	|	Товары.Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена,
	|	ЕСТЬNULL(АДУрал.Цена, 0) КАК АДУрал,
	|	ЕСТЬNULL(Акция.Цена, 0) КАК Акция,
	|	ЕСТЬNULL(АвтоЕвропа.Цена, 0) КАК АвтоЕвропа,
	|	ЕСТЬNULL(Резерв4.Цена, 0) КАК Резерв4,
	|	Товары.ЗаменяемыйРодитель,
	|	Товары.КодМДМ,
	|	Товары.Номенклатура.ГруппаАВС
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСвободныйОстаток КАК ТоварыСвободныйОстаток
	|		ПО Товары.Номенклатура = ТоварыСвободныйОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АДУрал КАК АДУрал
	|		ПО Товары.Номенклатура = АДУрал.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акция КАК Акция
	|		ПО Товары.Номенклатура = Акция.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвтоЕвропа КАК АвтоЕвропа
	|		ПО Товары.Номенклатура = АвтоЕвропа.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Резерв4 КАК Резерв4
	|		ПО Товары.Номенклатура = Резерв4.Номенклатура
	|ГДЕ
	|	НЕ(ТоварыОстаток.Остаток ЕСТЬ NULL
	|				И БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL
	|				И АДУрал.Цена ЕСТЬ NULL
	|				И Акция.Цена ЕСТЬ NULL
	|				И АвтоЕвропа.Цена ЕСТЬ NULL
	|				И Резерв4.Цена ЕСТЬ NULL)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыZСНулевымОстатком
	|ИЗ
	|	Итог КАК Итог
	|ГДЕ
	|	Итог.НоменклатураГруппаАВС.Наименование ПОДОБНО ""Z%""
	|	И Итог.СвободныйОстаток = 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Итог.Номенклатура КАК Номенклатура,
	|	Итог.СвободныйОстаток,
	|	Итог.Производитель,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(Итог.Номенклатура.КодМДМ КАК СТРОКА(36))) = """"
	|			ТОГДА Итог.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Артикул,
	|	Итог.КодПроизводителя,
	|	Итог.НаименованиеПредставление,
	|	Итог.ЕдИзм,
	|	Итог.Кратность,
	|	Итог.БазоваяценаМоскворечье,
	|	Итог.Скидка35,
	|	Итог.Скидка36,
	|	Итог.Скидка37,
	|	Итог.Скидка38,
	|	Итог.СпецЦена,
	|	Итог.АДУрал,
	|	Итог.Акция,
	|	Итог.АвтоЕвропа,
	|	Итог.Резерв4,
	|	Итог.ЗаменяемыйРодитель,
	|	ВЫБОР
	|		КОГДА ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(ТоварыСЦенамиФилиала.Артикул КАК СТРОКА(25))) = """"
	|			ТОГДА Итог.Номенклатура.КодМДМ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодМДМ,
	|	Итог.НоменклатураГруппаАВС,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(Итог.Номенклатура.КодМДМ КАК СТРОКА(36))) = """"
	|			ТОГДА Итог.Номенклатура.ЗначениеМаскиНедоступныхТоваров
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗначениеМаскиНедоступныхТоваров
	|ПОМЕСТИТЬ ИтогТоварыГоловногоФилиала
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенамиФилиала КАК ТоварыСЦенамиФилиала
	|		ПО Итог.Номенклатура = ТоварыСЦенамиФилиала.Номенклатура
	|ГДЕ
	|	НЕ Итог.Номенклатура В
	|				(ВЫБРАТЬ
	|					ТоварыZСНулевымОстатком.Номенклатура
	|				ИЗ
	|					ТоварыZСНулевымОстатком КАК ТоварыZСНулевымОстатком)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыГруппыZВНаличииВОП.Номенклатура
	|ПОМЕСТИТЬ ТоварыГруппыZВНаличииВОП
	|ИЗ
	|	РегистрСведений.ТоварыГруппыZВНаличииВОП КАК ТоварыГруппыZВНаличииВОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	0 КАК СвободныйОстаток,
	|	Товары.Производитель,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(Товары.Номенклатура.КодМДМ КАК СТРОКА(36))) = """"
	|			ТОГДА Товары.Артикул
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена,
	|	ЕСТЬNULL(АДУрал.Цена, 0) КАК АДУрал,
	|	ЕСТЬNULL(Акция.Цена, 0) КАК Акция,
	|	ЕСТЬNULL(АвтоЕвропа.Цена, 0) КАК АвтоЕвропа,
	|	ЕСТЬNULL(Резерв4.Цена, 0) КАК Резерв4,
	|	Товары.ЗаменяемыйРодитель,
	|	ВЫБОР
	|		КОГДА ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(ТоварыСЦенамиФилиала.Артикул КАК СТРОКА(25))) = """"
	|			ТОГДА Товары.Номенклатура.КодМДМ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодМДМ,
	|	Товары.Номенклатура.ГруппаАВС,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыСЦенамиФилиала.Артикул ЕСТЬ NULL
	|				ИЛИ (ВЫРАЗИТЬ(Товары.Номенклатура.КодМДМ КАК СТРОКА(36))) = """"
	|			ТОГДА Товары.Номенклатура.ЗначениеМаскиНедоступныхТоваров
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ЗначениеМаскиНедоступныхТоваров
	|ПОМЕСТИТЬ ИтогТоварыГруппыZОП
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСвободныйОстаток КАК ТоварыСвободныйОстаток
	|		ПО Товары.Номенклатура = ТоварыСвободныйОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АДУрал КАК АДУрал
	|		ПО Товары.Номенклатура = АДУрал.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акция КАК Акция
	|		ПО Товары.Номенклатура = Акция.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвтоЕвропа КАК АвтоЕвропа
	|		ПО Товары.Номенклатура = АвтоЕвропа.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Резерв4 КАК Резерв4
	|		ПО Товары.Номенклатура = Резерв4.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСЦенамиФилиала КАК ТоварыСЦенамиФилиала
	|		ПО Товары.Номенклатура = ТоварыСЦенамиФилиала.Номенклатура
	|ГДЕ
	|	НЕ(БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL
	|				И АДУрал.Цена ЕСТЬ NULL
	|				И Акция.Цена ЕСТЬ NULL
	|				И АвтоЕвропа.Цена ЕСТЬ NULL
	|				И Резерв4.Цена ЕСТЬ NULL)
	|	И Товары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ТоварыГруппыZВНаличииВОП.Номенклатура
	|			ИЗ
	|				ТоварыГруппыZВНаличииВОП КАК ТоварыГруппыZВНаличииВОП)
	|	И НЕ Товары.Номенклатура В
	|				(ВЫБРАТЬ
	|					ИтогТоварыГоловногоФилиала.Номенклатура
	|				ИЗ
	|					ИтогТоварыГоловногоФилиала КАК ИтогТоварыГоловногоФилиала)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогТоварыГоловногоФилиала.Номенклатура,
	|	ИтогТоварыГоловногоФилиала.СвободныйОстаток,
	|	ИтогТоварыГоловногоФилиала.Производитель,
	|	ИтогТоварыГоловногоФилиала.Артикул,
	|	ИтогТоварыГоловногоФилиала.КодПроизводителя,
	|	ИтогТоварыГоловногоФилиала.НаименованиеПредставление,
	|	ИтогТоварыГоловногоФилиала.ЕдИзм,
	|	ИтогТоварыГоловногоФилиала.Кратность,
	|	ИтогТоварыГоловногоФилиала.БазоваяценаМоскворечье,
	|	ИтогТоварыГоловногоФилиала.Скидка35,
	|	ИтогТоварыГоловногоФилиала.Скидка36,
	|	ИтогТоварыГоловногоФилиала.Скидка37,
	|	ИтогТоварыГоловногоФилиала.Скидка38,
	|	ИтогТоварыГоловногоФилиала.СпецЦена,
	|	ИтогТоварыГоловногоФилиала.АДУрал,
	|	ИтогТоварыГоловногоФилиала.Акция,
	|	ИтогТоварыГоловногоФилиала.АвтоЕвропа,
	|	ИтогТоварыГоловногоФилиала.Резерв4,
	|	ИтогТоварыГоловногоФилиала.ЗаменяемыйРодитель,
	|	ИтогТоварыГоловногоФилиала.КодМДМ,
	|	ИтогТоварыГоловногоФилиала.НоменклатураГруппаАВС,
	|	ИтогТоварыГоловногоФилиала.ЗначениеМаскиНедоступныхТоваров
	|ПОМЕСТИТЬ ИтогОбщий
	|ИЗ
	|	ИтогТоварыГоловногоФилиала КАК ИтогТоварыГоловногоФилиала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИтогТоварыГруппыZОП.Номенклатура,
	|	ИтогТоварыГруппыZОП.СвободныйОстаток,
	|	ИтогТоварыГруппыZОП.Производитель,
	|	ИтогТоварыГруппыZОП.Артикул,
	|	ИтогТоварыГруппыZОП.КодПроизводителя,
	|	ИтогТоварыГруппыZОП.НаименованиеПредставление,
	|	ИтогТоварыГруппыZОП.ЕдИзм,
	|	ИтогТоварыГруппыZОП.Кратность,
	|	ИтогТоварыГруппыZОП.БазоваяценаМоскворечье,
	|	ИтогТоварыГруппыZОП.Скидка35,
	|	ИтогТоварыГруппыZОП.Скидка36,
	|	ИтогТоварыГруппыZОП.Скидка37,
	|	ИтогТоварыГруппыZОП.Скидка38,
	|	ИтогТоварыГруппыZОП.СпецЦена,
	|	ИтогТоварыГруппыZОП.АДУрал,
	|	ИтогТоварыГруппыZОП.Акция,
	|	ИтогТоварыГруппыZОП.АвтоЕвропа,
	|	ИтогТоварыГруппыZОП.Резерв4,
	|	ИтогТоварыГруппыZОП.ЗаменяемыйРодитель,
	|	ИтогТоварыГруппыZОП.КодМДМ,
	|	ИтогТоварыГруппыZОП.НоменклатураГруппаАВС,
	|	ИтогТоварыГруппыZОП.ЗначениеМаскиНедоступныхТоваров
	|ИЗ
	|	ИтогТоварыГруппыZОП КАК ИтогТоварыГруппыZОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогОбщий.Номенклатура,
	|	ИтогОбщий.СвободныйОстаток,
	|	ИтогОбщий.Производитель,
	|	ИтогОбщий.Артикул КАК Артикул,
	|	ИтогОбщий.КодПроизводителя,
	|	ИтогОбщий.НаименованиеПредставление,
	|	ИтогОбщий.ЕдИзм,
	|	ИтогОбщий.Кратность,
	|	ИтогОбщий.БазоваяценаМоскворечье,
	|	ИтогОбщий.Скидка35,
	|	ИтогОбщий.Скидка36,
	|	ИтогОбщий.Скидка37,
	|	ИтогОбщий.Скидка38,
	|	ИтогОбщий.СпецЦена,
	|	ИтогОбщий.АДУрал,
	|	ИтогОбщий.Акция,
	|	ИтогОбщий.АвтоЕвропа,
	|	ИтогОбщий.Резерв4,
	|	ИтогОбщий.ЗаменяемыйРодитель,
	|	ИтогОбщий.КодМДМ,
	|	ИтогОбщий.НоменклатураГруппаАВС,
	|	ИтогОбщий.ЗначениеМаскиНедоступныхТоваров
	|ИЗ
	|	ИтогОбщий КАК ИтогОбщий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();                       
	АДУрал          = Константы.АДУрал.Получить();
	Акция           = Константы.Акция.Получить();
	АвтоЕвропа      = Константы.АвтоЕвропа.Получить();
	Резерв4         = Константы.Резерв4.Получить();  
	
	ЗаменятьРодителяДляГруппыУценка = 
	Константы.ИспользоватьГруппуНоменклатурыУценка.Получить()
	и ЗначениеЗаполнено(Константы.ГруппаНоменклатурыУценка.Получить());
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье", Базовая);   
	Запрос.УстановитьПараметр("Скидка35", 				Скидка35);  
	Запрос.УстановитьПараметр("Скидка36", 				Скидка36);  
	Запрос.УстановитьПараметр("Скидка37", 				Скидка37);  
	Запрос.УстановитьПараметр("Скидка38", 				Скидка38);  
	Запрос.УстановитьПараметр("СпецЦена", 				СпецЦена);  
	Запрос.УстановитьПараметр("АДУрал", 				АДУрал);   
	Запрос.УстановитьПараметр("Акция", 				    Акция);
	Запрос.УстановитьПараметр("АвтоЕвропа", 		    АвтоЕвропа);
	Запрос.УстановитьПараметр("Резерв4",                Резерв4);
	
	СписокТиповЦен = Новый СписокЗначений;
	СписокТиповЦен.Добавить(Базовая);
	СписокТиповЦен.Добавить(Скидка35);
	СписокТиповЦен.Добавить(Скидка36);
	СписокТиповЦен.Добавить(Скидка37);
	СписокТиповЦен.Добавить(Скидка38);
	СписокТиповЦен.Добавить(СпецЦена);
	СписокТиповЦен.Добавить(АДУрал);
	СписокТиповЦен.Добавить(Акция); 
	СписокТиповЦен.Добавить(АвтоЕвропа);
	СписокТиповЦен.Добавить(Резерв4);
	
	Запрос.УстановитьПараметр("СписокТиповЦен", 	СписокТиповЦен);
	Запрос.УстановитьПараметр("Ответственный",      Справочники.Пользователи.НайтиПоКоду("robot"));
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());      
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить(); 
	
	Если НЕ Результат.Пустой() Тогда  
		
		Выборка = Результат.Выбрать(); 
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Количество строк в запросе: " + Строка(Выборка.Количество()));
		
		МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
		МаксимальноеКоличествоИтераций = 20000;
		ДанныеПоОстаткамСтрока = "";
		
		Инд = 0;         
		
		Пока Выборка.Следующий() Цикл	
			
			Если Инд = МаксимальноеКоличествоИтераций Тогда       
				
				МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
				Инд = 0;  
				ДанныеПоОстаткамСтрока = "";  
				
			КонецЕсли; 
			
			ВременнаяСтрока =  
			Выборка.ЗаменяемыйРодитель + Символы.Таб
			 + Выборка.Артикул + Символы.Таб
			 + Выборка.КодПроизводителя + Символы.Таб
			 + Выборка.Номенклатура + Символы.Таб
			 + Выборка.ЕдИзм + Символы.Таб
			 + Строка(Выборка.Кратность) + Символы.Таб
			 + Строка(СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.БазоваяценаМоскворечье, Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.Скидка35, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка36, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка37, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.Скидка38, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.СпецЦена, Символы.НПП, "")) + Символы.Таб			
			 + Строка(СтрЗаменить(Выборка.АДУрал, Символы.НПП, "")) + Символы.Таб					
			 + СокрЛП(Выборка.КодМДМ)  + Символы.Таб                           
			 + Строка(СтрЗаменить(Выборка.Акция, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.АвтоЕвропа, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Резерв4, Символы.НПП, "")
			 //+Сёмин Р.И. 02.04.2026 #UT10-5793
			 + Символы.Таб + Строка(СтрЗаменить(Выборка.ЗначениеМаскиНедоступныхТоваров, Символы.НПП, ""))
			 //-Сёмин Р.И. 02.04.2026 #UT10-5793
			 );
			
			ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
			
			Инд = Инд + 1;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
		КонецЕсли;
		
		ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
		
		Сч = 0;
		
		Для Каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл  
			
			ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
			Сч = Сч + 1;  
			
		КонецЦикла;
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
		
		Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
	"Количество строк во временном документе: " + Строка(Текст.КоличествоСтрок()));
	
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ВремИмя = "TempPrice";
	Текст.Записать(ВременныйКаталог + ВремИмя,КодировкаТекста.ANSI);
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, "Документ записан во временный каталог");
	
	Для Каждого СтрокаСпискаКаталогов Из СписокКаталоговСервера Цикл
		
		ЗаданаПапкаДляFTP  = СокрЛП(СтрокаСпискаКаталогов.Значение);
		ИмяКаталогаСервера = СокрЛП(СтрокаСпискаКаталогов.Представление);
		
		Попытка
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
			
			ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
			Возврат;
			
		КонецПопытки;
		
		Отказ = Ложь;
		
		МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");
		
		Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл  
			
			Если ВРег(ТекСтр.Имя) = ВРег("daemon.lock") Тогда   
				
				Отказ = Истина;
				Прервать;     
				
			КонецЕсли; 
			
		КонецЦикла;	    
		
		Если Отказ Тогда
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ (daemon.lock).");
			
			ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
			Возврат;
			
		КонецЕсли;
		
		// Записать файлик блокировки
		Файлик = Новый ТекстовыйДокумент;
		ВремИмяФайлаБлокировки = Строка(Новый УникальныйИдентификатор);
		Файлик.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки); 	
		
		Попытка
			
			Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ИмяКаталогаСервера + "connect.lock");		
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
			"Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение 
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Ошибка", УровеньЖурналаРегистрации.Информация,,, 
			"Ошибка записи файла connect.lock в каталог: " + ЗаданаПапкаДляFTP + Символы.ПС + ОписаниеОшибки());	
			
			ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
			Возврат;
			
		КонецПопытки;
		
		ВременныйФайлЗаписанНаСервере = Истина; 
		
		Попытка
			
			ЗаписыватьВременныйФайл = Истина;
			МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "TempPrice");
			
			Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл     
				
				Если ВРег(ТекСтр.Имя) = ВРег("TempPrice") Тогда
					
					РазмерФайлаНаСервере = ТекСтр.Размер();
					ФайлНаДиске = Новый Файл(ВременныйКаталог + ВремИмя);
					
					Если ФайлНаДиске.Существует() Тогда
						
						РазмерФайлаНаДиске = ФайлНаДиске.Размер();
						ЗаписыватьВременныйФайл = (РазмерФайлаНаСервере <> РазмерФайлаНаДиске);
						
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗаписыватьВременныйФайл Тогда
				
				Соединение.Записать(ВременныйКаталог + ВремИмя, ИмяКаталогаСервера + ВремИмя);		
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
				"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
				
			Иначе
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен единый прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
				"На FTP: " + ИмяFTPСервера + " в каталоге: " + ЗаданаПапкаДляFTP + " существует временный файл, совпадающий по размеру с текущим. Файл не перезаписан.");
			КонецЕсли;
			
		Исключение     		
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
			"Запись данных под временным имененм на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
			
			ВременныйФайлЗаписанНаСервере = Ложь;
			ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
			
		КонецПопытки;	
		
		Если ВременныйФайлЗаписанНаСервере Тогда
			
			Попытка
				
				Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
				"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
				
				ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);	
				
			Исключение  
				
				Попытка
					
					// ошибка может возникать из-за того, что на сервере уже есть файл price.file
					// в этом случе необходимо сравнить файлы по размеру и, в случае несовпадения, удалить старый и записать новый
					СтарыйФайлНайденНаСервере = Ложь;
					РазмерСтарогоФайла = 0;
					МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "price.file");
					
					Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
						
						Если ВРег(ТекСтр.Имя) = ВРег("price.file") Тогда
							
							СтарыйФайлНайденНаСервере = Истина;
							РазмерСтарогоФайла = ТекСтр.Размер();
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Если СтарыйФайлНайденНаСервере Тогда
						
						РазмерНовогоФайла = 0;
						МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + ВремИмя);
						
						Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
							
							Если ВРег(ТекСтр.Имя) = ВРег(ВремИмя) Тогда
								
								РазмерНовогоФайла = ТекСтр.Размер();	
								Прервать;
								
							КонецЕсли;
							
						КонецЦикла;	
						
						Если РазмерНовогоФайла = РазмерСтарогоФайла Тогда
							
							ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
							"На FTP: " + ИмяFTPСервера + " в каталоге " + ЗаданаПапкаДляFTP 
							+ " есть файл ""price.file"", совпадающий по размеру с новым файлом. Новый файл не записан.");
							
							ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);	
							
							Попытка
								Соединение.Удалить(ИмяКаталогаСервера + ВремИмя);
							Исключение
							КонецПопытки;
							
						Иначе
							
							СтарыйФайлУдален = Истина;
							
							Попытка
								Соединение.Удалить(ИмяКаталогаСервера + "price.file");
							Исключение
								
								Попытка
									
									Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(),  
									Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
									Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "price.file");
									
								Исключение
									
									СтарыйФайлУдален = Ложь;
									ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
									"Ошибка при удалении старого файла price.file" + Символы.ПС + ОписаниеОшибки());
									
									ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);	
									
								КонецПопытки;
								
							КонецПопытки;
							
							Если СтарыйФайлУдален Тогда
								
								Попытка
									
									Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
									ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
									"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
									
									ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);
									
								Исключение
									
									ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
									"Запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
									ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
									
								КонецПопытки;
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						
						// сделать еще одну попытку
						Соединение.Переместить(ИмяКаталогаСервера + ВремИмя, ИмяКаталогаСервера + "price.file");		
						ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
						"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
						
						ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Ложь);
						
					КонецЕсли;
					
				Исключение
					
					ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
					"Запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
					
					ЗаписатьОшибкуВыгрузкиОстатковЦен("ПолноеОбновлениеОстатковЦен", Набор, УдалитьЗаписи, Истина);
					
				КонецПопытки;
				
			КонецПопытки;	
			
			// Записать копию
			Если ЗначениеЗаполнено(Константы.FTPКопииФайловАдрес.Получить()) Тогда
				
				Попытка
					
					СоединениеДляКопии = Новый FTPСоединение(Константы.FTPКопииФайловАдрес.Получить(), "21", Константы.FTPКопииФайловЛогин.Получить(), 
					Константы.FTPКопииФайловПароль.Получить(), , Истина);   
					
					СоединениеДляКопии.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(Константы.FTPКопииФайловКаталог.Получить()), 
					Константы.FTPКопииФайловКаталог.Получить() + "\", "") + "price.file" + "_ПолноеОбновлениеОстатковИЦен_" + Константы.База.Получить() 
					+ "_" + Формат(ТекущаяДата(), "ДФ=дд_мм_гггг_ЧЧ_мм_сс"));
					
					ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация,,, 
					"Копия документа записана на FTP: " + Константы.FTPКопииФайловАдрес.Получить() + " в каталог: " + Константы.FTPКопииФайловКаталог.Получить());
					
				Исключение
					
					Попытка
						
						СоединениеДляКопии = Новый FTPСоединение(Константы.FTPКопииФайловАдрес.Получить(), "21", Константы.FTPКопииФайловЛогин.Получить(),  
						Константы.FTPКопииФайловПароль.Получить(), , Истина);                                                                    
						
						СоединениеДляКопии.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(Константы.FTPКопииФайловКаталог.Получить()), 
						Константы.FTPКопииФайловКаталог.Получить() + "\", "") + "price.file" + "_ПолноеОбновлениеОстатковИЦен_" + Константы.База.Получить() 
						+ "_" + Формат(ТекущаяДата(), "ДФ=дд_мм_гггг_ЧЧ_мм_сс"));
						
					Исключение
						ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка записи копии документа на FTP: " + Константы.FTPКопииФайловАдрес.Получить() + Символы.ПС + ОписаниеОшибки());
					КонецПопытки;
					
				КонецПопытки;
				
			Иначе
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , "Не заполнен FTP для выгрузки копий файлов");
			КонецЕсли;
			
		КонецЕсли; // ВременныйФайлЗаписанНаСервере 
		
		// Удалить файлик
		Попытка
			
			Соединение.Удалить(ИмяКаталогаСервера + "connect.lock");
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
			
		Исключение
			
			Попытка
				
				Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(),  Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
				Соединение.Удалить(ИмяКаталогаСервера + "connect.lock");
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Обработка", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
				
			Исключение
				ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				"Ошибка при удалении файла connect.lock" + Символы.ПС + ОписаниеОшибки());
			КонецПопытки;
			
		КонецПопытки; 
		
	КонецЦикла;

	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	УдалитьФайлы(ВременныйКаталог);
	
	ЗаписьЖурналаРегистрации("Полное обновление остатков и цен прайс-лист.Завершение", УровеньЖурналаРегистрации.Информация,,,);
	
КонецПроцедуры

Процедура ПолноеОбновлениеОстатковИЦен_2() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;
		
	КонецЕсли;
	
	ВремяНач = ТекущаяДата();
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Родитель) КАК Производитель,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Номенклатура.Наименование),
	|	Номенклатура.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА НЕ Номенклатура.КратностьФилиала = 0
	|				И НЕ Номенклатура.КратностьФилиала = Номенклатура.Кратность
	|			ТОГДА Номенклатура.КратностьФилиала
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Номенклатура.Кратность = 0
	|					ТОГДА 1
	|				ИНАЧЕ Номенклатура.Кратность
	|			КОНЕЦ
	|	КОНЕЦ КАК Кратность,
	|	Номенклатура.КодМДМ
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыОстаток_Т2
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоРезерв
	|ПОМЕСТИТЬ ТоварыРезерв_Т2
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Остаток,
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)
	|				И Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Производитель,
	|	Товары.Артикул,
	|	Товары.КодПроизводителя,
	|	Товары.НаименованиеПредставление,
	|	Товары.БазоваяЕдиницаИзмерения КАК ЕдИзм,
	|	Товары.Кратность,
	|	Товары.КодМДМ,
	|	ЕСТЬNULL(ТоварыОстаток_Т2.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыРезерв_Т2.КоличествоРезерв, 0) КАК ОстатокПоСкладу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыОстаток_Т2.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыРезерв_Т2.КоличествоРезерв, 0) <= ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыОстаток_Т2.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыРезерв_Т2.КоличествоРезерв, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыОстаток.Остаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0) КАК БазоваяценаМоскворечье,
	|	ЕСТЬNULL(Скидка35.Цена, 0) КАК Скидка35,
	|	ЕСТЬNULL(Скидка36.Цена, 0) КАК Скидка36,
	|	ЕСТЬNULL(Скидка37.Цена, 0) КАК Скидка37,
	|	ЕСТЬNULL(Скидка38.Цена, 0) КАК Скидка38,
	|	ЕСТЬNULL(СпецЦена.Цена, 0) КАК СпецЦена
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток КАК ТоварыОстаток
	|		ПО Товары.Номенклатура = ТоварыОстаток.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыОстаток_Т2 КАК ТоварыОстаток_Т2
	|		ПО Товары.Номенклатура = ТоварыОстаток_Т2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыРезерв_Т2 КАК ТоварыРезерв_Т2
	|		ПО Товары.Номенклатура = ТоварыРезерв_Т2.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|ГДЕ
	|	НЕ(ТоварыОстаток.Остаток ЕСТЬ NULL
	|				И БазоваяценаМоскворечье.Цена ЕСТЬ NULL
	|				И Скидка35.Цена ЕСТЬ NULL
	|				И Скидка36.Цена ЕСТЬ NULL
	|				И Скидка37.Цена ЕСТЬ NULL
	|				И Скидка38.Цена ЕСТЬ NULL
	|				И СпецЦена.Цена ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.Артикул
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();   				
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье",Базовая);  // Базовая цена Москворечье
	Запрос.УстановитьПараметр("Скидка35", 				Скидка35);  // Скидка 35%
	Запрос.УстановитьПараметр("Скидка36", 				Скидка36);  // Скидка 36%
	Запрос.УстановитьПараметр("Скидка37", 				Скидка37); // Скидка 37%
	Запрос.УстановитьПараметр("Скидка38", 				Скидка38);   // Скидка 38%
	Запрос.УстановитьПараметр("СпецЦена", 				СпецЦена);   // СпецЦена
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());    
	
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл 
			
			Подстрока = 
			Выборка.Производитель + Символы.Таб
			 + Выборка.Артикул + Символы.Таб
			 + Выборка.КодПроизводителя + Символы.Таб
			 + Выборка.Номенклатура + Символы.Таб
			 + Выборка.ЕдИзм + Символы.Таб
			 + строка(Выборка.Кратность) + Символы.Таб
			 + Строка(СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.БазоваяценаМоскворечье, Символы.НПП, "")) + Символы.Таб 
			 + Строка(СтрЗаменить(Выборка.Скидка35, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка36, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка37, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.Скидка38, Символы.НПП, "")) + Символы.Таб
			 + Строка(СтрЗаменить(Выборка.СпецЦена, Символы.НПП, "")) + Символы.Таб
			 + Выборка.КодМДМ; 			
			
			Текст.ДобавитьСтроку(Подстрока);	
			
		КонецЦикла;
		
	КонецЕсли;
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Текст.Записать(ВременныйКаталог + ВремИмя,КодировкаТекста.ANSI);
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Не удалось установить соединение с FTP. Запись данных на FTP  не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "*.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") 
			Или ВРег(ТекСтр.Имя) = ВРег("connect.lock") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмяФайлаБлокировки = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация,,, "Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение 
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);		
			Соединение.Записать(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация,,, "Файл connect.lock записан в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация,,, 
			"Ошибка записи файла connect.lock записан в каталог: " + ЗаданаПапкаДляFTP + Символы.ПС + ОписаниеОшибки());	
			Возврат;
			
		КонецПопытки;
		
	КонецПопытки;
	
	Попытка
		
		Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация, , ,
		"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение
		
		Попытка
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Записать(ВременныйКаталог + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя);		
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан под временным имененм на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Ошибка,,, 
			"Блокировки НЕ БЫЛО. Но запись данных под временным имененм на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки;
	
	Попытка
		
		Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя, 
		?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");		
		
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен.Обработка", УровеньЖурналаРегистрации.Информация,,, 
		"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
		
	Исключение     		
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Переместить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + ВремИмя, 
			?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "price.file");		
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация,,, 
			"Документ записан на FTP: " + ИмяFTPСервера + " в каталог: " + ЗаданаПапкаДляFTP);
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Ошибка,,, 
			"Блокировки НЕ БЫЛО. Но запись данных на FTP: " + ИмяFTPСервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки;
	
	// Удалить файлик
	Попытка
		
		Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
		ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
		
	Исключение
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
			Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
			
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Информация, , , "Файл connect.lock успешно удален");
			
		Исключение
			ЗаписьЖурналаРегистрации("Полное обновление остатков и цен_2", УровеньЖурналаРегистрации.Ошибка, , , 
			"Ошибка при удалении файла connect.lock" + Символы.ПС + ОписаниеОшибки());
		КонецПопытки;
		
	КонецПопытки;
	
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмяФайлаБлокировки);
	УдалитьФайлы(ВременныйКаталог);

КонецПроцедуры

Процедура ОбновлениеЦенПортал() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда  
		
		ЗаписьЖурналаРегистрации("Обновление цен портал", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли; 
	
	ИмяS3Сервера       = Константы.S3ВыгрузкаЦенАдрес.Получить();
	ПортS3Сервера      = Константы.S3ВыгрузкаЦенПорт.Получить();
	ЗаданаПапкаДляS3   = СокрЛП(Константы.S3ВыгрузкаЦенКаталог.Получить());
	
	Если Не ЗначениеЗаполнено(ИмяS3Сервера) Тогда        
		
		ЗаписьЖурналаРегистрации("Обновление цен портал.Ошибка", 
		УровеньЖурналаРегистрации.Ошибка,,, "Отменена попытка соединения с S3: не заполнен адрес S3 сервера в константах.");
		Возврат;     
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ТоварыИДокументы
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
	|ГДЕ
	|	НЕ ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул = """"
	|	И ЦеныНоменклатурыСрезПоследних.ТипЦен В(&СписокТиповЦен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыИДокументы.Номенклатура КАК Номенклатура,
	|	ТоварыИДокументы.Номенклатура.Артикул КАК Артикул
	|ПОМЕСТИТЬ ТоварыСЦенамиФилиала
	|ИЗ
	|	ТоварыИДокументы КАК ТоварыИДокументы
	|ГДЕ
	|	НЕ ТоварыИДокументы.Регистратор.Ответственный = &Ответственный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И Номенклатура.Ссылка В
	|			(ВЫБРАТЬ
	|				ТоварыСЦенамиФилиала.Номенклатура
	|			ИЗ
	|				ТоварыСЦенамиФилиала)
	|	И НЕ Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица2.Номенклатура,
	|	Таблица2.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ БазоваяценаМоскворечье
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &БазоваяценаМоскворечье
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица2.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица2.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица2.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &БазоваяценаМоскворечье
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица2.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица3.Номенклатура,
	|	Таблица3.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка35
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка35
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица3.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица3.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица3.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Скидка35
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица3.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица4.Номенклатура,
	|	Таблица4.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка36
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка36
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица4
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица4.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица4.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица4.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Скидка36
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица4.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица5.Номенклатура,
	|	Таблица5.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка37
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка37
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица5
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица5.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица5.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица5.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Скидка37
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица5.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица6.Номенклатура,
	|	Таблица6.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица6
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица6.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица6.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица6.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Скидка38
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица6.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица7.Номенклатура,
	|	Таблица7.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ СпецЦена
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &СпецЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица7
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица7.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица7.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица7.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &СпецЦена
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица7.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица8.Номенклатура,
	|	Таблица8.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Акция
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Акция
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица8
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица8.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица8.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица8.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Акция
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица8.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица10.Номенклатура,
	|	Таблица10.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ АвтоЕвропа
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &АвтоЕвропа
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица10
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица10.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица10.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица10.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &АвтоЕвропа
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица10.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица11.Номенклатура,
	|	Таблица11.ТипЦен,
	|	СрезПоследнихЦен.Валюта,
	|	СрезПоследнихЦен.Регистратор,
	|	ВЫБОР
	|		КОГДА СрезПоследнихЦен.Валюта = &Евро
	|			ТОГДА СрезПоследнихЦен.Цена
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА СрезПоследнихЦен.Цена * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ Резерв4
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Резерв4
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары КАК Товары)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица11
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК СрезПоследнихЦен
	|		ПО Таблица11.ТипЦен = СрезПоследнихЦен.ТипЦен
	|			И Таблица11.Номенклатура = СрезПоследнихЦен.Номенклатура
	|			И Таблица11.Период = СрезПоследнихЦен.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (СрезПоследнихЦен.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	СрезПоследнихЦен.ТипЦен = &Резерв4
	|	И СрезПоследнихЦен.Номенклатура В
	|			(ВЫБРАТЬ
	|				Товары.Номенклатура
	|			ИЗ
	|				Товары КАК Товары)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таблица11.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	АвтоЕвропа.ТипЦен,
	|	ЕСТЬNULL(АвтоЕвропа.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ АвтоЕвропа КАК АвтоЕвропа
	|		ПО Товары.Номенклатура = АвтоЕвропа.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Акция.ТипЦен,
	|	ЕСТЬNULL(Акция.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Акция КАК Акция
	|		ПО Товары.Номенклатура = Акция.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	БазоваяценаМоскворечье.ТипЦен,
	|	ЕСТЬNULL(БазоваяценаМоскворечье.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ БазоваяценаМоскворечье КАК БазоваяценаМоскворечье
	|		ПО Товары.Номенклатура = БазоваяценаМоскворечье.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Скидка35.ТипЦен,
	|	ЕСТЬNULL(Скидка35.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка35 КАК Скидка35
	|		ПО Товары.Номенклатура = Скидка35.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Скидка36.ТипЦен,
	|	ЕСТЬNULL(Скидка36.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка36 КАК Скидка36
	|		ПО Товары.Номенклатура = Скидка36.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Скидка37.ТипЦен,
	|	ЕСТЬNULL(Скидка37.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка37 КАК Скидка37
	|		ПО Товары.Номенклатура = Скидка37.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Скидка38.ТипЦен,
	|	ЕСТЬNULL(Скидка38.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО Товары.Номенклатура = Скидка38.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	СпецЦена.ТипЦен,
	|	ЕСТЬNULL(СпецЦена.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпецЦена КАК СпецЦена
	|		ПО Товары.Номенклатура = СпецЦена.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Номенклатура,
	|	Резерв4.ТипЦен,
	|	ЕСТЬNULL(Резерв4.Цена, 0)
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Резерв4 КАК Резерв4
	|		ПО Товары.Номенклатура = Резерв4.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	GTINНоменклатур.Номенклатура КАК Номенклатура,
	|	GTINНоменклатур.GTIN
	|ПОМЕСТИТЬ GTINНоменклатур
	|ИЗ
	|	&GTINНоменклатур КАК GTINНоменклатур
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	//+Макрушин Е. 03.09.2026 #UT11-6041
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СертификатыНоменклатуры.Номенклатура КАК Номенклатура,
	|	СертификатыНоменклатуры.СсылкаНаРеестрСертификатов
	|ПОМЕСТИТЬ СертификатыНоменклатуры
	|ИЗ
	|	&СертификатыНоменклатуры КАК СертификатыНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	//-Макрушин Е. 03.09.2026 #UT11-6041
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""item"" КАК type,
	|	Итог.Номенклатура.КодМДМ КАК mdm_id,
	|	Итог.Номенклатура.Наименование КАК name,
	|	ЕСТЬNULL(Итог.Номенклатура.Родитель.КодМДМ, """") КАК brand_mdm_id,
	|	ЕСТЬNULL(Итог.Номенклатура.Родитель.Наименование, """") КАК brand_name,
	|	Итог.Номенклатура.КодПроизводителя КАК article,
	|	Итог.Номенклатура.Артикул КАК number,
	//+Сёмин Р.И. 02.06.2026 #UT10-5896
	//|	Итог.Номенклатура.Кратность КАК multiplicity,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.КратностьФилиала <> 0
	|			ТОГДА Итог.Номенклатура.КратностьФилиала
	|		ИНАЧЕ Итог.Номенклатура.Кратность
	|	КОНЕЦ КАК multiplicity,
	//-Сёмин Р.И. 02.06.2026 #UT10-5896
	|	Итог.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК unit_of_measurement,
	|	""руб."" КАК currency,
	|	Итог.ТипЦен.КодМДМ КАК type_price_mdm_id,
	|	МАКСИМУМ(Итог.Цена) КАК price,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК group_ch_z,
	|	ЕСТЬNULL(GTINНоменклатур.GTIN, """") КАК GTIN,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.КодТНВЭД.КодТНВЭД
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК TNVED,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.КодОКПД2.КодОКПД2
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК OKPD2
	//+Макрушин Е. 03.09.2026 #UT11-6041
	|	,ЕСТЬNULL(СертификатыНоменклатуры.СсылкаНаРеестрСертификатов, """") КАК certificates
	//-Макрушин Е. 03.09.2026 #UT11-6041
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ GTINНоменклатур КАК GTINНоменклатур
	|		ПО Итог.Номенклатура = GTINНоменклатур.Номенклатура
	//+Макрушин Е. 03.09.2026 #UT11-6041
	|		ЛЕВОЕ СОЕДИНЕНИЕ СертификатыНоменклатуры КАК СертификатыНоменклатуры
	|		ПО Итог.Номенклатура = СертификатыНоменклатуры.Номенклатура
	//-Макрушин Е. 03.09.2026 #UT11-6041
	|ГДЕ
	|	НЕ Итог.ТипЦен ЕСТЬ NULL
	|	И НЕ Итог.Цена = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Итог.Номенклатура.КодМДМ,
	|	ЕСТЬNULL(Итог.Номенклатура.Родитель.Наименование, """"),
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.КодТНВЭД.КодТНВЭД
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Итог.Номенклатура.КодПроизводителя,
	|	ЕСТЬNULL(Итог.Номенклатура.Родитель.КодМДМ, """"),
	|	Итог.Номенклатура.БазоваяЕдиницаИзмерения.Наименование,
	|	Итог.ТипЦен.КодМДМ,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.Наименование
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	Итог.Номенклатура.Наименование,
	|	Итог.Номенклатура.Артикул,
	//+Сёмин Р.И. 02.06.2026 #UT10-5896
	//|	Итог.Номенклатура.Кратность,
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.КратностьФилиала <> 0
	|			ТОГДА Итог.Номенклатура.КратностьФилиала
	|		ИНАЧЕ Итог.Номенклатура.Кратность
	|	КОНЕЦ,
	//-Сёмин Р.И. 02.06.2026 #UT10-5896
	|	ВЫБОР
	|		КОГДА Итог.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
	|			ТОГДА Итог.Номенклатура.КодОКПД2.КодОКПД2
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЕСТЬNULL(GTINНоменклатур.GTIN, """")
	//+Макрушин Е. 03.09.2026 #UT11-6041
	|	,ЕСТЬNULL(СертификатыНоменклатуры.СсылкаНаРеестрСертификатов, """")
	//-Макрушин Е. 03.09.2026 #UT11-6041
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗакупочнаяЦена 	= Константы.ЗакупочнаяЦена.Получить();
	Базовая 		= Константы.БазоваяЦена.Получить();
	Скидка35 		= Константы.Скидка35.Получить();
	Скидка36 		= Константы.Скидка36.Получить();
	Скидка37 		= Константы.Скидка37.Получить();
	Скидка38		= Константы.Скидка38.Получить();
	СпецЦена        = Константы.СпецЦена.Получить();
	Акция           = Константы.Акция.Получить();	
	АвтоЕвропа      = Константы.АвтоЕвропа.Получить(); 
	Резерв4			= Константы.Резерв4.Получить();
	
	
	Запрос.УстановитьПараметр("БазоваяценаМоскворечье" , Базовая);  
	Запрос.УстановитьПараметр("Скидка35"               , Скидка35);  
	Запрос.УстановитьПараметр("Скидка36" 			   , Скидка36);  
	Запрос.УстановитьПараметр("Скидка37" 			   , Скидка37); 
	Запрос.УстановитьПараметр("Скидка38" 			   , Скидка38);   
	Запрос.УстановитьПараметр("СпецЦена" 			   , СпецЦена);   
	Запрос.УстановитьПараметр("Акция" 				   , Акция);
	Запрос.УстановитьПараметр("АвтоЕвропа"  		   , АвтоЕвропа); 
	Запрос.УстановитьПараметр("Резерв4"				   , Резерв4);
	
	СписокТиповЦен = Новый СписокЗначений;	
	СписокТиповЦен.Добавить(Базовая);
	СписокТиповЦен.Добавить(Скидка35);
	СписокТиповЦен.Добавить(Скидка36);
	СписокТиповЦен.Добавить(Скидка37);
	СписокТиповЦен.Добавить(Скидка38);
	СписокТиповЦен.Добавить(СпецЦена);
	СписокТиповЦен.Добавить(Акция);
	СписокТиповЦен.Добавить(АвтоЕвропа); 
	СписокТиповЦен.Добавить(Резерв4);
	
	Запрос.УстановитьПараметр("СписокТиповЦен", 	СписокТиповЦен);
	Запрос.УстановитьПараметр("Ответственный",      Справочники.Пользователи.НайтиПоКоду("robot"));
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();  
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", 	Константы.ВидНоменклатурыПоУмолчанию.Получить());
	Запрос.УстановитьПараметр("Склад",   			Константы.ОсновнойСклад.Получить());      
	Запрос.УстановитьПараметр("ОрганизацияМК",		Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",		Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Запрос.УстановитьПараметр("GTINНоменклатур",	ПолучитьТаблицуGTINНоменклатур());
	//+Макрушин Е. 03.09.2026 #UT11-6041
	Запрос.УстановитьПараметр("СертификатыНоменклатуры",	ПолучитьТаблицуСертификатыНоменклатуры());
	//-Макрушин Е. 03.09.2026 #UT11-6041
	
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда  
		
		Путь        = ПолучитьИмяВременногоФайла("jsonl");
		ДатаСобытия = ТекущаяДата();
		
		СтруктураЗаголовка =  Новый Структура;
		СтруктураЗаголовка.Вставить("type"              , "header");
		СтруктураЗаголовка.Вставить("date"              , Формат(ДатаСобытия,"ДФ=dd.MM.yyyy ЧЧ:мм:сс"));
		СтруктураЗаголовка.Вставить("base"              , Ложь);
		СтруктураЗаголовка.Вставить("price_list_mdm_id" , Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста); 	
		
		МСКWEB.ЗаписатьРезультатЗапросаВJSONLines(Результат,Путь,СтруктураЗаголовка);
		
		ИмяФайлаПередать = СокрЛП(Константы.База.Получить())+"_"+Формат(ДатаСобытия,"ДФ=dd.MM.yyyy")+"_"+Формат(ДатаСобытия,"ДФ=ЧЧммсс")+".jsonl"; 
		
		СсылкаНаФайл = "";
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяS3Сервера, ?(ЗначениеЗаполнено(ПортS3Сервера),ПортS3Сервера,"21"), Константы.S3ВыгрузкаЦенЛогин.Получить(), Константы.S3ВыгрузкаЦенПароль.Получить(), , Истина ,); 
			Соединение.Записать(Путь, ?(ЗначениеЗаполнено(ЗаданаПапкаДляS3), ЗаданаПапкаДляS3 + "\", "") + ИмяФайлаПередать);
			
			СсылкаНаФайл = "http://"+СокрЛП(ИмяS3Сервера)+?(ЗначениеЗаполнено(ПортS3Сервера) , ":"+ПортS3Сервера ,"") + ?(ЗначениеЗаполнено(ЗаданаПапкаДляS3) , СтрЗаменить(ЗаданаПапкаДляS3,"\","/") + "/" , "")+ ИмяФайлаПередать;

			ЗаписьЖурналаРегистрации("Обновление цен портал", УровеньЖурналаРегистрации.Информация,,, 
			"Файл записан на FTP: " + ИмяS3Сервера + " в каталог: " + ЗаданаПапкаДляS3);
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Обновление цен портал", УровеньЖурналаРегистрации.Ошибка,,, 
			"Блокировки НЕ БЫЛО. Но запись данных на S3: " + ИмяS3Сервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки());
			
		КонецПопытки;
		
		УдалитьФайлы(Путь);
		
		Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда 
			
			НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
			НовоеСообщение.ОбменДанными.Загрузка = Истина;
			НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
			НовоеСообщение.Объект = "ПрайсЛист";
			НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
			
			ID = Новый УникальныйИдентификатор();     	
			НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
			
			СтруктураДокумента = Новый Структура;
			СтруктураДокумента.Вставить("link", СсылкаНаФайл);
			
			ЗаписьJSON          = Новый ЗаписьJSON();
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет , , Истина);
			
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
			ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
			JsonСтрока = ЗаписьJSON.Закрыть(); 	
			
			НовоеСообщение.Сообщение = JsonСтрока;
			
			Свойства = Новый СписокЗначений;
			Свойства.Добавить("ТипСодержимого" , "application/json"); 
			Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
			Свойства.Добавить("Тип"            , "price"); 
			Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
			Свойства.Добавить("РежимДоставки"  , 2);
			Свойства.Добавить("НомерСообщения" , Строка(ID));

			
			Заголовки = Новый СписокЗначений;
			Заголовки.Добавить("price_type_id"  , Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста);
			
			Для каждого Свойство Из Свойства Цикл
				
				НоваяСтрока = НовоеСообщение.Свойства.Добавить();
				НоваяСтрока.Наименование = Свойство.Значение;
				НоваяСтрока.Значение = Свойство.Представление;
				
			КонецЦикла;   	
			
			Если ЗначениеЗаполнено(Заголовки) Тогда
				
				Для каждого Заголовок Из Заголовки Цикл
					
					НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
					НоваяСтрока.Наименование = Заголовок.Значение;
					НоваяСтрока.Значение = Заголовок.Представление;
					
				КонецЦикла;   
				
			КонецЕсли;      
			
			НовоеСообщение.Записать();
			
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

Процедура ОбновлениеОстатковИЦен_Казань() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации("Обновление остатков и цен Казань", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ""+ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);	
	
	Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
	
	МассивВалют = Новый Массив;
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("978"));
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("643"));
	
	Текст = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Доп
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Номенклатура КАК Номенклатура,
	|	Т1.ОстатокКВыгрузке КАК ОстатокКВыгрузке_ДОП,
	|	ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0) КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА Т1.ОстатокКВыгрузке <= ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|			ТОГДА Т1.ОстатокКВыгрузке
	|		ИНАЧЕ ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_ИТОГ
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Доп КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеНулевыеСвободныеОстатки КАК Т2
	|		ПО Т1.Номенклатура = Т2.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки_ДОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.КодМДМ
	|ПОМЕСТИТЬ НоменклатураКВыгрузке
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.ОстатокКВыгрузке КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКВыгрузке.Номенклатура,
	|	ЕстьNULL(НоменклатураКВыгрузке.СвободныйОстаток,0) КАК СвободныйОстаток,
	|	ЦеныНоменклатурыСрезПоследних.Валюта,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Евро
	|				ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|							И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|							И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|						ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Цена,
	|	НоменклатураКВыгрузке.Артикул КАК Артикул,
	|	НоменклатураКВыгрузке.КодМДМ
	|ИЗ
	|	НоменклатураКВыгрузке КАК НоменклатураКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = &ТипЦен
	|					И Валюта В (&Валюта)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураКВыгрузке.Номенклатура
	|						ИЗ
	|							НоменклатураКВыгрузке КАК НоменклатураКВыгрузке)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураКВыгрузке.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Артикул";
	
	Запрос.УстановитьПараметр("Валюта", 		МассивВалют);
	Запрос.УстановитьПараметр("ТипЦен", 		Константы.БазоваяЦена.Получить()); 
	Запрос.УстановитьПараметр("Склад", 			Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМК",	Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",	Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	ДанныеПоОстаткамСтрока = "";
	
	Инд = 0;         
	
	Пока Выборка.Следующий() Цикл	
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
			Инд = 0;  
			ДанныеПоОстаткамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = Выборка.Артикул + Символы.Таб + СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, ""); 
		ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
	
	Сч = 0;
	Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
	КонецЦикла;
	
	ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "update.price");

	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "update.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "update.zip");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	
	
КонецПроцедуры

Процедура ОбновлениеОстатковИЦен() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ""+ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		//!!!???
		//Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", "ftp_price06", "OLAjkcBxPpc", ,Ложь);
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(),  Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;  	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
	
	МассивВалют = Новый Массив;
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("978"));
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("643"));
	
	Текст = Новый ТекстовыйДокумент;
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
	|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.КодМДМ
	|ПОМЕСТИТЬ НоменклатураКВыгрузке
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МосковскиеОстаткиНоменклатуры.Номенклатура,
	|		0
	|	ИЗ
	|		РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|	ГДЕ
	|		МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщика > 0
	|		И НЕ МосковскиеОстаткиНоменклатуры.Номенклатура В
	|					(ВЫБРАТЬ
	|						НеНулевыеСвободныеОстатки.Номенклатура
	|					ИЗ
	|						НеНулевыеСвободныеОстатки)) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКВыгрузке.Номенклатура,
	|	ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Евро
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	НоменклатураКВыгрузке.Артикул,
	|	НоменклатураКВыгрузке.КодМДМ
	|ИЗ
	|	НоменклатураКВыгрузке КАК НоменклатураКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = &ТипЦен
	|					И Валюта В (&Валюта)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураКВыгрузке.Номенклатура
	|						ИЗ
	|							НоменклатураКВыгрузке КАК НоменклатураКВыгрузке)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураКВыгрузке.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураКВыгрузке.Артикул"; 
	
	Запрос.УстановитьПараметр("Валюта", МассивВалют);
	Запрос.УстановитьПараметр("ТипЦен", Константы.БазоваяЦена.Получить()); // Базовая цена Москворечье 
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	ДанныеПоОстаткамСтрока = "";
	
	Инд = 0;         
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Артикул) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
			Инд = 0;  
			ДанныеПоОстаткамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = Выборка.Артикул + Символы.Таб + СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, ""); 
		ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
	
	Сч = 0;
	
	Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "update.price"); 
	
	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "update.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "update.zip");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	//  Удалить файлик блокировки	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	

КонецПроцедуры

Процедура ОбновлениеОстатковИЦенЕдиныйПрайсЛист() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков (единый прайс-лист)", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;  	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
	
	МассивВалют = Новый Массив;
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("978"));
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("643"));
	
	Текст = Новый ТекстовыйДокумент;
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) >= 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
	|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СправочникНоменклатура.Ссылка КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.КодМДМ
	|ПОМЕСТИТЬ НоменклатураКВыгрузке
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|			НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|		ИЗ
	|			НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ОборотСегодня.Номенклатура,
	|			0
	|		ИЗ
	|			ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ПО (Т.Номенклатура = СправочникНоменклатура.Ссылка)
	|ГДЕ
	|	НЕ СправочникНоменклатура.ЭтоГруппа
	|	И ВЫБОР
	|			КОГДА &ЭтоОбособленноеПодразделение
	|				ТОГДА НЕ СправочникНоменклатура.КодМДМ = """"
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА СправочникНоменклатура.ГруппаАВС.Наименование ПОДОБНО ""Z%""
	|					И ЕСТЬNULL(Т.СвободныйОстаток, 0) = 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СправочникНоменклатура.Артикул = """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МосковскиеОстаткиНоменклатуры.Номенклатура.Ссылка,
	|	0,
	|	МосковскиеОстаткиНоменклатуры.Номенклатура.Артикул,
	|	МосковскиеОстаткиНоменклатуры.Номенклатура.КодМДМ
	|ИЗ
	|	РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|ГДЕ
	|	НЕ МосковскиеОстаткиНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					НеНулевыеСвободныеОстатки.Номенклатура
	|				ИЗ
	|					НеНулевыеСвободныеОстатки)
	|	И МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщика > 0
	|	И НЕ МосковскиеОстаткиНоменклатуры.Номенклатура.Артикул = """"
	|	И НЕ МосковскиеОстаткиНоменклатуры.Номенклатура.КодМДМ = """"
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураКВыгрузке.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	НоменклатураКВыгрузке.Артикул КАК Артикул,
	|	НоменклатураКВыгрузке.КодМДМ,
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураКВыгрузке.Номенклатура.КратностьФилиала = 0
	|				И НЕ НоменклатураКВыгрузке.Номенклатура.КратностьФилиала = НоменклатураКВыгрузке.Номенклатура.Кратность
	|			ТОГДА НоменклатураКВыгрузке.Номенклатура.КратностьФилиала
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	НоменклатураКВыгрузке КАК НоменклатураКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен В (&СписокТиповЦен)
	|					И ТипЦен <> ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
	|					И Валюта В (&Валюта)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураКВыгрузке.Номенклатура
	|						ИЗ
	|							НоменклатураКВыгрузке КАК НоменклатураКВыгрузке)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураКВыгрузке.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураКВыгрузке.Номенклатура,
	|	НоменклатураКВыгрузке.Артикул,
	|	НоменклатураКВыгрузке.КодМДМ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураКВыгрузке.Номенклатура.КратностьФилиала = 0
	|				И НЕ НоменклатураКВыгрузке.Номенклатура.КратностьФилиала = НоменклатураКВыгрузке.Номенклатура.Кратность
	|			ТОГДА НоменклатураКВыгрузке.Номенклатура.КратностьФилиала
	|		ИНАЧЕ 0
	|	КОНЕЦ";
	
	
	Запрос.УстановитьПараметр("Валюта", МассивВалют);
	
	СписокТиповЦен = Новый СписокЗначений;
	СписокТиповЦен.Добавить(Константы.БазоваяЦена.Получить());
	СписокТиповЦен.Добавить(Константы.ЗакупочнаяЦена.Получить());
	СписокТиповЦен.Добавить(Константы.Скидка35.Получить());
	СписокТиповЦен.Добавить(Константы.Скидка36.Получить());
	СписокТиповЦен.Добавить(Константы.Скидка37.Получить());
	СписокТиповЦен.Добавить(Константы.Скидка38.Получить());
	СписокТиповЦен.Добавить(Константы.СпецЦена.Получить());
	СписокТиповЦен.Добавить(Константы.АДУрал.Получить());
	СписокТиповЦен.Добавить(Константы.Акция.Получить());
	СписокТиповЦен.Добавить(Константы.Уцененные.Получить());
	СписокТиповЦен.Добавить(Константы.Резерв4.Получить());
	СписокТиповЦен.Добавить(Константы.АвтоЕвропа.Получить());
	
	Запрос.УстановитьПараметр("СписокТиповЦен", СписокТиповЦен);
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
		
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЭтоОбособленноеПодразделение", МСК.ЭтоОбособленноеПодразделение() И НЕ Константы.База.Получить() = Перечисления.НазваниеБазы.Ростов);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	ДанныеПоОстаткамСтрока = "";
	
	Инд = 0;         
	
	Пока Выборка.Следующий() Цикл	
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
			Инд = 0;  
			ДанныеПоОстаткамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = Выборка.КодМДМ + Символы.Таб + СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")
		+ Символы.Таб + СокрЛП(?(Выборка.Кратность = 0 , "", Выборка.Кратность)); 
		ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
	
	Сч = 0;
	
	Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "updatev2.price");
	
	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "updatev2.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "updatev2.zip");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	

КонецПроцедуры

Процедура ОбновлениеОстатковИЦен_2() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(),  Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;	 
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
	
	МассивВалют = Новый Массив;
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("978"));
	МассивВалют.Добавить(Справочники.Валюты.НайтиПоКоду("643"));
	
	Текст = Новый ТекстовыйДокумент;
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Склад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.СвободныйОстаток КАК СвободныйОстатокСклад,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА Т1.СвободныйОстаток <= ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА Т1.СвободныйОстаток
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	Т1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Склад КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО Т1.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.КодМДМ
	|ПОМЕСТИТЬ НоменклатураКВыгрузке
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураКВыгрузке.Номенклатура,
	|	ЕСТЬNULL(НоменклатураКВыгрузке.СвободныйОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Евро
	|			ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * (КурсыВалютСрезПоследних.Курс * КурсЕвро.Кратность / (КурсЕвро.Курс * КурсыВалютСрезПоследних.Кратность))
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена,
	|	НоменклатураКВыгрузке.Артикул,
	|	НоменклатураКВыгрузке.КодМДМ
	|ИЗ
	|	НоменклатураКВыгрузке КАК НоменклатураКВыгрузке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				ТипЦен = &ТипЦен
	|					И Валюта В (&Валюта)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							НоменклатураКВыгрузке.Номенклатура
	|						ИЗ
	|							НоменклатураКВыгрузке КАК НоменклатураКВыгрузке)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО НоменклатураКВыгрузке.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) <> 0
	|	И НЕ (ВЫРАЗИТЬ(НоменклатураКВыгрузке.КодМДМ КАК СТРОКА(36))) = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураКВыгрузке.Артикул";
	
	Запрос.УстановитьПараметр("Валюта", МассивВалют);
	Запрос.УстановитьПараметр("ТипЦен", Константы.БазоваяЦена.Получить()); // Базовая цена Москворечье 
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	
	ДатаПерехода = Константы.ДатаНачалаЗагрузкиИВыгрузкиЦенВРублях.Получить();
	
	Если ЗначениеЗаполнено(ДатаПерехода) И ТекущаяДата() > ДатаПерехода Тогда 
		Запрос.УстановитьПараметр("Евро", Константы.ВалютаРегламентированногоУчета.Получить());
	Иначе
		Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Текст.ДобавитьСтроку(
		Выборка.Артикул + Символы.Таб +
		СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "") + Символы.Таб +
		СтрЗаменить(Выборка.Цена, Символы.НПП, "") + Символы.Таб +
		Выборка.КодМДМ);  
		
	КонецЦикла;
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "update.price");

	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "update.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "update.zip");		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Информация, , ,
		"Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	//  Удалить файлик блокировки	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	

КонецПроцедуры

Процедура ВыгрузкаЦенНоменклатурыДляОП() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Выгрузка цен номенклатуры для обособленных подразделений", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаЦенЛогин.Получить(),  Константы.FTPВыгрузкаЦенПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы("daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;
	
	ФайлКоннект = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	ФайлКоннект.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, "connect.lock");		
	
	Текст = Новый ТекстовыйДокумент;
	
	ЗапросДанныхПоЦенам = Новый Запрос;
	ЗапросДанныхПоЦенам.Текст =
	"ВЫБРАТЬ
	|	Константы.БазоваяЦена КАК ТипЦен
	|ПОМЕСТИТЬ ВТ_ТаблицаТиповЦен
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка35
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка36
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка37
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка38
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.СпецЦена
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.АДУрал
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Акция
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Уцененные
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Резерв4
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.АвтоЕвропа
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.ЗакупочнаяЦена
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТаблицаТиповЦен.ТипЦен
	|ПОМЕСТИТЬ ВТ_ТипыЦен
	|ИЗ
	|	ВТ_ТаблицаТиповЦен КАК ВТ_ТаблицаТиповЦен
	|ГДЕ
	|	НЕ ВТ_ТаблицаТиповЦен.ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	ВТ_ТипыЦен.ТипЦен
	|ПОМЕСТИТЬ ВТ_ТоварыИТипыЦен
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура,
	|	ВТ_ТипыЦен КАК ВТ_ТипыЦен
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|	И НЕ Номенклатура.КодМДМ = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ТоварыИТипыЦен КАК ВТ_ТоварыИТипыЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				(Номенклатура, ТипЦен) В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыИТипыЦен.Ссылка,
	|						ВТ_ТоварыИТипыЦен.ТипЦен
	|					ИЗ
	|						ВТ_ТоварыИТипыЦен)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ВТ_ТоварыИТипыЦен.Ссылка = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ВТ_ТоварыИТипыЦен.ТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""Ц_"" + ВТ_ТипыЦен.ТипЦен.Код КАК ТипЦен,
	|	ВТ_ТипыЦен.ТипЦен.КодМДМ КАК ТипЦенКодМДМ
	|ИЗ
	|	ВТ_ТипыЦен КАК ВТ_ТипыЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ТипыЦен.ТипЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура.КодМДМ КАК Номенклатура,
	|	МАКСИМУМ(ВТ_Итог.Номенклатура.КратностьФилиала) КАК КратностьФилиала,
	|	""Ц_"" + ВТ_Итог.ТипЦен.Код КАК ТипЦен,
	|	МАКСИМУМ(ВТ_Итог.Цена) КАК Цена
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	НЕ ВТ_Итог.Номенклатура ЕСТЬ NULL
	|	И НЕ ВТ_Итог.ТипЦен ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Итог.Номенклатура.КодМДМ,
	|	""Ц_"" + ВТ_Итог.ТипЦен.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ТипЦен
	|ИТОГИ
	|	МАКСИМУМ(КратностьФилиала),
	|	МАКСИМУМ(Цена)
	|ПО
	|	Номенклатура,
	|	ТипЦен";
	
	ЗапросДанныхПоЦенам.УстановитьПараметр("ВидНоменклатуры", Константы.ВидНоменклатурыПоУмолчанию.Получить());
	
	ПакетЗапроса = ЗапросДанныхПоЦенам.ВыполнитьПакет();
	
	ПакетТипыЦен = ПакетЗапроса[4].Выгрузить();
	ПакетТовары  = ПакетЗапроса[5]; 
	
	ТаблицаДанныхПоЦенам = Новый ТаблицаЗначений;
	ТаблицаДанныхПоЦенам.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(36)));
	ТаблицаДанныхПоЦенам.Колонки.Добавить("КратностьФилиала", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3, 0)));
	
	Для Каждого СтрокаТиповЦен Из ПакетТипыЦен Цикл
		 ТаблицаДанныхПоЦенам.Колонки.Добавить(СокрЛП(СтрокаТиповЦен.ТипЦен), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	КонецЦикла;
	
	ВыборкаНоменклатура = ПакетТовары.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл		
		
		ЕстьСтрокаСНоменклатурой                  = ТаблицаДанныхПоЦенам.Добавить();
		ЕстьСтрокаСНоменклатурой.Номенклатура     = ВыборкаНоменклатура.Номенклатура;
		ЕстьСтрокаСНоменклатурой.КратностьФилиала = ВыборкаНоменклатура.КратностьФилиала; 
		
		ВыборкаЦен = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЦен.Следующий() Цикл 			
			ЕстьСтрокаСНоменклатурой[ВыборкаЦен.ТипЦен] = ВыборкаЦен.Цена;
		КонецЦикла;
		
	КонецЦикла;
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	
	СтрокаЗаголовок = "Номенклатура" + Символы.Таб + "КратностьФилиала";
	
	Для Каждого СтрокаТиповЦен Из ПакетТипыЦен Цикл
        СтрокаЗаголовок = СтрокаЗаголовок + Символы.Таб + СокрЛП(СтрокаТиповЦен.ТипЦенКодМДМ); 
	КонецЦикла;
	
	МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(СтрокаЗаголовок);
	
	ДанныеПоЦенамСтрока = "";
	
	Инд = 0;         
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанныхПоЦенам Цикл	
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоЦенамСтрока);	
			Инд = 0;  
			ДанныеПоЦенамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = СокрЛП(СтрокаТаблицы.Номенклатура) + Символы.Таб + СтрЗаменить(СтрокаТаблицы.КратностьФилиала, Символы.НПП, "");
		
		Для Каждого СтрокаТиповЦен Из ПакетТипыЦен Цикл
			ВременнаяСтрока = ВременнаяСтрока + Символы.Таб + СтрЗаменить(СтрокаТаблицы[СтрокаТиповЦен.ТипЦен], Символы.НПП,""); 
		КонецЦикла;
		
		ДанныеПоЦенамСтрока = ДанныеПоЦенамСтрока + ?(Инд > 0, Символы.ПС, "")+ ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоЦенамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоЦенамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоЦенамСтрока = "";
	
	Сч = 0;
	
	Для Каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		
		ИтоговыеДанныеПоЦенамСтрока = ИтоговыеДанныеПоЦенамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИтоговыеДанныеПоЦенамСтрока = ИтоговыеДанныеПоЦенамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоЦенамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "PriceGF.txt");
	
	Попытка
		
		Соединение.Записать(ВременныйКаталог + "PriceGF.txt","PriceGF.txt");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	Соединение.Удалить("connect.lock");
	
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	
КонецПроцедуры

Процедура МанипуляцииСКатегорией(КатегорияАВС,Артикул)
	
	ЗаписатьБезУсловий = 0;
	
	Элемент = Справочники.АВСКлассификацияНоменклатуры.НайтиПоКоду(КатегорияАВС);
	
	Если Элемент = Справочники.АВСКлассификацияНоменклатуры.ПустаяСсылка() Тогда
		
		НовыйЭлемент = Справочники.АВСКлассификацияНоменклатуры.СоздатьЭлемент();
		НовыйЭлемент.Код =   КатегорияАВС ;
		НовыйЭлемент.Записать();
		ЗаписатьБезУсловий = 1;
		
	КонецЕсли;
	
	ЭлементНоменклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
	
	Если ЭлементНоменклатуры <> Справочники.Номенклатура.ПустаяСсылка() Тогда
		
		Если ЗаписатьБезУсловий = 1 Тогда 
			
			Об = ЭлементНоменклатуры.ПолучитьОбъект();
			Об.ГруппаАВС = НовыйЭлемент.Ссылка;
			Об.Записать();
			
		Иначе
			
			Если ЭлементНоменклатуры.ГруппаАВС <> Элемент Тогда 
				
				Об = ЭлементНоменклатуры.ПолучитьОбъект();
				Об.ГруппаАВС = Элемент;
				Об.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗапускОбработки_ОтправитьВМосквуРасходныеНакладные() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка документов в Москву", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	База = Константы.База.Получить();
	
	Если База = Перечисления.НазваниеБазы.Самара ИЛИ База = Перечисления.НазваниеБазы.Владимир 
	 ИЛИ База = Перечисления.НазваниеБазы.Рязань ИЛИ База = Перечисления.НазваниеБазы.Тула ИЛИ База = Перечисления.НазваниеБазы.Ярославль Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка документов в Москву", УровеньЖурналаРегистрации.Информация, , ,
		"Начата регламентная отправка документов в Москву");
		
		ОбработкаОтправки = Обработки.ОтправитьВМосквуРасходныеНакладные.Создать();
		
		НастройкиОтправки = Новый Структура;
		НастройкиОтправки.Вставить("РН", 					Истина);
		НастройкиОтправки.Вставить("ПКО", 					Истина);
		НастройкиОтправки.Вставить("РКО", 					Истина);
		НастройкиОтправки.Вставить("ВозвратыПокупателей", 	Истина);
		НастройкиОтправки.Вставить("Инвентаризация", 		Истина);
		НастройкиОтправки.Вставить("КорректировкаРеализации", Истина);
		НастройкиОтправки.Вставить("ВозвратПоставщику", 	Истина);
		НастройкиОтправки.Вставить("ПоступлениеТоваров", 	Истина);
		НастройкиОтправки.Вставить("ПоступлениеТоваровНеМоскворечье", 	Истина);
		НастройкиОтправки.Вставить("Списание", 				Истина);
		НастройкиОтправки.Вставить("Оприходование", 		Истина);
		НастройкиОтправки.Вставить("ПересортицаТоваров", 	Истина);
		НастройкиОтправки.Вставить("ТребованиеНакладная", 	Истина);
		НастройкиОтправки.Вставить("АвансовыйОтчет", 		Истина);
		НастройкиОтправки.Вставить("НачДата", 				ТекущаяДата());
		НастройкиОтправки.Вставить("КонДата", 				ТекущаяДата());
		НастройкиОтправки.Вставить("НастройкаОбмена", Справочники.бит_НастройкиОбменаСПорталом.Москворечье);
		НастройкиОтправки.Вставить("АдресПочтыВМоскве", "buh@moskvorechie.ru");  
		НастройкиОтправки.Вставить("ТипОтправки", "FTP"); 
		
		
		РезультатОтправки = ОбработкаОтправки.ЗапуститьВыгрузку(НастройкиОтправки);
		
		ЗаписьЖурналаРегистрации("Отправка документов в Москву", УровеньЖурналаРегистрации.Информация, , ,
		"Закончена регламентная отправка документов в Москву с результатом : "+РезультатОтправки);
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ЗапускОбработки_РассылкаПрайсЛистов() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Рассылка прайс-листов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Рассылка прайс-листов", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная рассылка прайс-листов");
	
	ОбработкаРассылки = Обработки.РассылкаПрайсЛиста.Создать();
	ОбработкаРассылки.НаДату = ТекущаяДата();
	ОбработкаРассылки.ВыполнитьОбработкуРегламент();
	
	ЗаписьЖурналаРегистрации("Рассылка прайс-листов", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная рассылка прайс-листов");

КонецПроцедуры

Процедура ЗапускОбработки_ПослатьВМосквуСверкуПоКонтрагентам() Экспорт
	
	Если НЕ МСК.ЭтоОбособленноеПодразделение() Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентное: Послать в Москву сверку по контрагентам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное: Послать в Москву сверку по контрагентам", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка в Москву сверок по контрагентам");
	
	ОбработкаРассылки = Обработки.ПослатьВМосквуСверкуПоКонтрагентам.Создать();
	ОбработкаРассылки.НастройкаОбмена = Справочники.бит_НастройкиОбменаСПорталом.Москворечье;
	ОбработкаРассылки.ВыполнитьОбмен(1);
	
	ЗаписьЖурналаРегистрации("Регламентное: Послать в Москву сверку по контрагентам", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка в Москву сверок по контрагентам");

КонецПроцедуры

Процедура ЗапускВАвтоматическомРежимеОбработки_СозданиеПриказовНасборку() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Автоматический запуск обработки Создать Документ Приказ На Сборку", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;                                   
		
	КонецЕсли;
	
	ОбработкаЗапуска = Обработки.СоздатьДокументыПриказНаСборку.Создать();
	ОбработкаЗапуска.КонтролироватьМинСуммуДоставки = Истина;
	ОбработкаЗапуска.ТипДоставки = Перечисления.СпособДоставки.НашаДоставка;
	ОбработкаЗапуска.НеПосылатьПисьмо = Ложь; 
	
	ОбработкаЗапуска.ВыполнитьИзРегламентногоЗадания();
	
КонецПроцедуры

Функция СоздатьНовыйДокументСборка(ТекСтр)
	
	ДокСборка 					= Документы.СборкаЗаказовПокупателя.СоздатьДокумент();
	ДокСборка.Контрагент 		= ТекСтр.Контрагент;
	ДокСборка.Грузополучатель 	= ТекСтр.Грузополучатель;
	ДокСборка.МаршрутДоставки 	= ?(ТекСтр.СпособДоставки = Перечисления.СпособДоставки.Самовывоз, Справочники.МаршрутыДоставки.ПустаяСсылка(), 
	                              ДокСборка.Грузополучатель.МаршрутДоставки);
	ДокСборка.Договор 			= ТекСтр.ДоговорКонтрагента;
	ДокСборка.СпособДоставки 	= ТекСтр.СпособДоставки;
	ДокСборка.Дата 				= ТекущаяДата();
	ДокСборка.ВремяНачалаСборки = ТекущаяДата();
	ДокСборка.ДатаДоставкиКлиенту = ТекущаяДата();
	ДокСборка.Организация 		= ТекСтр.ДоговорКонтрагента.Организация;
	
	Возврат ДокСборка;
	
КонецФункции 

Процедура ЗапускВАвтоматическомРежимеОбработки_КонтрольИОтправкаАктовСверкиВзаиморасчетов() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентное : Автоматическая рассылка актов сверок взаиморасчетов контрагентам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(1) КАК КоличествоРабочихДней
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	(РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДняРабочий
	|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДняПредпраздничный)
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачМесяца
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &НачТекущегоДня";
	
	Запрос.УстановитьПараметр("ВидДняРабочий",         Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ВидДняПредпраздничный", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	Запрос.УстановитьПараметр("НачМесяца", НачалоДня(НачалоМесяца(ТекущаяДата())));
	Запрос.УстановитьПараметр("НачТекущегоДня", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если  ВыборкаДетальныеЗаписи.КоличествоРабочихДней = 2 Тогда 
			
			ОбработкаЗапуска = Обработки.КонтрольИОтправкаАктовСверкиВзаиморасчетов.Создать();
			ДатаОтчета = НачалоДня(НачалоМесяца(ТекущаяДата())) - 1;
			
			Если НачалоДня(ТекущаяДата()) = НачалоДня(НачалоКвартала(ТекущаяДата())) Тогда 
				
				ОбработкаЗапуска.ДатаНачалаФормированияСверки = НачалоКвартала(ДатаОтчета);
				ОбработкаЗапуска.ДатаОкончанияФормированияСверки = КонецКвартала(ДатаОтчета);
				
			Иначе
				
				ОбработкаЗапуска.ДатаНачалаФормированияСверки = НачалоМесяца(ДатаОтчета);
				ОбработкаЗапуска.ДатаОкончанияФормированияСверки = КонецМесяца(ДатаОтчета);
				
			КонецЕсли;
			
			ОбработкаЗапуска.ВыполнитьСозданиеАктовиРазослатьСверку(ОбработкаЗапуска.ДатаНачалаФормированияСверки, ОбработкаЗапуска.ДатаОкончанияФормированияСверки);
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗапускОбработки_ОтправкаПродажОстатковПоKAYABA() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка остатков и продаж по KAYABA");
	
	ОбработкаОтправки = Обработки.ОтправкаПродажОстатковПоKAYABA.Создать();
	
	ОбработкаОтправки.НаFTP = Истина;
	ОбработкаОтправки.АдресFTP = "ftp.kyb-eurasia.net";
	ОбработкаОтправки.ПортFTP = "21";
	ОбработкаОтправки.ЛогинFTP = "moskvorechie";
	ОбработкаОтправки.ПарольFTP = "smxwTLkL";
	ОбработкаОтправки.ДатаВыгрузки = НачалоДня(НачалоДня(ТекущаяДата())-1);
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьВыгрузкуПродажПоKAYABA(ОбработкаОтправки.ДатаВыгрузки);
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Ошибка, , ,
		"Отправка продаж : "+РезультатОтправки);
	КонецЕсли;
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьВыгрузкуОстатковПоKAYABA(ОбработкаОтправки.ДатаВыгрузки);
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Ошибка, , ,
		"Отправка остатков: "+РезультатОтправки);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка остатков и продаж по KAYABA ");
	
КонецПроцедуры	

Процедура ЗапускОбработки_ОтправкаПродажОстатковПоMAHLE_И_KNECHT() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по MAHLE и NECHT", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Отправка остатков и продаж по MAHLE и NECHT", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка остатков и продаж по MAHLE и NECHT");
	
	ОбработкаОтправки = Обработки.ОтправкаПродажОстатковПоMAHLE_И_KNECHT.Создать();
	
	ОбработкаОтправки.НаFTP = Истина;
	ОбработкаОтправки.АдресFTP = "ftp.moskvorechie.ru";
	ОбработкаОтправки.ПортFTP = "21";
	ОбработкаОтправки.ЛогинFTP = "user_mahle";
	ОбработкаОтправки.ПарольFTP = "Mahle@M";
	ОбработкаОтправки.ДатаВыгрузки = НачалоДня(НачалоДня(ТекущаяДата()) - 1);
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьВыгрузкуПродажПоKAYABA(ОбработкаОтправки.ДатаВыгрузки);
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по KAYABA", УровеньЖурналаРегистрации.Ошибка, , ,
		"Отправка продаж : "+РезультатОтправки);
	КонецЕсли;
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьВыгрузкуОстатковПоKAYABA(ОбработкаОтправки.ДатаВыгрузки);
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка остатков и продаж по MAHLE и NECHT", УровеньЖурналаРегистрации.Ошибка, , ,
		"Отправка остатков: "+РезультатОтправки);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка остатков и продаж по MAHLE и NECHT", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка остатков и продаж по MAHLE и NECHT ");
	
КонецПроцедуры	

Процедура ЗапускОбработки_БанкИзМосквы() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка банка из Москвы", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Загрузка банка из Москвы", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная загрузка платежных пручений из Москвы");
	
	ОбработкаОтправки = Обработки.БанкИзМосквы.Создать();
	
	ОбработкаОтправки.Организация = Константы.ОсновнаяОрганизация.Получить();
	ОбработкаОтправки.ЗаполнятьРасшифровку = Истина;
	ОбработкаОтправки.НастройкаОбмена = Справочники.бит_НастройкиОбменаСПорталом.Москворечье;
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьЗагрузкуБанкаИзМосквы();
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Загрузка банка из Москвы", УровеньЖурналаРегистрации.Ошибка, , ,
		""+РезультатОтправки);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка банка из Москвы", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная загрузка платежных пручений из Москвы");
	
КонецПроцедуры	

Процедура ЗапускОбработки_БанкИзМосквы_Модифицированный() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка банка из Москвы (с договором из Москвы)", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Загрузка банка из Москвы (с договором из Москвы)", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная загрузка платежных пручений из Москвы");
	
	ОбработкаОтправки = Обработки.БанкИзМосквы_СДоговоромИзМосквы.Создать();
	
	ОбработкаОтправки.Организация = Константы.ОсновнаяОрганизация.Получить();
	ОбработкаОтправки.ЗаполнятьРасшифровку = Истина;
	ОбработкаОтправки.НастройкаОбмена = Справочники.бит_НастройкиОбменаСПорталом.Москворечье;
	
	РезультатОтправки = ОбработкаОтправки.ВыполнитьЗагрузкуБанкаИзМосквы();
	
	Если РезультатОтправки <> "" Тогда 
		ЗаписьЖурналаРегистрации("Загрузка банка из Москвы ", УровеньЖурналаРегистрации.Ошибка, , ,
		"" + РезультатОтправки);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка банка из Москвы (с договором из Москвы)", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная загрузка платежных пручений из Москвы");
	
КонецПроцедуры	

Процедура ОтправкаЗаказовСтороннимСкладам() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка заказов сторонним складам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Отправка заказов сторонним складам", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное создание закадов по сторонним складам и отправка их в Аварду");
	
	ОбработкаОтправки = Обработки.СозданиеИОтправкаЗаказовСтороннимСкладам.Создать();
	
	ОбработкаОтправки.ДатаОтбора = ТекущаяДата();
	
	Результат = ОбработкаОтправки.ВыполнитьДействия(Истина);
	
	Если Результат <> "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка заказов сторонним складам", УровеньЖурналаРегистрации.Ошибка, , ,
		"" + Результат);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов сторонним складам", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное создание закадов по сторонним складам и отправка их в Аварду");
	
КонецПроцедуры	

Процедура ЗаполнитьИнвентариныеНомера() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Заполнить инвентарные номера", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Подключение = Неопределено;
	RS = Неопределено;
	Подключение = Новый COMObject("ADODB.Connection");	
	
	Если РаботаСАвардой.Соединение(Подключение) Тогда 
		
		ДатаНТ = ПолучитьДату(ТекущаяДата() - 30*24*60*60*12*10);
		ДатаКТ = ПолучитьДату(КонецГода(ТекущаяДата()));
		Запросadd = "Select INV,ARTICLE,PROIZV From ({call RA_GET_TOV_FOR_ORA(null,null,null,null,'" + ДатаНТ + "','" + ДатаКТ + "',null,null,null,null,null,null)})";
		РСТ = РаботаСАвардой.СформироватьЗапрос(Запросadd,Подключение);
		
		//Подключение.CommitTrans();
		Если РСТ = Неопределено Тогда
			ЗаписьЖурналаРегистрации("Обновление инвентарных номеров", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка обновления номенклатуры " + Запросadd);
		Иначе	
			
			ПромТаблица = Новый ТаблицаЗначений;
			ОписаниеТиповСтрока = новый ОписаниеТипов("строка", Новый квалификаторыстроки(80, ДопустимаяДлина.Переменная));
			ПромТаблица.Очистить();
			
			Для Счетчик = 1 По РСТ.Fields.Count Цикл
				
				Поле = РСТ.Fields.Item(Счетчик - 1);
				Колонка = ПромТаблица.Колонки.Добавить(Поле.Name, ОписаниеТиповСтрока, Поле.Name);
				
			КонецЦикла;
			
			Пока РСТ.EOF() = 0 Цикл		
				
				НоваяСтрока = ПромТаблица.Добавить();           		
				
				Для Счетчик = 1 По РСТ.Fields.Count Цикл 
					
					Поле = РСТ.Fields.Item(Счетчик - 1);
					НоваяСтрока[Поле.Name] = Поле.Value;			
					
				КонецЦикла;    		
				
				РСТ.MoveNext(); 		
				
			КонецЦикла;
			
			РСТ.Close(); 			
			РСТ = Неопределено;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка
			|ПОМЕСТИТЬ Ном
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Артикул = """"
			|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	TOV.Inv КАК Инв,
			|	TOV.Proizv,
			|	TOV.Article
			|ПОМЕСТИТЬ Тов
			|ИЗ
			|	&TOV КАК TOV
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Ном.Ссылка,
			|	Тов.Инв,
			|	Тов.Proizv,
			|	Тов.Article,
			|	Ном.Ссылка.Родитель.Наименование,
			|	Ном.Ссылка.Артикул
			|ИЗ
			|	Ном КАК Ном
			|		ЛЕВОЕ СОЕДИНЕНИЕ Тов КАК Тов
			|		ПО Ном.Ссылка.КодПроизводителя = Тов.Article
			|			И Ном.Ссылка.Родитель.Наименование = Тов.Proizv";
			
			Запрос.УстановитьПараметр("TOV", ПромТаблица);
			Запрос.УстановитьПараметр("ВидНоменклатуры", Константы.ВидНоменклатурыПоУмолчанию.Получить());

			Выб = Запрос.Выполнить().Выбрать();
			
			Пока Выб.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выб.Инв) тогда
					Спр = Выб.Ссылка.ПолучитьОбъект();
					Спр.Артикул = Выб.Инв;
					Спр.КодПоБазеМоскоречье = Выб.Инв;
					
					Попытка
						Спр.Записать();
					Исключение
						ЗаписьЖурналаРегистрации("Обновление инвентарных номеров", УровеньЖурналаРегистрации.Ошибка,,, 
						"Ошибка обновления номенклатуры " + Выб.Ссылка.НаименованиеПолное);
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДату(Дата) 
	
	Возврат Формат(Дата, "ДЛФ=Д");  
	
КонецФункции

Процедура ЗапускРегламентногоЗаданияПоЗакрытиюЗаказовПоставщикам() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ДатаНачалаОбработки = НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1));
	ДатаОкончанияОбработки = КонецДня(ТекущаяДата());
	
	ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное закрытие документов 'Заказ поставщику' с " + ДатаНачалаОбработки + " по " + ДатаОкончанияОбработки + "");
	
	ОбработкаЗапуска = Обработки.ЗакрытиеЗаказовПоставщикам_Регламент.Создать();
	
	ОбработкаЗапуска.ДатаНачала = ДатаНачалаОбработки;
	ОбработкаЗапуска.ДатаОкончания = ДатаОкончанияОбработки;
	
	ОбработкаЗапуска.ВыполнитьРаботу();
	
	ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное закрытие документов 'Заказ поставщику' с " + ДатаНачалаОбработки + " по " + ДатаОкончанияОбработки + "");
	
КонецПроцедуры	

Процедура ЗагрузкаДанныхИзАварды() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка данных из аварды", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка данных из аварды", УровеньЖурналаРегистрации.Информация, , ,
	"Начало загрузки данных из аварды");
	
	ОбработкаЗапуска = Обработки.ЗагрузкаДанныхИзАварды.Создать();
	ОбработкаЗапуска.ВыполнитьРаботу();
	
	ЗаписьЖурналаРегистрации("Загрузка данных из аварды", УровеньЖурналаРегистрации.Информация, , ,
	"Окончание загрузки данных из аварды");
	
КонецПроцедуры

Процедура ПеренестиНоменклатуруСНулевымиОстаткамиИзУценки() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Перенос номенклатуры из уценки", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Перенос номенклатуры из уценки", УровеньЖурналаРегистрации.Информация, , ,
	"Начат регламентный перенос номенклатуры с нулевыми остатками из уценки");
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() И 
		ЗначениеЗаполнено(Константы.ГруппаНоменклатурыУценка.Получить()) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.ПредыдущийРодитель
		|ПОМЕСТИТЬ НоменклатураУценка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка В ИЕРАРХИИ (&Уценка)
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ПредыдущийРодитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураУценка.Ссылка,
		|	НоменклатураУценка.ПредыдущийРодитель
		|ИЗ
		|	НоменклатураУценка КАК НоменклатураУценка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							НоменклатураУценка.Ссылка
		|						ИЗ
		|							НоменклатураУценка КАК НоменклатураУценка)
		|					И Склад = &ОсновнойСклад) КАК ТоварыНаСкладахОстатки
		|		ПО НоменклатураУценка.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) = 0";
		
		Запрос.УстановитьПараметр("ОсновнойСклад", Константы.ОсновнойСклад.Получить());
		Запрос.УстановитьПараметр("Уценка", Константы.ГруппаНоменклатурыУценка.Получить());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ТекОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ТекОбъект.Родитель = ВыборкаДетальныеЗаписи.ПредыдущийРодитель;
			ТекОбъект.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Перенос номенклатуры из уценки", УровеньЖурналаРегистрации.Информация, , ,
	"Закончен регламентный перенос номенклатуры с нулевыми остатками из уценки");
	
КонецПроцедуры

Процедура ПроведениеКлеверенс() Экспорт  
	
	
КонецПроцедуры

Процедура ФормированиеИОтправкаЕжедневногоОтчета() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка ежедневного отчета", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Отправка ежедневного отчета", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка ежедневного отчета на " + ТекущаяДата() + "");
	
	ОбработкаЗапуска = Обработки.ЕжедневныйОтчет.Создать();
	ОбработкаЗапуска.СформироватьОтчет(Истина);
	
	ЗаписьЖурналаРегистрации("Отправка ежедневного отчета", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка ежедневного отчета на " + ТекущаяДата() + "");
	
КонецПроцедуры

Процедура ЗапускРегламентногоЗаданияПоОтправкеОтчета_ДневнойОтчет() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка дневного отчета", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ДатаОтчета = ТекущаяДата();
	
	ЗаписьЖурналаРегистрации("Отправка дневного отчета", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка отчета 'Дневной отчет' на " + ДатаОтчета + "");
	
	ОбработкаЗапуска = Отчеты.ДневнойОтчет.Создать();
	ОбработкаЗапуска.ДатаОтчета = ДатаОтчета;
	ОбработкаЗапуска.ВыполнитьРаботу();
	
	ЗаписьЖурналаРегистрации("Отправка ежедневного отчета", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка отчета 'Дневной отчет' на " + ДатаОтчета + "");
	
КонецПроцедуры

Процедура ОтправкаЗаказовЭкспресс() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.ОтправлятьЭкспрессАвтоматически.Получить() тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное создание закадов Экспресс и отправка их в Аварду");
	
	НовыйОтчет = Отчеты.АнализЗаказовПокупателей.Создать();
	НовыйОтчет.УстановитьНачальныеНастройки_Сервер(); 
	
	//ПоОсновномуПоставщику,Форма,IDСклада,ЗапущеноРегламентом,РекламнаяПродукция,СкладскиеЗаказы,ПоСкладамИсключениям,РежимГорючиеЖидкости(0 не фильтруем , 
	//1 не горючие жидкости , 2 горючие жидкости) 
	НовыйОтчет.ЗаказПоставщику(Истина, Неопределено, , Истина,       , Ложь   ,Ложь, 1); // По негорючим жидкостям
	НовыйОтчет.ЗаказПоставщику(Истина, Неопределено, , Истина,       , Ложь   ,Ложь, 2); // по горючим жидкостям
	НовыйОтчет.ЗаказПоставщику(Истина, Неопределено, , Истина, 		 , Истина ,Ложь);   // по складам исключениям
	НовыйОтчет.ЗаказПоставщику(Истина, Неопределено, , Истина, Истина,        ,Ложь);   // Создание заказов по рекламной номенклатуре
    
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен = ИСТИНА
	|	И ЗаказПоставщику.Экспресс = ИСТИНА
	|	И ЗаказПоставщику.IDСклада = &IDСклада
	|	И ЗаказПоставщику.ГУИДЗаказаПокупателя = """"
	|	И ЗаказПоставщику.КодОтправкиАварда = """"
	|	И ЗаказПоставщику.Контрагент = &ОсновнойПоставщик
	|	И ЗаказПоставщику.IDСкладаСобственныйСклад = &IDСкладаСобственныйСклад";   
	
	Запрос.УстановитьПараметр("IDСкладаСобственныйСклад", Справочники.СобственныеСклады.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 300);
	Запрос.УстановитьПараметр("IDСклада", Справочники.СторонниеСклады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ОсновнойПоставщик",Константы.ОсновнойПоставщик.Получить()); 
	
	Выб = Запрос.Выполнить().Выбрать();   
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);
	КонецЦикла;                      
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));	
	
	Выб = Запрос.Выполнить().Выбрать();    
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);
	КонецЦикла;               
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));	 
	Выб = Запрос.Выполнить().Выбрать();        
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);
	КонецЦикла;
	
	Если ТекущаяДата() - Константы.ВремяПоследнейОтправкиВАварду.Получить() > 3600 тогда     
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВремяОтправкиЭкспрессаВремена.Время КАК Время
		|ИЗ
		|	Справочник.ВремяОтправкиЭкспресса.Времена КАК ВремяОтправкиЭкспрессаВремена
		|
		|УПОРЯДОЧИТЬ ПО
		|	Время";       
		
		Выб = Запрос.Выполнить().Выбрать();
		Отправлять = Ложь;
		Откл = Константы.ДопустимоеОтклонениеОтВремениОтправки.Получить(); 
		
		Пока Выб.Следующий() Цикл       
			
			Время = Дата(Формат(ТекущаяДата(), "ДФ=""ггггММдд""") + Формат(Выб.Время, "ДФ=""ЧЧммсс"""));
			
			Если ТекущаяДата() > Время - Откл * 60 И ТекущаяДата() < Время + Откл * 60 тогда
				
				Отправлять = Истина;
				Прервать;
				
			КонецЕсли;     
			
		КонецЦикла;        
		
		Если Отправлять Тогда 
			
			Запрос = Новый запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ЗаказПоставщику.Ссылка
			|ИЗ
			|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
			|ГДЕ
			|	ЗаказПоставщику.Дата >= &Дата
			|	И ЗаказПоставщику.Проведен = ИСТИНА
			|	И ЗаказПоставщику.Экспресс = ИСТИНА
			|	И ЗаказПоставщику.IDСклада = &IDСклада
			|	И ПОДСТРОКА(ЗаказПоставщику.КодОтправкиАварда, 0, 3) = ""ЗПп""
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗаказПоставщику.Дата УБЫВ";   
			
			Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("IDСклада", Справочники.СторонниеСклады.ПустаяСсылка());
			
			Выб = Запрос.Выполнить().Выбрать();
			СписОтправленных = Новый СписокЗначений;
			
			Пока Выб.Следующий() Цикл
				
				Если СписОтправленных.НайтиПоЗначению(Выб.Ссылка.IDАварда) = Неопределено тогда
					
					РаботаСАвардой.ОтправитьЗаказВРаботу(Выб.Ссылка);
					СписОтправленных.Добавить(Выб.Ссылка.IDАварда);
					Константы.ВремяПоследнейОтправкиВАварду.Установить(ТекущаяДата());
					
				КонецЕсли;
				
			Конеццикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное создание закадов Экспресс и отправка их в Аварду");
	
КонецПроцедуры

Процедура ОтправкаЗаказовЭкспрессПоОтдельнымСкладам() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда    
		
		ЗаписьЖурналаРегистрации("Отправка заказов Экспресс (по отдельным складам)", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;    
		
	КонецЕсли;   
	
	Если Не Константы.ОтправлятьЭкспрессАвтоматически.Получить() тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс (по отдельным складам)", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное создание закадов Экспресс (по отдельным складам) и их отправка");   	
	
	НовыйОтчет = Отчеты.АнализЗаказовПокупателей.Создать();
	НовыйОтчет.УстановитьНачальныеНастройки_Сервер();   	
	НовыйОтчет.ЗаказПоставщику(Истина, Неопределено, , Истина, ,Ложь  , Истина);
	
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен = ИСТИНА
	|	И ЗаказПоставщику.Экспресс = ИСТИНА
	|	И ЗаказПоставщику.IDСклада = &IDСклада
	|	И ЗаказПоставщику.ГУИДЗаказаПокупателя = """"
	|	И ЗаказПоставщику.КодОтправкиАварда = """"
	|	И НЕ ЗаказПоставщику.IDСкладаСобственныйСклад = &IDСкладаСобственныйСклад";   
	
	Запрос.УстановитьПараметр("IDСкладаСобственныйСклад", Справочники.СобственныеСклады.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 300);
	Запрос.УстановитьПараметр("IDСклада", Справочники.СторонниеСклады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ОсновнойПоставщик", Константы.ОсновнойПоставщик.Получить());  
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));	 
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс (по отдельным складам)", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное создание закадов Экспресс (по отдельным складам)  и их отправка");   
	
КонецПроцедуры

Процедура ОтправкаЗаказовПоставщикамПремиальнаяПерекупка() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда    
		
		ЗаписьЖурналаРегистрации("Отправка заказов Экспресс (по отдельным складам)", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;    
		
	КонецЕсли;   
	
	ЗаписьЖурналаРегистрации("Отправка Заказов поставщику Премиальная перекупка", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное задание Отправка Заказов поставщику Премиальная перекупка");   	
	
	Запрос = Новый запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен = ИСТИНА
	|	И НЕ ЗаказПоставщику.IDСклада = &IDСклада
	|	И ЗаказПоставщику.ГУИДЗаказаПокупателя = """"
	|	И ЗаказПоставщику.КодОтправкиАварда = """"
	|	И ЗаказПоставщику.ПремиальнаяПерекупка";   
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 300);
	Запрос.УстановитьПараметр("IDСклада", Справочники.СторонниеСклады.ПустаяСсылка());
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВАвардуПострочно(Выб.Ссылка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));	 
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВАвардуПострочно(Выб.Ссылка);
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Отправка Заказов поставщику Премиальная перекупка", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное задание Отправка Заказов поставщику Премиальная перекупка");   
	
КонецПроцедуры

Процедура ЗаполнениеРеквизитовВШтрихкодахМаркировки() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда    
		
		ЗаписьЖурналаРегистрации("Заполнение реквизитов в щтрихкодах маркировки", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;    
		
	КонецЕсли;
	
	Маркировка.ЗаполнениеРеквизитовВШтрихкодахМаркировки();
	
КонецПроцедуры

Процедура АвтоматическоеСозданиеСборкиНаСамовывоз() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Автоматическое создание сборок на самовывоз", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Если Константы.АвтоматическиОтправлятьНаСборкуЗаказыНаСамовывоз.Получить() тогда
		
		ОбработкаЗапуска = Обработки.СоздатьДокументыПриказНаСборку.Создать();
		ОбработкаЗапуска.КонтролироватьМинСуммуДоставки = Истина;
		ОбработкаЗапуска.ТипДоставки = Перечисления.СпособДоставки.Самовывоз;
		ОбработкаЗапуска.НеПосылатьПисьмо = Ложь; 
		
		ОбработкаЗапуска.ВыполнитьИзРегламентногоЗадания();
		
	КонецЕсли;

КонецПроцедуры

Процедура ФинальнаяОтправкаЗаказов() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	Если Не Константы.ОтправлятьЭкспрессАвтоматически.Получить() тогда
		Возврат;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное задание по отправке заказов Экспресс на сборку в Аварде");
	
	
	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен = ИСТИНА
	|	И ЗаказПоставщику.Экспресс = ИСТИНА
	|	И ЗаказПоставщику.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И ПОДСТРОКА(ЗаказПоставщику.КодОтправкиАварда, 0, 3) = ""ЗПп""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Т КАК Т
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	
	Выб = Запрос.Выполнить().Выбрать();
	СписОтправленных = Новый СписокЗначений;
	
	Пока Выб.Следующий() Цикл
		
		Если СписОтправленных.НайтиПоЗначению(Выб.Ссылка.IDАварда) = Неопределено тогда
			
			РаботаСАвардой.ОтправитьЗаказВРаботу(Выб.Ссылка);
			СписОтправленных.Добавить(Выб.Ссылка.IDАварда);
			Константы.ВремяПоследнейОтправкиВАварду.Установить(ТекущаяДата());
			
		КонецЕсли;
		
	Конеццикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен = ИСТИНА
	|	И ЗаказПоставщику.Экспресс = ИСТИНА
	|	И ЗаказПоставщику.КодОтправкиАварда = """"
	|	И НЕ ЗаказПоставщику.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	Т КАК Т
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл		
		
		РаботаСАвардой.ОтправитьЗаказВАвардуПострочно(Выб.Ссылка);
		Константы.ВремяПоследнейОтправкиВАварду.Установить(ТекущаяДата());
		
	Конеццикла;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Экспресс", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное задание по отправке заказов Экспресс на сборку в Аварде");
	
КонецПроцедуры

Процедура ФинальнаяОтправкаЗаказовПополнение() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
	ЗаписьЖурналаРегистрации("Отправка заказов Пополнение", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов Пополнение", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное задание по отправке заказов Пополнение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ПОМЕСТИТЬ Т
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &Дата
	|	И ЗаказПоставщику.Проведен
	|	И НЕ ЗаказПоставщику.Экспресс
	|	И ЗаказПоставщику.КодОтправкиАварда = """"
	|	И ЗаказПоставщику.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И ЗаказПоставщику.СтатусЗаказаПоставщику = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.ПустаяСсылка)
	|	И ЗаказПоставщику.Контрагент В (&МассивКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Ссылка
	|ИЗ
	|	Т КАК Т
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Ссылка.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));  
	
	МассивКонтрагентов = Новый Массив; 
	
	ОсновнойПоставщик = Константы.ОсновнойПоставщик.Получить();
	Если ЗначениеЗаполнено(ОсновнойПоставщик) Тогда
		МассивКонтрагентов.Добавить(ОсновнойПоставщик);
	КонецЕсли;
	
	ДопПоставщик = Константы.ДопПоставщик.Получить();
	Если ЗначениеЗаполнено(ДопПоставщик) Тогда
		МассивКонтрагентов.Добавить(ДопПоставщик);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивКонтрагентов", МассивКонтрагентов);
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Пока Выб.Следующий() Цикл
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Выб.Ссылка);					
	Конеццикла; 
	
	ЗаписьЖурналаРегистрации("Отправка заказов Пополнение", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное задание по отправке заказов Пополнение");
	
КонецПроцедуры 

Процедура ИмпортСтатусовЗаказаПоставщикуИзAVARDA() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка данных из аварды", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Загрузка статусов заказа поставщику из Avarda", УровеньЖурналаРегистрации.Информация, , ,
	"Начало загрузки статусов из аварды");
	
	ОбработкаЗапуска = Обработки.ИмпортСтатусаЗаказаПоставщикаИзAvarda.Создать();
	
	ДатаНачала = Дата("00010101");
	ДатаОкончания = Дата("00010101");
	ОбработкаЗапуска.ИмпортСтатусовЗаказаПоставщикуИзAVARDA(ДатаНачала, ДатаОкончания);
	
	ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Информация, , ,
	"Окончание загрузки статусов из аварды");
	
КонецПроцедуры

Процедура ОтправитьСчетаНаПредоплатуПоЗаказам() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправить счета на предоплату по заказам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ДатаНачалаКонстанты = Константы.ДатаНачалаОтправкиСчетовНаОплатуПоЗаказам.Получить();   
	
	Если Не ЗначениеЗаполнено(ДатаНачалаКонстанты) Тогда
		Возврат;
	КонецЕсли;    
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	ПользовательДляОтправки = Неопределено;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		Для каждого Доступ Из УчетнаяЗапись.ДоступКУчетнойЗаписи Цикл
			
			Если Доступ.Администрирование Тогда
				
				ПользовательДляОтправки = Доступ.Пользователь;	
				Прервать;
				
			КонецЕсли; 			
			
		КонецЦикла;    		
		
	КонецЕсли;
	
	Если ПользовательДляОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка КАК Заказ,
	|	ЗаказПокупателя.Грузополучатель КАК Грузополучатель
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.СчетНаПредоплатуОтправленКлиенту))
	|			И ЗаказПокупателя.Ссылка = КатегорииОбъектов.Объект
	|ГДЕ ЗаказПокупателя.Грузополучатель.ОтправлятьСчетНаПредоплату
	|	И КатегорииОбъектов.Объект ЕСТЬ NULL
	|	И ЗаказПокупателя.Дата >= &ДатаНачалаКонстанты
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателя.Грузополучатель,
	|	ЗаказПокупателя.Ссылка
	|ИТОГИ ПО
	|	Грузополучатель,
	|	Заказ";
	
	Запрос.УстановитьПараметр("ДатаНачалаКонстанты", ДатаНачалаКонстанты);
	
	СоответствиеЭлектронныхПисем = Новый Соответствие; 	
	
	ГлобальныйМассивДокументов = Новый Массив;
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Грузополучатель");
	
	Пока ВыборкаКонтрагент.Следующий() Цикл 
		
		МассивТабличныхДокументов = Новый Массив;
		
		ОбъединятьСчетаНаПредоплату = ВыборкаКонтрагент.Грузополучатель.ОбъединятьСчетаНаПредоплату; 
		
		Почта = МСК.ПолучитьЭлектронныйАдрес(ВыборкаКонтрагент.Грузополучатель);
		
		Если Не ЗначениеЗаполнено(Почта) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивДокументов = Новый Массив;
		
		ВыборкаЗаказ = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Заказ");
		
		Пока ВыборкаЗаказ.Следующий() Цикл
			
			МассивДокументов.Добавить(ВыборкаЗаказ.Заказ);
			ГлобальныйМассивДокументов.Добавить(ВыборкаЗаказ.Заказ);
			
			Если НЕ ОбъединятьСчетаНаПредоплату Тогда  
				
				ВременныйМассивДокументов = Новый Массив;
				ВременныйМассивДокументов.Добавить(ВыборкаЗаказ.Заказ);
				
				ТабДокумент = ПечатьСчетаЗаказаКорректировки("Счет", ВременныйМассивДокументов);
				ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
				ТабДокумент.АвтоМасштаб = Истина;
				МассивТабличныхДокументов.Добавить(ТабДокумент); 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОбъединятьСчетаНаПредоплату Тогда
			
			ТабДокумент = ПечатьСчетаЗаказаКорректировки("Счет", МассивДокументов);
			ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
			ТабДокумент.АвтоМасштаб = Истина;
			МассивТабличныхДокументов.Добавить(ТабДокумент);
			
		КонецЕсли;
		
		Если МассивТабличныхДокументов.Количество() > 0 Тогда
			СформироватьПисьмаПоДокументам(МассивТабличныхДокументов, МассивДокументов, СоответствиеЭлектронныхПисем, Почта, УчетнаяЗапись, ПользовательДляОтправки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СоответствиеЭлектронныхПисем.Количество() > 0 Тогда
		
		УправлениеЭлектроннойПочтой.ОтправитьПисьма(СоответствиеЭлектронныхПисем, глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПользовательДляОтправки);		
		
		Для каждого Док Из ГлобальныйМассивДокументов Цикл
			
			НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Док);
			НаборЗаписей.Отбор.Категория.Установить(Справочники.КатегорииОбъектов.СчетНаПредоплатуОтправленКлиенту);
			
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = Док;
			Запись.Категория = Справочники.КатегорииОбъектов.СчетНаПредоплатуОтправленКлиенту;   			
			
			Попытка        				
				НаборЗаписей.Записать();			
			Исключение
			КонецПопытки 
			
		КонецЦикла;  
		
	КонецЕсли;
	
КонецПроцедуры 

Процедура СформироватьПисьмаПоДокументам(МассивТабличныхДокументов, МассивДокументов, СоответствиеЭлектронныхПисем, Почта, УчетнаяЗапись, ПользовательДляОтправки)
	
	Адрес = Почта;
	
	СтруктураНовогоПисьма = Новый Структура;
	
	СписокФайловВложений = Новый СписокЗначений;
	
	Инд = 0;
	
	Для каждого ТабДокумент ИЗ МассивТабличныхДокументов Цикл
		
		ИмяФайлаВложения = ОбщегоНазначения.СформироватьЗаголовокДокумента(МассивДокументов[Инд], "Счет на оплату");
		
		ФайлВФорматеPDF = ПолучитьИмяВременногоФайла();
		ТабДокумент.Записать(ФайлВФорматеPDF, ТипФайлаТабличногоДокумента.PDF);
		СписокФайловВложений.Добавить(Новый Структура("Хранилище, ИмяФайла, Наименование", ПолучитьДвоичныеДанные(ФайлВФорматеPDF), (ИмяФайлаВложения + ".PDF"), ИмяФайлаВложения));
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	СтруктураНовогоПисьма.Вставить("СписокФайловВложений", СписокФайловВложений);
	
	СписокКому = Новый СписокЗначений;
	МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Адрес, ";");
	
	Для каждого ТекАдрес Из МассивАдресов Цикл
		СписокКому.Добавить(ТекАдрес); 
	КонецЦикла;

	СтруктураНовогоПисьма.Вставить("Кому", СписокКому);
	СтруктураНовогоПисьма.Вставить("Тело"     , "");
	СтруктураНовогоПисьма.Вставить("ВидТекста", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
	СтруктураНовогоПисьма.Вставить("Тема"     , "Счет на оплату"); 
	
	СтруктураПисьма = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательДляОтправки, СтруктураНовогоПисьма,,,,,,, Ложь);
	
	Если ТипЗнч(СтруктураПисьма) = Тип("Структура") Тогда
		СоответствиеЭлектронныхПисем.Вставить(СтруктураПисьма.ПисьмоСсылка);
	КонецЕсли;      
	
КонецПроцедуры

Функция ПолучитьДвоичныеДанные(ИмяФайла)
	
	Файл = Новый Файл(ИмяФайла);
	
	Если Файл.Существует() Тогда
		
		Данные = Новый ДвоичныеДанные(ИмяФайла);
		
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение
		КонецПопытки; 
		
		Возврат Данные;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
КонецФункции

Функция ПечатьСчетаЗаказаКорректировки(Тип, МассивДокументов) 
	
	Если МассивДокументов.Количество() > 0 Тогда
		ТекущийДокумент = МассивДокументов[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());  
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Номер,
	|	ЗаказПокупателя.Дата,
	|	ЗаказПокупателя.ДоговорКонтрагента,
	|	ЗаказПокупателя.Организация,
	|	ЗаказПокупателя.Контрагент КАК Получатель,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.Грузоотправитель = &ПустойКонтрагент
	|			ТОГДА ЗаказПокупателя.Организация
	|		ИНАЧЕ ЗаказПокупателя.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ЗаказПокупателя.Грузополучатель = &ПустойКонтрагент
	|			ТОГДА ЗаказПокупателя.Контрагент
	|		ИНАЧЕ ЗаказПокупателя.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ЗаказПокупателя.Организация КАК Руководители,
	|	ЗаказПокупателя.Организация КАК Поставщик,
	|	ЗаказПокупателя.СуммаДокумента,
	|	ЗаказПокупателя.ВалютаДокумента,
	|	ЗаказПокупателя.УчитыватьНДС,
	|	ЗаказПокупателя.СуммаВключаетНДС,
	|	ЗаказПокупателя.СтруктурнаяЕдиница,
	|	ЗаказПокупателя.Ответственный,
	|	ЗаказПокупателя.ДоговорКонтрагента.Номер,
	|	ЗаказПокупателя.ДоговорКонтрагента.Дата
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПокупателя_СчетЗаказ";
	
	СтрокаВыборкиПоляСодержания = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ЗаказПокупателя");
	СтрокаВыборкиКорректировкиПоляСодержания = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("КорректировкаЗаказаПокупателя");
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.НомерТЧ,
	|	Минимум(ВложенныйЗапрос.ПризнакКорректировка) 	КАК ПризнакКорректировка,
	|	Минимум(ВложенныйЗапрос.НомерСтроки) 			КАК НомерСтроки,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура.Артикул            КАК Артикул,
	|	ВложенныйЗапрос.Номенклатура.Код                КАК Код,
	|	СУММА(ВложенныйЗапрос.Количество)               КАК КоличествоТовара,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление  КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки 
	|	+ ВложенныйЗапрос.ПроцентАвтоматическихСкидок   КАК Скидка,
	|	СУММА(ВложенныйЗапрос.СуммаНДС)                 КАК СуммаНДС,
	|	ВложенныйЗапрос.Цена                            КАК Цена,
	|	СУММА(ВложенныйЗапрос.Сумма)                    КАК Сумма,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры      КАК Характеристика,
	|	NULL                                            КАК Серия
	|ИЗ
	|
	|(
	|ВЫБРАТЬ
	|		ЗаказПокупателя.Номенклатура                КАК Номенклатура,
	|		ВЫРАЗИТЬ (ЗаказПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
	|		ЗаказПокупателя.ЕдиницаИзмерения            КАК ЕдиницаИзмерения,
	|		ЗаказПокупателя.Цена                        КАК Цена,
	|		ЗаказПокупателя.ПроцентСкидкиНаценки        КАК ПроцентСкидкиНаценки,
	|		ЗаказПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|		ЗаказПокупателя.ХарактеристикаНоменклатуры  КАК ХарактеристикаНоменклатуры,
	|		ЗаказПокупателя.СуммаНДС                    КАК СуммаНДС,
	|		ЗаказПокупателя.Сумма                       КАК Сумма,
	|		ЗаказПокупателя.Количество                  КАК Количество,
	|		(1)                                         КАК НомерТЧ,
	|		(0)                                         КАК ПризнакКорректировка,
	|		ЗаказПокупателя.НомерСтроки 				КАК НомерСтроки
	|	ИЗ
	|		Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателя
	|
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		КорректировкаЗаказаПокупателя.Номенклатура               КАК Номенклатура,
	|		ВЫРАЗИТЬ (КорректировкаЗаказаПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
	|		КорректировкаЗаказаПокупателя.ЕдиницаИзмерения           КАК ЕдиницаИзмерения,
	|		КорректировкаЗаказаПокупателя.Цена                       КАК Цена,
	|		КорректировкаЗаказаПокупателя.ПроцентСкидкиНаценки       КАК ПроцентСкидкиНаценки,
	|		КорректировкаЗаказаПокупателя.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	|		КорректировкаЗаказаПокупателя.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|		КорректировкаЗаказаПокупателя.СуммаНДС                   КАК СуммаНДС,
	|		КорректировкаЗаказаПокупателя.Сумма                      КАК Сумма,
	|		КорректировкаЗаказаПокупателя.Количество                 КАК Количество,
	|	   (1)                                                       КАК НомерТЧ,
	|		(1)                                         			 КАК ПризнакКорректировка,
	|		КорректировкаЗаказаПокупателя.НомерСтроки				 КАК НомерСтроки
	|	ИЗ
	|		Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателя
	|
	|	ГДЕ
	|		КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя В (&МассивДокументов)
	|		И КорректировкаЗаказаПокупателя.Ссылка.Проведен      = Истина
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		ЗаказПокупателя.Номенклатура                         КАК Номенклатура,
	|		" + СтрокаВыборкиПоляСодержания + "                  КАК НаименованиеПолное,
	|		ЗаказПокупателя.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|		ЗаказПокупателя.Цена                                 КАК Цена,
	|		ЗаказПокупателя.ПроцентСкидкиНаценки                 КАК ПроцентСкидкиНаценки,
	|		ЗаказПокупателя.ПроцентАвтоматическихСкидок          КАК ПроцентАвтоматическихСкидок,
	|		NULL                                                 КАК ХарактеристикаНоменклатуры,
	|		ЗаказПокупателя.СуммаНДС                             КАК СуммаНДС,
	|		ЗаказПокупателя.Сумма                                КАК Сумма,
	|		ЗаказПокупателя.Количество                           КАК Количество,
	|		(2)                                                  КАК НомерТЧ,
	|		(0)                                         		 КАК ПризнакКорректировка,
	|		ЗаказПокупателя.НомерСтроки 						 КАК НомерСтроки
	|	ИЗ
	|		Документ.ЗаказПокупателя.Услуги КАК ЗаказПокупателя
	|
	|	ГДЕ
	|		ЗаказПокупателя.Ссылка В (&МассивДокументов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|		КорректировкаЗаказаПокупателя.Номенклатура                         КАК Номенклатура,
	|" + СтрокаВыборкиКорректировкиПоляСодержания + "						   КАК НаименованиеПолное,
	|		КорректировкаЗаказаПокупателя.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|		КорректировкаЗаказаПокупателя.Цена                                 КАК Цена,
	|		КорректировкаЗаказаПокупателя.ПроцентСкидкиНаценки                 КАК ПроцентСкидкиНаценки,
	|		КорректировкаЗаказаПокупателя.ПроцентАвтоматическихСкидок          КАК ПроцентАвтоматическихСкидок,
	|		NULL                                                               КАК ХарактеристикаНоменклатуры,
	|		КорректировкаЗаказаПокупателя.СуммаНДС                             КАК СуммаНДС,
	|		КорректировкаЗаказаПокупателя.Сумма                                КАК Сумма,
	|		КорректировкаЗаказаПокупателя.Количество                           КАК Количество,
	|		(2)                                                                КАК НомерТЧ,
	|		(1)                                         					   КАК ПризнакКорректировка,
	|		КорректировкаЗаказаПокупателя.НомерСтроки				 		   КАК НомерСтроки
	|	ИЗ
	|		Документ.КорректировкаЗаказаПокупателя.Услуги КАК КорректировкаЗаказаПокупателя
	|
	|	ГДЕ
	|		КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя В (&МассивДокументов)
	|		И КорректировкаЗаказаПокупателя.Ссылка.Проведен      = Истина
	|";
	
	Если Тип <> "Счет" Тогда 
		
		ТекстЗапроса = ТекстЗапроса +
		" 
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|		ЗаказПокупателя.Номенклатура                КАК Номенклатура,
		|		ВЫРАЗИТЬ (ЗаказПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
		|		ЗаказПокупателя.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|		ЗаказПокупателя.Цена                        КАК Цена,
		|		0									        КАК ПроцентСкидкиНаценки,
		|		0 											КАК ПроцентАвтоматическихСкидок,
		|		NULL 										КАК ХарактеристикаНоменклатуры,
		|		0						                    КАК СуммаНДС,
		|		ЗаказПокупателя.Сумма                       КАК Сумма,
		|		ЗаказПокупателя.Количество                  КАК Количество,
		|		(3)                                         КАК НомерТЧ,
		|		(0)                                         КАК ПризнакКорректировка,
		|		ЗаказПокупателя.НомерСтроки 				КАК НомерСтроки
		|	ИЗ
		|		Документ.ЗаказПокупателя.ВозвратнаяТара КАК ЗаказПокупателя
		|
		|	ГДЕ
		|		ЗаказПокупателя.Ссылка В (&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|		КорректировкаЗаказаПокупателя.Номенклатура               КАК Номенклатура,
		|		ВЫРАЗИТЬ (КорректировкаЗаказаПокупателя.Номенклатура.НаименованиеПолное КАК Строка(1000)) КАК НаименованиеПолное,
		|		КорректировкаЗаказаПокупателя.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		|		КорректировкаЗаказаПокупателя.Цена                       КАК Цена,
		|		0														 КАК ПроцентСкидкиНаценки,
		|		0														 КАК ПроцентАвтоматическихСкидок,
		|		NULL 													 КАК ХарактеристикаНоменклатуры,
		|		0														 КАК СуммаНДС,
		|		КорректировкаЗаказаПокупателя.Сумма                      КАК Сумма,
		|		КорректировкаЗаказаПокупателя.Количество                 КАК Количество,
		|	   (3)                                                       КАК НомерТЧ,
		|		(1)                                         			 КАК ПризнакКорректировка,
		|		КорректировкаЗаказаПокупателя.НомерСтроки				 КАК НомерСтроки
		|	ИЗ
		|		Документ.КорректировкаЗаказаПокупателя.ВозвратнаяТара КАК КорректировкаЗаказаПокупателя
		|
		|	ГДЕ
		|		КорректировкаЗаказаПокупателя.Ссылка.ЗаказПокупателя В (&МассивДокументов)
		|		И КорректировкаЗаказаПокупателя.Ссылка.Проведен      = Истина
		|";
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса +
	"
	|) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НомерТЧ,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки,
	|	ВложенныйЗапрос.ПроцентАвтоматическихСкидок,
	|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.НаименованиеПолное
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.НомерТЧ, ПризнакКорректировка, НомерСтроки
	|";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.Текст = ТекстЗапроса;
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
	
	Если Тип = "Счет" Тогда
		Макет = ПолучитьОбщийМакет("СчетЗаказНаПредоплату");
	КонецЕсли;
	
	// Выводим шапку накладной
	
	СтруктурнаяЕдиница = Шапка.СтруктурнаяЕдиница;
	Ответственный = Шапка.Ответственный;
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата);
	
	Если Тип = "Счет" Тогда     
		
		ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
		ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП; 
		
		Если ТипЗнч(СтруктурнаяЕдиница) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			
			Банк       = СтруктурнаяЕдиница.Банк;
			БИК        = Банк.Код;
			КоррСчет   = Банк.КоррСчет;
			ГородБанка = Банк.Город;
			НомерСчета = СтруктурнаяЕдиница.НомерСчета;
			
			ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
			ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
			ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
			ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
			ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
			ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
			ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
			ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = СтруктурнаяЕдиница.ТекстКорреспондента;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения) Тогда
			ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование, ");
		КонецЕсли;
		
		ОбластьМакета.Параметры.НазначениеПлатежа = "За автозапчасти по договору №" + Шапка.ДоговорКонтрагентаНомер + " от " 
		                        + Формат(Шапка.ДоговорКонтрагентаДата , "ДФ=dd.MM.yyyy") + "г (согласно счета)";
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	
	Если Тип = "Счет" Тогда
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
	Иначе
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Заказ покупателя");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если Тип = "Счет" Тогда
		ОбластьМакета.Параметры.ТекстПоставщик = "Поставщик:";
	Иначе
		ОбластьМакета.Параметры.ТекстПоставщик = "Исполнитель:"
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), 
	                                  "ПолноеНаименование, ИНН,КПП,ЮридическийАдрес,Телефоны, ");
	ТабДокумент.Вывести(ОбластьМакета);
	
	СведенияОПолучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	Если Тип = "Счет" Тогда
		ОбластьМакета.Параметры.ТекстПокупатель = "Покупатель:";
	Иначе
		ОбластьМакета.Параметры.ТекстПокупатель = "Заказчик:"
	КонецЕсли;
	
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), 
	                                  "ПолноеНаименование, ИНН,КПП,ЮридическийАдрес,Телефоны, ");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ЕстьСкидки = Ложь;
	
	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
		
		Если ЗначениеЗаполнено(ВыборкаСтрокТовары.Скидка) Тогда
			
			ЕстьСкидки = Истина;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	ВыводитьКоды = Ложь;
	Колонка = "Артикул";
	
	ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("ШапкаТаблицы|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
	ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
	
	Если Не ВыводитьКоды И ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезКодов");
	ИначеЕсли НЕ ЕстьСкидки И ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезСкидок");
	ИначеЕсли НЕ ЕстьСкидки И НЕ ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("ШапкаТаблицы|ТоварБезКодовИСкидок");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьНомера);
	
	Если ВыводитьКоды Тогда
		
		ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
		ТабДокумент.Присоединить(ОбластьКодов);
		
	КонецЕсли;
	
	ОбластьТовар.Параметры.Товар = "Товары (работы, услуги)";
	ТабДокумент.Присоединить(ОбластьТовар);
	ТабДокумент.Присоединить(ОбластьДанных);
	
	Если ЕстьСкидки Тогда
		ТабДокумент.Присоединить(ОбластьСкидок);
	КонецЕсли;
	
	ТабДокумент.Присоединить(ОбластьСуммы);
	
	ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Строка|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Строка|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
	
	ОбластьТовар = Макет.ПолучитьОбласть("Строка|Товар");
	
	Если Не ВыводитьКоды И ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезКодов");
	ИначеЕсли НЕ ЕстьСкидки И ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезСкидок");
	ИначеЕсли НЕ ЕстьСкидки И НЕ ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Строка|ТоварБезКодовИСкидок");
	КонецЕсли;
	
	Сумма    = 0;
	СуммаНДС = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;
	НумераторСтрок = 0;
	
	Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
		
		Если ВыборкаСтрокТовары.КоличествоТовара = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
			
			Сообщить("В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.", СтатусСообщения.Важное);
			Продолжить;
			
		КонецЕсли;
		
		НумераторСтрок = НумераторСтрок + 1;
		ОбластьНомера.Параметры.НомерСтроки = НумераторСтрок;
		ТабДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			
			Если Колонка = "Артикул" Тогда
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
			Иначе
				ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
			КонецЕсли;
			
			ТабДокумент.Присоединить(ОбластьКодов);
			
		КонецЕсли;
		
		ОбластьТовар.Параметры.Товар = СокрП(ВыборкаСтрокТовары.НаименованиеПолное) + ФормированиеПечатныхФорм.ПредставлениеСерий(ВыборкаСтрокТовары)
		+ ?(ВыборкаСтрокТовары.НомерТЧ = 3, " (возвратная тара)", "");
		ТабДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
		ОбластьДанных.Параметры.Количество = ВыборкаСтрокТовары.КоличествоТовара;
		ТабДокумент.Присоединить(ОбластьДанных);
		
		Скидка = Ценообразование.ПолучитьСуммуСкидки(ВыборкаСтрокТовары.Сумма, ВыборкаСтрокТовары.Скидка);
		
		Если ЕстьСкидки Тогда
			
			ОбластьСкидок.Параметры.Скидка         = Скидка;
			ОбластьСкидок.Параметры.СуммаБезСкидки = ВыборкаСтрокТовары.Сумма + Скидка;
			ТабДокумент.Присоединить(ОбластьСкидок);
			
		КонецЕсли;
		
		ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		Сумма          = Сумма       + ВыборкаСтрокТовары.Сумма;
		СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
		ВсегоСкидок    = ВсегоСкидок + Скидка;
		ВсегоБезСкидок = Сумма       + ВсегоСкидок;
		
	КонецЦикла;
	
	// Вывести Итого
	ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
	ОбластьКодов  = Макет.ПолучитьОбласть("Итого|КолонкаКодов");
	ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
	ОбластьСкидок = Макет.ПолучитьОбласть("Итого|Скидка");
	ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
	
	ОбластьТовар = Макет.ПолучитьОбласть("Итого|Товар");
	
	Если Не ВыводитьКоды И ЕстьСкидки Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезКодов");
	ИначеЕсли НЕ ЕстьСкидки И ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезСкидок");
	ИначеЕсли НЕ ЕстьСкидки И НЕ ВыводитьКоды Тогда
		ОбластьТовар = Макет.ПолучитьОбласть("Итого|ТоварБезКодовИСкидок");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьНомера);
	
	Если ВыводитьКоды Тогда
		ТабДокумент.Присоединить(ОбластьКодов);
	КонецЕсли;
	
	ТабДокумент.Присоединить(ОбластьТовар);
	ТабДокумент.Присоединить(ОбластьДанных);
	
	Если ЕстьСкидки Тогда
		
		ОбластьСкидок.Параметры.ВсегоСкидок    = ВсегоСкидок;
		ОбластьСкидок.Параметры.ВсегоБезСкидок = ВсегоБезСкидок;
		ТабДокумент.Присоединить(ОбластьСкидок);
		
	КонецЕсли;
	
	ОбластьСуммы.Параметры.Всего = ОбщегоНазначения.ФорматСумм(Сумма);
	ТабДокумент.Присоединить(ОбластьСуммы);
	
	// Вывести ИтогоНДС
	Если Шапка.УчитыватьНДС И ЗапросТовары.Количество()>0 Тогда
		
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("ИтогоНДС|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
		ОбластьСкидок = Макет.ПолучитьОбласть("ИтогоНДС|Скидка");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
		
		ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|Товар");
		
		Если Не ВыводитьКоды И ЕстьСкидки Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезКодов");
		ИначеЕсли НЕ ЕстьСкидки И ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезСкидок");
		ИначеЕсли НЕ ЕстьСкидки И НЕ ВыводитьКоды Тогда
			ОбластьТовар = Макет.ПолучитьОбласть("ИтогоНДС|ТоварБезКодовИСкидок");
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		
		ОбластьТовар.Параметры.Заполнить(ВыборкаСтрокТовары);
		ТабДокумент.Присоединить(ОбластьТовар);
		//+Марков И. 14.01.2026 #UT10-5631
		Если ТекущийДокумент.Дата > Дата(2026,1,1, 0,0,0) Тогда
			ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В т.ч. НДС (22%):", "Сумма НДС:");
		//-Марков И. 14.01.2026 #UT10-5631
		ИначеЕсли ТекущийДокумент.Дата > Дата(2019,1,1, 0,0,0) Тогда
			ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В т.ч. НДС (20%):", "Сумма НДС:");
		Иначе			
			ОбластьДанных.Параметры.НДС = ?(Шапка.СуммаВключаетНДС, "В т.ч. НДС (18%):", "Сумма НДС:");
		КонецЕсли;
		
		ТабДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки Тогда
			ТабДокумент.Присоединить(ОбластьСкидок);
		КонецЕсли;
		
		ОбластьСуммы.Параметры.ВсегоНДС = ОбщегоНазначения.ФорматСумм(ЗапросТовары.Итог("СуммаНДС"));
		ТабДокумент.Присоединить(ОбластьСуммы);
		
		Если Тип = "Счет" Тогда  
			
			ОбластьНомера = Макет.ПолучитьОбласть("ВсегоКОплате|НомерСтроки");
			ОбластьКодов  = Макет.ПолучитьОбласть("ВсегоКОплате|КолонкаКодов");
			ОбластьДанных = Макет.ПолучитьОбласть("ВсегоКОплате|Данные");
			ОбластьСкидок = Макет.ПолучитьОбласть("ВсегоКОплате|Скидка");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ВсегоКОплате|Сумма");
			
			ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|Товар");
			
			Если Не ВыводитьКоды И ЕстьСкидки Тогда
				ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезКодов");
			ИначеЕсли НЕ ЕстьСкидки И ВыводитьКоды Тогда
				ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезСкидок");
			ИначеЕсли НЕ ЕстьСкидки И НЕ ВыводитьКоды Тогда
				ОбластьТовар = Макет.ПолучитьОбласть("ВсегоКОплате|ТоварБезКодовИСкидок");
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли; 
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабДокумент.Присоединить(ОбластьТовар);
			ТабДокумент.Присоединить(ОбластьДанных);
			
			Если ЕстьСкидки Тогда
				ТабДокумент.Присоединить(ОбластьСкидок);
			КонецЕсли;
			
			ОбластьСуммы.Параметры.ВсегоКОплате = ОбщегоНазначения.ФорматСумм(Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС));
			ТабДокумент.Присоединить(ОбластьСуммы);
			
		КонецЕсли; 
		
	КонецЕсли;
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + НумераторСтрок
	+ ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
	
	// Вывести подписи
	Если Тип = "Счет" Тогда 
		
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
		
		Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.Дата,);
		Руководитель = Руководители.Руководитель;
		ДолжностьРуководителя = Руководители.РуководительДолжность;
		Бухгалтер    = Руководители.ГлавныйБухгалтер;
		
		ОбластьМакета.Параметры.ФИОРуководителя  		= Руководитель;
		ОбластьМакета.Параметры.ФИОБухгалтера    		= Бухгалтер;
		
		Если НЕ ЗначениеЗаполнено(Ответственный.ФизЛицо) Тогда
			ФИООтветственный = Ответственный.Наименование;
		Иначе
			
			ФамилияИмяОтчествоФизЛица      	 = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Ответственный.ФизЛицо, Шапка.Дата);
			ФамилияИмяОтчествоОтветственного = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
			ФИООтветственный         		 = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоОтветственного);
			
		КонецЕсли;
		
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалЗаказа");
	КонецЕсли; 
	
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьСчетаЗаказаКорректировки()

Процедура ИзменитьСтавкуНДСУНоменклатуры() Экспорт 
	
	Если ТекущаяДата() < '20260101' Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Изменить ставку НДС у номенклатуры", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное :Изменить ставку НДС у Номенклатуры", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!Изменить ставку НДС у Номенклатуры");
	
	ОбработкаРассылки = Обработки.ИзменитьСтавкуНДСУНоменклатуры.Создать();
	ОбработкаРассылки.ВнестиИзменения();
	
	ЗаписьЖурналаРегистрации("Регламентное :Изменить ставку НДС у Номенклатуры", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!Изменить ставку НДС у Номенклатуры");

КонецПроцедуры

Процедура ПослатьДолгиКонтрагентам() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Послать долги контрагентам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное :Послать долги контрагентам", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!Послать долги контрагентам");
	
	ОбработкаРассылки = Обработки.ПослатьПисьмаПоДокументамКОтправке.Создать();
	ОбработкаРассылки.ОтправкаПисем();
	
	ЗаписьЖурналаРегистрации("Регламентное :Послать долги контрагентам", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!Послать долги контрагентам");

КонецПроцедуры

Процедура ИзменитьРеквизитСтатусВДокументахЗаявкаНаВозврат() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Согласование заявок на возврат", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное :Изменить реквизит в документе ""Задание на возврат""", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!");
	
	ОбработкаРассылки = Обработки.СогласованиеЗаявокНаВозврат.Создать();
	ОбработкаРассылки.ОбработкаДокументов_ЗаявкаНаВозврат();
	
	ЗаписьЖурналаРегистрации("Регламентное :Изменить реквизит в документе ""Задание на возврат""", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!");

КонецПроцедуры

Процедура КорректировкаСобранныхСборок() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Корректировка собранных сборок", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное :Корректировка собранных сборок", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!");
	
	ОбработкаЗадания = Обработки.КорректировкаСобранныхСборок.Создать();
	ОбработкаЗадания.КорректировкаСобранныхСборок();
	
	ЗаписьЖурналаРегистрации("Регламентное :Корректировка собранных сборок", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!");
	
КонецПроцедуры

Процедура УстановкаЦенНоменклатурыСебестоимость() Экспорт    
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Установка цен номенклатуры себестоимость", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	КоличествоСтрокВДокументе = 25000;
	УдалятьПредыдущиеДокументы = Истина;
	Ответственный = Справочники.Пользователи.НайтиПоКоду("webadmin");
	
	//Удаление предыдущих перенесем после загрузки
	МассивТиповЦен =  Новый Массив;
	
	ЦенаСебестоимость = Константы.ЦенаСебестоимость.Получить();
	
	Если Не ЗначениеЗаполнено(ЦенаСебестоимость) Или Не ЗначениеЗаполнено(Ответственный) Тогда
		Возврат;
	КонецЕсли;	
	
	МассивТиповЦен.Добавить(ЦенаСебестоимость);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());  
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	СУММА(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток, 0)) КАК ОстатокТОХ,
	|	СУММА(ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 0) * ТоварыОтветственногоХраненияОстатки.КоличествоОстаток) КАК СуммаТОХ,
	|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток КАК ОстатокДляЦены
	|ПОМЕСТИТЬ ВТ_ОстаткиТОХ
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(, ) КАК ТоварыОтветственногоХраненияОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(, ) КАК ТоварыОтветственногоХраненияПереданныеОстатки
	|		ПО ТоварыОтветственногоХраненияОстатки.Номенклатура = ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура
	|			И ТоварыОтветственногоХраненияОстатки.ХарактеристикаНоменклатуры = ТоварыОтветственногоХраненияПереданныеОстатки.ХарактеристикаНоменклатуры
	|			И ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента = ТоварыОтветственногоХраненияПереданныеОстатки.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(, ) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|		ПО ТоварыОтветственногоХраненияОстатки.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|			И ТоварыОтветственногоХраненияОстатки.ДоговорКонтрагента.ТипЦен = ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен
	|ГДЕ
	|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток, 0) > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
	|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстаткиТОХ.ОстатокТОХ, 0)) КАК ОстатокНаСкладе
	|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ВТ_ОстаткиТОХ.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_ОстаткиТОХ.ОстатокТОХ, 0) > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваровНаСкладахОстатки.Номенклатура,
	|	ПартииТоваровНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	СУММА(ПартииТоваровНаСкладахОстатки.СтоимостьОстаток) КАК СтоимостьОстаток,
	|	СУММА(ПартииТоваровНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПоПартиям
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ОстаткиНаСкладах.Номенклатура
	|					ИЗ
	|						ВТ_ОстаткиНаСкладах КАК ОстаткиНаСкладах)) КАК ПартииТоваровНаСкладахОстатки
	|ГДЕ
	|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0
	|	И ПартииТоваровНаСкладахОстатки.СтоимостьОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваровНаСкладахОстатки.Номенклатура,
	|	ПартииТоваровНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОстаткиПоПартиям.Номенклатура,
	|	ВТ_ОстаткиПоПартиям.СтоимостьОстаток / ВТ_ОстаткиПоПартиям.КоличествоОстаток КАК ЦенаПоПартиям
	|ПОМЕСТИТЬ ВТ_ЦеныПоПартиям
	|ИЗ
	|	ВТ_ОстаткиПоПартиям КАК ВТ_ОстаткиПоПартиям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОстаткиНаСкладах.Номенклатура,
	|	СУММА(ВТ_ОстаткиНаСкладах.ОстатокНаСкладе) КАК Остаток,
	|	СУММА(ВТ_ОстаткиНаСкладах.ОстатокНаСкладе * ВТ_ЦеныПоПартиям.ЦенаПоПартиям) КАК Сумма
	|ПОМЕСТИТЬ ВТ_ОстаткиСкладИТОХ
	|ИЗ
	|	ВТ_ОстаткиНаСкладах КАК ВТ_ОстаткиНаСкладах
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоПартиям КАК ВТ_ЦеныПоПартиям
	|		ПО ВТ_ОстаткиНаСкладах.Номенклатура = ВТ_ЦеныПоПартиям.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиНаСкладах.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ОстаткиТОХ.Номенклатура,
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиТОХ.ОстатокДляЦены, 0)),
	|	СУММА(ЕСТЬNULL(ВТ_ОстаткиТОХ.СуммаТОХ, 0))
	|ИЗ
	|	ВТ_ОстаткиТОХ КАК ВТ_ОстаткиТОХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиТОХ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ОстаткиСкладИТОХ.Номенклатура,
	|	СУММА(ВТ_ОстаткиСкладИТОХ.Сумма) КАК Сумма,
	|	СУММА(ВТ_ОстаткиСкладИТОХ.Остаток) КАК Остаток
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ОстаткиСкладИТОХ КАК ВТ_ОстаткиСкладИТОХ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОстаткиСкладИТОХ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура,
	|	ВТ_Итог.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
	|	ВЫРАЗИТЬ(ВТ_Итог.Сумма / ВТ_Итог.Остаток КАК ЧИСЛО(15, 2)) КАК Цена
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ 
	|	ВТ_Итог.Остаток > 0
	|	И ВТ_Итог.Сумма / ВТ_Итог.Остаток > 0";
	
	РезЗапроса = Запрос.Выполнить();
	
	ТаблицаЦен = РезЗапроса.Выгрузить();
	
	//Создание документов Цен
	ДатаНачалаУдаления = ТекущаяДата() - 1;
	МаксимальнаяДатаДокумента = КонецДня(ТекущаяДата());
	ВалютаРубль = Константы.ВалютаРегламентированногоУчета.Получить();
	
	НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен,Ответственный,МаксимальнаяДатаДокумента);
	СчетчикСтрокВДокументе = 0;
	
	Для Каждого ТекСтр Из ТаблицаЦен Цикл
		
		Для Сч = 0 По МассивТиповЦен.Количество() - 1 Цикл			
			
			НоваяСтрокаДокумента 						= НовыйДокумент.Товары.Добавить();
			НоваяСтрокаДокумента.Номенклатура 			= ТекСтр.Номенклатура;
			НоваяСтрокаДокумента.ЕдиницаИзмерения  		= ТекСтр.ЕдиницаХраненияОстатков;
			НоваяСтрокаДокумента.Цена 					= ТекСтр.Цена;
			ТекТипЦен									= МассивТиповЦен[Сч];
			НоваяСтрокаДокумента.ТипЦен 				= ТекТипЦен ;
			НоваяСтрокаДокумента.Валюта 		    	= ВалютаРубль;
			НоваяСтрокаДокумента.ИндексСтрокиТаблицыЦен = ТаблицаЦен.Индекс(ТекСтр);
			
			СчетчикСтрокВДокументе = СчетчикСтрокВДокументе + 1;			
			
		КонецЦикла;
		
		Если СчетчикСтрокВДокументе >= КоличествоСтрокВДокументе Тогда
			
			Попытка
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				НовыйДокумент.Записать();
				УдалятьПредыдущиеДокументы = Ложь;
				
			КонецПопытки;
			
			НовыйДокумент = СоздатьНовыйДокументЦен(МассивТиповЦен, Ответственный,МаксимальнаяДатаДокумента);
			СчетчикСтрокВДокументе = 0;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если НовыйДокумент.Товары.Количество()> 0 Тогда
		
		Попытка
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			НовыйДокумент.Записать();
			УдалятьПредыдущиеДокументы = Ложь;
			
		КонецПопытки;
		
	КонецЕсли;
	
	
	//Удаление старых документов
	Если УдалятьПредыдущиеДокументы И ЗначениеЗаполнено(Ответственный) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
		|ГДЕ
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка.Ответственный = &Ответственный
		|	И УстановкаЦенНоменклатурыТипыЦен.Ссылка.Дата < &Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТипыЦен.Ссылка";
		
		Запрос.УстановитьПараметр("Дата", ДатаНачалаУдаления);
		Запрос.УстановитьПараметр("Ответственный", Ответственный);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Об = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				Об.Удалить();
			Исключение
				Об.УстановитьПометкуУдаления(Истина);
			КонецПопытки;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьНормализованныйКод(СтрТЗ)
	
	СтрТЗ.Производитель = СокрЛП(СтрТЗ.Производитель); 
	СтрокаПроверки = ВРег(СтрТЗ.Производитель);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка,
	|	Номенклатура.Наименование КАК ИмяГруппы
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.Наименование ПОДОБНО &ИмяПроизводителя
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ИмяПроизводителя", СтрокаПроверки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		СтрокаПроверки = ВРег(СокрЛП(Выборка.ИмяГруппы));		
		СтрТЗ.Производитель = СокрЛП(Выборка.ИмяГруппы);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
		|	СинонимыПроизводителей.Производитель КАК Производитель,
		|	СинонимыПроизводителей.СинонимПроизводителя
		|ИЗ
		|	РегистрСведений.СинонимыПроизводителей КАК СинонимыПроизводителей
		|ГДЕ
		|	СинонимыПроизводителей.СинонимПроизводителя = &СинонимПроизводителя";
		
		Запрос.УстановитьПараметр("СинонимПроизводителя",СтрокаПроверки);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			СтрокаПроверки = ВРег(СокрЛП(Выборка.Производитель));		
			СтрТЗ.Производитель = СокрЛП(Выборка.Производитель);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОчищенныйПроизводитель = "";	
	Длина = СтрДлина(СтрокаПроверки);  
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
		КонецЕсли; 
		
	КонецЦикла;	
	
	ОчищенныйКодПроизводителя = "";
	СтрокаПроверки = СокрЛП(СтрТЗ.Артикул);
	Длина = СтрДлина(СтрокаПроверки); 
	
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
		КонецЕсли;     
		
	КонецЦикла;
	
	НормализованныйКод = ОчищенныйПроизводитель+ОчищенныйКодПроизводителя;
	
	Возврат НормализованныйКод;
	
КонецФункции

Процедура СинхронизацияКодаАвардыСМДМ() Экспорт
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка КАК НеСозданныйЗаказ,
	|	НеСозданныеЗаказыПокупателейТовары.Articul КАК Артикул,
	|	НеСозданныеЗаказыПокупателейТовары.Name КАК Наименование,
	|	НеСозданныеЗаказыПокупателейТовары.Brand КАК Производитель,
	|	НеСозданныеЗаказыПокупателейТовары.NumberInv КАК ИнвентарныйНомер,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка
	|ПОМЕСТИТЬ НеСозданныеЗаказы
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗапросОтправленВМДМ = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.НеНайденаНоменклатура = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.СинхронизированСМДМ = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка <> ЗНАЧЕНИЕ(Справочник.НеСозданныеЗаказыПокупателей.ПустаяСсылка)
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателяТовары.Номенклатура) КАК Номенклатура,
	|	ЗаказПокупателяТовары.Номенклатура.КодАварда КАК КодАварда,
	|	ЗаказПокупателяТовары.Номенклатура.КодМДМ КАК КодМДМ,
	|	ЗаказПокупателяТовары.Номенклатура.Артикул КАК ИнвНомер,
	|	НеСозданныеЗаказы.НеСозданныйЗаказ
	|ИЗ
	|	НеСозданныеЗаказы КАК НеСозданныеЗаказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО НеСозданныеЗаказы.ЗаказПокупателяСсылка = ЗаказПокупателяТовары.Ссылка
	|			И НеСозданныеЗаказы.Артикул = ЗаказПокупателяТовары.Номенклатура.КодПроизводителя
	|			И НеСозданныеЗаказы.Наименование = ЗаказПокупателяТовары.Номенклатура.Наименование
	|ГДЕ
	|	ЗаказПокупателяТовары.Номенклатура.КодАварда <> 0
	|	И ЗаказПокупателяТовары.Номенклатура.Артикул <> """"
	|	И ЗаказПокупателяТовары.Номенклатура.КодМДМ <> """"";
	
	Запрос.Параметры.Вставить("НачПериода",НачалоДня(ТекущаяДата()) - 864000);
	Запрос.Параметры.Вставить("КонПериода",КонецДня(ТекущаяДата()));
	
	РезЗапроса = Запрос.Выполнить(); 
	
	Если РезЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗНоменклатуры = РезЗапроса.Выгрузить();	
	
	Ответ = МСКWEB.СинхронизироватьКодАвардыСМДМ(ТЗНоменклатуры);	
	
	Если Ответ = Истина Тогда      
		
		ТЗНоменклатуры.Свернуть("НеСозданныйЗаказ");
		
		Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл
			
			НеСозданныйЗаказ = СтрТЗ.НеСозданныйЗаказ.ПолучитьОбъект();
			
			Для Каждого СтрТовары Из НеСозданныйЗаказ.Товары Цикл
				
				Если СтрТовары.НеНайденаНоменклатура = Истина Тогда
					СтрТовары.СинхронизированСМДМ = Истина;
				КонецЕсли;				
				
			КонецЦикла;			
			
			НеСозданныйЗаказ.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискПоНормализованномуКоду(НормализованныйКод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.НормализованныйКод = &НормализованныйКод
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НормализованныйКод", НормализованныйКод);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьНаличиеНоменклатуры()
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка КАК НеСозданныйЗаказ,
	|	НеСозданныеЗаказыПокупателейТовары.Articul КАК Артикул,
	|	НеСозданныеЗаказыПокупателейТовары.Name КАК Наименование,
	|	НеСозданныеЗаказыПокупателейТовары.Brand КАК Производитель,
	|	НеСозданныеЗаказыПокупателейТовары.NumberInv КАК ИнвентарныйНомер,
	|	НеСозданныеЗаказыПокупателейТовары.НеНайденаНоменклатура
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗапросОтправленВМДМ = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.НеНайденаНоменклатура = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.НеНайденаНоменклатура = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = &ПустаяСсылка
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеСозданныйЗаказ,
	|	Артикул";
	
	Запрос.Параметры.Вставить("ПустаяСсылка", Документы.ЗаказПокупателя.ПустаяСсылка());
	
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТЗНоменклатуры = РезЗапроса.Выгрузить();	
	ТЗНоменклатуры.Колонки.Добавить("НормализованныйКод");	
	
	Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл 
		
		СтрТЗ.НормализованныйКод = ПолучитьНормализованныйКод(СтрТЗ);
		Ном = ПоискПоНормализованномуКоду(СтрТЗ.НормализованныйКод);
		
		Если ЗначениеЗаполнено(Ном) Тогда
			СтрТЗ.НеНайденаНоменклатура = Ложь;
		КонецЕсли;			
		
	КонецЦикла;
	
	НеСозданныйЗаказ = Неопределено;
	ТЗНоменклатуры.Свернуть("НеСозданныйЗаказ,НеНайденаНоменклатура");
	
	Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл
		
		Отбор = Новый Структура("НеСозданныйЗаказ", СтрТЗ.НеСозданныйЗаказ);
		Рез = ТЗНоменклатуры.НайтиСтроки(Отбор);
		
		Если Рез.Количество() = 1 И Рез[0].НеНайденаНоменклатура = Ложь Тогда
			
			СпрОбъект = СтрТЗ.НеСозданныйЗаказ.ПолучитьОбъект();
			НомерЗаказа = СпрОбъект.Код; 
			Результат = СпрОбъект.СоздатьЗаказ();
			
			Если Результат = "" Тогда
				
				НомерЗаказа = СпрОбъект.ЗаказПокупателяСсылка.Номер; 
				СпрОбъект.НеНайденаНоменклатура = Ложь;				
				СпрОбъект.Записать();
				ЗаписьЖурналаРегистрации("НеСозданныйЗаказ.создание_заказа", УровеньЖурналаРегистрации.Информация,,, "Заказ " + НомерЗаказа + " успешно создан!");
				
			Иначе
				ЗаписьЖурналаРегистрации("НеСозданныйЗаказ.создание_заказа", УровеньЖурналаРегистрации.Ошибка,,, "Заказ " + НомерЗаказа 
				+ " не был создан по причине: " + Результат + "!");
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;			
	
КонецПроцедуры

Процедура ОтправкаНоменклатурыВМДМ() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда    
		
		ЗаписьЖурналаРегистрации("Отправка номенклатуры в МДМ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;   
		
	КонецЕсли;   
	
	ОтправкаНоменклатурыВМДМ_Запуск();		
	                    
	ПроверитьСкидкиНаБрендыВНесозданныхЗаказах();   
		
КонецПроцедуры

Процедура ОтправкаНоменклатурыВМДМ_Запуск()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка КАК НеСозданныйЗаказ,
	|	НеСозданныеЗаказыПокупателейТовары.Articul КАК Артикул,
	|	НеСозданныеЗаказыПокупателейТовары.Name КАК Наименование,
	|	НеСозданныеЗаказыПокупателейТовары.Brand КАК Производитель,
	|	НеСозданныеЗаказыПокупателейТовары.NumberInv КАК ИнвентарныйНомер,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.SkladID КАК SkladID,
	|	Константы.AMQP_ИдентификаторИнформацСистемы КАК База,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Идентификатор ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Поле1
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СторонниеСклады.Ссылка КАК Ссылка,
	|			СторонниеСклады.Идентификатор КАК Идентификатор
	|		ИЗ
	|			Справочник.СторонниеСклады КАК СторонниеСклады
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			СобственныеСклады.Ссылка,
	|			СобственныеСклады.Идентификатор
	|		ИЗ
	|			Справочник.СобственныеСклады КАК СобственныеСклады
	|		ГДЕ
	|			СобственныеСклады.СоздаватьНоменклатуруВМДМ) КАК ВложенныйЗапрос
	|		ПО НеСозданныеЗаказыПокупателейТовары.Ссылка.SkladID = ВложенныйЗапрос.Идентификатор,
	|	Константы КАК Константы
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗапросОтправленВМДМ = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.НеНайденаНоменклатура = ИСТИНА
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА ВложенныйЗапрос.Идентификатор ЕСТЬ NULL
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеСозданныйЗаказ,
	|	Артикул";
	
	РезЗапроса = Запрос.Выполнить();  
	
	Если РезЗапроса.Пустой() Тогда    
		
		ПроверитьНаличиеНоменклатуры();
		СинхронизацияКодаАвардыСМДМ();
		ПерезаписатьНоменклатуруВМДМ();
		Возврат;     
		
	КонецЕсли;
	
	ПерезаписатьНоменклатуруВМДМ();
	
	ТЗНоменклатуры = РезЗапроса.Выгрузить();	
	ТЗНоменклатуры.Колонки.Добавить("НормализованныйКод");	
	
	МассивСтрок = Новый Массив;
	
	Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл  
		
		СтрТЗ.НормализованныйКод = ПолучитьНормализованныйКод(СтрТЗ);		
		Ном = ПоискПоНормализованномуКоду(СтрТЗ.НормализованныйКод); 
		
		Если ЗначениеЗаполнено(Ном) Тогда
			//Заполним массив уже созданных номенклатур
			МассивСтрок.Добавить(СтрТЗ);
		КонецЕсли;      
		
	КонецЦикла;	
	
	//Удалим из таблицы существующую номенклатуру перед отправкой
	Для Сч = 0 По МассивСтрок.Количество()-1 Цикл   
		
		ТекСтр = МассивСтрок[Сч];
		НеСозданныйЗаказСсылка = ТекСтр.НеСозданныйЗаказ;
		ТЗНоменклатуры.Удалить(ТекСтр);
		
		Отбор = Новый Структура("НеСозданныйЗаказ", НеСозданныйЗаказСсылка);
		Рез = ТЗНоменклатуры.НайтиСтроки(Отбор);  
		
		Если Рез.Количество() = 0 Тогда         
			
			//Если в заказе вся номенклатура уже существует, то помечаем документ как отправленный в МДМ
			НеСозданныйЗаказ = НеСозданныйЗаказСсылка.ПолучитьОбъект();
			НеСозданныйЗаказ.ЗапросОтправленВМДМ = Истина;
			НеСозданныйЗаказ.Записать();     
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если ТЗНоменклатуры.Количество() = 0 Тогда 
		
		ПроверитьНаличиеНоменклатуры();
		СинхронизацияКодаАвардыСМДМ();
		Возврат;     
		
	КонецЕсли;	
	
	Ответ = МСКWEB.ОтправитьНоменклатуруВМДМ(ТЗНоменклатуры);
	
	Если Ответ = Истина Тогда  
		
		ТЗНоменклатуры.Свернуть("НеСозданныйЗаказ");  
		
		Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл   
			
			НеСозданныйЗаказ = СтрТЗ.НеСозданныйЗаказ.ПолучитьОбъект();
			НеСозданныйЗаказ.ЗапросОтправленВМДМ = Истина;
			НеСозданныйЗаказ.Записать(); 
			
		КонецЦикла;      
		
	КонецЕсли;
	
	ПроверитьНаличиеНоменклатуры();
	СинхронизацияКодаАвардыСМДМ();
	
КонецПроцедуры

Процедура ПроверитьСкидкиНаБрендыВНесозданныхЗаказах() Экспорт

	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка КАК НеСозданныйЗаказ,
	|	НеСозданныеЗаказыПокупателейТовары.Brand КАК Производитель,
	|	НеСозданныеЗаказыПокупателейТовары.НомерСтроки КАК НомерСтроки,
	|	НеСозданныеЗаказыПокупателейТовары.Price КАК Цена,
	|	НеСозданныеЗаказыПокупателейТовары.ЦенаОтгрузки КАК МинимальнаяЦена,
	|	НеСозданныеЗаказыПокупателейТовары.Кратность
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НЕ НеСозданныеЗаказыПокупателейТовары.ПроверенаСкидкаНаБренд
	|	И НеСозданныеЗаказыПокупателейТовары.Причина = ""Откл. цены""
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.EMailЗаказ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НеСозданныйЗаказ
	|ИТОГИ
	|	МАКСИМУМ(Производитель),
	|	МАКСИМУМ(НомерСтроки),
	|	МАКСИМУМ(Цена),
	|	МАКСИМУМ(МинимальнаяЦена)
	|ПО
	|	НеСозданныйЗаказ";
	
	ВыборкаЗаказы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Пока ВыборкаЗаказы.Следующий() Цикл
		
		НеСозданныйЗаказ = ВыборкаЗаказы.НеСозданныйЗаказ;
		
		РезультатЗапросаСкидок = МСКWEB.ПолучитьДанныеПоСкидкамНаБренды(НеСозданныйЗаказ.DogovorID);
		
		Если Не РезультатЗапросаСкидок.Результат Тогда
			
			ЗаписьЖурналаРегистрации("Проверка скидок на бренды в несозданных заказах", УровеньЖурналаРегистрации.Ошибка, ,НеСозданныйЗаказ, РезультатЗапросаСкидок.Сообщение);
			Продолжить;
			
		КонецЕсли; 
		
		СкидкиНаБренды = РезультатЗапросаСкидок.Данные;
		
		ОбЗаказ = НеСозданныйЗаказ.ПолучитьОбъект();
		
		ВыборкаСтроки = ВыборкаЗаказы.Выбрать(); 		
		
		Пока ВыборкаСтроки.Следующий() Цикл
			
			СтрокаПроверки = ОбЗаказ.Товары[ВыборкаСтроки.НомерСтроки - 1]; 
			СтрокаПроверки.ПроверенаСкидкаНаБренд = Истина;
			
			Скидка = 0;
			
			Для каждого СкидкаСтруктура Из СкидкиНаБренды Цикл
				
				Если НРег(ВыборкаСтроки.Производитель) = НРег(СкидкаСтруктура.Бренд) Тогда
					
					Скидка = СкидкаСтруктура.Скидка;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ЗначениеЗаполнено(Скидка) Тогда
				
				Цена = ВыборкаСтроки.Цена;           
				МинимальнаяЦена = ВыборкаСтроки.МинимальнаяЦена * (1 - Скидка/100);
								
				Если Цена >= МинимальнаяЦена Тогда
					
					Если ЗначениеЗаполнено(СтрокаПроверки.Кратность) Тогда
						
						РезультатДеления = СтрокаПроверки.Count/СтрокаПроверки.Кратность; 
						
						ЦелаяЧасть = Цел(РезультатДеления);
						Если РезультатДеления = ЦелаяЧасть Тогда
							ПромКоличество = СтрокаПроверки.Count; 
						Иначе
							ПромКоличество = ЦелаяЧасть*СтрокаПроверки.Кратность;
						КонецЕсли;
						
						Если НЕ ПромКоличество = 0 Тогда
							СтрокаПроверки.РазрешеноКОтгрузке = ПромКоличество; 
						КонецЕсли;
						
					Иначе
						СтрокаПроверки.РазрешеноКОтгрузке = СтрокаПроверки.Count; 
					КонецЕсли;
					
					
				КонецЕсли;                   		                         			
				
			КонецЕсли;
			
		КонецЦикла; 
		
		ОбЗаказ.Записать();
		
		//Создаем заказ если все разрешено к отгрузке
		Если ОбЗаказ.Товары.НайтиСтроки(Новый Структура("РазрешеноКОтгрузке", 0)).Количество() = 0 Тогда			
			ОбЗаказ.СоздатьЗаказ(Ложь, "Создан регламентным заданием из справочника несозданных заказов");                                                                     					
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ПерезаписатьНоменклатуруВМДМ()
	
	КонстантаАдрес = Константы.АдресВебСервисаМДМ.Получить();
	
	Если ЗначениеЗаполнено(КонстантаАдрес) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеСозданныеЗаказыПокупателей.Ссылка
		|ИЗ
		|	Справочник.НеСозданныеЗаказыПокупателей КАК НеСозданныеЗаказыПокупателей
		|ГДЕ
		|	НеСозданныеЗаказыПокупателей.ЗапросОтправленВМДМ
		|	И НеСозданныеЗаказыПокупателей.КоличествоПовторныхЗапросовВМДМ < 1
		|	И НеСозданныеЗаказыПокупателей.НеНайденаНоменклатура
		|	И НеСозданныеЗаказыПокупателей.ЗаказПокупателяСсылка = &ПустойЗаказ
		|	И НеСозданныеЗаказыПокупателей.Дата <= &Дата
		|	И НЕ НеСозданныеЗаказыПокупателей.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ПустойЗаказ", Документы.ЗаказПокупателя.ПустаяСсылка());
		Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 60*30);
		
		АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/NomenclatureCreation.1cws?wsdl";
		ВСОпределение = Новый WSОпределения(АдресВебСервиса,,,, 10);
		ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "NomenclatureCreation", "NomenclatureCreationSoap");
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		МассивЗаказов = Новый Массив;
		МассивНоменклатуры = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Заказ = Выборка.Ссылка;
			
			ТоварыПоиска = Заказ.Товары.НайтиСтроки(Новый Структура("НеНайденаНоменклатура", Истина)); 
			
			Для каждого Стр Из ТоварыПоиска Цикл
				
				НормализованныйКод = ПолучитьНормализованныйКод(Новый Структура("Артикул,Производитель", Стр.Articul, Стр.Brand));
				
				МассивНоменклатуры.Добавить(Новый Структура("Артикул,НормализованныйКод", Стр.Articul, НормализованныйКод));
				
			КонецЦикла; 
			
			ЗаказОб = Заказ.ПолучитьОбъект();
			ЗаказОб.КоличествоПовторныхЗапросовВМДМ = ЗаказОб.КоличествоПовторныхЗапросовВМДМ + 1;
			
			МассивЗаказов.Добавить(ЗаказОб);
					
		КонецЦикла; 
		
		Если МассивНоменклатуры.Количество() > 0 Тогда
			
			Попытка		
				
				ЗаписьЖурналаРегистрации("Перезапись номенклатуры в МДМ.Начало", УровеньЖурналаРегистрации.Информация,,, "NomenclatureCreation.ПерезаписатьНоменклатуру");
				
				ОтветJSON = ВСПрокси.ПерезаписатьНоменклатуру(ОбщегоНазначения.ВернутьJSON(МассивНоменклатуры));  
				
				ОтветСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ОтветJSON);
				
				ЗаписьЖурналаРегистрации("Перезапись номенклатуры в МДМ.Окончание", УровеньЖурналаРегистрации.Информация,,, 
				"NomenclatureCreation.ПерезаписатьНоменклатуру.получение_ответа" + Символы.ПС + ОтветСтруктура.Сообщение);	
				
				Для каждого ЗаказОб Из МассивЗаказов Цикл
					ЗаказОб.Записать();	
				КонецЦикла;
				
			Исключение
				
				ЗаписьЖурналаРегистрации("Перезапись номенклатуры в МДМ.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"GoodsReserve.ПерезаписатьНоменклатуру.получение_ответа " + ОписаниеОшибки());
				Сообщить(ОписаниеОшибки());		
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

Процедура ЗапускОбработки_СоздатьЗаказПоставщику() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;       
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополение", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентное создание заказа поставщику на пополнение");
	
	ОбработкаРегламентная = Обработки.СоздатьЗаказПоставщику.Создать();
	ОбработкаРегламентная.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентное создание заказа поставщику на пополнение");  
	
КонецПроцедуры

Процедура УдалениеПомеченныхОбъектов() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Удаление помеченных объектов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	// Очищаю записи регистра, чтобы не мешали удалению
	ОбработкаУдаления = Обработки.УдалениеПомеченныхОбъектов.Создать();
	ОбработкаУдаления.вКонтроль();
	
КонецПроцедуры

Процедура ОчисткаОбъектов() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Очистка объектов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Тема = "Счет на оплату";   
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения электронных писем");
	Дата = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 14) * 24 * 60 * 60;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭлектронноеПисьмо.Ссылка,
	|	ВложенияЭлектронныхПисем.Ссылка КАК СсылкаВложения
	|ИЗ
	|	Документ.ЭлектронноеПисьмо КАК ЭлектронноеПисьмо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВложенияЭлектронныхПисем КАК ВложенияЭлектронныхПисем
	|		ПО ЭлектронноеПисьмо.Ссылка = ВложенияЭлектронныхПисем.Объект
	|			И (ЭлектронноеПисьмо.Тема = &Тема)
	|			И (ЭлектронноеПисьмо.ДатаТранспорта <= &Дата)
	|ГДЕ
	|	ЭлектронноеПисьмо.Тема = &Тема
	|	И ЭлектронноеПисьмо.ДатаТранспорта <= &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Тема", Тема);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СсылкаВложения) Тогда         
			
			ОбъектВложения = ВыборкаДетальныеЗаписи.СсылкаВложения.ПолучитьОбъект();   
			
			Попытка 
				
				Если Не ОбъектВложения = Неопределено Тогда
					ОбъектВложения.Удалить();
				КонецЕсли;
				
			Исключение
				ОбъектВложения.УстановитьПометкуУдаления(Истина);
			КонецПопытки;       
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыборкаДетальныеЗаписи.Сбросить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		Попытка 
			
			Если Не Объект = Неопределено Тогда
				
				Объект.УстановитьПометкуУдаления(Истина);
				Объект.Удалить();
				
			КонецЕсли;
			
		Исключение
			Объект.УстановитьПометкуУдаления(Истина);
		КонецПопытки;
		
	КонецЦикла;
	
	МассивРегистров = Новый Массив;
	МассивРегистров.Добавить(РегистрыСведений.ВерсииОбъектов);
	МассивРегистров.Добавить(РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов);
	МассивРегистров.Добавить(РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки);
	МассивРегистров.Добавить(РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах);

	Для к = 0 По МассивРегистров.ВГраница() Цикл 
		
		Регистр = МассивРегистров[к];
		
		Если ТипЗнч(Регистр) = Тип(РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки) Тогда  
			
			КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре откорректированных сборок");
			ПериодПо = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 90) * 24 * 60 * 60;
			
			Выборка = РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ДатаЗаписи < ПериодПо Тогда
					
					Запись = Выборка.ПолучитьМенеджерЗаписи();
					Запись.Удалить();
					
				КонецЕсли; 
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Регистр) = Тип(РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов) Тогда  
			
			КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре загруженных статусов");
			ПериодПо = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 90) * 24 * 60 * 60;
			
			Выборка = РегистрыСведений.ИсторияХраненияИзмененийЗагружСтатусов.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ДатаЗагрузки < ПериодПо Тогда
					
					Запись = Выборка.ПолучитьМенеджерЗаписи();
					Запись.Удалить();
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		ИначеЕсли ТипЗнч(Регистр) = Тип(РегистрыСведений.ВерсииОбъектов) Тогда
			
			Выборка = РегистрыСведений.ВерсииОбъектов.Выбрать(); 
			
			КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре версий объектов");
			ПериодПоВерсии = НачалоДня(ТекущаяДата()) - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 365) * 24 * 60 * 60;
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ДатаВерсии < ПериодПоВерсии Тогда
					
					Запись = Выборка.ПолучитьМенеджерЗаписи();
					Запись.Удалить();
					
				КонецЕсли; 
				
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(Регистр) = Тип(РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах) Тогда  
			
			КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре изменений количества в заказах");
			ПериодПо = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 90) * 24 * 60 * 60;
			
			Выборка = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.ДатаЗапроса < ПериодПо Тогда
					
					Запись = Выборка.ПолучитьМенеджерЗаписи();
					Запись.Удалить();
					
				КонецЕсли; 
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка   
		
		Если Справочники.МТ_ПредопределенныеЗначения.НастройкаОчисткиИсходящихСообщений.Список.Количество() = 0 Тогда  
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ИсходящиеСообщения.Ссылка
			|ИЗ
			|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
			|ГДЕ
			|	ИсходящиеСообщения.ДатаВремяОтправки <= &Дата
			|	И ИсходящиеСообщения.ДатаВремяОтправки >= &Дата1";   
			
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Дата1", Дата("20100101000000"));
			
			Выб = Запрос.Выполнить().Выбрать();   
			
			Пока Выб.Следующий() Цикл           
				
				Спр = Выб.Ссылка.ПолучитьОбъект();
				Спр.Удалить();                 
				
			КонецЦикла;  
			
		Иначе
			
			// 1. Удаление сообщений по настройкам  
			ТаблицаТипов = Справочники.МТ_ПредопределенныеЗначения.НастройкаОчисткиИсходящихСообщений.Список.Выгрузить(); 
			ТаблицаТипов.Колонки.Добавить("Тип");   
			
			МассивТипов = Новый Массив; 
			МассивСтроковыхТипов = Новый Массив;
			
			сч = 0;
			Пока сч < ТаблицаТипов.Количество() Цикл 
				
				ТекСтрока = ТаблицаТипов.Получить(сч);
				
				ИсключитьСтроку = (Не ЗначениеЗаполнено(ТекСтрока.Свойство)) ИЛИ (Не ТипЗнч(ТекСтрока.Свойство) = Тип("Строка"));
				
				Если ИсключитьСтроку Тогда
					
					ТаблицаТипов.Удалить(ТекСтрока);
					Продолжить;
					
				КонецЕсли; 
				
				ТекСвойство = СокрЛП(ТекСтрока.Свойство);
				
				ЭтоСправочник = Ложь;
				НайденныйОбъектМетаданных = Метаданные.Документы.Найти(ТекСвойство); 
				Если НайденныйОбъектМетаданных = Неопределено Тогда  
					
					ЭтоСправочник = Истина;
					НайденныйОбъектМетаданных = Метаданные.Справочники.Найти(ТекСвойство); 
					
				КонецЕсли; 
				
				Если НайденныйОбъектМетаданных <> Неопределено Тогда 
					
					НайденныйТип = Тип(?(ЭтоСправочник, "СправочникСсылка.", "ДокументСсылка.") + ТекСвойство);
					ТекСтрока.Тип = НайденныйТип; 
					МассивТипов.Добавить(НайденныйТип);
					
				Иначе
					МассивСтроковыхТипов.Добавить(ТекСвойство);
				КонецЕсли;
				
				сч = сч + 1;
				
			КонецЦикла;  
			
			
			ЗапросПоНастройкам = Новый Запрос; 
			ЗапросПоНастройкам.Текст = "";
			
			сч = 0;
			Пока сч < ТаблицаТипов.Количество() Цикл  
				
				СтрокаТаблицы = ТаблицаТипов.Получить(сч); 
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.Тип) Тогда
					
					НовыйБлок = "
					|ВЫБРАТЬ
					|	ИсходящиеСообщения.Ссылка
					|ИЗ
					|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
					|ГДЕ
					|	ТИПЗНАЧЕНИЯ(ИсходящиеСообщения.Объект) = &Тип" + Формат(сч + 1, "ЧГ=0") + "
					|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата" + Формат(сч + 1, "ЧГ=0") + "
					|	И ИсходящиеСообщения.ДатаВремяОтправки >= &Дата0
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|";   
					
					ЗапросПоНастройкам.УстановитьПараметр("Тип" + Формат(сч + 1, "ЧГ=0"), СтрокаТаблицы.Тип);
					ЗапросПоНастройкам.УстановитьПараметр("Дата" + Формат(сч + 1, "ЧГ=0"), ТекущаяДата() - СтрокаТаблицы.Значение * 24 * 60 * 60); 
					
				Иначе
					
					НовыйБлок = "
					|ВЫБРАТЬ
					|	ИсходящиеСообщения.Ссылка
					|ИЗ
					|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
					|ГДЕ
					|	ИсходящиеСообщения.Объект = &Свойство" + Формат(сч + 1, "ЧГ=0") + "
					|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата" + Формат(сч + 1, "ЧГ=0") + "
					|	И ИсходящиеСообщения.ДатаВремяОтправки >= &Дата0
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|";   
					
					ЗапросПоНастройкам.УстановитьПараметр("Свойство" + Формат(сч + 1, "ЧГ=0"), СтрокаТаблицы.Свойство);
					ЗапросПоНастройкам.УстановитьПараметр("Дата" + Формат(сч + 1, "ЧГ=0"), ТекущаяДата() - СтрокаТаблицы.Значение * 24 * 60 * 60); 
					
				КонецЕсли;  
				
				ЗапросПоНастройкам.УстановитьПараметр("Дата0", Дата("20100101000000"));
				
				ЗапросПоНастройкам.Текст = ЗапросПоНастройкам.Текст + НовыйБлок;
				
				сч = сч + 1;
				
			КонецЦикла;
			
			ЗапросПоНастройкам.Текст = Лев(ЗапросПоНастройкам.Текст, СтрДлина(ЗапросПоНастройкам.Текст) - 16);
			
			ВыборкаПоНастройкам = ЗапросПоНастройкам.Выполнить().Выбрать(); 
			
			Пока ВыборкаПоНастройкам.Следующий() Цикл
				
				Спр = ВыборкаПоНастройкам.Ссылка.ПолучитьОбъект();
				Спр.Удалить();                 
				
			КонецЦикла;
			
			
			// 2. Удаление сообщений по общим правилами  
			
			Запрос = Новый Запрос; 
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ИсходящиеСообщения.Ссылка
			|ИЗ
			|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
			|ГДЕ
			|	НЕ ТИПЗНАЧЕНИЯ(ИсходящиеСообщения.Объект) В (&МассивТипов) 
			|	И НЕ ИсходящиеСообщения.Объект В (&МассивСтроковыхТипов)
			|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата
			|	И ИсходящиеСообщения.ДатаВремяОтправки >= &Дата0";
			
			
			Запрос.УстановитьПараметр("МассивТипов", МассивТипов);
			Запрос.УстановитьПараметр("МассивСтроковыхТипов", МассивСтроковыхТипов); 
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Дата0", Дата("20100101000000"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Спр = Выборка.Ссылка.ПолучитьОбъект();
				Спр.Удалить();                 
				
			КонецЦикла;
			
		КонецЕсли;  
		
	Исключение   
		
		ЗаписьЖурналаРегистрации("Очистка объектов", УровеньЖурналаРегистрации.Ошибка, , ,
		"Произошла ошибка при очистке Исходящих сообщений. " + ОписаниеОшибки());
		
	КонецПопытки;
	
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре статусов касс");
	Дата = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 30) * 24 * 60 * 60;
	
	ВыборкаСтатусовКасс = РегистрыСведений.СтатусыКасс.Выбрать(, Дата);
	
	Пока ВыборкаСтатусовКасс.Следующий() Цикл
		
		МенеджерЗаписи = ВыборкаСтатусовКасс.ПолучитьМенеджерЗаписи();
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5914
	ОбработатьСтарыеВходящиеСообщения(ДобавитьМесяц(ТекущаяДата(), -1));
	//-Сёмин Р.И. 24.06.2026 #UT10-5914
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОчисткаРегистраВерсииОбъектов() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Очистка объектов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10000
	|	ВерсииОбъектов.Объект,
	|	ВерсииОбъектов.НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|ГДЕ
	|	ВерсииОбъектов.ДатаВерсии < &ДатаДо
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВерсииОбъектов.ДатаВерсии";  
	
	Запрос.УстановитьПараметр("ДатаДо", ДобавитьМесяц(НачалоДня(ТекущаяДата()), -12));   
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл 
		
		МенеджерЗаписи = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Объект = Выборка.Объект;
		МенеджерЗаписи.НомерВерсии = Выборка.НомерВерсии;  
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли; 
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Процедура ОчисткаСправочникаИсходящиеСообщения() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Очистка объектов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Дата = ТекущаяДата() - 14*24*60*60; 
	
	Если Справочники.МТ_ПредопределенныеЗначения.НастройкаОчисткиИсходящихСообщений.Список.Количество() = 0 Тогда	
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10000
		|	ИсходящиеСообщения.Ссылка
		|ИЗ
		|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
		|ГДЕ
		|	ИсходящиеСообщения.ДатаВремяСобытия <= &Дата
		|	И ИсходящиеСообщения.ДатаВремяОтправки <> ДАТАВРЕМЯ(1, 1, 1)";
		
		Запрос.УстановитьПараметр("Дата", Дата);
		
		Выб = Запрос.Выполнить().Выбрать();
		
		Пока Выб.Следующий() Цикл
			
			Спр = Выб.Ссылка.ПолучитьОбъект();
			Спр.Удалить();
			
		КонецЦикла;  
		
	Иначе         
		
		// 1. Удаление сообщений по настройкам  
		ТаблицаТипов = Справочники.МТ_ПредопределенныеЗначения.НастройкаОчисткиИсходящихСообщений.Список.Выгрузить(); 
		ТаблицаТипов.Колонки.Добавить("Тип");   
		
		МассивТипов = Новый Массив; 
		МассивСтроковыхТипов = Новый Массив;
		
		сч = 0;
		Пока сч < ТаблицаТипов.Количество() Цикл 
			
			ТекСтрока = ТаблицаТипов.Получить(сч);
			
			ИсключитьСтроку = (Не ЗначениеЗаполнено(ТекСтрока.Свойство)) ИЛИ (Не ТипЗнч(ТекСтрока.Свойство) = Тип("Строка"));
			
			Если ИсключитьСтроку Тогда
				
				ТаблицаТипов.Удалить(ТекСтрока);
				Продолжить;
				
			КонецЕсли; 
			
			ТекСвойство = СокрЛП(ТекСтрока.Свойство);
			
			ЭтоСправочник = Ложь;
			НайденныйОбъектМетаданных = Метаданные.Документы.Найти(ТекСвойство); 
			Если НайденныйОбъектМетаданных = Неопределено Тогда  
				
				ЭтоСправочник = Истина;
				НайденныйОбъектМетаданных = Метаданные.Справочники.Найти(ТекСвойство); 
				
			КонецЕсли; 
			
			Если НайденныйОбъектМетаданных <> Неопределено Тогда 
				
				НайденныйТип = Тип(?(ЭтоСправочник, "СправочникСсылка.", "ДокументСсылка.") + ТекСвойство);
				ТекСтрока.Тип = НайденныйТип; 
				МассивТипов.Добавить(НайденныйТип);
				
			Иначе
				МассивСтроковыхТипов.Добавить(ТекСвойство);
			КонецЕсли;
			
			сч = сч + 1;
			
		КонецЦикла;  
		
		
		ЗапросПоНастройкам = Новый Запрос; 
		ЗапросПоНастройкам.Текст = "";
		
		сч = 0;
		Пока сч < ТаблицаТипов.Количество() Цикл  
			
			СтрокаТаблицы = ТаблицаТипов.Получить(сч); 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Тип) Тогда
				
				НовыйБлок = "
				|ВЫБРАТЬ ПЕРВЫЕ 10000
				|	ИсходящиеСообщения.Ссылка
				|ИЗ
				|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
				|ГДЕ
				|	ТИПЗНАЧЕНИЯ(ИсходящиеСообщения.Объект) = &Тип" + Формат(сч + 1, "ЧГ=0") + "
				|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата" + Формат(сч + 1, "ЧГ=0") + "
				|	И ИсходящиеСообщения.ДатаВремяОтправки <> ДАТАВРЕМЯ(1, 1, 1)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|";   
				
				ЗапросПоНастройкам.УстановитьПараметр("Тип" + Формат(сч + 1, "ЧГ=0"), СтрокаТаблицы.Тип);
				ЗапросПоНастройкам.УстановитьПараметр("Дата" + Формат(сч + 1, "ЧГ=0"), ТекущаяДата() - СтрокаТаблицы.Значение * 24 * 60 * 60); 
				
			Иначе
				
				НовыйБлок = "
				|ВЫБРАТЬ ПЕРВЫЕ 10000
				|	ИсходящиеСообщения.Ссылка
				|ИЗ
				|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
				|ГДЕ
				|	ИсходящиеСообщения.Объект = &Свойство" + Формат(сч + 1, "ЧГ=0") + "
				|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата" + Формат(сч + 1, "ЧГ=0") + "
				|	И ИсходящиеСообщения.ДатаВремяОтправки <> ДАТАВРЕМЯ(1, 1, 1)
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|";   
				
				ЗапросПоНастройкам.УстановитьПараметр("Свойство" + Формат(сч + 1, "ЧГ=0"), СтрокаТаблицы.Свойство);
				ЗапросПоНастройкам.УстановитьПараметр("Дата" + Формат(сч + 1, "ЧГ=0"), ТекущаяДата() - СтрокаТаблицы.Значение * 24 * 60 * 60); 
				
			КонецЕсли;  
			
			ЗапросПоНастройкам.Текст = ЗапросПоНастройкам.Текст + НовыйБлок;
			
			сч = сч + 1;
			
		КонецЦикла;
		
		ЗапросПоНастройкам.Текст = Лев(ЗапросПоНастройкам.Текст, СтрДлина(ЗапросПоНастройкам.Текст) - 16);
		
		ВыборкаПоНастройкам = ЗапросПоНастройкам.Выполнить().Выбрать(); 
		
		Пока ВыборкаПоНастройкам.Следующий() Цикл
			
			Спр = ВыборкаПоНастройкам.Ссылка.ПолучитьОбъект();
			Спр.Удалить();                 
			
		КонецЦикла;
		
		
		// 2. Удаление сообщений по общим правилами  
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 10000
		|	ИсходящиеСообщения.Ссылка
		|ИЗ
		|	Справочник.ИсходящиеСообщения КАК ИсходящиеСообщения
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(ИсходящиеСообщения.Объект) В (&МассивТипов) 
		|	И НЕ ИсходящиеСообщения.Объект В (&МассивСтроковыхТипов)
		|	И ИсходящиеСообщения.ДатаВремяОтправки <= &Дата
		|	И ИсходящиеСообщения.ДатаВремяОтправки <> ДАТАВРЕМЯ(1, 1, 1)";
		
		
		Запрос.УстановитьПараметр("МассивТипов", МассивТипов);
		Запрос.УстановитьПараметр("МассивСтроковыхТипов", МассивСтроковыхТипов); 
		Запрос.УстановитьПараметр("Дата", Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Спр = Выборка.Ссылка.ПолучитьОбъект();
			Спр.Удалить();                 
			
		КонецЦикла;	
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);	
	
КонецПроцедуры  

Процедура ОчиститьРегистрСведенийСтатусыКасс() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Очистка объектов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней хранения данных в регистре статусов касс");
	Дата = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 30) * 24 * 60 * 60;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10000
	|	СтатусыКасс.Касса КАК Касса
	|ИЗ
	|	РегистрСведений.СтатусыКасс КАК СтатусыКасс
	|ГДЕ
	|	СтатусыКасс.Период <= &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		МенеджерЗаписи = РегистрыСведений.СтатусыКасс.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Касса = Выборка.Касса;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;	
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ОчисткаРегистраШтрихкоды() Экспорт
//+Гавриленков В. 24.03.2026 #UT10-5778	
	
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраШтрихккоды, "Количество дней хранения штрихкодов Сборок");
	Дата = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 30) * 24 * 60 * 60;
	
	КоличествоВВыборке = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраШтрихккоды, "Количество записей в пакете выборки");
	КоличествоВВыборке = ?(ЗначениеЗаполнено(КоличествоВВыборке), КоличествоВВыборке, 5000);
	
	КоличествоУдалить = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраШтрихккоды, "Количество записей в пакете удаления");
	КоличествоУдалить = ?(ЗначениеЗаполнено(КоличествоУдалить), КоличествоУдалить, 200);
	
	Пауза = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраШтрихккоды, "Пауза");
	Пауза = ?(ЗначениеЗаполнено(Пауза), Пауза, 20);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоВВыборке, "ЧГ=0") + "
	|	Штрихкоды.Владелец
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Владелец ССЫЛКА Документ.СборкаЗаказовПокупателя
	|	И Штрихкоды.Владелец.Дата < &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	сч = 0;
	
	Пока Выборка.Следующий() Цикл 
				
		Попытка
		
			Набор = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
			Набор.Отбор.Владелец.Установить(Выборка.Владелец); 
			Набор.ОбменДанными.Загрузка = Истина; 
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			Набор.Записать();
			
		Исключение
		КонецПопытки; 
		
		сч = сч + 1; 
		
		Если ЗначениеЗаполнено(КоличествоУдалить) Тогда
			
			Если сч >= КоличествоУдалить И ЗначениеЗаполнено(Пауза) Тогда
					ОбщегоНазначения.СделатьПаузу(Пауза); 
					сч = 0;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
//-Гавриленков В. 24.03.2026 #UT10-5778	
КонецПроцедуры

Процедура ОчисткаРегистраНапечатанныеДокументы() Экспорт
//+Гавриленков В. 24.03.2026 #UT10-5778

	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраНапечатанныеДокументы, "Количество дней хранения Сборок");
	Дата = ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 730) * 24 * 60 * 60;
	
	КоличествоВВыборке = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраНапечатанныеДокументы, "Количество записей в пакете выборки");
	КоличествоВВыборке = ?(ЗначениеЗаполнено(КоличествоВВыборке), КоличествоВВыборке, 5000);
	
	КоличествоУдалить = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраНапечатанныеДокументы, "Количество записей в пакете удаления");
	КоличествоУдалить = ?(ЗначениеЗаполнено(КоличествоУдалить), КоличествоУдалить, 200);
	
	Пауза = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.ОчисткаРегистраНапечатанныеДокументы, "Пауза");
	Пауза = ?(ЗначениеЗаполнено(Пауза), Пауза, 20);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоВВыборке, "ЧГ=0") + "
	|	НапечатанныеДокументы.Документ
	|ИЗ
	|	РегистрСведений.НапечатанныеДокументы КАК НапечатанныеДокументы
	|ГДЕ
	|	НапечатанныеДокументы.Документ ССЫЛКА Документ.СборкаЗаказовПокупателя
	|	И НапечатанныеДокументы.Документ.Дата < &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	сч = 0;
	
	Пока Выборка.Следующий() Цикл 
				
		Попытка
		
			Набор = РегистрыСведений.НапечатанныеДокументы.СоздатьНаборЗаписей();
			Набор.Отбор.Документ.Установить(Выборка.Документ); 
			Набор.ОбменДанными.Загрузка = Истина; 
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			Набор.Записать();
			
		Исключение
		КонецПопытки; 
		
		сч = сч + 1; 
		
		Если ЗначениеЗаполнено(КоличествоУдалить) Тогда
			
			Если сч >= КоличествоУдалить И ЗначениеЗаполнено(Пауза) Тогда
					ОбщегоНазначения.СделатьПаузу(Пауза); 
					сч = 0;
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;

//-Гавриленков В. 24.03.2026 #UT10-5778
КонецПроцедуры

Процедура ОбработатьСтарыеВходящиеСообщения(пДата) Экспорт
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5914
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Р_ВходящиеСообщения.Ссылка
		|ИЗ
		|	Справочник.Р_ВходящиеСообщения КАК Р_ВходящиеСообщения
		|ГДЕ
		|	Р_ВходящиеСообщения.Дата <= &Дата
		|	И НЕ Р_ВходящиеСообщения.Обработано
		|	И НЕ Р_ВходящиеСообщения.ОбработаноСОшибкой
		|	И Р_ВходящиеСообщения.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("Дата", пДата);
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных", "ПоступлениеТоваровУслуг");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ВхСообщениеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		ВхСообщениеОбъект.ТекстОшибки = "Закрыто регламентом очистки объектов";
		ВхСообщениеОбъект.ОбработаноСОшибкой = Истина;
		
		ВхСообщениеОбъект.Записать();
		
	КонецЦикла;
	//-Сёмин Р.И. 24.06.2026 #UT10-5914
	
КонецПроцедуры

Процедура ЗагрузкаОстатковЦС() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка остатков ЦС", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPЗагрузкаЦенАдрес.Получить();
	//ИмяFTPСервера = "ftp.moskvorechie.ru";
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPЗагрузкаЦенЛогин.Получить(),  Константы.FTPЗагрузкаЦенПароль.Получить(), , Истина);
		//Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", "avarda", "Mei@3AJx", ,Ложь);
	Исключение
		Возврат;
	КонецПопытки;
	
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера, "*.txt");
	
	ТаблицаОстатков = Неопределено;
	
	Для Каждого ТекСтр ИЗ МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("price.file.txt") Тогда 			
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("txt");
			Соединение.Получить("price.file.txt", ИмяВременногоФайла); 		
			
			Текст = Новый ТекстовыйДокумент; 
			Текст.Прочитать(ИмяВременногоФайла); 
			
			ТаблицаТоваров = Новый ТаблицаЗначений;
			ТаблицаТоваров.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(25)));
			ТаблицаТоваров.Колонки.Добавить("Остаток", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
			
			Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл 
				
				Стр = Текст.ПолучитьСтроку(НомерСтроки);
				МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Стр, Символы.Таб);   				
				
				Если МассивСтрок.Количество() >= 7 Тогда
					
					Если МассивСтрок[6] = "0" Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ТаблицаТоваров.Добавить();
					НоваяСтрока.Артикул = МассивСтрок[1];
					НоваяСтрока.Остаток = МассивСтрок[6];
					
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос = Новый Запрос;
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
			Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
			Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
			
			Запрос.Текст = "ВЫБРАТЬ
			|	ТаблицаТоваров.Остаток,
			|	ТаблицаТоваров.Артикул КАК Артикул
			|ПОМЕСТИТЬ ТаблицаТоваров
			|ИЗ
			|	&ТаблицаТоваров КАК ТаблицаТоваров
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Артикул
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МАКСИМУМ(ТаблицаТоваров.Остаток) КАК Количество,
			|	Номенклатура.Ссылка КАК Номенклатура
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО ТаблицаТоваров.Артикул = Номенклатура.Артикул
			|
			|СГРУППИРОВАТЬ ПО
			|	Номенклатура.Ссылка";
			
			ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
			ТаблицаОстатков.Свернуть("Номенклатура", "Количество");
			
			НаборЗаписей = РегистрыСведений.МосковскиеОстаткиНоменклатуры.СоздатьНаборЗаписей(); 
			НаборЗаписей.Загрузить(ТаблицаОстатков);
			НаборЗаписей.Записать();	
			
			КонстантаВыгрузкаЦенЛогин  = Константы.FTPВыгрузкаЦенЛогин.Получить();
			КонстантаВыгрузкаЦенПароль = Константы.FTPВыгрузкаЦенПароль.Получить();
			
			Если ЗначениеЗаполнено(КонстантаВыгрузкаЦенЛогин) И ЗначениеЗаполнено(КонстантаВыгрузкаЦенПароль) Тогда
				
				Попытка
					
					СоединениеОстатки = Новый FTPСоединение(ИмяFTPСервера, "21", КонстантаВыгрузкаЦенЛогин, КонстантаВыгрузкаЦенПароль, , Истина); 
					СоединениеОстатки.Записать(ИмяВременногоФайла, "price.file.txt");
					
				Исключение                
				КонецПопытки; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗапускРегламентногоЗаданияПоЗакрытиюЗаказовПоставщикамОтр() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное закрытие документов 'Заказ поставщику' с отрицательными остатками ");
	
	ОбработкаЗапуска = Обработки.ЗакрытиеЗаказовПоставщикам_Регламент.Создать();
	
	
	ОбработкаЗапуска.ВыполнитьРаботуОтрицательныеОстатки();
	
	ЗаписьЖурналаРегистрации("Закрытие заказов поставщикам", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное закрытие документов 'Заказ поставщику' с отрицательными остатками ");
	
КонецПроцедуры	

Процедура ОбработкаОшибокЗагрузкиИзRabbit() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обработка ошибок загрузки из Rabbit", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	КоличествоПопытокМакс = Константы.КоличествоПопытокОбработкиОшибокAMQP.Получить();
	
	Если Не ЗначениеЗаполнено(КоличествоПопытокМакс) Тогда
		КоличествоПопытокМакс = 72;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата",ТекущаяДата());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.МоментОшибки,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОбъектаМетаданных,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМ,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяСопутствСправочника,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КодМДМСопутствСправочника,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ТекстОшибки,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ОписаниеОшибки,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.Обработано,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НомерСообщения,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.НужноОбработать,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ИмяОчереди,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.КоличествоПопыток,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.ШтампВерсии,
	|	ОшибкиЗагрузкиДанныхИзОчередиAMQP.Комментарий,
	|	РАЗНОСТЬДАТ(ОшибкиЗагрузкиДанныхИзОчередиAMQP.МоментОшибки, &ТекущаяДата, ДЕНЬ) КАК ВозрастОшибки
	|ИЗ
	|	РегистрСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP КАК ОшибкиЗагрузкиДанныхИзОчередиAMQP";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИмяОчереди = Выборка.ИмяОчереди;
		ТекстСообщения = Выборка.ОписаниеОшибки;

		Если Выборка.Обработано ИЛИ Не Выборка.НужноОбработать ИЛИ Выборка.КоличествоПопыток > КоличествоПопытокМакс Тогда
			
			//Сообщение обработано или не актуально, просто удаляем
			МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка); 		
			МЗ.Прочитать();
			МЗ.Удалить();
			Продолжить;
			
		КонецЕсли;
		
		Попытка
			
			Отказ = Ложь;
			МСК.ОбработатьСообщениеИзОчереди(ИмяОчереди, ТекстСообщения, Отказ, Выборка.КоличествоПопыток);

			Если Не Отказ  ИЛИ Выборка.ВозрастОшибки > 10 Тогда				
				
				МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка); 		
				МЗ.Прочитать();
				МЗ.Удалить();
				
			Иначе
				
				МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(МЗ, Выборка); 		
				МЗ.КоличествоПопыток = Выборка.КоличествоПопыток + 1;
				МЗ.Записать(); 
				
			КонецЕсли;					
			
		Исключение
			
			МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзОчередиAMQP.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка); 		
			МЗ.КоличествоПопыток = Выборка.КоличествоПопыток + 1;
			
			Если Выборка.ВозрастОшибки > 10 Тогда
				
				МЗ.Прочитать();
				МЗ.Удалить();
				
			Иначе				
				МЗ.Записать(); 
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ОбновлениеОстатковИЦен_КазаньВер2()
	
	
	ИмяКаталогаСервера = "";
	
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);	
	
	Текст = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Доп
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Номенклатура КАК Номенклатура,
	|	Т1.ОстатокКВыгрузке КАК ОстатокКВыгрузке_ДОП,
	|	ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0) КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА Т1.ОстатокКВыгрузке <= ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|			ТОГДА Т1.ОстатокКВыгрузке
	|		ИНАЧЕ ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_ИТОГ
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Доп КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеНулевыеСвободныеОстатки КАК Т2
	|		ПО Т1.Номенклатура = Т2.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки_ДОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(Т.СвободныйОстаток, 0) КАК СвободныйОстаток,
	|	СправочникНоменклатура.КодМДМ,
	|	ВЫБОР
	|		КОГДА НЕ СправочникНоменклатура.КратностьФилиала = 0
	|				И НЕ СправочникНоменклатура.КратностьФилиала = СправочникНоменклатура.Кратность
	|			ТОГДА СправочникНоменклатура.КратностьФилиала
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.ОстатокКВыгрузке КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.ОстатокКВыгрузке >= 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Склад", 			Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМК",	Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",	Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Текст.ДобавитьСтроку(Выборка.КодМДМ+ Символы.Таб +
		СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "") + Символы.Таб + СокрЛП(?(Выборка.Кратность = 0, "", Выборка.Кратность)));
	КонецЦикла;	             
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "updatev2.price");

	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "updatev2.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "updatev2.zip");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	
	
КонецПроцедуры

Процедура ОбновлениеОстатковИЦенВер2() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	Если Константы.База.Получить() = Перечисления.НазваниеБазы.Казань Тогда
		
		ОбновлениеОстатковИЦен_КазаньВер2();
		Возврат;
		
	КонецЕсли;
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин.Получить(), Константы.FTPВыгрузкаОстатковПароль.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			
			Отказ = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;  	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Текст = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
	|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.КодМДМ,
	|	ВЫБОР
	|		КОГДА НЕ СправочникНоменклатура.КратностьФилиала = 0
	|				И НЕ СправочникНоменклатура.КратностьФилиала = СправочникНоменклатура.Кратность
	|			ТОГДА СправочникНоменклатура.КратностьФилиала
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток >= 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(СправочникНоменклатура.КодМДМ КАК СТРОКА(36))) = """"";
	
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	ДанныеПоОстаткамСтрока = "";
	
	Инд = 0;         
	
	Пока Выборка.Следующий() Цикл	
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
			Инд = 0;  
			ДанныеПоОстаткамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = Выборка.КодМДМ + Символы.Таб + СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")
		                 + Символы.Таб + СокрЛП(?(Выборка.Кратность = 0 , "", Выборка.Кратность)); 
		ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоОстаткамСтрока = "" + Символы.ПС; 
	
	Сч = 0;
	
	Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "updatev2.price");

	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "updatev2.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка
		
		Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "updatev2.zip");		
		ЗаписьЖурналаРегистрации("Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	//  Удалить файлик блокировки	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	

КонецПроцедуры

Процедура ОбновлениеОстатковИЦенВер2_2() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес2.Получить();	
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", Константы.FTPВыгрузкаОстатковЛогин2.Получить(), Константы.FTPВыгрузкаОстатковПароль2.Получить(), , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Не удалось установить соединение с FTP. Запись данных на FTP не выполнена.");
		Возврат;
		
	КонецПопытки;
	
	Отказ = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "daemon.lock");	
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("daemon.locK") Тогда
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если Отказ Тогда
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Запись данных на FTP НЕ СОСТОЯЛАСЬ из-за БЛОКИРОВКИ");
		Возврат;
		
	КонецЕсли;	
	
	// Записать файлик блокировки
	Файлик = Новый ТекстовыйДокумент;
	ВремИмя = Строка(Новый УникальныйИдентификатор);
	Файлик.Записать(КаталогВременныхФайлов() + ВремИмя);
	
	Текст = Новый ТекстовыйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Склад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.СвободныйОстаток КАК СвободныйОстатокСклад,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА Т1.СвободныйОстаток <= ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА Т1.СвободныйОстаток
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	Т1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Склад КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО Т1.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.Номенклатура КАК Номенклатура,
	|	Т.СвободныйОстаток,
	|	СправочникНоменклатура.КодМДМ,
	|	ВЫБОР
	|		КОГДА НЕ СправочникНоменклатура.КратностьФилиала = 0
	|				И НЕ СправочникНоменклатура.КратностьФилиала = СправочникНоменклатура.Кратность
	|			ТОГДА СправочникНоменклатура.КратностьФилиала
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток >= 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	НЕ (ВЫРАЗИТЬ(СправочникНоменклатура.КодМДМ КАК СТРОКА(36))) = """"";
	
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСтрокДляЗаписиВТекстовыйДокумент = Новый Массив;
	МаксимальноеКоличествоИтераций = 20000;
	ДанныеПоОстаткамСтрока = "";
	
	Инд = 0;         
	
	Пока Выборка.Следующий() Цикл	
		
		Если Инд = МаксимальноеКоличествоИтераций Тогда
			
			МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
			Инд = 0;  
			ДанныеПоОстаткамСтрока = "";
			
		КонецЕсли; 
		
		ВременнаяСтрока = Выборка.КодМДМ + Символы.Таб + СтрЗаменить(?(Выборка.СвободныйОстаток < 0, 0, Выборка.СвободныйОстаток), Символы.НПП, "")
		                + Символы.Таб + СокрЛП(?(Выборка.Кратность = 0, "", Выборка.Кратность)); 
		ДанныеПоОстаткамСтрока = ДанныеПоОстаткамСтрока + ?(Инд > 0, Символы.ПС, "") + ВременнаяСтрока;
		
		Инд = Инд + 1;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДанныеПоОстаткамСтрока) Тогда
		МассивСтрокДляЗаписиВТекстовыйДокумент.Добавить(ДанныеПоОстаткамСтрока);	
	КонецЕсли;
	
	ИтоговыеДанныеПоОстаткамСтрока = "";
	
	Сч = 0;
	
	Для каждого СтрокаДобавления Из МассивСтрокДляЗаписиВТекстовыйДокумент Цикл
		
		ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + ?(Сч > 0, Символы.ПС, "") + СтрокаДобавления; 			
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИтоговыеДанныеПоОстаткамСтрока = ИтоговыеДанныеПоОстаткамСтрока + Символы.ПС;
	
	Текст.УстановитьТекст(ИтоговыеДанныеПоОстаткамСтрока);
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "updatev2.price");

	ПолноеИмяФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
	ЗаписьАрхива   	     = Новый ЗаписьZipФайла(ПолноеИмяФайлаАрхива);
	ЗаписьАрхива.Добавить(ВременныйКаталог + "updatev2.price", РежимСохраненияПутейZIP.СохранятьОтносительныеПути, РежимОбработкиПодкаталоговZIP.НеОбрабатывать);
	ЗаписьАрхива.Записать();
	
	Попытка

		Соединение.Записать(КаталогВременныхФайлов() + ВремИмя, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "connect.lock");		
		Соединение.Записать(ПолноеИмяФайлаАрхива, ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "\", "") + "updatev2.zip");		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Информация, , ,
		"Запись данных на FTP прошла успешно!");
		
	Исключение
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Ошибка, , ,
		"Блокировки НЕ БЫЛО. Но запись данных на FTP НЕ СОСТОЯЛАСЬ!");
	КонецПопытки;
	
	//  Удалить файлик блокировки	
	Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
	УдалитьФайлы(КаталогВременныхФайлов() + ВремИмя);
	УдалитьФайлы(ВременныйКаталог);
	УдалитьФайлы(ПолноеИмяФайлаАрхива);	
	
КонецПроцедуры

Процедура ОбновлениеОстатковИЦен_КазаньRabbit()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0) < ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладах.КоличествоОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Доп
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладах
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладах.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК ОстатокТоварыНаСкладах,
	|	ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) КАК МК,
	|	ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) КАК МСК,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ВЫБОР
	|					КОГДА ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < 0
	|						ТОГДА 0
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ + ВЫБОР
	|							КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|								ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|							ИНАЧЕ 0
	|						КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0) > 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0) < 0
	|					ТОГДА ЕСТЬNULL(ТоварыОрганизацииМСКОстатки.КоличествоОстаток, 0)
	|				ИНАЧЕ 0
	|			КОНЕЦ - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) < ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ""По организации""
	|		ИНАЧЕ ""По товарам на складах""
	|	КОНЕЦ КАК ТипОстатка
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Склад = &Склад
	|				И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМКОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				Организация = &ОрганизацияМСК
	|					И Склад = &Склад) КАК ТоварыОрганизацииМСКОстатки
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ТоварыОрганизацииМСКОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.Номенклатура КАК Номенклатура,
	|	Т1.ОстатокКВыгрузке КАК ОстатокКВыгрузке_ДОП,
	|	ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0) КАК ОстатокКВыгрузке,
	|	ВЫБОР
	|		КОГДА Т1.ОстатокКВыгрузке <= ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|			ТОГДА Т1.ОстатокКВыгрузке
	|		ИНАЧЕ ЕСТЬNULL(Т2.ОстатокКВыгрузке, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_ИТОГ
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Доп КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеНулевыеСвободныеОстатки КАК Т2
	|		ПО Т1.Номенклатура = Т2.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Т1.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НеНулевыеСвободныеОстатки_ДОП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.СвободныйОстаток КАК Количество,
	|	СправочникНоменклатура.КодМДМ
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.ОстатокКВыгрузке КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки_ИТОГ КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.ОстатокКВыгрузке > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Склад", 			Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМК",	Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ОрганизацияМСК",	Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Товары = Результат.Выгрузить();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
	НовоеСообщение.ТочкаПубликации = Константы.ТочкаОтправки.Получить();
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("ВидСостояния", "ТекущийОстаток");
	СтруктураДокумента.Вставить("ДатаСостояния", ТекущаяДата());
	СтруктураДокумента.Вставить("ДатаВыгрузки", ТекущаяДата());
	СтруктураДокумента.Вставить("Склад", Константы.ОсновнойСклад.Получить().КодМДМ); 
	СтруктураДокумента.Вставить("Товары", ТаблицуВМассив(Товары));
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	НовоеСообщение.Сообщение = JsonСтрока;	
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("status_type", "ТекущийОстаток");
	Заголовки.Добавить("content_type", "application/json");
	Заголовки.Добавить("warehouse_id", Константы.ОсновнойСклад.Получить().КодМДМ);
	Заголовки.Добавить("price_id", Константы.FTPВыгрузкаОстатковКаталог.Получить());
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ОтметкаВремени", AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип", "status"); 
	Свойства.Добавить("ИмяПриложения", Строка(Константы.База.Получить()));
	Свойства.Добавить("РежимДоставки", 2);
	Свойства.Добавить("НомерСообщения", Строка(ID));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла;   	
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;         
	
	НовоеСообщение.Записать();
	
КонецПроцедуры

Процедура ОбновлениеОстатковИЦенRabbit() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков портал", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
	|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникНоменклатура.КодМДМ,
	|	Т.СвободныйОстаток КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Т.СвободныйОстаток > 0";
	
	
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", ТекущаяДата());

	Результат = Запрос.Выполнить();
	Товары = Результат.Выгрузить();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
	НовоеСообщение.Объект = "ОбновлениеОстатковПортал";
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	
	СтруктураДокумента.Вставить("ВидСостояния", "ОбновлениеОстатковПортал");
	СтруктураДокумента.Вставить("ДатаВыгрузки", ТекущаяДата());
	СтруктураДокумента.Вставить("КодПрайсЛиста", Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста); 
	СтруктураДокумента.Вставить("Товары", ТаблицуВМассив(Товары));
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	НовоеСообщение.Сообщение = JsonСтрока;	
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("status_type"  , "ОбновлениеОстатковПортал");
	Заголовки.Добавить("content_type" , "application/json");
	Заголовки.Добавить("warehouse_id" , Константы.ОсновнойСклад.Получить().КодМДМ);
	Заголовки.Добавить("price_id"     , Константы.FTPВыгрузкаОстатковКаталог.Получить());
	Заголовки.Добавить("price_mdmid"  , Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста);
	
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого" , "application/json"); 
	Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип"            , "status"); 
	Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки"  , 2);
	Свойства.Добавить("НомерСообщения" , Строка(ID));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла;   	
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;      
	
	НовоеСообщение.Записать();
	
КонецПроцедуры

Процедура ОбновлениеОстатковИЦенRabbit_2() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление остатков 2", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерке
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки_Склад
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
	|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.СвободныйОстаток КАК СвободныйОстатокСклад,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
	|	ВЫБОР
	|		КОГДА Т1.СвободныйОстаток <= ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА Т1.СвободныйОстаток
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК СвободныйОстаток,
	|	Т1.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
	|ИЗ
	|	НеНулевыеСвободныеОстатки_Склад КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Склад = &Склад
	|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
	|		ПО Т1.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерке.Номенклатура
	|					ИЗ
	|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
	|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ОборотСегодня
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
	|				&НачалоСегодняшнегоДня,
	|				,
	|				,
	|				Склад = &Склад
	|					И НЕ Номенклатура В
	|							(ВЫБРАТЬ
	|								НеНулевыеСвободныеОстатки.Номенклатура
	|							ИЗ
	|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.СвободныйОстаток КАК Количество,
	|	СправочникНоменклатура.КодМДМ
	|ИЗ
	|	(ВЫБРАТЬ
	|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
	|	ИЗ
	|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
	|	ГДЕ
	|		НеНулевыеСвободныеОстатки.СвободныйОстаток > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОборотСегодня.Номенклатура,
	|		0
	|	ИЗ
	|		ОборотСегодня КАК ОборотСегодня) КАК Т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Товары = Результат.Выгрузить();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ВидСостояния", "ТекущийОстаток");
	СтруктураДокумента.Вставить("ДатаСостояния", ТекущаяДата());
	СтруктураДокумента.Вставить("ДатаВыгрузки", ТекущаяДата());
	СтруктураДокумента.Вставить("Склад", Константы.ОсновнойСклад.Получить().КодМДМ); 
	СтруктураДокумента.Вставить("Товары", ТаблицуВМассив(Товары));
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	НовоеСообщение.Сообщение = JsonСтрока;	
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("status_type"  , "ТекущийОстаток");
	Заголовки.Добавить("content_type" , "application/json");
	Заголовки.Добавить("warehouse_id" , Константы.ОсновнойСклад.Получить().КодМДМ);
	Заголовки.Добавить("price_id"     , Константы.FTPВыгрузкаОстатковКаталог1.Получить());
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип"            , "status"); 
	Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки"  , 2);
	Свойства.Добавить("НомерСообщения" , Строка(ID));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла;   	
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;
	
	НовоеСообщение.Записать();

КонецПроцедуры

Функция ТаблицуВМассив(Таблица) Экспорт
	
	МассивДанных = Новый Массив;                                            
	
	Для каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для каждого Колонка ИЗ Таблица.Колонки Цикл			
			СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);				
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;         
	
	Возврат МассивДанных;
	
КонецФункции

Процедура ПлановаяИнвентаризацияТоваров() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Плановая инвентаризация", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ячейки.Ссылка
	|ПОМЕСТИТЬ Ячейки
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|ГДЕ
	|	Ячейки.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|	И Ячейки.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Инвентаризация.Ячейка
	|ПОМЕСТИТЬ Инв
	|ИЗ
	|	РегистрСведений.Инвентаризация КАК Инвентаризация
	|ГДЕ
	|	Инвентаризация.ДатаСоздания >= &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ячейки.Ссылка,
	|	Инв.Ячейка
	|ПОМЕСТИТЬ ИнвЯчейки
	|ИЗ
	|	Ячейки КАК Ячейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Инв КАК Инв
	|		ПО Ячейки.Ссылка = Инв.Ячейка
	|ГДЕ
	|	Инв.Ячейка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	ИнвЯчейки КАК ИнвЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ПО ИнвЯчейки.Ссылка = ТоварыВЯчейкахОстатки.Ячейка
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ " + СтрЗаменить(Строка(Константы.КоличествоЯчеекВДень.Получить()), Символы.НПП, "") + "
	|	ТЗ.Ячейка
	|ПОМЕСТИТЬ ВыхЯчейки
	|ИЗ
	|	ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура,
	|	ТЗ.Ячейка КАК Ячейка,
	|	ТЗ.КоличествоОстаток КАК КоличествоУчетное
	|ИЗ
	|	ВыхЯчейки КАК ВыхЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗ КАК ТЗ
	|		ПО ВыхЯчейки.Ячейка = ТЗ.Ячейка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ячейка";
	
	Запрос.УстановитьПараметр("Дата", Константы.ДатаИнвентаризацииПоследнейЯчейки.Получить());
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Количество() = 0 тогда
		
		Константы.ДатаИнвентаризацииПоследнейЯчейки.Установить(ТекущаяДата());
		Возврат;
		
	КонецЕсли;
	
	сч = 0;
	Док = Документы.ЗаданиеНаИнвентаризацию.СоздатьДокумент();
	Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Док.Склад = Константы.ОсновнойСклад.Получить();
	Док.Дата = ТекущаяДата();
	Док.РегламентноеЗадание = Истина;
	
	ЯчеекВДокументе = Константы.КоличествоЯчеекВЗадании.Получить();
	ТекЯчейка = Неопределено;
	ВсегоЯчеек = 0;
	
	Пока Выб.Следующий() Цикл
		
		Если ТекЯчейка <> Выб.Ячейка тогда
			
			сч = сч+1;
			
			Если сч <= ЯчеекВДокументе тогда
				
				Стр = Док.ИнвентаризируемыеЯчейки.Добавить();
				Стр.ЯчейкаДляИнвентаризации = Выб.Ячейка;
				ВсегоЯчеек = ВсегоЯчеек+1;
				
			КонецЕсли;
			
			ТекЯчейка = Выб.Ячейка;
			
		КонецЕсли;
		
		Если сч <= ЯчеекВДокументе  тогда

		Иначе
			
			Попытка
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Док.Записать(РежимЗаписиДокумента.Запись);
			КонецПопытки;
			
			Док = Документы.ЗаданиеНаИнвентаризацию.СоздатьДокумент();
			Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			Док.Склад = Константы.ОсновнойСклад.Получить();
			Док.Дата = ТекущаяДата();
			Док.РегламентноеЗадание = Истина;
			
			Стр = Док.ИнвентаризируемыеЯчейки.Добавить();
			Стр.ЯчейкаДляИнвентаризации = Выб.Ячейка;
			
			ВсегоЯчеек = ВсегоЯчеек + 1;
			сч = 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Док.ИнвентаризируемыеЯчейки.Количество() > 0 тогда
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Док.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЕсли;
	
	Если ВсегоЯчеек < Константы.КоличествоЯчеекВДень.Получить() тогда
		Константы.ДатаИнвентаризацииПоследнейЯчейки.Установить(ТекущаяДата());
	КонецЕсли;

КонецПроцедуры

Процедура ЗапускОбработки_ОбработкаEMailЗаказов() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная обработка EMail заказов ");
	
	ОбработкаЗапуска = Обработки.ОбработкаВходящихEMailЗаказов.Создать();
	ОбработкаЗапуска.РегалментноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Регламентная обработка EMail заказов", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная обработка EMail заказов ");	  

КонецПроцедуры

Процедура КорректировкаРезервовПоЗаказам() Экспорт 

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Корректировка резервов по заказам покупателей", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Корректировка резервов по заказам покупателей", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!");
	
	ОбработкаЗадания = Обработки.КорректировкаРезервов.Создать();
	ОбработкаЗадания.КорректировкаРезервов();
	
	ЗаписьЖурналаРегистрации("Корректировка резервов по заказам покупателей", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!");

КонецПроцедуры

Процедура ИзмененияКоличестваТоваровВЗаказах() Экспорт  

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!");   
	
	ЗапускРазрешен = Истина;
	
	Если Не ОбщегоНазначения.ЕстьУстановленноеЗначениеРеквизита(Справочники.МТ_ПредопределенныеЗначения.ОтменаДоработок, "UT10-5331") Тогда 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		СтруктураПоиска.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания.АвтоматическийЗапускОбработки_СоздатьДокументПриказНаСборку.ИмяМетода);
		
		МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураПоиска);	 
		
		Если МассивЗаданий.Количество() > 0 Тогда
			ЗапускРазрешен = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗапускРазрешен Тогда
		
		ОбработкаЗадания = Обработки.ИзмененияКоличестваТоваровВЗаказах.Создать();
		ОбработкаЗадания.ОбработатьРегистрВМодуле(); 
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!");

КонецПроцедуры 

Процедура ИзмененияКоличестваТоваровВЗаказахНовое() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Информация, , ,
	"Начало!!");      
	
	МодульИнтеграцииСПорталом.ОбработатьЗапросыИзмененияКоличестваВЗаказах();	
	
	ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено!!");
	
КонецПроцедуры 

Процедура ОбработкаЗаказовВыгруженныхВУТ11() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.ЗаказПоставщику КАК ЗаказПоставщику,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.ГУИДЗаказаПокупателя КАК ГУИДЗаказаПокупателя,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.КодОтправкиАварда КАК КодОтправкиАварда,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.Комментарий КАК Комментарий,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.Обработан,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.НомерСтрокиТовары - 1 КАК НомерСтрокиТовары,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.Номенклатура,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.Количество,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.УИД,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.КомментарийСтрокаТовар,
		|	НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.УспешноОтправленаВАварду
		|ИЗ
		|	РегистрСведений.НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам КАК НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам
		|ГДЕ
		|	НЕ НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.Обработан
		|ИТОГИ ПО
		|	ЗаказПоставщику,
		|	ГУИДЗаказаПокупателя,
		|	КодОтправкиАварда,
		|	Комментарий";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗаказПоставщику = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказПоставщику.Следующий() Цикл
		
		ЗаказОб = ВыборкаЗаказПоставщику.ЗаказПоставщику.ПолучитьОбъект();
	
		ВыборкаГУИДЗаказаПокупателя = ВыборкаЗаказПоставщику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаГУИДЗаказаПокупателя.Следующий() Цикл
			
			ЗаказОб.ГУИДЗаказаПокупателя = ВыборкаГУИДЗаказаПокупателя.ГУИДЗаказаПокупателя;
	
			ВыборкаКодОтправкиАварда = ВыборкаГУИДЗаказаПокупателя.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
			Пока ВыборкаКодОтправкиАварда.Следующий() Цикл
				
				ЗаказОб.КодОтправкиАварда = ВыборкаКодОтправкиАварда.КодОтправкиАварда;
	
				ВыборкаКомментарий = ВыборкаКодОтправкиАварда.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
				Пока ВыборкаКомментарий.Следующий() Цикл
					
					ЗаказОб.Комментарий = ВыборкаКомментарий.Комментарий;
	
					ВыборкаДетальныеЗаписи = ВыборкаКомментарий.Выбрать();
	
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ЗаказОб.Товары[ВыборкаДетальныеЗаписи.НомерСтрокиТовары].Комментарий = ВыборкаДетальныеЗаписи.КомментарийСтрокаТовар;
						ЗаказОб.Товары[ВыборкаДетальныеЗаписи.НомерСтрокиТовары].УспешноОтправленаВАварду = ВыборкаДетальныеЗаписи.УспешноОтправленаВАварду;
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
		НачатьТранзакцию();
		
		Попытка
			
			ЗаказОб.Записать(РежимЗаписиДокумента.Проведение);
			
			НаборЗаписей = РегистрыСведений.НеобработанныеОтветыИзУТ11ПоОтправленнымЗаказам.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.ЗаказПоставщику.Установить(ЗаказОб.Ссылка);
			НаборЗаписей.Прочитать();
			
			Для Каждого Стр Из НаборЗаписей Цикл
				Стр.Обработан = Истина;
			КонецЦикла;
			
			НаборЗаписей.Записать(Истина);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Не удалось обновить документ """ + ЗаказОб + """ данными из регистра ""Необработанные ответы из УТ 11 по отправленным заказам""", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
			
		КонецПопытки;
		
	КонецЦикла; 
	
	//+Гавриленков В. 20.08.2026 #UT10-6016
	// Отправка транзитов для создания Инвойсов
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокПоступление.Ссылка КАК ДокПоступление
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ДокПоступление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТовары
	|		ПО (ПоступлениеТовары.Ссылка = ДокПоступление.Ссылка)
	|			И (ПоступлениеТовары.ЗаказПоставщику.ТранзитнаяПоставкаЧерезСкладWMS = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаказИзСделки
	|		ПО ДокПоступление.Сделка = ЗаказИзСделки.Ссылка
	|			И (ЗаказИзСделки.ТранзитнаяПоставкаЧерезСкладWMS = ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойстваИнвойса
	|		ПО (СвойстваИнвойса.Объект = ДокПоступление.Ссылка)
	|			И (СвойстваИнвойса.Свойство = &СвойствоIDИнвойса)
	|ГДЕ
	|	ДокПоступление.Дата >= &Дата
	|	И ДокПоступление.Проведен
	|	И (ПоступлениеТовары.Ссылка ЕСТЬ НЕ NULL 
	|			ИЛИ ЗаказИзСделки.Ссылка ЕСТЬ НЕ NULL )
	|	И (СвойстваИнвойса.Значение ЕСТЬ NULL
	|			ИЛИ СвойстваИнвойса.Значение = """")";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 86400); 
	//+Гавриленков В. 28.08.2026 #UT10-6026
	Запрос.УстановитьПараметр("СвойствоIDИнвойса", ПланыВидовХарактеристик.СвойстваОбъектов.IDИнвойса); 
	//-Гавриленков В. 28.08.2026 #UT10-6026
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МСКWEB.ОтправитьПТУВУТ11(Выборка.ДокПоступление);
	КонецЦикла;
	//-Гавриленков В. 20.08.2026 #UT10-6016
	
КонецПроцедуры

Процедура ТоварыГруппыZДляГоловногоФилиала() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда
		
		ЗаписьЖурналаРегистрации("Товары группы Z для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура.КодМДМ
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Склад = &ОсновнойСклад
		|				И Номенклатура.ГруппаАВС.Наименование ПОДОБНО ""Z%"") КАК ТоварыНаСкладахОстатки
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ТипЦен = &Скидка38) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		|	И ЦеныНоменклатурыСрезПоследних.Цена > 0";
	
	Запрос.УстановитьПараметр("ОсновнойСклад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("Скидка38", Константы.Скидка38.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Товары = РезультатЗапроса.Выгрузить();
		
		НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
		НовоеСообщение.ОбменДанными.Загрузка = Истина;
		НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
		НовоеСообщение.Объект = "ТоварыГруппыZДляГоловногоФилиала";
		НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
		
		ID = Новый УникальныйИдентификатор();     	
		НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
		
		СтруктураДокумента = Новый Структура;
		
		СтруктураДокумента.Вставить("ВидДокумента"   , "ТоварыГруппыZДляГоловногоФилиала");
		СтруктураДокумента.Вставить("ТипСодержимого" , "application/json");
		СтруктураДокумента.Вставить("ДатаВыгрузки"   , Формат(ТекущаяДата(), "ДЛФ=DT"));
		СтруктураДокумента.Вставить("ИмяБазы"        , СокрЛП(Константы.База.Получить())); 
		СтруктураДокумента.Вставить("Товары"         , МодульРегламентныхЗаданий.ТаблицуВМассив(Товары));
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет , , Истина);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
		JsonСтрока = ЗаписьJSON.Закрыть();   
		
		НовоеСообщение.Сообщение = JsonСтрока;	
		
		ЗаголовкиСообщения = Новый СписокЗначений;
		ЗаголовкиСообщения.Добавить("document_type" , "ТоварыГруппыZДляГоловногоФилиала");
		ЗаголовкиСообщения.Добавить("content_type"  , "application/json");
		ЗаголовкиСообщения.Добавить("base_name"     , Константы.База.Получить());
		
		Свойства = Новый СписокЗначений;
		Свойства.Добавить("ТипСодержимого" , "application/json"); 
		Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
		Свойства.Добавить("Тип"            , "status"); 
		Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
		Свойства.Добавить("РежимДоставки"  , 2);
		Свойства.Добавить("НомерСообщения" , Строка(ID));
		
		Для Каждого Свойство Из Свойства Цикл
			
			НоваяСтрока              = НовоеСообщение.Свойства.Добавить();
			НоваяСтрока.Наименование = Свойство.Значение;
			НоваяСтрока.Значение     = Свойство.Представление;
			
		КонецЦикла;   	
		
		Если ЗначениеЗаполнено(ЗаголовкиСообщения) Тогда
			
			Для Каждого Заголовок Из ЗаголовкиСообщения Цикл
				
				НоваяСтрока              = НовоеСообщение.Заголовки.Добавить();
				НоваяСтрока.Наименование = Заголовок.Значение;
				НоваяСтрока.Значение     = Заголовок.Представление;
				
			КонецЦикла;   
			
		КонецЕсли;
		
		НовоеСообщение.Записать();
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Товары группы Z для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отстутствуют товары группы Z с ненулевыми свободными остатками");
		Возврат;
		
	КонецЕсли; 
	
КонецПроцедуры


Процедура ЗаписатьОшибкуВыгрузкиОстатковЦен(Задание , Набор , УдалитьЗаписи , ЕстьОшибка)
	
	Если УдалитьЗаписи Тогда
		Набор.Очистить();		
	КонецЕсли;
	
	Запись = Набор.Добавить();
	Запись.ДатаВыполнения = ТекущаяДата();
	Запись.Ошибка = ЕстьОшибка;
	Запись.Задание = Задание;
	
	Набор.Записать();

КонецПроцедуры

Процедура УдалениеConnectLockНаСервере() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Поиск и удаление connect lock на сервере", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Удаление файла connect lock.Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = Константы.FTPВыгрузкаОстатковАдрес.Получить();
	
	Если Не ЗначениеЗаполнено(ИмяFTPСервера) Тогда
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Отменена попытка соединения с FTP: не заполнен адрес FTP сервера в константах.");
		Возврат;
		
	КонецЕсли;
	
	ЛогинFTPСервера = Константы.FTPВыгрузкаОстатковЛогин.Получить();
	ПарольFTPСервера = Константы.FTPВыгрузкаОстатковПароль.Получить();
	
	ЗаданаПапкаДляFTP = СокрЛП(Константы.FTPВыгрузкаОстатковКаталог.Получить());
	ИмяКаталогаСервера = ИмяКаталогаСервера + ?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), "" + ЗаданаПапкаДляFTP + "/", "");
	
	Попытка
		Соединение = Новый FTPСоединение(ИмяFTPСервера, "21", ЛогинFTPСервера,  ПарольFTPСервера, , Истина);
	Исключение
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Не удалось установить соединение с FTP. Удаление файла connect.lock не выполнено.");
		Возврат;
		
	КонецПопытки;
	
	ФайлНайден = Ложь;
	
	МассивНайденныхФайловНаСервере = Соединение.НайтиФайлы(ИмяКаталогаСервера + "connect.lock");
	
	Для Каждого ТекСтр Из МассивНайденныхФайловНаСервере Цикл
		
		Если ВРег(ТекСтр.Имя) = ВРег("connect.lock") Тогда
			
			ФайлНайден = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ФайлНайден Тогда
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Завершение", УровеньЖурналаРегистрации.Информация,,, "Файл connect lock не найден на сервере.");
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Метаданные", Метаданные.РегламентныеЗадания.ОбновлениеОстатковИЦенПолное);
	МассивРегЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(СтруктураОтбора);
	
	Если МассивРегЗаданий.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
		"Регламентное задание ""Полное обновление остатков и цен"" не найдено." + Символы.ПС + ОписаниеОшибки());
		Возврат;
		
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяМетода", МассивРегЗаданий[0].Метаданные.ИмяМетода);
	СтруктураПоиска.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураПоиска);
	
	Если МассивЗаданий.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Завершение", УровеньЖурналаРегистрации.Информация,,, 
		"Файл connect.lock НЕ БЫЛ удален по причине активного фонового задания");
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		Соединение.Удалить(?(ЗначениеЗаполнено(ЗаданаПапкаДляFTP), ЗаданаПапкаДляFTP + "/", "") + "connect.lock");
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Обработка", УровеньЖурналаРегистрации.Информация,,, "Файл connect.lock успешно удален");
		
	Исключение
		ЗаписьЖурналаРегистрации("Удаление файла connect lock.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при удалении файла connect.lock" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Удаление файла connect lock.Завершение", УровеньЖурналаРегистрации.Информация,,,);

КонецПроцедуры

Процедура ЗагрузкаОстатковДопПоставщика() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Загрузка остатков доп поставщика", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	Если НЕ Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() Тогда
		
		ЗаписьЖурналаРегистрации("Загрузка остатков доп поставщика", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Не установлена константа Пополнение для обособленного подразделения юр.лица");
		Возврат; 		
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Загрузка остатков доп поставщика", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная Загрузка остатков доп поставщика");
	
	Попытка		
		
		ВСПрокси = МСКWEB.СоздатьПодключение(Ложь, "");
		Ответ = ВСПрокси.GetRemainsDetachedDivision();
		
		Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда		
			
			Данные = МСКWEB.ХранилищеJSONВСтруктуру(Ответ);		
			
			Если ТипЗнч(Данные) = Тип("Структура") Тогда			
				
				ТаблицаОстатков = Данные.СписокДанных;
				
				Если ТаблицаОстатков.Количество() >= 0 Тогда
					
					Для Каждого СтрокаТаблОстатков ИЗ ТаблицаОстатков Цикл
						
						Если СтрокаТаблОстатков.СвободныйОстаток > 0
							ИЛИ СтрокаТаблОстатков.СвободныйОстатокТОХ > 0 Тогда										
							
							Если ЗначениеЗаполнено(СтрокаТаблОстатков.КодМДМ) Тогда
								
								ЕстьНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаТаблОстатков.КодМДМ);
								
								Если ЕстьНоменклатура.Пустая() Тогда
									
									Если ЗначениеЗаполнено(СтрокаТаблОстатков.КодМДМ) Тогда
										ЕстьНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", СтрокаТаблОстатков.Артикул); 										
									КонецЕсли;
									
								КонецЕсли;
								
							КонецЕсли;
							
							Если НЕ ЕстьНоменклатура.Пустая() Тогда
								
								ЕстьЗаписьВРегистре = РегистрыСведений.МосковскиеОстаткиНоменклатуры.Получить(Новый Структура("Номенклатура", ЕстьНоменклатура));
								МенеджерЗаписи = РегистрыСведений.МосковскиеОстаткиНоменклатуры.СоздатьМенеджерЗаписи();
								
								Если ЕстьЗаписьВРегистре.Количество()<1 Тогда                                           									
									
									МенеджерЗаписи.Номенклатура = ЕстьНоменклатура;
									МенеджерЗаписи.Количество   = 0 ;
									МенеджерЗаписи.КоличествоДопПоставщика = СтрокаТаблОстатков.СвободныйОстаток;
									МенеджерЗаписи.КоличествоДопПоставщикаТОХ = СтрокаТаблОстатков.СвободныйОстатокТОХ; 
									
								Иначе
									
									МенеджерЗаписи.Номенклатура = ЕстьНоменклатура;
									МенеджерЗаписи.Количество   = ЕстьЗаписьВРегистре.Количество ;
									МенеджерЗаписи.КоличествоДопПоставщика = СтрокаТаблОстатков.СвободныйОстаток;
									МенеджерЗаписи.КоличествоДопПоставщикаТОХ = СтрокаТаблОстатков.СвободныйОстатокТОХ; 
									
								КонецЕсли;		
								
								МенеджерЗаписи.Записать();	
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЦикла;					
					
				КонецЕсли;			
				
			КонецЕсли;		
			
		КонецЕсли;
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации("Загрузка остатков доп поставщика", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная Загрузка остатков доп поставщика");	

КонецПроцедуры

Процедура ПоискНоменклатурыБезЕдиницИзмерения() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Номенклатура без единиц измерения.Предупреждение", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Номенклатура без единиц измерения.Начало", УровеньЖурналаРегистрации.Информация, , ,
	"Начат поиск номенклатуры без единиц измерения");
	
	ЗапросНоменклатуры = Новый Запрос; 
	ЗапросНоменклатуры.Текст =	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	(Номенклатура.ЕдиницаХраненияОстатков = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ИЛИ Номенклатура.ЕдиницаДляОтчетов = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И НЕ Номенклатура.Артикул ПОДОБНО ""%DMG""";
	
	РезультатЗапросаНоменклатуры = ЗапросНоменклатуры.Выполнить();
	
	Если НЕ РезультатЗапросаНоменклатуры.Пустой() Тогда
		
		ВыборкаЗапросаНоменклатуры = РезультатЗапросаНоменклатуры.Выбрать();
		СписокТоваров = "";
		
		Пока ВыборкаЗапросаНоменклатуры.Следующий() Цикл
			СписокТоваров = СписокТоваров + ?(СписокТоваров = "", "", ";") + СокрЛП(ВыборкаЗапросаНоменклатуры.Артикул);
		КонецЦикла;
		
		Если НЕ СписокТоваров = "" Тогда
			ЗаписьЖурналаРегистрации("Номенклатура без единиц измерения.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , 
			"Список товаров без единиц измерения :"+ Символы.ПС+ СокрЛП(СписокТоваров) + "");
		КонецЕсли;		
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Номенклатура без единиц измерения.Конец", УровеньЖурналаРегистрации.Информация, , ,
	"Закончен поиск номенклатуры без единиц измерения");

КонецПроцедуры

Процедура ФормированиеИОтправкаОтчетПоНеотгруженнымТоварамСтороннихСкладов() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка ежедневного отчета на "+ТекущаяДата() + "");
	
	ОбработкаЗапуска = Обработки.НеотгруженныеТоварыСтороннихСкладов.Создать();
	ОбработкаЗапуска.СформироватьРегламентом();
	
	ЗаписьЖурналаРегистрации("Отправка отчета по неотгруженным товарам сторонних складов", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка ежедневного отчета на "+ТекущаяДата() + ""); 

КонецПроцедуры

Процедура ОчисткаКратностиФилиалаДляТоваровСНулевымиОстатками() Экспорт 

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Очистка кратности филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Очистка кратности филиала", УровеньЖурналаРегистрации.Информация, , ,
	"Начата очистка кратности филиала для товаров с 0 остатком");
	
	ОбработкаЗапуска = Обработки.ОчисткаКратностиФилиалаПриНулевыхОстатках.Создать();
	ОбработкаЗапуска.ОчиститьКратность();
	
	ЗаписьЖурналаРегистрации("Очистка кратности филиала", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена очистка кратности филиала для товаров с 0 остатком");

КонецПроцедуры

Процедура МониторингФоновыхЗаданий() Экспорт 

	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Состояние", СостояниеФоновогоЗадания.Активно); 
	
	МассивЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(СтруктураПоиска); 
	
	Если МассивЗаданий.Количество() > 0 Тогда 
		
		ЗапросНастроек = Новый Запрос;
		ЗапросНастроек.Текст =
		"ВЫБРАТЬ
		|	НастройкиМониторингаРегламентныхЗаданий.РегламентноеЗадание,
		|	НастройкиМониторингаРегламентныхЗаданий.МаксимальноеВремяВыполнения
		|ИЗ
		|	РегистрСведений.НастройкиМониторингаРегламентныхЗаданий КАК НастройкиМониторингаРегламентныхЗаданий
		|ГДЕ
		|	НастройкиМониторингаРегламентныхЗаданий.МаксимальноеВремяВыполнения <> 0"; 
		
		ТаблицаНастроек = ЗапросНастроек.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	СтандартноеВремяВыполнения = 60*40;
	
	Для Каждого ФонЗадание Из МассивЗаданий Цикл 
		
		НайденнаяСтрока = ?(ФонЗадание.РегламентноеЗадание = Неопределено, Неопределено, ТаблицаНастроек.Найти(ФонЗадание.РегламентноеЗадание.Метаданные.Имя, "РегламентноеЗадание")); 		
		
		МаксВремяВыполнения = ?(НайденнаяСтрока = Неопределено, СтандартноеВремяВыполнения, НайденнаяСтрока.МаксимальноеВремяВыполнения);
		
		ПревышеноВремяВыполнения = (ФонЗадание.Начало + МаксВремяВыполнения) < ТекущаяДата();
		
		Если ПревышеноВремяВыполнения Тогда
			
			СтруктураЗависшего = Новый Структура("Идентификатор, Наименование, ИмяМетода, ДатаНачала, МаксимальноеВремяВыполнения");
			
			СтруктураЗависшего.Идентификатор = Строка(ФонЗадание.УникальныйИдентификатор);
			СтруктураЗависшего.Наименование = ФонЗадание.Наименование;
			СтруктураЗависшего.ИмяМетода = ФонЗадание.ИмяМетода;
			СтруктураЗависшего.ДатаНачала = Формат(ФонЗадание.Начало, "ДЛФ=DT");  
			СтруктураЗависшего.МаксимальноеВремяВыполнения = МаксВремяВыполнения;
			
			ЗаписьЖурналаРегистрации("Мониторинг фоновых заданий.Зависшие", УровеньЖурналаРегистрации.Предупреждение,,, Чеки.ВернутьJSON(СтруктураЗависшего));
			
		КонецЕсли; 			
		
	КонецЦикла;  
	
КонецПроцедуры

Процедура ОтправкаЗаказовПоставщикамВSI() Экспорт

	ЗаписьЖурналаРегистрации("Отправка заказов поставшиков в SI", УровеньЖурналаРегистрации.Информация, , ,
	"Начата регламентная отправка закадов поставщиков в SI");
	
	ОбработкаОтправки = Обработки.СозданиеИОтправкаЗаказовСтороннимСкладам.Создать();
	
	ОбработкаОтправки.ДатаОтбора = ТекущаяДата();
	
	Результат = ОбработкаОтправки.ОтправитьЗаказыВSI();
	Если Не Результат = "" Тогда 
		ЗаписьЖурналаРегистрации("Отправка заказов поставшиков в SI", УровеньЖурналаРегистрации.Ошибка, , ,
		"" + Результат);
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Отправка заказов поставшиков в SI", УровеньЖурналаРегистрации.Информация, , ,
	"Закончена регламентная отправка закадов поставщиков в SI");
	
КонецПроцедуры

Процедура ABCXYZАнализДляФилиала() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("ABC/XYZ анализ для филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("ABC/XYZ анализ для филиала", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное ABC/XYZ анализ для филиала ");
	
	ОбработкаЗапуска = Обработки.РасчетАВСФилиала.Создать();
	ОбработкаЗапуска.РасчетИУстановкаABCXYZПоказателей();
	
	ЗаписьЖурналаРегистрации("ABC/XYZ анализ для филиала", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное ABC/XYZ анализ для филиала");

КонецПроцедуры

Процедура СоздатьЗаказПоставщику(Знач КодМДМПоставщика) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодМДМПоставщика) Тогда
		
		ЕстьКонтрагентСКодомМДМ = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",КодМДМПоставщика);
		
		Если НЕ ЕстьКонтрагентСКодомМДМ.Пустая() Тогда
			
			Если ЕстьКонтрагентСКодомМДМ = Константы.ДопПоставщик.Получить() Тогда
				ПоОсновномуПоставщику = Ложь; 			
			ИначеЕсли ЕстьКонтрагентСКодомМДМ = Константы.ОсновнойПоставщик.Получить() Тогда
				ПоОсновномуПоставщику = Истина; 
			Иначе
				
				ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Отменена работа регламентного задания : Контрагент "+ СокрЛП(ЕстьКонтрагентСКодомМДМ.Наименование) + " с кодом МДМ : "+ СокрЛП(КодМДМПоставщика) 
				+ " не является основным или доп.поставщиком");
				
				Возврат;
				
			КонецЕсли;
			
		Иначе  
			
			ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Отменена работа регламентного задания : Не найден контрагент с кодом МДМ : "+ СокрЛП(КодМДМПоставщика));
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания : Не указан код МДМ для поставщика");
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное создание заказа поставщику на пополнение по "+?(ПоОсновномуПоставщику, "основному ", "доп. ") + "поставщику");
	
	
	Если ПоОсновномуПоставщику Тогда
		ОбработкаРегламентная = Обработки.СоздатьЗаказПоставщику.Создать();
	Иначе
		ОбработкаРегламентная = Обработки.ПополнениеДляОбособленногоПодразделенияЮрЛица.Создать();
	КонецЕсли;  
	
	ОбработкаРегламентная.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Регламентное : Создать заказ поставщику на пополнение по выбранному поставщику", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное создание заказа поставщику на пополнение по "+?(ПоОсновномуПоставщику, "основному", "доп.") + " поставщику");

КонецПроцедуры

Процедура ФормированиеЗаказаПоставщикуПополнениеНаОснованиеМатрицы(Знач КодМДМПоставщика) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнение на основание матрицы", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		
		Возврат;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КодМДМПоставщика) Тогда
		
		ЕстьКонтрагентСКодомМДМ = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",КодМДМПоставщика);
		
		Если НЕ ЕстьКонтрагентСКодомМДМ.Пустая() Тогда
			
			Если ЕстьКонтрагентСКодомМДМ = Константы.ДопПоставщик.Получить() Тогда
				ПоОсновномуПоставщику = Ложь; 			
			ИначеЕсли ЕстьКонтрагентСКодомМДМ = Константы.ОсновнойПоставщик.Получить() Тогда
				ПоОсновномуПоставщику = Истина; 
			Иначе
				
				ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнение на основание матрицы", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Отменена работа регламентного задания : Контрагент "+ СокрЛП(ЕстьКонтрагентСКодомМДМ.Наименование) + " с кодом МДМ : "+ СокрЛП(КодМДМПоставщика) 
				+ " не является основным или доп.поставщиком");
				
				Возврат;
				
			КонецЕсли;
			
		Иначе  
			
			ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнение на основание матрицы", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Отменена работа регламентного задания : Не найден контрагент с кодом МДМ : "+ СокрЛП(КодМДМПоставщика));
			
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнение на основание матрицы", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания : Не указан код МДМ для поставщика");
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнеиние на основание матрицы", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Формирование заказа поставщику пополнение на основание матрицы по "+?(ПоОсновномуПоставщику, "основному ", "доп. ") + "поставщику");
	
	
	ОбработкаРегламентная = Обработки.ФормированиеЗаказаПоставщикуНаОсновеМатрицы.Создать();
	ОбработкаРегламентная.ПоОсновномуПоставщику = ПоОсновномуПоставщику; 
	ОбработкаРегламентная.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Регламентное : Формирование заказа поставщику пополнение на основание матрицы", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Формирование заказа поставщику пополнение на основание матрицы по "+?(ПоОсновномуПоставщику, "основному", "доп.") + " поставщику");

КонецПроцедуры  

Процедура ФормированиеВыкуповТОХ() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Формирование выкупов ТОХ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Формирование выкупов ТОХ", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Формирование выкупов ТОХ ");
	
	ОбработкаЗапуска = Обработки.РегламентноеФормированиеВыкуповТОХ.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Формирование выкупов ТОХ", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Формирование выкупов ТОХ");

КонецПроцедуры

Процедура ФормированиеВыкуповТОХДляАвтоматическойОтправки() Экспорт
	
	//+Сёмин Р.И. 06.08.2026 #UT10-5989
	ИмяСобытия = "Формирование выкупов ТОХ для автоматической отправки";
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , ,
			"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ"
		);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		"Начато регламентное задание " + ИмяСобытия
	);
	
	ОбработкаЗапуска = Обработки.РегламентноеФормированиеВыкуповТОХ.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение(Истина);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		"Закончено регламентное задание " + ИмяСобытия
	);
	//-Сёмин Р.И. 06.08.2026 #UT10-5989

КонецПроцедуры

Процедура СнятиеФлагаНоменклатурыНеЗагружатьЦены() Экспорт
	
	НаименованиеРегЗадания = "Снятие флага номенклатуры Не загружать цены";
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда   
		
		ЗаписьЖурналаРегистрации(НаименованиеРегЗадания + ". Предупреждение", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;                          
		
	КонецЕсли; 
	
	ЗаписьЖурналаРегистрации(НаименованиеРегЗадания + ". Начало", УровеньЖурналаРегистрации.Информация, , ,
	"Начато " + НаименованиеРегЗадания);                   
	
	Запрос = Новый Запрос; 
	Запрос.Текст =	
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
	|	И ПоступлениеТоваровУслуг.Дата >= &ДатаНач
	|	И ПоступлениеТоваровУслуг.Дата <= &ДатаКон
	|	И НЕ ПоступлениеТоваровУслуг.Экспресс
	|	И ПоступлениеТоваровУслуг.Контрагент = &ОсновнойПоставщик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = ВТ_Документы.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара" ;     
	
	Запрос.УстановитьПараметр("ДатаНач",           НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон",           КонецДня(ТекущаяДата() + 86400));  
	Запрос.УстановитьПараметр("ОсновнойПоставщик", Константы.ОсновнойПоставщик.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();    
	
	Если НЕ РезультатЗапроса.Пустой() Тогда         
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл   
			
			СпрОбъект = Выборка.Номенклатура.ПолучитьОбъект();
			СпрОбъект.НеЗагружатьЦеныЕслиЕстьОстатокТовара = Ложь;     
			
			Попытка
				СпрОбъект.Записать(); 
			Исключение        
				ЗаписьЖурналаРегистрации(НаименованиеРегЗадания + ". Ошибка", УровеньЖурналаРегистрации.Ошибка,,, 
				"Ошибка при записи номенклатуры: " + Строка(Выборка.Номенклатура)
				+ ", код производителя " + Выборка.КодПроизводителя + ": " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;               
		
	КонецЕсли;	 
	
	ЗаписьЖурналаРегистрации(НаименованиеРегЗадания + ". Конец", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено " + НаименованиеРегЗадания);
	
КонецПроцедуры

Процедура ЗаполнениеПоставщикаВРекламационныхЗаявкахНаВозврат()Экспорт 

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Заполнение поставщика в рекламационных заявках на возврат", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Заполнение поставщика в рекламационных заявках на возврат", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Заполнение поставщика в рекламационных заявках на возврат");
	
	ОбработкаЗапуска = Обработки.ЗаполнениеПоставщикаВРекламационныхЗаявкахНаВозврат.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Заполнение поставщика в рекламационных заявках на возврат", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Заполнение поставщика в рекламационных заявках на возврат");

КонецПроцедуры

Процедура ПроверитьЭтапЭкспертизы() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Проверить этап экспертизы", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Проверить этап экспертизы", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Проверить этап экспертизы");
	
	ОбработкаЗапуска = Обработки.ПроверитьЭтапЭкспертизы.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Проверить этап экспертизы", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Проверить этап экспертизы");

КонецПроцедуры

Процедура ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Ввод возврата и корректировки на экспертизные заявки на возврат", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Ввод возврата и корректировки на экспертизные заявки на возврат", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Ввод возврата и корректировки на экспертизные заявки на возврат");
	
	ОбработкаЗапуска = Обработки.ВводВозвратаИКорректировкиНаЭкспертизныеЗаявкиНаВозврат.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Ввод возврата и корректировки на экспертизные заявки на возврат", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Ввод возврата и корректировки на экспертизные заявки на возврат");

КонецПроцедуры

Процедура СозданиеВходящейСлужебнойЗаписки() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Создание входящей служебной записки", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Создание входящей служебной записки", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Создание входящей служебной записки");
	
	ОбработкаЗапуска = Обработки.СозданиеВходящейСлужебнойЗаписки.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Создание входящей служебной записки", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Создание входящей служебной записки");	

КонецПроцедуры

Процедура АвтоматическоеЗакрытиеКассовойСмены() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Автоматическое закрытие кассовой смены", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации("Автоматическое закрытие кассовой смены", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Автоматическое закрытие кассовой смены");
	
	ОбработкаЗапуска = Обработки.АвтоматическоеЗакрытиеКассовыхСмен.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Автоматическое закрытие кассовой смены", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Автоматическое закрытие кассовой смены");	

КонецПроцедуры

Процедура ФормированиеИОтправкаОтчетаПоМетрикамТОХ() Экспорт  
				  
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Формирование и отправка отчета по метрикам ТОХ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ОтчетОтправки = Отчеты.ОтчетПоОстаткамТОХ.Создать();	
	ОтчетОтправки.ОтправкаПисем();

КонецПроцедуры 

Процедура ПроверкаВремениРазмещенияПТУ() Экспорт  
				  
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Проверка времени размещения документов ПТУ И ПТОХ", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Проверка времени размещения документов ПТУ И ПТОХ", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Проверка времени размещения документов ПТУ И ПТОХ");
	
	ОбработкаЗапуска = Обработки.ПроверкаВремениРазмещенияПТУиПТОХ.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации("Проверка времени размещения документов ПТУ И ПТОХ", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Проверка времени размещения документов ПТУ И ПТОХ");	

КонецПроцедуры

Процедура ТоварыБезЦенДляГоловногоФилиала() Экспорт 

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Товары без цен для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ");
		Возврат;
		
	КонецЕсли;
	
	//Заполненние соответствия типов цен и колонок
	СписокТиповЦен = Новый СписокЗначений; 
	
	Если ЗначениеЗаполнено(Константы.БазоваяЦена.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.БазоваяЦена.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Скидка35.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Скидка35.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Скидка36.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Скидка36.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Скидка37.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Скидка37.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Скидка38.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Скидка38.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.СпецЦена.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.СпецЦена.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Акция.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Акция.Получить()); 
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.Резерв4.Получить()) Тогда 
		СписокТиповЦен.Добавить(Константы.Резерв4.Получить()); 
	КонецЕсли;
	
	Если НЕ СписокТиповЦен.Количество() = 0 Тогда
		
		ЗапросТоваровБезЦен = Новый Запрос;
		ЗапросТоваровБезЦен.Текст =
		"ВЫБРАТЬ
		|	ТипыЦенНоменклатуры.Ссылка КАК ТипЦены
		|ПОМЕСТИТЬ ВТ_СписокТиповЦен
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|ГДЕ
		|	ТипыЦенНоменклатуры.Ссылка В(&СписокТиповЦен)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокНаСкладах
		|ПОМЕСТИТЬ ВТ_НеНулевыеОстаткиНаСкладах
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И НЕ Номенклатура.КодМДМ = """") КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеНулевыеОстаткиНаСкладах.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_НеНулевыеОстаткиНаСкладах.СвободныйОстатокНаСкладах <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
		|			ТОГДА ВТ_НеНулевыеОстаткиНаСкладах.СвободныйОстатокНаСкладах
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
		|	КОНЕЦ КАК СвободныйОстаток
		|ПОМЕСТИТЬ ВТ_СвободныеОстатки
		|ИЗ
		|	ВТ_НеНулевыеОстаткиНаСкладах КАК ВТ_НеНулевыеОстаткиНаСкладах
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ВТ_НеНулевыеОстаткиНаСкладах.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ) КАК ТоварыВСборкеОстатки
		|		ПО ВТ_НеНулевыеОстаткиНаСкладах.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, Склад = &Склад) КАК ТоварыВЯчейкахОстатки
		|		ПО ВТ_НеНулевыеОстаткиНаСкладах.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СвободныеОстатки.Номенклатура
		|ПОМЕСТИТЬ ВТ_ТоварыСОстатком
		|ИЗ
		|	ВТ_СвободныеОстатки КАК ВТ_СвободныеОстатки
		|ГДЕ
		|	ВТ_СвободныеОстатки.СвободныйОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ПОМЕСТИТЬ ВТ_ТоварыССебестоимостью
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_ТоварыСОстатком.Номенклатура
		|					ИЗ
		|						ВТ_ТоварыСОстатком)
		|				И ТипЦен = &Себестоимость) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыССебестоимостью.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыССебестоимостью.Цена КАК Себестоимость
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	ВТ_ТоварыССебестоимостью КАК ВТ_ТоварыССебестоимостью
		|ГДЕ
		|	НЕ ВТ_ТоварыССебестоимостью.Цена = 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_СписокТиповЦен.ТипЦены КАК ТипЦены
		|ПОМЕСТИТЬ ВТ_ТоварыСТипамиЦен
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары,
		|	ВТ_СписокТиповЦен КАК ВТ_СписокТиповЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.ТипЦен,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Товары.Номенклатура
		|					ИЗ
		|						ВТ_Товары)
		|				И ТипЦен В
		|					(ВЫБРАТЬ
		|						ВТ_СписокТиповЦен.ТипЦены
		|					ИЗ
		|						ВТ_СписокТиповЦен)) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ТоварыСТипамиЦен.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыСТипамиЦен.ТипЦены КАК ТипЦены,
		|	ВТ_ЦеныНоменклатуры.Цена
		|ПОМЕСТИТЬ ВТ_ПромИтог
		|ИЗ
		|	ВТ_ТоварыСТипамиЦен КАК ВТ_ТоварыСТипамиЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатуры КАК ВТ_ЦеныНоменклатуры
		|		ПО ВТ_ТоварыСТипамиЦен.Номенклатура = ВТ_ЦеныНоменклатуры.Номенклатура
		|			И ВТ_ТоварыСТипамиЦен.ТипЦены = ВТ_ЦеныНоменклатуры.ТипЦен
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	ТипЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_ПромИтог.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_ПромИтог КАК ВТ_ПромИтог
		|ГДЕ
		|	ВТ_ПромИтог.Цена ЕСТЬ NULL
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Первые 1000 
		|	ВТ_Итог.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
		|	ВТ_Товары.Себестоимость
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Товары КАК ВТ_Товары
		|		ПО ВТ_Итог.Номенклатура = ВТ_Товары.Номенклатура";
		
		ЗапросТоваровБезЦен.УстановитьПараметр("Себестоимость"  , Константы.ЦенаСебестоимость.Получить());
		ЗапросТоваровБезЦен.УстановитьПараметр("Склад"          , Константы.ОсновнойСклад.Получить());
		ЗапросТоваровБезЦен.УстановитьПараметр("СписокТиповЦен" , СписокТиповЦен);
		
		РезультатЗапросаТоваровБезЦен = ЗапросТоваровБезЦен.Выполнить();
		
		Если НЕ РезультатЗапросаТоваровБезЦен.Пустой() Тогда
			
			Товары = РезультатЗапросаТоваровБезЦен.Выгрузить();
			
			НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
			НовоеСообщение.ОбменДанными.Загрузка = Истина;
			НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
			НовоеСообщение.Объект = "ТоварыБезЦенДляГоловногоФилиала";
			НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
			
			ID = Новый УникальныйИдентификатор();     	
			НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
			
			СтруктураДокумента = Новый Структура;
			
			СтруктураДокумента.Вставить("ВидДокумента"   , "ТоварыБезЦенДляГоловногоФилиала");
			СтруктураДокумента.Вставить("ТипСодержимого" , "application/json");
			СтруктураДокумента.Вставить("ДатаВыгрузки"   , Формат(ТекущаяДата(), "ДЛФ=DT"));
			СтруктураДокумента.Вставить("ИмяБазы"        , СокрЛП(Константы.База.Получить())); 
			СтруктураДокумента.Вставить("Товары"         , МодульРегламентныхЗаданий.ТаблицуВМассив(Товары));
			
			ЗаписьJSON = Новый ЗаписьJSON();
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет , , Истина);
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
			ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
			JsonСтрока = ЗаписьJSON.Закрыть();   
			
			НовоеСообщение.Сообщение = JsonСтрока;	
			
			ЗаголовкиСообщения = Новый СписокЗначений;
			ЗаголовкиСообщения.Добавить("document_type" , "ТоварыБезЦенДляГоловногоФилиала");
			ЗаголовкиСообщения.Добавить("content_type"  , "application/json");
			ЗаголовкиСообщения.Добавить("base_name"     , Константы.База.Получить());
			
			Свойства = Новый СписокЗначений;
			Свойства.Добавить("ТипСодержимого" , "application/json"); 
			Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
			Свойства.Добавить("Тип"            , "status"); 
			Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
			Свойства.Добавить("РежимДоставки"  , 2);
			Свойства.Добавить("НомерСообщения" , Строка(ID));
			
			Для Каждого Свойство Из Свойства Цикл
				
				НоваяСтрока              = НовоеСообщение.Свойства.Добавить();
				НоваяСтрока.Наименование = Свойство.Значение;
				НоваяСтрока.Значение    = Свойство.Представление;
				
			КонецЦикла;   	
			
			Если ЗначениеЗаполнено(ЗаголовкиСообщения) Тогда
				
				Для Каждого Заголовок Из ЗаголовкиСообщения Цикл
					
					НоваяСтрока              = НовоеСообщение.Заголовки.Добавить();
					НоваяСтрока.Наименование = Заголовок.Значение;
					НоваяСтрока.Значение     = Заголовок.Представление;
					
				КонецЦикла;   
				
			КонецЕсли;      
			
			НовоеСообщение.Записать();
			
		Иначе
			
			ЗаписьЖурналаРегистрации("Товары без цен для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Отстутствуют товары с незаполненными ценами");
			Возврат;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации("Товары без цен для головного филиала", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Не заполнены константы типы цен");
		Возврат;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура КонтрольСроковВозвратов() Экспорт
	
	СрокДействияЗаявкиНаВозврат = Константы.СрокДействияЗаявкиНаВозврат.Получить(); 
	КоличествоДнейВозврата = Константы.КоличествоДнейВозврата.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	МАКСИМУМ(ЗаявкаНаВозвратТовары.Ссылка.Реализация.ДоговорКонтрагента.СрокВозврата) КАК СрокВозврата,
	|	ЗаявкаНаВозвратТовары.Ссылка.Реализация.Дата
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка.Проведен
	|	И ЗаявкаНаВозвратТовары.Тип = ""Возврат""
	|	И ЗаявкаНаВозвратТовары.Ссылка.Дата >= &Дата
	|	И ЗаявкаНаВозвратТовары.Ссылка.Статус В(&МассивСтатусов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.Ссылка.Реализация.Дата";
	
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(ТекущаяДата(), -6)); 
	
	МассивСтатусов = Новый Массив; 
	МассивСтатусов.Добавить("На согласовании");
	МассивСтатусов.Добавить("Согласован");
	МассивСтатусов.Добавить("На доставке");  
	
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		СрокВозврата = Выборка.СрокВозврата;
		
		Если Не ЗначениеЗаполнено(СрокВозврата) Тогда
			СрокВозврата = КоличествоДнейВозврата;	
		КонецЕсли;                                     
		
		Если Не ЗначениеЗаполнено(СрокВозврата) Тогда
			Продолжить;
		КонецЕсли;   
		
		ИтоговыйСрок = СрокВозврата + СрокДействияЗаявкиНаВозврат; 
		
		ДатаСравнения = Выборка.РеализацияДата + 86400*ИтоговыйСрок;
		
		Если ТекущаяДата() > ДатаСравнения Тогда
			
			ЗаявкаОб = Выборка.Ссылка.ПолучитьОбъект();
			ЗаявкаОб.Статус = "Отказ в возврате";  
			ЗаявкаОб.Комментарий = "Истек период для возврата" + ?(ЗначениеЗаполнено(ЗаявкаОб.Комментарий), ". " + ЗаявкаОб.Комментарий, "");
			
			Для каждого Стр Из ЗаявкаОб.Товары Цикл
				
				Стр.Статус = "Отказ в возврате"; 
				Стр.Комментарий = "Истек период для возврата" + ?(ЗначениеЗаполнено(Стр.Комментарий), ". " + Стр.Комментарий, "");
				
			КонецЦикла;                                                                                                             
			
			ЗаявкаОб.Записать();
			
		КонецЕсли;		
		
	КонецЦикла;             	
	
КонецПроцедуры

Процедура ПроверкаПоДублямЧеков() Экспорт
	
	ДатаПроверки = НачалоДня(ТекущаяДата());
	
	Чеки.ПроверитьНаДублиВПределахДня(ДатаПроверки);
	
КонецПроцедуры

Процедура ЗакрытиеРегистраТоварыГотовыеКСборке() Экспорт 

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ТоварыГотовыеКСборкеОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыГотовыеКСборкеОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ТоварыВСборке
	|ИЗ
	|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
	|ГДЕ
	|	ТоварыГотовыеКСборкеОстатки.КоличествоОстаток > 0
	|	И НЕ ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ТоварыВСборке.ЗаказПокупателя КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
	|ИЗ
	|	ВТ_ТоварыВСборке КАК ВТ_ТоварыВСборке
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ВТ_ТоварыВСборке.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|			И ВТ_ТоварыВСборке.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	НЕ ВТ_ТоварыВСборке.КоличествоОстаток = ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателей.Регистратор КАК КорректировкаЗаказаПокупателя
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателя КАК ВТ_ЗаказыПокупателя
	|		ПО ЗаказыПокупателей.ЗаказПокупателя = ВТ_ЗаказыПокупателя.ЗаказПокупателя
	|ГДЕ
	|	ЗаказыПокупателей.Регистратор ССЫЛКА Документ.КорректировкаЗаказаПокупателя";
	
    Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		КорректировкаОбъект = Выборка.КорректировкаЗаказаПокупателя.ПолучитьОбъект();
		
		Попытка
			КорректировкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение  
			#Если Клиент Тогда
				Сообщить("Ошибка при проведении документа " + Строка(Выборка.КорректировкаЗаказаПокупателя) + ". " + Символы.ПС + ОписаниеОшибки());
			#КонецЕсли
		КонецПопытки;
		
	КонецЦикла
	
КонецПроцедуры

Процедура СозданиеКорПТУНаОсновеКорРТУВСтороннейБазе() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		Возврат;
	КонецЕсли; 
	
	ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Информация, , ,"Запуск");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	НЕ СобственныеСклады.ПометкаУдаления
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И СобственныеСклады.Поставщик.ИНН <> &ИНН";  
	
	Запрос.УстановитьПараметр("ИНН", Константы.ОсновнаяОрганизация.Получить().ИНН);
	
	КоличествоДней = Константы.ЧислоДнейДляСозданияКорПТУ.Получить();
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл   
		
		СобственныйСклад = Выборка.Ссылка;
		
		//+Гавриленков В. 19.05.2026 #UT10-5868
		Если ЗначениеЗаполнено(Выборка.Ссылка.ВебСервис) Тогда
			
			ТаблицаАдресов =  МСКWEB.ПолучитьАдресаСервиса(Выборка.Ссылка.ВебСервис);
			
			Если ТаблицаАдресов.Количество() = 0 Тогда
				
				ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Не установлены веб-сервисы для склада " + Строка(Выборка.Ссылка));
				Продолжить;
				
			Иначе
				
				ОтветПолучен = Ложь;
				
				Для Каждого СтрокаАдрес Из ТаблицаАдресов Цикл
					
					Если ОтветПолучен Тогда
						Прервать;
					КонецЕсли;
					
					СоздатьКорректировку(СобственныйСклад, СтрокаАдрес.АдресСервиса, КоличествоДней, ОтветПолучен);
					
				КонецЦикла; 
				
				Если Не ОтветПолучен Тогда
					ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Склад " + Строка(Выборка.Ссылка) + ". Нет ответа ни по одному адресу.");
				КонецЕсли;	
									
			КонецЕсли;
		//-Гавриленков В. 19.05.2026 #UT10-5868
			
		Иначе // алгоритм без изменений
			
			АдресВебСервиса = "http://" + СобственныйСклад.АдресВебСервиса + "/ws/GoodsReserve.1cws?wsdl";
			
			Попытка
				ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);	
			Исключение
				
				ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании объекта веб сервиса: " + ОписаниеОшибки());
				Продолжить;
				
			КонецПопытки;
			
			ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");    
			
			Парам = Новый Структура;
			Парам.Вставить("ДатаНачала", НачалоДня(ТекущаяДата()) - 86400*КоличествоДней);
			Парам.Вставить("КодМДМГрузополучателя", СобственныйСклад.КодКонтрагента);
			Парам.Вставить("КодМДМДоговора", СобственныйСклад.КодДоговора);
			
			Ответ = ВСПрокси.ПолучитьКорректировки(МСКWEB.ДанныеВJSONХранилище(Парам)); 
			
			ОтветСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Ответ);
			
			Если ОтветСтруктура.Результат Тогда
				
				Для каждого Документ Из ОтветСтруктура.Данные Цикл
					
					Попытка
						
						СтруктураВозврата = Документы.КорректировкаПоступления.СоздатьКорректировкуПТУ(Документ);
						
						Если СтруктураВозврата.Результат Тогда
							ВСПрокси.КорректировкаЗагружена(Документ.ГУИД); 	
						Иначе
							ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании корректировки: " + СтруктураВозврата.Сообщение);
						КонецЕсли;
						
					Исключение
						ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании корректировки: " + ОписаниеОшибки());
					КонецПопытки;
					
				КонецЦикла;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;   
	
	ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Информация, , ,"Окончание");

КонецПроцедуры

Процедура СоздатьКорректировку(СобственныйСклад, Адрес, КоличествоДней, ОтветПолучен = Ложь)
//+Гавриленков В. 19.05.2026 #UT10-5868
	
	АдресВебСервиса = "http://" + Адрес + "/ws/GoodsReserve.1cws?wsdl";
	
	Попытка
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);	
	Исключение
		
		ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании объекта веб сервиса: " + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");    
	
	Парам = Новый Структура;
	Парам.Вставить("ДатаНачала", НачалоДня(ТекущаяДата()) - 86400*КоличествоДней);
	Парам.Вставить("КодМДМГрузополучателя", СобственныйСклад.КодКонтрагента);
	Парам.Вставить("КодМДМДоговора", СобственныйСклад.КодДоговора);
	
	Попытка
		
		Ответ = ВСПрокси.ПолучитьКорректировки(МСКWEB.ДанныеВJSONХранилище(Парам));
		ОтветПолучен = Истина;
		
	Исключение
		
		ОтветПолучен = Ложь;
		Возврат;
		
	КонецПопытки;
	
	ОтветСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Ответ);
	
	Если ОтветСтруктура.Результат Тогда
		
		Для каждого Документ Из ОтветСтруктура.Данные Цикл
			
			Попытка
				
				СтруктураВозврата = Документы.КорректировкаПоступления.СоздатьКорректировкуПТУ(Документ);
				
				Если СтруктураВозврата.Результат Тогда
					ВСПрокси.КорректировкаЗагружена(Документ.ГУИД); 	
				Иначе
					ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании корректировки: " + СтруктураВозврата.Сообщение);
				КонецЕсли;
				
			Исключение
				ЗаписьЖурналаРегистрации("Регламентное : Создание КорПТУ на основе КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании корректировки: " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;	
	
//-Гавриленков В. 19.05.2026 #UT10-5868	
КонецПроцедуры

Процедура СверкаКорректировокПоступленийИРеализаций() Экспорт
//+Гавриленков В. 30.01.2026 #UT10-5671	

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		Возврат;
	КонецЕсли; 
	
	ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Информация, , ,"Запуск");  
	
	// Если нет адреса получателя, то выполнять сверку нет смысла
	Получатель = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.Рассылки, "Адрес для оповещения о расхождениях корректировок ПТУ и РТУ"); 
	Если Получатель = Неопределено Тогда  
		ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Предупреждение,,, "Нет получателя сообщения. Завершение");
		Возврат;
	КонецЕсли;    
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если  Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	НачалоПериода = ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1);
	
	ИДСтороннихБаз = Новый ТаблицаЗначений;
	ИДСтороннихБаз.Колонки.Добавить("ИДДокументаВСмежнойБазе", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(36)));
	ИДСтороннихБаз.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.СобственныеСклады"));

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	НЕ СобственныеСклады.ПометкаУдаления
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И СобственныеСклады.Поставщик.ИНН <> &ИНН";  
	
	Запрос.УстановитьПараметр("ИНН", Константы.ОсновнаяОрганизация.Получить().ИНН);
	
	КоличествоДней = Константы.ЧислоДнейДляСозданияКорПТУ.Получить();
	
	Выборка = Запрос.Выполнить().Выбрать();	 
	
	Пока Выборка.Следующий() Цикл                     
		
		СобственныйСклад = Выборка.Ссылка;
		
		//+Гавриленков В. 19.05.2026 #UT10-5868
		Если ЗначениеЗаполнено(Выборка.Ссылка.ВебСервис) Тогда
			
			ТаблицаАдресов =  МСКWEB.ПолучитьАдресаСервиса(Выборка.Ссылка.ВебСервис);
			
			Если ТаблицаАдресов.Количество() = 0 Тогда
				
				ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Не установлены веб-сервисы для склада " + Строка(Выборка.Ссылка));
				Продолжить;
				
			Иначе
				
				ОтветПолучен = Ложь;
				
				Для Каждого СтрокаАдрес Из ТаблицаАдресов Цикл
					
					Если ОтветПолучен Тогда
						Прервать;
					КонецЕсли;
					
					ВыполнитьСверку(СобственныйСклад, СтрокаАдрес.АдресСервиса, НачалоПериода, ИДСтороннихБаз, ОтветПолучен);
					
				КонецЦикла; 
				
				Если Не ОтветПолучен Тогда
					ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Склад " + Строка(Выборка.Ссылка) + ". Нет ответа ни по одному адресу.");
				КонецЕсли;	
									
			КонецЕсли;
		//-Гавриленков В. 19.05.2026 #UT10-5868	
			
		Иначе // Алгоритм без изменений
			
			АдресВебСервиса = "http://" + СобственныйСклад.АдресВебСервиса + "/ws/GoodsReserve.1cws?wsdl";
			
			Попытка
				ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);	
			Исключение
				
				ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании объекта веб сервиса: " + ОписаниеОшибки());
				Продолжить;
				
			КонецПопытки;
			
			ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");    
			
			Парам = Новый Структура;
			Парам.Вставить("ДатаНачала", НачалоПериода);
			Парам.Вставить("КодМДМГрузополучателя", СобственныйСклад.КодКонтрагента);
			Парам.Вставить("КодМДМДоговора", СобственныйСклад.КодДоговора);
			Парам.Вставить("ВсеДокументы", Истина);
			
			Ответ = ВСПрокси.ПолучитьКорректировки(МСКWEB.ДанныеВJSONХранилище(Парам)); 
			
			ОтветСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Ответ);
			
			Если ОтветСтруктура.Результат Тогда 			
				
				Для каждого Документ Из ОтветСтруктура.Данные Цикл 
					
					Если Не ЗначениеЗаполнено(Документ.ГУИД) Тогда
						Продолжить;
					КонецЕсли;
					
					НовСтрока =	ИДСтороннихБаз.Добавить();
					НовСтрока.ИДДокументаВСмежнойБазе = Документ.ГУИД;
					НовСтрока.Склад = СобственныйСклад;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Если ИДСтороннихБаз.Количество() > 0 Тогда   
		
		ТекстСообщения = "";
		
		ЗапросСверка = Новый Запрос;
		ЗапросСверка.Текст = 
		"ВЫБРАТЬ
		|	Таблица.ИДДокументаВСмежнойБазе КАК ИДДокументаВСмежнойБазе,
		|	Таблица.Склад КАК Склад
		|ПОМЕСТИТЬ ВТ_ГуидыСтороннихБаз
		|ИЗ
		|	&Таблица КАК Таблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорректировкаПоступления.ИДДокументаВСмежнойБазе
		|ПОМЕСТИТЬ ВТ_ЗагруженныеИД
		|ИЗ
		|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГуидыСтороннихБаз КАК ВТ_ГуидыСтороннихБаз
		|		ПО КорректировкаПоступления.ИДДокументаВСмежнойБазе = ВТ_ГуидыСтороннихБаз.ИДДокументаВСмежнойБазе
		|ГДЕ
		|	КорректировкаПоступления.Проведен
		|	И КорректировкаПоступления.Дата > &ДатаНач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ГуидыСтороннихБаз.Склад КАК Склад,
		|	ВТ_ГуидыСтороннихБаз.ИДДокументаВСмежнойБазе
		|ИЗ
		|	ВТ_ГуидыСтороннихБаз КАК ВТ_ГуидыСтороннихБаз
		|ГДЕ
		|	НЕ ВТ_ГуидыСтороннихБаз.ИДДокументаВСмежнойБазе В
		|				(ВЫБРАТЬ
		|					Таб.ИДДокументаВСмежнойБазе
		|				ИЗ
		|					ВТ_ЗагруженныеИД КАК Таб)
		|ИТОГИ ПО
		|	Склад";
		
		ЗапросСверка.УстановитьПараметр("ДатаНач", НачалоПериода);
		ЗапросСверка.УстановитьПараметр("Таблица", ИДСтороннихБаз); 
		
		ВыборкаСклад = ЗапросСверка.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаСклад.Следующий() Цикл 
			
			ТекстСообщения = ТекстСообщения + "По складу " + Строка(ВыборкаСклад.Склад) + ": " + Символы.ПС;
			
			Выборка = ВыборкаСклад.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				ТекстСообщения = ТекстСообщения + "ID (ГУИД Корректирвки реализации): "  + Выборка.ИДДокументаВСмежнойБазе + Символы.ПС;	
			КонецЦикла;    
			
			ТекстСообщения = ТекстСообщения + Символы.ПС;
			
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда  

			ТекстСообщения = "Обнаружены незагруженные Корректировки поступлений: " + Символы.ПС + Символы.ПС + ТекстСообщения;
			
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Расхождения при сверке корректировок ПТУ и РТУ";
						
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Получатель, ";");
			
			Почта = Новый ИнтернетПочта; 
			
			Попытка
				Почта.Подключиться(Профиль);
			Исключение
				
				ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось подключиться к почтовому серверу. " 
				+ Символы.ПС + ОписаниеОшибки());
				Возврат; 
				
			КонецПопытки;
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес); 
			КонецЦикла;
			
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			
			Сообщение.Тексты.Добавить(ТекстСообщения, ТипТекстаПочтовогоСообщения.ПростойТекст);
			
			Попытка
				
				Почта.Послать(Сообщение);
				ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, Сообщение); 
				
			Исключение
				
				ЗаписьЖурналаРегистрации("Отправка электронной почты.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Не отправлено письмо на адрес " 
				+ МассивАдресов[0] + Символы.ПС + ОписаниеОшибки());
				
			Конецпопытки;
			
			Сообщение.Получатели.Очистить();
			Сообщение.Вложения.Очистить();
			Почта.Отключиться();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Информация, , ,"Окончание");

//-Гавриленков В. 30.01.2026 #UT10-5671	
КонецПроцедуры 

Процедура ВыполнитьСверку(СобственныйСклад, Адрес, НачалоПериода, ИДСтороннихБаз, ОтветПолучен)
//+Гавриленков В. 19.05.2026 #UT10-5868
	
	АдресВебСервиса = "http://" + Адрес + "/ws/GoodsReserve.1cws?wsdl";
	
	Попытка
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);	
	Исключение
		
		ЗаписьЖурналаРегистрации("Сверка КорПТУ с КорРТУ в сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Получена ошибка при создании объекта веб сервиса: " + ОписаниеОшибки());
		Возврат;
		
	КонецПопытки;
	
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");    
	
	Парам = Новый Структура;
	Парам.Вставить("ДатаНачала", НачалоПериода);
	Парам.Вставить("КодМДМГрузополучателя", СобственныйСклад.КодКонтрагента);
	Парам.Вставить("КодМДМДоговора", СобственныйСклад.КодДоговора);
	Парам.Вставить("ВсеДокументы", Истина);
	
	Попытка
		
		Ответ = ВСПрокси.ПолучитьКорректировки(МСКWEB.ДанныеВJSONХранилище(Парам));
		ОтветПолучен = Истина;
		
	Исключение
		
		ОтветПолучен = Ложь;
		Возврат;
		
	КонецПопытки;
	
	ОтветСтруктура = МСКWEB.ХранилищеJSONВСтруктуру(Ответ);
	
	Если ОтветСтруктура.Результат Тогда 			
		
		Для каждого Документ Из ОтветСтруктура.Данные Цикл 
			
			Если Не ЗначениеЗаполнено(Документ.ГУИД) Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтрока =	ИДСтороннихБаз.Добавить();
			НовСтрока.ИДДокументаВСмежнойБазе = Документ.ГУИД;
			НовСтрока.Склад = СобственныйСклад;
			
		КонецЦикла;
		
	КонецЕсли;	
	
//-Гавриленков В. 19.05.2026 #UT10-5868
КонецПроцедуры

Функция ПолучитьТаблицуGTINНоменклатур()
	
	GTINНоменклатур = Новый ТаблицаЗначений;
	GTINНоменклатур.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	GTINНоменклатур.Колонки.Добавить("GTIN", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000)));
	
	ЗапросGTIN = Новый Запрос;
	ЗапросGTIN.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	СпрGTIN.GTIN
		|ИЗ
		|	Справочник.GTIN КАК СпрGTIN
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОтображатьВПрайсЛистах
		|					И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО СпрGTIN.Владелец = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|ГДЕ
		|	НЕ СпрGTIN.ПометкаУдаления
		|ИТОГИ ПО
		|	Номенклатура";
	
	ЗапросGTIN.УстановитьПараметр("ТипЦен", Константы.Скидка38.Получить());
	
	РезультатЗапросаGTIN = ЗапросGTIN.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапросаGTIN.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		НовСтр = GTINНоменклатур.Добавить();
		НовСтр.Номенклатура = ВыборкаНоменклатура.Номенклатура;
	
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(НовСтр.GTIN) Тогда
				НовСтр.GTIN = НовСтр.GTIN + ";";
			КонецЕсли;
			
			НовСтр.GTIN = НовСтр.GTIN + СокрЛП(ВыборкаДетальныеЗаписи.GTIN);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат GTINНоменклатур;
	
КонецФункции

Функция ПолучитьТаблицуСертификатыНоменклатуры()
	
	//+Макрушин Е. 03.09.2026 #UT11-6041
	СертификатыНоменклатуры = Новый ТаблицаЗначений;
	СертификатыНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	СертификатыНоменклатуры.Колонки.Добавить("СсылкаНаРеестрСертификатов", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000)));
	
	Запрос = Новый Запрос;
	// в запросе сделано не через виртуальную таблицу среза, т.к. по физической таблице отрабатывает быстрее буквально в 100 раз
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЦеныНоменклатуры.Номенклатура
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|ГДЕ
		|	НЕ ЦеныНоменклатуры.Номенклатура.Артикул = """"""""
		|	И ЦеныНоменклатуры.ТипЦен = &ТипЦен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбластиДействияСертификатовНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ТипСертификата = ""Не подлежит обязательной сертификации""
		|			ТОГДА ""NSMC""
		|		ИНАЧЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.СсылкаНаРеестрСертификатов
		|	КОНЕЦ КАК СсылкаНаРеестрСертификатов
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбластиДействияСертификатовНоменклатуры КАК ОбластиДействияСертификатовНоменклатуры
		|		ПО ВТ_Номенклатура.Номенклатура = ОбластиДействияСертификатовНоменклатуры.Номенклатура
		|ГДЕ
		|	НЕ ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ОбластиДействияСертификатовНоменклатуры.СертификатНоменклатуры.ДатаНачалаСрокаДействия
		|ИТОГИ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
	
    Запрос.УстановитьПараметр("ТипЦен", Константы.Скидка38.Получить());
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	РезультатЗапроса = РезультатЗапросаПакет[1];
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		НовСтр = СертификатыНоменклатуры.Добавить();
		НовСтр.Номенклатура = ВыборкаНоменклатура.Номенклатура;
	
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ЗначениеЗаполнено(НовСтр.СсылкаНаРеестрСертификатов) Тогда
				НовСтр.СсылкаНаРеестрСертификатов = НовСтр.СсылкаНаРеестрСертификатов + ";";
			КонецЕсли;
			
			НовСтр.СсылкаНаРеестрСертификатов = НовСтр.СсылкаНаРеестрСертификатов + СокрЛП(ВыборкаДетальныеЗаписи.СсылкаНаРеестрСертификатов);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СертификатыНоменклатуры;
	//-Макрушин Е. 03.09.2026 #UT11-6041
	
КонецФункции

Процедура ОбработкаОчередиЗагрузкиСсылокS3() Экспорт
//+Белов А. 13.03.2026 #UT10-5722
	
	// 1. Выбираем записи, которые еще не обработаны и количество попыток < 3
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ОчередьЗагрузкиСсылокS3.Идентификатор КАК Идентификатор,
        |   ОчередьЗагрузкиСсылокS3.Ссылка КАК СсылкаS3,
        |   ОчередьЗагрузкиСсылокS3.Документ КАК Документ,
        |   ОчередьЗагрузкиСсылокS3.КоличествоПопыток КАК КоличествоПопыток
        |ИЗ
        |   РегистрСведений.ОчередьЗагрузкиСсылокS3 КАК ОчередьЗагрузкиСсылокS3
        |ГДЕ
        |   ОчередьЗагрузкиСсылокS3.Обработано = ЛОЖЬ
        |   И ОчередьЗагрузкиСсылокS3.КоличествоПопыток < 3";
        
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    Пока Выборка.Следующий() Цикл
        
        ТекстОшибкиСкачивания = "";
        СсылкаНаСозданныйФайл = Неопределено;
        
        // 2. Пытаемся скачать файл из S3 в хранилище 1С
        Попытка
            СсылкаНаСозданныйФайл = СкачатьФайлИзS3ВХранилище(
                Выборка.СсылкаS3, 
                Выборка.Документ
            );
        Исключение
            ТекстОшибкиСкачивания = ОписаниеОшибки();
            СсылкаНаСозданныйФайл = Неопределено;
        КонецПопытки;
        
        // 3. Обновляем статус записи в регистре сведений с помощью Менеджера Записи
        МенеджерЗаписи = РегистрыСведений.ОчередьЗагрузкиСсылокS3.СоздатьМенеджерЗаписи();
        МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
        
        // Читаем текущее состояние записи из базы
        МенеджерЗаписи.Прочитать();
        
        Если МенеджерЗаписи.Выбран() Тогда
            
            // Записываем дату обработки в любом случае
            МенеджерЗаписи.ДатаОбработки = ТекущаяДата();
            
            Если СсылкаНаСозданныйФайл <> Неопределено Тогда
                // УСПЕШНАЯ ЗАГРУЗКА
                МенеджерЗаписи.Обработано = Истина;
                МенеджерЗаписи.Файл = СсылкаНаСозданныйФайл;
                МенеджерЗаписи.ТекстОшибки = ""; // Очищаем текст ошибки, если были прошлые неудачные попытки
                
            Иначе
                // ОШИБКА ЗАГРУЗКИ
                МенеджерЗаписи.КоличествоПопыток = Выборка.КоличествоПопыток + 1;
                
                Если Не ПустаяСтрока(ТекстОшибкиСкачивания) Тогда
                    МенеджерЗаписи.ТекстОшибки = ТекстОшибкиСкачивания;
                Иначе
                    МенеджерЗаписи.ТекстОшибки = "Не удалось скачать файл. Функция вернула Неопределено (проверьте URL или доступ к S3).";
                КонецЕсли;
                
            КонецЕсли;
            
            // Фиксируем изменения в регистре
            МенеджерЗаписи.Записать();
            
        КонецЕсли;
        
	КонецЦикла;
	
//-Белов А. 13.03.2026 #UT10-5722
КонецПроцедуры

Функция СкачатьФайлИзS3ВХранилище(Знач СсылкаНаФайлS3, Знач ОбъектВладелец) Экспорт
	
	ИмяФайла = ПолучитьИмяФайлаИзURL(СсылкаНаФайлS3); 
	
	Защищенное = Найти(СсылкаНаФайлS3, "https://") > 0;
	
	 // Очищаем протокол для извлечения адреса сервера и пути
	УРЛ = СтрЗаменить(СсылкаНаФайлS3, "https://", "");
	УРЛ = СтрЗаменить(УРЛ, "http://", "");
	
	ПозицияПервогоСлеша = Найти(УРЛ, "/");
	Если ПозицияПервогоСлеша = 0 Тогда
		
		Сообщить("Некорректная ссылка S3");
	    Возврат Неопределено;
		
	КонецЕсли;
	
	Сервер = Лев(УРЛ, ПозицияПервогоСлеша - 1);
	
	Если Не Защищенное Тогда
		Сервер = "http://" + Сервер;	
	КонецЕсли;
	
	ПутьКОбъекту = Сред(УРЛ, ПозицияПервогоСлеша + 1); 
	
	Бакет = Лев(ПутьКОбъекту, Найти(ПутьКОбъекту, "/") - 1); 
    AccessKey = Константы.S3ВыгрузкаЦенЛогин.Получить();
    SecretKey = Константы.S3ВыгрузкаЦенПароль.Получить();
    Region    = "BTC";

    ОсновныеДанные = OPI_S3.ПолучитьСтруктуруДанных(Сервер, AccessKey, SecretKey, Region); 
	
	ВременныйФайл = ПолучитьИмяВременногоФайла(); 
	СсылкаНаСозданныйФайл = Неопределено;
	
	Попытка
			
		// Получение двоичных данных
		Результат = OPI_S3.ПолучитьОбъект(ИмяФайла, Бакет, ОсновныеДанные, , , ВременныйФайл, Истина);
		
		// Читаем файл в двоичные данные для помещения в базу
		ДвоичныеДанные = Новый ДвоичныеДанные(Результат);
		
		// Создаем элемент справочника ХранилищеДополнительнойИнформации
		НовыйФайл = Справочники.ХранилищеДополнительнойИнформации.СоздатьЭлемент();
		НовыйФайл.Наименование = ИмяФайла;
		НовыйФайл.ИмяФайла     = ИмяФайла;
		НовыйФайл.Объект       = ОбъектВладелец;
		НовыйФайл.ВидДанных    = Перечисления.ВидыДополнительнойИнформацииОбъектов.Файл;
		
		Если Справочники.ОбъектыСВнешнимФайловымХранением.ПрименимоКОбъекту(ОбъектВладелец) Тогда
			
			КаталогФайлов = Константы.ТомХраненияФайлов.Получить();
			РасширениеФайла = РаботаСФайлами.ПолучитьРасширениеФайла(ИмяФайла);
			НовоеИмяФайла = Формат(ТекущаяДата(), "ДФ=yyyyMMdd") + "\" + СтрЗаменить(ИмяФайла,"." + РасширениеФайла,"") + "_" + Строка(Новый УникальныйИдентификатор()) + "." + РасширениеФайла;
			ПолныйПутьКФайлу = РаботаСФайлами.ПолучитьИмяФайла(КаталогФайлов,НовоеИмяФайла);
			ДвоичныеДанные.Записать(ПолныйПутьКФайлу);                                      		
			
			Если РаботаСФайлами.СжатьИзображениеНаДиске(ПолныйПутьКФайлу) = Ложь Тогда
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось выполнить сжатие изображения");
			КонецЕсли;
			
			НовыйФайл.ПутьКФайлу = НовоеИмяФайла; 
			НовыйФайл.Хранилище = Неопределено;
		
		Иначе
			// Сохраняем двоичные данные с максимальным сжатием (9)
			НовыйФайл.Хранилище = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));  		
		КонецЕсли;
		
		НовыйФайл.Записать();
		СсылкаНаСозданныйФайл = НовыйФайл.Ссылка; 
		
		// Блок очистки: удаляем временный файл в любом случае (успех или ошибка)
		Попытка
			УдалитьФайлы(ВременныйФайл);
		Исключение
		КонецПопытки;
		
	Исключение
		Сообщить("Возникла ошибка при загрузке: " + ОписаниеОшибки());
	КонецПопытки;			
    
    Возврат СсылкаНаСозданныйФайл;
	    
КонецФункции

Функция ПолучитьИмяФайлаИзURL(Знач СсылкаS3) Экспорт
    
    // 1. Отсекаем GET-параметры (всё, что идет после символа "?")
    ПозицияВопроса = Найти(СсылкаS3, "?");
    Если ПозицияВопроса > 0 Тогда
        ПутьДоФайла = Лев(СсылкаS3, ПозицияВопроса - 1);
    Иначе
        ПутьДоФайла = СсылкаS3;
    КонецЕсли;
    
    // 2. Ищем последний слеш "/", чтобы забрать только само имя файла
    ПозицияСлеша = Найти(ПутьДоФайла, "/");
    Пока ПозицияСлеша > 0 Цикл
        ПутьДоФайла = Сред(ПутьДоФайла, ПозицияСлеша + 1);
        ПозицияСлеша = Найти(ПутьДоФайла, "/");
    КонецЦикла;
    
    ИмяФайла = ПутьДоФайла;
    
    // 3. Декодируем URL кириллицу и спецсимволы через COM-объект (обход ограничения 8.2)
	ИмяФайла = РаскодироватьСтроку(ИмяФайла, СпособКодированияСтроки.URLВКодировкеURL, "UTF-8");
        
    Возврат ИмяФайла;
    
КонецФункции 

Процедура ВыгрузкаСтатусовЗаказовЗаПериод() Экспорт
	
	//+Сёмин Р.И. 04.03.2026 #UT10-5727
	ИмяРегламента = "Выгрузка статусов заказов за период";
	
	ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Информация, , ,"Запуск");
	ВыполнитьЗадание = Истина;
	
	РегламентВыгрузкиСтатусовЗаказовДатаНачала = Константы.РегламентВыгрузкиСтатусовЗаказовДатаНачала.Получить();
	РегламентВыгрузкиСтатусовЗаказовДатаОкончания = Константы.РегламентВыгрузкиСтатусовЗаказовДатаОкончания.Получить();
	
	КоличествоЗаказовВСутки = Константы.РегламентВыгрузкиСтатусовЗаказовКоличествоВСутки.Получить();
	ТекущееКоличествоЗаказовВСутки = 0;
	
	КоличествоЗаказовВПорции = 20;
	ТекущееКоличествоЗаказовВПорции = 0;
	
	ЗадержкаПоВремени = 30;
	
	ПоследнийОбработанныйЗаказ = Документы.ЗаказПокупателя.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(РегламентВыгрузкиСтатусовЗаказовДатаНачала) Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Необходимо заполнить константу ""Регламент выгрузки статусов заказов дата начала""");
		ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Ошибка, , ,"Не заполнена константа ""Регламент выгрузки статусов заказов дата начала""");
		ВыполнитьЗадание = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РегламентВыгрузкиСтатусовЗаказовДатаОкончания) Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Необходимо заполнить константу ""Регламент выгрузки статусов заказов дата окончания""");
		ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Ошибка, , ,"Не заполнена константа ""Регламент выгрузки статусов заказов дата окончания""");
		ВыполнитьЗадание = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КоличествоЗаказовВСутки) Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Необходимо заполнить константу ""Регламент выгрузки статусов заказов количество за сутки""");
		ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Ошибка, , ,"Не заполнена константа ""Регламент выгрузки статусов количество за сутки""");
		ВыполнитьЗадание = Ложь;
		
	КонецЕсли;
	
	Если НЕ ВыполнитьЗадание Тогда
		Возврат;
	КонецЕсли;
	
	
	ЗапросПодготовительный = Новый Запрос;
	ЗапросПодготовительный.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РегламентВыгрузкиСтатусовЗаказов.ЗаказПокупателя КАК ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.РегламентВыгрузкиСтатусовЗаказов КАК РегламентВыгрузкиСтатусовЗаказов";
	
	РезультатЗапросаПодготовительный = ЗапросПодготовительный.Выполнить();
	
	Если РезультатЗапросаПодготовительный.Пустой() Тогда
		ПоследнийВыгруженныйЗаказВПрошлыйЗапуск = Документы.ЗаказПокупателя.ПустаяСсылка();
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапросаПодготовительный.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ПоследнийВыгруженныйЗаказВПрошлыйЗапуск = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 100
		|	ЗаказПокуп.Ссылка КАК ЗаказПокупателя
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокуп
		|ГДЕ
		|	ЗаказПокуп.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ЗаказПокуп.Проведен
		|	И ЗаказПокуп.Ссылка <> &ПоследнийВыгруженныйЗаказВПрошлыйЗапуск
		|	И ЗаказПокуп.Дата >= &ДатаПоследнегоВыгруженногоЗаказа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокуп.Дата";
	
	Запрос.УстановитьПараметр("ДатаНач", РегламентВыгрузкиСтатусовЗаказовДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(РегламентВыгрузкиСтатусовЗаказовДатаОкончания));
	Запрос.УстановитьПараметр("ПоследнийВыгруженныйЗаказВПрошлыйЗапуск", ПоследнийВыгруженныйЗаказВПрошлыйЗапуск);
	Запрос.УстановитьПараметр("ДатаПоследнегоВыгруженногоЗаказа", ПоследнийВыгруженныйЗаказВПрошлыйЗапуск.Дата);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ ПЕРВЫЕ 100", "ВЫБРАТЬ ПЕРВЫЕ " + КоличествоЗаказовВСутки + " ");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ТекущееКоличествоЗаказовВСутки >= КоличествоЗаказовВСутки Тогда
			Прервать;
		КонецЕсли;
		
		Если ТекущееКоличествоЗаказовВПорции = КоличествоЗаказовВПорции Тогда
			
			AMQP_РаботаСДокументами.ПаузаИсполнения(ЗадержкаПоВремени);
			ТекущееКоличествоЗаказовВПорции = 0;
			
		КонецЕсли;
		
		Попытка
			
			СтатусыЗаказов.ПоместитьВОчередьВФоне(ВыборкаДетальныеЗаписи.ЗаказПокупателя);
			
			ТекущееКоличествоЗаказовВСутки = ТекущееКоличествоЗаказовВСутки + 1;
			ТекущееКоличествоЗаказовВПорции = ТекущееКоличествоЗаказовВПорции + 1;
			
			ПоследнийОбработанныйЗаказ = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
			
		Исключение
			
			ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Ошибка, , ,"Ошибка помещения в очередь выгрузки статусов заказа покупателя " + ВыборкаДетальныеЗаписи.ЗаказПокупателя);
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПоследнийОбработанныйЗаказ) Тогда
		
		НаборЗаписей = РегистрыСведений.РегламентВыгрузкиСтатусовЗаказов.СоздатьНаборЗаписей();
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ЗаказПокупателя = ПоследнийОбработанныйЗаказ;
		НоваяЗапись.Дата = ТекущаяДата();
		НоваяЗапись.КоличествоОбработанных = ТекущееКоличествоЗаказовВСутки;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяРегламента, УровеньЖурналаРегистрации.Информация, , ,"Завершение");
	//-Сёмин Р.И. 04.03.2026 #UT10-5727
	
КонецПроцедуры

Процедура ОбновлениеОстатковПорталS3() Экспорт
	
	//+Сёмин Р.И. 20.03.2026 #UT10-5759
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации(
			"Обновление остатков портал (через S3)",
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			"Отменена работа регламентного задания из-за несоответствия параметров подключения в ИБ"
		);
		
		Возврат;
		
	КонецЕсли;
	
	ИмяS3Сервера       = Константы.S3ВыгрузкаЦенАдрес.Получить();
	ПортS3Сервера      = Константы.S3ВыгрузкаЦенПорт.Получить();
	ЗаданаПапкаДляS3   = СокрЛП(Константы.S3ВыгрузкаЦенКаталог.Получить());
	
	Если НЕ ЗначениеЗаполнено(ИмяS3Сервера) Тогда        
		
		ЗаписьЖурналаРегистрации(
			"Обновление остатков портал (через S3).Ошибка", 
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Отменена попытка соединения с S3: не заполнен адрес S3 сервера в константах."
		);
		
		Возврат;     
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
		|ПОМЕСТИТЬ ТоварыВРезерке
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		|			,
		|			Склад = &Склад
		|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК СвободныйОстатокСклад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ НеНулевыеСвободныеОстаткиСклад
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) > 0
		|	И ТоварыНаСкладахОстатки.Номенклатура.Родитель.НеПоказыватьНаПортале = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад,
		|	НеНулевыеСвободныеОстаткиСклад.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК СвободныйОстатокЯчейки,
		|	ВЫБОР
		|		КОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад <= ТоварыВЯчейкахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
		|			ТОГДА НеНулевыеСвободныеОстаткиСклад.СвободныйОстатокСклад
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
		|	КОНЕЦ КАК СвободныйОстаток
		|ПОМЕСТИТЬ НеНулевыеСвободныеОстатки
		|ИЗ
		|	НеНулевыеСвободныеОстаткиСклад КАК НеНулевыеСвободныеОстаткиСклад
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				Склад = &Склад
		|					И Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ) КАК ТоварыВЯчейкахОстатки
		|		ПО НеНулевыеСвободныеОстаткиСклад.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТоварыВРезерке.ЗаказПокупателя КАК ЗаказПокупателя,
		|						ТоварыВРезерке.Номенклатура
		|					ИЗ
		|						ТоварыВРезерке КАК ТоварыВРезерке)) КАК ТоварыВСборкеОстатки
		|		ПО (ТоварыВЯчейкахОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Таб.Номенклатура
		|ПОМЕСТИТЬ ОборотСегодня
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Обороты(
		|				&НачалоСегодняшнегоДня,
		|				,
		|				,
		|				Склад = &Склад
		|					И НЕ Номенклатура В
		|							(ВЫБРАТЬ
		|								НеНулевыеСвободныеОстатки.Номенклатура
		|							ИЗ
		|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыНаСкладахОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТоварыВРезервеНаСкладахОбороты.Номенклатура
		|	ИЗ
		|		РегистрНакопления.ТоварыВРезервеНаСкладах.Обороты(
		|				&НачалоСегодняшнегоДня,
		|				,
		|				,
		|				Склад = &Склад
		|					И НЕ Номенклатура В
		|							(ВЫБРАТЬ
		|								НеНулевыеСвободныеОстатки.Номенклатура
		|							ИЗ
		|								НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки)) КАК ТоварыВРезервеНаСкладахОбороты) КАК Таб
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""item"" КАК type,
		|	СправочникНоменклатура.КодМДМ КАК mdm_id,
		|	Т.СвободныйОстаток КАК quantity
		|ИЗ
		|	(ВЫБРАТЬ
		|		НеНулевыеСвободныеОстатки.Номенклатура КАК Номенклатура,
		|		НеНулевыеСвободныеОстатки.СвободныйОстаток КАК СвободныйОстаток
		|	ИЗ
		|		НеНулевыеСвободныеОстатки КАК НеНулевыеСвободныеОстатки
		|	ГДЕ
		|		НеНулевыеСвободныеОстатки.СвободныйОстаток > 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОборотСегодня.Номенклатура,
		|		0
		|	ИЗ
		|		ОборотСегодня КАК ОборотСегодня) КАК Т
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО Т.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	Т.СвободныйОстаток > 0";
	
	
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", ТекущаяДата());
	
	Текст = Новый ТекстовыйДокумент;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда  
		
		Путь        = ПолучитьИмяВременногоФайла("jsonl");
		ДатаСобытия = ТекущаяДата();
		
		СтруктураЗаголовка =  Новый Структура;
		СтруктураЗаголовка.Вставить("type"              , "header");
		СтруктураЗаголовка.Вставить("date"              , Формат(ДатаСобытия, "ДФ=dd.MM.yyyy ЧЧ:мм:сс"));
		СтруктураЗаголовка.Вставить("price_list_mdm_id" , Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста); 	
		
		МСКWEB.ЗаписатьРезультатЗапросаВJSONLines(Результат, Путь, СтруктураЗаголовка);
		
		ИмяФайлаПередать = СокрЛП(Константы.База.Получить()) + "_" + Формат(ДатаСобытия, "ДФ=dd.MM.yyyy") + "_" + Формат(ДатаСобытия, "ДФ=ЧЧммсс") + ".jsonl"; 
		
		СсылкаНаФайл = "";
		
		Попытка
			
			Соединение = Новый FTPСоединение(ИмяS3Сервера, ?(ЗначениеЗаполнено(ПортS3Сервера), ПортS3Сервера, "21"), Константы.S3ВыгрузкаЦенЛогин.Получить(), Константы.S3ВыгрузкаЦенПароль.Получить(), , Истина); 
			Соединение.Записать(Путь, ?(ЗначениеЗаполнено(ЗаданаПапкаДляS3), ЗаданаПапкаДляS3 + "\", "") + ИмяФайлаПередать);
			
			СсылкаНаФайл = "http://" + СокрЛП(ИмяS3Сервера) + ?(ЗначениеЗаполнено(ПортS3Сервера) , ":" + ПортS3Сервера ,"") + ?(ЗначениеЗаполнено(ЗаданаПапкаДляS3) , СтрЗаменить(ЗаданаПапкаДляS3, "\", "/") + "/" , "") + ИмяФайлаПередать;

			ЗаписьЖурналаРегистрации(
				"Обновление остатков портал (через S3)",
				УровеньЖурналаРегистрации.Информация,
				,
				,
				"Файл записан на FTP: " + ИмяS3Сервера + " в каталог: " + ЗаданаПапкаДляS3
			);
			
		Исключение
			
			ЗаписьЖурналаРегистрации(
				"Обновление остатков портал (через S3)",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Блокировки НЕ БЫЛО. Но запись данных на S3: " + ИмяS3Сервера + " НЕ СОСТОЯЛАСЬ!" + Символы.ПС + ОписаниеОшибки()
			);
			
		КонецПопытки;
		
		УдалитьФайлы(Путь);
		
		Если ЗначениеЗаполнено(СсылкаНаФайл) Тогда 
			
			НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
			НовоеСообщение.ОбменДанными.Загрузка = Истина;
			НовоеСообщение.ДатаВремяСобытия = ТекущаяДата();
			НовоеСообщение.Объект = "ОбновлениеОстатковПортал";
			НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
			
			ID = Новый УникальныйИдентификатор();     	
			НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
			
			СтруктураДокумента = Новый Структура;
			СтруктураДокумента.Вставить("link", СсылкаНаФайл);
			
			ЗаписьJSON = Новый ЗаписьJSON();
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, , Истина);
			
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
			ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
			JsonСтрока = ЗаписьJSON.Закрыть();
			
			НовоеСообщение.Сообщение = JsonСтрока;
			
			Свойства = Новый СписокЗначений;
			Свойства.Добавить("ТипСодержимого" , "application/json"); 
			Свойства.Добавить("ОтметкаВремени" , AMQP_РаботаСДокументами.ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
			Свойства.Добавить("Тип"            , "status"); 
			Свойства.Добавить("ИмяПриложения"  , Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
			Свойства.Добавить("РежимДоставки"  , 2);
			Свойства.Добавить("НомерСообщения" , Строка(ID));
			
			Заголовки = Новый СписокЗначений;
			Заголовки.Добавить("status_type"  , "ОбновлениеОстатковПортал");
			Заголовки.Добавить("content_type" , "application/json");
			Заголовки.Добавить("warehouse_id" , Константы.ОсновнойСклад.Получить().КодМДМ);
			Заголовки.Добавить("price_id"     , Константы.FTPВыгрузкаОстатковКаталог.Получить());
			Заголовки.Добавить("price_mdmid"  , Константы.ОсновнойСклад.Получить().КодМДМПрайсЛиста);
			
			Для Каждого Свойство Из Свойства Цикл
				
				НоваяСтрока = НовоеСообщение.Свойства.Добавить();
				НоваяСтрока.Наименование = Свойство.Значение;
				НоваяСтрока.Значение = Свойство.Представление;
				
			КонецЦикла;   	
			
			Если ЗначениеЗаполнено(Заголовки) Тогда
				
				Для Каждого Заголовок Из Заголовки Цикл
					
					НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
					НоваяСтрока.Наименование = Заголовок.Значение;
					НоваяСтрока.Значение = Заголовок.Представление;
					
				КонецЦикла;   
				
			КонецЕсли;      
			
			НовоеСообщение.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	//-Сёмин Р.И. 20.03.2026 #UT10-5759
	
КонецПроцедуры

Процедура СформироватьВыводыИзОборота() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО РеализацияТоваровУслуг.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки))
	|			И (ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводИзОборотаКИЗ КАК ВыводИзОборотаКИЗ
	|		ПО РеализацияТоваровУслуг.Ссылка = ВыводИзОборотаКИЗ.Основание
	|			И (ВыводИзОборотаКИЗ.Проведен)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|	И (РеализацияТоваровУслуг.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
	|			ИЛИ РеализацияТоваровУслуг.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ТорговляСНовымиРегионами))
	|	И НЕ ЕСТЬNULL(РеализацияТоваровУслуг.Грузополучатель.СобственныйФилиал, ЛОЖЬ)
	|	И ЕСТЬNULL(РеализацияТоваровУслуг.Грузополучатель.DS_Подразделение_ID, 0) = 0
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента.DS_Подразделение_ID = 0
	|	И РеализацияТоваровУслуг.Проведен
	|	И ВыводИзОборотаКИЗ.Ссылка ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Реализация,
	|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки
	|ПОМЕСТИТЬ ВТ_РеализацииСКодамиМаркировки
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.КодыМаркировки КАК РеализацияТоваровУслугКодыМаркировки
	|		ПО ВТ_Реализации.Ссылка = РеализацияТоваровУслугКодыМаркировки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка,
	|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РеализацииСКодамиМаркировки.Реализация КАК Реализация,
	|	ВТ_РеализацииСКодамиМаркировки.КодМаркировки.Номенклатура.ТоварнаяГруппаЧестногоЗнака КАК ТоварнаяГруппаЧестногоЗнака,
	|	ВТ_РеализацииСКодамиМаркировки.КодМаркировки КАК КодМаркировки,
	|	МАКСИМУМ(РеализацияТоваровУслугТовары.Цена) КАК Цена
	|ИЗ
	|	ВТ_РеализацииСКодамиМаркировки КАК ВТ_РеализацииСКодамиМаркировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ВТ_РеализацииСКодамиМаркировки.Реализация = РеализацияТоваровУслугТовары.Ссылка
	|			И ВТ_РеализацииСКодамиМаркировки.КодМаркировки.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РеализацииСКодамиМаркировки.Реализация,
	|	ВТ_РеализацииСКодамиМаркировки.КодМаркировки.Номенклатура.ТоварнаяГруппаЧестногоЗнака,
	|	ВТ_РеализацииСКодамиМаркировки.КодМаркировки
	|ИТОГИ
	|	МАКСИМУМ(Цена)
	|ПО
	|	Реализация,
	|	ТоварнаяГруппаЧестногоЗнака";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДата(), -1));
	
	ВыборкаРеализация = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);; 
	
	Пока ВыборкаРеализация.Следующий() Цикл 
		
		Реализация = ВыборкаРеализация.Реализация;
		
		ВыборкаТоварнаяГруппаЧестногоЗнака = ВыборкаРеализация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаТоварнаяГруппаЧестногоЗнака.Следующий() Цикл
			
			ТоварнаяГруппаЧестногоЗнака = ВыборкаТоварнаяГруппаЧестногоЗнака.ТоварнаяГруппаЧестногоЗнака;
			
			НовыйДокумент = Документы.ВыводИзОборотаКИЗ.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реализация, "Организация");
			НовыйДокумент.ВидПродукции = ТоварнаяГруппаЧестногоЗнака;
			НовыйДокумент.Основание = Реализация;
			НовыйДокумент.Комментарий = "Создан регламентным заданием";
			НовыйДокумент.Статус = Перечисления.СтатусыВыводИзОборотаКИЗ.Отправлен;
			НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
			
			ВыборкаКодыМаркировки = ВыборкаТоварнаяГруппаЧестногоЗнака.Выбрать();
			
			Пока ВыборкаКодыМаркировки.Следующий() Цикл 
				
				Номенклатура = ВыборкаКодыМаркировки.КодМаркировки.Номенклатура;
				
				НСтр = НовыйДокумент.Товары.Добавить(); 
				НСтр.Номенклатура = Номенклатура;
				НСтр.ШтрихКодМаркировки = ВыборкаКодыМаркировки.КодМаркировки;
				НСтр.Цена = ВыборкаКодыМаркировки.Цена; 
				
			КонецЦикла; 
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			  			
		КонецЦикла;
		
	КонецЦикла;
	
	//+Сёмин Р.И. 21.04.2026 #UT10-5815
	СформироватьВыводыИзОборотаПоТН();
	//-Сёмин Р.И. 21.04.2026 #UT10-5815
	
КонецПроцедуры

Процедура СформироватьВыводыИзОборотаПоТН()
	
	//+Сёмин Р.И. 21.04.2026 #UT10-5815
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТребованиеНакладная.Ссылка
		|ПОМЕСТИТЬ ВТ_ТребованияНакладные
		|ИЗ
		|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВыводИзОборотаКИЗ КАК ВыводИзОборотаКИЗ
		|		ПО ТребованиеНакладная.Ссылка = ВыводИзОборотаКИЗ.Основание
		|			И (ВыводИзОборотаКИЗ.Проведен)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ТребованиеНакладная.Ссылка = ЗначенияСвойствОбъектов.Объект
		|			И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ТоварПередан))
		|			И (ЗначенияСвойствОбъектов.Значение = ИСТИНА)
		|ГДЕ
		|	ТребованиеНакладная.Дата >= &ДатаНачала
		|	И ТребованиеНакладная.Проведен
		|	И ТребованиеНакладная.СборкаЗаказовПокупателя.Договор.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
		|	И ВыводИзОборотаКИЗ.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТребованияНакладные.Ссылка КАК ТребованиеНакладная,
		|	ТребованиеНакладнаяКодыМаркировки.КодМаркировки
		|ПОМЕСТИТЬ ВТ_ТребованияНакладныеСКодамиМаркировки
		|ИЗ
		|	ВТ_ТребованияНакладные КАК ВТ_ТребованияНакладные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТребованиеНакладная.КодыМаркировки КАК ТребованиеНакладнаяКодыМаркировки
		|		ПО ВТ_ТребованияНакладные.Ссылка = ТребованиеНакладнаяКодыМаркировки.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТребованияНакладныеСКодамиМаркировки.ТребованиеНакладная КАК ТребованиеНакладная,
		|	ВТ_ТребованияНакладныеСКодамиМаркировки.КодМаркировки.Номенклатура.ТоварнаяГруппаЧестногоЗнака КАК ТоварнаяГруппаЧестногоЗнака,
		|	ВТ_ТребованияНакладныеСКодамиМаркировки.КодМаркировки КАК КодМаркировки,
		|	ТоварыВСборкеОбороты.СуммаСобраноОборот / ТоварыВСборкеОбороты.СобраноОборот КАК Цена
		|ИЗ
		|	ВТ_ТребованияНакладныеСКодамиМаркировки КАК ВТ_ТребованияНакладныеСКодамиМаркировки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Обороты(, , Регистратор, ) КАК ТоварыВСборкеОбороты
		|		ПО ВТ_ТребованияНакладныеСКодамиМаркировки.ТребованиеНакладная = ТоварыВСборкеОбороты.Регистратор
		|			И ВТ_ТребованияНакладныеСКодамиМаркировки.КодМаркировки.Номенклатура = ТоварыВСборкеОбороты.Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(Цена)
		|ПО
		|	ТребованиеНакладная,
		|	ТоварнаяГруппаЧестногоЗнака";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДата(), -1));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТребованиеНакладная = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТребованиеНакладная.Следующий() Цикл
		
		ТребованиеНакладная = ВыборкаТребованиеНакладная.ТребованиеНакладная;
	
		ВыборкаТоварнаяГруппаЧестногоЗнака = ВыборкаТребованиеНакладная.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Пока ВыборкаТоварнаяГруппаЧестногоЗнака.Следующий() Цикл
			
			ТоварнаяГруппаЧестногоЗнака = ВыборкаТоварнаяГруппаЧестногоЗнака.ТоварнаяГруппаЧестногоЗнака;
			
			НовыйДокумент = Документы.ВыводИзОборотаКИЗ.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТребованиеНакладная, "Организация");
			НовыйДокумент.ВидПродукции = ТоварнаяГруппаЧестногоЗнака;
			НовыйДокумент.Основание = ТребованиеНакладная;
			НовыйДокумент.Комментарий = "Создан регламентным заданием";
			НовыйДокумент.Статус = Перечисления.СтатусыВыводИзОборотаКИЗ.Отправлен;
			НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	
			ВыборкаКодыМаркировки = ВыборкаТоварнаяГруппаЧестногоЗнака.Выбрать();
	
			Пока ВыборкаКодыМаркировки.Следующий() Цикл
				
				Номенклатура = ВыборкаКодыМаркировки.КодМаркировки.Номенклатура;
				
				НСтр = НовыйДокумент.Товары.Добавить(); 
				НСтр.Номенклатура = Номенклатура;
				НСтр.ШтрихКодМаркировки = ВыборкаКодыМаркировки.КодМаркировки;
				НСтр.Цена = ВыборкаКодыМаркировки.Цена; 
				
			КонецЦикла;
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
	КонецЦикла;
	//-Сёмин Р.И. 21.04.2026 #UT10-5815
	
КонецПроцедуры

Процедура СформироватьВводыВОборот() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка КАК Корректировка,
	|	КорректировкаРеализации.ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ_Корректировки
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Дата >= &ДатаНачала
	|	И (КорректировкаРеализации.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
	|			ИЛИ КорректировкаРеализации.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ТорговляСНовымиРегионами))
	|	И НЕ КорректировкаРеализации.Грузополучатель.СобственныйФилиал
	|	И КорректировкаРеализации.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Корректировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.ДокументПродажи КАК Реализация,
	|	ПродажиОбороты.Регистратор КАК Корректировка
	|ПОМЕСТИТЬ ВТ_КорректировкиРеализации
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНачала,
	|			,
	|			Регистратор,
	|			ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|				И ДоговорКонтрагента В
	|					(ВЫБРАТЬ
	|						ВТ_Корректировки.ДоговорКонтрагента
	|					ИЗ
	|						ВТ_Корректировки)) КАК ПродажиОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыводИзОборотаКИЗ КАК ВыводИзОборотаКИЗ
	|		ПО ПродажиОбороты.ДокументПродажи = ВыводИзОборотаКИЗ.Основание
	|			И (ВыводИзОборотаКИЗ.Проведен)
	|			И (ВыводИзОборотаКИЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВыводИзОборотаКИЗ.Обработан))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводВОборотКИЗ КАК ВводВОборотКИЗ
	|		ПО ПродажиОбороты.Регистратор = ВводВОборотКИЗ.Основание
	|ГДЕ
	|	ПродажиОбороты.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТ_Корректировки.Корректировка
	|			ИЗ
	|				ВТ_Корректировки)
	|	И ВводВОборотКИЗ.Ссылка ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.ДокументПродажи,
	|	ПродажиОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КорректировкиРеализации.Корректировка КАК Корректировка,
	|	КорректировкаРеализацииКодыМаркировки.КодМаркировки,
	|	КорректировкаРеализацииКодыМаркировки.КодМаркировки.Номенклатура.ТоварнаяГруппаЧестногоЗнака КАК ТоварнаяГруппаЧестногоЗнака
	|ИЗ
	|	ВТ_КорректировкиРеализации КАК ВТ_КорректировкиРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.КодыМаркировки КАК КорректировкаРеализацииКодыМаркировки
	|		ПО ВТ_КорректировкиРеализации.Корректировка = КорректировкаРеализацииКодыМаркировки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КорректировкиРеализации.Корректировка,
	|	КорректировкаРеализацииКодыМаркировки.КодМаркировки,
	|	КорректировкаРеализацииКодыМаркировки.КодМаркировки.Номенклатура.ТоварнаяГруппаЧестногоЗнака
	|ИТОГИ ПО
	|	Корректировка,
	|	ТоварнаяГруппаЧестногоЗнака";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДата(), -1));  
		
	ВыборкаКорректировки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);; 
	
	Пока ВыборкаКорректировки.Следующий() Цикл 
		
		Корректировка = ВыборкаКорректировки.Корректировка;
		
		ВыборкаТоварнаяГруппаЧестногоЗнака = ВыборкаКорректировки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		
		Пока ВыборкаТоварнаяГруппаЧестногоЗнака.Следующий() Цикл
			
			ТоварнаяГруппаЧестногоЗнака = ВыборкаТоварнаяГруппаЧестногоЗнака.ТоварнаяГруппаЧестногоЗнака;
			
			НовыйДокумент = Документы.ВводВОборотКИЗ.СоздатьДокумент();
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Корректировка, "Организация");
			НовыйДокумент.ВидПродукции = ТоварнаяГруппаЧестногоЗнака;
			НовыйДокумент.Основание = Корректировка;
			НовыйДокумент.Комментарий = "Создан регламентным заданием";
			НовыйДокумент.Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен;
			НовыйДокумент.СпособИзготовления = Перечисления.ВидыСервисПровайдеровСУЗ.Самостоятельно;
			НовыйДокумент.СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя;
			НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
			
			ВыборкаКодыМаркировки = ВыборкаТоварнаяГруппаЧестногоЗнака.Выбрать();
			
			Пока ВыборкаКодыМаркировки.Следующий() Цикл 
				
				Номенклатура = ВыборкаКодыМаркировки.КодМаркировки.Номенклатура;
				
				НСтр = НовыйДокумент.Товары.Добавить(); 
				НСтр.Номенклатура = Номенклатура;
				НСтр.ШтрихКодМаркировки = ВыборкаКодыМаркировки.КодМаркировки;
					
			КонецЦикла; 
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			  			
		КонецЦикла;
		
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура ОтправитьДокументыНаПроверкуВЧЗ() Экспорт
//+Белов А. 01.06.2026 #UT10-5888

	Маркировка.ОтправитьДокументыНаПроверкуВЧЗ();

//-Белов А. 01.06.2026 #UT10-5888		
КонецПроцедуры

Процедура ПолучениеДанныхИзУТ11ОПодписиПТУВЭДО() Экспорт
	
	//+Сёмин Р.И. 14.07.2026 #UT10-5945
	ИмяСобытия = "Получение данных из УТ11 о подписи ПТУ в ЭДО";
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Предупреждение,
			,
			,
			"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ"
		);
		
		Возврат;
		
	КонецЕсли;	
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"Начато регламентное задание Получение данных из УТ 11 о подписи ПТУ в ЭДО"
	);
	
	ГУИДыПТУ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|			ТОГДА ВЫРАЗИТЬ(ЗначенияСвойствОбъектов.Объект КАК Документ.ПоступлениеТоваровУслуг)
		|	КОНЕЦ КАК Документ
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|	И ЗначенияСвойствОбъектов.Объект.Дата >= &Дата
		|	И ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Дата", ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1));
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
	Запрос.УстановитьПараметр("Значение", Перечисления.СтатусыПриемки.НеНайденВЭДО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ГУИДыПТУ.Добавить(Строка(ВыборкаДетальныеЗаписи.Документ.УникальныйИдентификатор()));
	КонецЦикла;
	
	Если ГУИДыПТУ.Количество() > 0 Тогда
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			"Выполняется запрос на получение данных в УТ 11 по ПТУ с ГУИДами:" + Символы.ПС + МодульРегламентныхЗаданий.СтрСоединить(ГУИДыПТУ, Символы.ПС)
		);
		
		Результат = МСКWEB.ПолучитьДанныеИзУТ11ОПодписиПТУВЭДО(ГУИДыПТУ);
		
		ПолученныеГУИДыПТУ = Новый Массив;
		
		Для Каждого Стр Из Результат.МассивНайденныхПоступлений Цикл
			
			ПолученныеГУИДыПТУ.Добавить(Стр.КодИсточника);
			
			ПТУ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Стр.КодИсточника));
			
			Если ДобавитьДокументВРегистрДокументыЭДОТребующиеОбработки(ПТУ) Тогда
				
				МенеджерЗаписи = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи();
				
				Если ЗначениеЗаполнено(Стр.Идентификатор) Тогда
					МенеджерЗаписи.Идентификатор = Стр.Идентификатор;
				Иначе
					МенеджерЗаписи.Идентификатор = ПолучитьИдентификаторДляРегистраДокументыЭДОТребующиеОбработки(9000000000);
				КонецЕсли;
				
				МенеджерЗаписи.ВидДокумента = "Поступление";
				МенеджерЗаписи.Документ = ПТУ;
				МенеджерЗаписи.Контрагент = ПТУ.Контрагент;
				МенеджерЗаписи.Договор = ПТУ.ДоговорКонтрагента;
				МенеджерЗаписи.Дата = ТекущаяДата();
				МенеджерЗаписи.Отработан = Истина;
				
				МенеджерЗаписи.Записать(Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			"Получение данных из УТ 11 о подписи ПТУ в ЭДО. Из УТ11 получены данные по ПТУ с ГУИДами:" + Символы.ПС + МодульРегламентныхЗаданий.СтрСоединить(ПолученныеГУИДыПТУ, Символы.ПС)
		);
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытия,
			УровеньЖурналаРегистрации.Информация,
			,
			,
			"В УТ10 не найдены ПТУ, по которым надо получать информацию о подписи в УТ 11"
		);
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытия,
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"Закончено регламентное задание Получение данных из УТ 11 о подписи ПТУ в ЭДО"
	);
	//-Сёмин Р.И. 14.07.2026 #UT10-5945
	
КонецПроцедуры

Процедура АвтоматическоеФормированиеИРассылкаДокументовВыкуп() Экспорт
	
	//+Сёмин Р.И. 07.08.2026 #UT10-5989
	ИмяСобытия = "Автоматическое формирование и рассылка документов Выкуп";
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Предупреждение, , ,
			"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ"
		);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		"Начато регламентное задание " + ИмяСобытия
	);
	
	ОбработкаЗапуска = Обработки.ОформлениеПроданныхТОХ.Создать();
	ОбработкаЗапуска.РегламентноеВыполнение();
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация, , ,
		"Закончено регламентное задание " + ИмяСобытия
	);
	//-Сёмин Р.И. 07.08.2026 #UT10-5989
	
КонецПроцедуры




//////////////////////////////////////////////////
//    Обработка входящих сообщений                
//////////////////////////////////////////////////

Функция ЗапуститьОбработкуСообщения(ВФоне = Истина, ТипСообщения, ТолькоСообщенияСОшибкой = Ложь) Экспорт
	
	МассивПотоков = ПолучитьМассивПотоков(ТипСообщения); 
	
	Если МассивПотоков.Количество() = 0 Тогда
		Возврат Неопределено;			
	КонецЕсли;
	
	Если ВФоне Тогда 
		
		Для каждого СтруктураПотока Из МассивПотоков Цикл
			
			ИмяЗадания = "Запуск обработки сообщений с типом '" + Строка(СтруктураПотока.ТипСообщения) + "' Поток №" + Строка(СтруктураПотока.КодПотока) + ?(ТолькоСообщенияСОшибкой, "_errors", "");
			
			Если ЕстьЗапущенноеФоновоеЗадание(ИмяЗадания, Истина, 3600) Тогда
				Продолжить;	
			КонецЕсли; 
			
			УникальныйИдентификатор = Новый УникальныйИдентификатор;
			
		    ПараметрыВыполнения = Новый Массив;  
			ПараметрыВыполнения.Добавить(СтруктураПотока.МассивИмен);
			ПараметрыВыполнения.Добавить(СтруктураПотока.ТипСообщения);
			ПараметрыВыполнения.Добавить(ТолькоСообщенияСОшибкой);
			
			//+Гавриленков В. 14.07.2026 #UT10-5952
			//ФоновыеЗадания.Выполнить("МодульРегламентныхЗаданий.ОбработатьВходящиеСообщения", ПараметрыВыполнения, УникальныйИдентификатор);
			ФоновыеЗадания.Выполнить("МодульРегламентныхЗаданий.ОбработатьВходящиеСообщения", ПараметрыВыполнения, УникальныйИдентификатор, ИмяЗадания);
			//-Гавриленков В. 14.07.2026 #UT10-5952

		КонецЦикла;
		
	Иначе    
	
		Для каждого СтруктураПотока Из МассивПотоков Цикл
			ОбработатьВходящиеСообщения(СтруктураПотока.МассивИмен, СтруктураПотока.ТипСообщения, ТолькоСообщенияСОшибкой);
		КонецЦикла;
		
	КонецЕсли;
		
КонецФункции 

Функция ЕстьЗапущенноеФоновоеЗадание(ИмяЗадания, ЗавершатьЗависшие = Ложь, МаксимальноеВремяВыполнения = 3600) Экспорт
	
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Состояние", СостояниеФоновогоЗадания.Активно));
	
	ЕстьЗадание = Ложь;
	
	Для каждого Задание Из Задания Цикл
		
		Если Найти(Задание.Наименование, ИмяЗадания) > 0 Тогда
			
			ЕстьЗадание = Истина;	
			
			Если ЗавершатьЗависшие И (ТекущаяДата() - Задание.Начало) > МаксимальноеВремяВыполнения Тогда   
				
				ТекстЗаписиВЖурнал = "Отменено фоновое задание: " + Задание.Наименование + " начало: " + Формат(Задание.Начало, "ДЛФ=DT");  
				
				Задание.Отменить();			
				
				ЗаписьЖурналаРегистрации("Фоновое задание.Отмена", УровеньЖурналаРегистрации.Информация,,, ТекстЗаписиВЖурнал);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;     
	
	Возврат ЕстьЗадание;
	
КонецФункции     

Функция ЗапуститьОбработкуСообщений() Экспорт
	
	ЗапуститьОбработкуСообщения(Истина, Перечисления.Р_ТипыВходящихСообщений.Документ);
	
КонецФункции  

Процедура ОбработатьВходящиеСообщения(СписокИменМетаданных, ТипСообщения, ТолькоСообщенияСОшибкой) Экспорт
	
	Таблица = ПолучитьНеОбработанныеСообщения(ТипСообщения, СписокИменМетаданных, ТолькоСообщенияСОшибкой); 
	
	ЗаблокироватьРазблокироватьСообщения(Таблица);   
	
	СтрокаИменМетаданных = "";
	
	Для каждого ИмяМетаданных Из СписокИменМетаданных Цикл
		СтрокаИменМетаданных = СтрокаИменМетаданных + ?(ЗначениеЗаполнено(СтрокаИменМетаданных), ", ", "") + ИмяМетаданных;	
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Обработка входящих сообщений.Начало", УровеньЖурналаРегистрации.Информация,,, "Получено: " + Строка(Таблица.Количество()) + " сообщений для обработки с типом сообщения '" + Строка(ТипСообщения) + "'" + Символы.ПС + "Имена метаданных: " + СтрокаИменМетаданных);
	
	УспешноОбработано = 0;
	СОшибкойОбработано = 0;
	
	Для каждого Строка Из Таблица Цикл
		
		Сообщение = Строка.Сообщение;
		СообщениеОб = Сообщение.ПолучитьОбъект();                       
		
		ИмяОчереди = Сообщение.Подписка.ИмяОчереди;  
		
		Попытка
			
			Если ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Документ Тогда
				
				ЭтоОчередьПоМаркировке = Маркировка.ЭтоОчередьПоМаркировке(ИмяОчереди);    
				
				Если ЭтоОчередьПоМаркировке Тогда  
					
					Отказ = ЛОЖЬ;    
					МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);
					Продолжить;          
					
				КонецЕсли;  
				
				Если МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) Тогда 
					
					Отказ = Ложь;   
					МСК.ОбработатьСообщениеJSON(Сообщение, Отказ); 
					
				//+Белов А. 14.09.2026 #UT10-6038
				ИначеЕсли МСК.ЭтоОчередьУТ10ВУТ10(ИмяОчереди) Тогда
					
					Отказ = Ложь;     
					МСК.ОбработатьСообщениеJSON(Сообщение, Отказ); 
				//-Белов А. 14.09.2026 #UT10-6038  				
				Иначе	
				
					Отказ = Ложь;      
					ТекстСообщения = Сообщение.Данные;
					ЭтоСообщениеJSON = Найти(ТекстСообщения, "/json");    
					
					Если ЭтоСообщениеJSON Тогда
						МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);   
					Иначе
						МСК.ОбработатьСообщениеИзОчереди(ИмяОчереди, Сообщение.Данные, Отказ, Сообщение.КоличествоПопытокПовторнойОбработки);    
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;		

		Исключение  
						
			ТекстОшибки = ОписаниеОшибки();    		
			
			Если СообщениеОб.ОбработаноСОшибкой Тогда
				СообщениеОб.КоличествоПопытокПовторнойОбработки = СообщениеОб.КоличествоПопытокПовторнойОбработки + 1;				
			КонецЕсли;
			
			СообщениеОб.ОбработаноСОшибкой = Истина; 
			СообщениеОб.ТекстОшибки = ТекстОшибки;	
			СообщениеОб.Записать();
			
			СОшибкойОбработано = СОшибкойОбработано + 1;
			
			ЗаписьЖурналаРегистрации("Обработка входящих сообщений.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Возникла ошибка при обработке сообщения: " + СообщениеОб.Код + Символы.ПС + ТекстОшибки);
			
		КонецПопытки;

	КонецЦикла; 
	
	ЗаписьЖурналаРегистрации("Обработка входящих сообщений.Окончание", УровеньЖурналаРегистрации.Информация,,, "Обработано успешно: " + Строка(УспешноОбработано) + ", с ошибкой: " + Строка(СОшибкойОбработано));
	
	ЗаблокироватьРазблокироватьСообщения(Таблица, Ложь);
	
КонецПроцедуры

Процедура УдалитьСтарыеВходящиеСообщения() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	Р_ВходящиеСообщения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Р_ВходящиеСообщения КАК Р_ВходящиеСообщения
	|ГДЕ
	|	Р_ВходящиеСообщения.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	Р_ВходящиеСообщения.Дата,
	|	Р_ВходящиеСообщения.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - Константы.AMQP_КоличествоДнейХраненияСообщений.Получить() * 86400);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.Удалить();
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьНеОбработанныеСообщения(ТипСообщения, СписокИменМетаданных, ТолькоСообщенияСОшибкой) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 10000
	|	Р_ВходящиеСообщения.Ссылка КАК Сообщение,
	|	Р_ВходящиеСообщения.КоличествоПопытокПовторнойОбработки КАК КоличествоПопытокПовторнойОбработки
	|ИЗ
	|	Справочник.Р_ВходящиеСообщения КАК Р_ВходящиеСообщения
	|ГДЕ
	|	НЕ Р_ВходящиеСообщения.Обработано
	|	И НЕ Р_ВходящиеСообщения.ПометкаУдаления
	|	И Р_ВходящиеСообщения.ТипСообщения = &ТипСообщения
	|	И ВЫБОР
	|			КОГДА &ТолькоСообщенияСОшибкой
	|				ТОГДА Р_ВходящиеСообщения.ОбработаноСОшибкой
	|						И Р_ВходящиеСообщения.КоличествоПопытокПовторнойОбработки < 5
	|			ИНАЧЕ НЕ Р_ВходящиеСообщения.ОбработаноСОшибкой
	|		КОНЕЦ
	|	И Р_ВходящиеСообщения.ИмяОбъектаМетаданных В(&СписокИменМетаданных)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Р_ВходящиеСообщения.Дата,
	|	Р_ВходящиеСообщения.НомерПоПорядку";
	
	Запрос.УстановитьПараметр("ТипСообщения", ТипСообщения);
	Запрос.УстановитьПараметр("СписокИменМетаданных", СписокИменМетаданных);
	Запрос.УстановитьПараметр("ТолькоСообщенияСОшибкой", ТолькоСообщенияСОшибкой);
	
	Результат = Запрос.Выполнить().Выгрузить();  
	
	СтрокиУдаления = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		
		Если Стр.Сообщение.ПолучитьОбъект().Заблокирован() Тогда
			СтрокиУдаления.Добавить(Стр);	
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого СтрУдаления Из СтрокиУдаления Цикл
		Результат.Удалить(СтрУдаления);	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМассивПотоков(ТипСообщения)
	
	Потоки = Новый Массив;
	
	ИмяСправочника = "AMQP_СправочникиЗагрузки"; 
	ИмяРеквизита = "ИмяСправочника"; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Р_ОбъектыЗагрузки.ИмяСправочника КАК ИмяОбъектаМетаданных
	|ИЗ
	|	Справочник.AMQP_СправочникиЗагрузки КАК Р_ОбъектыЗагрузки
	|ГДЕ
	|	Р_ОбъектыЗагрузки.Загружать";
	
	ВыборкаИмениОбъекта = Запрос.Выполнить().Выбрать();
	
	СтруктураПотока = Новый Структура;
	СтруктураПотока.Вставить("ТипСообщения", ТипСообщения);
	
	МассивИмен = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяОбъектаМетаданных");
	
	СтруктураПотока.Вставить("МассивИмен", МассивИмен);   
	СтруктураПотока.Вставить("КодПотока", 1);
	
	Потоки.Добавить(СтруктураПотока);
	
	Возврат Потоки;
	
КонецФункции

Процедура ЗаблокироватьРазблокироватьСообщения(ТаблицаСообщений, Заблокировать = Истина)
	
	Для каждого Строка Из ТаблицаСообщений Цикл  
		
		Сообщение = Строка.Сообщение;
		СообщениеОб = Сообщение.ПолучитьОбъект(); 
		
		Если Заблокировать Тогда
			СообщениеОб.Заблокировать();  
		Иначе
			СообщениеОб.Разблокировать();	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьИдентификаторДляРегистраДокументыЭДОТребующиеОбработки(МинИдентификатор)
	
	//+Сёмин Р.И. 15.07.2026 #UT10-5945
	НовыйИдентификатор = МинИдентификатор;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ДокументыЭДОТребующиеОбработки.Идентификатор), &Идентификатор) КАК Идентификатор
		|ИЗ
		|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
		|ГДЕ
		|	ДокументыЭДОТребующиеОбработки.Идентификатор >= &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", МинИдентификатор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовыйИдентификатор = ВыборкаДетальныеЗаписи.Идентификатор + 1;
	КонецЦикла;
	
	Возврат НовыйИдентификатор;
	//-Сёмин Р.И. 15.07.2026 #UT10-5945
	
КонецФункции

Функция ДобавитьДокументВРегистрДокументыЭДОТребующиеОбработки(Документ)
	
	//+Сёмин Р.И. 15.07.2026 #UT10-5945
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыЭДОТребующиеОбработки.Документ
		|ИЗ
		|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
		|ГДЕ
		|	ДокументыЭДОТребующиеОбработки.Документ = &Документ
		|	И ДокументыЭДОТребующиеОбработки.Отработан";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	//-Сёмин Р.И. 15.07.2026 #UT10-5945
	
КонецФункции
