Перем ПредДоговор Экспорт;
Перем Отправлен;
Перем мСтруктураПараметровДляПолученияДоговора Экспорт;

Процедура ОбработкаПроверкиЗаполнения(Отказ , ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Дата < Константы.ДатаНачалаСборкиСУчетомЭтажей.Получить() Тогда
		НепроверяемыеРеквизиты.Добавить("Заказано.Ячейка");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения ИЛИ ПометкаУдаления = Истина Тогда 
		
		Если НЕ РольДоступна("РазрешеноУдалениеСнятиеСПроведенияДокументаСборка") Тогда 
			
			Отказ = Истина;
			Сообщить("Недостаточно прав для выполнения операции!", СтатусСообщения.Важное);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		
		УстановитьДокументСобранИУпакован();  
		ПроверитьСпособДоставки(Отказ);  
		ПроверитьОрганизациюПоСтрокам(Отказ);
		ПроверитьДатуЗаказа(Отказ);
		
	КонецЕсли;  
	
	УстановитьЭкспресс(РежимЗаписи);
	ЗаполнитьЭтаж();  
	
	Если Не Отказ Тогда
		ПолучитьОтправлен(РежимЗаписи);
	КонецЕсли;
	
	ЗаполнитьКлючСтроки();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Перем Заголовок;
	
	СтруктураОбязательныхПолей = Новый Структура("Организация, Контрагент, Договор, СпособДоставки");
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	ДатаНачалаСборкиСУчетомЭтажей = Константы.ДатаНачалаСборкиСУчетомЭтажей.Получить();
	ДатаНачалаПроведенияПоНовомуАлгоритму = Константы.ДатаНачалаПроведенияКСборкеПоНовомуАлгоритму.Получить();
	
	Если ДокументСобранИУпакован Тогда  
		
		Если КоличествоУпаковочныхМест = 0 Тогда   
			Сообщить("Не указано количество упаковочных мест!", СтатусСообщения.ОченьВажное);
		КонецЕсли;
		
		Если Дата < ДатаНачалаСборкиСУчетомЭтажей Тогда 
			
			Для Каждого ТекСтрокаСобрано Из Собрано Цикл
				
				Если ТекСтрокаСобрано.Подборка = Перечисления.ПодборкаНоменклатуры.ИдетПодборка Тогда
					
					Сообщить("В строке: " + ТекСтрокаСобрано.НомерСтроки + " номенклатура еще НЕ СОБРАНА!");
					Отказ = Истина;   				
					
					Продолжить;
					
				КонецЕсли;
				
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Отказ Тогда  		
		Возврат;       		
	КонецЕсли; 
	
	Если Дата < Константы.ДатаНачалаРаботыСДокументомСборкаЗаказовПокупателя.Получить() Тогда  
		ДвиженияДоДатаНачалаРаботыСДокументомСборкаЗаказовПокупателя(Отказ);
	Иначе	
		
		Если Дата < Константы.ДатаНачалаСборкиСУчетомЭтажей.Получить() Тогда   
			ДвиженияДоДатаНачалаСборкиСУчетомЭтажей(Отказ);  
		Иначе    
			ДвиженияСборкаСУчетомЭтажей(Отказ);  
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ И Константы.AMQP_ВыгружатьДанные.Получить() И Договор.ВыгружаетсяВБиллинг И Отправлен Тогда
		Рез = AMQP_РаботаСДокументами.ПодтверждениеДокументаВБиллинге(Ссылка);			
	КонецЕсли;
	
КонецПроцедуры                                                                

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если Не Отказ И Константы.AMQP_ВыгружатьДанные.Получить() И Договор.ВыгружаетсяВБиллинг тогда
		Рез = AMQP_РаботаСДокументами.ОтменитьДокументБлокировкиВБиллинге(Ссылка);
	КонецЕсли
	
КонецПроцедуры

Функция НайтиФактическоеКоличество(Номенклатура)
	
	Кол = 0;
	
	Для Каждого ТекСтр Из Собрано Цикл
		
		Если ТекСтр.Номенклатура = Номенклатура Тогда 
			Кол = Кол + ТекСтр.Факт;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Кол;  
	
КонецФункции

Процедура ДвиженияДоДатаНачалаРаботыСДокументомСборкаЗаказовПокупателя(Отказ)
	
	Движения.ТоварыГотовыеКСборке.Записывать = Истина;
	Движения.НоменклатураГотоваяЕхатьККлиенту.Записывать = НЕ ПолностьюОткорректирована;//Истина;
	Движения.СобраноПоЗаказу.Записывать = Истина;
	
	Если ДокументСобранИУпакован Тогда 	
		
		ДвижениеЗаказНаМаршрут = Движения.НоменклатураГотоваяЕхатьККлиенту.Добавить();
		ДвижениеЗаказНаМаршрут.ВидДвижения =  ВидДвиженияНакопления.Приход;
		ДвижениеЗаказНаМаршрут.Период = Дата;
		ДвижениеЗаказНаМаршрут.Организация = Организация;
		ДвижениеЗаказНаМаршрут.Регистратор = Ссылка;
		ДвижениеЗаказНаМаршрут.ДокументСборкиНоменклатуры = Ссылка ;
		ДвижениеЗаказНаМаршрут.Количество = 1;
		
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если ДокументСобранИУпакован Тогда 
		
		ЗапросЗакрытияСборки = Новый Запрос;
		ЗапросЗакрытияСборки.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗаказовПокупателяЗаказано.Заказ,
		|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
		|	СборкаЗаказовПокупателяЗаказано.Количество
		|ПОМЕСТИТЬ НаПодбор
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|ГДЕ
		|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
		|{УПОРЯДОЧИТЬ ПО
		|	СборкаЗаказовПокупателяЗаказано.Ссылка.МоментВремени}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаПодбор.Заказ,
		|	НаПодбор.Номенклатура,
		|	НаПодбор.Количество,
		|	СУММА(НаПодборДоп.Количество) КАК ИтогНакопительный
		|ПОМЕСТИТЬ ПорядокОтгрузки
		|ИЗ
		|	НаПодбор КАК НаПодбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаПодбор КАК НаПодборДоп
		|		ПО НаПодбор.Номенклатура = НаПодборДоп.Номенклатура
		|			И НаПодбор.Заказ.МоментВремени >= НаПодборДоп.Заказ.МоментВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	НаПодбор.Заказ,
		|	НаПодбор.Номенклатура,
		|	НаПодбор.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПорядокОтгрузки.Заказ ,
		|	ПорядокОтгрузки.Номенклатура,
		|	ВЫБОР
		|		КОГДА СборкаЗаказовПокупателяСобрано.Факт >= ПорядокОтгрузки.ИтогНакопительный
		|			ТОГДА ПорядокОтгрузки.Количество
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ПорядокОтгрузки.ИтогНакопительный - ПорядокОтгрузки.Количество - СборкаЗаказовПокупателяСобрано.Факт < 0
		|					ТОГДА (ПорядокОтгрузки.ИтогНакопительный - ПорядокОтгрузки.Количество - СборкаЗаказовПокупателяСобрано.Факт) * -1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Собрано
		|ПОМЕСТИТЬ ТаблицаКСписанию
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Собрано КАК СборкаЗаказовПокупателяСобрано
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокОтгрузки КАК ПорядокОтгрузки
		|		ПО СборкаЗаказовПокупателяСобрано.Номенклатура = ПорядокОтгрузки.Номенклатура
		|ГДЕ
		|	СборкаЗаказовПокупателяСобрано.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКСписанию.Заказ КАК ЗаказПокупателя,
		|	ТаблицаКСписанию.Номенклатура,
		|	СУММА(ТаблицаКСписанию.Собрано) КАК Собрано
		|ИЗ
		|	ТаблицаКСписанию КАК ТаблицаКСписанию
		|ГДЕ
		|	ТаблицаКСписанию.Собрано > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКСписанию.Заказ,
		|	ТаблицаКСписанию.Номенклатура";
		
		ЗапросЗакрытияСборки.УстановитьПараметр("Ссылка",Ссылка);
		РезультатЗапросаЗакрытия = ЗапросЗакрытияСборки.Выполнить();  
		
		Если Не РезультатЗапросаЗакрытия.Пустой() Тогда
			
			ВыборкаЗапросаЗакрытия = РезультатЗапросаЗакрытия.Выбрать();
			
			Пока ВыборкаЗапросаЗакрытия.Следующий() Цикл
				
				Движение = Движения.ТоварыГотовыеКСборке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
				Движение.Номенклатура = ВыборкаЗапросаЗакрытия.Номенклатура;
				Движение.ЗаказПокупателя = ВыборкаЗапросаЗакрытия.ЗаказПокупателя;
				Движение.Количество = ВыборкаЗапросаЗакрытия.Собрано;   
				Движение.Назначение = Ссылка.Назначение;   
				
				//
				// Сразу движение по оборотному регистру "СобраноПоЗаказу"
				ДвижениеСобрано = Движения.СобраноПоЗаказу.Добавить();
				ДвижениеСобрано.Период = Дата;
				ДвижениеСобрано.Регистратор = Ссылка;
				ДвижениеСобрано.Заказ =  ВыборкаЗапросаЗакрытия.ЗаказПокупателя;
				ДвижениеСобрано.Номенклатура =  ВыборкаЗапросаЗакрытия.Номенклатура;
				ДвижениеСобрано.Количество =  ВыборкаЗапросаЗакрытия.Собрано;  
				
			КонецЦикла;		
			
		КонецЕсли; 
		
	Иначе
		
		ФильтрПоНоменклатуре = Новый Массив;
		ФильтрПоЗаказам= Новый Массив;
		
		Для Каждого ТекСтрокаЗаказано Из Заказано Цикл
			
			ИндексМассива = ФильтрПоНоменклатуре.Найти(ТекСтрокаЗаказано.Номенклатура);
			
			Если ИндексМассива = Неопределено Тогда
				ФильтрПоНоменклатуре.Добавить(ТекСтрокаЗаказано.Номенклатура);
			КонецЕсли;
			
			ИндексМассива = ФильтрПоЗаказам.Найти(ТекСтрокаЗаказано.Заказ);
			
			Если ИндексМассива = Неопределено Тогда
				ФильтрПоЗаказам.Добавить(ТекСтрокаЗаказано.Заказ);
			КонецЕсли;
			
		КонецЦикла; 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыГотовыеКСборкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ТоварыГотовыеКСборкеОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
		|			&Д,
		|			ЗаказПокупателя В (&ЗаказПокупателя)
		|				И Номенклатура В (&Номенклатура)) КАК ТоварыГотовыеКСборкеОстатки";
		
		Запрос.УстановитьПараметр("Д", МоментВремени());
		Запрос.УстановитьПараметр("Номенклатура", ФильтрПоНоменклатуре);
		Запрос.УстановитьПараметр("ЗаказПокупателя", ФильтрПоЗаказам);
		
		Результат = Запрос.Выполнить();
		Остатки = Результат.Выбрать() ;
		
		Для Каждого ТекСтрокаЗаказано Из Заказано Цикл
			
			НадоСписать =   ?(ДокументСобранИУпакован,ПолучитьФактическоеКоличество(ТекСтрокаЗаказано.Номенклатура,ТекСтрокаЗаказано.Количество),
			ТекСтрокаЗаказано.Количество) ;
			СтруктураПоиска = Новый Структура("Номенклатура,ЗаказПокупателя");
			СтруктураПоиска.Номенклатура = ТекСтрокаЗаказано.Номенклатура;
			СтруктураПоиска.ЗаказПокупателя =  ТекСтрокаЗаказано.Заказ;
			Остатки.Сбросить();
			
			Пока Остатки.НайтиСледующий(СтруктураПоиска) Цикл
				
				Если 	НадоСписать   = 0 Тогда
					Прервать;
				КонецЕсли;
				
				Движение = Движения.ТоварыГотовыеКСборке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
				Движение.Номенклатура = ТекСтрокаЗаказано.Номенклатура;
				Движение.ЗаказПокупателя = Остатки.ЗаказПокупателя;
				Движение.Количество = МИН(Остатки.КоличествоОстаток,НадоСписать);  
				Движение.Назначение = Ссылка.Назначение;
				
				// Сразу движение по оборотному регистру "СобраноПоЗаказу"
				ДвижениеСобрано = Движения.СобраноПоЗаказу.Добавить();
				ДвижениеСобрано.Период = Дата;
				ДвижениеСобрано.Регистратор = Ссылка;
				ДвижениеСобрано.Заказ =  Остатки.ЗаказПокупателя;
				ДвижениеСобрано.Номенклатура =  ТекСтрокаЗаказано.Номенклатура;
				ДвижениеСобрано.Количество =  МИН(Остатки.КоличествоОстаток,НадоСписать);
				
				НадоСписать   = НадоСписать -  Движение.Количество ;
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура ДвиженияДоДатаНачалаСборкиСУчетомЭтажей(Отказ)
	
	ДатаНачалаИспользованияДокументаКорректировкаСборки = Константы.ДатаНачалаИспользованияДокументаКорректировкаСборки.Получить(); 
	
	Движения.ТоварыГотовыеКСборке.Записывать = Истина;
	Движения.НоменклатураГотоваяЕхатьККлиенту.Записывать = НЕ ПолностьюОткорректирована;//Истина;
	Движения.СобраноПоЗаказу.Записывать = Истина;
	Движения.ТоварыВЯчейках.Записывать = Истина;
	Движения.ТоварыВСборке.Записывать = Истина;			
	
	Сум = 0;
	МассивОбработаннойНоменклатуры = Новый Массив;
	
	Для Каждого ТекСтр Из Заказано Цикл
		
		Индекс = МассивОбработаннойНоменклатуры.Найти(ТекСтр.Номенклатура);
		
		Если  Индекс <> Неопределено Тогда  
			Продолжить;
		КонецЕсли;
		
		КоличествоСобраноФакт = НайтиФактическоеКоличество(ТекСтр.Номенклатура);
		
		Если ТекСтр.Количество = КоличествоСобраноФакт  Тогда 
			Сум = Сум + НайтиЦенуИзДокумента(ТекСтр.Заказ, ТекСтр.Номенклатура) * ТекСтр.Количество;
		Иначе 
			
			СтруктураОтбора = Новый Структура("Номенклатура", ТекСтр.Номенклатура);
			Строки = Заказано.НайтиСтроки(СтруктураОтбора);
			
			Если  Строки.Количество() = 1 Тогда
				// Это просто. Был один заказ. Из него и берем цену...
				Сум = Сум + НайтиЦенуИзДокумента(ТекСтр.Заказ, ТекСтр.Номенклатура) * КоличествоСобраноФакт;
				
			ИначеЕсли  Строки.Количество() > 1 Тогда 
				
				НадоРаскидать = КоличествоСобраноФакт ;
				
				Для каждого СчетчикСтрок Из Строки Цикл
					
					Сум = Сум + НайтиЦенуИзДокумента(СчетчикСтрок.Заказ, ТекСтр.Номенклатура) * МИН(СчетчикСтрок.Количество, НадоРаскидать);
					НадоРаскидать = НадоРаскидать - МИН(СчетчикСтрок.Количество, НадоРаскидать);
					
					Если НадоРаскидать = 0 Тогда 
						Прервать;
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивОбработаннойНоменклатуры.Добавить(ТекСтр.Номенклатура);
		
	КонецЦикла; 
	
	Если НЕ ДокументСобранИУпакован Тогда 		
		
		ТЗ = Заказано.Выгрузить(,"Номенклатура,Количество");
		ТЗ.Свернуть("Номенклатура", "Количество");
		
	Иначе 
		
		ТЗ = Собрано.Выгрузить(,"Номенклатура,Факт");
		ТЗ.Свернуть("Номенклатура", "Факт");
		
	КонецЕсли;
	
	СписокНоменклатуры  = Новый Массив;
	СписокНоменклатуры = ТЗ.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура
	|ПОМЕСТИТЬ ЗаказыИНомерклатураПокупателей
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗаказыПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ЗаказыПокупателейОстатки.Номенклатура
	|ПОМЕСТИТЬ ОстаткиПоЗаказам
	|ИЗ
	|	ЗаказыИНомерклатураПокупателей КАК ЗаказыИНомерклатураПокупателей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				&Д1,
	|				ЗаказПокупателя В
	|						(ВЫБРАТЬ
	|							ЗаказыИНомерклатураПокупателей.Заказ
	|						ИЗ
	|							ЗаказыИНомерклатураПокупателей КАК ЗаказыИНомерклатураПокупателей)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ЗаказыИНомерклатураПокупателей.Номенклатура
	|						ИЗ
	|							ЗаказыИНомерклатураПокупателей КАК ЗаказыИНомерклатураПокупателей)) КАК ЗаказыПокупателейОстатки
	|		ПО ЗаказыИНомерклатураПокупателей.Заказ = ЗаказыПокупателейОстатки.ЗаказПокупателя
	|			И ЗаказыИНомерклатураПокупателей.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ТоварыВЯчейкахОстатки.Склад КАК Склад,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ТоварыВЯчейкахОстатки.Ячейка.ПриоритетСписывания КАК ЯчейкаПриоритетСписывания,
	|	ЕСТЬNULL(ОстаткиПоЗаказам.КоличествоОстаток, 0) КАК ОстатокВЗаказе
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(&Д, Номенклатура В (&СписокНоменклатуры)) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиПоЗаказам КАК ОстаткиПоЗаказам
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = ОстаткиПоЗаказам.Номенклатура
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток > 0
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЯчейкаПриоритетСписывания УБЫВ"; 
	
	Запрос.УстановитьПараметр("Д1", МоментВремени());
	Запрос.УстановитьПараметр("Д", МоментВремени());
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапросаПоОстаткамЯчеек =   РезультатЗапроса.Выбрать();
	
	ПревышениеОтправкиНадПодпребностью = 0;
	
	НоменклатураВСообщении = Новый Массив;
	
	Для каждого ТекСтр Из ТЗ Цикл
		
		НадоСписатьИзЯчеек =  ?(ДокументСобранИУпакован, ТекСтр.Факт, ТекСтр.Количество);
		
		ВыборкаЗапросаПоОстаткамЯчеек.Сбросить();
		СтруктураОтбора = Новый Структура("Номенклатура", ТекСтр.Номенклатура);
		
		Пока ВыборкаЗапросаПоОстаткамЯчеек.НайтиСледующий(СтруктураОтбора) Цикл 
			
			Если ВыборкаЗапросаПоОстаткамЯчеек.ОстатокВЗаказе < НадоСписатьИзЯчеек  Тогда 
				
				Отказ = Истина;
				
				Если НоменклатураВСообщении.Найти(ТекСтр.Номенклатура) = Неопределено Тогда 
					Сообщить("Номенклатуры : " + ТекСтр.Номенклатура + " заказано ТОЛЬКО : " + ВыборкаЗапросаПоОстаткамЯчеек.ОстатокВЗаказе+
					", а ОТПРАВЛЯЕТСЯ клиенту : " + НадоСписатьИзЯчеек, СтатусСообщения.ОченьВажное);
				КонецЕсли;
				
				НоменклатураВСообщении.Добавить(ТекСтр.Номенклатура);
				ПревышениеОтправкиНадПодпребностью = 1; 					
				Продолжить;                            
				
			КонецЕсли;
			
			Если НадоСписатьИзЯчеек > 0 Тогда    
				
				Движение = Движения.ТоварыВЯчейках.Добавить();
				Движение.Период 		= Дата;
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Номенклатура 	= ТекСтр.Номенклатура ;
				Движение.Склад 			= ВыборкаЗапросаПоОстаткамЯчеек.Склад;
				Движение.Ячейка 		= ВыборкаЗапросаПоОстаткамЯчеек.Ячейка ;
				Движение.Количество 	= МИН(НадоСписатьИзЯчеек,ВыборкаЗапросаПоОстаткамЯчеек.Количество);
				НадоСписатьИзЯчеек   	= НадоСписатьИзЯчеек  -  Движение.Количество;
			Иначе   
				Прервать;  
			КонецЕсли;
			
		КонецЦикла;
		
		Если НадоСписатьИзЯчеек > 0 и ПревышениеОтправкиНадПодпребностью = 0 Тогда
			
			Сообщить("Не хватает в ячейках номенклатуры : " + ТекСтр.Номенклатура + " Документ НЕ БУДЕТ проводиться!!", СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если  Отказ Тогда 	
		Возврат;
	КонецЕсли;
	
	Если ДокументСобранИУпакован Тогда
		
		ДвижениеЗаказНаМаршрут = Движения.НоменклатураГотоваяЕхатьККлиенту.Добавить();
		ДвижениеЗаказНаМаршрут.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеЗаказНаМаршрут.Период = Дата;
		ДвижениеЗаказНаМаршрут.Организация = Организация;
		ДвижениеЗаказНаМаршрут.Регистратор = Ссылка;
		ДвижениеЗаказНаМаршрут.ДокументСборкиНоменклатуры = Ссылка ;
		ДвижениеЗаказНаМаршрут.Количество = 1;
		
		ЗапросЗакрытияСборки = Новый Запрос;
		ЗапросЗакрытияСборки.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗаказовПокупателяЗаказано.Заказ,
		|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
		|	СборкаЗаказовПокупателяЗаказано.Количество
		|ПОМЕСТИТЬ НаПодбор
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|ГДЕ
		|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
		|{УПОРЯДОЧИТЬ ПО
		|	СборкаЗаказовПокупателяЗаказано.Ссылка.МоментВремени}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Цена
		|ПОМЕСТИТЬ ЦеныНоменклатуры
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	(ЗаказПокупателяТовары.Ссылка, ЗаказПокупателяТовары.Номенклатура) В
		|			(ВЫБРАТЬ
		|				НаПодбор.Заказ,
		|				НаПодбор.Номенклатура
		|			ИЗ
		|				НаПодбор КАК НаПодбор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НаПодбор.Заказ,
		|	НаПодбор.Номенклатура,
		|	НаПодбор.Количество,
		|	СУММА(НаПодборДоп.Количество) КАК ИтогНакопительный
		|ПОМЕСТИТЬ ПорядокОтгрузки
		|ИЗ
		|	НаПодбор КАК НаПодбор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаПодбор КАК НаПодборДоп
		|		ПО НаПодбор.Номенклатура = НаПодборДоп.Номенклатура
		|			И НаПодбор.Заказ.МоментВремени >= НаПодборДоп.Заказ.МоментВремени
		|
		|СГРУППИРОВАТЬ ПО
		|	НаПодбор.Заказ,
		|	НаПодбор.Номенклатура,
		|	НаПодбор.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПорядокОтгрузки.Заказ,
		|	ПорядокОтгрузки.Номенклатура,
		|	ВЫБОР
		|		КОГДА СборкаЗаказовПокупателяСобрано.Факт >= ПорядокОтгрузки.ИтогНакопительный
		|			ТОГДА ПорядокОтгрузки.Количество
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ПорядокОтгрузки.ИтогНакопительный - ПорядокОтгрузки.Количество - СборкаЗаказовПокупателяСобрано.Факт < 0
		|					ТОГДА (ПорядокОтгрузки.ИтогНакопительный - ПорядокОтгрузки.Количество - СборкаЗаказовПокупателяСобрано.Факт) * -1
		|				ИНАЧЕ 0
		|			КОНЕЦ
		|	КОНЕЦ КАК Собрано
		|ПОМЕСТИТЬ ТаблицаКСписанию
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Собрано КАК СборкаЗаказовПокупателяСобрано
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокОтгрузки КАК ПорядокОтгрузки
		|		ПО СборкаЗаказовПокупателяСобрано.Номенклатура = ПорядокОтгрузки.Номенклатура
		|ГДЕ
		|	СборкаЗаказовПокупателяСобрано.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКСписанию.Заказ КАК ЗаказПокупателя,
		|	ТаблицаКСписанию.Заказ.Контрагент КАК Контрагент,
		|	ТаблицаКСписанию.Номенклатура КАК Номенклатура,
		|	СУММА(ТаблицаКСписанию.Собрано) КАК Собрано,
		|	СУММА(ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) * ТаблицаКСписанию.Собрано) КАК Сумма
		|ИЗ
		|	ТаблицаКСписанию КАК ТаблицаКСписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаКСписанию.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И ТаблицаКСписанию.Заказ = ЦеныНоменклатуры.ЗаказПокупателя
		|ГДЕ
		|	ТаблицаКСписанию.Собрано > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаКСписанию.Заказ,
		|	ТаблицаКСписанию.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаКСписанию.Заказ.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.пустаяссылка)
		|			ТОГДА ТаблицаКСписанию.Заказ.Контрагент
		|		ИНАЧЕ ТаблицаКСписанию.Заказ.Грузополучатель
		|	КОНЕЦ";
		
		ЗапросЗакрытияСборки.УстановитьПараметр("Ссылка", Ссылка);
		РезультатЗапросаЗакрытия = ЗапросЗакрытияСборки.Выполнить();
		
		Если Не РезультатЗапросаЗакрытия.Пустой() Тогда
			
			ВыборкаЗапросаЗакрытия = РезультатЗапросаЗакрытия.Выбрать();
			
			Пока ВыборкаЗапросаЗакрытия.Следующий() Цикл
				
				Движение = Движения.ТоварыГотовыеКСборке.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
				Движение.Номенклатура = ВыборкаЗапросаЗакрытия.Номенклатура;
				Движение.ЗаказПокупателя = ВыборкаЗапросаЗакрытия.ЗаказПокупателя;
				Движение.Количество = ВыборкаЗапросаЗакрытия.Собрано;
				Движение.Назначение = Ссылка.Назначение;
				//
				// Сразу движение по оборотному регистру "СобраноПоЗаказу"
				ДвижениеСобрано = Движения.СобраноПоЗаказу.Добавить();
				ДвижениеСобрано.Период = Дата;
				ДвижениеСобрано.Регистратор = Ссылка;
				ДвижениеСобрано.Заказ =  ВыборкаЗапросаЗакрытия.ЗаказПокупателя;
				ДвижениеСобрано.Номенклатура =  ВыборкаЗапросаЗакрытия.Номенклатура;
				ДвижениеСобрано.Количество =  ВыборкаЗапросаЗакрытия.Собрано;   
				
				Если Дата >= ДатаНачалаИспользованияДокументаКорректировкаСборки Или ОтразитьПоРегиструТоварыВСборке Тогда 
					
					ДвижениеТоварыВСборке 					= Движения.ТоварыВСборке.Добавить();
					ДвижениеТоварыВСборке.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					ДвижениеТоварыВСборке.Период 			= Дата;
					ДвижениеТоварыВСборке.Регистратор 		= Ссылка;
					ДвижениеТоварыВСборке.Сборка 			= Ссылка;
					ДвижениеТоварыВСборке.Контрагент 		= ВыборкаЗапросаЗакрытия.Контрагент;
					ДвижениеТоварыВСборке.ЗаказПокупателя 	= ВыборкаЗапросаЗакрытия.ЗаказПокупателя;
					ДвижениеТоварыВСборке.Номенклатура 		= ВыборкаЗапросаЗакрытия.Номенклатура;
					ДвижениеТоварыВСборке.Собрано 			= ВыборкаЗапросаЗакрытия.Собрано;
					ДвижениеТоварыВСборке.СуммаСобрано		= ВыборкаЗапросаЗакрытия.Сумма; 
					ДвижениеТоварыВСборке.Назначение 		= Ссылка.Назначение;
					
				КонецЕсли;
				
			КонецЦикла;		
			
		КонецЕсли; 
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Заказ КАК Заказ,
		|	ТЗ.Количество КАК Количество
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура,
		|	ТЗ.Заказ,
		|	СУММА(ТЗ.Количество) КАК Количество
		|ПОМЕСТИТЬ ТЗСвернутая
		|ИЗ
		|	ТЗ КАК ТЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ.Номенклатура,
		|	ТЗ.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	МАКСИМУМ(ЗаказПокупателяТовары.Цена) КАК Цена
		|ПОМЕСТИТЬ Цены
		|ИЗ
		|	ТЗСвернутая КАК ТЗСвернутая
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ПО ТЗСвернутая.Заказ = ЗаказПокупателяТовары.Ссылка
		|			И ТЗСвернутая.Номенклатура = ЗаказПокупателяТовары.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыГотовыеКСборкеОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстатки.КоличествоОстаток, 0) - ТЗСвернутая.Количество КАК КоличествоОстаток,
		|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстатки.КоличествоОстаток, 0) КАК Осталось,
		|	ТЗСвернутая.Количество КАК Требуется,
		|	ЕСТЬNULL(Цены.Цена, 0) * ТЗСвернутая.Количество КАК Сумма
		|ПОМЕСТИТЬ ТабРезультата
		|ИЗ
		|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
		|			&Д,
		|			(ЗаказПокупателя, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТЗСвернутая.Заказ,
		|					ТЗСвернутая.Номенклатура
		|				ИЗ
		|					ТЗСвернутая КАК ТЗСвернутая)) КАК ТоварыГотовыеКСборкеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗСвернутая КАК ТЗСвернутая
		|		ПО ТоварыГотовыеКСборкеОстатки.Номенклатура = ТЗСвернутая.Номенклатура
		|			И ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя = ТЗСвернутая.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
		|		ПО ТоварыГотовыеКСборкеОстатки.Номенклатура = Цены.Номенклатура
		|			И ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя = Цены.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабРезультата.Номенклатура,
		|	ТабРезультата.ЗаказПокупателя,
		|	ТабРезультата.КоличествоОстаток,
		|	ТабРезультата.Осталось,
		|	ТабРезультата.Требуется
		|ИЗ
		|	ТабРезультата КАК ТабРезультата
		|ГДЕ
		|	ТабРезультата.КоличествоОстаток < 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабРезультата.Номенклатура,
		|	ТабРезультата.ЗаказПокупателя,
		|	ТабРезультата.КоличествоОстаток,
		|	ТабРезультата.Осталось,
		|	ТабРезультата.Требуется,
		|	ТабРезультата.Сумма
		|ИЗ
		|	ТабРезультата КАК ТабРезультата";
		
		Запрос.УстановитьПараметр("Д", МоментВремени());
		ТЗ = Заказано.Выгрузить(,"Номенклатура, Заказ, Количество");
		Запрос.УстановитьПараметр("ТЗ", ТЗ);  
		
		Пакет = Запрос.ВыполнитьПакет();
		
		ТабОшибок = Пакет[4].Выгрузить();
		ТабКПроведению = Пакет[5].Выгрузить();
		
		Если ТабОшибок.Количество() >0 Тогда 
			
			Отказ = Истина;
			
			Для Каждого ТекСтр Из ТабОшибок Цикл
				Сообщить("Номенклатуры : " + ТекСтр.Номенклатура + " по заказу: " + ТекСтр.ЗаказПокупателя 
				+ " недостаточно по регистру Товары готовые к сборке! Доступно только" + Текстр.Осталось + ", требуется " + ТекСтр.Требуется);
			КонецЦикла;
			
		КонецЕсли;	  
		
		Если Не Отказ Тогда 
			
			ТаблицаПовторений = Новый ТаблицаЗначений;
			ТаблицаПовторений.Колонки.Добавить("Номенклатура");
			ТаблицаПовторений.Колонки.Добавить("ЗаказПокупателя");
			
			Для Каждого ТекСтр Из ТабКПроведению Цикл
				
				СтруктураОтбора = Новый Структура("Номенклатура,ЗаказПокупателя", ТекСтр.Номенклатура, ТекСтр.ЗаказПокупателя);
				МассивСтрок =  ТаблицаПовторений.НайтиСтроки(СтруктураОтбора);
				
				Если МассивСтрок.Количество() > 0 Тогда 
					Продолжить;
				КонецЕсли;
				
				НС = ТаблицаПовторений.Добавить();
				НС.Номенклатура = ТекСтр.Номенклатура;
				НС.ЗаказПокупателя = ТекСтр.ЗаказПокупателя;
				
				//ТоварыГотовыеКСборке
				Движение = Движения.ТоварыГотовыеКСборке.Добавить();
				Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
				Движение.Период 		= Дата;
				Движение.Регистратор 	= Ссылка;
				Движение.Номенклатура 	= ТекСтр.Номенклатура;
				Движение.ЗаказПокупателя = ТекСтр.ЗаказПокупателя;
				Движение.Количество = ТекСтр.Требуется; 
				Движение.Назначение = Ссылка.Назначение;
				
				// СобраноПоЗаказу
				ДвижениеСобрано = Движения.СобраноПоЗаказу.Добавить();
				ДвижениеСобрано.Период 			= Дата;
				ДвижениеСобрано.Регистратор 	= Ссылка;
				ДвижениеСобрано.Заказ 			= ТекСтр.ЗаказПокупателя;
				ДвижениеСобрано.Номенклатура 	= ТекСтр.Номенклатура;
				ДвижениеСобрано.Количество 		= ТекСтр.Требуется;
				
				// ТоварыВСборке
				ДвижениеТоварыВСборке 					= Движения.ТоварыВСборке.Добавить();
				ДвижениеТоварыВСборке.ВидДвижения 		= ВидДвиженияНакопления.Приход;
				ДвижениеТоварыВСборке.Период 			= Дата;
				ДвижениеТоварыВСборке.Регистратор 		= Ссылка;
				ДвижениеТоварыВСборке.Сборка 			= Ссылка;
				ДвижениеТоварыВСборке.Контрагент 		= Ссылка.Контрагент;
				ДвижениеТоварыВСборке.ЗаказПокупателя 	= ТекСтр.ЗаказПокупателя;
				ДвижениеТоварыВСборке.Номенклатура 		= ТекСтр.Номенклатура;
				ДвижениеТоварыВСборке.КСборке			= ТекСтр.Требуется;
				ДвижениеТоварыВСборке.СуммаКСборке		= ТекСтр.Сумма; 
				ДвижениеТоварыВСборке.Назначение 		= Ссылка.Назначение;
				
			КонецЦикла; 
			
		КонецЕсли;	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуДляПроведения(Отказ) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	|	СборкаЗаказовПокупателяЗаказано.Заказ.СкладГруппа КАК Склад,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка,
	|	СУММА(СборкаЗаказовПокупателяЗаказано.Количество) КАК Количество,
	|	СборкаЗаказовПокупателяЗаказано.ГМ
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	|	СборкаЗаказовПокупателяЗаказано.Заказ.СкладГруппа,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка,
	|	СборкаЗаказовПокупателяЗаказано.ГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗаказГруппа.Заказ,
	|	ТабЗаказГруппа.Номенклатура,
	|	ТабЗаказГруппа.Количество,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЗаказПокупателяТовары.Цена, 0) * ТабЗаказГруппа.Количество КАК Сумма
	|ПОМЕСТИТЬ ТабЗаказы
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таб.Заказ КАК Заказ,
	|		Таб.Номенклатура КАК Номенклатура,
	|		СУММА(Таб.Количество) КАК Количество
	|	ИЗ
	|		Таб КАК Таб
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Таб.Заказ,
	|		Таб.Номенклатура) КАК ТабЗаказГруппа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ТабЗаказГруппа.Заказ = ЗаказПокупателяТовары.Ссылка
	|			И ТабЗаказГруппа.Номенклатура = ЗаказПокупателяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Номенклатура,
	|	Таб.Склад,
	|	Таб.Ячейка,
	|	СУММА(Таб.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабЯчейки
	|ИЗ
	|	Таб КАК Таб
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Склад,
	|	Таб.Ячейка,
	|	Таб.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗаказы.Заказ,
	|	ТабЗаказы.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК КоличествоПоОстаткам,
	|	ТабЗаказы.Количество КАК КоличествоПоДокументу
	|ПОМЕСТИТЬ ОстаткиПоЗаказам
	|ИЗ
	|	ТабЗаказы КАК ТабЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
	|				&Д,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТабЗаказы.Заказ,
	|						ТабЗаказы.Номенклатура
	|					ИЗ
	|						ТабЗаказы КАК ТабЗаказы)) КАК ЗаказыПокупателейОстатки
	|		ПО ТабЗаказы.Заказ = ЗаказыПокупателейОстатки.ЗаказПокупателя
	|			И ТабЗаказы.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЯчейки.Номенклатура,
	|	ТабЯчейки.Ячейка КАК Ячейка,
	|	ТабЯчейки.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)
	|	КОНЕЦ КАК КоличествоОстаток,
	|	ТабЯчейки.Количество КАК КоличествоПоДокументу
	|ПОМЕСТИТЬ ОстаткаПоЯчейкам
	|ИЗ
	|	ТабЯчейки КАК ТабЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				&Д,
	|				(Номенклатура, Склад, Ячейка) В
	|					(ВЫБРАТЬ
	|						ТабЯчейки.Номенклатура,
	|						ТабЯчейки.Склад,
	|						ТабЯчейки.Ячейка
	|					ИЗ
	|						ТабЯчейки КАК ТабЯчейки)) КАК ТоварыВЯчейкахОстатки
	|		ПО ТабЯчейки.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|			И ТабЯчейки.Склад = ТоварыВЯчейкахОстатки.Склад
	|			И ТабЯчейки.Ячейка = ТоварыВЯчейкахОстатки.Ячейка
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыВСборке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -1 * ТоварыВСборке.КСборке
	|			ИНАЧЕ ТоварыВСборке.КСборке
	|		КОНЕЦ) КАК КСборке,
	|	СУММА(ВЫБОР
	|			КОГДА ТоварыВСборке.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -1 * ТоварыВСборке.СуммаКСборке
	|			ИНАЧЕ ТоварыВСборке.СуммаКСборке
	|		КОНЕЦ) КАК СуммаКСборке,
	|	ТоварыВСборке.НомерСтроки
	|ПОМЕСТИТЬ ВСборке
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборке
	|ГДЕ
	|	ТоварыВСборке.Активность
	|	И ТоварыВСборке.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
	|	И ТоварыВСборке.Сборка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборке.ЗаказПокупателя,
	|	ТоварыВСборке.Номенклатура,
	|	ТоварыВСборке.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоЗаказам.Заказ,
	|	ОстаткиПоЗаказам.Номенклатура,
	|	ОстаткиПоЗаказам.КоличествоПоОстаткам - ОстаткиПоЗаказам.КоличествоПоДокументу КАК Разница,
	|	ОстаткиПоЗаказам.КоличествоПоОстаткам,
	|	ОстаткиПоЗаказам.КоличествоПоДокументу
	|ИЗ
	|	ОстаткиПоЗаказам КАК ОстаткиПоЗаказам
	|ГДЕ
	|	ОстаткиПоЗаказам.КоличествоПоОстаткам - ОстаткиПоЗаказам.КоличествоПоДокументу < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткаПоЯчейкам.Склад,
	|	ОстаткаПоЯчейкам.Номенклатура,
	|	ОстаткаПоЯчейкам.Ячейка,
	|	ОстаткаПоЯчейкам.КоличествоОстаток - ОстаткаПоЯчейкам.КоличествоПоДокументу КАК Разница,
	|	ОстаткаПоЯчейкам.КоличествоОстаток,
	|	ОстаткаПоЯчейкам.КоличествоПоДокументу
	|ИЗ
	|	ОстаткаПоЯчейкам КАК ОстаткаПоЯчейкам
	|ГДЕ
	|	ОстаткаПоЯчейкам.КоличествоОстаток - ОстаткаПоЯчейкам.КоличествоПоДокументу < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗаказы.Количество КАК Количество,
	|	ТабЗаказы.Цена,
	|	ТабЗаказы.Сумма КАК Сумма,
	|	ЕСТЬNULL(ВСборке.КСборке, 0) КАК КСборке,
	|	ЕСТЬNULL(ВСборке.СуммаКСборке, 0) КАК СуммаКСборке,
	|	ВСборке.НомерСтроки,
	|	ТабЗаказы.Заказ,
	|	ТабЗаказы.Номенклатура
	|ИЗ
	|	ТабЗаказы КАК ТабЗаказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВСборке КАК ВСборке
	|		ПО ТабЗаказы.Заказ = ВСборке.ЗаказПокупателя
	|			И ТабЗаказы.Номенклатура = ВСборке.Номенклатура"; 
	
	Запрос.УстановитьПараметр("Д", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗОшибкаВДокументеБольшеЗаказа = Пакет[6].Выгрузить();
	ТЗОшибкаВДокументеБольшеЧемВЯчейках = Пакет[7].Выгрузить();
	ТЗТовары = Пакет[8].Выгрузить();
	
	Для Каждого Стр Из ТЗОшибкаВДокументеБольшеЗаказа Цикл
		
		Отказ = Истина;
		Сообщить("Номенклатуры : " + Стр.Номенклатура + " отправляется клиенту больше чем заказано документом " + Стр.Заказ 
		+ "! Оотправляется " + Стр.КоличествоПоДокументу +
		", заказано : " + Стр.КоличествоПоОстаткам + ". Документ проводится не будет!", СтатусСообщения.ОченьВажное);
		
	КонецЦикла;
	
	Для Каждого Стр Из ТЗОшибкаВДокументеБольшеЧемВЯчейках Цикл
		
		Отказ = Истина;
		Сообщить("Номенклатуры : " + Стр.Номенклатура + " на складе " + Стр.Склад + " недостаточно в ячейке" + Стр.Ячейка
		+ "! Отправляется " + Стр.КоличествоПоДокументу +
		", требуется " + Стр.КоличествоПоДокументу + ", а в остатке " + Стр.КоличествоОстаток + ". Документ проводится не будет!",
		СтатусСообщения.ОченьВажное);
		
	КонецЦикла;
	
	Возврат ТЗТовары;
	
КонецФункции

Процедура ПроверитьТоварыГотовыеКСборке(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Заказ,
	|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	|	СборкаЗаказовПокупателяЗаказано.Количество
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Заказ,
	|	Таб.Номенклатура,
	|	СУММА(Таб.Количество) КАК Количество
	|ПОМЕСТИТЬ ТабГруппировка
	|ИЗ
	|	Таб КАК Таб
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Заказ,
	|	Таб.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабГруппировка.Заказ,
	|	ТабГруппировка.Номенклатура,
	|	ТабГруппировка.Количество КАК КоличествоТребуется,
	|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстатки.КоличествоОстаток, 0) КАК КоличествоВозможно
	|ИЗ
	|	ТабГруппировка КАК ТабГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
	|				&Д,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТабГруппировка.Заказ,
	|						ТабГруппировка.Номенклатура
	|					ИЗ
	|						ТабГруппировка КАК ТабГруппировка)) КАК ТоварыГотовыеКСборкеОстатки
	|		ПО ТабГруппировка.Заказ = ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя
	|			И ТабГруппировка.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТоварыГотовыеКСборкеОстатки.КоличествоОстаток, 0) - ТабГруппировка.Количество < 0"; 
	
	Запрос.УстановитьПараметр("Д", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТЗОшибкаВДокументеБольшеЧемВозможно = Пакет[2].Выгрузить();
	
	Для каждого Стр Из ТЗОшибкаВДокументеБольшеЧемВозможно Цикл
		
		Отказ = Истина;
		Сообщить("Нет готовой к сборке номенклатуры : " + Стр.Номенклатура + " по заказу " + Стр.Заказ + "! Требуется " + Стр.КоличествоТребуется +
		", возможно собрать : " + Стр.КоличествоВозможно + ". Документ проводится не будет!", СтатусСообщения.ОченьВажное);
		
	КонецЦикла;
	
	
	
	
КонецПроцедуры

Процедура ДвиженияСборкаСУчетомЭтажей(Отказ) 
	
	ДатаНачалаПроведенияПоНовомуАлгоритму = Константы.ДатаНачалаПроведенияКСборкеПоНовомуАлгоритму.Получить();
	ДатаНачалаИспользованияДокументаКорректировкаСборки = Константы.ДатаНачалаИспользованияДокументаКорректировкаСборки.Получить(); 
	
	Движения.ТоварыГотовыеКСборке.Записывать 				= Истина;
	Движения.НоменклатураГотоваяЕхатьККлиенту.Записывать 	= НЕ ПолностьюОткорректирована;
	Движения.СобраноПоЗаказу.Записывать 					= Истина;
	Движения.ТоварыВЯчейках.Записывать 						= Истина;
	Движения.ТоварыВСборке.Записывать 						= Истина;
	Движения.ДвижениеКодовМаркировкиСУЗ.Записывать 			= Истина;
	
	ТЗТовары = ПолучитьТаблицуДляПроведения(Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ПроверитьТоварыГотовыеКСборке(Отказ);
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрЗаказано Из Заказано Цикл
		
		Движение = Движения.ТоварыВЯчейках.Добавить();
		Движение.Период 		= Дата;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Номенклатура 	= СтрЗаказано.Номенклатура;
		Движение.Склад 			= СтрЗаказано.Заказ.СкладГруппа;
		Движение.Ячейка 		= СтрЗаказано.Ячейка ;
		Движение.Количество 	= СтрЗаказано.Количество; 
		Движение.ГМ 			= СтрЗаказано.ГМ;
		
	КонецЦикла; 
	
	Если ДокументСобранИУпакован Тогда
		
		Движение 					= Движения.НоменклатураГотоваяЕхатьККлиенту.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Организация 		= Организация;
		Движение.Регистратор 		= Ссылка;
		Движение.ДокументСборкиНоменклатуры = Ссылка;
		Движение.Количество 		= 1; 
		
	КонецЕсли;
	
	ОтразитьТоварыВСборке = Дата >= ДатаНачалаИспользованияДокументаКорректировкаСборки Или ОтразитьПоРегиструТоварыВСборке;
	
	ТаблицаПовторений = Новый ТаблицаЗначений;
	ТаблицаПовторений.Колонки.Добавить("Номенклатура");
	ТаблицаПовторений.Колонки.Добавить("ЗаказПокупателя");
	
	Для Каждого Стр Из ТЗТовары Цикл
		
		СтруктураОтбора = Новый Структура("Номенклатура, ЗаказПокупателя", Стр.Номенклатура, Стр.Заказ);
		МассивСтрок =  ТаблицаПовторений.НайтиСтроки(СтруктураОтбора);
		
		Если МассивСтрок.Количество() > 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НС = ТаблицаПовторений.Добавить();
		НС.Номенклатура =    Стр.Номенклатура;
		НС.ЗаказПокупателя = Стр.Заказ;
		
		// ТоварыГотовыеКСборке
		Движение 					= Движения.ТоварыГотовыеКСборке.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Регистратор 		= Ссылка;
		Движение.Номенклатура 		= Стр.Номенклатура;
		Движение.ЗаказПокупателя 	= Стр.Заказ;
		Движение.Количество 		= Стр.Количество;  
		Движение.Назначение 		= Ссылка.Назначение;
		
		//СобраноПоЗаказу
		ДвижениеСобрано 				= Движения.СобраноПоЗаказу.Добавить();
		ДвижениеСобрано.Период 			= Дата;
		ДвижениеСобрано.Регистратор 	= Ссылка;
		ДвижениеСобрано.Заказ 			= Стр.Заказ;
		ДвижениеСобрано.Номенклатура 	= Стр.Номенклатура;
		ДвижениеСобрано.Количество 		= Стр.Количество;		
		
		//ТоварыВСборке
		Если ОтразитьТоварыВСборке Тогда 
			
			ДвижениеТоварыВСборке 					= Движения.ТоварыВСборке.Добавить();
			ДвижениеТоварыВСборке.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			ДвижениеТоварыВСборке.Период 			= Дата;
			ДвижениеТоварыВСборке.Регистратор 		= Ссылка;
			ДвижениеТоварыВСборке.Сборка 			= Ссылка;
			ДвижениеТоварыВСборке.Контрагент 		= Стр.Заказ.Контрагент;
			ДвижениеТоварыВСборке.ЗаказПокупателя 	= Стр.Заказ;
			ДвижениеТоварыВСборке.Номенклатура 		= Стр.Номенклатура;
			ДвижениеТоварыВСборке.Назначение 		= Ссылка.Назначение;
			
			Если ДокументСобранИУпакован Тогда
				
				ДвижениеТоварыВСборке.Собрано 		= Стр.Количество;
				ДвижениеТоварыВСборке.СуммаСобрано	= Стр.Сумма;
				
				Если ЗначениеЗаполнено(ДатаНачалаПроведенияПоНовомуАлгоритму) 
					И Дата > ДатаНачалаПроведенияПоНовомуАлгоритму 
					И (Стр.КСборке <> 0 ИЛИ Стр.СуммаКСборке <> 0) Тогда 
					
					// делаем корректирующие движения с учетом введенных корректировок сборки
					ДвижениеТоварыВСборке 					= Движения.ТоварыВСборке.Добавить();
					ДвижениеТоварыВСборке.ВидДвижения 		= ВидДвиженияНакопления.Расход;
					ДвижениеТоварыВСборке.Период 			= Дата;
					ДвижениеТоварыВСборке.Регистратор 		= Ссылка;
					ДвижениеТоварыВСборке.Сборка 			= Ссылка;
					ДвижениеТоварыВСборке.Контрагент 		= Стр.Заказ.Контрагент;
					ДвижениеТоварыВСборке.ЗаказПокупателя 	= Стр.Заказ;
					ДвижениеТоварыВСборке.Номенклатура 		= Стр.Номенклатура;  
					ДвижениеТоварыВСборке.Назначение 		= Ссылка.Назначение;  
					
					ДвижениеТоварыВСборке.Собрано 			= -Стр.КСборке;
					ДвижениеТоварыВСборке.СуммаСобрано		= -Стр.СуммаКСборке;
					ДвижениеТоварыВСборке.КСборке			= Стр.КСборке;
					ДвижениеТоварыВСборке.СуммаКСборке		= Стр.СуммаКСборке;
					
				КонецЕсли;
				
			Иначе
				
				ДвижениеТоварыВСборке.КСборке 			= Стр.Количество;
				ДвижениеТоварыВСборке.СуммаКСборке		= Стр.Сумма;
				
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЦикла;			
	
	Если ТЗТовары.Количество() > 0 Тогда
		
		тзДвижениеКМ = ПолучитьТаблицуДвиженияКМ();  
		Движения.ДвижениеКодовМаркировкиСУЗ.Загрузить(тзДвижениеКМ);
		
	КонецЕсли;  
	
КонецПроцедуры

Функция ПолучитьТаблицуДвиженияКМ()    
	
	// Если КодМаркировки создан в этой сборке, то надо двигать ресурс Количество
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СборкаЗаказовКодыМаркировки.КодМаркировки,
		|	СборкаЗаказовКодыМаркировки.КодМаркировки.ТипПоступления КАК ТипПоступления
		|ПОМЕСТИТЬ ВТ_Коды
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.КодыМаркировки КАК СборкаЗаказовКодыМаркировки
		|ГДЕ
		|	СборкаЗаказовКодыМаркировки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвижениеКодовМаркировкиСУЗОбороты.ШтрихкодНоменклатуры,
		|	ДвижениеКодовМаркировкиСУЗОбороты.КоличествоПриход
		|ПОМЕСТИТЬ ВТ_СтарыеКоды
		|ИЗ
		|	РегистрНакопления.ДвижениеКодовМаркировкиСУЗ.Обороты(
		|			,
		|			&ГраницаНач,
		|			,
		|			ШтрихкодНоменклатуры В
		|				(ВЫБРАТЬ
		|					ВТ_Коды.КодМаркировки
		|				ИЗ
		|					ВТ_Коды КАК ВТ_Коды
		|				ГДЕ
		|					ВТ_Коды.ТипПоступления = 3)) КАК ДвижениеКодовМаркировкиСУЗОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Ссылка КАК Склад,
		|	ВТ_Коды.КодМаркировки КАК ШтрихкодНоменклатуры,
		|	ВЫБОР
		|		КОГДА &ДокументСобран
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Собрано,
		|	ВЫБОР
		|		КОГДА &ДокументСобран
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КСборке,
		|	ВЫБОР
		|		КОГДА ВТ_СтарыеКоды.ШтрихкодНоменклатуры ЕСТЬ NULL И ВТ_Коды.ТипПоступления = 3
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Количество,
		|	&Ссылка КАК Основание
		|ИЗ
		|	ВТ_Коды КАК ВТ_Коды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтарыеКоды КАК ВТ_СтарыеКоды
		|		ПО ВТ_Коды.КодМаркировки = ВТ_СтарыеКоды.ШтрихкодНоменклатуры";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДокументСобран", ДокументСобранИУпакован);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ГраницаНач", Новый Граница(Дата, ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();    
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции // ()

Функция НайтиЦенуИзДокумента(Заказ , Номенклатура)
	
	Для Каждого ТекСтр Из Заказ.Товары Цикл
		
		Если ТекСтр.Номенклатура = Номенклатура Тогда
			Возврат ТекСтр.Цена;    
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат 0;  
	
КонецФункции

Функция НайтиСуммуИзДокумента(Заказ, Номенклатура)
	
	Сумма = 0;
	
	Для каждого ТекСтр Из Заказ.Товары Цикл
		
		Если ТекСтр.Номенклатура = Номенклатура Тогда
			Сумма = Сумма + ТекСтр.Сумма; 
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Сумма; 
	
КонецФункции

Функция ПолучитьФактическоеКоличество(Номенклатура , Количество)
	
	Строка = Собрано.Найти(Номенклатура,"Номенклатура");
	Возврат Мин(Количество, Строка.Факт); 
	
КонецФункции

Процедура ЗаявкаДляВодителя(Водитель) Экспорт
	
	Макет = ПолучитьМакет("ЗаявкаДляВодителей");
	ТабДок  = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ДатаЗаявки = Формат(ТекущаяДата(), "ДЛФ=D");
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Водитель");
	ОбластьМакета.Параметры.Водитель = Водитель;
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОбластьМакета.Параметры.Сч = 1;
	ОбластьМакета.Параметры.ДокументПогрузки = Ссылка;
	ОбластьМакета.Параметры.ТранспортнаяКомпания = Контрагент.ОсновнаяТранспортнаяКомпания;
	ОбластьМакета.Параметры.Клиент = Контрагент;
	ОбластьМакета.Параметры.Кол = КоличествоУпаковочныхМест;
	
	ТабДок.Вывести(ОбластьМакета);
	
	ТабДок.Защита = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

Процедура ПечатнаяФорма() Экспорт   
	
	НомерЯчейки =  "";   
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказыВЯчейкахОстатки.Ячейка
	|ИЗ
	|	РегистрНакопления.ЗаказыВЯчейках.Остатки(&Д, Контрагент = &Контрагент) КАК ЗаказыВЯчейкахОстатки
	|ГДЕ
	|	ЗаказыВЯчейкахОстатки.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Д", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НомерЯчейки = Выборка.Ячейка ;
	КонецЦикла;
	
	Макет = ПолучитьМакет("Требование");
	ТабДок  = Новый ТабличныйДокумент;   
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Получатель = Контрагент;
	ОбластьМакета.Параметры.Номер = Номер;
	ОбластьМакета.Параметры.Дата = Формат(Дата,"ДЛФ=D");
	ТабДок.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СборкаЗаказовПокупателяСобрано.Номенклатура,
	|	СборкаЗаказовПокупателяСобрано.Количество КАК Количество
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Собрано КАК СборкаЗаказовПокупателяСобрано
	|ГДЕ
	|	СборкаЗаказовПокупателяСобрано.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета.Параметры.Ячейка  = НомерЯчейки;
		ОбластьМакета.Параметры.ЕдИзм  = Выборка.Номенклатура.ЕдиницаХраненияОстатков;	
		ОбластьМакета.Параметры.Номенклатура  = Выборка.Номенклатура;	
		ОбластьМакета.Параметры.Количество  = Выборка.Количество;	
		ОбластьМакета.Параметры.Производитель  = Выборка.Номенклатура.бит_Производитель;	          
		ОбластьМакета.Параметры.НомерПроизводителя  = Выборка.Номенклатура.бит_НомерПроизводителя;	
		ТабДок.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.ДатаПечати  = Дата;
	ТабДок.Вывести(ОбластьМакета);  
	
	ТабДок.Защита = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Показать();
	
КонецПроцедуры

Процедура Стикеры()   Экспорт     
	
	Макет = ПолучитьМакет("Стикеры");
	ТабДок  = Новый ТабличныйДокумент;      
	
	Для х = 1 по КоличествоУпаковочныхМест Цикл 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Контрагент = Контрагент;
		ОбластьМакета.Параметры.НомерЗаказа = Номер;
		ОбластьМакета.Параметры.ДатаЗаказа = Формат(Дата, "ДЛФ=D");
		ОбластьМакета.Параметры.ВсегоМест = КоличествоУпаковочныхМест;
		ОбластьМакета.Параметры.Сч = х;
		ТабДок.Вывести(ОбластьМакета);
		
	КонецЦикла;  
	
	ТабДок.Защита = Истина;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.Показать();
	
КонецПроцедуры

Функция ПолучитьСклады()
	
	ФильтрПоСкладам = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Заказ.СкладГруппа КАК Склад
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ФильтрПоСкладам.Добавить(Выборка.Склад);
	КонецЦикла;
	
	Возврат ФильтрПоСкладам;

КонецФункции

Процедура Печать() Экспорт 
	
	ВыполнитьПечатьНоменклатурыПоЯчейкам(Истина);	
	
КонецПроцедуры

Процедура ВыполнитьПечатьНоменклатурыПоЯчейкам(СКорректировкой = Ложь, СразуНаПринтер = Ложь) Экспорт 
	
	Если ЭтоНовый() Тогда
		Записать();
	КонецЕсли;
	
	ПостфиксМакета = ""; 
	
	Если Константы.База.Получить() = Перечисления.НазваниеБазы.Казань ИЛИ Константы.База.Получить() = Перечисления.НазваниеБазы.Самара Тогда    
		ПостфиксМакета = "Новая";         
	КонецЕсли;
	
	СтрокаСПодвалом = Новый Массив;
	
	
	Макет = ПолучитьМакет("Ячейки"+ПостфиксМакета);
	ТабДок  = Новый ТабличныйДокумент;
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номер = Ссылка.Номер;
	ОбластьМакета.Параметры.Дата = Формат(Ссылка.Дата, "ДЛФ=D");
	ОбластьМакета.Параметры.Клиент = Ссылка.Грузополучатель;
	ОбластьМакета.Параметры.СпособДоставки = СпособДоставки;
	
	ПараметрКодКлиента = "";
	
	Если ПостфиксМакета <> "" Тогда  
		
		КодБезНулей = СтрЗаменить(Ссылка.Грузополучатель.Код, "УТ", "00");
		
		Пока Лев(КодБезНулей, 1) = "0" Цикл
			КодБезНулей = Сред(КодБезНулей, 2);
		КонецЦикла;  
		
		ПараметрКодКлиента = КодБезНулей;
		ОбластьМакета.Параметры.КодКлиента = ПараметрКодКлиента; 
		
	КонецЕсли;	
	
	
	ПараметрМаршрут = "";
	
	Если СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда  
		
		Если ЗначениеЗаполнено(Грузополучатель.МаршрутДоставки) Тогда   
			
			ПараметрМаршрут = СокрЛП(Грузополучатель.МаршрутДоставки.Наименование);   
			ОбластьМакета.Параметры.Маршрут = " , " + ПараметрМаршрут; 
			
		КонецЕсли;     
		
	Иначе          
		
		ПараметрМаршрут =  "";
		ОбластьМакета.Параметры.Маршрут = ПараметрМаршрут;
		
	КонецЕсли;
	
	СтрокаСПодвалом.Добавить(ОбластьМакета);
	
	ТабДок.Вывести(ОбластьМакета);
	Запрос = Новый Запрос;
	
	Если НЕ СКорректировкой Тогда  
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель КАК Папа,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстаткиИОбороты.Склад,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОстатокВЯчейке
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(, , Регистратор, , Номенклатура В (&МассивНоменклатуры)) КАК ТоварыВЯчейкахОстаткиИОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор = &Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Код УБЫВ,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя"; 
		
	Иначе       
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаСборкиЗаказовПокупателя.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТекДокументы
		|ИЗ
		|	Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
		|ГДЕ
		|	КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя = &Регистратор
		|	И КорректировкаСборкиЗаказовПокупателя.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СборкаЗаказовПокупателя.Ссылка
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
		|ГДЕ
		|	СборкаЗаказовПокупателя.Ссылка = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель КАК Папа,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстаткиИОбороты.Склад,
		|	СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоРасход) - СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоПриход) КАК КоличествоРасход,
		|	СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток) КАК ОстатокВЯчейке
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					СборкаЗаказовПокупателяЗаказано.Номенклатура
		|				ИЗ
		|					Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|				ГДЕ
		|					СборкаЗаказовПокупателяЗаказано.Ссылка = &Регистратор)) КАК ТоварыВЯчейкахОстаткиИОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				ТекДокументы.Ссылка
		|			ИЗ
		|				ТекДокументы КАК ТекДокументы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка,
		|	ТоварыВЯчейкахОстаткиИОбороты.Склад,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоРасход) - СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоПриход) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Код УБЫВ,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейках.Номенклатура,
		|	ТоварыВЯчейках.Ячейка,
		|	ТоварыВЯчейках.Количество,
		|	ТоварыВЯчейках.ПроблемнаяЯчейка
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
		|ГДЕ
		|	ТоварыВЯчейках.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
		|	И ВЫРАЗИТЬ(ТоварыВЯчейках.Регистратор КАК Документ.КорректировкаСборкиЗаказовПокупателя).СборкаЗаказовПокупателя = &Регистратор
		|	И ТоварыВЯчейках.ВидДвижения = &ВидДвижения
		|	И ТоварыВЯчейках.ПроблемнаяЯчейка <> &ПроблемнаяЯчейка";   
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ПроблемнаяЯчейка", Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	
	
	Пакет = Запрос.ВыполнитьПакет();
	ТЗ_1 =  Пакет[1].Выгрузить();
	ТЗ_2 =  Пакет[2].Выгрузить();
	Сч = 1;
	
	Для Каждого ТекСтр Из   ТЗ_1 Цикл 
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(ТекСтр);
		
		СтруктураОтбора = Новый Структура("Номенклатура,ПроблемнаяЯчейка", ТекСтр.Номенклатура, ТекСтр.Ячейка);
		
		Строка = ТЗ_2.НайтиСтроки(СтруктураОтбора) ;
		
		Если Строка.Количество() > 0 Тогда 
			
			Если Строка[0].Количество >= ТекСтр.КоличествоРасход Тогда  
				Продолжить;     
			Иначе 
				ОбластьМакета.Параметры.КоличествоРасход = ТекСтр.КоличествоРасход - Строка[0].Количество;	
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Сч = Сч;
		ТабДок.Вывести(ОбластьМакета);
		Сч = Сч +1;
		
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		
	КонецЦикла;
	
	Если ПостфиксМакета <> "" Тогда   
		
		Если НЕ ФормированиеПечатныхФорм.ПроверитьВыводТабличногоДокумента(ТабДок, СтрокаСПодвалом) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;  
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал2");
		ОбластьМакета.Параметры.КодКлиента = ПараметрКодКлиента;
		ОбластьМакета.Параметры.Номер = Ссылка.Номер;
		ОбластьМакета.Параметры.Дата = Формат(Ссылка.Дата, "ДЛФ=D");
		ОбластьМакета.Параметры.Клиент = Ссылка.Грузополучатель;
		ОбластьМакета.Параметры.Маршрут = ПараметрМаршрут;
		ОбластьМакета.Параметры.АдресДоставки = МСК.ПолучитьАдресДоставки(Ссылка.Грузополучатель);
		
		ТабДок.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
	
	ТабДок.ФиксацияСверху = 2;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина; 
	
	Если СразуНаПринтер Тогда 
		ТабДок.Напечатать(); 
	Иначе                    
		ТабДок.Показать();   
	КонецЕсли;
	
	Мск.ЗафиксироватьПечатьДокумента(Ссылка, "Ячейки", "Номенклатура по ячейкам с корректировкой");
	
КонецПроцедуры

Процедура ПечатьЯчейки(ШтрихКод , ИмяПринтера, СразуНаПринтер = Ложь, ВернутьТабДок = Неопределено) Экспорт

	Если ЭтоНовый() Тогда
		Записать();
	КонецЕсли; 
	
	ЕстьНазначение = ЗначениеЗаполнено(Назначение);
	ОбъединятьСборкиПриПечати = Константы.ОбъединятьСборкиПриПечати.Получить();   
	
	Если Не ЗначениеЗаполнено(Грузополучатель) Тогда   
		ГрузополучательПечать = Контрагент;        
	Иначе                                           
		ГрузополучательПечать = Грузополучатель;  
	КонецЕсли;
	
	КодМаршрута = 0;
	
	Если Не ЗначениеЗаполнено(ГрузополучательПечать.МаршрутДоставки) ТОгда 
		МаршрутДоставки = "";          
	Иначе                           
		КодМаршрута = ГрузополучательПечать.МаршрутДоставки.Код; 
	КонецЕсли;
	
	Если ОбъединятьСборкиПриПечати И НЕ ВернутьТабДок = Неопределено Тогда 
		
		Макет = ПолучитьМакет("ЯчейкиГУИД_Мини");
		ИмяМакета = "ЯчейкиГУИД_Мини";        
		
	Иначе			            
		
		Макет = ПолучитьМакет("ЯчейкиГУИД"); 		
		ИмяМакета = "ЯчейкиГУИД";   
		
	КонецЕсли; 
	
	ТабДок  = Новый ТабличныйДокумент;
	ОбластьМакета                  = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.КодМаршрута	= ?(СпособДоставки = Перечисления.СпособДоставки.Самовывоз, "", Число(КодМаршрута));
	ОбластьМакета.Параметры.Номер  = Ссылка.Номер;
	ОбластьМакета.Параметры.Дата   = Формат(Ссылка.Дата, "ДЛФ=D"); 
	
	ОбластьМакета.Параметры.Клиент = СокрЛП(Ссылка.Грузополучатель) + ?(ЗначениеЗаполнено(Ссылка.ДоговорПоставщикаТОХ), Символы.ПС 
	                               + "ТОХ " + СокрЛП(Ссылка.ДоговорПоставщикаТОХ.Владелец), "");
	ОбластьМакета.Параметры.ДатаДоставки = Ссылка.ДатаДоставкиКлиенту;
	
	Если СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
		ПечСпособДоставки = ?(ТаксиДоставка, "ТАКСИ ДОСТАВКА", "Самовывоз");	
	Иначе 
		ПечСпособДоставки = СокрЛП(МаршрутДоставки); 
	КонецЕсли; 
	
	ОбластьМакета.Параметры.МаршрутДоставки = ПечСпособДоставки; 
	
	Если ЕстьНазначение Тогда
		ОбластьМакета.Параметры.МаршрутДоставки = "Транзит_" + Строка(ОбластьМакета.Параметры.МаршрутДоставки);	
	КонецЕсли;
	
	ОбластьМакета.Параметры.Код  = СтрЗаменить(Строка(ГрузополучательПечать.Код), Символы.НПП, ""); 
	
	Если ЗначениеЗаполнено(Ссылка.Грузополучатель) И ЗначениеЗаполнено(Ссылка.Грузополучатель.ТипУпаковки) 
		И Ссылка.Грузополучатель.ТипУпаковки <> Справочники.ТипыУпаковокДляКлиентов.НайтиПоНаименованию("Любая (по умолчанию)", Истина) тогда
		ОбластьМакета.Параметры.ВИП = Ссылка.Грузополучатель.ТипУпаковки.Наименование;
	КонецЕсли;
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабДок, Макет, ОбластьМакета, Ссылка);
	
	Если УпаковыватьСамовывоз Тогда  
		ОбластьМакета.Параметры.УпаковыватьСамовывоз = "Упаковывать самовывоз";
	КонецЕсли;
	
	Если ЕстьНазначение Тогда  
		ОбластьМакета.Параметры.УпаковыватьСамовывоз = Строка(ОбластьМакета.Параметры.УпаковыватьСамовывоз) + " Отгрузка ГМ";	
	КонецЕсли;                                                                 
	
	ТабДок.Вывести(ОбластьМакета);
	
	СКорректировкой = Истина;
	
	Запрос = Новый Запрос;
	
	Если НЕ СКорректировкой Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель КАК Папа,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахОстаткиИОбороты.Склад,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток КАК ОстатокВЯчейке
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(, , Регистратор, , Номенклатура В (&МассивНоменклатуры)) КАК ТоварыВЯчейкахОстаткиИОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор = &Регистратор
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка.Код УБЫВ,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.Родитель,
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура.КодПроизводителя"; 
		
	Иначе 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СборкаЗаказовПокупателя.Ссылка
		|ПОМЕСТИТЬ Сборки
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
		|ГДЕ
		|	СборкаЗаказовПокупателя.Ссылка = &Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КорректировкаСборкиЗаказовПокупателя.Ссылка
		|ПОМЕСТИТЬ Корректировки
		|ИЗ
		|	Сборки КАК Сборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаСборкиЗаказовПокупателя КАК КорректировкаСборкиЗаказовПокупателя
		|		ПО Сборки.Ссылка = КорректировкаСборкиЗаказовПокупателя.СборкаЗаказовПокупателя
		|ГДЕ
		|	КорректировкаСборкиЗаказовПокупателя.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сборки.Ссылка КАК Регистратор
		|ПОМЕСТИТЬ СборкиИКорректировки
		|ИЗ
		|	Сборки КАК Сборки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Корректировки.Ссылка
		|ИЗ
		|	Корректировки КАК Корректировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫБОР
		|		КОГДА СборкаЗаказовПокупателяСобрано.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.Пустаяссылка)
		|			ТОГДА СборкаЗаказовПокупателяСобрано.Ссылка.Контрагент
		|		ИНАЧЕ СборкаЗаказовПокупателяСобрано.Ссылка.Грузополучатель
		|	КОНЕЦ КАК Ссылка,
		|	СборкаЗаказовПокупателяСобрано.Номенклатура КАК Номенклатура,
		|	СборкаЗаказовПокупателяСобрано.Количество КАК Количество,
		|	СборкаЗаказовПокупателяСобрано.Ячейка КАК Ячейка,
		|	СборкаЗаказовПокупателяСобрано.Номенклатура.Родитель КАК Родитель,
		|	ВЫРАЗИТЬ(СборкаЗаказовПокупателяСобрано.Номенклатура.Комментарий КАК СТРОКА(50)) КАК Комментарий,
		|	СборкаЗаказовПокупателяСобрано.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков,
		|	СборкаЗаказовПокупателяСобрано.Номенклатура.КодПроизводителя КАК КодПроизводителя
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	Сборки КАК Сборки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяСобрано
		|		ПО Сборки.Ссылка = СборкаЗаказовПокупателяСобрано.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка,
		|	СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоРасход) - СУММА(ТоварыВЯчейкахОстаткиИОбороты.КоличествоПриход) КАК Количество,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.ОстаткиИОбороты(
		|			,
		|			,
		|			Регистратор,
		|			,
		|			Номенклатура В
		|				(ВЫБРАТЬ
		|					ВТ_1.Номенклатура
		|				ИЗ
		|					ВТ_1 КАК ВТ_1)) КАК ТоварыВЯчейкахОстаткиИОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОстаткиИОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				ТекДокументы.Регистратор
		|			ИЗ
		|				СборкиИКорректировки КАК ТекДокументы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОстаткиИОбороты.Номенклатура,
		|	ТоварыВЯчейкахОстаткиИОбороты.Ячейка,
		|	ТоварыВЯчейкахОстаткиИОбороты.КоличествоКонечныйОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Остатки.Номенклатура,
		|	ВТ_Остатки.Ячейка,
		|	СУММА(ВТ_Остатки.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Остатки_Итог
		|ИЗ
		|	ВТ_Остатки КАК ВТ_Остатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Остатки.Номенклатура,
		|	ВТ_Остатки.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Родитель КАК Папа,
		|	ВТ_1.Номенклатура,
		|	ВТ_1.КодПроизводителя,
		|	ВТ_1.Ячейка,
		|	ВТ_Остатки_Итог.Количество,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) КАК ОстатокВЯчейке
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки_Итог КАК ВТ_Остатки_Итог
		|		ПО ВТ_1.Номенклатура = ВТ_Остатки_Итог.Номенклатура
		|			И ВТ_1.Ячейка = ВТ_Остатки_Итог.Ячейка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
		|				,
		|				(Номенклатура, Ячейка) В
		|					(ВЫБРАТЬ
		|						ВТ_1.Номенклатура,
		|						ВТ_1.Ячейка
		|					ИЗ
		|						ВТ_1 КАК ВТ_1)) КАК ТоварыВЯчейкахОстатки
		|		ПО ВТ_1.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|			И ВТ_1.Ячейка = ТоварыВЯчейкахОстатки.Ячейка
		|ГДЕ
		|	ВТ_Остатки_Итог.Количество > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Номенклатура,
		|	ВТ_1.Ячейка,
		|	ВТ_1.Родитель,
		|	ВТ_1.КодПроизводителя,
		|	ВТ_Остатки_Итог.Количество,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)";   
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	ТаблицаДляПечати = Новый ТаблицаЗначений;
	ТаблицаДляПечати.Колонки.Добавить("Номенклатура");
	ТаблицаДляПечати.Колонки.Добавить("Ячейка");
	ТаблицаДляПечати.Колонки.Добавить("Артикул");
	ТаблицаДляПечати.Колонки.Добавить("ОстатокВЯчейке");
	ТаблицаДляПечати.Колонки.Добавить("Кол");
	ТаблицаДляПечати.Колонки.Добавить("Сч");
	ТаблицаДляПечати.Колонки.Добавить("Папа");
	ТаблицаДляПечати.Колонки.Добавить("ЕдИзм");
	ТаблицаДляПечати.Колонки.Добавить("Примечание");
	ТаблицаДляПечати.Колонки.Добавить("Этаж");
	ТаблицаДляПечати.Колонки.Добавить("Секция");
	ТаблицаДляПечати.Колонки.Добавить("Сектор");
	ТаблицаДляПечати.Колонки.Добавить("КодПроизводителя");  
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	РезультатЗапроса.Свернуть("Номенклатура, Ячейка", "Количество,ОстатокВЯчейке");
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекСтр  Из РезультатЗапроса Цикл
		
		НоваяСтрокаДляПечати				  = ТаблицаДляПечати.Добавить();
		НоваяСтрокаДляПечати.Номенклатура	  = ТекСтр.Номенклатура;
		НоваяСтрокаДляПечати.Ячейка			  = ТекСтр.Ячейка;
		НоваяСтрокаДляПечати.Кол			  = ТекСтр.Количество;
		НоваяСтрокаДляПечати.ОстатокВЯчейке	  = ТекСтр.ОстатокВЯчейке;
		НоваяСтрокаДляПечати.Папа			  = ТекСтр.Номенклатура.Родитель;
		НоваяСтрокаДляПечати.Примечание		  = Лев(ТекСтр.Номенклатура.Комментарий, 28);	
		НоваяСтрокаДляПечати.ЕдИзм			  = ТекСтр.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрокаДляПечати.КодПроизводителя = ТекСтр.Номенклатура.КодПроизводителя;
		НоваяСтрокаДляПечати.Этаж			=  ТекСтр.Ячейка.Этаж ; 
		
	КонецЦикла;
	
	ТаблицаДляПечати.Сортировать("Этаж,Ячейка");	
	
	Сч = 1;
	
	Если ТаблицаДляПечати.Количество() = 0 Тогда  
		Возврат;    
	Иначе
		
		Если СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда 
			
			ОбластьМакета = Макет.ПолучитьОбласть("Сортировка_этаж");
			ОбластьМакета.Параметры.Этаж = "Этаж : " + Этаж;
			ТабДок.Вывести(ОбластьМакета);  
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого СтрокаДляПечати ИЗ ТаблицаДляПечати Цикл  
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(СтрокаДляПечати);
		ОбластьМакета.Параметры.Сч = Сч;
		ТабДок.Вывести(ОбластьМакета);
		Сч  = Сч +1;
		
	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 2;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	Если СпособДоставки = Перечисления.СпособДоставки.Самовывоз И НЕ УпаковыватьСамовывоз Тогда 
		
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.ШтрихМеста);
		ТабДок.Вывести(ОбластьМакета);      
		
	Иначе  
		
		ОбластьМакета.Рисунки.ШтрихМеста.Объект.ТипКода = 1;
		ОбластьМакета.Рисунки.ШтрихМеста.Объект.Сообщение = "1234567890128"; 
		ТабДок.Вывести(ОбластьМакета); 
		ОбластьМакетаДопСтрока = Макет.ПолучитьОбласть("ПодвалДоставка");
		ТабДок.Вывести(ОбластьМакетаДопСтрока);    
		
	КонецЕсли; 
	
	Если ВернутьТабДок = Неопределено Тогда	
		
		Если Не ИмяПринтера = "" Тогда  
			
			ТабДок.ИмяПринтера = ИмяПринтера;
			ТабДок.Напечатать();  
			
		ИначеЕсли СразуНаПринтер Тогда 
			ТабДок.Напечатать();   
		Иначе                 
			ТабДок.Показать();   
		КонецЕсли;
		
	Иначе          
		ВернутьТабДок = ТабДок;	
	КонецЕсли;	
	
	МСК.ЗафиксироватьПечатьДокумента(ЭтотОбъект.Ссылка, ИмяМакета, "Номенклатура по ячейкам");

КонецПроцедуры

Процедура УстановитьДокументСобранИУпакован()
	
	Если НЕ Ссылка.ДокументСобранИУпакован И ДокументСобранИУпакован Тогда				
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КорректировкаСборкиЗаказовПокупателяТовары.Номенклатура,
		|	КорректировкаСборкиЗаказовПокупателяТовары.Количество,
		|	КорректировкаСборкиЗаказовПокупателяТовары.Ячейка,
		|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка КАК Ссылка,
		|	КорректировкаСборкиЗаказовПокупателяТовары.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
		|ГДЕ
		|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.СборкаЗаказовПокупателя = &ТекущийДокумент
		|	И КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";  
		
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			#Если Клиент Тогда
				Предупреждение("Сборка " + Номер + " была откорректирована. Товар " + Выборка.Номенклатура + " должен быть убран  в ячейку '" + Выборка.Ячейка + "'!");
			#КонецЕсли
			
		КонецЦикла;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура ПроверитьСпособДоставки(Отказ)
	
	ЗапросЗаказовПоСпособуДоставки = Новый Запрос;
	ЗапросЗаказовПоСпособуДоставки.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Заказ
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка = &Ссылка
	|	И НЕ СборкаЗаказовПокупателяЗаказано.Заказ.СпособДоставки = &СпособДоставки";
	
	ЗапросЗаказовПоСпособуДоставки.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросЗаказовПоСпособуДоставки.УстановитьПараметр("СпособДоставки", СпособДоставки);
	
	РезультатПоСбособуДоставки = ЗапросЗаказовПоСпособуДоставки.Выполнить();  
	
	Если НЕ РезультатПоСбособуДоставки.Пустой() Тогда
		
		Если Не Константы.База.Получить() = Перечисления.НазваниеБазы.Казань И НЕ Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ВыборкаПоСпособуДоставки = РезультатПоСбособуДоставки.Выбрать();
		ТекстСообщения = "Несоответствие способа доставки по заказам :";
		
		Пока ВыборкаПоСпособуДоставки.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + СокрЛП(ВыборкаПоСпособуДоставки.Заказ) + "";
		КонецЦикла;
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения);
			Предупреждение("Несоответствие способа доставки по заказам", 5); 
		#КонецЕсли
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура ПроверитьОрганизациюПоСтрокам(Отказ)    
	
	ЗапросЗаказовПоОрганизации = Новый Запрос;
	ЗапросЗаказовПоОрганизации.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросЗаказовПоОрганизации.УстановитьПараметр("Организация", Организация);
	ЗапросЗаказовПоОрганизации.Текст =
	"ВЫБРАТЬ
	|	СборкаЗаказовПокупателяЗаказано.Заказ
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Ссылка = &Ссылка
	|	И НЕ СборкаЗаказовПокупателяЗаказано.Заказ.Организация = &Организация";
	
	РезультатЗапросаПоорганизации = ЗапросЗаказовПоОрганизации.Выполнить();
	
	Если НЕ РезультатЗапросаПоорганизации.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаПоОрганизации = РезультатЗапросаПоорганизации.Выбрать();
		ТекстСообщения = "Несоответствие организации по заказам :";
		
		Пока ВыборкаПоОрганизации.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + СокрЛП(ВыборкаПоОрганизации.Заказ) + "";
		КонецЦикла;
		
		#Если Клиент Тогда					
			Сообщить(ТекстСообщения);
			Предупреждение("Несоответствие организации по заказам", 5);				
		#КонецЕсли  
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры

Процедура ПроверитьДатуЗаказа(Отказ) 
	
	ЗапросПроверкаДат = Новый Запрос;
	ЗапросПроверкаДат.Текст =
	"ВЫБРАТЬ
	|	СборкаЗаказовПокупателяЗаказано.Заказ
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Ссылка = &Ссылка
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.Дата < СборкаЗаказовПокупателяЗаказано.Заказ.Дата"; 
	
	ЗапросПроверкаДат.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапросаПроверкаДат = ЗапросПроверкаДат.Выполнить();
	
	Если НЕ РезультатЗапросаПроверкаДат.Пустой() Тогда
		
		Отказ = Истина;
		ВыборкаПроверкаДат = РезультатЗапросаПроверкаДат.Выбрать();
		ТекстСообщения = "Дата заказа в табличной части больше даты сборки :";
		
		Пока ВыборкаПроверкаДат.Следующий() Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + СокрЛП(ВыборкаПроверкаДат.Заказ) + "";
		КонецЦикла;
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения);
			Предупреждение("Дата заказа в табличной части больше даты сборки",5);
		#КонецЕсли  
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьЭкспресс(РежимЗаписи)  
	
	ЯчейкаЭкспресс = Константы.ЯчейкаЭкспресс.Получить();
	
	Если ЗначениеЗаполнено(ЯчейкаЭкспресс) Тогда 
		
		Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
			
			СтруктураПоиска = Новый Структура("Ячейка", ЯчейкаЭкспресс);
			
			МассивСтрок = Заказано.НайтиСтроки(СтруктураПоиска);
			
			Если МассивСтрок.Количество() <> 0 и СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда 
				Экспресс = ЯчейкаЭкспресс;
			Иначе
				Экспресс = Справочники.Ячейки.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Экспресс = Справочники.Ячейки.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьЭтаж()
	
	Этаж = 0;
	СписокЭтажей = Новый СписокЗначений;
	
	Для Каждого Стр Из Заказано Цикл
		
		ТекущийЭтаж = Стр.Ячейка.Этаж;
		
		Если СписокЭтажей.НайтиПоЗначению(ТекущийЭтаж) = Неопределено Тогда 
			СписокЭтажей.Добавить(ТекущийЭтаж);
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокЭтажей.Количество() = 1 Тогда 
		Этаж = СписокЭтажей[0].Значение;
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьОтправлен(РежимЗаписи)
	
	Если ЗначениеЗаполнено(Ссылка) И Константы.AMQP_ВыгружатьДанные.Получить() И Договор.ВыгружаетсяВБиллинг И 
		(Договор <> ПредДоговор ИЛИ (Не Проведен И РежимЗаписи = РежимЗаписиДокумента.Проведение)) Тогда
		
		Принудительно = НЕ (Константы.AMQP_ПроверятьВзаиморасчетыЧерезБиллинг.Получить() И Договор.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг);
		Рез = AMQP_РаботаСДокументами.ПроверкаДокументаВБиллинге(Ссылка, Принудительно);
		
		Отправлен = Истина;
		
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьКлючСтроки()   
	
	Для каждого Стр Из Заказано Цикл		
		
		Если Не ЗначениеЗаполнено(Стр.КлючСтроки) Тогда
			Стр.КлючСтроки = УправлениеЗапасами.ПолучитьНовыйКлючСтроки(ЭтотОбъект, "Заказано");
		КонецЕсли;		
		
	КонецЦикла;      

КонецПроцедуры


ПредДоговор = Ссылка.Договор;
Отправлен = Ложь;
мСтруктураПараметровДляПолученияДоговора = ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи();