
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС ФУНКЦИЙ ОБЕРТОК ДЛЯ МЕТОДОВ ПЛАТФОРМЫ 8.3

Функция ХешКонтрольнойСуммы() Экспорт
	
	Хеш = Неопределено;
	
	Попытка
		Выполнить("Хеш = Новый ХешированиеДанных(ХешФункция.CRC32)");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Хеш;
	
КонецФункции

Процедура ДобавитьДанныеВХеш(Хеш, Данные) Экспорт
	
	Попытка
		Хеш.Добавить(Данные);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция КонтрольнаяСумма(Хеш) Экспорт
	
	Попытка
		Возврат Хеш.ХешСумма;
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

Функция ФорматированнаяСтрокаИзМассиваСтрок(МассивСтрок) Экспорт
	
	ОпределениеСтроки = "";
	
	Попытка
		Выполнить("ОпределениеСтроки = Новый ФорматированнаяСтрока(МассивСтрок)");
	Исключение
		Возврат "";
	КонецПопытки;
	
	Возврат ОпределениеСтроки;
	
КонецФункции

Функция ФорматированнаяСтрокаПоОписанию(Содержимое, Шрифт = Неопределено, ЦветТекста = Неопределено, ЦветФона = Неопределено, Ссылка = "") Экспорт
	
	ОпределениеСтроки = "";
	
	Попытка
		Выполнить("ОпределениеСтроки = Новый ФорматированнаяСтрока(Содержимое, Шрифт, ЦветТекста, ЦветФона, Ссылка)");
	Исключение
		Возврат "";
	КонецПопытки;

	Возврат ОпределениеСтроки;
	
КонецФункции

Функция ЭтоТакси() Экспорт
	
	ЭтоТакси = Ложь;
	Попытка
		Выполнить("ЭтоТакси = (ТекущийВариантИнтерфейсаКлиентскогоПриложения() = ВариантИнтерфейсаКлиентскогоПриложения.Такси)");
		Возврат ЭтоТакси;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
