
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ДокументПоступления) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен документ поступления.");
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДокументПоступления"));
    Параметр.Значение = ДокументПоступления;
    Параметр.Использование = Истина;
	
	Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПоказатьРазличия"));
    Параметр.Значение = ПоказатьРазличия;
    Параметр.Использование = Истина;	
	
КонецПроцедуры
