
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//+Сёмин Р. 18.11.2025 #UT10-5526
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Дата",
		ДобавитьМесяц(ТекущаяДата(), -6),
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		,
		Истина
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Статус",
		"На согласовании",
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Тип",
		"Рекламация",
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список,
		"Номенклатура.Родитель.БезусловныйВозврат",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина
	);
	//-Сёмин Р. 18.11.2025 #UT10-5526
КонецПроцедуры
