Функция СписокФилиалов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазыФилиалов.Филиал,
	               |	ИнформационныеБазыФилиалов.Филиал.НеОбъединятьВОбщемВыкупе КАК НеОбъединятьВОбщемВыкупе,
	               |	ИнформационныеБазыФилиалов.ГоловноеПодразделение
	               |ИЗ
	               |	РегистрСведений.ИнформационныеБазыФилиалов КАК ИнформационныеБазыФилиалов";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Возврат ТЗ;	
	
КонецФункции