Функция СоздатьПолучитьНазначениеИзСтруктуры(СтруктураНазначения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(СтруктураНазначения.ДатаЗаказа) = Тип("Строка") Тогда
		СтруктураНазначения.ДатаЗаказа = ARMStoreKeeper.ПреобразоватьДату(СтруктураНазначения.ДатаЗаказа);		
	КонецЕсли;
	
	Если СтруктураНазначения.Свойство("ДатаОтгрузкиЗаказа") И ТипЗнч(СтруктураНазначения.ДатаОтгрузкиЗаказа) = Тип("Строка") Тогда
		СтруктураНазначения.ДатаОтгрузкиЗаказа = ARMStoreKeeper.ПреобразоватьДату(СтруктураНазначения.ДатаОтгрузкиЗаказа);		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Назначения.Ссылка
	|ИЗ
	|	Справочник.Назначения КАК Назначения
	|ГДЕ
	|	Назначения.НомерЗаказа = &НомерЗаказа
	|	И Назначения.ДатаЗаказа = &ДатаЗаказа";
	
	Запрос.УстановитьПараметр("НомерЗаказа", СтруктураНазначения.НомерЗаказа);
	Запрос.УстановитьПараметр("ДатаЗаказа", СтруктураНазначения.ДатаЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда 
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Выборка.Ссылка;	
	КонецЕсли;  
	
	НовыйЭлемент = Справочники.Назначения.СоздатьЭлемент();
	НовыйЭлемент.НомерЗаказа = СтруктураНазначения.НомерЗаказа;
	НовыйЭлемент.ДатаЗаказа = СтруктураНазначения.ДатаЗаказа;
	НовыйЭлемент.Маршрут = СтруктураНазначения.Маршрут;
	НовыйЭлемент.Грузополучатель = СтруктураНазначения.Грузополучатель;
	НовыйЭлемент.ГрузополучательКодМДМ = СтруктураНазначения.ГрузополучательКодМДМ;
	НовыйЭлемент.ГрузополучательКод = СтруктураНазначения.ГрузополучательКод;         
	НовыйЭлемент.БазаОтправитель = СтруктураНазначения.БазаОтправитель;
	НовыйЭлемент.Наименование = СтруктураНазначения.БазаОтправитель + "/" + СтруктураНазначения.НомерЗаказа + "/" + Формат(СтруктураНазначения.ДатаЗаказа, "ДЛФ=D");
	НовыйЭлемент.КодСоглашения = СтруктураНазначения.КодСоглашения;     

	Если СтруктураНазначения.Свойство("ДатаОтгрузкиЗаказа") Тогда
		НовыйЭлемент.ДатаОтгрузкиЗаказа = СтруктураНазначения.ДатаОтгрузкиЗаказа;
	КонецЕсли;

	НовыйЭлемент.Записать();   
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НовыйЭлемент.Ссылка;

КонецФункции

