Процедура ДобавитьПараметрыВСообщение(СообщениеОбъект, СтруктураПараметров) Экспорт
	
	Если Не ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат;	
	КонецЕсли;  
	
	Если СтруктураПараметров.Свойство("headers") Тогда
		
		Для каждого Парам Из СтруктураПараметров.headers Цикл
			
			НСтр = СообщениеОбъект.Параметры.Добавить();
			НСтр.Имя = Парам.Ключ;
			НСтр.Значение = Парам.Значение;
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьОшибкуПоВходящемуСообщению(ВходящееСообщение, ТекстОшибки) Экспорт
	
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();  
	
	Если ВходящееСообщениеОбъект.ОбработаноСОшибкой Тогда
		ВходящееСообщениеОбъект.КоличествоПопытокПовторнойОбработки = ВходящееСообщениеОбъект.КоличествоПопытокПовторнойОбработки + 1;	
	КонецЕсли;
	
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Истина;
	ВходящееСообщениеОбъект.Обработано = Истина; 
	ВходящееСообщениеОбъект.ТекстОшибки = ТекстОшибки;
	ВходящееСообщениеОбъект.Записать();	
		
КонецПроцедуры

Процедура ПометитьВходящееОбработанным(ВходящееСообщение) Экспорт
	
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Ложь;
	ВходящееСообщениеОбъект.Обработано = Истина;
	ВходящееСообщениеОбъект.ТекстОшибки = "";
	ВходящееСообщениеОбъект.Записать();	
		
КонецПроцедуры

Процедура ЗаписатьОшибкуБезУстановкиПометок(ВходящееСообщение, ТекстОшибки) Экспорт
	
	//+Сёмин Р.И. 09.06.2026 #UT10-5900
	Если Не ЗначениеЗаполнено(ВходящееСообщение) Тогда
		Возврат;
	КонецЕсли;                                 
	
	ВходящееСообщениеОбъект = ВходящееСообщение.ПолучитьОбъект();  
	
	ВходящееСообщениеОбъект.ОбработаноСОшибкой = Ложь;
	ВходящееСообщениеОбъект.Обработано = Ложь; 
	ВходящееСообщениеОбъект.ТекстОшибки = ТекстОшибки;
	ВходящееСообщениеОбъект.Записать();	
	//-Сёмин Р.И. 09.06.2026 #UT10-5900
	
КонецПроцедуры

Функция ПолучитьСтруктуруСвойствПоВходящемуСообщению(ВходящееСообщение) Экспорт 
	
	СвойстваСообщения = Новый Структура;
	Соответствие = Новый Соответствие;   
	
	Для каждого Парам Из ВходящееСообщение.Параметры Цикл  			
		Соответствие.Вставить(Парам.Имя, Парам.Значение);  			
	КонецЦикла; 
	
	СвойстваСообщения.Вставить("headers", Соответствие);
	
	Возврат СвойстваСообщения;
		
КонецФункции          

Функция ПолучитьВидДокументаИзПараметров(ВходящееСообщение) Экспорт
	
	//+Шульман А. 02.07.2025 #UT10-5329
	тзСтрока = ВходящееСообщение.Параметры.Найти("document_type", "Имя");
	
	Если тзСтрока = Неопределено Тогда   
		тзСтрока = ВходящееСообщение.Параметры.Найти("doc_type", "Имя");  
	КонецЕсли;
	
	Если Не тзСтрока = Неопределено Тогда   
		Возврат тзСтрока.Значение;
	КонецЕсли;
	
    Возврат ""; 
	//-Шульман А. 02.07.2025 #UT10-5329
	
КонецФункции // ()





