Процедура ВыполнитьРаботу() Экспорт 
	
	Если ДатаОкончания = Дата(1,1,1) Тогда
		ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	Если ДатаНачала = Дата(1,1,1) Тогда
		ДатаНачала = НачалоДня(ДобавитьМесяц(ДатаОкончания,-1));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+Кабанов А.В. 15.07.2025 # UT10-5323
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ПОМЕСТИТЬ ТабЗаказыПоставщику
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Дата >= &ДатаНачала
	|	И ЗаказПоставщику.Проведен
	|	И ЗаказПоставщику.Дата <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаПоступления
	|ПОМЕСТИТЬ ТабЗаказыПоставщикамПоПоступлениям
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В
	|			(ВЫБРАТЬ
	|				ТабЗаказыПоставщику.Ссылка
	|			ИЗ
	|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Дата
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.ЗаказПоставщику В
	|			(ВЫБРАТЬ
	|				ТабЗаказыПоставщику.Ссылка
	|			ИЗ
	|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК Дней
	|ПОМЕСТИТЬ ТабСтороннихСкладов
	|ИЗ
	|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|			ПО (НАЧАЛОПЕРИОДА(ТабЗаказыПоставщику.Ссылка.Дата, ДЕНЬ) <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	|				И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ТекДата)
	|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	|ГДЕ
	|	ТабЗаказыПоставщику.Ссылка.IDСклада <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСтороннихСкладов.ЗаказПоставщику
	|ПОМЕСТИТЬ НужныеЗаказыПоставщикамСторонниеСклады
	|ИЗ
	|	ТабСтороннихСкладов КАК ТабСтороннихСкладов
	|ГДЕ
	|	ЕСТЬNULL(ТабСтороннихСкладов.ЗаказПоставщику.IDСклада.СкоростьПоставки, 0) <= ТабСтороннихСкладов.Дней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	|ПОМЕСТИТЬ НужныеЗаказыПоставщикам
	|ИЗ
	|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	|ГДЕ
	|	ТабЗаказыПоставщику.Ссылка.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|	И ВЫБОР
	|			КОГДА ТабЗаказыПоставщику.Ссылка.Экспресс = ЛОЖЬ
	|				ТОГДА РАЗНОСТЬДАТ(ТабЗаказыПоставщикамПоПоступлениям.ДатаПоступления, &ТекДата, ДЕНЬ) >= &ЧислоДнейЗакрытия
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НужныеЗаказыПоставщикамСторонниеСклады.ЗаказПоставщику
	|ИЗ
	|	НужныеЗаказыПоставщикамСторонниеСклады КАК НужныеЗаказыПоставщикамСторонниеСклады
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ДоговорПоставщикаТОХ
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			ЗаказПоставщику В
	|				(ВЫБРАТЬ
	|					НужныеЗаказыПоставщикам.ЗаказПоставщику
	|				ИЗ
	|					НужныеЗаказыПоставщикам КАК НужныеЗаказыПоставщикам)) КАК ЗаказыПоставщикамОстатки";
	
	//"ВЫБРАТЬ
	//|	ЗаказПоставщику.Ссылка
	//|ПОМЕСТИТЬ ТабЗаказыПоставщику
	//|ИЗ
	//|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	//|ГДЕ
	//|	ЗаказПоставщику.Дата >= &ДатаНачала
	//|	И ЗаказПоставщику.Проведен
	//|	И ЗаказПоставщику.Дата <= &ДатаОкончания
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	//|	ПоступлениеТоваровУслугТовары.Ссылка.Дата КАК ДатаПоступления
	//|ПОМЕСТИТЬ ТабЗаказыПоставщикамПоПоступлениям
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В
	//|			(ВЫБРАТЬ
	//|				ТабЗаказыПоставщику.Ссылка
	//|			ИЗ
	//|				ТабЗаказыПоставщику КАК ТабЗаказыПоставщику)
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК Дней
	//|ПОМЕСТИТЬ ТабСтороннихСкладов
	//|ИЗ
	//|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	//|			ПО (НАЧАЛОПЕРИОДА(ТабЗаказыПоставщику.Ссылка.Дата, ДЕНЬ) <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	//|				И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &ТекДата)
	//|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	//|ГДЕ
	//|	ТабЗаказыПоставщику.Ссылка.IDСклада <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//|	И РегламентированныйПроизводственныйКалендарь.ВидДня = &ВидДня
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ТабСтороннихСкладов.ЗаказПоставщику
	//|ПОМЕСТИТЬ НужныеЗаказыПоставщикамСторонниеСклады
	//|ИЗ
	//|	ТабСтороннихСкладов КАК ТабСтороннихСкладов
	//|ГДЕ
	//|	ЕСТЬNULL(ТабСтороннихСкладов.ЗаказПоставщику.IDСклада.СкоростьПоставки, 0) <= ТабСтороннихСкладов.Дней
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику
	//|ПОМЕСТИТЬ НужныеЗаказыПоставщикам
	//|ИЗ
	//|	ТабЗаказыПоставщикамПоПоступлениям КАК ТабЗаказыПоставщикамПоПоступлениям
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабЗаказыПоставщику КАК ТабЗаказыПоставщику
	//|		ПО ТабЗаказыПоставщикамПоПоступлениям.ЗаказПоставщику = ТабЗаказыПоставщику.Ссылка
	//|ГДЕ
	//|	ТабЗаказыПоставщику.Ссылка.IDСклада = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	//|	И ВЫБОР
	//|			КОГДА ТабЗаказыПоставщику.Ссылка.Экспресс = ЛОЖЬ
	//|				ТОГДА РАЗНОСТЬДАТ(ТабЗаказыПоставщикамПоПоступлениям.ДатаПоступления, &ТекДата, ДЕНЬ) >= &ЧислоДнейЗакрытия
	//|			ИНАЧЕ ИСТИНА
	//|		КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	НужныеЗаказыПоставщикамСторонниеСклады.ЗаказПоставщику
	//|ИЗ
	//|	НужныеЗаказыПоставщикамСторонниеСклады КАК НужныеЗаказыПоставщикамСторонниеСклады
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	//|			,
	//|			ЗаказПоставщику В
	//|				(ВЫБРАТЬ
	//|					НужныеЗаказыПоставщикам.ЗаказПоставщику
	//|				ИЗ
	//|					НужныеЗаказыПоставщикам КАК НужныеЗаказыПоставщикам)) КАК ЗаказыПоставщикамОстатки";
	//-Кабанов А.В. 15.07.2025 # UT10-5323
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ВидДня", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЧислоДнейЗакрытия", Константы.ЧислоДнейЗакрытияЗаказовНаПополнения.Получить()); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		
		НовыйДокумент = Документы.ЗакрытиеЗаказовПоставщикам.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Комментарий = "Документ создан автоматически регламентым заданием по закрытия документов 'Заказ поставщику'";
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.ЗаказПоставщику.Экспресс
				И ЕстьСмешанныеТоварыПоОбособленнойИБез(ВыборкаДетальныеЗаписи.ЗаказПоставщику)
				И Не ЕстьДваПоступленияСГМИБез(ВыборкаДетальныеЗаписи.ЗаказПоставщику)
				И ВыборкаДетальныеЗаписи.ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса Тогда
				Продолжить;	
			КонецЕсли;
			
			НоваяСтрока = НовыйДокумент.Заказы.Добавить();
			НоваяСтрока.ЗаказПоставщику = ВыборкаДетальныеЗаписи.ЗаказПоставщику;
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;  
			
		КонецЦикла;
		
		Если НовыйДокумент.Заказы.Количество() > 0 Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение); 	
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры 

Функция ЕстьДваПоступленияСГМИБез(ЗаказПоставщику) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ПоступленияСГМ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику = &ЗаказПоставщику
	|	И ПоступлениеТоваровУслугТовары.ГМ <> """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ПоступленияБезГМ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику = &ЗаказПоставщику
	|	И ПоступлениеТоваровУслугТовары.ГМ = """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ПоступленияСГМ.Поступление
	|				ИЗ
	|					ВТ_ПоступленияСГМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказ.Ссылка
	|ИЗ
	|	ВТ_ПоступленияСГМ КАК ВТ_ПоступленияСГМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК Заказ
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПоступленияБезГМ КАК ВТ_ПоступленияБезГМ
	|			ПО (ВТ_ПоступленияБезГМ.ЗаказПоставщику = Заказ.Ссылка)
	|		ПО ВТ_ПоступленияСГМ.ЗаказПоставщику = Заказ.Ссылка
	|ГДЕ
	|	Заказ.Ссылка = &ЗаказПоставщику";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику); 
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;                                
	
	Возврат Ложь;
		
КонецФункции

Функция ЕстьСмешанныеТоварыПоОбособленнойИБез(ЗаказПоставщику)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя КАК Заказ,
	|	РазмещениеЗаказовПокупателейОбороты.ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(, , , ЗаказПоставщику = &ЗаказПоставщику) КАК РазмещениеЗаказовПокупателейОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.ЗаказПоставщику,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя).ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбычныеТовары,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя).ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОбособленныеТовары
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_ЗаказыПокупателя КАК ЗаказПоставщикуТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.ЗаказПоставщику
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|ГДЕ
	|	ВТ_Товары.ОбычныеТовары
	|	И ВТ_Товары.ОбособленныеТовары"; 
	
	Запрос.УстановитьПараметр("ЗаказПоставщику", ЗаказПоставщику);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;	
	КонецЕсли;         
	
	Возврат Ложь;	
		
КонецФункции 

Процедура ВыполнитьРаботуОтрицательныеОстатки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.ДоговорКонтрагента,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.СтатусПартии,
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры,
	|	ЗаказыПоставщикамОстатки.Цена,
	|	ЗаказыПоставщикамОстатки.ЕдиницаИзмерения,
	|	ЗаказыПоставщикамОстатки.СтавкаНДС,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток,
	|	ЗаказыПоставщикамОстатки.СуммаВзаиморасчетовОстаток,
	|	ЗаказыПоставщикамОстатки.СуммаУпрОстаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Дата, ) КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток < 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Месяц = Неопределено;
	
	Выб = Запрос.Выполнить().Выбрать();
	СписЗаказов = Новый СписокЗначений;
	ДатаПервогоЗаказа = Неопределено;
	
	Пока выб.Следующий() Цикл
		
		//+Гавриленков В. 22.08.2025 #UT10-5394  
		КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней для закрытия заказов постащикам по отрицательным остаткам");
		Если Выб.ЗаказПоставщику.Дата < (ТекущаяДата() - ?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 15) * 60 * 60 * 24) Тогда
		//Если Выб.ЗаказПоставщику.Дата < текущаяДата() - 15*60*60*24 тогда
		//-Гавриленков В. 22.08.2025 #UT10-5394
			
			Если СписЗаказов.НайтиПоЗначению(Выб.ЗаказПоставщику) = Неопределено тогда
				
				Если ДатаПервогоЗаказа = Неопределено тогда
					ДатаПервогоЗаказа = Выб.ЗаказПоставщику.Дата;
				КонецЕсли;
				
				СписЗаказов.Добавить(Выб.ЗаказПоставщику);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписЗаказов.Количество() > 0 тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
		|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.Ссылка.Дата) КАК Дата
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|ГДЕ
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику В(&ЗаказПоставщику)
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику";
		
		Запрос.УстановитьПараметр("ЗаказПоставщику", СписЗаказов);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для каждого строка из ТЗ Цикл
			
			Док = Документы.ЗакрытиеЗаказовПоставщикам.СоздатьДокумент();
			Док.Дата = КонецМесяца(Строка.Дата);
			Стр = Док.Заказы.Добавить();
			Стр.ЗаказПоставщику = Строка.ЗаказПоставщику;
			Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
			Док.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЦикла;
		
		Если ДатаПервогоЗаказа <> Неопределено тогда
			РегистрыНакопления.ЗаказыПоставщикам.ПересчитатьИтогиЗаПериод(НачалоМесяца(ДатаПервогоЗаказа), КонецМесяца(ТекущаяДата()));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

