Функция ИзменитьСтатусЗапроса(Заказ, Номенклатура, Идентификатор, Статус, ДопПараметры = Неопределено) Экспорт
	
	Набор = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.СоздатьНаборЗаписей();
	Набор.Отбор.Заказ.Установить(Заказ);
	Набор.Отбор.Номенклатура.Установить(Номенклатура);
	Набор.Отбор.Идентификатор.Установить(Идентификатор); 
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 Тогда
		
		Запись = Набор[0];
		Запись.Статус = Статус;
		
		Если ДопПараметры <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Запись, ДопПараметры);	
		КонецЕсли;
		
		Набор.Записать(Истина);
		
	КонецЕсли; 
	
	//+Белов А. 05.02.2026 #UT10-5681
	Если Статус = Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Отменен Тогда
		СтатусыЗаказов.ПоместитьВОчередьВФоне(Новый Структура("Ссылка", Заказ));
	КонецЕсли;
	//-Белов А. 05.02.2026 #UT10-5681
		
КонецФункции
