Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    Настройки = КомпоновщикНастроек.Настройки; 
	
    ПараметрСКДТолькоСОстатком = Настройки.ПараметрыДанных.Элементы.Найти("ТолькоСОстатком");
    ПараметрСКДТолькоСОстатком.Значение = ЭтотОбъект.ТолькоСОстатком;
    ПараметрСКДТолькоСОстатком.Использование = Истина;
	
	СписокТиповЦен = Новый СписокЗначений; 
	Если ЭтотОбъект.БазоваяЦена Тогда СписокТиповЦен.Добавить(Константы.БазоваяЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.ЗакупочнаяЦена Тогда СписокТиповЦен.Добавить(Константы.ЗакупочнаяЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка35 Тогда СписокТиповЦен.Добавить(Константы.Скидка35.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка36 Тогда СписокТиповЦен.Добавить(Константы.Скидка36.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка37 Тогда СписокТиповЦен.Добавить(Константы.Скидка37.Получить()); КонецЕсли;
	Если ЭтотОбъект.Скидка38 Тогда СписокТиповЦен.Добавить(Константы.Скидка38.Получить()); КонецЕсли;
	Если ЭтотОбъект.СпецЦена Тогда СписокТиповЦен.Добавить(Константы.СпецЦена.Получить()); КонецЕсли;
	Если ЭтотОбъект.АДУрал Тогда СписокТиповЦен.Добавить(Константы.АДУрал.Получить()); КонецЕсли;
	Если ЭтотОбъект.Акция Тогда СписокТиповЦен.Добавить(Константы.Акция.Получить()); КонецЕсли;
	Если ЭтотОбъект.Уцененные Тогда СписокТиповЦен.Добавить(Константы.Уцененные.Получить()); КонецЕсли;
	Если ЭтотОбъект.Резерв4 Тогда СписокТиповЦен.Добавить(Константы.Резерв4.Получить()); КонецЕсли;
	Если ЭтотОбъект.ЦенаСебестоимость Тогда СписокТиповЦен.Добавить(Константы.ЦенаСебестоимость.Получить()); КонецЕсли;

	ПараметрСКДТипЦен = Настройки.ПараметрыДанных.Элементы.Найти("ТипЦен");
	ПараметрСКДТипЦен.Значение = СписокТиповЦен;
	ПараметрСКДТипЦен.Использование = Истина;
КонецПроцедуры