Функция ВыполнитьПроверку(Запрос, СтрогаяПроверка = Истина, ЭтоРегламент = Ложь, ДляБиллинга = Ложь, НачинаемСобиратьНаЗавтра = Ложь) Экспорт
	
	СписокФильтрМаршрутов  = Новый СписокЗначений;
	СписокОчередейДоставки = Новый СписокЗначений;

	Если СтрогаяПроверка Тогда 
		
		Для Каждого Стр Из Маршруты Цикл
			
			Если Стр.Отметка Тогда
				СписокФильтрМаршрутов.Добавить(Стр.Маршрут,Стр.Маршрут);
			КонецЕсли;		  
			
		КонецЦикла;
		
		Если СписокФильтрМаршрутов.Количество() = 0 И ТипДоставки = Перечисления.СпособДоставки.НашаДоставка и НЕ ЭтоРегламент Тогда
			
			#Если Клиент Тогда
				Предупреждение("Нет выбранных Маршрутов !",5);
			#КонецЕсли
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтоРегламент Тогда
		
		//+Гавриленков В. 31.10.2024 #UT10-4855
		//пДеньНедели = ДеньНедели(ТекущаяДата());		
		//
		//Если пДеньНедели = 6 Тогда
		//	пДеньНедели = ПроверитьСубботу(ТекущаяДата());
		//КонецЕсли;
		
		пДеньНедели = МСК.ПолучитьДеньПоКалендарю(ТекущаяДата());
		//-Гавриленков В. 31.10.2024 #UT10-4855		
		
	Иначе
		пДеньНедели = ДеньНеделиЧисло; 
	КонецЕсли;     
	
	//+Гавриленков В. 31.10.2024 #UT10-4855
	ДеньНеделиК = ДеньНедели(ТекущаяДата());   
	//-Гавриленков В. 31.10.2024 #UT10-4855
	
	СтрокаФильтрДнейНедели = "";

	Если НачинаемСобиратьНаЗавтра Тогда
		
		Если ДеньНедели(ТекущаяДата()) = 5 Тогда 
			РабочаяСуббота =  ПроверитьСубботу(ТекущаяДата() + 86400) = 1;
		Иначе
			РабочаяСуббота = Ложь;	
		КонецЕсли;
		
		//+Гавриленков В. 01.11.2024 #UT10-4855
		//ПромДеньНеделиЧисло = ?(пДеньНедели = 6  ИЛИ пДеньНедели = 7 ИЛИ РабочаяСуббота,1 ,пДеньНедели+1);  
		Если ЭтоРегламент Тогда
			ПромДеньНеделиЧисло = ?(ДеньНеделиК = 6  ИЛИ ДеньНеделиК = 7 ИЛИ РабочаяСуббота, 1 , ДеньНеделиК + 1); 
		Иначе
			ПромДеньНеделиЧисло = ?(пДеньНедели = 6  ИЛИ пДеньНедели = 7 ИЛИ РабочаяСуббота, 1 , пДеньНедели + 1);
		КонецЕсли;
		//-Гавриленков В. 01.11.2024 #UT10-4855
		
	Иначе   
		
		//+Гавриленков В. 01.11.2024 #UT10-4855
		Если ЭтоРегламент Тогда 
			ПромДеньНеделиЧисло = ДеньНеделиК;
		Иначе
			ПромДеньНеделиЧисло = пДеньНедели; 
		КонецЕсли;
		//-Гавриленков В. 01.11.2024 #UT10-4855
		
	КонецЕсли; 

	Для ДН = 1 По 7 Цикл 
		
		//+Гавриленков В. 01.11.2024 #UT10-4855
		//Если ПромДеньНеделиЧисло = ДН ИЛИ (НЕ НачинаемСобиратьНаЗавтра И пДеньНедели = ДН)  Тогда
		Если ПромДеньНеделиЧисло = ДН Тогда
			СтрокаФильтрДнейНедели = СтрокаФильтрДнейНедели + "1;"; 
		Иначе
			СтрокаФильтрДнейНедели = СтрокаФильтрДнейНедели + "%;";
		КонецЕсли;  		   
		
	КонецЦикла; 	

	ПараметрТекущееВремя = Дата('00010101') + (ТекущаяДата() - НачалоДня(ТекущаяДата()));
	ПараметрВремяОчереди = ТекущаяДата();

	ЗапросМаксимальногоВремениОчереди = Новый Запрос;
	ЗапросМаксимальногоВремениОчереди.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(ОчередьДоставки.ВремяОкончанияОтправки) КАК ВремяОкончанияОтправки
	|ИЗ
	|	Справочник.ОчередьДоставки КАК ОчередьДоставки
	|ГДЕ
	|	НЕ ОчередьДоставки.ПометкаУдаления
	|	И ОчередьДоставки.ВремяНачалаОтправки <= &ТекущееВремя
	|	И ОчередьДоставки.ВремяОкончанияОтправки >= &ТекущееВремя
	|
	|СГРУППИРОВАТЬ ПО
	|	ОчередьДоставки.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВремяОкончанияОтправки УБЫВ";
	
	ЗапросМаксимальногоВремениОчереди.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
	
	Результат = ЗапросМаксимальногоВремениОчереди.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПараметрВремяОчереди = НачалоДня(ТекущаяДата()) + Час(Выборка.ВремяОкончанияОтправки) * 60 * 60 + Минута(Выборка.ВремяОкончанияОтправки) * 60;
		
	КонецЕсли;

	Если ЭтоРегламент Тогда
		
		Если НачинаемСобиратьНаЗавтра И ТипДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда
			
			ПараметрТекущееВремя = Дата('00010101') + (ТекущаяДата() - НачалоДня(ТекущаяДата()));
			ФильтрМаршрутовНаЗавтра = Новый Массив;
			ПромНачинаемСобиратьНаЗавтра = Ложь;
			ПромВремяНачалаДоставкиНаЗавтра = Константы.ВремяНачалаДоставкиНаЗавтра.Получить();
			ПромВремяНачалаДоставкиНаЗавтраДляСубботы = Константы.ВремяНачалаДоставкиНаЗавтраДляСубботы.Получить();

			Если пДеньНедели = 6 Тогда        

				Если ЗначениеЗаполнено(ПромВремяНачалаДоставкиНаЗавтраДляСубботы) И ПромВремяНачалаДоставкиНаЗавтраДляСубботы < ПараметрТекущееВремя Тогда 
					ПромНачинаемСобиратьНаЗавтра = Истина;
				КонецЕсли;

			ИначеЕсли  пДеньНедели = 6 Тогда
				ПромНачинаемСобиратьНаЗавтра = Истина;
			Иначе
				
				Если ЗначениеЗаполнено(ПромВремяНачалаДоставкиНаЗавтра) И ПромВремяНачалаДоставкиНаЗавтра < ПараметрТекущееВремя Тогда 
					ПромНачинаемСобиратьНаЗавтра = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ПромНачинаемСобиратьНаЗавтра Тогда
				
				ЗапросМаршрутов = Новый Запрос;
				ЗапросМаршрутов.Текст = 
				"ВЫБРАТЬ
				|	МаршрутыДоставки.Ссылка КАК Маршрут
				|ИЗ
				|	Справочник.МаршрутыДоставки КАК МаршрутыДоставки
				|ГДЕ
				|	МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра <= &ТекущееВремя
				|	И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";

				Если пДеньНедели = 6 Тогда         
					
					ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра <= &ТекущееВремя","МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтраДляСубботы <= &ТекущееВремя");
					ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)","И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтраДляСубботы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)");
					
				КонецЕсли;
				
				ЗапросМаршрутов.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
				РезультатЗапросаМаршрутов = ЗапросМаршрутов.Выполнить().Выгрузить();
				
				Если НЕ РезультатЗапросаМаршрутов.Количество() = 0 Тогда
					ФильтрМаршрутовНаЗавтра = РезультатЗапросаМаршрутов.ВыгрузитьКолонку("Маршрут");
				КонецЕсли;
				
			КонецЕсли;

			ЗапросМаршрутовИОчередей = Новый Запрос;
			ЗапросМаршрутовИОчередей.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗапросМаршрутовИОчередей.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗаказПокупателя.Грузополучатель
			|ПОМЕСТИТЬ ДоставкаНаЗавтра
			|ИЗ
			|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
			|ГДЕ
			|	ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|	И 
			|        ВЫБОР
			|			КОГДА ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				ТОГДА ВЫРАЗИТЬ(ЗаказПокупателя.Грузополучатель.РасписаниеРаботыСтрокой КАК СТРОКА(15)) ПОДОБНО &СтрокаФильтрДнейНедели
			|             И НАЧАЛОПЕРИОДА(ЗаказПокупателя.Дата,ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДата)
			|			ИНАЧЕ 
			|       ЗаказПокупателя.ДатаОтгрузки >= &НачалоЗавтрашнегоДня
			|					И ЗаказПокупателя.ДатаОтгрузки <= ДОБАВИТЬКДАТЕ(&КонецЗавтрашнегоДня, ДЕНЬ, &ДобавитьДней)
			|		КОНЕЦ
			|";
			
			Если НЕ ФильтрМаршрутовНаЗавтра.Количество() = 0 Тогда
				
				ЗапросМаршрутовИОчередей.УстановитьПараметр("СписокМаршрутов",ФильтрМаршрутовНаЗавтра);
				ЗапросМаршрутовИОчередей.Текст = ЗапросМаршрутовИОчередей.Текст + "
				| И ЗаказПокупателя.Грузополучатель.МаршрутДоставки В (&СписокМаршрутов) ";
				
			КонецЕсли;

			ЗапросМаршрутовИОчередей.Текст = ЗапросМаршрутовИОчередей.Текст + "
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДоставкаНаЗавтра.Грузополучатель.МаршрутДоставки КАК МаршрутДоставки,
			|	КонтрагентыОчередиДоставки.Очередь
			|ПОМЕСТИТЬ МаршрутыСОчередями
			|ИЗ
			|	ДоставкаНаЗавтра КАК ДоставкаНаЗавтра
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ОчередиДоставки КАК КонтрагентыОчередиДоставки
			|		ПО ДоставкаНаЗавтра.Грузополучатель = КонтрагентыОчередиДоставки.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	МаршрутыСОчередями.МаршрутДоставки,
			|	МИНИМУМ(МаршрутыСОчередями.Очередь.ВремяОкончанияОтправки) КАК ОчередьВремяОкончанияОтправки
			|ПОМЕСТИТЬ МаршрутыИВремя
			|ИЗ
			|	МаршрутыСОчередями КАК МаршрутыСОчередями
			|
			|СГРУППИРОВАТЬ ПО
			|	МаршрутыСОчередями.МаршрутДоставки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МаршрутыИВремя.МаршрутДоставки КАК МаршрутДоставки,
			|	МаршрутыСОчередями.Очередь КАК Очередь
			|ИЗ
			|	МаршрутыИВремя КАК МаршрутыИВремя
			|		ЛЕВОЕ СОЕДИНЕНИЕ МаршрутыСОчередями КАК МаршрутыСОчередями
			|		ПО МаршрутыИВремя.МаршрутДоставки = МаршрутыСОчередями.МаршрутДоставки
			|			И МаршрутыИВремя.ОчередьВремяОкончанияОтправки = МаршрутыСОчередями.Очередь.ВремяОкончанияОтправки";
			
			ЗапросМаршрутовИОчередей.УстановитьПараметр("НачалоЗавтрашнегоДня", КонецДня(ТекущаяДата()) + 1);
			ЗапросМаршрутовИОчередей.УстановитьПараметр("КонецЗавтрашнегоДня", КонецДня(КонецДня(ТекущаяДата()) + 1));
			ЗапросМаршрутовИОчередей.УстановитьПараметр("ДобавитьДней", ?(ДеньНедели(ТекущаяДата()) = 6, 1, 0));
			ЗапросМаршрутовИОчередей.УстановитьПараметр("СтрокаФильтрДнейНедели", СтрокаФильтрДнейНедели);
			ЗапросМаршрутовИОчередей.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

			РезультатЗапроса = ЗапросМаршрутовИОчередей.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ТаблРезультат = РезультатЗапроса.Выгрузить();
				СписокФильтрМаршрутов.ЗагрузитьЗначения(ТаблРезультат.ВыгрузитьКолонку("МаршрутДоставки"));
				СписокОчередейДоставки.ЗагрузитьЗначения(ТаблРезультат.ВыгрузитьКолонку("Очередь"));
				
			КонецЕсли;
			
			Если СписокФильтрМаршрутов.Количество() = 0 И СписокОчередейДоставки.Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;			
			
		Иначе

			ЗапросМаршрутов = Новый Запрос;
			ЗапросМаршрутов.Текст = 
			"ВЫБРАТЬ
			|	МаршрутыДоставки.Ссылка КАК Маршрут
			|ИЗ
			|	Справочник.МаршрутыДоставки КАК МаршрутыДоставки
			|ГДЕ
			|	НЕ МаршрутыДоставки.ПометкаУдаления
			|	И МаршрутыДоставки.ВремяНачала <= &ТекущееВремя
			|	И МаршрутыДоставки.ВремяОкончания >= &ТекущееВремя
			|
			|УПОРЯДОЧИТЬ ПО
			|	МаршрутыДоставки.Наименование";
			
			Если НачинаемСобиратьНаЗавтра Тогда 
				
				// собираем на завтра, маршруты не учитываем , нам нужны все маршруты
				ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "И МаршрутыДоставки.ВремяНачала <= &ТекущееВремя","");
				ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "И МаршрутыДоставки.ВремяОкончания >= &ТекущееВремя","");
				
			Иначе
				
				Если пДеньНедели = 6 Тогда         
					ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "И МаршрутыДоставки.ВремяОкончания >= &ТекущееВремя","И МаршрутыДоставки.ВремяОкончанияВСубботу >= &ТекущееВремя");
				КонецЕсли;
				
				ЗапросМаршрутов.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
				
			КонецЕсли; 
			
			Результат = ЗапросМаршрутов.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					СписокФильтрМаршрутов.Добавить(Выборка.Маршрут, Выборка.Маршрут);
				КонецЦикла;		  
				
			КонецЕсли;
			
			ЗапросОчередей = Новый Запрос;
			
			Если НачинаемСобиратьНаЗавтра Тогда
				
				ЗапросОчередей.Текст = 
				"ВЫБРАТЬ
				|	ОчередьДоставки.Ссылка КАК Очередь
				|ИЗ
				|	Справочник.ОчередьДоставки КАК ОчередьДоставки
				|ГДЕ
				|	НЕ ОчередьДоставки.ПометкаУдаления
				|
				|УПОРЯДОЧИТЬ ПО
				|	Очередь
				|АВТОУПОРЯДОЧИВАНИЕ";
				
			Иначе
				
				ЗапросОчередей.Текст = 
				"ВЫБРАТЬ
				|	ОчередьДоставки.Ссылка КАК Очередь
				|ИЗ
				|	Справочник.ОчередьДоставки КАК ОчередьДоставки
				|ГДЕ
				|	НЕ ОчередьДоставки.ПометкаУдаления
				|	И ОчередьДоставки.ВремяНачалаОтправки <= &ТекущееВремя
				|	И ОчередьДоставки.ВремяОкончанияОтправки >= &ТекущееВремя";
				
				ЗапросОчередей.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
				
			КонецЕсли;
			
			Результат = ЗапросОчередей.Выполнить();
			
			Если НЕ Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					СписокОчередейДоставки.Добавить(Выборка.Очередь,Выборка.Очередь);
				КонецЦикла;		  
				
			КонецЕсли;
			
		КонецЕсли;

		ВремяОтправкиНаСамовывоз = ТекущаяДата() + (Константы.ВремяОтправкиНаСамовывоз.Получить() * 60);

	Иначе
		
		Если ЗначениеЗаполнено(Очередь) тогда 
			СписокОчередейДоставки.Добавить(Очередь);
		КонецЕсли;
		
	КонецЕсли;             
	
	//+Гавриленков В. 25.07.2025 #UT10-5354 В таблице Документы убрал "разрешающее" условие - ИЛИ ДокументыПредв.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	//-Гавриленков В. 22.01.2026 #UT10-5608 В таблицу с индексом 13 добавил в условие ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
	Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыГотовыеКСборкеОстатки.Номенклатура) КАК КоличествоТоваров
			|ПОМЕСТИТЬ ВтТоварыКоличество
			|ИЗ
			|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки КАК ТоварыГотовыеКСборкеОстатки
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ИспользоватьДатуОтгрузкиИзЗаказа
			|				ТОГДА ВЫБОР
			|						КОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|							ТОГДА ВЫБОР
			|									КОГДА &НачинаемСобиратьНаЗавтра
			|										ТОГДА НАЧАЛОПЕРИОДА(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ) <= ДОБАВИТЬКДАТЕ(&ОкончаниеСегодняшнегоДня, ДЕНЬ, &ДобавитьДней)
			|												И (ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки >= &ОкончаниеСегодняшнегоДня
			|													ИЛИ ВЫБОР
			|														КОГДА &ДеньНеделиЧисло = 7
			|															ТОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки < &ОкончаниеСегодняшнегоДня
			|														ИНАЧЕ ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки < &ТекущаяДата
			|													КОНЕЦ)
			|									ИНАЧЕ ВЫБОР
			|											КОГДА &ЭтоРегламент
			|												ТОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки <= &ПараметрВремяОчереди
			|											ИНАЧЕ ИСТИНА
			|										КОНЕЦ
			|								КОНЕЦ
			|						ИНАЧЕ ВЫБОР
			|								КОГДА &ЭтоРегламент
			|									ТОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки <= &ВремяОтправкиНаСамовывоз
			|								ИНАЧЕ ИСТИНА
			|							КОНЕЦ
			|					КОНЕЦ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И ТоварыГотовыеКСборкеОстатки.КоличествоОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.Грузополучатель
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Грузополучатель
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Заказы.ЗаказПокупателя.ДоговорКонтрагента.Владелец КАК Контрагент,
			|	Заказы.ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
			|	Заказы.ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	Заказы.ЗаказПокупателя.СпособДоставки КАК СпособДоставки,
			|	Заказы.ЗаказПокупателя.Грузополучатель.МаршрутДоставки КАК МаршрутДоставки,
			|	Заказы.ЗаказПокупателя.Грузополучатель.МенеджерМСК КАК Менеджер,
			|	СУММА(Заказы.ЗаказПокупателя.Грузополучатель.МинимальнаяСуммаДоставки) КАК МинимальнаяСуммаДоставки,
			|	СУММА(ВЫБОР
			|			КОГДА ЕСТЬNULL(ЗаказыПокупателей.КоличествоОстаток, 0) <= 0
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(ЗаказыПокупателей.СуммаУпрОстаток, 0) / ЕСТЬNULL(ЗаказыПокупателей.КоличествоОстаток, 0)
			|		КОНЕЦ * Заказы.КоличествоОстаток) КАК СуммаПоЗаказам,
			|	Заказы.ЗаказПокупателя,
			|	Заказы.ЗаказПокупателя.ТолькоРезерв КАК ТолькоРезерв,
			|	МАКСИМУМ(Заказы.ЗаказПокупателя.Грузополучатель.ИнтервалДоОкончанияОчереди) КАК ИнтервалДоОкончанияОчереди,
			|	МАКСИМУМ(Заказы.ЗаказПокупателя.Грузополучатель.МинимальноеКоличествоТваровГотовыхКСборке) КАК КоличествоТоваровМинимум,
			|	МАКСИМУМ(КолТоваровГотовыхКСборке.КоличествоТоваров) КАК КоличествоТоваровГотово,
			|	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЧАС, ЧАС(Заказы.ЗаказПокупателя.ДатаОтгрузки)), МИНУТА, МИНУТА(Заказы.ЗаказПокупателя.ДатаОтгрузки))) КАК ВремяОтгрузки
			|ПОМЕСТИТЬ ДокументыПредв
			|ИЗ
			|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
			|			,
			|			(ЗаказПокупателя.СпособДоставки = &СпособДоставки
			|				ИЛИ &ЛюбойСпособДоставки = ИСТИНА)
			|				И (ЗаказПокупателя.Грузополучатель.МаршрутДоставки В (&СписокФильтрМаршрутов)
			|					ИЛИ &ЛюбойМаршрут = ИСТИНА)
			|				И (ПОДСТРОКА(ЗаказПокупателя.Грузополучатель.РасписаниеРаботыСтрокой, 0, 200) = """"
			|					ИЛИ ВЫРАЗИТЬ(ЗаказПокупателя.Грузополучатель.РасписаниеРаботыСтрокой КАК СТРОКА(15)) ПОДОБНО &СтрокаФильтрДнейНедели
			|					ИЛИ &ЛюбоеРасписание = ИСТИНА)
			|				И (ЗаказПокупателя.Организация = &Организация
			|					ИЛИ &ЛюбаяОрганизация = ИСТИНА)
			|				И (НЕ ЗаказПокупателя.Грузополучатель.НеСоздаватьСборкуВАвтоматическомРежиме
			|					ИЛИ &ЭтоРучнойРежим = ИСТИНА)
			|				И (НЕ &ЭтоРегламент
			|					ИЛИ (ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|							И НЕ ЗаказПокупателя.Грузополучатель.НеСоздаватьСборкуВАвтоматическомРежимеПриДоставке
			|						ИЛИ ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)
			|							И НЕ ЗаказПокупателя.Грузополучатель.НеСоздаватьСборкуВАвтоматическомРежимеПриСамовывозе))) КАК Заказы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(, НЕ ТолькоРезерв) КАК ЗаказыПокупателей
			|		ПО Заказы.ЗаказПокупателя = ЗаказыПокупателей.ЗаказПокупателя
			|			И Заказы.Номенклатура = ЗаказыПокупателей.Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыКоличество КАК КолТоваровГотовыхКСборке
			|		ПО Заказы.ЗаказПокупателя.Грузополучатель = КолТоваровГотовыхКСборке.Грузополучатель
			|ГДЕ
			|	Заказы.КоличествоОстаток > 0
			|	И ВЫБОР
			|			КОГДА &ИспользоватьДатуОтгрузкиИзЗаказа
			|				ТОГДА ВЫБОР
			|						КОГДА Заказы.ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|							ТОГДА ВЫБОР
			|									КОГДА &НачинаемСобиратьНаЗавтра
			|										ТОГДА НАЧАЛОПЕРИОДА(Заказы.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ) <= ДОБАВИТЬКДАТЕ(&ОкончаниеСегодняшнегоДня, ДЕНЬ, &ДобавитьДней)
			|												И (Заказы.ЗаказПокупателя.ДатаОтгрузки >= &ОкончаниеСегодняшнегоДня
			|													ИЛИ ВЫБОР
			|														КОГДА &ДеньНеделиЧисло = 7
			|															ТОГДА Заказы.ЗаказПокупателя.ДатаОтгрузки < &ОкончаниеСегодняшнегоДня
			|														ИНАЧЕ Заказы.ЗаказПокупателя.ДатаОтгрузки < &ТекущаяДата
			|													КОНЕЦ)
			|									ИНАЧЕ ВЫБОР
			|											КОГДА &ЭтоРегламент
			|												ТОГДА Заказы.ЗаказПокупателя.ДатаОтгрузки <= &ПараметрВремяОчереди
			|											ИНАЧЕ ИСТИНА
			|										КОНЕЦ
			|								КОНЕЦ
			|						ИНАЧЕ ВЫБОР
			|								КОГДА &ЭтоРегламент
			|									ТОГДА Заказы.ЗаказПокупателя.ДатаОтгрузки <= &ВремяОтправкиНаСамовывоз
			|								ИНАЧЕ ИСТИНА
			|							КОНЕЦ
			|					КОНЕЦ
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И ЗаказыПокупателей.КоличествоОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	Заказы.ЗаказПокупателя.Грузополучатель,
			|	Заказы.ЗаказПокупателя.ДоговорКонтрагента,
			|	Заказы.ЗаказПокупателя.СпособДоставки,
			|	Заказы.ЗаказПокупателя.ДоговорКонтрагента.Владелец,
			|	Заказы.ЗаказПокупателя.Грузополучатель.МаршрутДоставки,
			|	Заказы.ЗаказПокупателя.Грузополучатель.МенеджерМСК,
			|	Заказы.ЗаказПокупателя,
			|	Заказы.ЗаказПокупателя.ТолькоРезерв
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДокументыПредв.Контрагент,
			|	ДокументыПредв.Грузополучатель,
			|	ДокументыПредв.ДоговорКонтрагента,
			|	ДокументыПредв.СпособДоставки,
			|	ДокументыПредв.МаршрутДоставки,
			|	ДокументыПредв.Менеджер,
			|	ДокументыПредв.МинимальнаяСуммаДоставки,
			|	ДокументыПредв.СуммаПоЗаказам,
			|	ДокументыПредв.ЗаказПокупателя,
			|	ДокументыПредв.ТолькоРезерв,
			|	ДокументыПредв.ВремяОтгрузки
			|ПОМЕСТИТЬ Документы
			|ИЗ
			|	ДокументыПредв КАК ДокументыПредв
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ОчередиДоставки КАК КонтрагентыОчередиДоставки
			|		ПО ДокументыПредв.Грузополучатель = КонтрагентыОчередиДоставки.Ссылка
			|ГДЕ
			|	ВЫБОР
			|			КОГДА КонтрагентыОчередиДоставки.Очередь В (&СписокОчередейДоставки)
			|					ИЛИ КонтрагентыОчередиДоставки.Очередь ЕСТЬ NULL
			|					ИЛИ &ЛюбаяОчередьДоставки
			|				ТОГДА ВЫБОР
			|						КОГДА &ЭтоРегламент
			|							ТОГДА ВЫБОР
			|									КОГДА ВЫБОР
			|											КОГДА ДокументыПредв.КоличествоТоваровМинимум > 0
			|												ТОГДА ДокументыПредв.КоличествоТоваровМинимум <= ДокументыПредв.КоличествоТоваровГотово
			|											ИНАЧЕ ВЫБОР
			|													КОГДА &НачинаемСобиратьНаЗавтра
			|														ТОГДА ВЫБОР
			|																КОГДА КонтрагентыОчередиДоставки.Очередь В (&СписокОчередейДоставки)
			|																	ТОГДА ДокументыПредв.ВремяОтгрузки <= КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки
			|																			ИЛИ ДокументыПредв.ЗаказПокупателя.ДатаОтгрузки < &ТекущаяДата
			|																ИНАЧЕ ЛОЖЬ
			|															КОНЕЦ
			|													ИНАЧЕ ВЫБОР
			|															КОГДА ДокументыПредв.ЗаказПокупателя.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|																ТОГДА ИСТИНА
			|															ИНАЧЕ ВЫБОР
			|																	КОГДА ДокументыПредв.ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|																		ТОГДА ВЫБОР
			|																				КОГДА ДЕНЬ(ДокументыПредв.ЗаказПокупателя.ДатаОтгрузки) = ДЕНЬ(&ТекущаяДата)
			|																					ТОГДА ДокументыПредв.ВремяОтгрузки <= ЕСТЬNULL(КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки, &ТекущаяДата)
			|																				ИНАЧЕ ИСТИНА
			|																			КОНЕЦ
			|																	ИНАЧЕ ИСТИНА
			|																КОНЕЦ
			|														КОНЕЦ
			|												КОНЕЦ
			|										КОНЕЦ
			|										ТОГДА ИСТИНА
			|									ИНАЧЕ ВЫБОР
			|											КОГДА КонтрагентыОчередиДоставки.Очередь В (&СписокОчередейДоставки)
			|												ТОГДА ВЫБОР
			|														КОГДА &НачинаемСобиратьНаЗавтра
			|															ТОГДА РАЗНОСТЬДАТ(&ТекущееВремя, ВЫБОР
			|																			КОГДА &ДеньНеделиЧисло = 6
			|																				ТОГДА ДокументыПредв.МаршрутДоставки.ВремяОкончанияВСубботу
			|																			ИНАЧЕ ДокументыПредв.МаршрутДоставки.ВремяОкончания
			|																		КОНЕЦ, МИНУТА) <= ДокументыПредв.ИнтервалДоОкончанияОчереди
			|																	И (ДокументыПредв.ВремяОтгрузки <= КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки
			|																		ИЛИ ДокументыПредв.ЗаказПокупателя.ДатаОтгрузки < &ТекущаяДата)
			|														ИНАЧЕ РАЗНОСТЬДАТ(&ТекущееВремя, КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки, МИНУТА) <= ДокументыПредв.ИнтервалДоОкончанияОчереди
			|													КОНЕЦ
			|											ИНАЧЕ РАЗНОСТЬДАТ(&ТекущееВремя, ВЫБОР
			|														КОГДА &ДеньНеделиЧисло = 6
			|															ТОГДА ДокументыПредв.МаршрутДоставки.ВремяОкончанияВСубботу
			|														ИНАЧЕ ДокументыПредв.МаршрутДоставки.ВремяОкончания
			|													КОНЕЦ, МИНУТА) <= ДокументыПредв.ИнтервалДоОкончанияОчереди
			|										КОНЕЦ
			|								КОНЕЦ
			|						ИНАЧЕ ИСТИНА
			|					КОНЕЦ
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА &ЭтоРегламент
			|					И &НачинаемСобиратьНаЗавтра
			|				ТОГДА (ДокументыПредв.МаршрутДоставки, КонтрагентыОчередиДоставки.Очередь) В
			|						(ВЫБРАТЬ
			|							Маршруты.МаршрутДоставки,
			|							Маршруты.Очередь
			|						ИЗ
			|							вт_Маршруты КАК Маршруты)
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|	И ВЫБОР
			|			КОГДА ДокументыПредв.Грузополучатель.ЗаказыватьТоварыДляХозДеятельностиФилиала
			//|					ИЛИ ДокументыПредв.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
			|					ИЛИ ДокументыПредв.ДоговорКонтрагента.Организация = &УправленческаяОрганизация
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ НЕ(НЕ ДокументыПредв.ЗаказПокупателя.ДоговорКонтрагента.ЛицевойСчет
			|						И НЕ ДокументыПредв.ЗаказПокупателя.ДоговорКонтрагента.Подарки
			|						И НЕ ДокументыПредв.ЗаказПокупателя.ДоговорКонтрагента.РозничнаяПродажа
			|						И НЕ ДокументыПредв.ЗаказПокупателя.Контрагент.СтатусФНСКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыФНСКонтрагента.КонтрагентЕстьВБазеФНС))
			|		КОНЕЦ
			//+Сёмин Р.И. 17.07.2026 #UT10-5955
			|	И НЕ ДокументыПредв.ЗаказПокупателя В
			|		(ВЫБРАТЬ
			|			ЗаказыСМаркировкойПоУпрОрганизации.ЗаказПокупателяМарк
			|		ИЗ
			|			ЗаказыСМаркировкойПоУпрОрганизации)
			//-Сёмин Р.И. 17.07.2026 #UT10-5955
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ТоварыВСборке.СуммаСобраноОстаток) КАК СуммаСобраноОстаток,
			|	СУММА(ТоварыВСборке.СуммаКСборкеОстаток) КАК СуммаКСборкеОстаток,
			|	ТоварыВСборке.ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента
			|ПОМЕСТИТЬ ВтТоварыВСборке
			|ИЗ
			|	РегистрНакопления.ТоварыВСборке.Остатки(
			|			,
			|			Контрагент В
			|				(ВЫБРАТЬ
			|					ДокументыПредв.Контрагент
			|				ИЗ
			|					ДокументыПредв КАК ДокументыПредв)) КАК ТоварыВСборке
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыВСборке.ЗаказПокупателя.ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Документы.Контрагент КАК Контрагент,
			|	Документы.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ВЫБОР
			|		КОГДА Документы.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|				И НЕ &ПроверятьПоБиллингу
			|			ТОГДА 0
			|		ИНАЧЕ МАКСИМУМ(ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0)) + СУММА(Документы.СуммаПоЗаказам) + МАКСИМУМ(ЕСТЬNULL(ТоварыВСборке.СуммаСобраноОстаток, 0)) + МАКСИМУМ(ЕСТЬNULL(ТоварыВСборке.СуммаКСборкеОстаток, 0))
			|	КОНЕЦ КАК ДолгПоДоговору,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА Документы.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|					И НЕ &ПроверятьПоБиллингу
			|				ТОГДА 0
			|			ИНАЧЕ ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0)
			|		КОНЕЦ) КАК ДолгПоВзаиморасчетам,
			|	Договоры.КонтролироватьЧислоДнейЗадолженности,
			|	МАКСИМУМ(Договоры.ДопустимоеЧислоДнейЗадолженности) КАК ДопустимоеЧислоДнейЗадолженности,
			|	Договоры.КонтролироватьСуммуЗадолженности,
			|	МАКСИМУМ(Договоры.ДопустимаяСуммаЗадолженности) КАК МаксСуммаЗадолженности,
			|	МАКСИМУМ(Договоры.ПроцентПредоплаты) КАК ПроцентПредоплаты,
			|	СУММА(Документы.СуммаПоЗаказам) КАК СуммаПоЗаказам
			|ПОМЕСТИТЬ ОбщийДолг
			|ИЗ
			|	Документы КАК Документы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			|				,
			|				ДоговорКонтрагента В
			|					(ВЫБРАТЬ
			|						Документы.ДоговорКонтрагента КАК ДоговорКонтрагента
			|					ИЗ
			|						Документы КАК Документы)) КАК Взаиморасчеты
			|		ПО Документы.ДоговорКонтрагента = Взаиморасчеты.ДоговорКонтрагента
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
			|		ПО Документы.ДоговорКонтрагента = Договоры.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыВСборке КАК ТоварыВСборке
			|		ПО Документы.ДоговорКонтрагента = ТоварыВСборке.ДоговорКонтрагента
			|
			|СГРУППИРОВАТЬ ПО
			|	Документы.Контрагент,
			|	Документы.ДоговорКонтрагента,
			|	Договоры.КонтролироватьЧислоДнейЗадолженности,
			|	Договоры.КонтролироватьСуммуЗадолженности,
			|	Документы.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Контрагент,
			|	ДоговорКонтрагента
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщийДолг.Контрагент КАК Контрагент,
			|	ВЫБОР
			|		КОГДА ВЫРАЗИТЬ(ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Грузополучатель ЕСТЬ NULL
			|			ТОГДА ОбщийДолг.Контрагент
			|		ИНАЧЕ ВЫРАЗИТЬ(ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Грузополучатель
			|	КОНЕЦ КАК Грузополучатель,
			|	ОбщийДолг.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	ОбщийДолг.ДолгПоДоговору,
			|	ЕСТЬNULL(ВзаиморасчетыПоДок.СуммаВзаиморасчетовОстаток, 0) КАК ДолгПоВзаиморасчетам,
			|	0 КАК ДолгПоДок,
			|	ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом КАК ДокументРасчетов,
			|	ОбщийДолг.КонтролироватьЧислоДнейЗадолженности,
			|	ОбщийДолг.ДопустимоеЧислоДнейЗадолженности,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА ОбщийДолг.КонтролироватьЧислоДнейЗадолженности
			|					И ОбщийДолг.ДолгПоДоговору > 0
			|					И ЕСТЬNULL(ВзаиморасчетыПоДок.СуммаВзаиморасчетовОстаток, 0) > 0
			|				ТОГДА РАЗНОСТЬДАТ(ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом.Дата, &ТекущаяДата, ДЕНЬ) - ОбщийДолг.ДопустимоеЧислоДнейЗадолженности
			|			ИНАЧЕ 0
			|		КОНЕЦ, 0) КАК ПросроченоДней,
			|	ВЫБОР
			|		КОГДА ОбщийДолг.КонтролироватьЧислоДнейЗадолженности
			|				И ОбщийДолг.ДолгПоДоговору > 0
			|				И ЕСТЬNULL(ВзаиморасчетыПоДок.СуммаВзаиморасчетовОстаток, 0) > 0
			|			ТОГДА ВЫБОР
			|					КОГДА РАЗНОСТЬДАТ(ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом.Дата, &ТекущаяДата, ДЕНЬ) - ОбщийДолг.ДопустимоеЧислоДнейЗадолженности > 0
			|						ТОГДА ЕСТЬNULL(ВзаиморасчетыПоДок.СуммаВзаиморасчетовОстаток, 0)
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПросроченоСумма,
			|	0 КАК ПараметрСортировки
			|ПОМЕСТИТЬ ДолгиПоДокументамБезУчетаПраздников
			|ИЗ
			|	ОбщийДолг КАК ОбщийДолг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
			|				,
			|				ДоговорКонтрагента В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						ОбщийДолг.ДоговорКонтрагента
			|					ИЗ
			|						ОбщийДолг КАК ОбщийДолг)) КАК ВзаиморасчетыПоДок
			|		ПО ОбщийДолг.ДоговорКонтрагента = ВзаиморасчетыПоДок.ДоговорКонтрагента
			|ГДЕ
			|	НЕ ВзаиморасчетыПоДок.ДокументРасчетовСКонтрагентом ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов КАК ДокументРасчетов,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КоличествоДней
			|ПОМЕСТИТЬ ТабДнейПроскочкиПоДокументу
			|ИЗ
			|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДолгиПоДокументамБезУчетаПраздников КАК ДолгиПоДокументамБезУчетаПраздников
			|		ПО (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ НАЧАЛОПЕРИОДА(ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.Дата, ДЕНЬ) И &ТекущаяДата)
			|			И (РегламентированныйПроизводственныйКалендарь.ВидДня = &РабочийДень
			|				ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = &ПредпраздничныйДень)
			|			И (РегламентированныйПроизводственныйКалендарь.ДатаКалендаря > НАЧАЛОПЕРИОДА(ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.Дата, ДЕНЬ))
			|
			|СГРУППИРОВАТЬ ПО
			|	ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДолгиПоДокументамБезУчетаПраздников.Контрагент,
			|	ДолгиПоДокументамБезУчетаПраздников.Грузополучатель,
			|	ДолгиПоДокументамБезУчетаПраздников.ДоговорКонтрагента,
			|	ДолгиПоДокументамБезУчетаПраздников.ДолгПоДоговору,
			|	ДолгиПоДокументамБезУчетаПраздников.ДолгПоВзаиморасчетам,
			|	ДолгиПоДокументамБезУчетаПраздников.ДолгПоДок,
			|	ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов,
			|	ДолгиПоДокументамБезУчетаПраздников.КонтролироватьЧислоДнейЗадолженности,
			|	ВЫБОР
			|		КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов ССЫЛКА Документ.РеализацияТоваровУслуг
			|			ТОГДА ВЫБОР
			|					КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты <> 0
			|						ТОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты
			|					ИНАЧЕ ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|				КОНЕЦ
			|		ИНАЧЕ ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|	КОНЕЦ КАК ДопустимоеЧислоДнейЗадолженности,
			|	ДолгиПоДокументамБезУчетаПраздников.ПросроченоДней КАК ПросроченоДнейБезУчетаВыходныхИПраздничных,
			|	ДолгиПоДокументамБезУчетаПраздников.ПросроченоСумма КАК ПросроченоСуммаБезУчетаВыходныхИПраздничных,
			|	ДолгиПоДокументамБезУчетаПраздников.ПараметрСортировки,
			|	ВЫБОР
			|		КОГДА ДолгиПоДокументамБезУчетаПраздников.КонтролироватьЧислоДнейЗадолженности
			|				И ДолгиПоДокументамБезУчетаПраздников.ДолгПоДоговору > 0
			|				И ДолгиПоДокументамБезУчетаПраздников.ДолгПоВзаиморасчетам > 0
			|			ТОГДА ВЫБОР
			|					КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов ССЫЛКА Документ.РеализацияТоваровУслуг
			|						ТОГДА ВЫБОР
			|								КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты <> 0
			|									ТОГДА ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты
			|								ИНАЧЕ ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|							КОНЕЦ
			|					ИНАЧЕ ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПросроченоДней,
			|	ВЫБОР
			|		КОГДА ДолгиПоДокументамБезУчетаПраздников.КонтролироватьЧислоДнейЗадолженности
			|				И ДолгиПоДокументамБезУчетаПраздников.ДолгПоДоговору > 0
			|				И ДолгиПоДокументамБезУчетаПраздников.ДолгПоВзаиморасчетам > 0
			|			ТОГДА ВЫБОР
			|					КОГДА ВЫБОР
			|							КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов ССЫЛКА Документ.РеализацияТоваровУслуг
			|								ТОГДА ВЫБОР
			|										КОГДА ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты <> 0
			|											ТОГДА ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов.ДопустимоеЧислоДнейОплаты
			|										ИНАЧЕ ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|									КОНЕЦ
			|							ИНАЧЕ ТабДнейПроскочкиПоДокументу.КоличествоДней - ДолгиПоДокументамБезУчетаПраздников.ДопустимоеЧислоДнейЗадолженности
			|						КОНЕЦ > 0
			|						ТОГДА ДолгиПоДокументамБезУчетаПраздников.ДолгПоВзаиморасчетам
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ПросроченоСумма,
			|	ТабДнейПроскочкиПоДокументу.КоличествоДней КАК КоличествоДней
			|ПОМЕСТИТЬ ДолгиПоДокументам
			|ИЗ
			|	ДолгиПоДокументамБезУчетаПраздников КАК ДолгиПоДокументамБезУчетаПраздников
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТабДнейПроскочкиПоДокументу КАК ТабДнейПроскочкиПоДокументу
			|		ПО ДолгиПоДокументамБезУчетаПраздников.ДокументРасчетов = ТабДнейПроскочкиПоДокументу.ДокументРасчетов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОбщийДолг.Контрагент,
			|	Документы.ЗаказПокупателя.Грузополучатель,
			|	ОбщийДолг.ДоговорКонтрагента,
			|	ОбщийДолг.ДолгПоДоговору,
			|	0,
			|	Документы.СуммаПоЗаказам,
			|	Документы.ЗаказПокупателя,
			|	ОбщийДолг.КонтролироватьЧислоДнейЗадолженности,
			|	ОбщийДолг.ДопустимоеЧислоДнейЗадолженности,
			|	0,
			|	0,
			|	1,
			|	0,
			|	0,
			|	0
			|ИЗ
			|	ОбщийДолг КАК ОбщийДолг
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документы КАК Документы
			|		ПО ОбщийДолг.ДоговорКонтрагента = Документы.ДоговорКонтрагента
			|ГДЕ
			|	ЕСТЬNULL(Документы.СуммаПоЗаказам, 0) <> 0
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ОбщийДолг.Контрагент,
			|	ТоварыВСборке.ЗаказПокупателя.Грузополучатель,
			|	ОбщийДолг.ДоговорКонтрагента,
			|	МАКСИМУМ(ОбщийДолг.ДолгПоДоговору),
			|	0,
			|	СУММА(ЕСТЬNULL(ТоварыВСборке.СуммаСобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборке.СуммаКСборкеОстаток, 0)),
			|	ТоварыВСборке.Сборка,
			|	ОбщийДолг.КонтролироватьЧислоДнейЗадолженности,
			|	МАКСИМУМ(ОбщийДолг.ДопустимоеЧислоДнейЗадолженности),
			|	0,
			|	0,
			|	2,
			|	0,
			|	0,
			|	0
			|ИЗ
			|	ОбщийДолг КАК ОбщийДолг
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
			|				,
			|				Контрагент В
			|					(ВЫБРАТЬ
			|						ДокументыПредв.Контрагент
			|					ИЗ
			|						ДокументыПредв КАК ДокументыПредв)) КАК ТоварыВСборке
			|		ПО ОбщийДолг.ДоговорКонтрагента = ТоварыВСборке.ЗаказПокупателя.ДоговорКонтрагента
			|ГДЕ
			|	ЕСТЬNULL(ТоварыВСборке.СуммаСобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборке.СуммаКСборкеОстаток, 0) <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ОбщийДолг.Контрагент,
			|	ОбщийДолг.ДоговорКонтрагента,
			|	ТоварыВСборке.ЗаказПокупателя.Грузополучатель,
			|	ТоварыВСборке.Сборка,
			|	ОбщийДолг.КонтролироватьЧислоДнейЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Документы.Контрагент КАК Контрагент,
			|	Документы.Грузополучатель КАК Грузополучатель,
			|	Документы.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	Документы.СпособДоставки,
			|	Документы.МаршрутДоставки КАК МаршрутДоставки,
			|	Документы.Менеджер КАК Менеджер,
			|	ОбщийДолг.КонтролироватьСуммуЗадолженности,
			|	МАКСИМУМ(ОбщийДолг.МаксСуммаЗадолженности) КАК МаксСуммаЗадолженности,
			|	СУММА(Документы.СуммаПоЗаказам) КАК Собрать,
			|	МАКСИМУМ(ЕСТЬNULL(Таб.СуммаКСборкеОстаток, 0)) КАК Собирается,
			|	МАКСИМУМ(ЕСТЬNULL(Таб.СуммаСобраноОстаток, 0)) КАК Собрано,
			|	ВЫРАЗИТЬ(СУММА(Документы.СуммаПоЗаказам / 100 * ОбщийДолг.ПроцентПредоплаты) КАК ЧИСЛО(15, 2)) КАК НеобходимаяПредоплата,
			|	МАКСИМУМ(ОбщийДолг.ДолгПоДоговору) КАК ДолгПоДоговору
			|ПОМЕСТИТЬ ЗаказСНоменклатурой
			|ИЗ
			|	Документы КАК Документы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ОбщийДолг КАК ОбщийДолг
			|		ПО Документы.Контрагент = ОбщийДолг.Контрагент
			|			И Документы.ДоговорКонтрагента = ОбщийДолг.ДоговорКонтрагента
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ТоварыВСборкеОстатки.ЗаказПокупателя.Грузополучатель КАК ЗаказПокупателяГрузополучатель,
			|			СУММА(ТоварыВСборкеОстатки.СуммаСобраноОстаток) КАК СуммаСобраноОстаток,
			|			СУММА(ТоварыВСборкеОстатки.СуммаКСборкеОстаток) КАК СуммаКСборкеОстаток
			|		ИЗ
			|			РегистрНакопления.ТоварыВСборке.Остатки(
			|					,
			|					(ЗаказПокупателя.СпособДоставки = &СпособДоставки
			|						ИЛИ &ЛюбойСпособДоставки = ИСТИНА)
			|						И Контрагент В
			|							(ВЫБРАТЬ
			|								ДокументыПредв.Контрагент
			|							ИЗ
			|								ДокументыПредв КАК ДокументыПредв)) КАК ТоварыВСборкеОстатки
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ТоварыВСборкеОстатки.ЗаказПокупателя.Грузополучатель) КАК Таб
			|		ПО Документы.Грузополучатель = Таб.ЗаказПокупателяГрузополучатель
			|
			|СГРУППИРОВАТЬ ПО
			|	Документы.Контрагент,
			|	Документы.Грузополучатель,
			|	Документы.ДоговорКонтрагента,
			|	Документы.СпособДоставки,
			|	Документы.МаршрутДоставки,
			|	Документы.Менеджер,
			|	ОбщийДолг.КонтролироватьСуммуЗадолженности
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДолгиПоДокументам.Контрагент КАК Контрагент,
			|	ДолгиПоДокументам.Грузополучатель КАК Грузополучатель,
			|	ДолгиПоДокументам.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	МАКСИМУМ(ДолгиПоДокументам.ПросроченоДней) КАК ПросроченоДней,
			|	1 КАК КодОшибки,
			|	""превышено допустимое число дней задолженности"" КАК ОписаниеОшибки,
			|	0 КАК НеобходимаяПредоплата,
			|	0 КАК Предоплачено,
			|	0 КАК ДолгПоДоговору
			|ПОМЕСТИТЬ Ошибки
			|ИЗ
			|	ДолгиПоДокументам КАК ДолгиПоДокументам
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПроверятьПоБиллингу
			|					И ДолгиПоДокументам.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ДолгиПоДокументам.ПросроченоДней > 0
			|					И ДолгиПоДокументам.КонтролироватьЧислоДнейЗадолженности
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	ДолгиПоДокументам.Контрагент,
			|	ДолгиПоДокументам.Грузополучатель,
			|	ДолгиПоДокументам.ДоговорКонтрагента
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗаказСНоменклатурой.Контрагент,
			|	ЗаказСНоменклатурой.Грузополучатель,
			|	ЗаказСНоменклатурой.ДоговорКонтрагента,
			|	0,
			|	2,
			|	""превышена допустимая сумма задолженности"",
			|	0,
			|	0,
			|	ЗаказСНоменклатурой.ДолгПоДоговору
			|ИЗ
			|	ЗаказСНоменклатурой КАК ЗаказСНоменклатурой
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПроверятьПоБиллингу
			|					И ЗаказСНоменклатурой.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ЗаказСНоменклатурой.МаксСуммаЗадолженности < ЗаказСНоменклатурой.ДолгПоДоговору
			|					И ЗаказСНоменклатурой.КонтролироватьСуммуЗадолженности
			|		КОНЕЦ
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТАБ.Контрагент,
			|	ТАБ.Грузополучатель,
			|	ТАБ.ДоговорКонтрагента,
			|	ТАБ.ПросроченоДней,
			|	ТАБ.КодОшибки,
			|	ТАБ.ОписаниеОшибки,
			|	ТАБ.НеобходимаяПредоплата,
			|	ТАБ.Предоплачено,
			|	ТАБ.ДолгПоДоговору
			|ИЗ
			|	(ВЫБРАТЬ
			|		ЗаказСНоменклатурой.Контрагент КАК Контрагент,
			|		ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузополучатель,
			|		ЗаказСНоменклатурой.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|		0 КАК ПросроченоДней,
			|		3 КАК КодОшибки,
			|		""предоплата недостаточна"" КАК ОписаниеОшибки,
			|		СУММА(ВЫБОР
			|				КОГДА ЗаказСНоменклатурой.НеобходимаяПредоплата < 0
			|					ТОГДА 0
			|				ИНАЧЕ ЗаказСНоменклатурой.НеобходимаяПредоплата
			|			КОНЕЦ) КАК НеобходимаяПредоплата,
			|		СУММА(ВЫБОР
			|				КОГДА ЗаказСНоменклатурой.Собрать - ЗаказСНоменклатурой.ДолгПоДоговору > 0
			|					ТОГДА ЗаказСНоменклатурой.Собрать - ЗаказСНоменклатурой.ДолгПоДоговору
			|				ИНАЧЕ 0
			|			КОНЕЦ) КАК Предоплачено,
			|		МАКСИМУМ(ЗаказСНоменклатурой.ДолгПоДоговору) КАК ДолгПоДоговору
			|	ИЗ
			|		ЗаказСНоменклатурой КАК ЗаказСНоменклатурой
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ЗаказСНоменклатурой.Контрагент,
			|		ЗаказСНоменклатурой.ДоговорКонтрагента) КАК ТАБ
			|ГДЕ
			|	ВЫБОР
			|			КОГДА &ПроверятьПоБиллингу
			|					И ТАБ.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
			|				ТОГДА ЛОЖЬ
			|			ИНАЧЕ ТАБ.НеобходимаяПредоплата > 0
			|					И ТАБ.Предоплачено < ТАБ.НеобходимаяПредоплата
			|		КОНЕЦ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Контрагент,
			|	Грузополучатель,
			|	ДоговорКонтрагента,
			|	КодОшибки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказСНоменклатурой.Контрагент,
			|	ЗаказСНоменклатурой.Грузополучатель КАК Грузополучатель,
			|	ЗаказСНоменклатурой.ДоговорКонтрагента,
			|	ЗаказСНоменклатурой.МаршрутДоставки КАК МаршрутДоставки,
			|	ЗаказСНоменклатурой.СпособДоставки,
			|	ВЫБОР
			|		КОГДА АдресДоставки.Объект ЕСТЬ NULL
			|			ТОГДА """"
			|		ИНАЧЕ ВЫБОР
			|				КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
			|						И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
			|						И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
			|						И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|						И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|					ТОГДА АдресДоставки.Представление
			|				ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
			|						КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
			|							ТОГДА """"
			|						ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
			|					КОНЕЦ + "" "" + ВЫБОР
			|						КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
			|							ТОГДА """"
			|						ИНАЧЕ "" оф."" + АдресДоставки.Поле9
			|					КОНЕЦ + """"
			|			КОНЕЦ
			|	КОНЕЦ КАК АдресДоставки,
			|	ВЫБОР
			|		КОГДА ТелефонМенеджера.Объект ЕСТЬ NULL
			|			ТОГДА """"
			|		ИНАЧЕ ТелефонМенеджера.Представление
			|	КОНЕЦ КАК ТелефонМенеджера,
			|	ЗаказСНоменклатурой.Собрать КАК Сумма,
			|	ЗаказСНоменклатурой.Собирается,
			|	ЗаказСНоменклатурой.Собрано,
			|	ЗаказСНоменклатурой.Менеджер,
			|	ЗаказСНоменклатурой.НеобходимаяПредоплата,
			|	ЗаказСНоменклатурой.ДолгПоДоговору
			|ИЗ
			|	ЗаказСНоменклатурой КАК ЗаказСНоменклатурой
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
			|		ПО (АдресДоставки.Объект = ЗаказСНоменклатурой.Грузополучатель)
			|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
			|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонМенеджера
			|		ПО (ТелефонМенеджера.Объект = ЗаказСНоменклатурой.Менеджер)
			|			И (ТелефонМенеджера.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
			|			И (ТелефонМенеджера.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
			|ГДЕ
			|	(&КонтролироватьМинСуммуДоставки = ЛОЖЬ
			|			ИЛИ ЗаказСНоменклатурой.Собрать + ЗаказСНоменклатурой.Собирается + ЗаказСНоменклатурой.Собрано >= ЗаказСНоменклатурой.Грузополучатель.МинимальнаяСуммаДоставки)
			|	И (&НеФильтроватьПоДолгам
			|			ИЛИ НЕ (ЗаказСНоменклатурой.Контрагент, ЗаказСНоменклатурой.ДоговорКонтрагента) В
			|					(ВЫБРАТЬ
			|						Ошибки.Контрагент,
			|						Ошибки.ДоговорКонтрагента
			|					ИЗ
			|						Ошибки КАК Ошибки
			|					ГДЕ
			|						(Ошибки.КодОшибки = 2
			|							ИЛИ Ошибки.КодОшибки = 3
			|							ИЛИ Ошибки.КодОшибки = 1)))
			|
			|УПОРЯДОЧИТЬ ПО
			|	МаршрутДоставки,
			|	Грузополучатель
			|АВТОУПОРЯДОЧИВАНИЕ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказСНоменклатурой.Контрагент,
			|	ЗаказСНоменклатурой.Грузополучатель КАК Грузополучатель,
			|	ЗаказСНоменклатурой.ДоговорКонтрагента,
			|	ЗаказСНоменклатурой.МаршрутДоставки,
			|	ЗаказСНоменклатурой.Собрать КАК Сумма,
			|	ЗаказСНоменклатурой.Собирается,
			|	ЗаказСНоменклатурой.Собрано,
			|	ЗаказСНоменклатурой.Грузополучатель.МинимальнаяСуммаДоставки КАК МинимальнаяСуммаДоставки,
			|	ВЫБОР
			|		КОГДА Ошибки.КодОшибки ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ Ошибки.ПросроченоДней
			|	КОНЕЦ КАК КоличествоДнейЗадолженности,
			|	ВЫБОР
			|		КОГДА Ошибки1.КодОшибки ЕСТЬ NULL
			|			ТОГДА """"
			|		ИНАЧЕ Ошибки1.ОписаниеОшибки
			|	КОНЕЦ КАК ПревышенаДопустимаяСумма,
			|	ВЫБОР
			|		КОГДА Ошибки2.НеобходимаяПредоплата ЕСТЬ NULL
			|			ТОГДА """"
			|		ИНАЧЕ Ошибки2.НеобходимаяПредоплата
			|	КОНЕЦ КАК НеобходимаяПредоплата,
			|	ВЫБОР
			|		КОГДА Ошибки2.ДолгПоДоговору ЕСТЬ NULL
			|			ТОГДА """"
			|		ИНАЧЕ Ошибки2.Предоплачено
			|	КОНЕЦ КАК Оплачено
			|ИЗ
			|	ЗаказСНоменклатурой КАК ЗаказСНоменклатурой
			|		ЛЕВОЕ СОЕДИНЕНИЕ Ошибки КАК Ошибки
			|		ПО ЗаказСНоменклатурой.Контрагент = Ошибки.Контрагент
			|			И ЗаказСНоменклатурой.Грузополучатель = Ошибки.Грузополучатель
			|			И ЗаказСНоменклатурой.ДоговорКонтрагента = Ошибки.ДоговорКонтрагента
			|			И (Ошибки.КодОшибки = 1)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Ошибки КАК Ошибки1
			|		ПО ЗаказСНоменклатурой.Контрагент = Ошибки1.Контрагент
			|			И ЗаказСНоменклатурой.Грузополучатель = Ошибки1.Грузополучатель
			|			И ЗаказСНоменклатурой.ДоговорКонтрагента = Ошибки1.ДоговорКонтрагента
			|			И (Ошибки1.КодОшибки = 2)
			|		ЛЕВОЕ СОЕДИНЕНИЕ Ошибки КАК Ошибки2
			|		ПО ЗаказСНоменклатурой.Контрагент = Ошибки2.Контрагент
			|			И ЗаказСНоменклатурой.ДоговорКонтрагента = Ошибки2.ДоговорКонтрагента
			|			И (Ошибки2.КодОшибки = 3)
			|ГДЕ
			|	(&КонтролироватьМинСуммуДоставки = ИСТИНА
			|				И ЗаказСНоменклатурой.Собрать + ЗаказСНоменклатурой.Собирается + ЗаказСНоменклатурой.Собрано < ЗаказСНоменклатурой.Грузополучатель.МинимальнаяСуммаДоставки
			|			ИЛИ НЕ Ошибки2.НеобходимаяПредоплата ЕСТЬ NULL)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Грузополучатель
			|АВТОУПОРЯДОЧИВАНИЕ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОбщийДолг.Контрагент КАК Контрагент,
			|	ОбщийДолг.ДоговорКонтрагента,
			|	МАКСИМУМ(ОбщийДолг.ДолгПоДоговору) КАК ДолгПоДоговору,
			|	ОбщийДолг.ДолгПоВзаиморасчетам,
			|	МАКСИМУМ(ОбщийДолг.ДопустимоеЧислоДнейЗадолженности) КАК ДопустимоеЧислоДнейЗадолженности,
			|	ОбщийДолг.МаксСуммаЗадолженности,
			|	ЕСТЬNULL(ДнейПросрочкиПоКонтрагенту.ПросроченоДней, 0) КАК ПросроченоДней
			|ИЗ
			|	ОбщийДолг КАК ОбщийДолг
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ДолгиПоДокументам.Контрагент КАК Контрагент,
			|			МАКСИМУМ(ДолгиПоДокументам.ПросроченоДней) КАК ПросроченоДней
			|		ИЗ
			|			ДолгиПоДокументам КАК ДолгиПоДокументам
			|		ГДЕ
			|			НЕ ДолгиПоДокументам.ДокументРасчетов ССЫЛКА Документ.ЗаказПокупателя
			|			И НЕ ДолгиПоДокументам.ДокументРасчетов ССЫЛКА Документ.СборкаЗаказовПокупателя
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ДолгиПоДокументам.Контрагент) КАК ДнейПросрочкиПоКонтрагенту
			|		ПО ОбщийДолг.Контрагент = ДнейПросрочкиПоКонтрагенту.Контрагент
			|ГДЕ
			|	ОбщийДолг.ДолгПоДоговору > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	ОбщийДолг.Контрагент,
			|	ОбщийДолг.ДоговорКонтрагента,
			|	ОбщийДолг.ДолгПоВзаиморасчетам,
			|	ОбщийДолг.МаксСуммаЗадолженности,
			|	ДнейПросрочкиПоКонтрагенту.ПросроченоДней
			|
			|УПОРЯДОЧИТЬ ПО
			|	Контрагент
			|АВТОУПОРЯДОЧИВАНИЕ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДолгиПоДокументам.Контрагент,
			|	ДолгиПоДокументам.Грузополучатель,
			|	ДолгиПоДокументам.ДоговорКонтрагента,
			|	ДолгиПоДокументам.ДолгПоДоговору,
			|	ДолгиПоДокументам.ДолгПоВзаиморасчетам,
			|	ДолгиПоДокументам.ДолгПоДок КАК ДолгПоДокументу,
			|	ДолгиПоДокументам.ДокументРасчетов,
			|	ДолгиПоДокументам.ПросроченоДней,
			|	ДолгиПоДокументам.ПросроченоСумма,
			|	ДолгиПоДокументам.ПараметрСортировки,
			|	ЛОЖЬ КАК ОтправленВФормирование
			|ИЗ
			|	ДолгиПоДокументам КАК ДолгиПоДокументам
			|ГДЕ
			|	ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг ИЛИ ДолгиПоДокументам.ДолгПоДоговору > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДолгиПоДокументам.Контрагент КАК Контрагент,
			|	ДолгиПоДокументам.ДолгПоДоговору КАК ДолгПоДоговору,
			|	ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(100)) КАК ЕМэйл
			|ИЗ
			|	ДолгиПоДокументам КАК ДолгиПоДокументам
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПисьмоОДолгах КАК ПисьмоОДолгах
			|		ПО (ПисьмоОДолгах.ДоговорКонтрагента = ДолгиПоДокументам.ДоговорКонтрагента)
			|			И (ПисьмоОДолгах.Период МЕЖДУ &НачалоСегодняшнегоДня И &ОкончаниеСегодняшнегоДня)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|		ПО ДолгиПоДокументам.Грузополучатель = КонтактнаяИнформация.Объект
			|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
			|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами))
			|ГДЕ
			|	НЕ ДолгиПоДокументам.Контрагент.НеПосылатьУведомлениеОДолгах
			|	И ЕСТЬNULL(ПисьмоОДолгах.Количество, 0) = 0
			|	И ДолгиПоДокументам.ДолгПоВзаиморасчетам > 0
			|	И НЕ ДолгиПоДокументам.ДокументРасчетов ССЫЛКА Документ.СборкаЗаказовПокупателя
			|	И НЕ ДолгиПоДокументам.ДокументРасчетов ССЫЛКА Документ.ЗаказПокупателя
			|
			|УПОРЯДОЧИТЬ ПО
			|	Контрагент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	0 КАК Отметка,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата КАК Дата,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК Заказ,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Комментарий КАК Комментарий
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Остатки(
			|			,
			|			(ЗаказПокупателя.СпособДоставки = &СпособДоставки
			|				ИЛИ &ЛюбойСпособДоставки = ИСТИНА)
			|				И (ЗаказПокупателя.Грузополучатель.МаршрутДоставки В (&СписокФильтрМаршрутов)
			|					ИЛИ &ЛюбойМаршрут = ИСТИНА)
			|				И (ЗаказПокупателя.Организация = &Организация
			|					ИЛИ &ЛюбаяОрганизация = ИСТИНА)
			|				И ТолькоРезерв
			|				И НЕ ЗаказПокупателя.СкладскойЗаказ) КАК ЗаказыПокупателейОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Дата КАК Дата,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Контрагент КАК Контрагент,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Грузополучатель КАК Грузополучатель,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК Заказ,
			|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Ответственный КАК Ответственный
			|ИЗ
			|	РегистрНакопления.ЗаказыПокупателей.Остатки(
			|			,
			|			(ЗаказПокупателя.СпособДоставки = &СпособДоставки
			|				ИЛИ &ЛюбойСпособДоставки = ИСТИНА)
			|				И (ЗаказПокупателя.Грузополучатель.МаршрутДоставки В (&СписокФильтрМаршрутов)
			|					ИЛИ &ЛюбойМаршрут = ИСТИНА)
			|				И (ЗаказПокупателя.Организация = &Организация
			|					ИЛИ &ЛюбаяОрганизация = ИСТИНА)
			|				И ЗаказПокупателя.СкладскойЗаказ) КАК ЗаказыПокупателейОстатки";

	Запрос.УстановитьПараметр("СпособДоставки",ТипДоставки);
	Запрос.УстановитьПараметр("ЛюбойСпособДоставки", НЕ ЗначениеЗаполнено(ТипДоставки));
	
	Запрос.УстановитьПараметр("СписокФильтрМаршрутов",СписокФильтрМаршрутов);		  
	Запрос.УстановитьПараметр("ЛюбойМаршрут", (СписокФильтрМаршрутов.Количество() = 0 ИЛИ ТипДоставки = Перечисления.СпособДоставки.Самовывоз) 
	                                            И (НЕ ЭтоРегламент ИЛИ (ЭтоРегламент И ТипДоставки = Перечисления.СпособДоставки.Самовывоз)));
	
	Запрос.УстановитьПараметр("СписокОчередейДоставки",СписокОчередейДоставки);		  
	Запрос.УстановитьПараметр("ЛюбаяОчередьДоставки", (СписокОчередейДоставки.Количество() = 0 ИЛИ ТипДоставки = Перечисления.СпособДоставки.Самовывоз) 
	                                            И (НЕ ЭтоРегламент ИЛИ (ЭтоРегламент И ТипДоставки = Перечисления.СпособДоставки.Самовывоз)));
	
	Запрос.УстановитьПараметр("СтрокаФильтрДнейНедели",СтрокаФильтрДнейНедели);
	Запрос.УстановитьПараметр("ЛюбоеРасписание", НЕ ЗначениеЗаполнено(СтрокаФильтрДнейНедели) ИЛИ ТипДоставки = Перечисления.СпособДоставки.Самовывоз);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ЛюбаяОрганизация", НЕ ЗначениеЗаполнено(Организация));
	
	Запрос.УстановитьПараметр("ЭтоРучнойРежим", НЕ ЭтоРегламент);
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоСегодняшнегоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ОкончаниеСегодняшнегоДня", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонтролироватьМинСуммуДоставки", КонтролироватьМинСуммуДоставки И ТипДоставки = Перечисления.СпособДоставки.НашаДоставка);
	Запрос.УстановитьПараметр("РабочийДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ПредпраздничныйДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);	
	
	Запрос.УстановитьПараметр("НеФильтроватьПоДолгам", Константы.ОтправкаНаСборкуБезПредоплатыДляСамовывоза.Получить() И ТипДоставки = Перечисления.СпособДоставки.Самовывоз);
	Запрос.УстановитьПараметр("ПроверятьПоБиллингу", Константы.НовыйВидДолговВОбработкеСозданияСборок.Получить()); 
	Запрос.УстановитьПараметр("ИспользоватьДатуОтгрузкиИзЗаказа", Константы.ИспользоватьДатуОтгрузкиИзЗаказа.Получить()); 
	Запрос.УстановитьПараметр("ЭтоРегламент", ЭтоРегламент);
	Запрос.УстановитьПараметр("НачинаемСобиратьНаЗавтра", НачинаемСобиратьНаЗавтра);
	Запрос.УстановитьПараметр("ДобавитьДней", ?(ДеньНедели(ТекущаяДата()) = 6, 2, 1));
	Запрос.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
	Запрос.УстановитьПараметр("ДеньНеделиЧисло", пДеньНедели);
	Запрос.УстановитьПараметр("ВремяОтправкиНаСамовывоз", ВремяОтправкиНаСамовывоз);
	Запрос.УстановитьПараметр("ПараметрВремяОчереди", ПараметрВремяОчереди); 
	//+Кабанов А.В. 28.03.2025 # UT10-5142
	Запрос.УстановитьПараметр("УправленческаяОрганизация",Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	//-Кабанов А.В. 28.03.2025 # UT10-5142

	Если ТаблРезультат = Неопределено Тогда
		
		ТаблРезультат = Новый ТаблицаЗначений;
		ТаблРезультат.Колонки.Добавить("МаршрутДоставки", Новый ОписаниеТипов("СправочникСсылка.МаршрутыДоставки"));
		ТаблРезультат.Колонки.Добавить("Очередь", Новый ОписаниеТипов("СправочникСсылка.ОчередьДоставки"));
		
	КонецЕсли;
	
	ЗапросВременнойТаблицы = Новый Запрос;
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗапросВременнойТаблицы.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросВременнойТаблицы.Текст =
	"ВЫБРАТЬ
	|	МаршрутыОчереди.МаршрутДоставки,
	|	МаршрутыОчереди.Очередь
	|ПОМЕСТИТЬ вт_Маршруты
	|ИЗ
	|	&МаршрутыОчереди КАК МаршрутыОчереди
	//+Сёмин Р.И. 17.07.2026 #UT10-5955
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя КАК ЗаказПокупателяМарк
	|ПОМЕСТИТЬ ЗаказыСМаркировкойПоУпрОрганизации
	|ИЗ
	|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
	|		,
	|		ЗаказПокупателя.Организация = &УправленческаяОрганизация
	|			И Номенклатура.ТребуетсяМаркировка) КАК ТоварыГотовыеКСборкеОстатки
	//-Сёмин Р.И. 17.07.2026 #UT10-5955
	|";
	
	ЗапросВременнойТаблицы.УстановитьПараметр("МаршрутыОчереди", ТаблРезультат);
	
	//+Сёмин Р.И. 17.07.2026 #UT10-5955
	ЗапросВременнойТаблицы.УстановитьПараметр("УправленческаяОрганизация", Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	//-Сёмин Р.И. 17.07.2026 #UT10-5955

	ЗапросВременнойТаблицыРезультат = ЗапросВременнойТаблицы.Выполнить();
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;

	Возврат Истина;

КонецФункции 

Процедура ВыполнитьИзРегламентногоЗадания() Экспорт 
	
	Отказ = Ложь;
	МаксимальноеКоличествоНесобранныхСборок = Константы.МаксимальноеКоличествоНесобранныхСборок.Получить();
	СоздатьДокументовШтук = 0;
	
	Если МаксимальноеКоличествоНесобранныхСборок > 0 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СборкаЗаказовПокупателя.Ссылка) КАК КоличествоНезакрытыхСборок
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
		|ГДЕ
		|	СборкаЗаказовПокупателя.Проведен
		|	И СборкаЗаказовПокупателя.Дата >= &НачалоТекущегоДня
		|	И НЕ СборкаЗаказовПокупателя.ДокументСобранИУпакован
		|	И НЕ СборкаЗаказовПокупателя.ПолностьюОткорректирована";
		
		Запрос.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДата()));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.КоличествоНезакрытыхСборок >= МаксимальноеКоличествоНесобранныхСборок Тогда 
				Отказ = Истина;
			Иначе
				СоздатьДокументовШтук = МаксимальноеКоличествоНесобранныхСборок - ВыборкаДетальныеЗаписи.КоличествоНезакрытыхСборок;
			КонецЕсли;
			
			Прервать;
			
		КонецЦикла;

	КонецЕсли;		  
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		
		Если ВыполнитьПроверку(Запрос, Ложь, Истина,Ложь,Ложь) = Ложь Тогда 
			Возврат;
		КонецЕсли;			
		
		Пакет = Запрос.ВыполнитьПакет();
		
		//документы отгрузки
		ТабДокументов = Пакет[10].Выгрузить();
		ТабДокументов.Колонки.Добавить("Принудительно", Новый ОписаниеТипов("Булево"));
		
		Если ТабДокументов.Количество() <> 0 Тогда 
			СоздатьДокументы(ТабДокументов, Истина, СоздатьДокументовШтук);
		КонецЕсли;

		ПараметрТекущееВремя = Дата('00010101') + (ТекущаяДата()-НачалоДня(ТекущаяДата()));
		НачинаемСобиратьНаЗавтра = Ложь;
		ПромВремяНачалаДоставкиНаЗавтра = Константы.ВремяНачалаДоставкиНаЗавтра.Получить();
		ПромВремяНачалаДоставкиНаЗавтраДляСубботы = Константы.ВремяНачалаДоставкиНаЗавтраДляСубботы.Получить();

		//+Гавриленков В. 31.10.2024 #UT10-4855
		//пДеньНедели = ДеньНедели(ТекущаяДата());
		//
		//Если пДеньНедели = 6 Тогда
		//	пДеньНедели = ПроверитьСубботу(ТекущаяДата());
		//КонецЕсли;
		
		пДеньНедели = МСК.ПолучитьДеньПоКалендарю(ТекущаяДата());
		//-Гавриленков В. 31.10.2024 #UT10-4855		

		Если пДеньНедели = 6 Тогда
			
			Если   ЗначениеЗаполнено(ПромВремяНачалаДоставкиНаЗавтраДляСубботы) И ПромВремяНачалаДоставкиНаЗавтраДляСубботы < ПараметрТекущееВремя Тогда 
				НачинаемСобиратьНаЗавтра = Истина;
			КонецЕсли;
			// воскресенье	  
			
		//+Гавриленков В. 24.11.2023 #UT10-4077
		//ИначеЕсли пДеньНедели = 7 Тогда	
		//	НачинаемСобиратьНаЗавтра = Истина;
		//-Гавриленков В. 24.11.2023 #UT10-4077	
			
		Иначе
			
			Если ЗначениеЗаполнено(ПромВремяНачалаДоставкиНаЗавтра) И ПромВремяНачалаДоставкиНаЗавтра < ПараметрТекущееВремя Тогда 
				НачинаемСобиратьНаЗавтра = Истина;
			КонецЕсли;
			
		КонецЕсли;

		Если НЕ НачинаемСобиратьНаЗавтра Тогда  			
			
			ЗапросМаршрутов = Новый Запрос;
			ЗапросМаршрутов.Текст = 
			"ВЫБРАТЬ
			|	МаршрутыДоставки.Ссылка
			|ИЗ
			|	Справочник.МаршрутыДоставки КАК МаршрутыДоставки
			|ГДЕ
			|	МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра <= &ТекущееВремя
			|	И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";

			Если пДеньНедели = 6 Тогда
				
				ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра <= &ТекущееВремя", "МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтраДляСубботы <= &ТекущееВремя");
				ЗапросМаршрутов.Текст = СтрЗаменить(ЗапросМаршрутов.Текст, "И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтра = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)", "И НЕ МаршрутыДоставки.ВремяНачалаСозданияСборокНаЗавтраДляСубботы = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)");
				
			КонецЕсли;
			
			ЗапросМаршрутов.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
			РезультатЗапросаМаршрутов = ЗапросМаршрутов.Выполнить();
			НачинаемСобиратьНаЗавтра = НЕ РезультатЗапросаМаршрутов.Пустой();
			
		КонецЕсли;

		Если НачинаемСобиратьНаЗавтра Тогда
			
			Запрос = Новый Запрос;
			
			Если ВыполнитьПроверку(Запрос, Ложь, Истина,Ложь,Истина) = Ложь Тогда 
				Возврат;
			КонецЕсли;			
			
			Пакет = Запрос.ВыполнитьПакет();
			
			//документы отгрузки
			ТабДокументов = Пакет[10].Выгрузить();
			ТабДокументов.Колонки.Добавить("Принудительно", Новый ОписаниеТипов("Булево"));
			
			Если ТабДокументов.Количество() <> 0 Тогда 
				СоздатьДокументы(ТабДокументов, Истина, СоздатьДокументовШтук, Ложь, Истина);
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры // ВыполнитьИзРегламентногоЗадания()

Процедура ОтправитьПисьмоСошибкой(ПромДокСборка, ОписаниеОшибки = "") Экспорт
	
	Возврат;
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Почта = Новый ИнтернетПочта; 
	УдалосьПодключиться = Ложь;
	
	Попытка
		Почта.Подключиться(Профиль);
		УдалосьПодключиться = Истина;
	Исключение
	КонецПопытки;
	
	Если УдалосьПодключиться Тогда
		
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "Ошибка создания сборки";
		Сообщение.Получатели.Добавить(УчетнаяЗапись.АдресЭлектроннойПочты); 
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		ТекстСообщенияПисьма = "Не удалось создать докумиент сборка для "+СокрЛП(ПромДокСборка.Грузополучатель.Наименование)+" на дату "+Формат(ПромДокСборка.Грузополучатель,"ДФ=dd.MM.yyyy")+"";
		ТекстСообщенияПисьма = ТекстСообщенияПисьма+Символы.ПС+СокрЛП(ОписаниеОшибки);
		Сообщение.Тексты.Добавить(ТекстСообщенияПисьма);
		
		Попытка
			Почта.Послать(Сообщение);
		Исключение
		КонецПопытки; 		
		
		Сообщение.Получатели.Очистить();
		Сообщение.Вложения.Очистить(); 		
		
	КонецЕсли;	

КонецПроцедуры

Процедура СоздатьДокументы(ТаблПоле, ЭтоРегламент, СоздатьДокументовШтук = 0, Биллинг = Ложь, НачинаемСобиратьНаЗавтра = Ложь,
	//+Шульман А. 24.02.2025 #UT10-5103 
	МассивСборок = Неопределено
	//-Шульман А. 24.02.2025 #UT10-5103
	) Экспорт 
	
	ЯчейкаДоВыяснения = Константы.ЯчейкаДоВыяснения.Получить();
	
	ИспользоватьДатуОтгрузкиИзЗаказа = Константы.ИспользоватьДатуОтгрузкиИзЗаказа.Получить(); 
	
	СозданоДокументов = 0;   
	
	//+Шульман А. 24.02.2025 #UT10-5103 
	МассивСборок = Новый Массив;
	//-Шульман А. 24.02.2025 #UT10-5103
	
	
	Для каждого ТекСтр Из ТаблПоле Цикл
		
		Если НЕ ЭтоРегламент И НЕ ТекСтр.Отметка Тогда 
			Продолжить; 
		КонецЕсли;
		
		Если СоздатьДокументовШтук > 0 Тогда 
			Если СоздатьДокументовШтук <= СозданоДокументов Тогда 
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		ПараметрВремяОчереди = ТекущаяДата();
		ПараметрТекущееВремя = Дата('00010101') + (ТекущаяДата()-НачалоДня(ТекущаяДата())); 

		ЗапросМаксимальногоВремениОчереди = Новый Запрос;
		ЗапросМаксимальногоВремениОчереди.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(ОчередьДоставки.ВремяОкончанияОтправки) КАК ВремяОкончанияОтправки
		|ИЗ
		|	Справочник.ОчередьДоставки КАК ОчередьДоставки
		|ГДЕ
		|	НЕ ОчередьДоставки.ПометкаУдаления
		|	И ОчередьДоставки.ВремяНачалаОтправки <= &ТекущееВремя
		|	И ОчередьДоставки.ВремяОкончанияОтправки >= &ТекущееВремя
		|
		|СГРУППИРОВАТЬ ПО
		|	ОчередьДоставки.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВремяОкончанияОтправки УБЫВ";
		
		ЗапросМаксимальногоВремениОчереди.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
		
		Результат = ЗапросМаксимальногоВремениОчереди.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			ПараметрВремяОчереди = НачалоДня(ТекущаяДата()) + Час(Выборка.ВремяОкончанияОтправки) * 60 * 60 + Минута(Выборка.ВремяОкончанияОтправки) * 60;
			
		КонецЕсли;
		
		Если ЭтоРегламент Тогда
			
			//+Гавриленков В. 31.10.2024 #UT10-4855
			//пДеньНедели = ДеньНедели(ТекущаяДата());
			//
			//Если пДеньНедели = 6 Тогда
			//	пДеньНедели = ПроверитьСубботу(ТекущаяДата());
			//КонецЕсли;
			
			пДеньНедели = МСК.ПолучитьДеньПоКалендарю(ТекущаяДата());
			//-Гавриленков В. 31.10.2024 #UT10-4855	
			
		Иначе
			пДеньНедели = ДеньНеделиЧисло;
		КонецЕсли;

		ВремяОтправкиНаСамовывоз = ТекущаяДата() + (Константы.ВремяОтправкиНаСамовывоз.Получить() * 60);

		Для Н = 1 По 2 Цикл
			
			Запрос = Новый Запрос;		  
			Запрос.Текст ="
			|ВЫБРАТЬ
			|	Контрагенты.СоздаватьСборки,
			|	МинимальнаяОчередь.ОчередьВремяОкончанияОтправки,
			|	ТекущаяОчередь.ОчередьВремяОкончанияОтправки КАК ТекущееВремяОкончанияОтправки
			|ПОМЕСТИТЬ СпособСборки
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты,
			|	(ВЫБРАТЬ
			|		МИНИМУМ(КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки) КАК ОчередьВремяОкончанияОтправки
			|	ИЗ
			|		Справочник.Контрагенты.ОчередиДоставки КАК КонтрагентыОчередиДоставки
			|	ГДЕ
			|		КонтрагентыОчередиДоставки.Ссылка = &Грузополучатель) КАК МинимальнаяОчередь,
			|	(ВЫБРАТЬ
			|		МАКСИМУМ(КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки) КАК ОчередьВремяОкончанияОтправки
			|	ИЗ
			|		Справочник.Контрагенты.ОчередиДоставки КАК КонтрагентыОчередиДоставки
			|	ГДЕ
			|		КонтрагентыОчередиДоставки.Ссылка = &Грузополучатель
			|		И КонтрагентыОчередиДоставки.Очередь.ВремяНачалаОтправки <= &ТекущееВремя
			|		И КонтрагентыОчередиДоставки.Очередь.ВремяОкончанияОтправки >= &ТекущееВремя) КАК ТекущаяОчередь
			|ГДЕ
			|	Контрагенты.Ссылка = &Грузополучатель
			|
			|СГРУППИРОВАТЬ ПО
			|	Контрагенты.СоздаватьСборки,
			|	МинимальнаяОчередь.ОчередьВремяОкончанияОтправки,
			|	ТекущаяОчередь.ОчередьВремяОкончанияОтправки
			|;
			|   			
			|//////////////////////////////////////////////////////////////////////////////// 			
			|
			|ВЫБРАТЬ
			|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя КАК Заказ,
			|	ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.СкладГруппа КАК Склад,
			|	ТоварыГотовыеКСборкеОстатки.Номенклатура КАК Номенклатура,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) - (ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) <> 0
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) - (ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) < ТоварыГотовыеКСборкеОстатки.КоличествоОстаток
			|						ТОГДА ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) - (ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0))
			|					ИНАЧЕ ТоварыГотовыеКСборкеОстатки.КоличествоОстаток
			|				КОНЕЦ
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Количество,
			|	ТоварыГотовыеКСборкеОстатки.Назначение
			|ПОМЕСТИТЬ НоменклатураПоЗаказам
			|ИЗ
			|	РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
			|			,
			|				&УсловиеПоРегистрам = Истина) КАК ТоварыГотовыеКСборкеОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки(
			|				,
			|				НЕ ТолькоРезерв И 
			|				 &УсловиеПоРегистрам = Истина) КАК ЗаказыПокупателейОстатки
			|		ПО ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя = ЗаказыПокупателейОстатки.ЗаказПокупателя
			|			И ТоварыГотовыеКСборкеОстатки.Номенклатура = ЗаказыПокупателейОстатки.Номенклатура
			|           И ТоварыГотовыеКСборкеОстатки.Назначение = ЗаказыПокупателейОстатки.Назначение
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
			|				,
			|				&УсловиеПоРегистрам = Истина) КАК ТоварыВСборкеОстатки
			|		ПО ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя = ТоварыВСборкеОстатки.ЗаказПокупателя
			|			И ТоварыГотовыеКСборкеОстатки.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
			|			И ТоварыГотовыеКСборкеОстатки.Назначение = ТоварыВСборкеОстатки.Назначение,
			|		СпособСборки КАК СпособСборки
			|ГДЕ
			|   &УсловиеВидаОплаты = Истина
			|	И ТоварыГотовыеКСборкеОстатки.КоличествоОстаток > 0
			|	И ЗаказыПокупателейОстатки.КоличествоОстаток > 0
			|	И ВЫБОР
			|		КОГДА &ИспользоватьДатуОтгрузкиИзЗаказа = ИСТИНА
			|		ТОГДА ВЫБОР
			|		КОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
			|		ТОГДА ВЫБОР
			|		КОГДА &НачинаемСобиратьНаЗавтра = ИСТИНА
			|		ТОГДА ВЫБОР
			|		КОГДА &ДеньНеделиЧисло = 7
			|		ТОГДА НАЧАЛОПЕРИОДА(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ) <= ДОБАВИТЬКДАТЕ(&ОкончаниеСегодняшнегоДня, ДЕНЬ, &ДобавитьДней)
			|	ИНАЧЕ НАЧАЛОПЕРИОДА(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки, ДЕНЬ) <= ДОБАВИТЬКДАТЕ(&ОкончаниеСегодняшнегоДня, ДЕНЬ, &ДобавитьДней)
			|		И (ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки >= &ОкончаниеСегодняшнегоДня
			|		И СпособСборки.ОчередьВремяОкончанияОтправки >= ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЧАС, ЧАС(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки)), МИНУТА, МИНУТА(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки)))
			|		ИЛИ ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки < &ТекущаяДата
			|		КОНЕЦ
			|	ИНАЧЕ ВЫБОР
			|		КОГДА &ЭтоРегламент = ИСТИНА
			|		ТОГДА СпособСборки.ТекущееВремяОкончанияОтправки >= ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0), ЧАС, ЧАС(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки)), МИНУТА, МИНУТА(ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки))
			|				И ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки < &ОкончаниеСегодняшнегоДня
			|			  ИЛИ ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки <= &ТекущаяДата	
			|	ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|		КОНЕЦ
			|	ИНАЧЕ ВЫБОР
			|		КОГДА &ЭтоРегламент = ИСТИНА
			|		ТОГДА ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ДатаОтгрузки <= &ВремяОтправкиНаСамовывоз
			|	ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|		КОНЕЦ
			|	ИНАЧЕ ИСТИНА
			|		КОНЕЦ   			
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТоварыВЯчейкахОстатки.Склад КАК Склад,
			|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
			|	ТоварыВЯчейкахОстатки.Ячейка,
			|	ТоварыВЯчейкахОстатки.ГМ,
			|	ВЫБОР
			|		КОГДА СпособСборки.СоздаватьСборки = ЗНАЧЕНИЕ(Перечисление.СоздаватьСборки.БезРазбивки)
			|			ТОГДА 0
			|		ИНАЧЕ ВЫБОР
			|		КОГДА СпособСборки.СоздаватьСборки = ЗНАЧЕНИЕ(Перечисление.СоздаватьСборки.РазбиватьПоСекциям)
			|			ТОГДА ТоварыВЯчейкахОстатки.Ячейка.НаименованиеЭтажа
			|		ИНАЧЕ ТоварыВЯчейкахОстатки.Ячейка.Этаж
			|		КОНЕЦ
			|	КОНЕЦ КАК Этаж,
			|	ТоварыВЯчейкахОстатки.Ячейка.ПриоритетСписывания КАК ПриоритетСписывания,
			|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Количество
			|ПОМЕСТИТЬ ОстаткиПоЯчейкам
			|ИЗ
			|	РегистрНакопления.ТоварыВЯчейках.Остатки(
			|			,
			|			(Номенклатура, Склад) В
			|				(ВЫБРАТЬ
			|					НоменклатураПоЗаказам.Номенклатура,
			|					НоменклатураПоЗаказам.Склад
			|				ИЗ
			|					НоменклатураПоЗаказам КАК НоменклатураПоЗаказам
			|				ГДЕ
			|					НоменклатураПоЗаказам.Количество > 0)) КАК ТоварыВЯчейкахОстатки,
			|	СпособСборки КАК СпособСборки
			|ГДЕ
			|	ТоварыВЯчейкахОстатки.Ячейка.Этаж <> 0
			|	И ТоварыВЯчейкахОстатки.Ячейка <> &ЯчейкаДоВыяснения
			|	И ТоварыВЯчейкахОстатки.КоличествоОстаток > 0
			|	И ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураПоЗаказам.Склад КАК Склад,
			|	НоменклатураПоЗаказам.Заказ КАК Заказ,
			|	НоменклатураПоЗаказам.Номенклатура КАК Номенклатура,
			|	НоменклатураПоЗаказам.Количество КАК Количество,
			|	НоменклатураПоЗаказам.Назначение
			|ИЗ
			|	НоменклатураПоЗаказам КАК НоменклатураПоЗаказам
			|
			|СГРУППИРОВАТЬ ПО
			|	НоменклатураПоЗаказам.Заказ,
			|	НоменклатураПоЗаказам.Назначение,
			|	НоменклатураПоЗаказам.Номенклатура,
			|	НоменклатураПоЗаказам.Склад,
			|	НоменклатураПоЗаказам.Количество
			|
			|УПОРЯДОЧИТЬ ПО
			|	Склад,
			|	Назначение,
			|	Заказ,
			|	Номенклатура
			|АВТОУПОРЯДОЧИВАНИЕ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ОстаткиПоЯчейкам.Склад,
			|	ОстаткиПоЯчейкам.Этаж КАК Этаж,
			|	ОстаткиПоЯчейкам.Номенклатура КАК Номенклатура,
			|	ОстаткиПоЯчейкам.Ячейка,
			|	ОстаткиПоЯчейкам.ГМ,
			|	ОстаткиПоЯчейкам.ПриоритетСписывания КАК ПриоритетСписывания,
			|	ОстаткиПоЯчейкам.Количество
			|ИЗ
			|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,
			|	ПриоритетСписывания УБЫВ,
			|	Этаж
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиПоЯчейкам.Этаж) КАК Этаж
			|ИЗ
			|	ОстаткиПоЯчейкам КАК ОстаткиПоЯчейкам";
			
			УсловиеВидаОплаты = "ТоварыГотовыеКСборкеОстатки.ЗаказПокупателя.ОплатаНаличными = " + ?(н = 1, "ИСТИНА", "ЛОЖЬ");
			
			//+Белов А. 15.12.2025 #UT10-5582
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидаОплаты = Истина", УсловиеВидаОплаты);
			//-Белов А. 15.12.2025 #UT10-5582
			
			Если НЕ ЭтоРегламент И ЗначениеЗаполнено(ТекСтр.ЗаказНаСборку) Тогда
				
				Запрос.УстановитьПараметр("ЗаказНаСборку", ТекСтр.ЗаказНаСборку);
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистрам = Истина", " ЗаказПокупателя В(&ЗаказНаСборку)");
				
			Иначе
				
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистрам = Истина", " ЗаказПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента И ЗаказПокупателя.Грузополучатель = &Грузополучатель И ЗаказПокупателя.СпособДоставки = &СпособДоставки");
				Запрос.УстановитьПараметр("ДоговорКонтрагента", 	ТекСтр.ДоговорКонтрагента);				
				Запрос.УстановитьПараметр("СпособДоставки", 		ТипДоставки);		  
				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Грузополучатель", 		ТекСтр.Грузополучатель);
			Запрос.УстановитьПараметр("ЯчейкаДоВыяснения",   	 	ЯчейкаДоВыяснения);
			Запрос.УстановитьПараметр("ИспользоватьДатуОтгрузкиИзЗаказа",  	ИспользоватьДатуОтгрузкиИзЗаказа);
			Запрос.УстановитьПараметр("НачинаемСобиратьНаЗавтра",       	НачинаемСобиратьНаЗавтра);			
			Запрос.УстановитьПараметр("ТекущаяДата",						ТекущаяДата());
			Запрос.УстановитьПараметр("НачалоСегодняшнегоДня",				НачалоДня(ТекущаяДата()));	
			Запрос.УстановитьПараметр("ДеньНеделиЧисло", пДеньНедели); 
			//+Гавриленков В. 01.11.2024 #UT10-4855
			//Запрос.УстановитьПараметр("ДобавитьДней", ?(пДеньНедели = 6, 2, 1));
			Запрос.УстановитьПараметр("ДобавитьДней", ?(ДеньНедели(ТекущаяДата()) = 6, 2, 1));
			//-Гавриленков В. 01.11.2024 #UT10-4855
			Запрос.УстановитьПараметр("ВремяОтправкиНаСамовывоз", ВремяОтправкиНаСамовывоз);
			Запрос.УстановитьПараметр("ОкончаниеСегодняшнегоДня", КонецДня(ТекущаяДата()));
			Запрос.УстановитьПараметр("ЭтоРегламент", ЭтоРегламент);
			Запрос.УстановитьПараметр("ПараметрВремяОчереди", ПараметрВремяОчереди);			
			Запрос.УстановитьПараметр("ТекущееВремя", ПараметрТекущееВремя);
						
			Пакет = Запрос.ВыполнитьПакет();  
			ТЗТоваров = Пакет[3].Выгрузить();
			ТЗЯчейки = Пакет[4].Выгрузить();
			
			Если ТЗТоваров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоВозможныхЭтажей = Пакет[5].Выгрузить()[0].Этаж;
			
			ТЗ = Новый ТаблицаЗначений;
			ТЗ.Колонки.Добавить("Этаж");
			ТЗ.Колонки.Добавить("Заказ");
			ТЗ.Колонки.Добавить("Номенклатура");
			ТЗ.Колонки.Добавить("Ячейка");
			ТЗ.Колонки.Добавить("Количество");
			ТЗ.Колонки.Добавить("Склад"); 
			ТЗ.Колонки.Добавить("Назначение");
			ТЗ.Колонки.Добавить("ГМ");
						
			ТЗ_ПерваяОчередь = Новый ТаблицаЗначений;
			ТЗ_ПерваяОчередь.Колонки.Добавить("Склад");
			ТЗ_ПерваяОчередь.Колонки.Добавить("Этаж");
			ТЗ_ПерваяОчередь.Колонки.Добавить("Номенклатура");
			ТЗ_ПерваяОчередь.Колонки.Добавить("Ячейка");
			ТЗ_ПерваяОчередь.Колонки.Добавить("ПриоритетСписывания");
			ТЗ_ПерваяОчередь.Колонки.Добавить("Количество");
			ТЗ_ПерваяОчередь.Колонки.Добавить("ИндексСтроки");
			ТЗ_ПерваяОчередь.Колонки.Добавить("ГМ");
			
			ТЗ_ВтораяОчередь = ТЗ_ПерваяОчередь.Скопировать();
			
			ФлагСоздаватьДокументы = Истина;
			
			ПроверятьНаКратность = НачалоДня(Константы.ДатаНачалаПроверкиКратностиНоменклатуры.Получить()) <= НачалоДня(ТекущаяДата()); ; 
			
			Для Каждого СтрТоваров Из ТЗТоваров Цикл
				
				Если НЕ Константы.НеПроверятьКратностьНоменклатурыПриФормированииПриказовНаСборку.Получить() Тогда
					
					Если ПроверятьНаКратность И НЕ ЗначениеЗаполнено(СтрТоваров.Заказ.IDСклада_СтороннийСклад) И МСК.ПроверкаНоменклатурыНаКратность(СтрТоваров.Номенклатура,СтрТоваров.Количество) = Ложь 
						//+Марков И. 18.04.2024 #UT10-4347
						И НЕ СтрТоваров.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
						//-Марков И. 18.04.2024 #UT10-4347
						#Если Клиент Тогда
							Сообщить("В заказе : " + СтрТоваров.Заказ + "  для  номенклатуры : " + СтрТоваров.Номенклатура + " НАРУШЕНИЕ КРАТНОСТИ!!", СтатусСообщения.Внимание);
						#КонецЕсли
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
				МассивГрузомест = Неопределено;
				
				Если СтрТоваров.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
					МассивГрузомест = Справочники.СобственныеСклады.ПолучитьМассивГрузоместПоЗаказу(СтрТоваров.Заказ);				
				КонецЕсли;
				
				СтруктураПоиска = Новый Структура("Номенклатура,Склад");
				СтруктураПоиска.Номенклатура 	= СтрТоваров.Номенклатура;
				СтруктураПоиска.Склад 			= СтрТоваров.Склад;  
				
				ТЗ_ПерваяОчередь.Очистить();
				ТЗ_ВтораяОчередь.Очистить();
				
				НайденныеСтроки = ТЗЯчейки.НайтиСтроки(СтруктураПоиска); 
				
				Для Каждого СтрПоиска Из НайденныеСтроки Цикл
					
					Если СтрТоваров.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
						
						Если МассивГрузомест.Найти(СтрПоиска.ГМ) = Неопределено Тогда
							Продолжить;							
						КонецЕсли; 
						
					Иначе
						
						Если ЗначениеЗаполнено(СтрПоиска.ГМ) Тогда
							Продолжить;	
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрПоиска.Количество = 0 Тогда 
						Продолжить;
					КонецЕсли;
					
					Если СтрПоиска.Количество >= СтрТоваров.Количество Тогда 
						
						НоваяСтрокаПоиска = ТЗ_ПерваяОчередь.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПоиска, СтрПоиска);
						
					ИначеЕсли СтрПоиска.Количество < СтрТоваров.Количество И СтрПоиска.Количество > 0 Тогда 
						
						НоваяСтрокаПоиска = ТЗ_ВтораяОчередь.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаПоиска, СтрПоиска);
						
					КонецЕсли; 
					
					НоваяСтрокаПоиска.ИндексСтроки = ТЗЯчейки.Индекс(СтрПоиска);
					
				КонецЦикла;
				
				ТЗ_ПерваяОчередь.Сортировать("ПриоритетСписывания,Этаж");
				ТЗ_ВтораяОчередь.Сортировать("ПриоритетСписывания,Этаж");
				
				// сначала списываем с ячеек, в которых лежит подходящее нам количество товара
				Для Каждого Стр Из ТЗ_ПерваяОчередь Цикл  
					
					Если Стр.Количество = 0 Тогда 
						Продолжить;
					КонецЕсли;					  
					
					СписатьИзЯчейки = Мин(Стр.Количество,СтрТоваров.Количество);  
					
					НоваяСтрока = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр,, "Количество"); 
					НоваяСтрока.Количество = СписатьИзЯчейки;
					НоваяСтрока.Заказ = СтрТоваров.Заказ;
					
					СтрТоваров.Количество = СтрТоваров.Количество - СписатьИзЯчейки;  
					НоваяСтрока.Назначение = СтрТоваров.Назначение;  
										
					ТЗЯчейки[Стр.ИндексСтроки].Количество = ТЗЯчейки[Стр.ИндексСтроки].Количество - СписатьИзЯчейки;
					
					Если СтрТоваров.Количество <= 0 Тогда
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				// теперь списываем с ячеек, товара в которых полностью нам не хватает
				Если СтрТоваров.Количество > 0 Тогда 
					
					Для Каждого Стр Из ТЗ_ВтораяОчередь Цикл  
						
						Если Стр.Количество = 0 Тогда 
							Продолжить;
						КонецЕсли;					  
						
						СписатьИзЯчейки = Мин(Стр.Количество, СтрТоваров.Количество);  
						
						НоваяСтрока = ТЗ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр,, "Количество"); 
						НоваяСтрока.Количество = СписатьИзЯчейки;
						НоваяСтрока.Заказ = СтрТоваров.Заказ;
						Стр.Количество = Стр.Количество - СписатьИзЯчейки;
						СтрТоваров.Количество = СтрТоваров.Количество - СписатьИзЯчейки; 
						НоваяСтрока.Назначение = СтрТоваров.Назначение;
												
						ТЗЯчейки[Стр.ИндексСтроки].Количество = ТЗЯчейки[Стр.ИндексСтроки].Количество - СписатьИзЯчейки;
						
						Если СтрТоваров.Количество <= 0 Тогда
							Прервать;
						КонецЕсли;
						
					КонецЦикла;
					
					Если СтрТоваров.Количество > 0 Тогда
						
						Если НЕ ЭтоРегламент Тогда
							Сообщить("Для контрагента : " +  ТекСтр.Контрагент + ", по складу '" + СтрТоваров.Склад + "', по " + СтрТоваров.Заказ 
							+ " товара:" + СтрТоваров.Номенклатура.Артикул + " " + СтрТоваров.Номенклатура + 
							" недостаточно в доступных для списания ячейках. " + Символы.ПС + "Не хватает " + СтрТоваров.Количество + " ед. ", СтатусСообщения.Внимание);
						КонецЕсли;	  
						
						Если НЕ Константы.НеПроверятьКратностьНоменклатурыПриФормированииПриказовНаСборку.Получить() Тогда 
							
							// еще раз проверим на кратность недосписанный остаток
							Если ПроверятьНаКратность И НЕ ЗначениеЗаполнено(СтрТоваров.Заказ.IDСклада_СтороннийСклад) 
								//+Марков И. 18.04.2024 #UT10-4347
								И НЕ СтрТоваров.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
								//-Марков И. 18.04.2024 #UT10-4347
								И МСК.ПроверкаНоменклатурыНаКратность(СтрТоваров.Номенклатура, СтрТоваров.Количество) = Ложь Тогда
								
								Если НЕ ЭтоРегламент Тогда
									
									Сообщить("В заказе : " +  СтрТоваров.Заказ + "  для  номенклатуры : " +  СтрТоваров.Номенклатура + " НАРУШЕНИЕ КРАТНОСТИ!!", СтатусСообщения.Внимание);
									Сообщить("Сборка создана не будет!",СтатусСообщения.Внимание);
									
								КонецЕсли;
								
								СтрНоменклатураКУдалению = ТЗ.НайтиСтроки(Новый Структура("Номенклатура", СтрТоваров.Номенклатура));
								
								Для каждого ЭлМассива Из СтрНоменклатураКУдалению Цикл
									ТЗ.Удалить(ЭлМассива);
								КонецЦикла;						  
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЦикла;  			
			
			КоличествоСтрокВДокументе = Константы.МаксимальноеЧислоСтрокВДокументеСборка.Получить();
			РежимПроведения = РежимЗаписиДокумента.Проведение; 
				
			УпаковатьСамовывоз = ТекСтр.Грузополучатель.УпаковыватьСамовывоз;  
			ТЗ.Колонки.Добавить("УпаковыватьСамовывоз", Новый ОписаниеТипов("Булево"));
			ТЗ.Колонки.Добавить("ТаксиДоставка", Новый ОписаниеТипов("Булево"));
			ТЗ.Колонки.Добавить("ОбособленнаяОтгрузка", Новый ОписаниеТипов("Булево"));
			ТЗ.Колонки.Добавить("ДоговорПоставщикаТОХ", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
			//+Белов А. 15.12.2025 #UT10-5582
			ТЗ.Колонки.Добавить("Маркировка", Новый ОписаниеТипов("Булево"));
			//-Белов А. 15.12.2025 #UT10-5582

			Для Каждого СтрокаТЗ Из ТЗ Цикл
				
				СтрокаТЗ.УпаковыватьСамовывоз = СтрокаТЗ.Заказ.УпаковыватьСамовывоз;
				СтрокаТЗ.ТаксиДоставка = СтрокаТЗ.Заказ.ТаксиДоставка;	
				СтрокаТЗ.ОбособленнаяОтгрузка = СтрокаТЗ.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала; 
				СтрокаТЗ.ДоговорПоставщикаТОХ = СтрокаТЗ.Заказ.ДоговорПоставщикаТОХ;   
				
				//+Белов А. 15.12.2025 #UT10-5582
				СтрокаТЗ.Маркировка = ?(ТекСтр.Грузополучатель.РазделятьРТУПоМаркировке, СтрокаТЗ.Номенклатура.ТребуетсяМаркировка, Ложь);	
				//-Белов А. 15.12.2025 #UT10-558 
	
			КонецЦикла;				
			
			Если ТекСтр.Грузополучатель.НеОбъединятьЗаказы Тогда
				//+Белов А. 15.12.2025 #UT10-5582 - добавил Маркировка
				ТЗ.Сортировать("Этаж, Склад, Назначение, Маркировка, ОбособленнаяОтгрузка, Заказ, Номенклатура"); 				
			Иначе 
				
				Если УпаковатьСамовывоз Тогда
					//+Белов А. 15.12.2025 #UT10-5582 - добавил Маркировка
					ТЗ.Сортировать("Этаж, Склад, Назначение, Маркировка, ОбособленнаяОтгрузка, УпаковыватьСамовывоз, ТаксиДоставка, Номенклатура");	
				Иначе
					
					Если ТекСтр.Грузополучатель.ПополнениеТОХ Тогда 
						//+Белов А. 15.12.2025 #UT10-5582 - добавил Маркировка
						ТЗ.Сортировать("Этаж, Склад, Назначение, Маркировка, ОбособленнаяОтгрузка, ДоговорПоставщикаТОХ, Номенклатура");
					Иначе
						//+Белов А. 15.12.2025 #UT10-5582 - добавил Маркировка
						ТЗ.Сортировать("Этаж, Склад, Назначение, Маркировка, ОбособленнаяОтгрузка, ТаксиДоставка, Номенклатура");
					КонецЕсли;
					
				КонецЕсли;

				КопияТЗ = ТЗ.Скопировать(,"Заказ");
				КопияТЗ.Свернуть("Заказ");
				КопияТЗ.Колонки.Добавить("ДатаОтгрузки");
				
				Для Каждого СтрокаТЗДат Из КопияТЗ Цикл
					СтрокаТЗДат.ДатаОтгрузки = СтрокаТЗДат.Заказ.ДатаОтгрузки;
				КонецЦикла;				
				
				КопияТЗ.Сортировать("ДатаОтгрузки Возр");
				
				Если КопияТЗ.Количество() > 0 Тогда
					ДатаОтгрузки  = КопияТЗ[0].ДатаОтгрузки;					
				КонецЕсли;
				
			КонецЕсли; 
			
			ТекЭтаж = Неопределено;
			ТекСклад = Неопределено;
			ДокСборка = Неопределено;
			ТекЗаказ = Неопределено;
			ТекУпаковка = ЛОЖЬ;
			ТекНазначение = Неопределено; 
			//+Белов А. 15.12.2025 #UT10-5582
			ТекМаркировка = Неопределено;
			//-Белов А. 15.12.2025 #UT10-5582
			ТекОбособленнаяОтгрузка = Неопределено; 
			ТекДоговорПоставщикаТОХ = Неопределено;   
						
			Если ТекСтр.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
				
				//При создании сборки с признаком типом доставки «Самовывоз» не делить по этажам, делить только по максимальному числу строк в Сборке.
				Для Каждого Стр ИЗ ТЗ Цикл
					
					Если ТекСклад <> Стр.Склад Тогда 
						
						Если ДокСборка <> Неопределено Тогда
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);  
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     

						КонецЕсли; 					
						
						ТекЗаказ = Неопределено;
						ТекУпаковка = Стр.УпаковыватьСамовывоз;
						ТекТаксиДоставка = Стр.ТаксиДоставка;
						ТекСклад = Стр.Склад; 
						//+Белов А. 15.12.2025 #UT10-5582
						ТекМаркировка = Стр.Маркировка;
						//-Белов А. 15.12.2025 #UT10-5582
						
						Если НЕ ТекСтр.Грузополучатель.НеОбъединятьЗаказы Тогда	  
							
							ДокСборка = СоздатьНовыйДокументСборка(ТекСтр,ТекущаяДата(),Стр.УпаковыватьСамовывоз,Стр.ТаксиДоставка);
							
							//+Пашкин О. 21.05.2025 #UT10-5188 
							Если ТекДоговорПоставщикаТОХ <> Стр.ДоговорПоставщикаТОХ Тогда
								
								ТекДоговорПоставщикаТОХ = Стр.ДоговорПоставщикаТОХ; 								
								ДокСборка.ДоговорПоставщикаТОХ = ТекДоговорПоставщикаТОХ; 
								
							КонецЕсли;    
							//-Пашкин О. 21.05.2025 #UT10-5188 
							
						КонецЕсли;  						
						
					КонецЕсли;

					Если (ТекСтр.Грузополучатель.НеОбъединятьЗаказы И ТекЗаказ <> Стр.Заказ) 
						ИЛИ (УпаковатьСамовывоз И ТекУпаковка <> Стр.УпаковыватьСамовывоз)  
						ИЛИ (ТекТаксиДоставка <> Стр.ТаксиДоставка) 
						//+Белов А. 15.12.2025 #UT10-5582
						ИЛИ (ТекМаркировка <> Стр.Маркировка) 
						//-Белов А. 15.12.2025 #UT10-5582
						Тогда

						ТекЗаказ = Стр.Заказ;
						ТекУпаковка = Стр.УпаковыватьСамовывоз;
						ТекТаксиДоставка = Стр.ТаксиДоставка;
						ДатаОтгрузки = ТекЗаказ.ДатаОтгрузки; 
						//+Белов А. 15.12.2025 #UT10-5582
						ТекМаркировка = Стр.Маркировка;
						//-Белов А. 15.12.2025 #UT10-5582
						
						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент); 
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     
							
						КонецЕсли;                                     
						
						//+Белов А. 15.12.2025 #UT10-5582 добавил передачу параметра Маркировка
						ДокСборка = СоздатьНовыйДокументСборка(ТекСтр, ТекущаяДата(), Стр.УпаковыватьСамовывоз, Стр.ТаксиДоставка,,, Стр.Маркировка);
						
						//+Пашкин О. 21.05.2025 #UT10-5188 
						Если ТекДоговорПоставщикаТОХ <> Стр.ДоговорПоставщикаТОХ Тогда
							
							ТекДоговорПоставщикаТОХ = Стр.ДоговорПоставщикаТОХ;							
							ДокСборка.ДоговорПоставщикаТОХ = ТекДоговорПоставщикаТОХ; 
							
						КонецЕсли;    
						//-Пашкин О. 21.05.2025 #UT10-5188 
						
					КонецЕсли;
					
					Если КоличествоСтрокВДокументе <> 0 И Стр.Заказ.КроссДокинг = Ложь И ДокСборка.Заказано.Количество() >= КоличествоСтрокВДокументе Тогда
						
						ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);   
						
						//+Шульман А. 21.02.2025 #UT10-5103     
						МассивСборок.Добавить(ДокСборка.Ссылка);  
						//-Шульман А. 21.02.2025 #UT10-5103     
						
						//+Белов А. 15.12.2025 #UT10-5582 добавил передачу параметра Маркировка
						ДокСборка = СоздатьНовыйДокументСборка(ТекСтр, ТекущаяДата(), Стр.УпаковыватьСамовывоз, Стр.ТаксиДоставка,,, Стр.Маркировка);
						
						//+Пашкин О. 21.05.2025 #UT10-5188 
						Если ТекДоговорПоставщикаТОХ <> Стр.ДоговорПоставщикаТОХ Тогда
							
							ТекДоговорПоставщикаТОХ = Стр.ДоговорПоставщикаТОХ;							
							ДокСборка.ДоговорПоставщикаТОХ = ТекДоговорПоставщикаТОХ; 
							
						КонецЕсли;    
						//-Пашкин О. 21.05.2025 #UT10-5188 
						
				  КонецЕсли;
					
					НоваяСтрока = ДокСборка.Заказано.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);  

					Если ЗначениеЗаполнено(НоваяСтрока.ГМ) Тогда
						
						НоваяСтрока.Факт = НоваяСтрока.Количество;	 
						НоваяСтрока.Подборка = Перечисления.ПодборкаНоменклатуры.Собрано; 
						
					КонецЕсли;					
					
				КонецЦикла;
				
				Если ДокСборка <> Неопределено Тогда 
					
					ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);  
					
					//+Шульман А. 21.02.2025 #UT10-5103     
					МассивСборок.Добавить(ДокСборка.Ссылка);  
					//-Шульман А. 21.02.2025 #UT10-5103     
					
				КонецЕсли;
				
			Иначе   

				Для Каждого Стр ИЗ ТЗ Цикл
					
					Если ТекЭтаж <> Стр.Этаж И НЕ Стр.Заказ.КроссДокинг Тогда
						
						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);       
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     
							
						КонецЕсли;
						
						ТекЭтаж = Стр.Этаж;
						ТекСклад = Неопределено;
						ТекЗаказ = Неопределено;
						ДокСборка = Неопределено;
						ТекНазначение = Неопределено;
						//+Белов А. 15.12.2025 #UT10-5582
						ТекМаркировка = Неопределено;
						//-Белов А. 15.12.2025 #UT10-5582
						ТекОбособленнаяОтгрузка = Неопределено;
						ТекДоговорПоставщикаТОХ  = Неопределено;   
						
						
					КонецЕсли;   
					
					Если ТекСклад <> Стр.Склад Тогда 
						
						ТекСклад = Стр.Склад;
						ТекНазначение = Неопределено;  
						//+Белов А. 15.12.2025 #UT10-5582
						ТекМаркировка = Неопределено;
						//-Белов А. 15.12.2025 #UT10-5582
						ТекОбособленнаяОтгрузка = Неопределено;
						ТекЗаказ = Неопределено;
						ТекДоговорПоставщикаТОХ = Неопределено;
						
						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);    
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     
							
						КонецЕсли; 
						
						ДокСборка = Неопределено;    
						
					КонецЕсли;
					
					Если ТекНазначение <> Стр.Назначение Тогда
						
						ТекНазначение = Стр.Назначение; 
						//+Белов А. 15.12.2025 #UT10-5582
						ТекМаркировка = Неопределено;
						//-Белов А. 15.12.2025 #UT10-5582
						ТекОбособленнаяОтгрузка = Неопределено;
						ТекЗаказ = Неопределено;     
						ТекДоговорПоставщикаТОХ  = Неопределено;

						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент); 
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     
							
						КонецЕсли;
						
						ДокСборка = Неопределено;     
						
					КонецЕсли;    
					
					//+Белов А. 15.12.2025 #UT10-5582
					Если ТекМаркировка <> Стр.Маркировка Тогда
						
						ТекМаркировка = Стр.Маркировка;
						ТекОбособленнаяОтгрузка = Неопределено;
						ТекЗаказ = Неопределено;     
						ТекДоговорПоставщикаТОХ  = Неопределено;

						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент); 
							
							МассивСборок.Добавить(ДокСборка.Ссылка);     
							
						КонецЕсли;
						
						ДокСборка = Неопределено;     
						
					КонецЕсли; 
					//-Белов А. 15.12.2025 #UT10-5582
										
					Если ТекОбособленнаяОтгрузка <> Стр.ОбособленнаяОтгрузка Тогда
						
						ТекОбособленнаяОтгрузка = Стр.ОбособленнаяОтгрузка; 
						ТекЗаказ = Неопределено;     
						ТекДоговорПоставщикаТОХ  = Неопределено;

						Если ДокСборка <> Неопределено Тогда 
							
							ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);  
							
							//+Шульман А. 21.02.2025 #UT10-5103     
							МассивСборок.Добавить(ДокСборка.Ссылка);  
							//-Шульман А. 21.02.2025 #UT10-5103     
							
						КонецЕсли;
						
						ДокСборка = Неопределено;
						
						Если Не ТекСтр.Грузополучатель.НеОбъединятьЗаказы И НЕ ТекСтр.Грузополучатель.ПополнениеТОХ Тогда
							
							//+Белов А. 15.12.2025 #UT10-5582 добавил ТекМаркировка
							ДокСборка = СоздатьНовыйДокументСборка(ТекСтр, ДатаОтгрузки,,, ТекНазначение, Стр.ДоговорПоставщикаТОХ, ТекМаркировка);
							
						КонецЕсли;       
						
					КонецЕсли;					
					
					Если ТекСтр.Грузополучатель.ПополнениеТОХ Тогда 
						
						Если ТекДоговорПоставщикаТОХ <> Стр.ДоговорПоставщикаТОХ Тогда
							
							ТекДоговорПоставщикаТОХ = Стр.ДоговорПоставщикаТОХ; 
							ТекЗаказ = Стр.Заказ;
							ДатаОтгрузки = ТекЗаказ.ДатаОтгрузки;
							
							Если ДокСборка <> Неопределено Тогда 
								
								ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);  
								
								//+Шульман А. 21.02.2025 #UT10-5103     
								МассивСборок.Добавить(ДокСборка.Ссылка);  
								//-Шульман А. 21.02.2025 #UT10-5103     
								
							КонецЕсли;     
							
							//+Белов А. 15.12.2025 #UT10-5582 добавил ТекМаркировка  
							ДокСборка = СоздатьНовыйДокументСборка(ТекСтр,ДатаОтгрузки,,, ТекНазначение, Стр.ДоговорПоставщикаТОХ, ТекМаркировка);  
							
						КонецЕсли;
						
					Иначе
						
						Если ТекСтр.Грузополучатель.НеОбъединятьЗаказы И ТекЗаказ <> Стр.Заказ Тогда
							
							ТекЗаказ = Стр.Заказ;
							ДатаОтгрузки = ТекЗаказ.ДатаОтгрузки;
							
							Если ДокСборка <> Неопределено Тогда 
								
								ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);  
								
								//+Шульман А. 21.02.2025 #UT10-5103     
								МассивСборок.Добавить(ДокСборка.Ссылка);  
								//-Шульман А. 21.02.2025 #UT10-5103     
								
							КонецЕсли;     
							
							//+Белов А. 15.12.2025 #UT10-5582 добавил ТекМаркировка
							ДокСборка = СоздатьНовыйДокументСборка(ТекСтр,ДатаОтгрузки,,, ТекНазначение, Стр.ДоговорПоставщикаТОХ, ТекМаркировка);   
							
						КонецЕсли;	
						
					КонецЕсли;
					
					Если КоличествоСтрокВДокументе <> 0 И Стр.Заказ.КроссДокинг = Ложь 
						И Стр.ОбособленнаяОтгрузка = Ложь 
						И ДокСборка.Заказано.Количество() >= КоличествоСтрокВДокументе Тогда 
						
						ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);   
						//+Шульман А. 21.02.2025 #UT10-5103     
						МассивСборок.Добавить(ДокСборка.Ссылка);  
						//-Шульман А. 21.02.2025 #UT10-5103     
						
						СозданоДокументов = СозданоДокументов + 1;
						//+Белов А. 15.12.2025 #UT10-5582 добавил ТекМаркировка
						ДокСборка = СоздатьНовыйДокументСборка(ТекСтр,ДатаОтгрузки,,, ТекНазначение, Стр.ДоговорПоставщикаТОХ, ТекМаркировка);  
						
					КонецЕсли;
					
					НоваяСтрока = ДокСборка.Заказано.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр); 
					
					Если ЗначениеЗаполнено(НоваяСтрока.ГМ) Тогда
						
						НоваяСтрока.Факт = НоваяСтрока.Количество;	 
						НоваяСтрока.Подборка = Перечисления.ПодборкаНоменклатуры.Собрано; 
						
					КонецЕсли;					
					
				КонецЦикла; 
				
				Если ДокСборка <> Неопределено Тогда 
					
					ПроверитьИЗаписатьДокументСборки(ДокСборка, ТекСтр.Принудительно, РежимПроведения, ЭтоРегламент);    
					
					//+Шульман А. 21.02.2025 #UT10-5103     
					МассивСборок.Добавить(ДокСборка.Ссылка);  
					//-Шульман А. 21.02.2025 #UT10-5103     
					
					СозданоДокументов = СозданоДокументов + 1; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;   
		
	КонецЦикла;      
	
	СоздатьДокументовШтук = СоздатьДокументовШтук - СозданоДокументов; 
	
КонецПроцедуры

//+Пашкин О. 21.05.2025 #UT10-5188 
//Функция СоздатьНовыйДокументСборка(ТекСтр, ДатаОтгрузки, мУпаковыватьСамовывоз = Ложь, мТаксиДоставка = Ложь, Назначение = Неопределено) Экспорт
Функция СоздатьНовыйДокументСборка(ТекСтр, ДатаОтгрузки, мУпаковыватьСамовывоз = Ложь, мТаксиДоставка = Ложь, Назначение = Неопределено, ДоговорПоставщикаТОХ = Неопределено, Маркировка = Ложь) Экспорт
//-Пашкин О. 21.05.2025 #UT10-5188 
	
	ГУИД = Новый УникальныйИдентификатор();
	РезСсылка = Документы.СборкаЗаказовПокупателя.ПолучитьСсылку(ГУИД);
	Объект = РезСсылка.ПолучитьОбъект();
	ДокСборка = Документы.СборкаЗаказовПокупателя.СоздатьДокумент();
	
	Если Объект = Неопределено Тогда
		ДокСборка.УстановитьСсылкуНового(РезСсылка);
	КонецЕсли;
	
	Если Константы.ОтправкаНаСборкуБезПредоплатыДляСамовывоза.Получить() И ТекСтр.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда
		
		ДокСборка.ДокументСобранИУпакован = Истина; 
		ДокСборка.КоличествоУпаковочныхМест = 1;
		
	КонецЕсли;
	
	ДокСборка.Назначение = Назначение;
	ДокСборка.Контрагент 		   = ТекСтр.Контрагент;
	ДокСборка.Грузополучатель 	   = ТекСтр.Грузополучатель; 
	ДокСборка.Договор 			   = ТекСтр.ДоговорКонтрагента;
	ДокСборка.СпособДоставки 	   = ТекСтр.СпособДоставки;
	ДокСборка.МаршрутДоставки 	   = ?(ТекСтр.СпособДоставки = Перечисления.СпособДоставки.Самовывоз, Справочники.МаршрутыДоставки.ПустаяСсылка(), ДокСборка.Грузополучатель.МаршрутДоставки);	
	ДокСборка.Дата 				   = ТекущаяДата();
	ДокСборка.ВремяНачалаСборки    = ТекущаяДата();
	ДокСборка.ДатаДоставкиКлиенту  = ?(ЗначениеЗаполнено(ДатаОтгрузки), ДатаОтгрузки, ТекущаяДата());
	ДокСборка.Организация 		   = ТекСтр.ДоговорКонтрагента.Организация; 
	ДокСборка.УпаковыватьСамовывоз = мУпаковыватьСамовывоз;
	ДокСборка.ТаксиДоставка = мТаксиДоставка;  
	
	//+Пашкин О. 21.05.2025 #UT10-5188 
	Если ЗначениеЗаполнено(ДоговорПоставщикаТОХ) Тогда 
		ДокСборка.ДоговорПоставщикаТОХ = ДоговорПоставщикаТОХ;
	КонецЕсли;
	//-Пашкин О. 21.05.2025 #UT10-5188
	
	//+Белов А. 15.12.2025 #UT10-5582
	ДокСборка.ТребуетсяМаркировка = Маркировка;
	//-Белов А. 15.12.2025 #UT10-5582
	
	Возврат ДокСборка;
	
КонецФункции 

Функция ПроверитьИЗаписатьДокументСборки(ДокСборка, Принудительно, РежимПроведения, ЭтоРегламент) Экспорт

	Если ДокСборка.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда
		ДокСборка.ДатаДоставкиКлиенту = ТекущаяДата();
	Иначе
		
		КопияТЗ = ДокСборка.Заказано.Выгрузить(, "Заказ");
		КопияТЗ.Свернуть("Заказ");
		КопияТЗ.Колонки.Добавить("ДатаОтгрузки");
		
		Для Каждого СтрокаТЗДат Из КопияТЗ Цикл
			СтрокаТЗДат.ДатаОтгрузки = СтрокаТЗДат.Заказ.ДатаОтгрузки;
		КонецЦикла;				
		
		КопияТЗ.Сортировать("ДатаОтгрузки Возр");
		
		Если КопияТЗ.Количество()> 0 Тогда
			ДокСборка.ДатаДоставкиКлиенту = КопияТЗ[0].ДатаОтгрузки;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ДокСборка.ДатаДоставкиКлиенту) Тогда 
			ДокСборка.ДатаДоставкиКлиенту = ТекущаяДата(); 
		КонецЕсли;
		
	КонецЕсли;
	
	ОтправлятьВБиллинг = Константы.AMQP_ВыгружатьДанные.Получить() И ДокСборка.Договор.ВыгружаетсяВБиллинг; 	
	ПроверятьЧерезБиллинг = Константы.AMQP_ПроверятьВзаиморасчетыЧерезБиллинг.Получить() И ДокСборка.Договор.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг;  

	Если ОтправлятьВБиллинг Тогда
		
		СборкаУспешна = Ложь;
		Принудительно = НЕ ПроверятьЧерезБиллинг Или Принудительно;
		РезПроверка = AMQP_РаботаСДокументами.ПроверкаДокументаВБиллинге(ДокСборка, Принудительно);	

		Если РезПроверка.Результат = 0 Тогда
			
			Попытка
				
				ДокСборка.Записать(РежимПроведения); 
				
				// см. определение переменной ПредДоговор в модуле обеъекта документа СборкаЗаказовПокупателя
				ДокСборкаСсылка = ДокСборка.Ссылка;
				ДокСборка = ДокСборкаСсылка.ПолучитьОбъект();
				
				СоздатьГрузоместаДляСборкиПоОбособленнымОтгрузкам(ДокСборка);
				СборкаУспешна = Истина;
				
			Исключение
				
				Если ЭтоРегламент Тогда
					
					ОтправитьПисьмоСошибкой(ДокСборка, СокрЛП(ОписаниеОшибки()));
					ЗаписьЖурналаРегистрации("Создание сборок. Ошибка", УровеньЖурналаРегистрации.Предупреждение, , , 
					"Не удалось провести документ сборка: " + Строка(ДокСборка) + Символы.ПС + ОписаниеОшибки());
					
				КонецЕсли;
				
			КонецПопытки;

		ИначеЕсли РезПроверка.Результат = 2 И НЕ ПроверятьЧерезБиллинг Тогда

			Попытка
				
				ДокСборка.Записать(РежимПроведения); 
				СоздатьГрузоместаДляСборкиПоОбособленнымОтгрузкам(ДокСборка);
				СборкаУспешна = Истина;
				
			Исключение
				
				Если ЭтоРегламент Тогда
					ОтправитьПисьмоСошибкой(ДокСборка,РезПроверка.Сообщение); 
					ЗаписьЖурналаРегистрации("Создание сборок. Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
					"Не удалось провести документ сборка: " + Строка(ДокСборка) + Символы.ПС + ОписаниеОшибки());
				КонецЕсли;
				
			КонецПопытки;	
			
		Иначе
			
			Если НЕ ЭтоРегламент Тогда
				Сообщить("Проверка сборки - "+РезПроверка.Сообщение); 
			Иначе
				ЗаписьЖурналаРегистрации("Создание сборок. Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
				"Документ не прошел проверку в Биллинге ." + Символы.ПС + РезПроверка.Сообщение);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СборкаУспешна Тогда
			
			РезПодтверждение = AMQP_РаботаСДокументами.ПодтверждениеДокументаВБиллинге(ДокСборка); 
			
			Если НЕ РезПодтверждение.Результат = 0 Тогда
				
				Попытка
					
					ДокСборка.УстановитьПометкуУдаления(Истина);					
					
					Если ЭтоРегламент Тогда
						
						ОтправитьПисьмоСошибкой(ДокСборка,РезПодтверждение.Сообщение);
						ЗаписьЖурналаРегистрации("Создание сборок. Ошибка", УровеньЖурналаРегистрации.Предупреждение, , ,
						"Не получено подтверждение от Биллинга , документ помечен на удаление: " + Строка(ДокСборка) + Символы.ПС + РезПодтверждение.Сообщение);
						
					Иначе
						Сообщить("Подтверждение сборки - "+РезПроверка.Сообщение);
					КонецЕсли;					
					
				Исключение		
				КонецПопытки;
				
			КонецЕсли;

		КонецЕсли;

	Иначе
		
		Попытка
			
			ДокСборка.Записать(РежимПроведения);  
			СоздатьГрузоместаДляСборкиПоОбособленнымОтгрузкам(ДокСборка);
			
		Исключение
			
			Если ЭтоРегламент Тогда
				ОтправитьПисьмоСошибкой(ДокСборка);
			КонецЕсли;
			
		КонецПопытки;		
		
	КонецЕсли;

	Если НЕ ЭтоРегламент И ЗначениеЗаполнено(ДокСборка.ВерсияДанных) Тогда
		Сообщить("Создан и проведен документ : " + ДокСборка);
	КонецЕсли;       

КонецФункции

Процедура СоздатьГрузоместаДляСборкиПоОбособленнымОтгрузкам(ДокСборка) 
		
	МассивГМ = Новый Массив;
	
	КопияЗаказано = ДокСборка.Заказано.Выгрузить(,"ГМ, Заказ"); 
	КопияЗаказано.Свернуть("ГМ, Заказ");  
	
	Для Каждого СтрЗаказано Из КопияЗаказано Цикл
		
		Если ЗначениеЗаполнено(СтрЗаказано.ГМ) Тогда
			МассивГМ.Добавить(Новый Структура("ГМ, Заказ", СтрЗаказано.ГМ, СтрЗаказано.Заказ));			
		КонецЕсли;	 
		
	КонецЦикла;
	
	Если МассивГМ.Количество() = 0 Тогда
		Возврат;		
	КонецЕсли;    
	
	ДатаСборкиИКомплектовки = ТекущаяДата();
	
	ДокСборка.ВремяНачалаКомплектации = ДатаСборкиИКомплектовки;
	ДокСборка.ВремяОкончанияКомплектации = ДатаСборкиИКомплектовки;      
	ДокСборка.Ответственный = Справочники.ФизическиеЛица.Автосборка;
	ДокСборка.Комплектовщик = Справочники.ФизическиеЛица.Автосборка;
	ДокСборка.ВремяОкончанияСборки = ДатаСборкиИКомплектовки;
	
	СоответствиеГМ = Новый Соответствие;
	
	Для каждого СтруктураГМ Из МассивГМ Цикл
		
		НовыйГМ = Документы.ГрузовоеМесто.СоздатьДокумент();
		НовыйГМ.Сборка = ДокСборка.Ссылка;
		НовыйГМ.ШКОбособленного = СтруктураГМ.ГМ;
		НовыйГМ.Дата = ТекущаяДата();    
		НовыйГМ.Ответственный = Справочники.ФизическиеЛица.Автосборка;
		
		ТаблицаТоваров = ПолучитьТоварыПоГМ(СтруктураГМ.ГМ, СтруктураГМ.Заказ); 
		
		Для Каждого СтрТовара Из ТаблицаТоваров Цикл
			
			НСтр = НовыйГМ.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, СтрТовара);
			
		КонецЦикла; 
		
		НовыйГМ.Записать(РежимЗаписиДокумента.Проведение);
		
		СоответствиеГМ.Вставить(СтруктураГМ.ГМ, НовыйГМ.Ссылка);
		
	КонецЦикла; 	
	          
	Для Каждого Стр Из ДокСборка.Заказано Цикл  
		
		Если Не ЗначениеЗаполнено(Стр.ГМ) Тогда
			Продолжить;			
		КонецЕсли;     
		
		СозданныйГМ = СоответствиеГМ.Получить(Стр.ГМ); 
		
		Если СозданныйГМ <> Неопределено Тогда
			Стр.ГрузовоеМесто = "Место " + ОбщегоНазначения.ПолучитьНомерНаПечать(СозданныйГМ,,,Истина);	
		КонецЕсли;
		
	КонецЦикла;  
	
	ДокСборка.КоличествоУпаковочныхМест = СоответствиеГМ.Количество(); 
	
	СборкаПолностьюСобрана = Истина;
	
	Для Каждого Стр Из ДокСборка.Заказано Цикл 
		
		Если Стр.Подборка <> Перечисления.ПодборкаНоменклатуры.Собрано Тогда
			СборкаПолностьюСобрана = Ложь;	
		КонецЕсли;
		
	КонецЦикла; 
	
	ДокСборка.ДокументСобранИУпакован = СборкаПолностьюСобрана;
	
	ДокСборка.Записать(РежимЗаписиДокумента.Проведение);
	
	МСК.ЗафиксироватьПечатьДокумента(ДокСборка.Ссылка, "Ячейки", "Номенклатура по ячейкам с корректировкой");		

КонецПроцедуры

Функция ПолучитьТоварыПоГМ(ГМ, Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПоступлениеТоваровУслугТовары.Количество,
	|	ПоступлениеТоваровУслугТовары.Заказ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Заказ = &Заказ
	|	И ПоступлениеТоваровУслугТовары.ГМ = &ГМ
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ГМ", ГМ);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

Функция ПроверитьСубботу(ПромДата)
	
	ЗапросПроверкиСубботы = Новый Запрос;
	ЗапросПроверкиСубботы.УстановитьПараметр("ДатаКалендаря",НачалоДня(ПромДата));
	ЗапросПроверкиСубботы.Текст = 
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ДатаКалендаря
	|	И НЕ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Суббота)"; 
	
	РезультатПроверкиСубботы = ЗапросПроверкиСубботы.Выполнить();
	
	Если РезультатПроверкиСубботы.Пустой() Тогда
		Возврат 6;	
	Иначе
		Возврат 1;
	КонецЕсли;

КонецФункции

