
Функция ОтсканированыКодыВсехМаркированныхТоваров(ЗаявкаНаВозврат) Экспорт
	
	//+Сёмин Р.И. 14.04.2026 #UT10-5811
	ТребуемоеКоличествоКМ = 0;
	
	Для Каждого Стр Из ЗаявкаНаВозврат.Товары Цикл
		
		Если Стр.Номенклатура.ТребуетсяМаркировка Тогда 
			
			//+Гавриленков В. 23.07.2026 #UT10-5972
			//ТребуемоеКоличествоКМ = ТребуемоеКоличествоКМ + 1;
			ТребуемоеКоличествоКМ = ТребуемоеКоличествоКМ + Стр.Количество;
			//-Гавриленков В. 23.07.2026 #UT10-5972
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТребуемоеКоличествоКМ = ЗаявкаНаВозврат.КодыМаркировки.Количество();
	//-Сёмин Р.И. 14.04.2026 #UT10-5811
	
КонецФункции