#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Перем Клиент;

////////////////////////////////////////////////////////////////////////
// Служебный интерфейс

// Замена конструктора
//
Процедура Инициализация() Экспорт
	Клиент = ОчередьСообщений.ПолучитьЭкземплярКомпоненты();
	Клиент.ОбъявитьТочкуОбмена(ИмяТочкиОбмена, ТипТочкиОбмена, Истина);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// Программный интерфейс

// Отправляет сообщение в exchange c типом fanout
//
// Параметры:
//  Данные				 - Строка	 - Тело сообщения
//  КлючМаршрутизации	 - Строка	 - Ключ маршрутизации (см. руководство RMQ)
//  ВремяЖизни			 - Строка	 - Время жизни сообщения в миллисекундах
//  Персистентное		 - Булево	 - Сбрасывать сообщение на диск
//
Процедура ОтправитьСообщение(ИсходящееСообщение, Знач Данные, Знач КлючМаршрутизации = "", ВремяЖизни = 0, Персистентное = Ложь) Экспорт
	
	//Белов 
	Заголовки = Новый Соответствие;
	Для каждого Заголовок Из ИсходящееСообщение.Заголовки Цикл
		Заголовки.Вставить(Заголовок.Наименование, Заголовок.Значение);
	КонецЦикла;
	
	Свойства = Новый Структура;
	Для каждого Свойство Из ИсходящееСообщение.Свойства Цикл
		Если Свойство.Наименование = "РежимДоставки" ИЛИ Свойство.Наименование = "ОтметкаВремени" Тогда
			Свойства.Вставить(Свойство.Наименование, Число(Свойство.Значение));
		Иначе
			Свойства.Вставить(Свойство.Наименование, Свойство.Значение);
		КонецЕсли;		
	КонецЦикла;
	
	Клиент.УстановитьЗаголовки(Заголовки);
	Клиент.УстановитьСвойстваСообщения(Свойства);
	//Белов
	
	Клиент.ОтправитьСообщение(ИмяТочкиОбмена, Данные, КлючМаршрутизации, ВремяЖизни, Персистентное, ИсходящееСообщение);
КонецПроцедуры // ОтправитьСообщение()

#КонецЕсли