Процедура ВывестиСообщениеОНаличииКорректировокСборки() Экспорт
	Форма = ПолучитьФорму("ФормаПредупреждения");
	Если НЕ Форма.Открыта() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОткорректированныеРегламентомСобранныеСборки.КорректировкаСборки
		|ИЗ
		|	РегистрСведений.ОткорректированныеРегламентомСобранныеСборки КАК ОткорректированныеРегламентомСобранныеСборки
		|ГДЕ
		|	ОткорректированныеРегламентомСобранныеСборки.Напечатан = ЛОЖЬ";
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда		
			Результат = Форма.ОткрытьМодально();
			Если ТипЗнч(Результат) = Тип("Строка") Тогда
				ОбщаяТаблица = Новый ТабличныйДокумент;
				РезультатЗапроса = Запрос.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					Выборка = РезультатЗапроса.Выбрать();
					Пока Выборка.Следующий() Цикл
						ДокОбъект = Выборка.КорректировкаСборки.ПолучитьОбъект();
						ТабДок = ДокОбъект.ПечатьЗаданияНаРазбор();
						ОбщаяТаблица.Вывести(ТабДок);
						ОбщаяТаблица.ВывестиГоризонтальныйРазделительСтраниц();
						МЗ = РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки.СоздатьМенеджерЗаписи();
						МЗ.КорректировкаСборки = ДокОбъект.Ссылка;
						МЗ.Напечатан = Истина;
						МЗ.ДатаЗаписи = ТекущаяДата();
						МЗ.Записать();
					КонецЦикла;
					ОбщаяТаблица.ФиксацияСверху = 2;
					ОбщаяТаблица.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
					ОбщаяТаблица.АвтоМасштаб = Истина;
					ОбщаяТаблица.ОтображатьЗаголовки = Ложь;
					ОбщаяТаблица.ОтображатьСетку = Ложь;
					ОбщаяТаблица.ТолькоПросмотр = Истина;
					Если Результат = "" Тогда
						ОбщаяТаблица.Показать();	
					Иначе
						ОбщаяТаблица.ИмяПринтера = Результат;
						ОбщаяТаблица.Напечатать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
