Процедура КорректировкаСобранныхСборок() Экспорт
	
	ОтправлятьПочту = Истина;
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();	
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		ОтправлятьПочту = Ложь;  
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КатегорииОбъектов.Объект КАК Справочник.ФизическиеЛица) КАК ФизЛицо
	|ПОМЕСТИТЬ ФизЛица
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьОтчетОКорректировкеСтарыхСборок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизЛица.ФизЛицо,
	|	КонтактнаяИнформация.Представление КАК ЭлАдрес
	|ИЗ
	|	ФизЛица КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ФизЛица.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРабочийФизическогоЛица))";

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	ТаблицаПолучателейПисьма = РезультатЗапроса.Выгрузить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Константы.ЧислоДнейДляРегламентаПоКорректировкамСобранныхСборок КАК ЧислоДней
	|ПОМЕСТИТЬ КонстантаЧислоДней
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВСборкеОстатки.Сборка
	|ПОМЕСТИТЬ ТаблСборок
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			ВЫБОР
	|				КОГДА Сборка.ДатаДоставкиКлиенту = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					ТОГДА ЗаказПокупателя.Дата
	|				ИНАЧЕ Сборка.ДатаДоставкиКлиенту
	|			КОНЕЦ МЕЖДУ &ДатаНач И &ДатаКон
	|				И Сборка.ДокументСобранИУпакован = ИСТИНА
	|				И Сборка.Дата < &МинДатаСборки
	|				И Сборка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)) КАК ТоварыВСборкеОстатки,
	|	КонстантаЧислоДней КАК КонстантаЧислоДней
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыВСборкеОстатки.Сборка.ДатаДоставкиКлиенту = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ТоварыВСборкеОстатки.ЗаказПокупателя.Дата
	|			ИНАЧЕ ТоварыВСборкеОстатки.Сборка.ДатаДоставкиКлиенту
	|		КОНЕЦ < ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ВЫБОР
	|				КОГДА ТоварыВСборкеОстатки.Сборка.Договор.ДержатьРезервБезОплатыОграниченноеВремя
	|						И ТоварыВСборкеОстатки.Сборка.Договор.ЧислоДнейРезерваБезОплаты > КонстантаЧислоДней.ЧислоДней
	|					ТОГДА ТоварыВСборкеОстатки.Сборка.Договор.ЧислоДнейРезерваБезОплаты
	|				ИНАЧЕ КонстантаЧислоДней.ЧислоДней
	|			КОНЕЦ * -1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблСборок.Сборка,
	|	ЕСТЬNULL(РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Дата, ДОБАВИТЬКДАТЕ(ТаблСборок.Сборка.Дата, МИНУТА, 1)) КАК Дата
	|ИЗ
	|	ТаблСборок КАК ТаблСборок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|		ПО ТаблСборок.Сборка = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|			И (РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен)";

	ЧислоДней = Константы.ЧислоДнейДляРегламентаПоКорректировкамСобранныхСборок.Получить();
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ТекущаяДата() - ЧислоДней * 60 * 60 * 24, -3));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата() - ЧислоДней * 60 * 60 * 24); 
	Запрос.УстановитьПараметр("МинДатаСборки", НачалоДня(ТекущаяДата() - 86400));  
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОтправлятьПочту = Ложь;
	КонецЕсли;
	
	//+Бабчинецкий А.С. 14.04.2025 #UT10-5195
	МеняемЯчейку = Константы.База.Получить() = Перечисления.НазваниеБазы.Казань 
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.НабережныеЧелны
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Казань2
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Чебоксары
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Ульяновск
					Или Константы.База.Получить() = Перечисления.НазваниеБазы.Альметьевск;
	//-Бабчинецкий А.С. 14.04.2025 #UT10-5195
					
	Если МеняемЯчейку Тогда
		ЯчейкаДляОтказов = Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить();
	Иначе
		ЯчейкаДляОтказов = Неопределено;
	КонецЕсли;
	
	ОбщаяТаблица = Новый ТабличныйДокумент;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
		ДокОбъект.Заполнить(Выборка.Сборка);
		ДокОбъект.Исполнено = Истина;
		ДокОбъект.Комментарий = "Создан регламентным заданием по корректировке собранных сборок";
		
		Для Каждого Стр Из ДокОбъект.Товары Цикл
			
			Стр.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
			
			Если МеняемЯчейку И ЗначениеЗаполнено(ЯчейкаДляОтказов) Тогда
				Стр.Ячейка = ЯчейкаДляОтказов;
			КонецЕсли;

		КонецЦикла;
		
		Если ЗначениеЗаполнено(Выборка.Дата) Тогда
			ДокОбъект.Дата = Выборка.Дата - 1;
		КонецЕсли;
		
		Если ДокОбъект.Товары.Количество() Тогда
			
			ДокОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			
			Попытка
				
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				ДокОбъект.СоздатьКорректировкиЗаказа();
				
			Исключение
				Продолжить;
			КонецПопытки;
			
			МЗ = РегистрыСведений.ОткорректированныеРегламентомСобранныеСборки.СоздатьМенеджерЗаписи();
			МЗ.КорректировкаСборки = ДокОбъект.Ссылка;
			МЗ.Напечатан = Ложь;
			МЗ.ДатаЗаписи = ТекущаяДата();
			МЗ.Записать();
			
			Если ОтправлятьПочту Тогда
				
				ТабДок = ДокОбъект.ПечатьЗаданияНаРазбор();
				ОбщаяТаблица.Вывести(ТабДок);
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОтправлятьПочту Тогда
		
		ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
		СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
		ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
		ОбщаяТаблица.Записать(ВременныйКаталог + "КорректировкаСборки.XLSX", ТипФайлаТабличногоДокумента.XLSX);
		
		Для Каждого ТекСтр Из ТаблицаПолучателейПисьма Цикл
				
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Корректировка сборки!";
			
			МылоКонтрагента = ТекСтр.ЭлАдрес;
						
			МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
			
			Для каждого ТекАдрес Из МассивАдресов Цикл
				Сообщение.Получатели.Добавить(ТекАдрес); 
			КонецЦикла;
				
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Вложения.Добавить(ВременныйКаталог + "КорректировкаСборки.XLSX", ТипФайлаТабличногоДокумента.XLSX);
			
			Попытка
				
				Почта.Послать(Сообщение);
				Сообщение.Вложения.Очистить(); 
				ТекстСообщения = "Отправлено письмо " + ТекСтр.ФизЛицо + " на адрес " + МылоКонтрагента + " с уведомлением о корректировке сборки";
				ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);	
				
			Исключение	  												
			КонецПопытки;
			
		КонецЦикла;
		
		Попытка
			УдалитьФайлы(ВременныйКаталог);
		Исключение  		
		КонецПопытки;
		
		Почта.Отключиться();
		
	КонецЕсли;

КонецПроцедуры
