
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	ОтборУведомленийПоСобытию = Истина;
	
	РезультатОбновления = ПЛ_УведомленияОСобытиях.ВыполнитьОбновление();
	
	ЭтоПервыйЗапуск     = РезультатОбновления.ЭтоПервыйЗапуск;
	ЕстьИзменениеВерсии = РезультатОбновления.ЕстьИзменениеВерсии;
	ВесПредыдущейВерсии = РезультатОбновления.Версия.Вес;
	ТекущаяВерсия       = РезультатОбновления.ТекущаяВерсия;
	
	ПочтаНастроена = Ложь;
	РассылкиНастроены = Ложь;
	СМСДоступны = Ложь;
	СМСНастроены = Ложь;
	НапоминанияДоступны = Ложь;
	ПЛ_УведомленияОСобытиях.ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены);
	
	Элементы.СМС.Видимость = Платформа83;
	Элементы.Напоминание.Видимость = НапоминанияДоступны;
	
	События.Параметры.УстановитьЗначениеПараметра("СтрокаПоРасписанию", НСтр("ru = 'По расписанию'"));
	События.Параметры.УстановитьЗначениеПараметра("СтрокаРассылка", НСтр("ru = 'Рассылка'"));
	
	Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().СохранитьНастройку("НоваяФормаУведомлений", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоПервыйЗапуск ИЛИ ЕстьИзменениеВерсии Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Ложь);
		СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      ЭтоПервыйЗапуск);
		СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  ЕстьИзменениеВерсии);
		СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  ВесПредыдущейВерсии);
		СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
		
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров);
		#Иначе
			ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
				СтруктураПараметров);
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Уведомления" Тогда
		Элементы.События.Обновить();
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура СобытияПриАктивизацииСтроки(Элемент)
	
	Если ОтборУведомленийПоСобытию Тогда
		ПодключитьОбработчикОжидания("УстановитьОтборУведомленийПоТекущемуСобытию", 0.2, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УведомленияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекущиеДанные = Элементы.События.ТекущиеДанные;
	
	Если НЕ Группа
		И НЕ Копирование
		И ОтборУведомленийПоСобытию
		И ТекущиеДанные <> Неопределено
		И ТипЗнч(ТекущиеДанные) <> Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		
		Отказ = Истина;
		
		ЗначенияЗаполнения = Новый Структура("Событие", ТекущиеДанные.Ссылка);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.ФормаОбъекта", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаОтборУведомленийПоСобытию(Команда)
	
	ОтборУведомленийПоСобытию = НЕ ОтборУведомленийПоСобытию;
	Элементы.УведомленияОтборУведомленийПоСобытию.Пометка = ОтборУведомленийПоСобытию;
	
	Если ОтборУведомленийПоСобытию Тогда
		УстановитьОтборУведомленийПоТекущемуСобытию();
	Иначе
		УстановитьОтборУведомленийПоСобытию(Неопределено, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений",
		,
		ЭтаФорма,
		,
		ВариантОткрытияОкна.ОтдельноеОкно);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияВерсий(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВыводитьВсеВерсии",    Истина);
	СтруктураПараметров.Вставить("ЭтоПервыйЗапуск",      Ложь);
	СтруктураПараметров.Вставить("ЕстьИзменениеВерсии",  Истина);
	СтруктураПараметров.Вставить("ВесПредыдущейВерсии",  1000000);
	СтруктураПараметров.Вставить("ТекущаяВерсия",        ТекущаяВерсия);
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОписаниеИзмененийКонфигурации",
		СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ОПрограмме(Команда)
	
	Если Платформа83 Тогда
		Выполнить("ОткрытьФорму(""Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме"",,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
	Иначе
		ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.ОПрограмме");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВНовуюФорму(Команда)
	
	Закрыть();
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.УведомленияОСобытиях");
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьОтборУведомленийПоТекущемуСобытию()
	
	Если ТипЗнч(Элементы.События.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.События.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Событие = ПустоеСобытие;
	Иначе
		Событие = ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	УстановитьОтборУведомленийПоСобытию(Событие, ЗначениеЗаполнено(Событие));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборУведомленийПоСобытию(Событие, Использование = Истина)
	
	УстановитьОтборСписка(Уведомления, "Событие", Событие, ВидСравненияКомпоновкиДанных.ВИерархии, Использование)
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСписка(Список, ПолеОтбора, ЗначениеОтбора, ВидСравнения, Использование = Истина)
	
	ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ПолеОтбора);

	Отбор = Список.Отбор.Элементы;
	
	// Удаление имеющихся отборов
	Счетчик = 0;
	Пока Счетчик < Отбор.Количество() Цикл
		
		ЭлементОтбора = Отбор[Счетчик];
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
			Отбор.Удалить(ЭлементОтбора);
			Прервать;
		Иначе
			Счетчик = Счетчик + 1;
		КонецЕсли;
	КонецЦикла;
	
	// Добавление отбора
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		УсловиеОтбора = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		УсловиеОтбора.ЛевоеЗначение     = ПолеКомпоновки;
		УсловиеОтбора.ВидСравнения      = ВидСравнения;
		УсловиеОтбора.ПравоеЗначение    = ЗначениеОтбора;
		УсловиеОтбора.Использование     = Использование;
	КонецЕсли;
	
КонецПроцедуры
