
#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВопроса(ТекстВопроса, ОписаниеОповещения)

	ПараметрыФормыВопроса = Новый Структура("ТекстВопроса", ТекстВопроса);
	ФормаВопроса = ПолучитьФорму(ПолучитьПутьКОбработке() + "ФормаВопроса", ПараметрыФормыВопроса, ЭтаФорма);
	ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВопроса.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции
&НаСервере
Функция ПолучитьПутьКОбработке()	
	ПутьКФормам = ПолучитьОбъектОбработки().Метаданные().ПолноеИмя() + ".Форма.";	
	Возврат ПутьКФормам;
КонецФункции
&НаКлиенте
Функция ПолучитьОбщийМодульКлиента()
	Возврат ПолучитьФорму(ПолучитьПутьКОбработке() + "ОбщийМодульКлиент");	
КонецФункции

&НаСервере
Процедура ВывестиУведомлениеПользователю(Знач ТекстСообщенияПользователю)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	ПолучитьОбъектОбработки().ДобавитьВЖурнал(ТекстСообщенияПользователю, "Модуль формы");
КонецПроцедуры

#КонецОбласти

#Область КриптоПровайдер

&НаКлиенте
Функция ПодписатьДокументЭП(ИмяВременногоФайла, ПарольКСертификату)
	Возврат ПолучитьОбщийМодульКлиента().ПодписатьДокументЭП(КриптоПровайдер, Объект.ОтпечатокСертификата, ИмяВременногоФайла, ПарольКСертификату);
КонецФункции
&НаКлиенте
Функция ПроверитьПодписьДокумента(ЗначениеПодписи, Подпись)
	Возврат ПолучитьОбщийМодульКлиента().ПроверитьПодписьДокумента(КриптоПровайдер, Объект.ОтпечатокСертификата, ЗначениеПодписи, Подпись);
КонецФункции
&НаСервере
Функция ПолучитьСписокКриптоПровайдеровWindows()
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокКриптоПровайдеров();
КонецФункции
&НаКлиенте
Функция ПолучитьСписокСертификатов()
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСписокСертификатов(КриптоПровайдер);
КонецФункции
&НаКлиенте
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСертификатПоОтпечатку(КриптоПровайдер, Отпечаток);
КонецФункции
&НаКлиенте
Функция СформироватьИмяПоСертификату(Сертификат)
	Возврат ПолучитьОбщийМодульКлиента().СформироватьИмяПоСертификату(Сертификат);	
КонецФункции
&НаСервере
Функция ПолучитьСписокДоступныхСертификатов(МассивОтпечатков)
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокДоступныхСертификатов(МассивОтпечатков);
КонецФункции

#КонецОбласти



&НаКлиенте
Процедура АнализТребуемыхДействий()
	Элементы.ФормаПодписать.Видимость = Ложь;
	Элементы.ФормаПринять.Видимость = Ложь;
	Элементы.ФормаОтклонить.Видимость = Ложь;
	Элементы.ФормаАннулировать.Видимость = Ложь;
	Если Найти(ГруппаПроцессинга, "bilateral") Тогда
		ТребуемыеДействия = "Необходимо принять или отклонить документ";
	КонецЕсли;
	Если ЕстьНеподписанныеДокументы() И НЕ Найти(ТребуемыеДействия, "подписать")  Тогда
		ТребуемыеДействия = "Необходимо подписать документы";
	КонецЕсли;

	Если Найти(ТребуемыеДействия, "подписать") Тогда
		Элементы.ФормаПодписать.Видимость = Истина;
	КонецЕсли;
	Если Найти(ТребуемыеДействия, "принять") Тогда
		Элементы.ФормаПринять.Видимость = Истина;
		Элементы.ФормаОтклонить.Видимость = Истина;
	КонецЕсли;
	Если Найти(ТребуемыеДействия, "ответ") Тогда
		Элементы.ФормаАннулировать.Видимость = Истина;
	КонецЕсли;
	Если Найти(ТребуемыеДействия, "завершен") Тогда
		Элементы.ФормаАннулировать.Видимость = Истина;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(СтатусДокумента) Тогда
		Элементы.СтатусДокумента.Видимость = Истина;
		Элементы.ТребуемыеДействия.Заголовок = "Ожидаемые действия";
		Элементы.ТребуемыеДействия.Шрифт = Новый Шрифт("Arial", 10); 
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ТребуемыеДействия) Тогда
		Элементы.ТребуемыеДействия.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ЕстьНеподписанныеДокументы()
	Для Каждого Док Из СписокДокументовВЦепочке Цикл
		Если НЕ Док.Подписан Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВерсияAPI = "v1.2" Тогда
		Элементы.СписокДокументовВЦепочкеИмяФайла.Видимость = Ложь;
	КонецЕсли;
	ОбработатьПараметры(Параметры);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивДанныхПоДокументу()
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ДанныеПоПакету = ОбработкаОбъект.ПолучитьДанныеПакетаДокументов(ИдентификаторДокумента);
	Возврат ДанныеПоПакету;	
КонецФункции


&НаСервере
Процедура ПросмотретьДанныеДокумента(Заголовок, Знач ДанныеДокумента, СтатусПодписи, ИмяФайла = Неопределено)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
		
	Если ЗначениеЗаполнено(СсылкаНаДокумент) И ЗначениеЗаполнено(ИмяФайла) Тогда
		ТабДокДокумента = ОбработкаОбъект.ПолучитьПечатнуюФормуНеформализованногоДокумента(СсылкаНаДокумент);
	Иначе
		ДанныеДокумента = ПрочитатьXMLИзBase64(ДанныеДокумента);
		ТабДокДокумента = ОбработкаОбъект.СформироватьПечатнуюФормуXML(ДанныеДокумента, Заголовок, СтатусПодписи);
	КонецЕсли;
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ПрочитатьXMLИзBase64(Знач Base64Строка)
	Base64Строка = СтрЗаменить(Base64Строка, "\/", "/");
	Попытка
		ДвоичныеДанные = Base64Значение(Base64Строка);
	Исключение
		Сообщить("ПрочитатьXMLИзBase64: " + ОписаниеОшибки() );
	КонецПопытки;
	Попытка
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		ДвоичныеДанные.Записать(ВременныйФайл);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ВременныйФайл,"windows-1251");
		Результат = ТекстовыйДокумент.ПолучитьТекст();
		УдалитьФайлы(ВременныйФайл);
		Возврат Результат;
	Исключение
		Сообщить("ПрочитатьXMLИзBase64: " + ОписаниеОшибки() );
		УдалитьФайлы(ВременныйФайл);
	КонецПопытки;
	Возврат "";
КонецФункции

&НаСервере
Процедура ОбработатьПараметры(Знач ПараметрыФормы)
	//Общие параметры формы
	Если ПараметрыФормы.Свойство("КриптоПровайдер") Тогда
		КриптоПровайдер = ПараметрыФормы.КриптоПровайдер;
	КонецЕсли;
	Если ПараметрыФормы.Свойство("СсылкаНаДокумент") Тогда
		СсылкаНаДокумент = ПараметрыФормы.СсылкаНаДокумент;
	КонецЕсли;
	Если ПараметрыФормы.Свойство("ДанныеОВложении") Тогда
		ДанныеОВложении = ПараметрыФормы.ДанныеОВложении;
	КонецЕсли;
	Если Параметры.Свойство("ЭтоСвязанныйКонтейнер") Тогда
		ЭтоСвязанныйКонтейнер = ПараметрыФормы.ЭтоСвязанныйКонтейнер;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыФормы,,"СправочникВалюты,СправочникРегионы,СправочникЕдиницыИзмерения");
	Объект.СправочникВалюты.Загрузить(ПараметрыФормы.СправочникВалюты.Выгрузить() );
	Объект.СправочникРегионы.Загрузить(ПараметрыФормы.СправочникРегионы.Выгрузить() );
	Объект.СправочникЕдиницыИзмерения.Загрузить(ПараметрыФормы.СправочникЕдиницыИзмерения.Выгрузить() );
	
	//Параметры контейнера
	Если ПараметрыФормы.Свойство("СписокКонтейнера") Тогда
		
		МассивДанныхКонтейнера = ПараметрыФормы.СписокКонтейнера;
		Для Каждого ЭлементДК Из МассивДанныхКонтейнера Цикл
			СтрокаКонтейнера = СписокКонтейнера.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКонтейнера, ЭлементДК);
			ТипНовогоДокумента = СтрокаКонтейнера.Тип;
		КонецЦикла;
		Если СписокКонтейнера.Количество() = 1 Тогда
			Элементы.СписокКонтейнера.Видимость = Ложь
		КонецЕсли;
		УстановитьПараметрыКарточки(СписокКонтейнера[0]);
	Иначе
		Элементы.СписокКонтейнера.Видимость = Ложь;
		Если ПараметрыФормы.Свойство("СтатусДокумента") Тогда
			СтатусДокумента = ПараметрыФормы.СтатусДокумента;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("Тип") Тогда
			Элементы.ДекорацияНаименованиеДокумента.Заголовок = ПараметрыФормы.Тип;
			ТипНовогоДокумента = ПараметрыФормы.Тип;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("ИдентификаторДокумента") Тогда
			ИдентификаторДокумента = ПараметрыФормы.ИдентификаторДокумента;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("ИдентификаторПакета") Тогда
			ИдентификаторПакета = ПараметрыФормы.ИдентификаторПакета;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("ПредварительныеДанные") Тогда
			ПредварительныеДанные = ПараметрыФормы.ПредварительныеДанные;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("ТребуемыеДействия") Тогда
			ТребуемыеДействия = ПараметрыФормы.ТребуемыеДействия;
		КонецЕсли;
		Если ПараметрыФормы.Свойство("Контрагент") Тогда
			Контрагент = ПараметрыФормы.Контрагент;
		КонецЕсли;
		
		Если ПараметрыФормы.Свойство("ГруппаПроцессинга") Тогда
			ГруппаПроцессинга = ПараметрыФормы.ГруппаПроцессинга;
		КонецЕсли;
		
	КонецЕсли;

	
	
КонецПроцедуры



&НаСервере
Процедура ПриЗакрытииНаСервере()
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ОбработкаОбъект.ЗаписатьЖурналВФайл();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВЦепочкеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Поле.Имя = "СписокДокументовВЦепочкеИмяФайла" Тогда
		Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ИмяФайла) Тогда
			ДвоичныеДанныеДокумента = Base64Значение(ДанныеДокумента);
			ИмяВременногоФайла = КаталогВременныхФайлов() + ПолучитьРазделительПутиКлиента() + Элемент.ТекущиеДанные.ИмяФайла;
			
			ДвоичныеДанныеДокумента.Записать(ИмяВременногоФайла);
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;	
	Иначе
		ПросмотретьДанныеДокумента(Элемент.ТекущиеДанные.Представление, Элемент.ТекущиеДанные.Значение, Элемент.ТекущиеДанные.Подписан, Элемент.ТекущиеДанные.ИмяФайла);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Белов ОбработатьНаличиеСертификата();
	ОбработатьДанныеДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанныеДокумента()
	ТаблицаПодписей.Очистить();
	СписокДокументовВЦепочке.Очистить();
	Элементы.ЗаполнитьИнфоПоля.Видимость = Ложь;
	СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
	//Белов Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	
	Если ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
		ДанныеПоПакету = ПолучитьМассивДанныхПоДокументу();
		Для Каждого ДокКонтент Из ДанныеПоПакету Цикл
			Сертификат = Неопределено;
			СтрокаВСписке = СписокДокументовВЦепочке.Добавить();
			СтрокаВСписке.Значение = ДокКонтент.Контент;
			СтрокаВСписке.Представление = ДокКонтент.Тип;
			СтрокаВСписке.СистемноеИмя = ДокКонтент.СистемноеИмя;
			Если ТипНовогоДокумента = "Счет-фактура" И Найти(ДокКонтент.Тип, "УПД") Тогда
				СтрокаВСписке.Представление = ТипНовогоДокумента;
			КонецЕсли;
			СтрокаВСписке.Идентификатор = ДокКонтент.ИдентификаторДокумента;
			СтрокаВСписке.Подписан = ЗначениеЗаполнено(ДокКонтент.Подпись);
			СтрокаВСписке.ИмяФайла = ДокКонтент.ИмяФайла;
			//Костыль до тех пор, пока не будет соответствующий статус
			Если НЕ СтрокаВСписке.Подписан Тогда
				Элементы.ФормаПодписать.Видимость = Истина;
			КонецЕсли;
			Если ДокКонтент.ИдентификаторДокумента = ИдентификаторДокумента Тогда
				ПросмотретьДанныеДокумента(СтрокаВСписке.Представление, СтрокаВСписке.Значение, СтрокаВСписке.Подписан);
				ДанныеДокумента = СтрокаВСписке.Значение;
				СистемноеИмя = СтрокаВСписке.СистемноеИмя;
			КонецЕсли;
			Попытка
				Если СтрокаВСписке.Подписан Тогда
					//Белов
					//Менеджер.ПроверитьПодпись(Base64Значение(ДокКонтент.Контент), Base64Значение(ДокКонтент.Подпись), Сертификат);
					//Если Сертификат <> Неопределено Тогда
					//	СтрТП = ТаблицаПодписей.Добавить();
					//	СтрТП.Подписант = СформироватьИмяПоСертификату(Сертификат);
					//	СтрТП.ОтпечатокСертификата = СтрЗаменить(Строка(Сертификат.Отпечаток), " ", "");
					//	СтрТП.ПодписанныйДокумент = ДокКонтент.Тип;
					//КонецЕсли;
				КонецЕсли;
			Исключение
				СтрТП = ТаблицаПодписей.Добавить();
				СтрТП.ПодписанныйДокумент = ДокКонтент.Тип;
				СтрТП.ОтпечатокСертификата = "Невалидная подпись!";
				СтрокаВСписке.Подписан = Ложь;
			КонецПопытки;
		КонецЦикла;
		СписокДокументовВЦепочке.Сортировать("Идентификатор ВОЗР");
		Если НЕ ЗначениеЗаполнено(ДанныеДокумента) И СписокДокументовВЦепочке.Количество() > 0 Тогда
			СтрокаВСписке = СписокДокументовВЦепочке[0];
			ДанныеДокумента = СтрокаВСписке.Значение;
			ПросмотретьДанныеДокумента(СтрокаВСписке.Представление, СтрокаВСписке.Значение, СтрокаВСписке.Подписан);
		КонецЕсли;
		ОбновитьКоличествоПодписейВШапке();
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредварительныеДанные) Тогда
		Элементы.ЗаполнитьИнфоПоля.Видимость = Истина;
		ДанныеДокумента = ПредварительныеДанные;
		СтрокаДанных = СписокДокументовВЦепочке.Добавить();
		СтрокаДанных.Значение = ПредварительныеДанные;
		СтрокаДанных.Представление = ТипНовогоДокумента;
		СтрокаДанных.ИмяФайла = ДанныеОВложении;
		ПросмотретьДанныеДокумента(ТипНовогоДокумента, ПредварительныеДанные, Ложь, ДанныеОВложении);
	КонецЕсли;
	АнализТребуемыхДействий();		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНаличиеСертификата()
	Элементы.ФормаПодписать.Доступность = Ложь;
	Элементы.ФормаПринять.Доступность = Ложь;
	Элементы.ФормаОтклонить.Доступность = Ложь;

	Если ЗначениеЗаполнено(Объект.ОтпечатокСертификата) Тогда
		Сертификат = ПолучитьСертификатПоОтпечатку(Объект.ОтпечатокСертификата);
		Если Сертификат <> Неопределено Тогда
			Элементы.ФормаПодписать.Доступность = Истина;
			Элементы.ФормаПринять.Доступность = Истина;
			Элементы.ФормаОтклонить.Доступность = Истина;
		Конецесли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьКоличествоПодписейВШапке()
	КоличествоПодписей = ТаблицаПодписей.Количество();
	Элементы.ГруппаПодписи.Заголовок = "Подписи (" + КоличествоПодписей + ")";
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВернутьРазобранныйСписокПроблем(МассивОшибок)
	СтрокаТекста = "";
	Если НЕ ЗначениеЗаполнено(МассивОшибок) Тогда
		Возврат СтрокаТекста;
	КонецЕсли;
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		Если ЗначениеЗаполнено(СтрокаТекста) Тогда
			СтрокаТекста = СтрокаТекста + Символы.ПС;
		КонецЕсли;
		Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
			СтрокаТекста = СтрокаТекста + Ошибка;	
		Иначе
			Если Ошибка.Получить("propertyPath") <> Неопределено Тогда
				СтрокаТекста = СтрокаТекста + Ошибка.Получить("propertyPath") + ": ";
			КонецЕсли;
			Если Ошибка.Получить("violation") <> Неопределено Тогда
				СтрокаТекста = СтрокаТекста + Ошибка.Получить("violation");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаТекста;
КонецФункции


#Область Подписание_документа

&НаКлиенте
Процедура ПодписатьЭД(Команда)	
	Если Объект.ЗапомнитьПароль Тогда
		ПодписатьПослеЗапросаПароля(Объект.СессионныйПароль);	
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ПодписатьПослеЗапросаПароля", ЭтаФорма);
		ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
КонецПроцедуры
&НаКлиенте
Процедура ПодписатьПослеЗапросаПароля(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Объект.СессионныйПароль = СтрокаПароля;
	НеЗакрывать = Ложь;
	Если ЭтоСвязанныйКонтейнер Тогда
		Для Каждого СтрокаКонтейнера Из СписокКонтейнера Цикл
			УстановитьПараметрыКарточки(СписокКонтейнера.Индекс(СтрокаКонтейнера) );
			ОбработатьДанныеДокумента();
			ПодписатьЭДПакета(НеЗакрывать);
		КонецЦикла;
	Иначе
		ПодписатьЭДПакета(НеЗакрывать);
	КонецЕсли;
	Если НЕ НеЗакрывать Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьЭДПакета(НеЗакрывать = Ложь)
	Если ЕстьНеподписанныеДокументы() Тогда
		ПодписатьЭДПродолжение(Объект.СессионныйПароль,,НеЗакрывать);		
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Процедура ПодписатьЭДПродолжение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено, НеЗакрывать = Ложь) Экспорт
	ИзмененияВДокументахВОбработке = Ложь;
	ИзмененияВДокументахИсходящих = Ложь;
	Для Каждого ДокументВЦепочке Из СписокДокументовВЦепочке Цикл
		Если ДокументВЦепочке.Подписан Тогда
			Продолжить;
		КонецЕсли;
		СтрокаКонтента = ДокументВЦепочке.Значение;
		СтрокаПодписи = ПодписатьДокументXML(СтрокаКонтента, СтрокаПароля); 
		Если СтрокаПодписи = "" Тогда
			Возврат;
		КонецЕсли;
		Если Найти(НРег(ДокументВЦепочке.Представление), "извещение") Тогда
			Результат = ОтправитьПодписанныйДокумент(ДокументВЦепочке.Идентификатор, СтрокаКонтента, СтрокаПодписи);
			Если ТипЗнч(Результат) = Тип("Строка") Тогда
				НеЗакрывать = Истина;
				Сообщить("Попытка подписи документа " + ДокументВЦепочке.Представление + " с ID " + ДокументВЦепочке.Идентификатор + ". " + Результат);
			КонецЕсли;
			ИзмененияВДокументахВОбработке = Истина;
		ИначеЕсли Найти(НРег(ДокументВЦепочке.Представление), "подтверждение") Тогда
			Результат = ОтправитьПодписанныйДокумент(ДокументВЦепочке.Идентификатор, СтрокаКонтента, СтрокаПодписи);
			Если ТипЗнч(Результат) = Тип("Строка") Тогда
				НеЗакрывать = Истина;
				Сообщить("Попытка подписи документа " + ДокументВЦепочке.Представление + " с ID " + ДокументВЦепочке.Идентификатор + ". " + Результат);
			КонецЕсли;
			ИзмененияВДокументахВОбработке = Истина;
		Иначе
			Результат = ОтправитьПодписанныйНовыйДокумент(СтрокаКонтента, СтрокаПодписи);
			Если ТипЗнч(Результат) = Тип("Строка") Тогда
				НеЗакрывать = Истина;
				Сообщить("Попытка подписи документа " + ДокументВЦепочке.Представление + ". " + Результат);
			КонецЕсли;
			ИзмененияВДокументахИсходящих = Истина;		
		КонецЕсли;
			
	КонецЦикла;
	Если ИзмененияВДокументахВОбработке Тогда
		Оповестить("ИзменениеСостоянияДокументовВОбработке");
	КонецЕсли;
	Если ИзмененияВДокументахИсходящих Тогда
		Оповестить("ИзменениеСостоянияИсходящихДокументов");	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Функция ПодписатьДокументXML(СтрокаКонтента, СтрокаПароля)
	ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
	
	Попытка
		Если ЗначениеЗаполнено(СтрокаКонтента) Тогда
			ДвоичныеДанныеДокумента = Base64Значение(СтрокаКонтента);
			ДвоичныеДанныеДокумента.Записать(ВременныйФайл);
			Если Объект.ОтпечатокСертификата = Неопределено Тогда
				Возврат "";
			КонецЕсли;
			СтрокаПодписи = ПодписатьДокументЭП(ВременныйФайл, СтрокаПароля);
			УдалитьФайлы(ВременныйФайл);
			Возврат СтрокаПодписи;	
		КонецЕсли;
	Исключение
		УдалитьФайлы(ВременныйФайл);
		Возврат "";
	КонецПопытки;
КонецФункции

&НаСервере
Функция ОтправитьПодписанныйНовыйДокумент(СтрокаКонтента, СтрокаПодписи)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ТипДокумента = ТипНовогоДокумента;
	РезультатОтправки = ОбработкаОбъект.ОтправитьПодписанныйДокумент(Контрагент, ТипДокумента, СтрокаКонтента, СтрокаПодписи, СсылкаНаДокумент);
	Если ЗначениеЗаполнено(РезультатОтправки) Тогда
		Если РезультатОтправки.Получить("success") = Истина Тогда
			СтатусДокумента = РезультатОтправки.Получить("message");
			ТребуемыеДействия = "Ожидание";
		Иначе
			Возврат РезультатОтправки.Получить("codeDescription") 
					+ Символы.ПС + ВернутьРазобранныйСписокПроблем(РезультатОтправки.Получить("violations") );
		КонецЕсли;
	Иначе
		Возврат "Ошибка при отправке документа";
	КонецЕсли;
	Возврат Истина;
КонецФункции

&НаСервере
Функция ОтправитьПодписанныйДокумент(Идентификатор, СтрокаКонтента, СтрокаПодписи)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	РезультатОтправки = ОбработкаОбъект.ПодписатьДокумент(Идентификатор, СтрокаКонтента, СтрокаПодписи);
	Если ЗначениеЗаполнено(РезультатОтправки) Тогда
		Если РезультатОтправки.Получить("success") = Истина Тогда
			СтатусДокумента = РезультатОтправки.Получить("message");
			ТребуемыеДействия = "Ожидание";
		Иначе
			Возврат РезультатОтправки.Получить("codeDescription");	
		КонецЕсли;
	КонецЕсли;

КонецФункции


#КонецОбласти

#Область Аннулирование_документа

&НаКлиенте
Процедура Аннулировать(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("АннулироватьПослеЗапросаПричины", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,"","Причина аннулирования",,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьПослеЗапросаПричины(СтрокаПричины = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Объект.ЗапомнитьПароль Тогда
		АннулироватьПослеВводаПароля(Объект.СессионныйПароль, Новый Структура("СтрокаПричины", СтрокаПричины) );
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("АннулироватьПослеВводаПароля", ЭтаФорма, Новый Структура("СтрокаПричины", СтрокаПричины) );
		ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры
 
&НаКлиенте
Процедура АннулироватьПослеВводаПароля(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Объект.СессионныйПароль = СтрокаПароля;	
	
	Если ЭтоСвязанныйКонтейнер Тогда
		Для Каждого СтрокаКонтейнера Из СписокКонтейнера Цикл
			УстановитьПараметрыКарточки(СписокКонтейнера.Индекс(СтрокаКонтейнера) );
			ОбработатьДанныеДокумента();
			АннулироватьЗавершение(СтрокаПароля, ДополнительныеПараметры);
		КонецЦикла;
	Иначе
		АннулироватьЗавершение(СтрокаПароля, ДополнительныеПараметры);
	КонецЕсли;	
	Закрыть();
		
КонецПроцедуры

&НаКлиенте
Процедура АннулироватьЗавершение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	КонтентДляПодписи = СформироватьКвитанциюАннулирования(ДополнительныеПараметры.СтрокаПричины);
	Если КонтентДляПодписи.Получить("success") <> Неопределено И КонтентДляПодписи.Получить("success") Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
		Попытка
			СтрокаКонтента = КонтентДляПодписи.Получить("content");
			ДвоичныеДанныеДокумента = Base64Значение(СтрокаКонтента);
			ДвоичныеДанныеДокумента.Записать(ВременныйФайл);
			Если Объект.ОтпечатокСертификата = Неопределено Тогда
				Возврат;
			КонецЕсли;
			СтрокаПодписи = ПодписатьДокументЭП(ВременныйФайл, СтрокаПароля);
			Если СтрокаПодписи = "" Тогда
				Возврат;
			КонецЕсли;
			ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, СтрокаКонтента, СтрокаПодписи, "Аннулировать");
			Оповестить("ИзменениеСостоянияДокументовВОбработке");
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание);
			УдалитьФайлы(ВременныйФайл);
		КонецПопытки;
	ИначеЕсли КонтентДляПодписи.Получить("success") <> Неопределено Тогда
		Сообщить(КонтентДляПодписи.Получить("codeDescription")
		+ Символы.ПС + ВернутьРазобранныйСписокПроблем(КонтентДляПодписи.Получить("violations") ) );	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СформироватьКвитанциюАннулирования(СтрокаПричины)
	ОбъектОбработки = ПолучитьОбъектОбработки();
	СтруктураДанных = Новый Структура("Идентификатор,Ссылка,ПричинаАннулирования", ИдентификаторДокумента, ?(ЗначениеЗаполнено(СсылкаНаДокумент), СсылкаНаДокумент, Новый Структура), СтрокаПричины );
	Возврат ОбъектОбработки.СоздатьXMLКвитанциюОбАннулированииИВернутьДляПодписания(СтруктураДанных);	
КонецФункции

#КонецОбласти

#Область Прием_документа

&НаКлиенте
Процедура Принять(Команда)
	Если Объект.ЗапомнитьПароль Тогда
			ПринятьПослеВводаПароля(Объект.СессионныйПароль);
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("ПринятьПослеВводаПароля", ЭтаФорма);
			ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьПослеВводаПароля(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Объект.СессионныйПароль = СтрокаПароля;
	
	Если ЭтоСвязанныйКонтейнер Тогда
		Для Каждого СтрокаКонтейнера Из СписокКонтейнера Цикл
			УстановитьПараметрыКарточки(СписокКонтейнера.Индекс(СтрокаКонтейнера) );
			ОбработатьДанныеДокумента();
			ПринятьПродолжение(СтрокаПароля, ДополнительныеПараметры);
		КонецЦикла;
	Иначе
		ПринятьПродолжение(СтрокаПароля, ДополнительныеПараметры);
	КонецЕсли;
	Закрыть();
		
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьПродолжение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если НЕ МожноПринятьДокумент() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипНовогоДокумента = "Универсальный корректировочный документ (КСЧФ)"
		ИЛИ ТипНовогоДокумента = "Универсальный передаточный документ (СЧФ)"
		ИЛИ ТипНовогоДокумента = "Счет-фактура" 
	Тогда
		//Исключение - для этого документа сразу отправляется приемка
		ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, "", "");
		Оповестить("ИзменениеСостоянияДокументовВОбработке");	
	ИначеЕсли Найти(ГруппаПроцессинга, "bilateral") Тогда
		СтрокаКонтента = ДанныеДокумента;
		СтрокаПодписи = ПодписатьДокументXML(СтрокаКонтента, СтрокаПароля); 
		Если СтрокаПодписи = "" Тогда
			Возврат;
		КонецЕсли;
		ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, СтрокаКонтента, СтрокаПодписи);
		Оповестить("ИзменениеСостоянияДокументовВОбработке");
		
	Иначе
		КонтентДляПодписи = СформироватьКвитанциюОПриеме();
		Если КонтентДляПодписи.Получить("success") <> Неопределено И КонтентДляПодписи.Получить("success") Тогда
			ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
			Попытка
				СтрокаКонтента = КонтентДляПодписи.Получить("content");
				ДвоичныеДанныеДокумента = Base64Значение(СтрокаКонтента);
				ДвоичныеДанныеДокумента.Записать(ВременныйФайл);
				Если Объект.ОтпечатокСертификата = Неопределено Тогда
					Возврат;
				КонецЕсли;
				СтрокаПодписи = ПодписатьДокументЭП(ВременныйФайл, СтрокаПароля);
				Если СтрокаПодписи = "" Тогда
					Возврат;
				КонецЕсли;
				ОтправитьПодписаннуюКвитанцию(?(КонтентДляПодписи.Получить("id") = Неопределено, ИдентификаторДокумента, КонтентДляПодписи.Получить("id") ), 
												СтрокаКонтента, 
												СтрокаПодписи
											  );
				Оповестить("ИзменениеСостоянияДокументовВОбработке");
				
			Исключение
				Сообщить(ИнформацияОбОшибке().Описание);
				УдалитьФайлы(ВременныйФайл);
			КонецПопытки;
		ИначеЕсли КонтентДляПодписи.Получить("success") <> Неопределено Тогда
			Сообщить(КонтентДляПодписи.Получить("codeDescription")
			+ Символы.ПС + ВернутьРазобранныйСписокПроблем(КонтентДляПодписи.Получить("violations") ) );	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, СтрокаКонтента, СтрокаПодписи, Знач Команда = "Принять")
	ОбъектОбработки = ПолучитьОбъектОбработки();
	Если Найти(ТребуемыеДействия, "аннулирован") Тогда
		Команда = Команда + "Аннулирование";
	КонецЕсли;
	ОбъектОбработки.ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, СтрокаКонтента, СтрокаПодписи, Команда); 
КонецПроцедуры

&НаСервере
Функция МожноПринятьДокумент()
	ОбъектОбработки = ПолучитьОбъектОбработки();
	ДанныеХМЛ = ПрочитатьXMLИзBase64(ДанныеДокумента);
	РезультатПроверки = ОбъектОбработки.ДополнительныйОбработчикПринятиеДокумента(ДанныеХМЛ, ТипНовогоДокумента);
	Если РезультатПроверки.Свойство("РазрешеноПринятие") Тогда
		Если РезультатПроверки.РазрешеноПринятие = Ложь Тогда
			Если РезультатПроверки.Свойство("Причина") Тогда
				Сообщить(РезультатПроверки.Причина);
			КонецЕсли;
		КонецЕсли;
		Возврат РезультатПроверки.РазрешеноПринятие;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

&НаСервере
Функция СформироватьКвитанциюОПриеме()
	Если Найти(ТребуемыеДействия, "аннулирован") Тогда
		КонтентДляПодписи = Новый Соответствие;
		Для Каждого СтрокаТЧ Из СписокДокументовВЦепочке Цикл
			Если Найти(СтрокаТЧ.Представление, "аннулирован") Тогда
				КонтентДляПодписи.Вставить("success", Истина);
				КонтентДляПодписи.Вставить("content", СтрокаТЧ.Значение);
				КонтентДляПодписи.Вставить("id", СтрокаТЧ.Идентификатор); 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат КонтентДляПодписи;		
	Иначе
		ОбъектОбработки = ПолучитьОбъектОбработки();
		СтруктураДанных = Новый Структура("Идентификатор,Тип,Ссылка,СистемноеИмя", 
											ИдентификаторДокумента, 
											ТипНовогоДокумента, 
											?(ЗначениеЗаполнено(СсылкаНаДокумент), СсылкаНаДокумент, Новый Структура),
											СистемноеИмя);
		Возврат ОбъектОбработки.СоздатьXMLКвитанциюОПриемеИВернутьДляПодписания(СтруктураДанных);
	КонецЕсли;
КонецФункции

#КонецОбласти
#Область Отклонение_документа

&НаКлиенте
Процедура Отклонить(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтклонитьПослеВводаПричины", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,"","Причина отклонения",,Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПослеВводаПричины(СтрокаПричины = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если Объект.ЗапомнитьПароль Тогда
		ОтклонитьПослеВводаПароля(Объект.СессионныйПароль, Новый Структура("СтрокаПричины", СтрокаПричины) );
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтклонитьПослеВводаПароля", ЭтаФорма, Новый Структура("СтрокаПричины", СтрокаПричины) );
		ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьПослеВводаПароля(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Объект.СессионныйПароль = СтрокаПароля;
	
	Если ЭтоСвязанныйКонтейнер Тогда
		Для Каждого СтрокаКонтейнера Из СписокКонтейнера Цикл
			УстановитьПараметрыКарточки(СписокКонтейнера.Индекс(СтрокаКонтейнера) );
			ОбработатьДанныеДокумента();
			ОтклонитьЗавершение(СтрокаПароля, ДополнительныеПараметры);
		КонецЦикла;
	Иначе
		ОтклонитьЗавершение(СтрокаПароля, ДополнительныеПараметры);
	КонецЕсли;
	Закрыть();
		
	
КонецПроцедуры


&НаКлиенте
Процедура ОтклонитьЗавершение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	Если СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	Если ТребуетсяКвитанцияОбУточнении() Тогда
		КонтентДляПодписи = СформироватьКвитанциюОбОтклонении(ДополнительныеПараметры.СтрокаПричины);
	Иначе
		КонтентДляПодписи = Новый Соответствие;
		КонтентДляПодписи.Вставить("success", Истина);
		КонтентДляПодписи.Вставить("content", "ZW1wdHk=");  //empty in base64
		Если Найти(ГруппаПроцессинга, "bilateral") Тогда
			КонтентДляПодписи.Вставить("reason", ДополнительныеПараметры.СтрокаПричины);
			КонтентДляПодписи.Удалить("content");
		КонецЕсли;
	КонецЕсли;
	Если КонтентДляПодписи.Получить("success") <> Неопределено И КонтентДляПодписи.Получить("success") Тогда
		ВременныйФайл = ПолучитьИмяВременногоФайла(".xml");
		СтрокаПричины = КонтентДляПодписи.Получить("reason");
		Если ЗначениеЗаполнено(СтрокаПричины) Тогда
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.ДобавитьСтроку(СтрокаПричины);
			ТекстовыйДокумент.Записать(ВременныйФайл);	
			ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
			КонтентДляПодписи.Вставить("content", Base64Строка(ДвоичныеДанные) ); 
		КонецЕсли;
		
		Попытка
			СтрокаКонтента = КонтентДляПодписи.Получить("content");
			Если ЗначениеЗаполнено(СтрокаКонтента) Тогда
				ДвоичныеДанныеДокумента = Base64Значение(СтрокаКонтента);
				ДвоичныеДанныеДокумента.Записать(ВременныйФайл);
				Если Объект.ОтпечатокСертификата = Неопределено Тогда
					Возврат;
				КонецЕсли;
				СтрокаПодписи = ПодписатьДокументЭП(ВременныйФайл, СтрокаПароля);
			Иначе				
				СтрокаПодписи = "";	
			КонецЕсли;
			Если СтрокаПодписи = "" Тогда
				Возврат;
			КонецЕсли;
			Если Найти(ГруппаПроцессинга, "bilateral") И Не ТребуетсяКвитанцияОбУточнении() Тогда
				ОтправитьПодписаннуюКвитанцию(?(КонтентДляПодписи.Получить("id") = Неопределено, ИдентификаторДокумента, КонтентДляПодписи.Получить("id") ), 
												СтрокаКонтента, 
												СтрокаПодписи,
											    "ОтказПодписи");	
			Иначе	
				ОтправитьПодписаннуюКвитанцию(?(КонтентДляПодписи.Получить("id") = Неопределено, ИдентификаторДокумента, КонтентДляПодписи.Получить("id") ), 
												СтрокаКонтента, 
												СтрокаПодписи,
											    "Отклонить");
			КонецЕсли;
			Оповестить("ИзменениеСостоянияДокументовВОбработке");
			УдалитьФайлы(ВременныйФайл);
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание);
			УдалитьФайлы(ВременныйФайл);
		КонецПопытки;
	ИначеЕсли КонтентДляПодписи.Получить("success") <> Неопределено Тогда
		Сообщить(КонтентДляПодписи.Получить("codeDescription")
		+ Символы.ПС + ВернутьРазобранныйСписокПроблем(КонтентДляПодписи.Получить("violations") ) );	
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Функция ТребуетсяКвитанцияОбУточнении()
	Результат = Ложь;
	Если Найти(ТипНовогоДокумента, "УПД") ИЛИ Найти(НРег(НРег(ТипНовогоДокумента) ), "счет-фактура")
		ИЛИ Найти(ТипНовогоДокумента, "СЧФ") ИЛИ Найти(ТипНовогоДокумента, "УКД")
		ИЛИ Найти(НРег(ТипНовогоДокумента), "передаточ") ИЛИ Найти(НРег(ТипНовогоДокумента), "корректировоч")
		ИЛИ Найти(НРег(ТипНовогоДокумента), "накладная") ИЛИ Найти(НРег(ТипНовогоДокумента), "акт")
	Тогда
		Результат = Истина;
	КонецЕсли;
	Если Найти(ГруппаПроцессинга, "roaming_unformalized_bilateral") Тогда
		Результат = Истина;
	КонецЕсли;
	Возврат Результат;
КонецФункции


&НаСервере
Функция СформироватьКвитанциюОбОтклонении(Причина = "")
	Если Найти(ТребуемыеДействия, "аннулирован") Тогда
		КонтентДляПодписи = Новый Соответствие;
		Для Каждого СтрокаТЧ Из СписокДокументовВЦепочке Цикл
			Если Найти(СтрокаТЧ.Представление, "аннулирован") Тогда
				КонтентДляПодписи.Вставить("success", Истина);
				КонтентДляПодписи.Вставить("content", СтрокаТЧ.Значение);
				КонтентДляПодписи.Вставить("id", СтрокаТЧ.Идентификатор); 
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат КонтентДляПодписи;
	Иначе
		ОбъектОбработки = ПолучитьОбъектОбработки();
		СтруктураДанных = Новый Структура("Идентификатор,Тип,Ссылка,СистемноеИмя", 
											ИдентификаторДокумента, 
											ТипНовогоДокумента, 
											?(ЗначениеЗаполнено(СсылкаНаДокумент), СсылкаНаДокумент, Новый Структура),
											СистемноеИмя);
		СтруктураДанных.Вставить("Причина", Причина);
		Возврат ОбъектОбработки.СоздатьXMLКвитанциюОбУточненииИВернутьДляПодписания(СтруктураДанных);
	КонецЕсли;
КонецФункции

#КонецОбласти


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СессионныйПароль", Объект.СессионныйПароль);
	ПараметрыФормы.Вставить("ЗапомнитьПароль", Объект.ЗапомнитьПароль);
	Оповестить("DS_ПередачаДанныхПароля",ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "DS_ПередачаДанныхПароля" Тогда
		ЗаполнитьЗначенияСвойств(Объект, Параметр);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьИнфоПоля(Команда)
	ТекДок = Элементы.СписокДокументовВЦепочке.ТекущиеДанные;

	МассивТоваров = ПолучитьМассивТоваровДокумента(ТекДок.Значение);
	СтруктураПараметров = Новый Структура("МассивТоваров", МассивТоваров);
	ИмяФормыЗаполнения = ПолучитьПутьКОбработке() + "ФормаЗаполненияИнфоПолей"; 
	ФормаЗаполненияИнфоПолей = ПолучитьФорму(ИмяФормыЗаполнения,СтруктураПараметров,ЭтаФорма, Истина);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьИнфоПоляОбработкаВыбора", ЭтаФорма);
	ФормаЗаполненияИнфоПолей.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаЗаполненияИнфоПолей.РежимОткрытияОкна  = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаЗаполненияИнфоПолей.Открыть();
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьИнфоПоляОбработкаВыбора(ЗначениеВыбора, ДопПараметры = Неопределено) Экспорт
	Если ТипЗнч(ЗначениеВыбора) = Тип("Структура") Тогда
		ТекДок = Элементы.СписокДокументовВЦепочке.ТекущиеДанные;
		Если НЕ ЗначениеЗаполнено(ТекДок.ИмяФайла) Тогда
			УстановитьИнфоПоля(ТекДок.Значение, ЗначениеВыбора);
			ПросмотретьДанныеДокумента(ТекДок.Представление, ТекДок.Значение, ТекДок.Подписан);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура УстановитьИнфоПоля(ТекДанныеДокумента, СтруктураИнфоПолей)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	
	ПредставлениеДокумента = ПрочитатьXMLИзBase64(ТекДанныеДокумента);
	ТекДанныеДокумента = ОбработкаОбъект.ЗаменитьИнфоПоляВДокументе(ПредставлениеДокумента, СтруктураИнфоПолей);
		
КонецПроцедуры
&НаСервере
Функция ПолучитьМассивТоваровДокумента(ТекДанныеДокумента)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ПредставлениеДокумента = ПрочитатьXMLИзBase64(ТекДанныеДокумента);
	МассивТоваров = ОбработкаОбъект.ПолучитьМассивТоваровДокумента(ПредставлениеДокумента);
	Возврат МассивТоваров;
КонецФункции


#Область ОбработчикиЭлементовФорм

&НаСервере
Процедура УстановитьПараметрыКарточки(Знач СтрокаТаблицы)
	Если ТипЗнч(СтрокаТаблицы) = Тип("Число") Тогда
		СтрокаТаблицы = СписокКонтейнера.Получить(СтрокаТаблицы);
	КонецЕсли;
	СтатусДокумента = СтрокаТаблицы.СтатусДокумента;
	Элементы.ДекорацияНаименованиеДокумента.Заголовок = СтрокаТаблицы.Тип;
	ТипНовогоДокумента = СтрокаТаблицы.Тип;
	ИдентификаторДокумента = СтрокаТаблицы.ИдентификаторДокумента;
	ИдентификаторПакета = СтрокаТаблицы.ИдентификаторПакета;
	ТребуемыеДействия = СтрокаТаблицы.ТребуемыеДействия;
	Контрагент = СтрокаТаблицы.Контрагент;
	ГруппаПроцессинга = СтрокаТаблицы.ГруппаПроцессинга;	
КонецПроцедуры

&НаКлиенте
Процедура СписокКонтейнераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	УстановитьПараметрыКарточки(СписокКонтейнера.Индекс(Элемент.ТекущиеДанные) );
	ОбработатьДанныеДокумента();
КонецПроцедуры

#КонецОбласти

