
Процедура СозданиеДокументовРазмещенияВсвязиСпростоем() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.UserId,
	|	МАКСИМУМ(БуферАрмКладовщика.CreateDate) КАК CreateDate
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.UserId
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Объект,
	|	ВТ.UserId,
	|	ВТ.CreateDate
	|ИЗ
	|	ВТ КАК ВТ
	|ГДЕ
	|	РАЗНОСТЬДАТ(ВТ.CreateDate, &ТекущаяДата, МИНУТА) > &ВремяПростоя";
	
	Запрос.УстановитьПараметр("ВремяПростоя", Константы.ВремяПростояТСДкладовщика.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СоздатьДокументРазмещенияПоМестамХранения( РезультатЗапроса.Объект.УникальныйИдентификатор(), РезультатЗапроса.UserId.УникальныйИдентификатор(), Истина);		
	КонецЦикла; 
	
КонецПроцедуры

Функция ЕстьЛиТоварыВЯчейке(CellGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Результат = Ложь;
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellGUID));
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка = &Ячейка) КАК ТоварыВЯчейкахОстатки";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	УстановитьПривилегированныйРежим(Истина);			
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = Истина;
	КонецЕсли;                                                                               
	
	УстановитьПривилегированныйРежим(Ложь);			
	ЗаписатьЛог( UserIdСсылка, ТекущаяДата(), "", "Проверка - Есть ли товары в ячейке", Ячейка.Код);
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьЛиТоварВЯчейке(CellGUID, GoodGUID, UserIdGUID) Экспорт
	
	Результат = Ложь;
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID)); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка = &Ячейка
	|				И Номенклатура = &Номенклатура) КАК ТоварыВЯчейкахОстатки";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	УстановитьПривилегированныйРежим(Истина);			
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = Истина;
	КонецЕсли;                                                                               
	
	УстановитьПривилегированныйРежим(Ложь);			
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Есть ли товар в ячейке", 
	"Ячейка " + Ячейка.Код + "; Номенклатура " + Номенклатура.Наименование + "; Код " + Строка(Номенклатура.Код));   
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстатокТовара(GoodGUID, UserIdGUID) Экспорт
	
	Результат = 0;
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку( Новый УникальныйИдентификатор(GoodGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыВЯчейкахОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	УстановитьПривилегированныйРежим(Истина);			
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Результат = 0;
	Иначе       
		
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.КоличествоОстаток;     
		
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);			
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остаток товара", Номенклатура.Наименование + "; " + Строка(Номенклатура.Код));
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстатокНоменклатурыПоЯчейке(UserIdGUID, CellGUID, Barcode, GoodGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТоварыВЯчейкахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	ТоварыВЯчейкахОстатки.Номенклатура
	|ПОМЕСТИТЬ ОстатокЯчейка
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Ячейка = &Ячейка) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(БуферАРМ.Quantity) КАК Quantity,
	|	БуферАРМ.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ БуферАРМ
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМ
	|ГДЕ
	|	БуферАРМ.UserId = &UserId
	|	И БуферАРМ.ЯчейкаОткуда = &Ячейка
	|	И БуферАРМ.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстатокЯчейка.КоличествоОстаток, 0) КАК ОстатокВЯчейке,
	|	ЕСТЬNULL(БуферАРМ.Quantity, 0) КАК КоличествоНабрано
	|ИЗ
	|	ОстатокЯчейка КАК ОстатокЯчейка
	|		ЛЕВОЕ СОЕДИНЕНИЕ БуферАРМ КАК БуферАРМ
	|		ПО ОстатокЯчейка.Номенклатура = БуферАРМ.Номенклатура";                                        
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	
	УстановитьПривилегированныйРежим(Истина);			          
	ТЗ = Запрос.Выполнить().Выгрузить();			
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остаток номенклатуры по ячейке", НоменклатураСсылка.Наименование + " " + Ячейка.Код); 
	
	Возврат Результат;                                                             	
	
КонецФункции                    

Функция GetCollectAmountGoodFromCellInventory(UserIdGUID, ObjectGUID, CellGUID, Barcode, GoodGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =            
	"ВЫБРАТЬ
	|	СУММА(БуферАРМ.Quantity) КАК Quantity,
	|	БуферАРМ.Номенклатура КАК СсылкаТовара
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаИнвентПоЯчейкам КАК БуферАРМ
	|ГДЕ
	|	БуферАРМ.Объект = &ObjectGUID
	|	И БуферАРМ.UserId = &UserId         
	|	И БуферАРМ.Ячейка = &Ячейка
	|	И БуферАРМ.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМ.Номенклатура";                                        
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	
	ОбъектСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID) );		
	Запрос.УстановитьПараметр("ObjectGUID", ОбъектСсылка);
	
	УстановитьПривилегированныйРежим(Истина);			          
	ТЗ = Запрос.Выполнить().Выгрузить();			
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить набранное колво из РС БуферАРМКладовщикаИнвентПоЯчейкам", 
	НоменклатураСсылка.Наименование + " " + Ячейка.Код); 
	
	Возврат Результат;                                                             	
	
КонецФункции

Функция CheckCanUnlockCellsFromJobInventory(UserIdGUID, ObjectGUID, CellsXDTO) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	МассивЯчеек = СериализаторXDTO.ПрочитатьXDTO(CellsXDTO);
	
	МассивЯчеекСсылок = Новый Массив;   
	
	Для каждого Элемент Из МассивЯчеек Цикл
		МассивЯчеекСсылок.Добавить(Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент)));
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =            
	"ВЫБРАТЬ Количество(1) КАК КоличествоСтрок
	|	
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаИнвентПоЯчейкам КАК БуферАРМ
	|ГДЕ
	|	БуферАРМ.Объект   = &ObjectGUID
	|	И БуферАРМ.UserId = &UserId         
	|	И БуферАРМ.Ячейка В (&Ячейка)";                                        
	
	Запрос.УстановитьПараметр("Ячейка", МассивЯчеекСсылок);
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	ОбъектСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID) );		
	Запрос.УстановитьПараметр("ObjectGUID", ОбъектСсылка);
	
	УстановитьПривилегированныйРежим(Истина);			          
	РезультатЗапроса = Запрос.Выполнить().Выбрать();			
	РезультатЗапроса.Следующий();          
	
	Если РезультатЗапроса.КоличествоСтрок > 0 Тогда
		Результат = Ложь;
	Иначе
		Результат = Истина;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Возможно ли разблокировать ячейки", 
	СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивЯчеекСсылок));
	
	Возврат Результат;                                                             	
	
КонецФункции

Функция ПолучитьСписокЗаписейИзБуфераИнвентаризации(UserIdGUID, ObjectGUID, Cell) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст =            
	"ВЫБРАТЬ
	|	БуферАРМ.Объект,
	|	БуферАРМ.Номенклатура КАК СсылкаТовара,
	|	БуферАРМ.Ячейка КАК СсылкаЯчейки,	
	|	МАКСИМУМ(СпрНоменклатура.Наименование) КАК НаименованиеТовара,		
	|	ЕСТЬNULL(СпрНоменклатура.Родитель.Наименование, """") КАК Производитель,
	|	СпрНоменклатура.КодПроизводителя  КАК КодПроизводителяТовара,
	|   МАКСИМУМ(БуферАРМ.Ячейка.Код) КАК ЯчейкаКод,
	|	СУММА(БуферАРМ.Quantity) КАК КоличествоТовара	
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаИнвентПоЯчейкам КАК БуферАРМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО БуферАРМ.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	БуферАРМ.Объект = &ObjectGUID
	|	И БуферАРМ.UserId = &UserId
	|	И БуферАРМ.Ячейка = &Ячейка
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМ.Объект,
	|	БуферАРМ.Номенклатура,
	|	БуферАРМ.Ячейка,
	|	СпрНоменклатура.КодПроизводителя,
	|	ЕСТЬNULL(СпрНоменклатура.Родитель.Наименование, """")";                                        
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Cell));                                                          
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	ОбъектСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));		
	Запрос.УстановитьПараметр("ObjectGUID", ОбъектСсылка);
	
	УстановитьПривилегированныйРежим(Истина);			          
	ТЗ = Запрос.Выполнить().Выгрузить();			
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список товаров из буфера инвентаризации", Ячейка);
	
	Возврат Результат;                                                             	
	
КонецФункции

// 1. Данный метод возвращает товары в ячейке 
// 2. Возвращает boolean, если есть ли товары в ячейке
Функция ПолучитьСписокНоменклатурПоЯчейке(UserIdGUID, CellGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМ.Номенклатура КАК Номенклатура,
	|	СУММА(БуферАРМ.Quantity) КАК Количество
	|ПОМЕСТИТЬ ДанныеПоДокументу
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМ
	|ГДЕ
	|	БуферАРМ.UserId = &UserId
	|	И БуферАРМ.ЯчейкаОткуда = &Ячейка
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Товар,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ДанныеПоЯчейке
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка = &Ячейка) КАК ТоварыВЯчейкахОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОбороты.Номенклатура,
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.КоличествоОборот < 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОбороты.Период, СЕКУНДА, -1)
	|		ИНАЧЕ ТоварыВЯчейкахОбороты.Период
	|	КОНЕЦ КАК Период
	|ПОМЕСТИТЬ Обороты
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(
	|			,
	|			,
	|			Запись,
	|			Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ДанныеПоЯчейке.Товар
	|					ИЗ
	|						ДанныеПоЯчейке)
	|				И Ячейка = &Ячейка) КАК ТоварыВЯчейкахОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОбороты.Номенклатура,
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОбороты.КоличествоОборот < 0
	|			ТОГДА ДОБАВИТЬКДАТЕ(ТоварыВЯчейкахОбороты.Период, СЕКУНДА, -1)
	|		ИНАЧЕ ТоварыВЯчейкахОбороты.Период
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	Обороты.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ЯчейкиХранения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Обороты.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(Обороты.Период) КАК Период
	|	ИЗ
	|		Обороты КАК Обороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Обороты.Номенклатура) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Обороты КАК Обороты
	|		ПО ВложенныйЗапрос.Номенклатура = Обороты.Номенклатура
	|			И ВложенныйЗапрос.Период = Обороты.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоЯчейке.Товар КАК СсылкаТовара,
	|	ДанныеПоЯчейке.КоличествоОстаток КАК КоличествоОстаток,
	|	ЕСТЬNULL(ДанныеПоДокументу.Количество, 0) КАК КоличествоТовараНабрано,
	|	ЕСТЬNULL(Ячейки.Код, """") КАК Ячейка
	|ПОМЕСТИТЬ ПредварИтог
	|ИЗ
	|	ДанныеПоЯчейке КАК ДанныеПоЯчейке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоДокументу КАК ДанныеПоДокументу
	|		ПО ДанныеПоЯчейке.Товар = ДанныеПоДокументу.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЯчейкиХранения КАК ЯчейкиХранения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Ячейки КАК Ячейки
	|			ПО ЯчейкиХранения.Ячейка = Ячейки.Ссылка
	|		ПО ДанныеПоЯчейке.Товар = ЯчейкиХранения.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СсылкаТовара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОбороты.Склад,
	|	ТоварыВЯчейкахОбороты.Номенклатура КАК СсылкаТовара,
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	СУММА(ТоварыВЯчейкахОбороты.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ТоварыВЯчейкахОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ТоварыВЯчейкахОбороты.КоличествоРасход) КАК КоличествоРасход
	|ПОМЕСТИТЬ ОборотыЗаПериод
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(
	|			&ДатаНачала,
	|			&ДатаКонца,
	|			Регистратор,
	|			Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ДанныеПоЯчейке.Товар
	|					ИЗ
	|						ДанныеПоЯчейке)
	|				И Ячейка = &Ячейка) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТовараПоЯчейкам
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОбороты.Номенклатура,
	|	ТоварыВЯчейкахОбороты.Склад,
	|	ТоварыВЯчейкахОбороты.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварИтог.СсылкаТовара,
	|	ПредварИтог.КоличествоОстаток,
	|	ПредварИтог.КоличествоТовараНабрано,
	|	Номенклатура.Наименование КАК НаименованиеТовара,
	|	Номенклатура.КодПроизводителя КАК КодПроизводителяТовара,
	|	ЕдиницыИзмерения.Код КАК КодЕдиИзм,
	|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
	|	Номенклатура.Кратность,
	|	ПредварИтог.Ячейка,
	|	ЕСТЬNULL(Номенклатура.Родитель.Наименование, """") КАК Производитель,
	|	ЕСТЬNULL(ОборотыЗаПериод.КоличествоПриход, 0) КАК КоличествоПриходОбороты,
	|	ЕСТЬNULL(ОборотыЗаПериод.КоличествоРасход, 0) КАК КоличествоРасходОбороты,
	|	ЕстьNULL(ПредварИтог.СсылкаТовара.ГруппаАВСФилиала.Наименование,""Е"") КАК ГруппаАВСФилиала
	|ИЗ                                                       
	|	ПредварИтог КАК ПредварИтог
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ПредварИтог.СсылкаТовара = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыЗаПериод КАК ОборотыЗаПериод
	|		ПО ПредварИтог.СсылкаТовара = ОборотыЗаПериод.СсылкаТовара";
	
	Ячейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	Запрос.УстановитьПараметр("ДатаНачала", Новый Граница(ТекущаяДата() - 60*30, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	
	УстановитьПривилегированныйРежим(Истина);			          
	ТЗ = Запрос.Выполнить().Выгрузить();			
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список номенклатур из ячейки", Ячейка.Код); 
	
	Возврат Результат;                                                             
	
КонецФункции

Функция ПроверитьДоступКARMStoreKeeper(Barcode, Password) Экспорт
	
	Результат = Ложь;    
	
	Если ЗначениеЗаполнено(Barcode) Тогда
		ЗначениеДляПоиска = СокрЛП(Barcode);	
	Иначе        
		
		Password = СокрЛП(Password);
		ЗначениеДляПоиска = Формат(Password, "ЧЦ=5; ЧВН=; ЧГ=0");   
		
	КонецЕсли;                       
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("Ошибка", "");
	
	Запрос = Новый Запрос;                                                                 
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка,
	|	ПОДСТРОКА(ФизическиеЛица.Код, 5, 5) КАК Код,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.АРМКладовщика,
	|	НЕ КатегорииОбъектов.Категория ЕСТЬ NULL КАК РазрешеноПроведениеПТУ,
	|	НЕ КатегорииОбъектовСлЗаписка.Категория ЕСТЬ NULL КАК ОтображатьСлужебныеЗапискиТСД,
	|	НЕ КатегорииОбъектовТЕ.Категория ЕСТЬ NULL КАК ОтображатьТЕ,
	|	НЕ КатегорииОбъектовМаркировка.Категория ЕСТЬ NULL КАК ОтображатьМаркировкуТоваров,   
	//+Шульман А. 13.11.2025 #UT10-5504
	|	НЕ КатегорииОбъектовПроверкаКМ.Категория ЕСТЬ NULL КАК РазрешитьПриниматьКМБезПроверкиСостояния   
	//-Шульман А. 13.11.2025 #UT10-5504
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО ФизическиеЛица.Ссылка = КатегорииОбъектов.Объект
	|			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.РазрешеноПроведениеПТУСТСД))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовСлЗаписка
	|		ПО ФизическиеЛица.Ссылка = КатегорииОбъектовСлЗаписка.Объект
	|			И (КатегорииОбъектовСлЗаписка.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтображатьСлужебныеЗапискиТСД))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовТЕ
	|		ПО ФизическиеЛица.Ссылка = КатегорииОбъектовТЕ.Объект
	|			И (КатегорииОбъектовТЕ.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОбъединятьГМВТЕ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовМаркировка
	|		ПО ФизическиеЛица.Ссылка = КатегорииОбъектовМаркировка.Объект
	|			И (КатегорииОбъектовМаркировка.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтображатьМаркировкуТоваровТСД))   
	//+Шульман А. 13.11.2025 #UT10-5504
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовПроверкаКМ
	|		ПО ФизическиеЛица.Ссылка = КатегорииОбъектовПроверкаКМ.Объект
	|			И (КатегорииОбъектовПроверкаКМ.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.РазрешитьПриниматьКМБезПроверкиСостояния))   
	//-Шульман А. 13.11.2025 #UT10-5504
	|ГДЕ
	|	ФизическиеЛица.Код ПОДОБНО &Код
	|	И ФизическиеЛица.АРМКладовщика";
		
	Запрос.УстановитьПараметр("Код", "%" + ЗначениеДляПоиска);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();   
	
	Если РезультатЗапроса.Количество() = 0  Тогда
		
		ДанныеОтвета.Вставить("Ошибка", "Данный пользователь не имеет прав доступа.");	
		Результат = ДанныеВJSONХранилище(ДанныеОтвета);	
		Возврат Результат;     
		
	КонецЕсли; 
	
	РезультатЗапроса.Следующий();
	ДанныеОтвета.Вставить("Пользователь"                  , РезультатЗапроса.Код);
	ДанныеОтвета.Вставить("ПолноеИмя"                     , РезультатЗапроса.Наименование);		
	ДанныеОтвета.Вставить("ПользовательГУИД"              , XMLСтрока(РезультатЗапроса.Ссылка));		
	ДанныеОтвета.Вставить("РазрешеноПроведениеПТУ"        , РезультатЗапроса.РазрешеноПроведениеПТУ);
	ДанныеОтвета.Вставить("ОтображатьСлужебныеЗапискиТСД" , РезультатЗапроса.ОтображатьСлужебныеЗапискиТСД);
	ДанныеОтвета.Вставить("ОтображатьТЕ"                  , РезультатЗапроса.ОтображатьТЕ);
	
	//+Кабанов А.В. 21.07.2025 # UT10-5343 
	ДанныеОтвета.Вставить("ОтображатьМаркировкуТоваров"   , РезультатЗапроса.ОтображатьМаркировкуТоваров);
	//-Кабанов А.В. 21.07.2025 # UT10-5343 
	
	//+Шульман А. 13.11.2025 #UT10-5504    
	ДанныеОтвета.Вставить("РазрешитьПриниматьКМБезПроверкиСостояния" , РезультатЗапроса.РазрешитьПриниматьКМБезПроверкиСостояния);  
	ДанныеОтвета.Вставить("РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ" , Константы.РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ.Получить());
	//-Шульман А. 13.11.2025 #UT10-5504    
	
	//+Шульман А. 20.11.2025 #UT10-5518
	ДанныеОтвета.Вставить("ПроверятьСоответствиеКодаТоваруПоGTIN" , Константы.ПроверятьСоответствиеКодаТоваруПоGTIN.Получить());
	//-Шульман А. 20.11.2025 #UT10-5518
	
	//+Кабанов А.В. 13.08.2025 # UT10-5360
	Если ЗначениеЗаполнено(Константы.ЯчейкаДляМаркировки.Получить()) Тогда
		ДанныеОтвета.Вставить("ЯчейкаДляМаркировки"   , СокрЛП(XMLСтрока(Константы.ЯчейкаДляМаркировки.Получить())));
	КонецЕсли;
	//-Кабанов А.В. 13.08.2025 # UT10-5360  
	
	//+Шульман А. 13.11.2025 #UT10-5504      
	Если ЗначениеЗаполнено(Константы.ЯчейкаДляМаркировки.Получить()) Тогда
		ДанныеОтвета.Вставить("ЯчейкаДляПеремаркировки"   , СокрЛП(XMLСтрока(Константы.ЯчейкаДляПеремаркировки.Получить())));
	КонецЕсли;
	
	ДанныеОтвета.Вставить("ПроверятьСостояниеКодаВЧЗ", Константы.ПроверятьСостояниеКодаВЧЗ.Получить());   
	
	Если ЗначениеЗаполнено(Константы.ЯчейкаДляВозвратаПоставщику.Получить()) Тогда
		ДанныеОтвета.Вставить("ЯчейкаДляВозврата"   , СокрЛП(XMLСтрока(Константы.ЯчейкаДляВозвратаПоставщику.Получить())));
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(Константы.ОсновнаяОрганизация.Получить()) Тогда
		ДанныеОтвета.Вставить("КодМДМГоловнойОрганизации"   , СокрЛП(Константы.ОсновнаяОрганизация.Получить().КодМДМГоловнойОрганизации));
	КонецЕсли;
	
	ДанныеОтвета.Вставить("АдресСервераЧестныйЗнак"   , СокрЛП(Константы.АдресСервераЧестныйЗнак.Получить()));
	//-Шульман А. 13.11.2025 #UT10-5504        
	
	//+Шульман А. 28.11.2025 #UT10-5550  
	ДанныеОтвета.Вставить("СверятьКодыСОжидаемымиПриПриемке" , Константы.СверятьКодыСОжидаемымиПриПриемке.Получить());   
	//-Шульман А. 28.11.2025 #UT10-5550
	
	//+Сёмин Р.И. 29.04.2026 #UT10-5814
	ДанныеОтвета.Вставить("ИспользоватьНовыйМеханизмПроверкиКодовМаркировки", Константы.ИспользоватьНовыйМеханизмПроверкиКодовМаркировки.Получить());
	//-Сёмин Р.И. 29.04.2026 #UT10-5814
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5915
	ДанныеОтвета.Вставить("ПроверятьНарушенияСроковГодностиКИЗ", Константы.ПроверятьНарушенияСроковГодностиКИЗ.Получить());
	//-Сёмин Р.И. 24.06.2026 #UT10-5915
	
	Результат = ДанныеВJSONХранилище(ДанныеОтвета);
	
	ЗаписатьЛог(РезультатЗапроса.Ссылка, ТекущаяДата(), "", "Authentication User", "Barcode " + Barcode + "; password " + РезультатЗапроса.Ссылка.Наименование);
	Возврат Результат;                           
	
КонецФункции                              

Функция НайтиПользователя(Barcode, Password) Экспорт
	
	//+Шульман А. 28.11.2025 #UT10-5548
	Результат = Ложь;    
	
	Если ЗначениеЗаполнено(Barcode) Тогда
		ЗначениеДляПоиска = СокрЛП(Barcode);	
	Иначе        
		
		Password = СокрЛП(Password);
		ЗначениеДляПоиска = Формат(Password, "ЧЦ=5; ЧВН=; ЧГ=0");   
		
	КонецЕсли;                       
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("Ошибка", "");
	
	Запрос = Новый Запрос;                                                                 
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка,
	|	ПОДСТРОКА(ФизическиеЛица.Код, 5, 5) КАК Код,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.АРМКладовщика
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Код ПОДОБНО &Код
	|	И ФизическиеЛица.АРМКладовщика";
		
	Запрос.УстановитьПараметр("Код", "%" + ЗначениеДляПоиска);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();   
	
	Если РезультатЗапроса.Количество() = 0  Тогда
		
		ДанныеОтвета.Вставить("Ошибка", "Данный пользователь не имеет прав доступа.");	
		Результат = ДанныеВJSONХранилище(ДанныеОтвета);	
		Возврат Результат;     
		
	КонецЕсли; 
	
	РезультатЗапроса.Следующий();
	ДанныеОтвета.Вставить("Пользователь"                  , РезультатЗапроса.Код);
	ДанныеОтвета.Вставить("ПолноеИмя"                     , РезультатЗапроса.Наименование);		
	ДанныеОтвета.Вставить("ПользовательГУИД"              , XMLСтрока(РезультатЗапроса.Ссылка));		
	
	Результат = ДанныеВJSONХранилище(ДанныеОтвета);
	
	ЗаписатьЛог(РезультатЗапроса.Ссылка, ТекущаяДата(), "", "Find user", "Barcode " + Barcode + "; password " + РезультатЗапроса.Ссылка.Наименование);
	Возврат Результат;  
	//-Шульман А. 28.11.2025 #UT10-5548
	
КонецФункции                              


Функция ПолучитьИнформациюПоПользователю(UserIdGUID, Password) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Password = СокрЛП(Password);
	ЗначениеДляПоиска = Формат(Число(Password), "ЧЦ=5; ЧВН=; ЧГ=0");
	
	Запрос = Новый Запрос;                                                                 
	Запрос.Текст = 	
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицоГУИД,
	|	ПОДСТРОКА(ФизическиеЛица.Код, 5, 5) КАК Код,
	|	ФизическиеЛица.Наименование,
	|	ФизическиеЛица.АРМКладовщика,
	|	Пользователи.Должность
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ФизическиеЛица.Ссылка = Пользователи.ФизЛицо
	|ГДЕ
	|	ФизическиеЛица.Код ПОДОБНО &Код
	|	И ФизическиеЛица.АРМКладовщика";   
	
	Запрос.УстановитьПараметр("Код", "%" + ЗначениеДляПоиска);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();                          
	УстановитьПривилегированныйРежим(Истина);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	УстановитьПривилегированныйРежим(Ложь);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить информацию о физическом лице", ЗначениеДляПоиска); 
	
	Возврат Результат;                                                             	
	
КонецФункции

Функция ВыгрузитьДанныеИзРСвЗаданиеНаИнвентаризацию(UserIdGUID, DocumentGUID, Cells, DeleteRecordsFromBuffer) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	МассивЯчеек = СериализаторXDTO.ПрочитатьXDTO(Cells);
	
	МассивЯчеекСсылок = Новый Массив;   
	
	Для каждого Элемент Из МассивЯчеек Цикл
		МассивЯчеекСсылок.Добавить(Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент)));
	КонецЦикла; 
	
	ДокументСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Объект,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.UserId,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Номенклатура КАК Номенклатура,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Ячейка КАК Ячейка,
	|	МАКСИМУМ(БуферАРМКладовщикаИнвентПоЯчейкам.ВведеноВРучную) КАК ВведеноВРучную,
	|	СпрНоменклатура.КодПроизводителя КАК КодПроизводителя,
	|	МАКСИМУМ(ЕдиницыИзмерения.Коэффициент) КАК ЕдХранОстатковКоэффициент,
	|	МАКСИМУМ(СпрНоменклатура.Родитель.Наименование) КАК Производитель,
	|	СУММА(БуферАРМКладовщикаИнвентПоЯчейкам.Quantity) КАК КоличествоФакт,
	|	КОЛИЧЕСТВО(БуферАРМКладовщикаИнвентПоЯчейкам.Номенклатура) КАК КоличествоСтрок
	|ПОМЕСТИТЬ РегСведВТ
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаИнвентПоЯчейкам КАК БуферАРМКладовщикаИнвентПоЯчейкам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СпрНоменклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И СпрНоменклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО БуферАРМКладовщикаИнвентПоЯчейкам.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Объект = &Объект
	|	И БуферАРМКладовщикаИнвентПоЯчейкам.UserId = &UserId
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Объект,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.UserId,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Номенклатура,
	|	БуферАРМКладовщикаИнвентПоЯчейкам.Ячейка,
	|	СпрНоменклатура.КодПроизводителя
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАРМКладовщикаИнвентПоЯчейкам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК КоличествоУчетное,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	ЕдиницыИзмерения.Коэффициент КАК ЕдХранОстатковКоэффициент,
	|	СпрНоменклатура.Родитель.Наименование КАК Производитель,
	|	СпрНоменклатура.КодПроизводителя
	|ПОМЕСТИТЬ ОстаткиВТ
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В (&МассивЯчеек)
	|				И Склад = &Склад) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СпрНоменклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И СпрНоменклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ТоварыВЯчейкахОстатки.Номенклатура = СпрНоменклатура.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданНаИнвентовары.Ссылка,
	|	ЗаданНаИнвентовары.Уровень,
	|	ЗаданНаИнвентовары.Номенклатура,
	|	ЗаданНаИнвентовары.Ячейка,
	|	ЗаданНаИнвентовары.КодПроизводителя,
	|	ЗаданНаИнвентовары.Производитель,
	|	ЕдиницыИзмерения.Коэффициент КАК ЕдХранОстатковКоэффициент
	|ПОМЕСТИТЬ ВТТаблЧастьТовары
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданНаИнвентовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СпрНоменклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И СпрНоменклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ЗаданНаИнвентовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ЗаданНаИнвентовары.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиВТ.Номенклатура, РегСведВТ.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиВТ.Ячейка, РегСведВТ.Ячейка) КАК Ячейка,
	|	ЕСТЬNULL(ОстаткиВТ.КоличествоУчетное, 0) КАК КоличествоУчетное,
	|	ЕСТЬNULL(РегСведВТ.КоличествоФакт, 0) КАК КоличествоФакт,
	|	ЕСТЬNULL(РегСведВТ.КоличествоСтрок, 0) КАК КоличествоСтрок,
	|	ЕСТЬNULL(РегСведВТ.ВведеноВРучную, 0) КАК ВведеноВРучную,
	|	ЕСТЬNULL(РегСведВТ.ЕдХранОстатковКоэффициент, ОстаткиВТ.ЕдХранОстатковКоэффициент) КАК ЕдХранОстатковКоэффициент,
	|	ЕСТЬNULL(РегСведВТ.Производитель, ОстаткиВТ.Производитель) КАК Производитель,
	|	ЕСТЬNULL(РегСведВТ.КодПроизводителя, ОстаткиВТ.КодПроизводителя) КАК КодПроизводителя
	|ПОМЕСТИТЬ ВТИтогИнвент
	|ИЗ
	|	РегСведВТ КАК РегСведВТ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ОстаткиВТ КАК ОстаткиВТ
	|		ПО РегСведВТ.Номенклатура = ОстаткиВТ.Номенклатура
	|			И РегСведВТ.Ячейка = ОстаткиВТ.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТИтогИнвент.Номенклатура, ВТТаблЧастьТовары.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТИтогИнвент.Ячейка, ВТТаблЧастьТовары.Ячейка) КАК Ячейка,
	|	ЕСТЬNULL(ВТИтогИнвент.КоличествоУчетное, 0) КАК КоличествоУчетное,
	|	ЕСТЬNULL(ВТИтогИнвент.КоличествоФакт, 0) КАК КоличествоФакт,
	|	ЕСТЬNULL(ВТИтогИнвент.КоличествоСтрок, 0) КАК КоличествоСтрок,
	|	ЕСТЬNULL(ВТИтогИнвент.ВведеноВРучную, 0) КАК ВведеноВРучную,
	|	ЕСТЬNULL(ВТИтогИнвент.ЕдХранОстатковКоэффициент, ВТТаблЧастьТовары.ЕдХранОстатковКоэффициент) КАК ЕдХранОстатковКоэффициент,
	|	ЕСТЬNULL(ВТИтогИнвент.Производитель, ВТТаблЧастьТовары.Производитель) КАК Производитель,
	|	ЕСТЬNULL(ВТИтогИнвент.КодПроизводителя, ВТТаблЧастьТовары.КодПроизводителя) КАК КодПроизводителя,
	|	ЕСТЬNULL(ВТТаблЧастьТовары.Уровень, 0) КАК Уровень
	|ПОМЕСТИТЬ ВТПредварРезультат
	|ИЗ
	|	ВТИтогИнвент КАК ВТИтогИнвент
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТаблЧастьТовары КАК ВТТаблЧастьТовары
	|		ПО ВТИтогИнвент.Номенклатура = ВТТаблЧастьТовары.Номенклатура
	|			И ВТИтогИнвент.Ячейка = ВТТаблЧастьТовары.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПредварРезультат.Номенклатура,
	|	СУММА(ВТПредварРезультат.КоличествоФакт) КАК КоличествоФакт,
	|	СУММА(ВТПредварРезультат.КоличествоУчетное) КАК КоличествоУчетное,
	|	СУММА(ВТПредварРезультат.КоличествоФакт - ВТПредварРезультат.КоличествоУчетное) КАК РасхождениеПоКоличеству,
	|	СУММА(ВЫБОР
	|			КОГДА ВТПредварРезультат.КоличествоФакт > ВТПредварРезультат.КоличествоУчетное
	|				ТОГДА ВТПредварРезультат.КоличествоФакт - ВТПредварРезультат.КоличествоУчетное
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НедостатокПоУчету,
	|	СУММА(ВЫБОР
	|			КОГДА ВТПредварРезультат.КоличествоФакт < ВТПредварРезультат.КоличествоУчетное
	|				ТОГДА ВТПредварРезультат.КоличествоФакт - ВТПредварРезультат.КоличествоУчетное
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НедостатокПоФакту,
	|	МАКСИМУМ(ВТПредварРезультат.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ВТИтогИнвентГруппир
	|ИЗ
	|	ВТПредварРезультат КАК ВТПредварРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТПредварРезультат.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТПредварРезультат.Номенклатура,
	|	ВТПредварРезультат.Ячейка,
	|	ВТПредварРезультат.КоличествоУчетное,
	|	ВТПредварРезультат.КоличествоФакт,
	|	ВТПредварРезультат.КоличествоСтрок,
	|	ВТПредварРезультат.ВведеноВРучную,
	|	ВТПредварРезультат.ЕдХранОстатковКоэффициент,
	|	ВТПредварРезультат.Производитель,
	|	ВТПредварРезультат.КодПроизводителя,
	|	ВТИтогИнвентГруппир.РасхождениеПоКоличеству,
	|	ISNULL(ВТИтогИнвентГруппир.Уровень, ВТПредварРезультат.Уровень) КАК Уровень
	|ИЗ
	|	ВТПредварРезультат КАК ВТПредварРезультат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИтогИнвентГруппир КАК ВТИтогИнвентГруппир
	|		ПО ВТПредварРезультат.Номенклатура = ВТИтогИнвентГруппир.Номенклатура";
	
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	Запрос.УстановитьПараметр("Объект", ДокументСсылка);
	Запрос.УстановитьПараметр("МассивЯчеек", МассивЯчеекСсылок);
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0  Тогда	
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "Отсутствуют проинвентаризируемые и учетные товары в ячейках.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                              
	
	ЕстьНеНулевоеОтклонение = Ложь; 
	
	Попытка
		
		ДокументОбъект.АРМКладовщика = Истина;
		ДокументОбъект.ДатаВыполнения = ТекущаяДата();
		ДокументОбъект.Комментарий = ДокументОбъект.Комментарий + " ТСД; ";
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Загружены данные из РС (БуферАРМКладовщикаИнвентПоЯчейкам) в документ задание на инвентаризацию", 
		Строка(ДокументОбъект.Номер)); 
		
		// Очищаем табличную часть товары, и заливаем данные с учетом текущих остатков		
		ДокументОбъект.Товары.Очистить();
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			Товар = ДокументОбъект.Товары.Добавить();	
			ЗаполнитьЗначенияСвойств(Товар, РезультатЗапроса);  
			
			Если Товар.КоличествоФакт = 0 И РезультатЗапроса.КоличествоСтрок > 0 Тогда	
				
				Товар.КоличествоФакт = РезультатЗапроса.КоличествоСтрок * РезультатЗапроса.ЕдХранОстатковКоэффициент;
				ТекстОшибки = "ЗаданиеНаИнвентаризацию "+ ДокументСсылка + " Товар " + Товар.Номенклатура + " строк " + Строка(РезультатЗапроса.КоличествоСтрок) +
				" коэфф " + Строка(РезультатЗапроса.ЕдХранОстатковКоэффициент);
				ЗаписьЖурналаРегистрации("Android нулевое количество товара", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 		
				
			КонецЕсли; 
			
			Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;
			Товар.Отклонение = Товар.КоличествоФакт - Товар.КоличествоУчетное;

			Если РезультатЗапроса.РасхождениеПоКоличеству <> 0 Тогда
				Товар.РасхождениеНоменклатуры = Истина;
			КонецЕсли; 
			
			Если Товар.Отклонение <> 0 Тогда
				ЕстьНеНулевоеОтклонение = Истина;				
			КонецЕсли; 
			
			Если Товар.Уровень = 0 Тогда
				Товар.Уровень = 1;
			КонецЕсли; 
			
		КонецЦикла; 
		
		Попытка
			
			Если ЕстьНеНулевоеОтклонение И Не ДокументОбъект.РегламентноеЗадание Тогда		
				ДокументОбъект.ОтклонениеПоКоличеству = Истина;
			КонецЕсли;
			
			ДокументОбъект.Записать();						
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ задание на инвентаризацию", Строка(ДокументОбъект.Номер)); 
			
			Попытка				
				
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);								
				УстановитьБлокирокуЯчеек(DocumentGUID, Cells, Ложь, UserIdGUID);				
				ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ задание на инвентаризацию проведен", Строка(ДокументОбъект.Номер)); 
				
				Если DeleteRecordsFromBuffer = Истина Тогда
					
					РС = РегистрыСведений.БуферАРМКладовщикаИнвентПоЯчейкам.СоздатьНаборЗаписей();
					РС.Отбор.Объект.Установить(ДокументСсылка);
					РС.Отбор.UserId.Установить(UserIdСсылка);
					РС.Записать();
					
				КонецЕсли; 
				
				//===========================================================================================
				//===========================================================================================
				Если ЕстьНеНулевоеОтклонение Тогда		
					
					ЕстьОшибки = Ложь;
					НомерИнвент = Строка(ДокументОбъект.Ссылка);                              
					
					ТекстОшибки = СоздатьПеремещениеТовараДляСтрокСпризнакомРасхождениеНоменкатуры(ДокументОбъект.Ссылка);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда						
						
						ТекстОшибки = "Невозможно создать перемещ. факт.кол-во больше факта (РасхожденияПоНоменклатуре), " + ТекстОшибки;
						ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 												
						ЕстьОшибки = Истина;
						
					КонецЕсли; 
					
					ТекстОшибки = СоздатьПеремещениеТовараДляСтрокВторогоУровня(ДокументОбъект.Ссылка);
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда						
						
						ТекстОшибки = "Невозможно создать перемещ.учет.кол-во больше факта, " + ТекстОшибки;
						ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 												
						ЕстьОшибки = Истина;
						
					КонецЕсли; 
					
					Если Не ЕстьОшибки  Тогда
						
						ТекстОшибки = СоздатьРазмещениеТовараДляСтрокВторогоУровня(ДокументОбъект.Ссылка);
						
						Если ЗначениеЗаполнено(ТекстОшибки) Тогда						
							
							ТекстОшибки = "Невозможно создать перемещ. факт.кол-во больше плана, " + ТекстОшибки;
							ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 												
							ЕстьОшибки = Истина;
							
						КонецЕсли; 											
						
					КонецЕсли; 
					
					Если Не ЕстьОшибки  Тогда						
						
						ТекстОшибки = ПроанализироватьСтрокиСРасхождениемДляОсновныхЯчеек(ДокументОбъект.Ссылка);									
						
						Если ЗначениеЗаполнено(ТекстОшибки) Тогда																						
							
							ТекстОшибки = "Невозможно создать задан на инвент для основ.ячеек, " + ТекстОшибки;
							ЗаписьЖурналаРегистрации("Ошибка", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 																		
							ЕстьОшибки = Истина;
							
						КонецЕсли;                                                      						
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекстОшибки) Тогда						
						
						ОтменитьТранзакцию();			
						Результат.Вставить("Ошибка", ТекстОшибки);
						Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
						Возврат Результат;				
						
					КонецЕсли;
					
				КонецЕсли;
				//===========================================================================================
				//===========================================================================================
				
				ЗафиксироватьТранзакцию();
				
			Исключение	
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = "Документ """ + ДокументОбъект.Ссылка + """ успешно записан в базу 1С, но не проведен.";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;				
				
			КонецПопытки; 
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = "Ошибка при записи документа в 1С: " + ОписаниеОшибки()+".";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецПопытки;           
		
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("НомерДокумента", ДокументОбъект.Номер);
		Результат.Вставить("ДатаДокумента", ДокументОбъект.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		//ОтменитьТранзакцию();
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("Ошибка", ОписаниеОшибки()); 
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
		Возврат Результат;
		
	КонецПопытки;                                
	
КонецФункции

Функция СоздатьПеремещениеТовараДляСтрокСпризнакомРасхождениеНоменкатуры(ЗаданиеСсылка) Экспорт
	
	ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();	
	
	Если НЕ ЗаданиеОбъект.АРМКладовщика Или НЕ ЗначениеЗаполнено(ЗаданиеОбъект.ДатаВыполнения) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗаданиеОбъект.ДокумПеремФактБольшеПланаРасхожНомен) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТовараПоЯчейкам.Ссылка КАК Ссылка,
		|	ПеремещениеТовараПоЯчейкам.Проведен
		|ИЗ
		|	Документ.ПеремещениеТовараПоЯчейкам КАК ПеремещениеТовараПоЯчейкам
		|ГДЕ
		|	ПеремещениеТовараПоЯчейкам.Ссылка = &Ссылка
		|	И ПеремещениеТовараПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТовараПоЯчейкам.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";                            
		
		Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.ДокумПеремФактБольшеПланаРасхожНомен);
		Запрос.УстановитьПараметр("ДокументОснование", ЗаданиеОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Возврат "";
		КонецЕсли; 				 
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура КАК Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка,
	|	ЗаданиеНаИнвентаризациюТовары.КоличествоФакт КАК КоличествоФакт,
	|	ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное КАК КоличествоУчетное,
	|	ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И НЕ ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры
	|	И ЗаданиеНаИнвентаризациюТовары.КоличествоФакт > ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоФакт УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеСсылка);
	
	ТоварыДляПеремещенияВячейки = Новый ТаблицаЗначений;
	ТоварыДляПеремещенияВячейки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыДляПеремещенияВячейки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТоварыДляПеремещенияВячейки.Колонки.Добавить("ЯчейкаОткуда", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
	ТоварыДляПеремещенияВячейки.Колонки.Добавить("ЯчейкаКуда", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
	
	РезультатГлавный = Запрос.Выполнить().Выбрать();
	
	НоменклатураПоиск = "";
	ЯчейкаОткуда = "";
	КоличествоДляПередачи = 0;
	
	Пока РезультатГлавный.Следующий() Цикл
		
		НедостающееКоличествоПоУчету = РезультатГлавный.КоличествоФакт - РезультатГлавный.КоличествоУчетное;
		
		Если НоменклатураПоиск <> РезультатГлавный.Номенклатура Тогда
			
			НоменклатураПоиск = РезультатГлавный.Номенклатура;
			
			Запрос_2 = Новый Запрос;
			Запрос_2.Текст = 
			"ВЫБРАТЬ
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
			|	ЗаданиеНаИнвентаризациюТовары.Номенклатура КАК Номенклатура,
			|	ЗаданиеНаИнвентаризациюТовары.Ячейка,
			|	ЗаданиеНаИнвентаризациюТовары.КоличествоФакт КАК КоличествоФакт,
			|	ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное КАК КоличествоУчетное,
			|	ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры
			|ИЗ
			|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
			|ГДЕ
			|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
			|	И ЗаданиеНаИнвентаризациюТовары.Номенклатура = &Номенклатура
			|	И НЕ ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры
			|	И ЗаданиеНаИнвентаризациюТовары.КоличествоФакт < ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоФакт УБЫВ";
			
			Запрос_2.УстановитьПараметр("Ссылка", ЗаданиеСсылка);
			Запрос_2.УстановитьПараметр("Номенклатура", НоменклатураПоиск);
			
			РезультатПодчиненый = Запрос_2.Выполнить().Выбрать();     
			РезультатПодчиненый.Следующий();
			
			ЯчейкаОткуда = РезультатПодчиненый.Ячейка;
			КоличествоДляПередачи = РезультатПодчиненый.КоличествоУчетное - РезультатПодчиненый.КоличествоФакт;
			
		КонецЕсли; 				
		
		Пока КоличествоДляПередачи > 0 Цикл
			
			СтрокаТЗ = ТоварыДляПеремещенияВячейки.Добавить();
			СтрокаТЗ.Номенклатура = РезультатГлавный.Номенклатура;
			СтрокаТЗ.ЯчейкаКуда = РезультатГлавный.Ячейка;
			
			Если КоличествоДляПередачи < НедостающееКоличествоПоУчету Тогда
				
				НедостающееКоличествоПоУчету = НедостающееКоличествоПоУчету - КоличествоДляПередачи;
				СтрокаТЗ.Количество = КоличествоДляПередачи;				
				СтрокаТЗ.ЯчейкаОткуда = ЯчейкаОткуда;
				КоличествоДляПередачи = 0;
				
			ИначеЕсли КоличествоДляПередачи >= НедостающееКоличествоПоУчету Тогда
				
				КоличествоДляПередачи = КоличествоДляПередачи - НедостающееКоличествоПоУчету;
				СтрокаТЗ.Количество = НедостающееКоличествоПоУчету;
				СтрокаТЗ.ЯчейкаОткуда = ЯчейкаОткуда;
				НедостающееКоличествоПоУчету = 0
				
			КонецЕсли; 
			
			Если НедостающееКоличествоПоУчету = 0 И КоличествоДляПередачи = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			Если НедостающееКоличествоПоУчету > 0  И КоличествоДляПередачи = 0 Тогда
				
				Если РезультатПодчиненый.Следующий() Тогда				
					
					ЯчейкаОткуда = РезультатПодчиненый.Ячейка;
					КоличествоДляПередачи = РезультатПодчиненый.КоличествоУчетное - РезультатПодчиненый.КоличествоФакт;					
					Продолжить;
					
				Иначе
					Прервать;
				КонецЕсли; 				
				
			КонецЕсли; 
			
			Если НедостающееКоличествоПоУчету = 0 И КоличествоДляПередачи > 0 Тогда					 			
				Прервать;
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
	Если ТоварыДляПеремещенияВячейки.Количество() > 0 Тогда
		
		ДокументОбъект = Неопределено;
		
		// Шапка документа	
		ДокументПеремещения = Документы.ПеремещениеТовараПоЯчейкам.СоздатьДокумент();
		ДокументПеремещения.Клеверенс = Ложь;        
		ДокументПеремещения.Ответственный = ЗаданиеОбъект.Ответственный;
		ДокументПеремещения.Дата        = ТекущаяДата();		
		ДокументПеремещения.Склад       = Константы.ОсновнойСклад.Получить();
		ДокументПеремещения.ДокументОснование = ЗаданиеОбъект.Ссылка;
		
		ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Создан  документ перемещ.товара между ячейками для строк расхождения уровня 1 (РасхождениеНоменклатуры(ГруппаПоНоменклатуре) = 0) ", Строка(ДокументПеремещения.Номер)); 
		
		СписокЯчеек = "";
		
		Для каждого Строка Из ТоварыДляПеремещенияВячейки Цикл		
			
			Товар = ДокументПеремещения.Товары.Добавить();	
			Товар.Номенклатура   = Строка.Номенклатура;		
			Товар.Количество     = Строка.Количество; 
			Товар.КоличествоПереместить   = Товар.Количество; 
			Товар.Ячейка         = Строка.ЯчейкаОткуда;
			Товар.ЯчейкаКуда     = Строка.ЯчейкаКуда;
			
			СписокЯчеек = СписокЯчеек + Строка.ЯчейкаКуда + ";";
			
		КонецЦикла;                                                        
		
		КомментарийТекст = "Создан для строк расхождения уровня 1 (РасхождениеНоменклатуры(ГруппаПоНоменклатуре) = 0) " + ЗаданиеОбъект.Ссылка + "; " + СписокЯчеек;
		ДокументПеремещения.Комментарий = КомментарийТекст;
		
		ТекстОшибки = "";
		
		Попытка
			
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);					
			Исключение
				
				ТекстОшибки = ОписаниеОшибки(); 
				Возврат ТекстОшибки;
				
			КонецПопытки;                          
			
			ЗаданиеОбъект.ДокумПеремФактБольшеПланаРасхожНомен = ДокументПеремещения.Ссылка;
			ЗаданиеОбъект.Записать();			
			ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Записан документ перемещения товара по ячейкам, на основ. строк расхождения (РасхождениеНоменклатуры(ГруппаПоНоменклатуре) = 0)", Строка(ДокументПеремещения.Номер)); 													
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа перемещ.товара по ячейкам (РасхождениеНоменклатуры(ГруппаПоНоменклатуре) = 0) в 1С: " + ОписаниеОшибки()+".";
			Возврат ТекстОшибки;
			
		КонецПопытки; 		
		
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

Функция ПроанализироватьСтрокиСРасхождениемДляОсновныхЯчеек(ЗаданиеСсылка) Экспорт
	
	ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект(); 
	
	Если НЕ ЗаданиеОбъект.АРМКладовщика Или НЕ ЗначениеЗаполнено(ЗаданиеОбъект.ДатаВыполнения) Тогда
		Возврат "";
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка КАК ЯчейкаИсходная,
	|	ЗаданиеНаИнвентаризациюТовары.Отклонение,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|			ТОГДА 2
	|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Уровень
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И ЗаданиеНаИнвентаризациюТовары.Уровень = 1 
	|	И ЗаданиеНаИнвентаризациюТовары.Отклонение <> 0
	|	И ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры = Истина";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат "";	
	КонецЕсли; 
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка КАК ЯчейкаИсходная,
	|	ЗаданиеНаИнвентаризациюТовары.Отклонение,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|			ТОГДА 2
	|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Уровень
	|	КОНЕЦ КАК Уровень
	|ПОМЕСТИТЬ ВТРасхожден
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|	И ЗаданиеНаИнвентаризациюТовары.Отклонение <> 0
	|	И ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры = Истина
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.ЗаданиеНаИнвентаризацию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	// Выбираем ячейки относящиеся к полке указанной в реквизите документа
	|ВЫБРАТЬ
	|	Ячейки.Ссылка КАК ЯчейкаИсходная
	|ПОМЕСТИТЬ ВТЯчейкиИсходные
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|
	|ГДЕ 
	|  Ячейки.Полка = &Полка
	|  И НЕ Ячейки.НеУчитыватьВОперативномУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасхожден.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	ВТРасхожден.Уровень,
	|	ВТРасхожден.ЯчейкаИсходная
	|ПОМЕСТИТЬ ВТТоварСЯчейками
	|ИЗ
	|	ВТРасхожден КАК ВТРасхожден
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							А.Номенклатура
	|						ИЗ
	|							ВТРасхожден КАК А)
	|					И Ячейка В
	|						(ВЫБРАТЬ
	|							Ячейки.Ссылка
	|						ИЗ
	|							Справочник.Ячейки КАК Ячейки
	|						ГДЕ
	|							НЕ Ячейки.НеУчитыватьВОперативномУчете)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВТРасхожден.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТоварСЯчейками.ЯчейкаИсходная КАК ЯчейкаИсходная,
	|	ВТТоварСЯчейками.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТТоварСЯчейками.Уровень) КАК Уровень,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК Документ
	|ПОМЕСТИТЬ ВТДокумДляИсходЯчейки
	|ИЗ
	|	ВТТоварСЯчейками КАК ВТТоварСЯчейками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация
	|		ПО ВТТоварСЯчейками.ЯчейкаИсходная = Инвентаризация.Ячейка
	|			И (Инвентаризация.ДатаСоздания > &Дата)
	|			И (Инвентаризация.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (НЕ Инвентаризация.РегламентноеЗадание)
	|			И (Инвентаризация.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТоварСЯчейками.ЯчейкаИсходная,
	|	ВТТоварСЯчейками.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК ЯчейкаИсходная,
	|	МАКСИМУМ(1) КАК Уровень,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК Документ
	|ПОМЕСТИТЬ ВТНоменклатураСостаткамиПоЯчейкамиОсновным
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В
	|				(ВЫБРАТЬ
	|					ВТЯчейкиИсходные.ЯчейкаИсходная
	|				ИЗ
	|					ВТЯчейкиИсходные КАК ВТЯчейкиИсходные)) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = Инвентаризация.Ячейка
	|			И (Инвентаризация.ДатаСоздания > &Дата)
	|			И (Инвентаризация.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (НЕ Инвентаризация.РегламентноеЗадание)
	|			И (Инвентаризация.Регистратор <> &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДокумДляИсходЯчейки.Номенклатура,
	|	ВТДокумДляИсходЯчейки.ЯчейкаИсходная,
	|	ВТДокумДляИсходЯчейки.Уровень,
	|	ВТДокумДляИсходЯчейки.Документ
	|ИЗ
	|	ВТДокумДляИсходЯчейки КАК ВТДокумДляИсходЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатураСостаткамиПоЯчейкамиОсновным.Номенклатура,
	|	ВТНоменклатураСостаткамиПоЯчейкамиОсновным.ЯчейкаИсходная КАК ЯчейкаИсходная,
	|	МАКСИМУМ(ВТНоменклатураСостаткамиПоЯчейкамиОсновным.Уровень) КАК Уровень,
	|	МАКСИМУМ(ВТНоменклатураСостаткамиПоЯчейкамиОсновным.Документ) КАК Документ,
	|	МАКСИМУМ(СпрНоменклатура.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(СпрНоменклатура.Родитель.Наименование) КАК Производитель
	|ПОМЕСТИТЬ ВТБезТаблЧастиДокум
	|ИЗ
	|	ВТНоменклатураСостаткамиПоЯчейкамиОсновным КАК ВТНоменклатураСостаткамиПоЯчейкамиОсновным
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТНоменклатураСостаткамиПоЯчейкамиОсновным.Номенклатура = СпрНоменклатура.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатураСостаткамиПоЯчейкамиОсновным.Номенклатура,
	|	ВТНоменклатураСостаткамиПоЯчейкамиОсновным.ЯчейкаИсходная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданНаИнвенТов.Ссылка,
	|	ЗаданНаИнвенТов.Номенклатура,
	|	МАКСИМУМ(ЗаданНаИнвенТов.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Производитель) КАК Производитель,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Ячейка) КАК Ячейка,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Уровень) КАК Уровень,
	|	ЗаданНаИнвенТов.ДокументИсточник
	|ПОМЕСТИТЬ ВТТаблЧастиДокум
	|ИЗ
	|	ВТДокумДляИсходЯчейки КАК ВТДокумДляИсходЯчейки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданНаИнвенТов
	|		ПО ВТДокумДляИсходЯчейки.Документ = ЗаданНаИнвенТов.Ссылка
	|
	|ГДЕ
	|	ЗаданНаИнвенТов.РасхождениеНоменклатуры = Истина
	|СГРУППИРОВАТЬ ПО
	|	ЗаданНаИнвенТов.Ссылка,
	|	ЗаданНаИнвенТов.Номенклатура,
	|	ЗаданНаИнвенТов.ДокументИсточник
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.ЗаданиеНаИнвентаризацию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Номенклатура, ВТТаблЧастиДокум.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.ЯчейкаИсходная, ВТТаблЧастиДокум.Ячейка) КАК Ячейка,
	|	&Полка КАК Полка, 
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Уровень, 0) КАК Уровень,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Документ, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)) КАК Документ,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.КодПроизводителя, ВТТаблЧастиДокум.КодПроизводителя) КАК КодПроизводителя,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Производитель, ВТТаблЧастиДокум.Производитель) КАК Производитель,
	|	ЕСТЬNULL(ВТТаблЧастиДокум.Уровень, 0) КАК УровеньВТабЧастиДокумента,
	|	ВЫБОР
	|		КОГДА ВТТаблЧастиДокум.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНоменклатураВДокументе,
	|	ЕСТЬNULL(ВТТаблЧастиДокум.ДокументИсточник, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)) КАК ДокументИсточник
	|ИЗ
	|	ВТБезТаблЧастиДокум КАК ВТБезТаблЧастиДокум
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТаблЧастиДокум КАК ВТТаблЧастиДокум
	|		ПО ВТБезТаблЧастиДокум.Документ = ВТТаблЧастиДокум.Ссылка
	|			И ВТБезТаблЧастиДокум.Номенклатура = ВТТаблЧастиДокум.Номенклатура
	|			И ВТБезТаблЧастиДокум.ЯчейкаИсходная = ВТТаблЧастиДокум.Ячейка
	|ГДЕ
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.ЯчейкаИсходная, ВТТаблЧастиДокум.Ячейка) <> &ЯчейкаНедостачаПриИнвентаризации
	|ИТОГИ
	|	МАКСИМУМ(Документ)
	|ПО
	|	&Полка";	
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаИнвентаризацииПоследнейЯчейки.Получить());
	Запрос.УстановитьПараметр("ЯчейкаНедостачаПриИнвентаризации",  Константы.НедостачаПриИнвентаризации.Получить());
	Запрос.УстановитьПараметр("Полка", ЗаданиеОбъект.Полка);
	
	// Создаем или update documents для ячеек, где были расхождения
	ВыборкаПолки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокументОбъект = Неопределено;
	
	Пока ВыборкаПолки.Следующий() Цикл
		
		ДокументСсылка = ВыборкаПолки.Документ;
		
		Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
			
			ДокументОбъект = Документы.ЗаданиеНаИнвентаризацию.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДата();
			ДокументОбъект.Склад = ЗаданиеОбъект.Склад;
			ДокументОбъект.ДокументОснование = ЗаданиеОбъект.Ссылка;
			ДокументОбъект.ПолкаВторичная = ВыборкаПолки.Полка;
			ДокументОбъект.Полка = ВыборкаПолки.Полка;
			ДокументОбъект.Комментарий = "Источник-> " + Строка(ЗаданиеОбъект.Номер) + " " + Строка(ЗаданиеОбъект.Дата)+ "; ";   				
			
		Иначе
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();		
		КонецЕсли;                                  
		
		ДокументОбъект.Товары.Очистить();
		ВыборкаНоменклатуры = ВыборкаПолки.Выбрать();		
		
		ЗначениеЯчейки = "";
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			Если ДокументОбъект.ЭтоНовый() И ЗначениеЯчейки <> ВыборкаНоменклатуры.Ячейка Тогда

				ЕстьЯчейкаВТЧ = ДокументОбъект.ИнвентаризируемыеЯчейки.Найти(ВыборкаНоменклатуры.Ячейка,"ЯчейкаДляИнвентаризации") ;
				
				Если ЕстьЯчейкаВТЧ = Неопределено Тогда
					
					СтрокаЯчейка = ДокументОбъект.ИнвентаризируемыеЯчейки.Добавить();
					СтрокаЯчейка.ЯчейкаДляИнвентаризации = ВыборкаНоменклатуры.Ячейка;
					ЗначениеЯчейки = ВыборкаНоменклатуры.Ячейка;
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Товар = ДокументОбъект.Товары.Добавить();	
			ЗаполнитьЗначенияСвойств(Товар, ВыборкаНоменклатуры);
			
			Если Не ДокументОбъект.ЭтоНовый() Тогда
				
				Если Товар.Уровень = 2 Тогда
					Продолжить;
				КонецЕсли; 
				
				Если ВыборкаНоменклатуры.ЕстьНоменклатураВДокументе И ВыборкаНоменклатуры.УровеньВТабЧастиДокумента = 2 Тогда
					Товар.Уровень = ВыборкаНоменклатуры.УровеньВТабЧастиДокумента;
				КонецЕсли; 				
				
				Если ВыборкаНоменклатуры.ЕстьНоменклатураВДокументе И ВыборкаНоменклатуры.УровеньВТабЧастиДокумента = 1   
					И ВыборкаНоменклатуры.Уровень = 2 Тогда
					
					Товар.Уровень = ВыборкаНоменклатуры.Уровень;
					Товар.ДокументИсточник = ЗаданиеОбъект.Ссылка;
					
				КонецЕсли; 
				
			Иначе				
				Товар.Уровень = 2; 
			КонецЕсли; 
			
		КонецЦикла; 
		
		Попытка
			
			ДокументОбъект.Записать();	
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);						
			Исключение
				
				ТекстОшибки = ОписаниеОшибки();			
				Возврат ТекстОшибки;
				
			КонецПопытки;
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа Задания на инвент в 1С: " + ОписаниеОшибки() + ".";
			Возврат ТекстОшибки;
			
		КонецПопытки;				
		
	КонецЦикла;  
	
	ТекстОшибки = ПроанализироватьСтрокиСРасхождениемДляДополнЯчеек(ЗаданиеСсылка);
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПроанализироватьСтрокиСРасхождениемДляДополнЯчеек(ЗаданиеСсылка)
	
	ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();
	
	Если НЕ ЗаданиеОбъект.АРМКладовщика Или НЕ ЗначениеЗаполнено(ЗаданиеОбъект.ДатаВыполнения) Тогда
		Возврат "";
	КонецЕсли; 
	
	Запрос = Новый Запрос;                                         
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка КАК ЯчейкаИсходная,
	|	ЗаданиеНаИнвентаризациюТовары.Отклонение,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|			ТОГДА 2
	|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Уровень
	|	КОНЕЦ КАК Уровень
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|	И ЗаданиеНаИнвентаризациюТовары.Отклонение <> 0
	|	И ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат "";	
	КонецЕсли; 
	
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка КАК ЯчейкаИсходная,
	|	ЗаданиеНаИнвентаризациюТовары.Отклонение,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|			ТОГДА 2
	|		ИНАЧЕ ЗаданиеНаИнвентаризациюТовары.Уровень
	|	КОНЕЦ КАК Уровень
	|ПОМЕСТИТЬ ВТРасхожден
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И ЗаданиеНаИнвентаризациюТовары.Уровень = 1
	|	И ЗаданиеНаИнвентаризациюТовары.Отклонение <> 0
	|	И ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры = ИСТИНА
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.ЗаданиеНаИнвентаризацию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ячейки.Ссылка КАК ЯчейкаИсходная
	|ПОМЕСТИТЬ ВТЯчейкиИсходные
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|ГДЕ
	|	Ячейки.Полка = &Полка
	|	И НЕ Ячейки.НеУчитыватьВОперативномУчете
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРасхожден.Номенклатура КАК Номенклатура,
	|	ВТРасхожден.Уровень,
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	ВЫБОР
	|		КОГДА ТоварыВЯчейкахОстатки.Ячейка ЕСТЬ НЕ NULL 
	|			ТОГДА ТоварыВЯчейкахОстатки.Ячейка.Полка
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Полка
	|ПОМЕСТИТЬ ВТТоварСЯчейками
	|ИЗ
	|	ВТРасхожден КАК ВТРасхожден
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							А.Номенклатура
	|						ИЗ
	|							ВТРасхожден КАК А)
	|					И Ячейка В
	|						(ВЫБРАТЬ
	|							Ячейки.Ссылка
	|						ИЗ
	|							Справочник.Ячейки КАК Ячейки
	|						ГДЕ
	|							НЕ Ячейки.НеУчитыватьВОперативномУчете)
	|					И НЕ Ячейка В
	|							(ВЫБРАТЬ
	|								ВТЯчейкиИсходные.ЯчейкаИсходная
	|							ИЗ
	|								ВТЯчейкиИсходные КАК ВТЯчейкиИсходные)) КАК ТоварыВЯчейкахОстатки
	|		ПО ВТРасхожден.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Ячейка ЕСТЬ НЕ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ячейки.Ссылка КАК Ячейка,
	|	Ячейки.Полка КАК Полка
	|ПОМЕСТИТЬ ВТПолкиДополнит
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварСЯчейками КАК ВТТоварСЯчейками
	|		ПО Ячейки.Полка = ВТТоварСЯчейками.Полка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ячейки.Ссылка,
	|	Ячейки.Полка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТоварСЯчейками.Ячейка КАК Ячейка,
	|	ВТТоварСЯчейками.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ВТТоварСЯчейками.Уровень) КАК Уровень,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация_1.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК ЗавершДокумент,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация_2.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК НеЗавершДокумент
	|ПОМЕСТИТЬ ВТДокумДляЯчейкиДополн
	|ИЗ
	|	ВТТоварСЯчейками КАК ВТТоварСЯчейками
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация_1
	|		ПО ВТТоварСЯчейками.Ячейка = Инвентаризация_1.Ячейка
	|			И (Инвентаризация_1.ДатаСоздания > &Дата)
	|			И (Инвентаризация_1.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (Инвентаризация_1.Регистратор <> &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация_2
	|		ПО ВТТоварСЯчейками.Ячейка = Инвентаризация_2.Ячейка
	|			И (Инвентаризация_2.ДатаСоздания > &Дата)
	|			И (Инвентаризация_2.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (Инвентаризация_2.Регистратор <> &Ссылка)
	|			И (НЕ Инвентаризация_2.РегламентноеЗадание)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТТоварСЯчейками.Ячейка,
	|	ВТТоварСЯчейками.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
	|	МАКСИМУМ(1) КАК Уровень,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация_1.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК ЗавершДокумент,
	|	МАКСИМУМ(ЕСТЬNULL(Инвентаризация_2.Регистратор, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка))) КАК НеЗавершДокумент
	|ПОМЕСТИТЬ ВТНоменклатураСостаткамиПоЯчейкамДополн
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Ячейка В
	|				(ВЫБРАТЬ
	|					ВТПолкиДополнит.Ячейка
	|				ИЗ
	|					ВТПолкиДополнит КАК ВТПолкиДополнит
	|				СГРУППИРОВАТЬ ПО
	|					ВТПолкиДополнит.Ячейка)) КАК ТоварыВЯчейкахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация_1
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = Инвентаризация_1.Ячейка
	|			И (Инвентаризация_1.ДатаСоздания > &Дата)
	|			И (Инвентаризация_1.ДатаЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (Инвентаризация_1.Регистратор <> &Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Инвентаризация КАК Инвентаризация_2
	|		ПО ТоварыВЯчейкахОстатки.Ячейка = Инвентаризация_2.Ячейка
	|			И (Инвентаризация_2.ДатаСоздания > &Дата)
	|			И (Инвентаризация_2.Регистратор <> &Ссылка)
	|			И (Инвентаризация_2.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|			И (НЕ Инвентаризация_2.РегламентноеЗадание)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Ячейка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТДокумДляЯчейкиДополн.Номенклатура,
	|	ВТДокумДляЯчейкиДополн.Ячейка,
	|	ВТДокумДляЯчейкиДополн.Уровень,
	|	ВТДокумДляЯчейкиДополн.ЗавершДокумент,
	|	ВТДокумДляЯчейкиДополн.НеЗавершДокумент
	|ИЗ
	|	ВТДокумДляЯчейкиДополн КАК ВТДокумДляЯчейкиДополн
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатураСостаткамиПоЯчейкамДополн.Номенклатура,
	|	ВТНоменклатураСостаткамиПоЯчейкамДополн.Ячейка КАК Ячейка,
	|	МАКСИМУМ(ВТНоменклатураСостаткамиПоЯчейкамДополн.Уровень) КАК Уровень,
	|	МАКСИМУМ(ВТНоменклатураСостаткамиПоЯчейкамДополн.ЗавершДокумент) КАК ЗавершДокумент,
	|	МАКСИМУМ(ВТНоменклатураСостаткамиПоЯчейкамДополн.НеЗавершДокумент) КАК НеЗавершДокумент,
	|	МАКСИМУМ(СпрНоменклатура.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(СпрНоменклатура.Родитель.Наименование) КАК Производитель
	|ПОМЕСТИТЬ ВТБезТаблЧастиДокум
	|ИЗ
	|	ВТНоменклатураСостаткамиПоЯчейкамДополн КАК ВТНоменклатураСостаткамиПоЯчейкамДополн
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ВТНоменклатураСостаткамиПоЯчейкамДополн.Номенклатура = СпрНоменклатура.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменклатураСостаткамиПоЯчейкамДополн.Номенклатура,
	|	ВТНоменклатураСостаткамиПоЯчейкамДополн.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБезТаблЧастиДокум.Номенклатура,
	|	ВТБезТаблЧастиДокум.Ячейка,
	|	ВТБезТаблЧастиДокум.Уровень,
	|	ВТБезТаблЧастиДокум.КодПроизводителя,
	|	ВТБезТаблЧастиДокум.Производитель,
	|	ВЫБОР
	|		КОГДА ВТБезТаблЧастиДокум.НеЗавершДокумент <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|			ТОГДА ВТБезТаблЧастиДокум.НеЗавершДокумент
	|		КОГДА ВТБезТаблЧастиДокум.ЗавершДокумент <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|				И ВТБезТаблЧастиДокум.НеЗавершДокумент = ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|			ТОГДА ВТБезТаблЧастиДокум.ЗавершДокумент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ВТБезТаблЧастиДокум.НеЗавершДокумент <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НеЗавершДокумент
	|ПОМЕСТИТЬ ВТБезТаблЧастиДокум_2
	|ИЗ
	|	ВТБезТаблЧастиДокум КАК ВТБезТаблЧастиДокум
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБезТаблЧастиДокум_2.Ячейка,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.Документ.ДатаВыполнения) КАК ДокументДатаВыполнения
	|ПОМЕСТИТЬ ВТЯчейкиИзЗавершДокум
	|ИЗ
	|	ВТБезТаблЧастиДокум_2 КАК ВТБезТаблЧастиДокум_2
	|ГДЕ
	|	ВТБезТаблЧастиДокум_2.НеЗавершДокумент = ЛОЖЬ
	|	И ВТБезТаблЧастиДокум_2.Документ.ДатаВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБезТаблЧастиДокум_2.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОбороты.Период,
	|	ТоварыВЯчейкахОбороты.КоличествоПриход,
	|	ТоварыВЯчейкахОбороты.КоличествоРасход,
	|	ТоварыВЯчейкахОбороты.Регистратор,
	|	ТоварыВЯчейкахОбороты.Ячейка
	|ПОМЕСТИТЬ ОборотыПоЯчейкам
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			Склад = &Склад
	|				И Ячейка В
	|					(ВЫБРАТЬ
	|						А.Ячейка
	|					ИЗ
	|						ВТЯчейкиИзЗавершДокум КАК А)) КАК ТоварыВЯчейкахОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЯчейкиИзЗавершДокум.Ячейка,
	|	СУММА(ЕСТЬNULL(ОборотыПоЯчейкам.КоличествоПриход, 0)) КАК КоличествоПриход,
	|	СУММА(ЕСТЬNULL(ОборотыПоЯчейкам.КоличествоРасход, 0)) КАК КоличествоРасход
	|ПОМЕСТИТЬ ВТОборотыПоЯчейкам
	|ИЗ
	|	ВТЯчейкиИзЗавершДокум КАК ВТЯчейкиИзЗавершДокум
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОборотыПоЯчейкам КАК ОборотыПоЯчейкам
	|		ПО ВТЯчейкиИзЗавершДокум.Ячейка = ОборотыПоЯчейкам.Ячейка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОборотыПоЯчейкам.Период ЕСТЬ NULL
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОборотыПоЯчейкам.Период > ЕСТЬNULL(ВТЯчейкиИзЗавершДокум.ДокументДатаВыполнения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|					И ОборотыПоЯчейкам.Период <= &ТекущаяДата
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЯчейкиИзЗавершДокум.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТБезТаблЧастиДокум_2.Номенклатура,
	|	ВТБезТаблЧастиДокум_2.Ячейка,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.Уровень) КАК Уровень,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.Производитель) КАК Производитель,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.Документ) КАК Документ,
	|	МАКСИМУМ(ВТБезТаблЧастиДокум_2.НеЗавершДокумент) КАК НеЗавершДокумент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТОборотыПоЯчейкам.КоличествоПриход <> 0
	|					ИЛИ ВТОборотыПоЯчейкам.КоличествоРасход <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ЕстьДвижения
	|ПОМЕСТИТЬ ВТБезТаблЧастиДокум_3
	|ИЗ
	|	ВТБезТаблЧастиДокум_2 КАК ВТБезТаблЧастиДокум_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОборотыПоЯчейкам КАК ВТОборотыПоЯчейкам
	|		ПО ВТБезТаблЧастиДокум_2.Ячейка = ВТОборотыПоЯчейкам.Ячейка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТБезТаблЧастиДокум_2.Номенклатура,
	|	ВТБезТаблЧастиДокум_2.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданНаИнвенТов.Ссылка КАК Ссылка,
	|	ЗаданНаИнвенТов.Номенклатура,
	|	ЗаданНаИнвенТов.ДокументИсточник,
	|	МАКСИМУМ(ЗаданНаИнвенТов.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Производитель) КАК Производитель,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Ячейка) КАК Ячейка,
	|	МАКСИМУМ(ЗаданНаИнвенТов.Уровень) КАК Уровень
	|ПОМЕСТИТЬ ВТТаблЧастиДокум
	|ИЗ
	|	ВТБезТаблЧастиДокум_3 КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданНаИнвенТов
	|		ПО ВТ.Документ = ЗаданНаИнвенТов.Ссылка
	|ГДЕ
	|	ВТ.Документ <> ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)
	|	И ЗаданНаИнвенТов.РасхождениеНоменклатуры = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданНаИнвенТов.Ссылка,
	|	ЗаданНаИнвенТов.Номенклатура,
	|	ЗаданНаИнвенТов.ДокументИсточник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Номенклатура, ВТТаблЧастиДокум.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Ячейка, ВТТаблЧастиДокум.Ячейка) КАК Ячейка,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Ячейка.Полка, ВТТаблЧастиДокум.Ячейка.Полка) КАК Полка,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Уровень, 0) КАК Уровень,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Документ, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)) КАК Документ,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.КодПроизводителя, ВТТаблЧастиДокум.КодПроизводителя) КАК КодПроизводителя,
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Производитель, ВТТаблЧастиДокум.Производитель) КАК Производитель,
	|	ЕСТЬNULL(ВТТаблЧастиДокум.Уровень, 0) КАК УровеньВТабЧастиДокумента,
	|	ВТБезТаблЧастиДокум.НеЗавершДокумент КАК НезавершенныйДокумент,
	|	ВТБезТаблЧастиДокум.ЕстьДвижения КАК ЕстьДвижения,
	|	ВЫБОР
	|		КОГДА ВТТаблЧастиДокум.Номенклатура ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНоменклатураВДокументе,
	|	ЕСТЬNULL(ВТТаблЧастиДокум.ДокументИсточник, ЗНАЧЕНИЕ(Документ.ЗаданиеНаИнвентаризацию.ПустаяСсылка)) КАК ДокументИсточник
	|ИЗ
	|	ВТБезТаблЧастиДокум_3 КАК ВТБезТаблЧастиДокум
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТТаблЧастиДокум КАК ВТТаблЧастиДокум
	|		ПО ВТБезТаблЧастиДокум.Документ = ВТТаблЧастиДокум.Ссылка
	|			И ВТБезТаблЧастиДокум.Номенклатура = ВТТаблЧастиДокум.Номенклатура
	|			И ВТБезТаблЧастиДокум.Ячейка = ВТТаблЧастиДокум.Ячейка
	|ГДЕ
	|	ЕСТЬNULL(ВТБезТаблЧастиДокум.Ячейка, ВТТаблЧастиДокум.Ячейка) <> &ЯчейкаНедостачаПриИнвентаризации
	|	И НЕ ЕСТЬNULL(ВТБезТаблЧастиДокум.Ячейка, ВТТаблЧастиДокум.Ячейка) В
	|				(ВЫБРАТЬ
	|					Т.ЯчейкаИсходная
	|				ИЗ
	|					ВТЯчейкиИсходные КАК Т)
	|ИТОГИ
	|	МАКСИМУМ(Документ),
	|	МАКСИМУМ(НезавершенныйДокумент),
	|	МАКСИМУМ(ЕстьДвижения)
	|ПО
	|	Полка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	Запрос.УстановитьПараметр("Дата", Константы.ДатаИнвентаризацииПоследнейЯчейки.Получить());
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ЯчейкаНедостачаПриИнвентаризации",  Константы.НедостачаПриИнвентаризации.Получить());
	Запрос.УстановитьПараметр("Полка", ЗаданиеОбъект.Полка);
	
	// Создаем или update documents для ячеек, где были расхождения
	
	// Сначала получаем полку
	ВыборкаПолки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДокументОбъект = Неопределено;
	
	Пока ВыборкаПолки.Следующий() Цикл
		
		ДокументСсылка = ВыборкаПолки.Документ;
		
		Если Не ЗначениеЗаполнено(ДокументСсылка) Или 
			(ЗначениеЗаполнено(ДокументСсылка) И ВыборкаПолки.НезавершенныйДокумент = Ложь И ВыборкаПолки.ЕстьДвижения) Тогда
			
			ДокументОбъект = Документы.ЗаданиеНаИнвентаризацию.СоздатьДокумент();
			ДокументОбъект.Дата = ТекущаяДата();
			ДокументОбъект.Склад = ЗаданиеОбъект.Склад;
			ДокументОбъект.ДокументОснование = ЗаданиеОбъект.Ссылка;
			ДокументОбъект.ПолкаВторичная = ВыборкаПолки.Полка;
			ДокументОбъект.Полка = ВыборкаПолки.Полка;
			
			ДокументОбъект.Комментарий = "Источник-> " + Строка(ЗаданиеОбъект.Номер) + " " + Строка(ЗаданиеОбъект.Дата) + "; ";   	
			
		ИначеЕсли ВыборкаПолки.НезавершенныйДокумент = Истина Тогда 
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ИначеЕсли (ЗначениеЗаполнено(ДокументСсылка) И ВыборкаПолки.НезавершенныйДокумент = Ложь И Не ВыборкаПолки.ЕстьДвижения) Тогда 
			Продолжить;
		КонецЕсли;                                  
		
		ДокументОбъект.Товары.Очистить();
		ВыборкаНоменклатуры = ВыборкаПолки.Выбрать();		
		
		ЗначениеЯчейки = "";
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			Если ДокументОбъект.ЭтоНовый() И ЗначениеЯчейки <> ВыборкаНоменклатуры.Ячейка Тогда
				
				ЕстьЯчейкаВТЧ = ДокументОбъект.ИнвентаризируемыеЯчейки.Найти(ВыборкаНоменклатуры.Ячейка, "ЯчейкаДляИнвентаризации") ;
				
				Если ЕстьЯчейкаВТЧ = Неопределено Тогда
					
					СтрокаЯчейка = ДокументОбъект.ИнвентаризируемыеЯчейки.Добавить();
					СтрокаЯчейка.ЯчейкаДляИнвентаризации = ВыборкаНоменклатуры.Ячейка;
					ЗначениеЯчейки = ВыборкаНоменклатуры.Ячейка;
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Товар = ДокументОбъект.Товары.Добавить();	
			ЗаполнитьЗначенияСвойств(Товар, ВыборкаНоменклатуры);                    
			
			Если Не ДокументОбъект.ЭтоНовый() Тогда
				
				Если ВыборкаНоменклатуры.ЕстьНоменклатураВДокументе И ВыборкаНоменклатуры.УровеньВТабЧастиДокумента = 2 Тогда
					Товар.Уровень = ВыборкаНоменклатуры.УровеньВТабЧастиДокумента;
				КонецЕсли; 				
				
				Если ВыборкаНоменклатуры.ЕстьНоменклатураВДокументе И ВыборкаНоменклатуры.УровеньВТабЧастиДокумента = 1  И 
					ВыборкаНоменклатуры.Уровень = 2 Тогда
					
					Товар.Уровень = ВыборкаНоменклатуры.Уровень;
					Товар.ДокументИсточник = ЗаданиеОбъект.Ссылка;
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЦикла;                                                        
		
		Попытка
			
			ДокументОбъект.Записать();	
			
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);						
			Исключение
				
				ТекстОшибки = "Задание на инвент """ + ДокументОбъект.Ссылка + """ успешно записан в базу 1С, но не проведен.";			
				Возврат ТекстОшибки;
				
			КонецПопытки;
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа Задания на инвент в 1С: " + ОписаниеОшибки() + ".";
			Возврат ТекстОшибки;
			
		КонецПопытки;				
		
	КонецЦикла;  
	
	Возврат "";
	
КонецФункции

Функция СоздатьПеремещениеТовараДляСтрокВторогоУровня(ЗаданиеСсылка) Экспорт
	
	ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();	
	
	Если НЕ ЗаданиеОбъект.АРМКладовщика Или НЕ ЗначениеЗаполнено(ЗаданиеОбъект.ДатаВыполнения) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗаданиеОбъект.ДокумПеремФактМеньшеПлана) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТовараПоЯчейкам.Ссылка КАК Ссылка,
		|	ПеремещениеТовараПоЯчейкам.Проведен
		|ИЗ
		|	Документ.ПеремещениеТовараПоЯчейкам КАК ПеремещениеТовараПоЯчейкам
		|ГДЕ
		|	ПеремещениеТовараПоЯчейкам.Ссылка = &Ссылка
		|	И ПеремещениеТовараПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТовараПоЯчейкам.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.ДокумПеремФактМеньшеПлана);
		Запрос.УстановитьПараметр("ДокументОснование", ЗаданиеОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Возврат "";
		КонецЕсли; 				 
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;               
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданНаИнвентТов.Ссылка,
	|	ЗаданНаИнвентТов.Номенклатура,
	|	ЗаданНаИнвентТов.Ячейка КАК Ячейка,
	|	ЗаданНаИнвентТов.Отклонение,
	|	ЗаданНаИнвентТов.КоличествоФакт,
	|	ЗаданНаИнвентТов.КоличествоУчетное
	|ПОМЕСТИТЬ ВТЗаданНаИнвенТов
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданНаИнвентТов
	|ГДЕ
	|	ЗаданНаИнвентТов.Ссылка = &Ссылка
	|	И ЗаданНаИнвентТов.Уровень = 2
	|	И ЗаданНаИнвентТов.РасхождениеНоменклатуры        
	|	И ЗаданНаИнвентТов.КоличествоФакт < ЗаданНаИнвентТов.КоличествоУчетное
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток,
	|	ТоварыВЯчейкахОстатки.Ячейка
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			(Номенклатура, Ячейка) В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТЗаданНаИнвенТов.Номенклатура,
	|					ВТЗаданНаИнвенТов.Ячейка
	|				ИЗ
	|					ВТЗаданНаИнвенТов КАК ВТЗаданНаИнвенТов)) КАК ТоварыВЯчейкахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаданНаИнвенТов.Ссылка,
	|	ВТЗаданНаИнвенТов.Номенклатура,
	|	ВТЗаданНаИнвенТов.Ячейка КАК Ячейка,
	|	ВТЗаданНаИнвенТов.Отклонение,
	|	ВТЗаданНаИнвенТов.КоличествоФакт,
	|	ВТЗаданНаИнвенТов.КоличествоУчетное,
	|	ЕСТЬNULL(ВТОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТЗаданНаИнвенТов КАК ВТЗаданНаИнвенТов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|		ПО ВТЗаданНаИнвенТов.Номенклатура = ВТОстатки.Номенклатура
	|			И ВТЗаданНаИнвенТов.Ячейка = ВТОстатки.Ячейка
	|ИТОГИ ПО
	|	Ячейка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	
	ВыборкаЯчейки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЯчейки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли; 
	
	Пока ВыборкаЯчейки.Следующий() Цикл
		
		ДокументОбъект = Неопределено;
		
		// Шапка документа	
		ДокументПеремещения = Документы.ПеремещениеТовараПоЯчейкам.СоздатьДокумент();
		ДокументПеремещения.Клеверенс = Истина;        
		ДокументПеремещения.Ответственный = ЗаданиеОбъект.Ответственный;
		ДокументПеремещения.Дата        = ТекущаяДата();		
		ДокументПеремещения.Склад       = Константы.ОсновнойСклад.Получить();
		
		КомментарийТекст = "Создан для строк расхождения уровня 2 " + ЗаданиеОбъект.Ссылка;
		ДокументПеремещения.Комментарий = КомментарийТекст;
		ДокументПеремещения.ДокументОснование = ЗаданиеОбъект.Ссылка;
		////////////////////////					
		
		ВыборкаНоменклатуры = ВыборкаЯчейки.Выбрать();		
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			Товар = ДокументПеремещения.Товары.Добавить();	
			Товар.Номенклатура   = ВыборкаНоменклатуры.Номенклатура;		
			Товар.Количество     = ВыборкаНоменклатуры.КоличествоУчетное - ВыборкаНоменклатуры.КоличествоФакт; 
			Товар.КоличествоПереместить   = Товар.Количество; 
			Товар.Ячейка         = ВыборкаЯчейки.Ячейка;
			Товар.ЯчейкаКуда     = Константы.НедостачаПриИнвентаризации.Получить();
			
		КонецЦикла;
		
		ТекстОшибки = "";
		
		Попытка
			
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);					
			Исключение
				
				ТекстОшибки = ОписаниеОшибки(); 
				Возврат ТекстОшибки;
				
			КонецПопытки;                          
			
			ЗаданиеОбъект.ДокумПеремФактМеньшеПлана = ДокументПеремещения.Ссылка;
			ЗаданиеОбъект.Записать();			
			ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Записан документ перемещения товара по ячейкам, на основ. строк расхождения", 
			Строка(ДокументПеремещения.Номер)); 													
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа перемещ.товара по ячейкам в 1С: " + ОписаниеОшибки() + ".";
			Возврат ТекстОшибки;
			
		КонецПопытки; 		
		
	КонецЦикла; 
	
	Возврат "";
	
КонецФункции                                                            

Функция СоздатьРазмещениеТовараДляСтрокВторогоУровня(ЗаданиеСсылка) Экспорт
	
	ЗаданиеОбъект = ЗаданиеСсылка.ПолучитьОбъект();	
	
	Если НЕ ЗаданиеОбъект.АРМКладовщика Или НЕ ЗначениеЗаполнено(ЗаданиеОбъект.ДатаВыполнения) Тогда
		Возврат "";
	КонецЕсли; 
	
	//
	Если ЗначениеЗаполнено(ЗаданиеОбъект.ДокументРазмещенияПоЯчейкам) Тогда
		
		Запрос = Новый Запрос;                            
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	РазмещениеПоЯчейкам.Ссылка КАК Ссылка,
		|	РазмещениеПоЯчейкам.Проведен
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
		|ГДЕ
		|	РазмещениеПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И РазмещениеПоЯчейкам.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ДокументОснование", ЗаданиеОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Возврат "";
		КонецЕсли; 				 
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЗаданиеОбъект.ДокумПеремФактБольшеПлана) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеТовараПоЯчейкам.Ссылка КАК Ссылка,
		|	ПеремещениеТовараПоЯчейкам.Проведен
		|ИЗ
		|	Документ.ПеремещениеТовараПоЯчейкам КАК ПеремещениеТовараПоЯчейкам
		|ГДЕ
		|	ПеремещениеТовараПоЯчейкам.Ссылка = &Ссылка
		|	И ПеремещениеТовараПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И ПеремещениеТовараПоЯчейкам.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.ДокумПеремФактБольшеПлана);
		Запрос.УстановитьПараметр("ДокументОснование", ЗаданиеОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда			
			
			Попытка		
				
				РезультатЗапроса.Следующий();
				Документ = РезультатЗапроса.Ссылка.ПолучитьОбъект();
				Документ.УстановитьПометкуУдаления(Истина);				
				
			Исключение
				
				ТекстОшибки = "Документ перемещ.товара по ячейкам (для строк уровня 2) """ + РезультатЗапроса.Ссылка + 
				""" невозможно пометить на удаление в базе 1С. " + ОписаниеОшибки();
				Возврат ТекстОшибки;			    
				
			КонецПопытки;			
			
		КонецЕсли; 				 		
		
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;               
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка,
	|	ЗаданиеНаИнвентаризациюТовары.Номенклатура,
	|	ЗаданиеНаИнвентаризациюТовары.Ячейка КАК Ячейка,
	|	ЗаданиеНаИнвентаризациюТовары.Отклонение,
	|	ЗаданиеНаИнвентаризациюТовары.КоличествоФакт,
	|	ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное
	|ПОМЕСТИТЬ ВТНомен
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданиеНаИнвентаризациюТовары
	|ГДЕ
	|	ЗаданиеНаИнвентаризациюТовары.Ссылка = &Ссылка
	|	И ЗаданиеНаИнвентаризациюТовары.Уровень = 2
	|	И ЗаданиеНаИнвентаризациюТовары.РасхождениеНоменклатуры        
	|	И ЗаданиеНаИнвентаризациюТовары.КоличествоФакт > ЗаданиеНаИнвентаризациюТовары.КоличествоУчетное
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ВТОстаткиПоНомен
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТНомен.Номенклатура
	|					ИЗ
	|						ВТНомен КАК ВТНомен)
	|				И Ячейка В
	|					(ВЫБРАТЬ
	|						Константы.НедостачаПриИнвентаризации
	|					ИЗ
	|						Константы КАК Константы)) КАК ТоварыВЯчейкахОстатки
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНомен.Номенклатура,                             	
	|	ЕСТЬNULL(ВТОстаткиПоНомен.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВТНомен.Ячейка КАК Ячейка,
	|	ВТНомен.КоличествоФакт,
	|	ВТНомен.КоличествоУчетное
	|ИЗ
	|	ВТНомен КАК ВТНомен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиПоНомен КАК ВТОстаткиПоНомен
	|		ПО ВТНомен.Номенклатура = ВТОстаткиПоНомен.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ВТОстаткиПоНомен.КоличествоОстаток, 0) >= 0
	|ИТОГИ ПО
	|	Ячейка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеОбъект.Ссылка);
	
	ВыборкаЯчейки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаЯчейки.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли; 
	
	ТоварыДляРазмещенияВячейках = Новый ТаблицаЗначений;
	ТоварыДляРазмещенияВячейках.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыДляРазмещенияВячейках.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТоварыДляРазмещенияВячейках.Колонки.Добавить("ЯчейкаДляРазмещения", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));
	
	ДокументОбъект = Неопределено;
	
	Пока ВыборкаЯчейки.Следующий() Цикл
		
		// Шапка документа	
		ДокументПеремещения = Документы.ПеремещениеТовараПоЯчейкам.СоздатьДокумент();
		ДокументПеремещения.Клеверенс = Истина;        
		ДокументПеремещения.Ответственный = ЗаданиеОбъект.Ответственный;
		ДокументПеремещения.Дата = ТекущаяДата();		
		ДокументПеремещения.Склад = Константы.ОсновнойСклад.Получить();
		
		КомментарийТекст = "Создан для строк расхождения уровня 2 " + ЗаданиеОбъект.Ссылка;
		ДокументПеремещения.Комментарий = КомментарийТекст;
		ДокументПеремещения.ДокументОснование = ЗаданиеОбъект.Ссылка;
		////////////////////////					
		
		ВыборкаНоменклатуры = ВыборкаЯчейки.Выбрать();		
		
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			
			ИзбытокКоличество = ВыборкаНоменклатуры.КоличествоФакт - ВыборкаНоменклатуры.КоличествоУчетное;
			
			// Если Количество остаток = 0, то делаем только размещение товара по ячейкам
			Если ВыборкаНоменклатуры.КоличествоОстаток = 0 Тогда
				
				СтрокаТЗ                     = ТоварыДляРазмещенияВячейках.Добавить();
				СтрокаТЗ.Номенклатура        = ВыборкаНоменклатуры.Номенклатура;
				СтрокаТЗ.Количество          = ИзбытокКоличество;			
				СтрокаТЗ.ЯчейкаДляРазмещения = ВыборкаЯчейки.Ячейка;
				Продолжить;
				
			КонецЕсли; 
			
			Товар = ДокументПеремещения.Товары.Добавить();	
			Товар.Номенклатура   = ВыборкаНоменклатуры.Номенклатура;
			
			Если ИзбытокКоличество <= ВыборкаНоменклатуры.КоличествоОстаток Тогда			
				
				Товар.Количество = ИзбытокКоличество;
				Товар.КоличествоПереместить = Товар.Количество;
				
			Иначе 			
				
				Товар.Количество            = ВыборкаНоменклатуры.КоличествоОстаток; 
				Товар.КоличествоПереместить = Товар.Количество;
				
				// Нужен документ размещения на разницу ИзбытокКоличество - ВыборкаНоменклатуры.КоличествоОстаток;
				СтрокаТЗ 				     = ТоварыДляРазмещенияВячейках.Добавить();
				СтрокаТЗ.Номенклатура        = ВыборкаНоменклатуры.Номенклатура;
				СтрокаТЗ.Количество          = ИзбытокКоличество - ВыборкаНоменклатуры.КоличествоОстаток;
				СтрокаТЗ.ЯчейкаДляРазмещения = ВыборкаЯчейки.Ячейка;
				
			КонецЕсли; 
			
			Товар.Ячейка     = Константы.НедостачаПриИнвентаризации.Получить();
			Товар.ЯчейкаКуда = ВыборкаЯчейки.Ячейка;
			
		КонецЦикла;
		
		Если ДокументПеремещения.Товары.Количество() >  0 Тогда
			
			ЗаданиеОбъект.ДокумПеремФактБольшеПлана = ДокументПеремещения.Ссылка;	
			ТекстОшибки = "";			
			
			Попытка
				
				ДокументПеремещения.Записать();
				
				Попытка
					ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);					
				Исключение
					
					ТекстОшибки = ОписаниеОшибки();
					Возврат ТекстОшибки;
					
				КонецПопытки;
				
				ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Записан(проведен) документ перемещения товара по ячейкам, на основ. строк расхождения", 
				Строка(ДокументПеремещения.Номер)); 													
				
			Исключение
				
				ТекстОшибки = "Ошибка при записи документа перемещ.товара по ячейкам на основ.строк.расхож в 1С: " + ОписаниеОшибки() + ".";
				Возврат ТекстОшибки;
				
			КонецПопытки; 		
			
		Иначе
			ДокументПеремещения = Неопределено;
		КонецЕсли; 
		
	КонецЦикла; 
	
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Создать документ размещение в ячейках на неучтенное количесто в ту же ячейку, где он обнаружен
	// чтобы факт совпал с планом
	
	Если ТоварыДляРазмещенияВячейках.Количество() > 0 Тогда
		
		ДокументРазмещения = Документы.РазмещениеПоЯчейкам.СоздатьДокумент();
		ДокументРазмещения.ДокументОснование = ЗаданиеОбъект.Ссылка;
		ДокументРазмещения.Дата = ТекущаяДата();
		ДокументРазмещения.Склад = Константы.ОсновнойСклад.Получить();							
		ДокументРазмещения.Ответственный = ЗаданиеОбъект.Ответственный;
		ДокументРазмещения.НомерСкладскогоДокумента = "";
		ДокументРазмещения.Клеверенс = Истина;
		ДокументРазмещения.Комментарий = "Создан для строк расхождения уровня 2 " + ЗаданиеОбъект.Ссылка;
		
		ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Создан документ размещения по ячейкам, для строк второго уровня", Строка(ДокументРазмещения.Номер)); 
		
		Для каждого Строка Из ТоварыДляРазмещенияВячейках Цикл		
			
			Товар = ДокументРазмещения.Товары.Добавить();	
			Товар.Номенклатура = Строка.Номенклатура;
			Товар.Количество = Строка.Количество;
			Товар.Ячейка = Строка.ЯчейкаДляРазмещения;		
			
		КонецЦикла; 
		
		Попытка
			
			ДокументРазмещения.Записать();
			
			Попытка
				ДокументРазмещения.Записать(РежимЗаписиДокумента.Проведение);					
			Исключение
				
				ТекстОшибки = ОписаниеОшибки();
				Возврат ТекстОшибки;                   
				
			КонецПопытки;                                  
			
			Если ДокументПеремещения <> Неопределено Тогда
				
				ЗаданиеОбъект.ДокумПеремФактБольшеПлана = ДокументПеремещения.Ссылка;	
				ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", 
				"Записан(проведен) документ перемещ. товара по ячейкам, на основ. строк расхождения", Строка(ДокументПеремещения.Номер));			
				
			КонецЕсли; 
			
			ЗаданиеОбъект.ДокументРазмещенияПоЯчейкам = ДокументРазмещения.Ссылка;
			ЗаданиеОбъект.Записать();			
			
			ЗаписатьЛог(ЗаданиеОбъект.Ответственный, ТекущаяДата(), "", "Записан(проведен) документ размещения товара по ячейкам, на основ. строк расхождения", 
			Строка(ДокументРазмещения.Номер));
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа размещения.товара по ячейкам на основ.строк расхож в 1С: " + ОписаниеОшибки()+".";
			Возврат ТекстОшибки;
			
		КонецПопытки; 		
		
	КонецЕсли; 
	
	Возврат ""
	
КонецФункции

Функция СоздатьДокументРазмещенияПоМестамХраненияГМ(DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку( Новый УникальныйИдентификатор(DocumentBaseGUID)); 
	
	ПТУОбъект = ПТУСсылка.ПолучитьОбъект();
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Ячейка,
	|	БуферАрмКладовщика.ГМ,
	|	БуферАрмКладовщика.ВведеноВРучную
	|ПОМЕСТИТЬ ВТ_Буфер
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщика
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &Объект
	|	И БуферАрмКладовщика.UserId = &UserId
	|	И БуферАрмКладовщика.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Ячейка,
	|	БуферАрмКладовщика.ГМ,
	|	БуферАрмКладовщика.ВведеноВРучную
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАрмКладовщикаГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ВТ_Буфер.Ячейка,
	|	ПоступлениеТоваровУслугТовары.Количество,
	|	ВТ_Буфер.ВведеноВРучную
	|ИЗ
	|	ВТ_Буфер КАК ВТ_Буфер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_Буфер.Объект = ПоступлениеТоваровУслугТовары.Ссылка
	|			И ВТ_Буфер.ГМ = ПоступлениеТоваровУслугТовары.ГМ";
	
	Запрос.УстановитьПараметр("Объект", ПТУСсылка);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка); 
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0  Тогда	
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "Отсутствуют отсканированные строки документа";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                              
	
	Попытка
		
		ДокументРазмещения = Документы.РазмещениеПоЯчейкам.СоздатьДокумент();
		
		ДокументРазмещения.ДокументОснование = ПТУСсылка;
		ДокументРазмещения.Дата = ТекущаяДата();
		ДокументРазмещения.Склад = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", ПТУСсылка.Метаданные()), ПТУСсылка.Склад, ПТУСсылка.СкладОрдер);							
		ДокументРазмещения.Ответственный = UserIdСсылка;
		ДокументРазмещения.НомерСкладскогоДокумента = ПТУОбъект.НомерСкладскогоДокумента;
		ДокументРазмещения.Клеверенс = Истина;
		ДокументРазмещения.Комментарий = "Создан ТСД на платформе Андроид.";
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создан документ размещения по ячейкам", Строка(ДокументРазмещения.Номер)); 
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			Товар = ДокументРазмещения.Товары.Добавить();	
			Товар.Номенклатура = РезультатЗапроса.Номенклатура;
			Товар.Количество = РезультатЗапроса.Количество;
			Товар.Ячейка = РезультатЗапроса.Ячейка;
			Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;   
			Товар.ГМ = РезультатЗапроса.ГМ;
			
		КонецЦикла; 
		
		Попытка
			
			ДокументРазмещения.Записать();
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ размещения по ячейкам", Строка(ДокументРазмещения.Номер)); 
			
			Попытка				
				
				ДокументРазмещения.Записать(РежимЗаписиДокумента.Проведение);				
				ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ размещения по ячейкам проведен", Строка(ДокументРазмещения.Номер)); 
				
				Если DeleteRecordsFromBuffer = Истина Тогда
					
					РС = РегистрыСведений.БуферАрмКладовщикаГМ.СоздатьНаборЗаписей();
					РС.Отбор.Объект.Установить(ПТУСсылка);
					РС.Отбор.UserId.Установить(UserIdСсылка);
					РС.Записать();
					
				КонецЕсли; 
				
				ЗафиксироватьТранзакцию();
				
			Исключение	
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = "Документ """ + ДокументРазмещения.Ссылка + """ успешно записан в базу 1С, но не проведен.";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;				
				
			КонецПопытки; 
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = "Ошибка при записи документа в 1С: " + ОписаниеОшибки() + ".";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецПопытки;           
		
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("НомерДокумента", ДокументРазмещения.Номер);
		Результат.Вставить("ДатаДокумента", ДокументРазмещения.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("Ошибка", ОписаниеОшибки()); 
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
		Возврат Результат;
		
	КонецПопытки; 
	
КонецФункции

Функция СоздатьДокументРазмещенияПоМестамХранения(DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer = Ложь) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentBaseGUID)); 

	Если ПТУСсылка.ПолучитьОбъект() = Неопределено Тогда
		ПТУСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentBaseGUID));
	КонецЕсли;

	ПТУОбъект = ПТУСсылка.ПолучитьОбъект();
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Номенклатура,
	|	БуферАрмКладовщика.UserId,
	|	БуферАрмКладовщика.Ячейка,
	|	СУММА(БуферАрмКладовщика.Quantity) КАК Quantity,
	|	КОЛИЧЕСТВО(БуферАрмКладовщика.Quantity) КАК КоличествоСтрок,
	|	МАКСИМУМ(БуферАрмКладовщика.ВведеноВРучную) КАК ВведеноВРучную,
	|	МАКСИМУМ(ЕдиницыИзмерения.Коэффициент) КАК ЕдХранОстатковКоэффициент
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СпрНоменклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И СпрНоменклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО БуферАрмКладовщика.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &Объект
	|	И БуферАрмКладовщика.UserId = &UserId
	|	И (БуферАрмКладовщика.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ БуферАрмКладовщика.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Номенклатура,
	|	БуферАрмКладовщика.UserId,
	|	БуферАрмКладовщика.Ячейка
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАрмКладовщика";
	
	Запрос.УстановитьПараметр("Объект", ПТУСсылка);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);                                          
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0  Тогда	
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = "Отсутствуют отсканированные строки документа";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                              
	
	Попытка
		
		ДокументРазмещения = Документы.РазмещениеПоЯчейкам.СоздатьДокумент();
		ДокументРазмещения.ДокументОснование = ПТУСсылка;
		ДокументРазмещения.Дата = ТекущаяДата();
		ДокументРазмещения.Склад = ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Склад", ПТУСсылка.Метаданные()), ПТУСсылка.Склад, ПТУСсылка.СкладОрдер);							
		ДокументРазмещения.Ответственный = UserIdСсылка;
		ДокументРазмещения.НомерСкладскогоДокумента = ПТУОбъект.НомерСкладскогоДокумента;
		ДокументРазмещения.Клеверенс = Истина;
		ДокументРазмещения.Комментарий = "Создан ТСД на платформе Андроид.";
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создан документ размещения по ячейкам", Строка(ДокументРазмещения.Номер)); 
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			Товар = ДокументРазмещения.Товары.Добавить();	
			Товар.Номенклатура = РезультатЗапроса.Номенклатура;
			Товар.Количество = РезультатЗапроса.Quantity;
			
			Если Товар.Количество = 0 Тогда				
				
				Товар.Количество = РезультатЗапроса.КоличествоСтрок * РезультатЗапроса.ЕдХранОстатковКоэффициент;
				ТекстОшибки = "ПТУ "+ ПТУСсылка + " Товар " + Товар.Номенклатура + " строк " + Строка(РезультатЗапроса.КоличествоСтрок) +
				" коэфф " + Строка(РезультатЗапроса.ЕдХранОстатковКоэффициент);
				ЗаписьЖурналаРегистрации("Android нулевое количество товара", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки); 		
				
			КонецЕсли; 
			
			Товар.Ячейка = РезультатЗапроса.Ячейка;
			Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;
			
		КонецЦикла; 
		
		Попытка
			
			ДокументРазмещения.Записать();
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ размещения по ячейкам", Строка(ДокументРазмещения.Номер)); 
			
			Попытка				
				
				ДокументРазмещения.Записать(РежимЗаписиДокумента.Проведение);				
				ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ размещения по ячейкам проведен", Строка(ДокументРазмещения.Номер)); 
				
				Если DeleteRecordsFromBuffer = Истина Тогда
					
					РС = РегистрыСведений.БуферАрмКладовщика.СоздатьНаборЗаписей();
					РС.Отбор.Объект.Установить(ПТУСсылка);
					РС.Отбор.UserId.Установить(UserIdСсылка);
					РС.Записать();
					
				КонецЕсли; 
				
				ЗафиксироватьТранзакцию();
				
			Исключение	
				
				ОтменитьТранзакцию();
				
				ТекстОшибки = "Документ """ + ДокументРазмещения.Ссылка + """ успешно записан в базу 1С, но не проведен.";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;				
				
			КонецПопытки; 
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ТекстОшибки = "Ошибка при записи документа в 1С: " + ОписаниеОшибки() + ".";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецПопытки;           
		
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("НомерДокумента", ДокументРазмещения.Номер);
		Результат.Вставить("ДатаДокумента", ДокументРазмещения.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		ОтменитьТранзакцию();
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("Ошибка", ОписаниеОшибки()); 
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
		Возврат Результат;
		
	КонецПопытки; 
	
КонецФункции

Функция ЗаписатьМаркировкиВДокументПТУ(DocumentBaseGUID, UserIdGUID, DeleteRecordsFromBuffer = Ложь) Экспорт
	
	//+Кабанов А.В. 29.08.2025 # UT10-5361
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");   
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentBaseGUID)); 

	ПТУОбъект = ПТУСсылка.ПолучитьОбъект();
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;     
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	БуферАрмКладовщикаМаркировки.Номенклатура,
	|	БуферАрмКладовщикаМаркировки.UserId,
	|	БуферАрмКладовщикаМаркировки.Barcode,
	|	БуферАрмКладовщикаМаркировки.BarcodeFull,
	|	БуферАрмКладовщикаМаркировки.CreateDate
	|ПОМЕСТИТЬ ВТ_БуферМаркировок
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|ГДЕ
	|	БуферАрмКладовщикаМаркировки.Объект = &Объект
	|	И БуферАрмКладовщикаМаркировки.UserId = &UserId
	|	И (БуферАрмКладовщикаМаркировки.Объект ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ БуферАрмКладовщикаМаркировки.Объект ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	БуферАрмКладовщикаМаркировки.Номенклатура,
	|	БуферАрмКладовщикаМаркировки.UserId,
	|	БуферАрмКладовщикаМаркировки.Barcode,
	|	БуферАрмКладовщикаМаркировки.BarcodeFull,
	|	БуферАрмКладовщикаМаркировки.CreateDate
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БуферМаркировок.Объект,
	|	ВТ_БуферМаркировок.Номенклатура,
	|	ВТ_БуферМаркировок.UserId,
	|	ВТ_БуферМаркировок.Barcode,
	|	МАКСИМУМ(ВТ_БуферМаркировок.BarcodeFull) КАК BarcodeFull,
	|	МАКСИМУМ(ЕСТЬNULL(ШтрихкодыНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ШтрихКодыНоменклатуры.ПустаяСсылка))) КАК КодМаркировки,
	|	ВТ_БуферМаркировок.CreateDate
	|ПОМЕСТИТЬ ВТ_БуферСоСправочником
	|ИЗ
	|	ВТ_БуферМаркировок КАК ВТ_БуферМаркировок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|		ПО ВТ_БуферМаркировок.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
	|			И (ШтрихкодыНоменклатуры.КодМаркировки = ВТ_БуферМаркировок.Barcode
	|				ИЛИ ШтрихкодыНоменклатуры.КодМаркировки = ВТ_БуферМаркировок.BarcodeFull)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_БуферМаркировок.Объект,
	|	ВТ_БуферМаркировок.Номенклатура,
	|	ВТ_БуферМаркировок.UserId,
	|	ВТ_БуферМаркировок.Barcode,
	|	ВТ_БуферМаркировок.CreateDate
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_БуферСоСправочником.Объект,
	|	ВТ_БуферСоСправочником.Номенклатура,
	|	ВТ_БуферСоСправочником.UserId,
	|	ВТ_БуферСоСправочником.Barcode,
	|	ВТ_БуферСоСправочником.BarcodeFull,
	|	ВТ_БуферСоСправочником.КодМаркировки,
	|	ВТ_БуферСоСправочником.CreateDate
	|ИЗ
	|	ВТ_БуферСоСправочником КАК ВТ_БуферСоСправочником
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|		ПО ВТ_БуферСоСправочником.Объект = ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка
	|			И ВТ_БуферСоСправочником.КодМаркировки = ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки
	|ГДЕ
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.НомерСтроки ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Объект", ПТУСсылка);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);                                          
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0  Тогда	
		
		ОтменитьТранзакцию();
		
		//+Шульман А. 17.10.2025 #UT10-5472  
		Маркировка.СоздатьМаркировкуПриПоступлении(ПТУСсылка);
		//-Шульман А. 17.10.2025 #UT10-5472
		
		ТекстОшибки = "Отсутствуют отсканированные маркировки";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                              
	
	Попытка
		
		ДобавлялиВПТУ = Ложь;
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			мКодМаркировки = РезультатЗапроса.КодМаркировки;
			
			Если мКодМаркировки.Пустая() Тогда
				
				мКодМаркировки                = Справочники.ШтрихкодыНоменклатуры.СоздатьЭлемент();
				мКодМаркировки.Номенклатура   = РезультатЗапроса.Номенклатура;
			    мКодМаркировки.КодМаркировки  = РезультатЗапроса.Barcode;
				мКодМаркировки.ТипУпаковки    = Перечисления.ТипУпаковкиМаркировки.МаркированныйТовар;
				мКодМаркировки.ТипПоступления = 1;
                мКодМаркировки.Записать();
				
			КонецЕсли;
			
			ЕстьКодМаркировкиВДокументе = ПТУОбъект.ОтсканированныеКодыМаркировки.Найти(мКодМаркировки , "КодМаркировки");
			
			Если ЕстьКодМаркировкиВДокументе = Неопределено Тогда
				
				НоваяСтрокаОтсканированныхМаркировок = ПТУОбъект.ОтсканированныеКодыМаркировки.Добавить();
				НоваяСтрокаОтсканированныхМаркировок.КодМаркировки = мКодМаркировки.Ссылка;      
				//+Шульман А. 11.11.2025 #UT10-5502    
				НоваяСтрокаОтсканированныхМаркировок.Кладовщик = UserIdСсылка;
				//-Шульман А. 11.11.2025 #UT10-5502  
				//+Шульман А. 01.12.2025 #UT10-5559   
				НоваяСтрокаОтсканированныхМаркировок.ДатаСканирования = РезультатЗапроса.CreateDate;
				//-Шульман А. 01.12.2025 #UT10-5559
				ДобавлялиВПТУ = Истина;
				
			КонецЕсли;
						
		КонецЦикла;
		
		Если ДобавлялиВПТУ Тогда
			 ПТУОбъект.Записать(РежимЗаписиДокумента.Проведение);	 
		//+Шульман А. 17.10.2025 #UT10-5472         
		Иначе
			Маркировка.СоздатьМаркировкуПриПоступлении(ПТУСсылка);
		//-Шульман А. 17.10.2025 #UT10-5472
		КонецЕсли;
		
		Если DeleteRecordsFromBuffer = Истина Тогда
			
			РС = РегистрыСведений.БуферАрмКладовщикаМаркировки.СоздатьНаборЗаписей();
			РС.Отбор.Объект.Установить(ПТУСсылка);
			РС.Отбор.UserId.Установить(UserIdСсылка);
			РС.Записать();
			
		КонецЕсли; 
		
		ЗафиксироватьТранзакцию();
		
		Результат.Вставить("Ошибка"         , "");
		Результат.Вставить("НомерДокумента" , ПТУОбъект.Номер);
		Результат.Вставить("ДатаДокумента"  , ПТУОбъект.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;

	Исключение
		
		ОтменитьТранзакцию();
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("Ошибка", ОписаниеОшибки()); 
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
		Возврат Результат;
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	//+Кабанов А.В. 29.08.2025 # UT10-5361
КонецФункции

Функция СоздатьДокументПеремещенияТоваровМеждуЯчейками_Старая(UserIdGUID, CellFromGUID, CellToGUID) Экспорт
	
	Результат = Новый Структура;                                    
	Результат.Вставить("Ошибка", "");
	
	Если ЗначениеЗаполнено(CellFromGUID) Тогда
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellFromGUID));	
	Иначе 
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПустаяСсылка();	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(CellToGUID) Тогда
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellToGUID));		
	Иначе
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПустаяСсылка();		
	КонецЕсли; 	
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	ИспользоватьПоискПоЯчейкам = Ложь;
	
	Если ЗначениеЗаполнено(CellFromGUID) Или ЗначениеЗаполнено(CellToGUID) Тогда
		ИспользоватьПоискПоЯчейкам = Истина;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМКладовшикаПеремещение.UserId КАК UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда КАК ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	БуферАРМКладовшикаПеремещение.Номенклатура,
	|	СУММА(БуферАРМКладовшикаПеремещение.Quantity) КАК Quantity,
	|	МАКСИМУМ(БуферАРМКладовшикаПеремещение.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(БуферАРМКладовшикаПеремещение.ВведеноВРучную) КАК ВведеноВРучную
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМКладовшикаПеремещение
	|ГДЕ
	|	БуферАРМКладовшикаПеремещение.UserId = &UserId
	|	И (&ИспользоватьПоискПоЯчейкам
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаОткуда = &ЯчейкаОткуда
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаКуда = &ЯчейкаКуда
	|			ИЛИ НЕ &ИспользоватьПоискПоЯчейкам)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовшикаПеремещение.UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	БуферАРМКладовшикаПеремещение.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	UserId,
	|	ЯчейкаОткуда
	|АВТОУПОРЯДОЧИВАНИЕ";	                    
	
	Запрос.УстановитьПараметр("ИспользоватьПоискПоЯчейкам", ИспользоватьПоискПоЯчейкам);	
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	Запрос.УстановитьПараметр("ЯчейкаОткуда", ЯчейкаОткудаСсылка);	
	Запрос.УстановитьПараметр("ЯчейкаКуда", ЯчейкаКудаСсылка);	
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0  Тогда	
		
		ТекстОшибки = "Отсутствуют отсканированные товары для перемещения.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                      
	
	Попытка                                                              
		
		РезультатЗапроса.Следующий();
		// Шапка документа	
		ДокументПеремещения = Документы.ПеремещениеТовараПоЯчейкам.СоздатьДокумент();
		ДокументПеремещения.Клеверенс = Истина;        
		ДокументПеремещения.Ответственный = UserIdСсылка;
		ДокументПеремещения.Дата = ТекущаяДата();		
		ДокументПеремещения.Склад       = Константы.ОсновнойСклад.Получить();
		ДокументПеремещения.Ячейка      = РезультатЗапроса.ЯчейкаОткуда;
		ДокументПеремещения.ЯчейкаКуда  = РезультатЗапроса.ЯчейкаКуда;
		КомментарийТекст = "откуда: " + ДокументПеремещения.Ячейка + " куда: " + ДокументПеремещения.ЯчейкаКуда; 
		ДокументПеремещения.Комментарий = КомментарийТекст;
		////////////////////////	
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создан документ перемещения товара по ячейкам", Строка(ДокументПеремещения.Номер)); 
		
		Товар = ДокументПеремещения.Товары.Добавить();	
		Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;
		Товар.Номенклатура   = РезультатЗапроса.Номенклатура;
		Товар.Количество     = РезультатЗапроса.Quantity;
		Товар.Ячейка         = РезультатЗапроса.ЯчейкаОткуда;
		Товар.ЯчейкаКуда     = РезультатЗапроса.ЯчейкаКуда;
		
		Пока РезультатЗапроса.Следующий() Цикл                                    
			
			Товар = ДокументПеремещения.Товары.Добавить();	
			Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;
			Товар.Номенклатура   = РезультатЗапроса.Номенклатура;
			Товар.Количество     = РезультатЗапроса.Quantity;               
			Товар.Ячейка         = РезультатЗапроса.ЯчейкаОткуда;
			Товар.ЯчейкаКуда     = РезультатЗапроса.ЯчейкаКуда;
			
		КонецЦикла;     
		
		Попытка
			
			ДокументПеремещения.Записать();
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ перемещения товара по ячейкам", Строка(ДокументПеремещения.Номер)); 
			
			Попытка				
				
				ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);				
				ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ перемещения товара по ячейкам проведен", Строка(ДокументПеремещения.Номер)); 
				
				РС = РегистрыСведений.БуферАРМКладовшикаПеремещение.СоздатьНаборЗаписей();
				РС.Отбор.UserId.Установить(UserIdСсылка);
				
				Если ЯчейкаОткудаСсылка <>  Справочники.Ячейки.ПустаяСсылка()  Тогда
					РС.Отбор.ЯчейкаОткуда.Установить(ЯчейкаОткудаСсылка);					
				КонецЕсли; 
				
				РС.Записать();
				
			Исключение				
				
				ТекстОшибки = "Документ """ + ДокументПеремещения.Ссылка + """ успешно записан в базу 1С, но не проведен.";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;				
				
			КонецПопытки; 
			
		Исключение
			
			ТекстОшибки = "Ошибка при записи документа в 1С: " + ОписаниеОшибки() + ".";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецПопытки; 
		
		Результат.Вставить("Ошибка", "");
		Результат.Вставить("НомерДокумента", ДокументПеремещения.Номер);                
		Результат.Вставить("ДатаДокумента", ДокументПеремещения.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		СтруктураОшибки = Новый Структура;
		СтруктураОшибки.Вставить("Ошибка", ОписаниеОшибки()); 
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(СтруктураОшибки);
		Возврат Результат;
		
	КонецПопытки; 
	
КонецФункции

Функция СоздатьДокументПеремещенияТоваровМеждуЯчейками(UserIdGUID, CellFromGUID, CellToGUID) Экспорт
	
	Результат = Новый Структура;                                    
	Результат.Вставить("Ошибка", "");
	
	Если ЗначениеЗаполнено(CellFromGUID) Тогда
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellFromGUID));	
	Иначе 
		ЯчейкаОткудаСсылка = Справочники.Ячейки.ПустаяСсылка();	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(CellToGUID) Тогда
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellToGUID));		
	Иначе
		ЯчейкаКудаСсылка = Справочники.Ячейки.ПустаяСсылка();		
	КонецЕсли; 	
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	ИспользоватьПоискПоЯчейкам = Ложь;
	
	Если ЗначениеЗаполнено(CellFromGUID) Или ЗначениеЗаполнено(CellToGUID) Тогда
		ИспользоватьПоискПоЯчейкам = Истина;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БуферАРМКладовшикаПеремещение.UserId КАК UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда КАК ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	БуферАРМКладовшикаПеремещение.Номенклатура,
	|	СУММА(БуферАРМКладовшикаПеремещение.Quantity) КАК Quantity,
	|	МАКСИМУМ(БуферАРМКладовшикаПеремещение.КодПроизводителя) КАК КодПроизводителя,
	|	МАКСИМУМ(БуферАРМКладовшикаПеремещение.ВведеноВРучную) КАК ВведеноВРучную
	|ПОМЕСТИТЬ ТаблБуфера
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМКладовшикаПеремещение
	|ГДЕ
	|	БуферАРМКладовшикаПеремещение.UserId = &UserId
	|	И (&ИспользоватьПоискПоЯчейкам
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаОткуда = &ЯчейкаОткуда
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаКуда = &ЯчейкаКуда
	|			ИЛИ НЕ &ИспользоватьПоискПоЯчейкам)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовшикаПеремещение.UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	БуферАРМКладовшикаПеремещение.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблБуфера.UserId,
	|	ТаблБуфера.ЯчейкаОткуда,
	|	ТаблБуфера.ЯчейкаКуда,
	|	ТаблБуфера.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) <= ТаблБуфера.Quantity
	|				ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)
	|			ИНАЧЕ ТаблБуфера.Quantity
	|		КОНЕЦ) КАК Quantity,
	|	ТаблБуфера.КодПроизводителя,
	|	ТаблБуфера.ВведеноВРучную,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) >= ТаблБуфера.Quantity
	|				ТОГДА 0
	|			ИНАЧЕ ТаблБуфера.Quantity - ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)
	|		КОНЕЦ) КАК КоличествоВернуть
	|ИЗ
	|	ТаблБуфера КАК ТаблБуфера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	|		ПО ТаблБуфера.ЯчейкаОткуда = ТоварыВЯчейкахОстатки.Ячейка
	|			И ТаблБуфера.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблБуфера.UserId,
	|	ТаблБуфера.ЯчейкаОткуда,
	|	ТаблБуфера.ЯчейкаКуда,
	|	ТаблБуфера.Номенклатура,
	|	ТаблБуфера.КодПроизводителя,
	|	ТаблБуфера.ВведеноВРучную";
	
	Запрос.УстановитьПараметр("ИспользоватьПоискПоЯчейкам", ИспользоватьПоискПоЯчейкам);	
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	Запрос.УстановитьПараметр("ЯчейкаОткуда", ЯчейкаОткудаСсылка);	
	Запрос.УстановитьПараметр("ЯчейкаКуда", ЯчейкаКудаСсылка);	
	
	РезультатЗапросаОсн = Запрос.Выполнить();
	
	Если НЕ РезультатЗапросаОсн.Пустой() Тогда
		
		// Шапка документа	
		ДокументПеремещения = Документы.ПеремещениеТовараПоЯчейкам.СоздатьДокумент();
		ДокументПеремещения.Клеверенс = Истина;        
		ДокументПеремещения.Ответственный = UserIdСсылка;
		ДокументПеремещения.Дата = ТекущаяДата();		
		ДокументПеремещения.Склад       = Константы.ОсновнойСклад.Получить();
		ДокументПеремещения.Ячейка      = ЯчейкаОткудаСсылка;
		ДокументПеремещения.ЯчейкаКуда  = ЯчейкаКудаСсылка;
		КомментарийТекст = "Откуда: " + ЯчейкаОткудаСсылка + " куда: " + ЯчейкаКудаСсылка; 
		ДокументПеремещения.Комментарий = КомментарийТекст;
		////////////////////////
		
		ТекстТоварыВернуть = "";
		РезультатЗапроса = РезультатЗапросаОсн.Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл                                    
			
			Если НЕ РезультатЗапроса.Quantity = 0 Тогда
				
				Товар = ДокументПеремещения.Товары.Добавить();	
				Товар.ВведеноВручную = РезультатЗапроса.ВведеноВРучную;
				Товар.Номенклатура   = РезультатЗапроса.Номенклатура;
				Товар.Количество     = РезультатЗапроса.Quantity;               
				Товар.Ячейка         = РезультатЗапроса.ЯчейкаОткуда;
				Товар.ЯчейкаКуда     = РезультатЗапроса.ЯчейкаКуда;
				
			КонецЕсли;
			
			Если НЕ РезультатЗапроса.КоличествоВернуть = 0 Тогда
				ТекстТоварыВернуть = ТекстТоварыВернуть + ?(ТекстТоварыВернуть = "","",Символы.ПС) + "Необходимо вернуть "
				+ СокрЛП(РезультатЗапроса.КоличествоВернуть) + " шт. товара " + СокрЛП(РезультатЗапроса.КодПроизводителя)
				+ " " + СокрЛП(РезультатЗапроса.Номенклатура) + " в ячейку " + СокрЛП(РезультатЗапроса.ЯчейкаОткуда) + "";
			КонецЕсли;			
			
		КонецЦикла;                   
		
		Если НЕ ДокументПеремещения.Товары.Количество() = 0 Тогда  
			
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создан документ перемещения товара по ячейкам", Строка(ДокументПеремещения.Номер));
			
			Попытка
				
				ДокументПеремещения.Записать();	
				ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ перемещения товара по ячейкам", Строка(ДокументПеремещения.Номер));
				
			Исключение            				
				
				ТекстОшибки = ТекстТоварыВернуть+?(ТекстТоварыВернуть = "","",Символы.ПС)+"Ошибка при записи документа в 1С: " + ОписаниеОшибки() + ".";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;				
				
			КонецПопытки;
			
		Иначе
			
			РС = РегистрыСведений.БуферАРМКладовшикаПеремещение.СоздатьНаборЗаписей();
			РС.Отбор.UserId.Установить(UserIdСсылка);
			
			Если ЯчейкаОткудаСсылка <>  Справочники.Ячейки.ПустаяСсылка()  Тогда
				РС.Отбор.ЯчейкаОткуда.Установить(ЯчейкаОткудаСсылка);					
			КонецЕсли; 
			
			РС.Записать();
			ТекстОшибки = "Документ не создан . Отсутствуют товары для перемещения в ячейке " + СокрЛП(ЯчейкаОткудаСсылка) + "." 
			+ ?(ТекстТоварыВернуть = "","",Символы.ПС) + ТекстТоварыВернуть;				
			
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			
			Возврат Результат;
			
		КонецЕсли;
		
		Попытка				
			
			ДокументПеремещения.Записать(РежимЗаписиДокумента.Проведение);				
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ перемещения товара по ячейкам проведен", Строка(ДокументПеремещения.Номер)); 
			
			РС = РегистрыСведений.БуферАРМКладовшикаПеремещение.СоздатьНаборЗаписей();
			РС.Отбор.UserId.Установить(UserIdСсылка);
			
			Если ЯчейкаОткудаСсылка <>  Справочники.Ячейки.ПустаяСсылка()  Тогда
				РС.Отбор.ЯчейкаОткуда.Установить(ЯчейкаОткудаСсылка);					
			КонецЕсли; 
			
			РС.Записать();
			
		Исключение				
			
			ТекстОшибки = ТекстТоварыВернуть+?(ТекстТоварыВернуть = "", "", Символы.ПС) + "Документ """ + ДокументПеремещения.Ссылка + """ успешно записан в базу 1С, но не проведен.";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			
			Возврат Результат;				
			
		КонецПопытки; 
		
		Результат.Вставить("Ошибка", ТекстТоварыВернуть);
		Результат.Вставить("НомерДокумента", ДокументПеремещения.Номер);                
		Результат.Вставить("ДатаДокумента", ДокументПеремещения.Дата);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Иначе
		
		ТекстОшибки = "Отсутствуют отсканированные товары для перемещения.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;

КонецФункции

Функция ПолучитьСписокЯчеекДляПеремещения(UserIdGUID) Экспорт
	
	Результат = Новый Структура;                                    
	Результат.Вставить("Ошибка", "");
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда КАК СсылкаЯчейки,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда КАК СсылкаЯчейкиКуда
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМКладовшикаПеремещение
	|ГДЕ
	|	БуферАРМКладовшикаПеремещение.UserId = &UserId
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовшикаПеремещение.UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда";	
	
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТЗ.Количество() = 0 Тогда
		
		ТекстОшибки = "Отсутствуют отсканированные товары для перемещения.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	                      
	
	МассивВременный = ТаблицуВМассив(ТЗ);                                    
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список ячеек для перемещения", ""); 
	Возврат Результат;
	
КонецФункции

Функция ЗначениеГУИД(СтрокаГУИД)
	
	Попытка
		
		ИД = Новый УникальныйИдентификатор(СтрокаГУИД);
		Результат = Истина;
		
	Исключение
		Результат = Ложь;
	КонецПопытки;	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокЗаписейИзБуфераРазмещения(UserIdGUID, ОbjectIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект,
	|	СпрНоменклатура.Ссылка КАК СсылкаТовара,
	|	СпрНоменклатура.Наименование КАК НаименованиеТовара,
	|	БуферАрмКладовщика.КодПроизводителя КАК КодПроизводителяТовара,
	|	ЕСТЬNULL(СпрНоменклатура.Родитель.Наименование, """") КАК Производитель,
	|	БуферАрмКладовщика.Ячейка.Код КАК Ячейка,
	|	СУММА(БуферАрмКладовщика.Quantity) КАК КоличествоТовара,
	|	ЕСТЬNULL(СпрНоменклатура.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО БуферАрмКладовщика.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &ОbjectIdGUID
	|	И БуферАрмКладовщика.UserId = &UserIdСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	СпрНоменклатура.Ссылка,
	|	СпрНоменклатура.Наименование,
	|	БуферАрмКладовщика.КодПроизводителя,
	|	БуферАрмКладовщика.Ячейка.Код,
	|	ЕСТЬNULL(СпрНоменклатура.ГруппаАВСФилиала.Наименование, ""Е""),
	|	ЕСТЬNULL(СпрНоменклатура.Родитель.Наименование, """")";
	
	
	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ОbjectIdGUID));

	Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
		ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ОbjectIdGUID));
	КонецЕсли;

	Запрос.УстановитьПараметр("ОbjectIdGUID", ДокументСсылка);
	Запрос.УстановитьПараметр("UserIdСсылка", UserIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	//Возврат Сериализовать(ТЗ);                                             
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список записей из буфера размещения", Строка(ДокументСсылка.Номер)); 
	
	Возврат Результат;
	
КонецФункции 

Функция ПолучитьСписокЗаписейИзБуфераРазмещенияГМ(UserIdGUID, ОbjectIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.ГМ КАК ГМ,
	|	БуферАрмКладовщика.Ячейка.Код КАК Ячейка	
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщика
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &ОbjectIdGUID
	|	И БуферАрмКладовщика.UserId = &UserIdСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.ГМ,
	|	БуферАрмКладовщика.Ячейка.Код";
	
	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку( Новый УникальныйИдентификатор(ОbjectIdGUID));
	
	Запрос.УстановитьПараметр("ОbjectIdGUID", ДокументСсылка);
	Запрос.УстановитьПараметр("UserIdСсылка", UserIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список записей из буфера размещения", Строка(ДокументСсылка.Номер)); 
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокЗаписейИзБуфераПеремещения(UserIdGUID, FromCellIdGUID, WhereCellGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Если ЗначениеЗаполнено(FromCellIdGUID) Тогда
		ЯчейкаОткуда = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(FromCellIdGUID));	
	Иначе 
		ЯчейкаОткуда = Справочники.Ячейки.ПустаяСсылка();
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(WhereCellGUID) Тогда
		ЯчейкаКуда = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(WhereCellGUID));	
	Иначе
		ЯчейкаКуда = Справочники.Ячейки.ПустаяСсылка();	
	КонецЕсли; 
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БуферАРМКладовшикаПеремещение.Номенклатура КАК СсылкаТовара,
	|	ЕСТЬNULL(НоменклатураСпр.Родитель.Наименование, """") КАК Производитель,
	|	НоменклатураСпр.Наименование КАК НаименованиеТовара,
	|	БуферАРМКладовшикаПеремещение.КодПроизводителя КАК КодПроизводителяТовара,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда.Код КАК ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда.Код КАК ЯчейкаКуда,
	|	СУММА(БуферАРМКладовшикаПеремещение.Quantity) КАК КоличествоТовара,
	|	ЕСТЬNULL(НоменклатураСпр.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМКладовшикаПеремещение
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|		ПО БуферАРМКладовшикаПеремещение.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	БуферАРМКладовшикаПеремещение.UserId = &UserId
	|	И (&ИспользоватьПоискПоЯчейкам
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаОткуда = &ЯчейкаОткуда
	|				И БуферАРМКладовшикаПеремещение.ЯчейкаКуда = &ЯчейкаКуда
	|			ИЛИ НЕ &ИспользоватьПоискПоЯчейкам)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовшикаПеремещение.Номенклатура,
	|	НоменклатураСпр.Наименование,
	|	БуферАРМКладовшикаПеремещение.КодПроизводителя,
	|	НоменклатураСпр.Родитель.Наименование,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда.Код,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда.Код,
	|	ЕСТЬNULL(НоменклатураСпр.ГруппаАВСФилиала.Наименование, ""Е"")"; 
	
	
	ИспользоватьПоискПоЯчейкам = Ложь;
	
	Если ЗначениеЗаполнено(FromCellIdGUID) Или  ЗначениеЗаполнено(WhereCellGUID) Тогда
		ИспользоватьПоискПоЯчейкам = Истина;
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ИспользоватьПоискПоЯчейкам", ИспользоватьПоискПоЯчейкам);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	Запрос.УстановитьПараметр("ЯчейкаОткуда", ЯчейкаОткуда);	
	Запрос.УстановитьПараметр("ЯчейкаКуда", ЯчейкаКуда);	
	
	УстановитьПривилегированныйРежим(Истина);	                                                  
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Если ЯчейкаКуда = Справочники.Ячейки.ПустаяСсылка() Тогда
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Открыть форму перемещения товара", ""); 			
	Иначе		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список записей из буфера перемещения", "ЯчейкаОткуда -> " + ЯчейкаОткуда.Код + " ЯчейкаКуда -> " + ЯчейкаКуда.Код); 	
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция SendLogsFromTSD(UserIdGUID, Logs) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	РегСведНабор = РегистрыСведений.ЛогАРМКладовщикаИзТСД.СоздатьНаборЗаписей();
	
	СписокДанных = ХранилищеJSONВСтруктуру(Logs);	
	Номер = 0;
	
	Для каждого Данные Из СписокДанных Цикл                          
		
		НоваяЗапись = РегСведНабор.Добавить();			
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Данные);		
		
		НоваяЗапись.ДатаЛогаТСД = Строка(Данные.ДатаСоздания);
		НоваяЗапись.ДатаЗагрузки = ТекущаяДата();      
		
		//+Шульман А. 05.12.2025 #UT10-5576    
		Если Данные.Свойство("НомерЗаписи") Тогда
			НоваяЗапись.Номер = Данные.НомерЗаписи;  
		//-Шульман А. 05.12.2025 #UT10-5576
		Иначе
			
			Номер = Номер + 1;
			НоваяЗапись.Номер = Номер;   
			
		КонецЕсли;
		
		НоваяЗапись.UserId = UserIdСсылка;
		
	КонецЦикла; 
	
	РегСведНабор.Записать(Ложь);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать логи из ТСД в РС", ""); 	
	
	Возврат Истина;
	
КонецФункции

Функция GetDescriptionForMoving(UserIdGUID, FromCellIdGUID, WhereCellIdGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	ТоварыВЯчейкахОбороты.Склад,
	|	ТоварыВЯчейкахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	ТоварыВЯчейкахОбороты.КоличествоОборот,
	|	ТоварыВЯчейкахОбороты.КоличествоРасход,
	|	ТоварыВЯчейкахОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОборотыЯчекаОткуда
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, Ячейка = &ЯчейкаОткуда) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТовараПоЯчейкам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ТоварыВЯчейкахОбороты.Склад,
	|	ТоварыВЯчейкахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыВЯчейкахОбороты.Ячейка,
	|	ТоварыВЯчейкахОбороты.КоличествоОборот,
	|	ТоварыВЯчейкахОбороты.КоличествоПриход,
	|	ТоварыВЯчейкахОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ОборотыЯчекаКуда
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, Ячейка = &ЯчейкаКуда) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.ПеремещениеТовараПоЯчейкам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТоварыВЯчейкахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТОстаткиЯчейкиОткуда
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка = &ЯчейкаОткуда) КАК ТоварыВЯчейкахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ОборотыЯчекаОткуда.КоличествоРасход) КАК Количество,
	|	ОборотыЯчекаКуда.Ячейка.Код КАК ЯчейкаКуда,
	|	ОборотыЯчекаОткуда.Ячейка.Код КАК ЯчейкаОткуда
	|ПОМЕСТИТЬ ОборотыМеждуЯчейками
	|ИЗ
	|	ОборотыЯчекаОткуда КАК ОборотыЯчекаОткуда
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОборотыЯчекаКуда КАК ОборотыЯчекаКуда
	|		ПО ОборотыЯчекаОткуда.Регистратор = ОборотыЯчекаКуда.Регистратор
	|			И ОборотыЯчекаОткуда.Номенклатура = ОборотыЯчекаКуда.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ОборотыЯчекаКуда.Ячейка.Код,
	|	ОборотыЯчекаОткуда.Ячейка.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАРМКладовшикаПеремещение.UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда,
	|	СУММА(БуферАРМКладовшикаПеремещение.Quantity) КАК Quantity
	|ПОМЕСТИТЬ БуферАРМПеремещ
	|ИЗ
	|	РегистрСведений.БуферАРМКладовшикаПеремещение КАК БуферАРМКладовшикаПеремещение
	|ГДЕ
	|	БуферАРМКладовшикаПеремещение.UserId = &UserIdСсылка
	|	И БуферАРМКладовшикаПеремещение.ЯчейкаОткуда = &ЯчейкаОткуда
	|	И БуферАРМКладовшикаПеремещение.ЯчейкаКуда = &ЯчейкаКуда
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовшикаПеремещение.UserId,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаОткуда,
	|	БуферАРМКладовшикаПеремещение.ЯчейкаКуда
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОборотыМеждуЯчейками.Количество, 0) КАК КоличествоПеремещено,
	|	ЕСТЬNULL(ВТОстаткиЯчейкиОткуда.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(БуферАРМПеремещ.Quantity, 0) КАК КоличествоНабрано
	|ИЗ
	|	ОборотыМеждуЯчейками КАК ОборотыМеждуЯчейками
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТОстаткиЯчейкиОткуда КАК ВТОстаткиЯчейкиОткуда
	|			ПОЛНОЕ СОЕДИНЕНИЕ БуферАРМПеремещ КАК БуферАРМПеремещ
	|			ПО (ИСТИНА)
	|		ПО (ИСТИНА)";
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	ЯчейкаОткуда = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(FromCellIdGUID));
	ЯчейкаКуда = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(WhereCellIdGUID));
	
	Запрос.УстановитьПараметр("UserIdСсылка", UserIdСсылка);
	Запрос.УстановитьПараметр("ЯчейкаОткуда", ЯчейкаОткуда);
	Запрос.УстановитьПараметр("ЯчейкаКуда", ЯчейкаКуда);
	Запрос.УстановитьПараметр("ДатаНачала", Новый Граница(ТекущаяДата() - 60 * 30, ВидГраницы.Включая)); 
	Запрос.УстановитьПараметр("ДатаКонца", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	//Возврат Сериализовать(ТЗ);
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить описание для перемещения между ячейками", 
	"ЯчейкаОткуда -> " + ЯчейкаОткуда.Код + " ЯчейкаКуда -> " + ЯчейкаКуда.Код + "; КоличествоПеремещено, КоличествоОстаток, КоличествоНабрано "); 	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстатокПоВсемТоварамИзДокумента(ObjectIdGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);		
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+Кабанов А.В 11.09.2025 # UT10-5419
	"ВЫБРАТЬ
	|	Константы.НеПроверятьМаркировкиВЭкспрессах
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК СсылкаПТУ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоТовара,
	|	МИНИМУМ(НоменклатураСпр.Наименование) КАК НаименованиеТовара,
	|	МИНИМУМ(НоменклатураСпр.Родитель.Наименование) КАК Производитель,
	|	МАКСИМУМ(НоменклатураСпр.КодПроизводителя) КАК КодПроизводителяТовара,
	|	МАКСИМУМ(ЕдиницыИзмерения.Код) КАК КодЕдиИзм,
	|	МАКСИМУМ(ЕдиницыИзмерения.Наименование) КАК ЕдИзмНаименование,
	|	МИНИМУМ(НоменклатураСпр.НормализованныйКод) КАК НормализованныйКод,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Экспресс
	|					И ВТ_Константа.НеПроверятьМаркировкиВЭкспрессах
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка
	|		КОНЕЦ) КАК ТребуетсяМаркировка,
	//+Шульман А. 17.10.2025 #UT10-5472
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ТребуетсяМаркировка И &ТекДата >= ЕСТЬNULL(НоменклатураСпр.ТоварнаяГруппаЧестногоЗнака.ДатаОкончанияМаркировкиОстатков, ДАТАВРЕМЯ(3000, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПревышенаДатаМаркировкиОстатков,
	|	ЕСТЬNULL(НоменклатураСпр.ТоварнаяГруппаЧестногоЗнака.Наименование, """") КАК ТоварнаяГруппа
	//-Шульман А. 17.10.2025 #UT10-5472
	|ПОМЕСТИТЬ ТоварВДокументе
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО НоменклатураСпр.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = НоменклатураСпр.Ссылка,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &ОbjectIdGUID
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	//+Шульман А. 17.10.2025 #UT10-5472
	|	ВЫБОР
	|		КОГДА НоменклатураСпр.ТребуетсяМаркировка И &ТекДата >= ЕСТЬNULL(НоменклатураСпр.ТоварнаяГруппаЧестногоЗнака.ДатаОкончанияМаркировкиОстатков, ДАТАВРЕМЯ(3000, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(НоменклатураСпр.ТоварнаяГруппаЧестногоЗнака.Наименование, """")
	//-Шульман А. 17.10.2025 #UT10-5472
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество),
	|	МИНИМУМ(СпрНоменклатура.Наименование),
	|	МИНИМУМ(СпрНоменклатура.Родитель.Наименование),
	|	МАКСИМУМ(СпрНоменклатура.КодПроизводителя),
	|	МАКСИМУМ(ЕдиницыИзмерения.Код),
	|	МАКСИМУМ(ЕдиницыИзмерения.Наименование),
	|	МИНИМУМ(СпрНоменклатура.НормализованныйКод),
	|	ЛОЖЬ,
	//+Шульман А. 17.10.2025 #UT10-5472  
	|	ЛОЖЬ,
	|	""""
	//+Шульман А. 17.10.2025 #UT10-5472
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО СпрНоменклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ОbjectIdGUID
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СсылкаПТУ,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект КАК Объект,
	|	БуферАрмКладовщика.Номенклатура КАК Номенклатура,
	|	СУММА(БуферАрмКладовщика.Quantity) КАК КоличествоТовараНабрано
	|ПОМЕСТИТЬ БуферРС
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &ОbjectIdGUID
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Номенклатура
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАрмКладовщика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование КАК Объект,
	|	РазмещениеПоЯчейкамТовары.Номенклатура КАК Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК КоличествоВРазмещении,   
	//+Шульман А. 14.10.2025 #UT10-5438
	|	СУММА(ВЫБОР
	|			КОГДА РазмещениеПоЯчейкамТовары.Номенклатура.ТребуетсяМаркировка
	|					И РазмещениеПоЯчейкамТовары.Ячейка В(&ЯчейкаДляМаркировки)
	|				ТОГДА РазмещениеПоЯчейкамТовары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДляПеремаркировки   
	//-Шульман А. 14.10.2025 #UT10-5438
	|ПОМЕСТИТЬ ДокРазмещения
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &ОbjectIdGUID
	|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен = ИСТИНА
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование,
	|	РазмещениеПоЯчейкамТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Объект,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	БуферАрмКладовщикаМаркировки.Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщикаМаркировки.Barcode) КАК Barcode
	|ПОМЕСТИТЬ ВТ_БуферМаркировок
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	БуферАрмКладовщикаМаркировки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварВДокументе.СсылкаПТУ КАК Объект,
	|	ТоварВДокументе.Номенклатура, 
	
	|	СУММА(ЕСТЬNULL(ОжидаемыеКоды.КодМаркировки, 0)) КАК ОжидаемыхКодов,
	|	СУММА(ЕСТЬNULL(ОтсканированныеКоды.КодМаркировки, 0)     
	//+Шульман А. 02.10.2025 #UT10-5438
	|	   + ЕСТЬNULL(ДокРазмещения.КоличествоДляПеремаркировки, 0))  
	//-Шульман А. 02.10.2025 #UT10-5438
	|	КАК ОтсканированноКодов,
	|	СУММА(ВТ_БуферМаркировок.Barcode) КАК КодовВБуфере
	|ПОМЕСТИТЬ ВТ_Маркировка
	|ИЗ
	|	ТоварВДокументе КАК ТоварВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка КАК Ссылка,
	|			ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура КАК КодМаркировкиНоменклатура,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки) КАК КодМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.КодыМаркировки КАК ПоступлениеТоваровУслугКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка = &ОbjectIdGUID
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка,
	|			ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура) КАК ОжидаемыеКоды
	|		ПО ТоварВДокументе.Номенклатура = ОжидаемыеКоды.КодМаркировкиНоменклатура
	|			И ТоварВДокументе.СсылкаПТУ = ОжидаемыеКоды.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка КАК Ссылка,
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура КАК КодМаркировкиНоменклатура,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки) КАК КодМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка = &ОbjectIdGUID
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка,
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура) КАК ОтсканированныеКоды
	|		ПО ТоварВДокументе.Номенклатура = ОтсканированныеКоды.КодМаркировкиНоменклатура
	|			И ТоварВДокументе.СсылкаПТУ = ОтсканированныеКоды.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БуферМаркировок КАК ВТ_БуферМаркировок
	|		ПО ТоварВДокументе.Номенклатура = ВТ_БуферМаркировок.Номенклатура
	|			И ТоварВДокументе.СсылкаПТУ = ВТ_БуферМаркировок.Объект  
	//+Шульман А. 02.10.2025 #UT10-5438
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокРазмещения КАК ДокРазмещения
	|		ПО ТоварВДокументе.Номенклатура = ДокРазмещения.Номенклатура
	|			И ТоварВДокументе.СсылкаПТУ = ДокРазмещения.Объект
	|			И (ДокРазмещения.Номенклатура.ТребуетсяМаркировка)   
	//-Шульман А. 02.10.2025 #UT10-5438
	|ГДЕ
	|	ТоварВДокументе.ТребуетсяМаркировка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварВДокументе.СсылкаПТУ,
	|	ТоварВДокументе.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварВДокументе.СсылкаПТУ,
	|	ТоварВДокументе.Номенклатура КАК СсылкаТовара,  
	|	ВЫБОР
	|		КОГДА ТоварВДокументе.ТребуетсяМаркировка
	|			ТОГДА ЕСТЬNULL(ВТ_Маркировка.ОтсканированноКодов, 0)
	|		ИНАЧЕ ТоварВДокументе.КоличествоТовара
	|	КОНЕЦ КАК КоличествоТовара,
	|	ТоварВДокументе.НаименованиеТовара,
	|	ЕСТЬNULL(ТоварВДокументе.Производитель, """") КАК Производитель,
	|	ТоварВДокументе.КодПроизводителяТовара,
	|	ТоварВДокументе.КодЕдиИзм,
	|	ТоварВДокументе.ЕдИзмНаименование,
	|	ЕСТЬNULL(БуферРС.КоличествоТовараНабрано, 0) КАК КоличествоТовараНабрано,
	|	ЕСТЬNULL(ДокРазмещения.КоличествоВРазмещении, 0) КАК КоличествоВРазмещении,
	|	ТоварВДокументе.НормализованныйКод,
	|	ЕСТЬNULL(ТоварВДокументе.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	|	ЕСТЬNULL(ВТ_Маркировка.ОжидаемыхКодов, 0) КАК КоличествоОжидаемыхМаркировок,
	|	ЕСТЬNULL(ВТ_Маркировка.КодовВБуфере, 0) КАК КоличествоВБуфереМаркировок,
	|	ЕСТЬNULL(ВТ_Маркировка.ОтсканированноКодов, 0) КАК КоличествоОтсканированныхМаркировок,
	|	ВЫБОР
	|		КОГДА ТоварВДокументе.ТребуетсяМаркировка
	|			ТОГДА ТоварВДокументе.КоличествоТовара
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоТоваровСМаркировкой,
	|	ТоварВДокументе.ТребуетсяМаркировка КАК ТоварТребуетсяМаркировка,
	//+Шульман А. 17.10.2025 #UT10-5472
	|	ТоварВДокументе.ПревышенаДатаМаркировкиОстатков,
	|	ТоварВДокументе.ТоварнаяГруппа
	//-Шульман А. 17.10.2025 #UT10-5472
	|ИЗ
	|	ТоварВДокументе КАК ТоварВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ БуферРС КАК БуферРС
	|		ПО ТоварВДокументе.Номенклатура = БуферРС.Номенклатура
	|			И ТоварВДокументе.СсылкаПТУ = БуферРС.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокРазмещения КАК ДокРазмещения
	|		ПО ТоварВДокументе.СсылкаПТУ = ДокРазмещения.Объект
	|			И ТоварВДокументе.Номенклатура = ДокРазмещения.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маркировка КАК ВТ_Маркировка
	|		ПО ТоварВДокументе.СсылкаПТУ = ВТ_Маркировка.Объект
	|			И ТоварВДокументе.Номенклатура = ВТ_Маркировка.Номенклатура";	

	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку( Новый УникальныйИдентификатор(ObjectIdGUID));

	Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
		ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку( Новый УникальныйИдентификатор(ObjectIdGUID));
	КонецЕсли;

	Запрос.УстановитьПараметр("ОbjectIdGUID", ДокументСсылка);  
	
	УстановитьПривилегированныйРежим(Истина);   
	//+Шульман А. 14.10.2025 #UT10-5438                  
	//+Шульман А. 13.11.2025 #UT10-5504 
	//Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", Константы.ЯчейкаДляМаркировки.Получить());
	МассивЯчейкаДляМаркировки = Новый Массив;
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляМаркировки.Получить());     
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляПеремаркировки.Получить());
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляВозвратаПоставщику.Получить());
	Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", МассивЯчейкаДляМаркировки); 
	//Шульман А. 13.11.2025 #UT10-5504 
	//-Шульман А. 14.10.2025 #UT10-5438    
	//+Шульман А. 17.10.2025 #UT10-5472  
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	//-Шульман А. 17.10.2025 #UT10-5472
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остаток по всем товарам из документа", "Документ ПТУ " + ДокументСсылка.Номер);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстатокПоВсемГМИзДокумента(ObjectIdGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectIdGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|ПОМЕСТИТЬ ВТ_ГМПоступлений
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.ГМ
	|ПОМЕСТИТЬ ВТ_ГМРазмещений
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &Ссылка
	|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.ГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщикаГМ.ГМ
	|ПОМЕСТИТЬ ВТ_ГМВБуфере
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщикаГМ
	|ГДЕ
	|	БуферАрмКладовщикаГМ.Объект = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаГМ.ГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГМПоступлений.ГМ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ГМРазмещений.ГМ, """") <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоРазмещено,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ГМВБуфере.ГМ, """") <> """"
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНабрано,
	|	ВТ_ГМПоступлений.Ссылка КАК СсылкаПТУ
	|ИЗ
	|	ВТ_ГМПоступлений КАК ВТ_ГМПоступлений
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГМРазмещений КАК ВТ_ГМРазмещений
	|		ПО ВТ_ГМПоступлений.ГМ = ВТ_ГМРазмещений.ГМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГМВБуфере КАК ВТ_ГМВБуфере
	|		ПО ВТ_ГМПоступлений.ГМ = ВТ_ГМВБуфере.ГМ";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остаток по всем ГМ из документа", "Документ ПТУ " + ДокументСсылка.Номер);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстатокПоТоваруИзДокумента(UserIdGUID, ObjectIdGUID, Barcode, SelectedProductIdGUID, ПолучитьТЗ = Ложь) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+Кабанов А.В. 11.09.2025 # UT10-5419
	"ВЫБРАТЬ
	|	Константы.НеПроверятьМаркировкиВЭкспрессах
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Экспресс
	|					И ВТ_Константа.НеПроверятьМаркировкиВЭкспрессах
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка
	|		КОНЕЦ) КАК ТребуетсяМаркировка
	|ПОМЕСТИТЬ ТоварВДокументе
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &ОbjectIdGUID
	|	И ПоступлениеТоваровУслугТовары.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество),
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ОbjectIdGUID
	|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщика.Номенклатура,
	|	СУММА(БуферАрмКладовщика.Quantity) КАК КоличествоВБуфере
	|ПОМЕСТИТЬ БуферРС
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|ГДЕ
	|	БуферАрмКладовщика.Объект = &ОbjectIdGUID
	|	И БуферАрмКладовщика.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Номенклатура
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАрмКладовщика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК КоличествоВРазмещении,
	//+Шульман А. 14.10.2025 #UT10-5438
	|	СУММА(ВЫБОР
	|			КОГДА РазмещениеПоЯчейкамТовары.Номенклатура.ТребуетсяМаркировка
	|					И РазмещениеПоЯчейкамТовары.Ячейка В(&ЯчейкаДляМаркировки)
	|				ТОГДА РазмещениеПоЯчейкамТовары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДляПеремаркировки   
	//-Шульман А. 14.10.2025 #UT10-5438
	|ПОМЕСТИТЬ ДокРазмещения
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = &ОbjectIdGUID
	|	И РазмещениеПоЯчейкамТовары.Номенклатура = &Номенклатура
	|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен = ИСТИНА
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщикаМаркировки.Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщикаМаркировки.Barcode) КАК Barcode
	|ПОМЕСТИТЬ ВТ_БуферМаркировок
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|ГДЕ
	|	БуферАрмКладовщикаМаркировки.Объект = &ОbjectIdGUID
	|	И БуферАрмКладовщикаМаркировки.Номенклатура = &Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаМаркировки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварВДокументе.Номенклатура,
	|	СУММА(ОжидаемыеКоды.КоличествоКодМаркировки) КАК ОжидаемыхКодов,
	|	СУММА(ОтсканированныеКоды.КоличествоКодМаркировки   
	//+Шульман А. 02.10.2025 #UT10-5438
	|	  + ЕСТЬNULL(ДокРазмещения.КоличествоДляПеремаркировки, 0))  
	//-Шульман А. 02.10.2025 #UT10-5438
	|	  КАК ОтсканированноКодов,
	|	СУММА(ЕСТЬNULL(ВТ_БуферМаркировок.Barcode, 0)) КАК КодовВБуфере,
	|	МАКСИМУМ(ТоварВДокументе.ТребуетсяМаркировка) КАК ТребуетсяМаркировка
	|ПОМЕСТИТЬ ВТ_Маркировка
	|ИЗ
	|	ТоварВДокументе КАК ТоварВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура КАК КодМаркировкиНоменклатура,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки) КАК КоличествоКодМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.КодыМаркировки КАК ПоступлениеТоваровУслугКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка = &ОbjectIdGUID
	|			И ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура = &Номенклатура
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура) КАК ОжидаемыеКоды
	|		ПО ТоварВДокументе.Номенклатура = ОжидаемыеКоды.КодМаркировкиНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура КАК КодМаркировкиНоменклатура,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки) КАК КоличествоКодМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка = &ОbjectIdGUID
	|			И ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура = &Номенклатура
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура) КАК ОтсканированныеКоды
	|		ПО ТоварВДокументе.Номенклатура = ОтсканированныеКоды.КодМаркировкиНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БуферМаркировок КАК ВТ_БуферМаркировок
	|		ПО ТоварВДокументе.Номенклатура = ВТ_БуферМаркировок.Номенклатура     
	//+Шульман А. 02.10.2025 #UT10-5438
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокРазмещения КАК ДокРазмещения
	|		ПО ТоварВДокументе.Номенклатура = ДокРазмещения.Номенклатура
	|			И (ДокРазмещения.Номенклатура.ТребуетсяМаркировка)   
	//-Шульман А. 02.10.2025 #UT10-5438
	|ГДЕ
	|	ТоварВДокументе.ТребуетсяМаркировка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварВДокументе.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварВДокументе.Номенклатура КАК СсылкаТовара,
	|	ТоварВДокументе.Количество КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ДокРазмещения.КоличествоВРазмещении, 0) КАК КоличествоВРазмещении,
	|	ЕСТЬNULL(БуферРС.КоличествоВБуфере, 0) КАК КоличествоВБуфере,
	|	ЕСТЬNULL(ВТ_Маркировка.ОжидаемыхКодов, 0) КАК КоличествоОжидаемыхМаркировок,
	|	ЕСТЬNULL(ВТ_Маркировка.КодовВБуфере, 0) КАК КоличествоВБуфереМаркировок,
	|	ЕСТЬNULL(ВТ_Маркировка.ОтсканированноКодов, 0) КАК КоличествоОтсканированныхМаркировок,
	|	ВЫБОР
	|		КОГДА ТоварВДокументе.ТребуетсяМаркировка
	|			ТОГДА ТоварВДокументе.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоТоваровСМаркировкой,
	|	ТоварВДокументе.ТребуетсяМаркировка КАК ТоварТребуетсяМаркировка
	|ИЗ
	|	ТоварВДокументе КАК ТоварВДокументе
	|		ЛЕВОЕ СОЕДИНЕНИЕ БуферРС КАК БуферРС
	|		ПО ТоварВДокументе.Номенклатура = БуферРС.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокРазмещения КАК ДокРазмещения
	|		ПО ТоварВДокументе.Номенклатура = ДокРазмещения.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маркировка КАК ВТ_Маркировка
	|		ПО ТоварВДокументе.Номенклатура = ВТ_Маркировка.Номенклатура";
	
	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectIdGUID));

	Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
		ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectIdGUID));
	КонецЕсли;

	Запрос.УстановитьПараметр("ОbjectIdGUID", ДокументСсылка);
	
	ProductIdСсылка  =  Справочники["Номенклатура"].ПолучитьСсылку(Новый УникальныйИдентификатор(SelectedProductIdGUID));
	Запрос.УстановитьПараметр("Номенклатура", ProductIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);    
	//+Шульман А. 14.10.2025 #UT10-5438
	//+Шульман А. 13.11.2025 #UT10-5504 
	//Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", Константы.ЯчейкаДляМаркировки.Получить());
	МассивЯчейкаДляМаркировки = Новый Массив;
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляМаркировки.Получить());  
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляПеремаркировки.Получить());
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляВозвратаПоставщику.Получить());
	Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", МассивЯчейкаДляМаркировки);       
	//Шульман А. 13.11.2025 #UT10-5504 
	//-Шульман А. 14.10.2025 #UT10-5438
	
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остаток по товару из документа", "Документ ПТУ " + ДокументСсылка.Номер);
	
	Если ПолучитьТЗ Тогда
		Возврат ТЗ;
	КонецЕсли; 
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМаркировкиПоДокументуПТУ(ObjectIdGUID, UserIdGUID) Экспорт 

	UserIdСсылка = ПолучитьПользователя(UserIdGUID);		
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугКодыМаркировки.Ссылка КАК СсылкаПТУ,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура КАК СсылкаТовара,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура.Родитель.Наименование КАК Производитель,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура.КодПроизводителя КАК КодПроизводителяТовара,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура.НормализованныйКод КАК НормализованныйКод,
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки.КодМаркировки КАК ШтрихКод,
	|	"""" КАК ШтрихКодПолный,                             
	//+Шульман А. 17.03.2026 #UT10-5748
	|	ПоступлениеТоваровУслугКодыМаркировки.Причина,
	|	ПоступлениеТоваровУслугКодыМаркировки.Невалиден      
	//-Шульман А. 17.03.2026 #UT10-5748
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.КодыМаркировки КАК ПоступлениеТоваровУслугКодыМаркировки
	|ГДЕ
	|	ПоступлениеТоваровУслугКодыМаркировки.Ссылка = &ОbjectIdGUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка КАК СсылкаПТУ,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура КАК СсылкаТовара,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура.Наименование КАК НаименованиеТовара,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура.Родитель.Наименование КАК Производитель,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура.КодПроизводителя КАК КодПроизводителяТовара,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.Номенклатура.НормализованныйКод КАК НормализованныйКод,
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки.КодМаркировки КАК ШтрихКод,
	|	"""" КАК ШтрихКодПолный
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|ГДЕ
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка = &ОbjectIdGUID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	БуферАрмКладовщикаМаркировки.Номенклатура КАК СсылкаТовара,
	|	БуферАрмКладовщикаМаркировки.Номенклатура.Наименование КАК НаименованиеТовара,
	|	БуферАрмКладовщикаМаркировки.Номенклатура.Родитель.Наименование КАК Производитель,
	|	БуферАрмКладовщикаМаркировки.Номенклатура.КодПроизводителя КАК КодПроизводителяТовара,
	|	БуферАрмКладовщикаМаркировки.Номенклатура.НормализованныйКод КАК НормализованныйКод,
	|	БуферАрмКладовщикаМаркировки.Barcode КАК ШтрихКод,
	|	БуферАрмКладовщикаМаркировки.BarcodeFull КАК ШтрихКодПолный
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|ГДЕ
	|	БуферАрмКладовщикаМаркировки.Объект = &ОbjectIdGUID";	
	
	ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку( Новый УникальныйИдентификатор(ObjectIdGUID));

	Запрос.УстановитьПараметр("ОbjectIdGUID", ДокументСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРезультатов = Новый Структура;
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаОжидаемыхМаркировок       = ПакетРезультатов[0].Выгрузить();
	ТаблицаОтсканированныхМаркировок = ПакетРезультатов[1].Выгрузить(); 
	ТаблицаБуфераМаркировок          = ПакетРезультатов[2].Выгрузить(); 
	
	СтруктураРезультатов.Вставить("СписокОжидаемыхМаркировокДокументаПТУ"       , ?(ТаблицаОжидаемыхМаркировок.Количество() = 0 , Неопределено , ТаблицуВМассив(ТаблицаОжидаемыхМаркировок)));
	СтруктураРезультатов.Вставить("СписокОтсканированныхМаркировокДокументаПТУ" , ?(ТаблицаОтсканированныхМаркировок.Количество() = 0 , Неопределено , ТаблицуВМассив(ТаблицаОтсканированныхМаркировок)));
	СтруктураРезультатов.Вставить("СписокТоваровВБуфереМаркировок"              , ?(ТаблицаБуфераМаркировок.Количество() = 0 , Неопределено , ТаблицуВМассив(ТаблицаБуфераМаркировок)));

	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = ДанныеВJSONХранилище(СтруктураРезультатов);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить маркировки для документа", "Документ ПТУ " + ДокументСсылка.Номер);
	
	Возврат Результат;

КонецФункции

Функция ДобавитьШтрихкод(Штрихкод, ТоварГУИД, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	Штрихкод = СокрЛП(Штрихкод);   
	
	Попытка                             
		
		ДанныеВозврат = Новый Структура;
		УстановитьПривилегированныйРежим(Истина);	
		
		Запрос = ПолучитьТоварПоШтрихкоду(UserIdGUID, Штрихкод, "", "", Истина, "" );
		
		Запрос.Текст = Запрос.Текст + ";";		
		Запрос.УстановитьПараметр("ТоварСсылка", Справочники.Номенклатура.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПТУСсылка", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
		Запрос.УстановитьПараметр("ИскатьВПТУ", Ложь);
		
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		// Штрихкод был раннее привязан к номенклатуре                                                                              
		Если РезультатЗапроса.Пустой() Тогда
			
			Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварГУИД));
			НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
			ЕдиницаИзмерения = НоменклатураОбъект.ЕдиницаХраненияОстатков;
			
			Качество = Справочники.Качество.Новый;
			
			Если ТипШтрихкодаEAN13ТО(Штрихкод) Тогда
				ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			Иначе
				ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39;
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Штрихкод = Штрихкод;
			МенеджерЗаписи.Владелец = Номенклатура;
			МенеджерЗаписи.ЕдиницаИзмерения = ЕдиницаИзмерения;		
			МенеджерЗаписи.Качество = Качество;
			МенеджерЗаписи.ТипШтрихкода = ТипШтрихКода;
			МенеджерЗаписи.Записать();
			
			ДанныеВозврат.Вставить("BarcodeAdded", 1);
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", 
			"Добавить штрихкод к товару", "Штрихкод " + Штрихкод + "; Номенклатура " + Номенклатура.Наименование + " " + Строка(Номенклатура.Код));
			
		Иначе 
			
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();						
			
			Если ВыборкаИзРезультатаЗапроса.Следующий() Тогда
				
				Error = "Штрихкод " + Штрихкод + " уже есть в базе 1С, принадлежит номенклатуре ""(" +
				+ СокрЛП(ВыборкаИзРезультатаЗапроса.Код)+") " + СокрЛП(ВыборкаИзРезультатаЗапроса.Наименование) + """";
				
				ДанныеВозврат.Вставить("Ошибка", Error);	                                                    
				ДанныеВозврат.Вставить("BarcodeAdded", 0);	
				
			КонецЕсли;
			
		КонецЕсли; 				
		
		УстановитьПривилегированныйРежим(Ложь);		
		
	Исключение
		
		Error = "Ошибка при добавлнии штрихкода: " + ОписаниеОшибки();
		ДанныеВозврат.Вставить("Ошибка", Error);
		ДанныеВозврат.Вставить("BarcodeAdded", 0);
		
	КонецПопытки;
	
	Результат = ДанныеВJSONХранилище(ДанныеВозврат);	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьТоварПоНормализованномуКодуВызов(UserGUID, Код, ТипДокумента = Неопределено, ГУИДДокумента = Неопределено) Экспорт
	
	Результат = "";
	
	ТекстОтбора = "Номенклатура.НормализованныйКод ПОДОБНО ""%"" + &АртикулКод + ""%""
	|или Номенклатура.НормализованныйКод ПОДОБНО ""%"" + &АртикулКод2 + ""%""
	|или Номенклатура.НормализованныйКод ПОДОБНО ""%"" + &АртикулКод3 + ""%""";
	
	Результат = ПолучитьТоварПоНормализованномуКоду(UserGUID, Код, ТипДокумента, ГУИДДокумента, ТекстОтбора);	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТоварПоКодуВызов(UserGUID, Код, ТипДокумента = Неопределено, ГУИДДокумента = Неопределено)  Экспорт
	
	ТекстОтбора = "Номенклатура.Код =&АртикулКод";
	
	Результат = ПолучитьТоварПоНормализованномуКоду(UserGUID, Код, ТипДокумента, ГУИДДокумента, ТекстОтбора);	
	Возврат Результат;
	
КонецФункции

Функция FindGoodByBarcode(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues = False) Экспорт
	
	// "ПоискШтрихкодов"                                                                                             
	ТЗ =  ARMStoreKeeper.ПолучитьТоварПоШтрихкоду(UserGUID, Barcode, TypeDocument, GUIDDocument, Ложь, GoodGUID);
	
	Если ТЗ.Количество() <> 0  Тогда
		
		Если GetTableValues Тогда
			Возврат ТЗ;
		КонецЕсли; 
		МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
		Возврат Результат	
		
	КонецЕсли; 
	
	// "ПоискПоНормализованномуКоду"
	ТЗ = ARMStoreKeeper.ПолучитьТоварПоНормализованномуКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
	
	Если ТЗ.Количество() <>  0  Тогда
		
		Если GetTableValues Тогда
			Возврат ТЗ;
		КонецЕсли; 
		
		МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
		Возврат Результат	
		
	КонецЕсли; 
	
	// "ПоискПоКоду" 
	ТЗ = ARMStoreKeeper.ПолучитьТоварПоКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
	
	Если GetTableValues Тогда
		Возврат ТЗ;
	КонецЕсли; 
	
	МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
	Возврат Результат	
	
КонецФункции

Функция FindGoodByBarcode50(UserGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues = False) Экспорт
	
	// "ПоискШтрихкодов"                                                                                             
	ТЗ =  ARMStoreKeeper.ПолучитьТоварПоШтрихкоду50(UserGUID, Barcode, TypeDocument, GUIDDocument, Ложь, GoodGUID);
	
	Если ТЗ.Количество() <> 0  Тогда
		
		Если GetTableValues Тогда
			Возврат ТЗ;
		КонецЕсли; 
		
		МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
		Возврат Результат	
		
	КонецЕсли; 
	
	// "ПоискПоНормализованномуКоду"
	ТЗ = ARMStoreKeeper.ПолучитьТоварПоНормализованномуКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
	
	Если ТЗ.Количество() <>  0  Тогда
		
		Если GetTableValues Тогда
			Возврат ТЗ;
		КонецЕсли; 
		
		МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
		Возврат Результат	
		
	КонецЕсли; 
	
	// "ПоискПоКоду" 
	ТЗ = ARMStoreKeeper.ПолучитьТоварПоКодуВызов(UserGUID, Barcode, TypeDocument, GUIDDocument);
	
	Если GetTableValues Тогда
		Возврат ТЗ;
	КонецЕсли; 
	
	МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
	Возврат Результат	
	
КонецФункции

Функция FindGoodByGTIN(UserGUID, GTIN, TypeDocument, GUIDDocument, GoodGUID) Экспорт
	
	//+Шульман А. 20.11.2025 #UT10-5518
	Результат =  ARMStoreKeeper.ПолучитьТоварПоGTIN(UserGUID, GTIN, TypeDocument, GUIDDocument, Ложь, GoodGUID);
	
	Возврат Результат;	
	//-Шульман А. 20.11.2025 #UT10-5518
	
КонецФункции

Функция FindGoodByMark(UserGUID , Barcode , BarcodeFull , TypeDocument , GUIDDocument , GoodGUID , GetTableValues = False) Экспорт
    //+Кабанов А.В. 15.08.2025 # # UT10-5360	
	ТЗ =  ARMStoreKeeper.ПолучитьТоварПоМаркировке(UserGUID , Barcode , BarcodeFull , TypeDocument , GUIDDocument , Ложь , GoodGUID);
	
	Если ТЗ.Количество() <> 0  Тогда
		
		Если GetTableValues Тогда
			Возврат ТЗ;
		КонецЕсли; 
		
		МассивВременный = ARMStoreKeeper.ТаблицуВМассив(ТЗ);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(МассивВременный);
		Возврат Результат	
		
	КонецЕсли;
    //-Кабанов А.В. 15.08.2025 # # UT10-5360 
КонецФункции

Функция ПолучитьТоварПоШтрихкоду(UserIdGUID, Штрихкод, ТипДокумента = "", ГУИДДокумента = "", ПолучитьОбъектЗапрос = Ложь, ТоварГУИД = "") Экспорт
	
	Штрихкод = СокрЛП(Штрихкод);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить товар по штрихкоду", "штрихкод " + Штрихкод + " ТоварГУИД " + ТоварГУИД);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(РегШК.Владелец КАК Справочник.Номенклатура) КАК Ссылка,
	|	""Штрихкод"" КАК ТипСтрокиЗапроса
	|ПОМЕСТИТЬ ВТШтрихкоды
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК РегШК
	|ГДЕ
	|	&Штрихкод <> """"
	|	И РегШК.Штрихкод = &Штрихкод
	|	И РегШК.Владелец ССЫЛКА Справочник.Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	""Штрихкод""
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &ТоварСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Штрихкоды.ЕдиницаИзмерения.Коэффициент,
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Наименование
	|ПОМЕСТИТЬ ВТКоэффициент
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтрихкоды КАК ВТШтрихкоды
	|		ПО Штрихкоды.Владелец = ВТШтрихкоды.Ссылка
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПТУТовары.Номенклатура КАК НоменклатураСсылка,
	|	ПТУТовары.Ссылка КАК ДокументПТУСсылка
	|ПОМЕСТИТЬ ПТУТовары
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПТУТовары
	|ГДЕ
	|	&ИскатьВПТУ
	|	И ПТУТовары.Ссылка = &ПТУСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПТУТовары.Ссылка,
	|	ПТУТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|ГДЕ
	|	&ИскатьВПТУ
	|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ПТУСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	ВТШтрихкоды.Ссылка КАК Владелец,
	|	ВТШтрихкоды.ТипСтрокиЗапроса КАК ТипСтрокиЗапроса,
	|	Номенклатура.Наименование КАК Наименование,
	|	&Штрихкод КАК Штрихкод,
	|	Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
	|	ЕдиницыИзмерения.Коэффициент КАК ЕдХранОстатковКоэффициент,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Кратность КАК Кратность,
	|	ЕСТЬNULL(Номенклатура.Родитель.Наименование, """") КАК Производитель,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияКоэффициент, ЕдиницыИзмерения.Коэффициент) КАК ШтрихкодЕдИзмКоэффициент,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияНаименование, ЕдиницыИзмерения.Наименование) КАК ШтрихкодЕдИзмНаименование
	|ПОМЕСТИТЬ РезультатВТ
	|ИЗ
	|	ВТШтрихкоды КАК ВТШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПТУТовары КАК ПТУТовары
	|			ПО (&ИскатьВПТУ)
	|				И Номенклатура.Ссылка = ПТУТовары.НоменклатураСсылка
	|		ПО ВТШтрихкоды.Ссылка = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициент КАК ВТКоэффициент
	|		ПО ВТШтрихкоды.Ссылка = ВТКоэффициент.Владелец
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИскатьВПТУ
	|				ТОГДА ВЫБОР
	|						КОГДА ПТУТовары.ДокументПТУСсылка ЕСТЬ NULL
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Код,
	|	РезультатВТ.Кратность,
	|	РезультатВТ.Производитель,
	|	МИНИМУМ(РезультатВТ.ШтрихкодЕдИзмКоэффициент) КАК ШтрихкодЕдИзмКоэффициент,
	|	МАКСИМУМ(РезультатВТ.ШтрихкодЕдИзмНаименование) КАК ШтрихкодЕдИзмНаименование,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала
	|ИЗ
	|	РезультатВТ КАК РезультатВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.Код,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.Производитель,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Кратность,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е"")";
	
	Если ПолучитьОбъектЗапрос Тогда                
		Возврат Запрос;
	КонецЕсли; 
	
	ДополТекстЗапроса = "";
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг" Или ТипДокумента = "ПеремещениеТовараИзЯчейки" Или ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда
		
		ЯчейкаGUID = ПолучитьЯчейкуПоШтрихкоду(Штрихкод, UserIdGUID);
		
		Если ЗначениеЗаполнено(ЯчейкаGUID) Тогда				
			
			ДополТекстЗапроса = ДополТекстЗапроса + "
			|ОБЪЕДИНИТЬ
			|	                                                              
			|ВЫБРАТЬ 
			|	&Ячейка КАК Владелец,
			|	""Ячейка""  КАК ТипСтрокиЗапроса,						
			|	&ЯчейкаНаименование КАК Наименование, 
			|	&Штрихкод КАК Штрихкод,                                              
			|	&Штрихкод КАК КодПроизводителя, 			
			|	"" "" КАК ЕдИзмНаименование, 
			|	"" "" КАК ЕдХранОстатковКоэффициент,			
			|	"" "" КАК Код, 
			|	"" "" КАК Кратность, 			
			|	"" "" КАК Производитель, 						
			|	"" "" КАК ШтрихкодЕдИзмКоэффициент,
			|	"" "" КАК ШтрихкодЕдИзмНаименование,
			|	"" "" КАК ГруппаАВСФилиала
			|";
			
			ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ЯчейкаGUID) );
			ЯчейкаОбъект = ЯчейкаСсылка.ПолучитьОбъект();
			
			Запрос.УстановитьПараметр("Ячейка", ЯчейкаСсылка);
			Запрос.УстановитьПараметр("ЯчейкаНаименование", "ЯЧЕЙКА -> " + ЯчейкаОбъект.Код);			
			Запрос.УстановитьПараметр("Штрихкод", ЯчейкаОбъект.Код);
			
		КонецЕсли;
		
	КонецЕсли;							
	
	
	Запрос.Текст = Запрос.Текст + ДополТекстЗапроса + ";";
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Если ЗначениеЗаполнено(ТоварГУИД) Тогда
		Запрос.УстановитьПараметр("ТоварСсылка", Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварГУИД)));	
	Иначе
		Запрос.УстановитьПараметр("ТоварСсылка", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ГУИДДокумента) И ТипДокумента = "ПоступлениеТоваровУслуг" Тогда  

		ДокументСсылка =Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		
		Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
			ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПТУСсылка", ДокументСсылка);
		Запрос.УстановитьПараметр("ИскатьВПТУ", Истина);
		
	Иначе
		
		Запрос.УстановитьПараметр("ПТУСсылка", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
		Запрос.УстановитьПараметр("ИскатьВПТУ", Ложь);		
		
	КонецЕсли;  
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                           
	
КонецФункции

Функция ПолучитьТоварПоШтрихкоду50(UserIdGUID, Штрихкод, ТипДокумента = "", ГУИДДокумента = "", ПолучитьОбъектЗапрос = Ложь, ТоварГУИД = "") Экспорт
	
	Штрихкод = СокрЛП(Штрихкод);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить товар по штрихкоду", "штрихкод " + Штрихкод + " ТоварГУИД " + ТоварГУИД);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(РегШК.Владелец КАК Справочник.Номенклатура) КАК Ссылка,
	|	РегШК.ЕдиницаИзмерения.Ссылка,
	|	""Штрихкод"" КАК ТипСтрокиЗапроса
	|ПОМЕСТИТЬ ВТШтрихкоды
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК РегШК
	|ГДЕ
	|	&Штрихкод <> """"
	|	И РегШК.Штрихкод = &Штрихкод
	|	И РегШК.Владелец ССЫЛКА Справочник.Номенклатура
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка,
	|	Номенклатура.ЕдиницаХраненияОстатков.Ссылка,
	|	""Штрихкод""
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &ТоварСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Штрихкоды.ЕдиницаИзмерения.Коэффициент,
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Наименование,
	|	Штрихкоды.ЕдиницаИзмерения.Ссылка
	|ПОМЕСТИТЬ ВТКоэффициент
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтрихкоды КАК ВТШтрихкоды
	|		ПО Штрихкоды.Владелец = ВТШтрихкоды.Ссылка
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПТУТовары.Номенклатура КАК НоменклатураСсылка,
	|	ПТУТовары.Ссылка КАК ДокументПТУСсылка
	|ПОМЕСТИТЬ ПТУТовары
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПТУТовары
	|ГДЕ
	|	&ИскатьВПТУ
	|	И ПТУТовары.Ссылка = &ПТУСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПТУТовары.Ссылка,
	|	ПТУТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|ГДЕ
	|	&ИскатьВПТУ
	|	И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ПТУСсылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НоменклатураСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВТШтрихкоды.Ссылка КАК Владелец,
	|	ВТШтрихкоды.ТипСтрокиЗапроса КАК ТипСтрокиЗапроса,
	|	Номенклатура.Наименование КАК Наименование,
	|	&Штрихкод КАК Штрихкод,
	|	Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
	|	ЕдиницыИзмерения.Коэффициент КАК ЕдХранОстатковКоэффициент,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Кратность КАК Кратность,
	//+Сёмин Р.И. 19.05.2026 #UT10-5855
	|	ЕСТЬNULL(Номенклатура.ТоварнаяГруппаЧестногоЗнака.ОбъемноСортовойУчет, ЛОЖЬ) КАК ОбъемноСортовойУчет,
	//-Сёмин Р.И. 19.05.2026 #UT10-5855
	|	ЕСТЬNULL(Номенклатура.Родитель.Наименование, """") КАК Производитель,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияКоэффициент, ЕдиницыИзмерения.Коэффициент) КАК ШтрихкодЕдИзмКоэффициент,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияНаименование, ЕдиницыИзмерения.Наименование) КАК ШтрихкодЕдИзмНаименование,
	|	ВТШтрихкоды.ЕдиницаИзмеренияСсылка
	|ПОМЕСТИТЬ РезультатВТ
	|ИЗ
	|	ВТШтрихкоды КАК ВТШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПТУТовары КАК ПТУТовары
	|			ПО (&ИскатьВПТУ)
	|				И Номенклатура.Ссылка = ПТУТовары.НоменклатураСсылка
	|		ПО ВТШтрихкоды.Ссылка = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициент КАК ВТКоэффициент
	|		ПО ВТШтрихкоды.Ссылка = ВТКоэффициент.Владелец
	|			И ВТШтрихкоды.ЕдиницаИзмеренияСсылка = ВТКоэффициент.ЕдиницаИзмеренияСсылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ИскатьВПТУ
	|				ТОГДА ВЫБОР
	|						КОГДА ПТУТовары.ДокументПТУСсылка ЕСТЬ NULL
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ЕдиницаИзмеренияСсылка,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Код,
	|	РезультатВТ.Кратность,
	|	РезультатВТ.Производитель,
	|	РезультатВТ.ШтрихкодЕдИзмКоэффициент,
	|	РезультатВТ.ШтрихкодЕдИзмНаименование КАК ШтрихкодЕдИзмНаименование,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	|	РезультатВТ.Владелец.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
	//+Сёмин Р.И. 19.05.2026 #UT10-5855
	|	РезультатВТ.ОбъемноСортовойУчет КАК ОбъемноСортовойУчет
	//-Сёмин Р.И. 19.05.2026 #UT10-5855
	|ИЗ
	|	РезультатВТ КАК РезультатВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.Код,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.Производитель,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Кратность,
	|	РезультатВТ.ШтрихкодЕдИзмНаименование,
	|	РезультатВТ.ШтрихкодЕдИзмКоэффициент,
	|	РезультатВТ.ЕдиницаИзмеренияСсылка,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е""),
	|	РезультатВТ.Владелец.ТребуетсяМаркировка,
	//+Сёмин Р.И. 19.05.2026 #UT10-5855
	|	РезультатВТ.ОбъемноСортовойУчет
	//-Сёмин Р.И. 19.05.2026 #UT10-5855
	|";	
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////	
	Если ПолучитьОбъектЗапрос Тогда                
		Возврат Запрос;
	КонецЕсли; 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ДополТекстЗапроса = "";  
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг" Или ТипДокумента = "ПеремещениеТовараИзЯчейки" Или ТипДокумента = "ЗаданиеНаИнвентаризацию" Тогда
		
		ЯчейкаGUID = ПолучитьЯчейкуПоШтрихкоду(Штрихкод, UserIdGUID); 
		
		Если ЗначениеЗаполнено(ЯчейкаGUID) Тогда				
			
			ДополТекстЗапроса = ДополТекстЗапроса + "
			|ОБЪЕДИНИТЬ
			|	                                                              
			|ВЫБРАТЬ 
			|	&Ячейка КАК Владелец,
			|   """" КАК ЕдиницаИзмеренияСсылка,
			|	""Ячейка""  КАК ТипСтрокиЗапроса,						
			|	&ЯчейкаНаименование КАК Наименование, 
			|	&Штрихкод КАК Штрихкод,                                              
			|	&Штрихкод КАК КодПроизводителя, 			
			|	"" "" КАК ЕдИзмНаименование, 
			|	"" "" КАК ЕдХранОстатковКоэффициент,			
			|	"" "" КАК Код, 
			|	"" "" КАК Кратность, 			
			|	"" "" КАК Производитель, 						
			|	"" "" КАК ШтрихкодЕдИзмКоэффициент,
			|	"" "" КАК ШтрихкодЕдИзмНаименование,
			|	"" "" КАК ГруппаАВСФилиала,
			|	ЛОЖЬ КАК ТребуетсяМаркировка,
			//+Сёмин Р.И. 19.05.2026 #UT10-5855
			|	ЛОЖЬ КАК ОбъемноСортовойУчет
			//-Сёмин Р.И. 19.05.2026 #UT10-5855
			|";                    
			
			ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ЯчейкаGUID));
			ЯчейкаОбъект = ЯчейкаСсылка.ПолучитьОбъект();
			
			Запрос.УстановитьПараметр("Ячейка", ЯчейкаСсылка);
			Запрос.УстановитьПараметр("ЯчейкаНаименование", "ЯЧЕЙКА -> " + ЯчейкаОбъект.Код);			
			Запрос.УстановитьПараметр("Штрихкод", ЯчейкаОбъект.Код);
			
		КонецЕсли;
		
	КонецЕсли;							
	
	
	Запрос.Текст = Запрос.Текст + ДополТекстЗапроса + ";";
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	
	Если ЗначениеЗаполнено(ТоварГУИД) Тогда
		Запрос.УстановитьПараметр("ТоварСсылка", Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварГУИД)));	
	Иначе
		Запрос.УстановитьПараметр("ТоварСсылка", Справочники.Номенклатура.ПустаяСсылка());
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ГУИДДокумента) И ТипДокумента = "ПоступлениеТоваровУслуг" Тогда
		
		ДокументСсылка =Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента ));
		
		Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
			ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПТУСсылка",ДокументСсылка);
		Запрос.УстановитьПараметр("ИскатьВПТУ", Истина);
		
	Иначе
		
		Запрос.УстановитьПараметр("ПТУСсылка", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
		Запрос.УстановитьПараметр("ИскатьВПТУ", Ложь);		
		
	КонецЕсли; 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;                           
	
КонецФункции

Функция ПолучитьТоварПоGTIN(UserIdGUID, GTIN, ТипДокумента = "", ГУИДДокумента = "", ПолучитьОбъектЗапрос = Ложь, ТоварГУИД = "") Экспорт
	
	//+Шульман А. 20.11.2025 #UT10-5518     
	Результат = Новый Структура("ПроверкаПройдена, Ошибка", Ложь, "");
	GTIN = СокрЛП(GTIN);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Проверить GTIN товара", "GTIN " + GTIN + " ТоварГУИД " + ТоварГУИД);    
	
	Если ЗначениеЗаполнено(ТоварГУИД) Тогда
		ТоварСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ТоварГУИД));	
	Иначе
		ТоварСсылка = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли; 
	
	Если ТоварСсылка.Пустая() Тогда     
		
		Результат.Ошибка = "По ГУИД " + ТоварГУИД + " товар не найден";
		Возврат Результат;
		
	КонецЕсли;       
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СправочникGTIN.Ссылка,
		|	СправочникGTIN.Владелец,
		|	СправочникGTIN.Владелец = &ТоварСсылка КАК ВладелецПроверен
		|ИЗ
		|	Справочник.GTIN КАК СправочникGTIN
		|ГДЕ
		|	СправочникGTIN.GTIN = &GTIN
		//|	И НЕ СправочникGTIN.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВладелецПроверен УБЫВ";
	
	Запрос.УстановитьПараметр("GTIN", GTIN);
	Запрос.УстановитьПараметр("ТоварСсылка", ТоварСсылка);    
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат.Ошибка = "Товар по GTIN " + GTIN + " не найден в базе";
	Иначе                        
		
		Выборка = РезультатЗапроса.Выбрать();  
		Выборка.Следующий();
		
		Если Выборка.ВладелецПроверен Тогда
			Результат.ПроверкаПройдена = Истина;
		Иначе
			Результат.Ошибка = "Код маркировки не соответствует товару (проверка GTIN)";
		КонецЕсли;    
		
	КонецЕсли;
	
	Возврат Результат;                           
	//-Шульман А. 20.11.2025 #UT10-5518

КонецФункции // ()

Функция ПолучитьТоварПоНормализованномуКоду(UserIdGUID, АртикулКод, ТипДокумента = "", ГУИДДокумента = "", ТекстОтбора = "")
	
	Запрос = Новый Запрос;
	
	//+Гавриленков В. 16.07.2026 #UT10-5963 Добавлен ОбъемноСортовойУчет
	ЗапросТекст = 
	"ВЫБРАТЬ ПЕРВЫЕ 100
	|	Номенклатура.Ссылка КАК Ссылка,
	|	ЕСТЬNULL(Номенклатура.Ссылка.ТоварнаяГруппаЧестногоЗнака.ОбъемноСортовойУчет, ЛОЖЬ) КАК ОбъемноСортовойУчет,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ЕдИзмНаименование,
	|	""Номенклатура"" КАК ТипСтрокиЗапроса,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Кратность КАК Кратность,
	|	ЕСТЬNULL(Номенклатура.Родитель.Наименование, """") КАК Производитель, 
	|	ЕСТЬNULL(Номенклатура.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	|	ЕдиницыИзмерения.Наименование 	   КАК ЕдХранОстатковНаименование,
	|	ЕдиницыИзмерения.Коэффициент       КАК ЕдХранОстатковКоэффициент,	
	|	"" ""                              КАК ШтрихкодЕдИзмКоэффициент,
	|	"" ""                              КАК ШтрихкодЕдИзмНаименование,
	|   Номенклатура.ТребуетсяМаркировка   КАК ТребуетсяМаркировка
	|
	|ПОМЕСТИТЬ ВТТовары_Old
	|
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|			И Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	
	|ГДЕ
	|	%%ПоискНоменклатуры%%
	|	И (НЕ Номенклатура.ПометкаУдаления)
	|	И (НЕ Номенклатура.ЭтоГруппа)
	|;";
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг" Тогда		
		
		ДополТекстЗапроса = " 
		////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|А.Ссылка, 
		|МАКСИМУМ(А.ОбъемноСортовойУчет) КАК ОбъемноСортовойУчет,
		|МАКСИМУМ(А.Наименование) КАК Наименование,
		|МАКСИМУМ(А.ГруппаАВСФилиала) КАК ГруппаАВСФилиала,
		|МАКСИМУМ(А.КодПроизводителя) КАК КодПроизводителя,
		|МАКСИМУМ(А.ЕдИзмНаименование) КАК ЕдИзмНаименование,
		|МАКСИМУМ(А.ТипСтрокиЗапроса) КАК ТипСтрокиЗапроса,
		|МАКСИМУМ(ПТУТовары.Номенклатура.Код) КАК Код,
		|МАКСИМУМ(ПТУТовары.Номенклатура.Кратность) КАК Кратность,
		|МАКСИМУМ(ПТУТовары.Номенклатура.Родитель.Наименование) КАК Производитель,
		|МАКСИМУМ(А.ЕдХранОстатковНаименование) КАК ЕдХранОстатковНаименование,
		|МАКСИМУМ(А.ЕдХранОстатковКоэффициент) КАК ЕдХранОстатковКоэффициент,
		|МАКСИМУМ("" "") КАК ШтрихкодЕдИзмКоэффициент,
		|МАКСИМУМ("" "") КАК ШтрихкодЕдИзмНаименование,
		|МАКСИМУМ(А.ТребуетсяМаркировка)
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|ВТТовары_Old КАК А
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПТУТовары
		|ПО А.Ссылка = ПТУТовары.Номенклатура
		|И (ПТУТовары.Ссылка = &ПТУIdСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|А.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|А.Ссылка,
		|МАКСИМУМ(А.ОбъемноСортовойУчет),
		|МАКСИМУМ(А.Наименование),
		|МАКСИМУМ(А.ГруппаАВСФилиала),
		|МАКСИМУМ(А.КодПроизводителя),
		|МАКСИМУМ(А.ЕдИзмНаименование),
		|МАКСИМУМ(А.ТипСтрокиЗапроса),
		|МАКСИМУМ(ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.Код),
		|МАКСИМУМ(ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.Кратность),
		|МАКСИМУМ(ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.Родитель.Родитель.Наименование),
		|МАКСИМУМ(А.ЕдХранОстатковНаименование),
		|МАКСИМУМ(А.ЕдХранОстатковКоэффициент),
		|МАКСИМУМ("" ""),
		|МАКСИМУМ("" ""),
		|МАКСИМУМ(А.ТребуетсяМаркировка)
		|ИЗ
		|ВТТовары_Old КАК А
		|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
		|ПО А.Ссылка = ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура
		|И (ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &ПТУIdСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|А.Ссылка
		|";
		
		ЯчейкаGUID = ПолучитьЯчейкуПоШтрихкоду(АртикулКод, UserIdGUID);
		
		Если ЗначениеЗаполнено(ЯчейкаGUID) Тогда
			
			ДополТекстЗапроса = ДополТекстЗапроса + "
			|ОБЪЕДИНИТЬ
			|	                                                              
			|ВЫБРАТЬ 
			|	&Ячейка КАК Ссылка,
			|	ЛОЖЬ КАК ОбъемноСортовойУчет,
			|	&ЯчейкаНаименование КАК Наименование, 
			|	"" "" КАК ГруппаАВСФилиала, 
			|	"" "" КАК КодПроизводителя, 
			|	"" "" КАК ЕдИзмНаименование, 			
			|	""Ячейка""  КАК ТипСтрокиЗапроса,
			|	"" "" КАК Код,
			|	"" ""  КАК Кратность,
			|	"" ""  КАК Производитель,
			|	"" "" КАК ЕдХранОстатковНаименование,
			|	"" "" КАК ЕдХранОстатковКоэффициент,				
			|	"" "" КАК ШтрихкодЕдИзмКоэффициент,
			|	"" "" КАК ШтрихкодЕдИзмНаименование,
			|   Ложь  КАК ТребуетсяМаркировка
			|";
			
			ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(ЯчейкаGUID) );
			ЯчейкаОбъект = ЯчейкаСсылка.ПолучитьОбъект();
			
			Запрос.УстановитьПараметр("Ячейка", ЯчейкаСсылка);
			Запрос.УстановитьПараметр("ЯчейкаНаименование", ЯчейкаОбъект.Код);			
			
		КонецЕсли;
		
		ЗапросТекст = ЗапросТекст + ДополТекстЗапроса + ";";				
		ПТУIdСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента)); 

		Если ПТУIdСсылка.ПолучитьОбъект() = Неопределено Тогда
			ПТУIdСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		КонецЕсли;

		Запрос.УстановитьПараметр("ПТУIdСсылка", ПТУIdСсылка);
		
	Иначе
		ЗапросТекст = СтрЗаменить(ЗапросТекст, "ВТТовары_Old", "ВТТовары");
	КонецЕсли;	
	
	Запрос.Текст = ЗапросТекст +
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 100
	|	ВТТовары.Ссылка КАК Владелец,
	|	ВТТовары.ОбъемноСортовойУчет КАК ОбъемноСортовойУчет,
	|	ВТТовары.Наименование КАК Наименование,	
	|	ВТТовары.ГруппаАВСФилиала КАК ГруппаАВСФилиала,	
	|	ВТТовары.КодПроизводителя КАК КодПроизводителя,	
	|	ВТТовары.ЕдИзмНаименование КАК ЕдИзмНаименование,		
	|	ВТТовары.ТипСтрокиЗапроса КАК ТипСтрокиЗапроса,
	|	ВТТовары.Код КАК Код,
	|	ВТТовары.Кратность КАК Кратность,	
	|	ЕСТЬNULL(ВТТовары.Производитель, """") КАК Производитель,
	|	ВЫБОР
	|		КОГДА ВТТовары.ШтрихкодЕдИзмНаименование <> "" "" ТОГДА
	|			ВТТовары.ШтрихкодЕдИзмНаименование 
	|		ИНАЧЕ
	|		    ВТТовары.ЕдХранОстатковНаименование                                     
	|	КОНЕЦ КАК ШтрихкодЕдИзмНаименование,		
	
	|	ВЫБОР
	|		КОГДА ВТТовары.ШтрихкодЕдИзмКоэффициент <> "" "" ТОГДА
	|			ВТТовары.ШтрихкодЕдИзмКоэффициент 
	|		ИНАЧЕ
	|		    ВТТовары.ЕдХранОстатковКоэффициент
	|	КОНЕЦ КАК ШтрихкодЕдИзмКоэффициент,
	|  ВТТовары.ТребуетсяМаркировка КАК ТребуетсяМаркировка
	|ИЗ
	|	ВТТовары КАК ВТТовары";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%%ПоискНоменклатуры%%", ТекстОтбора);
	
	Запрос.УстановитьПараметр("АртикулКод",  АртикулКод );
	Запрос.УстановитьПараметр("АртикулКод2", Транслит(АртикулКод));
	Запрос.УстановитьПараметр("АртикулКод3", ВДругойРаскладкеКлавиатуры(АртикулКод));
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();  
	УстановитьПривилегированныйРежим(Ложь);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить товар по нормализованному коду", "АртикулКод " + АртикулКод);
	
	Возврат ТЗ;
	
КонецФункции                                                              

Функция ПолучитьТоварПоМаркировке(UserIdGUID , Штрихкод , ШтрихкодПолный , ТипДокумента = "" , ГУИДДокумента = "" , ПолучитьОбъектЗапрос = Ложь , ТоварГУИД = "") Экспорт
	//+Кабанов А.В. 15.08.2025 # # UT10-5360
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтрихкодыНоменклатуры.Ссылка,
	|	ШтрихкодыНоменклатуры.Номенклатура,
	|	ШтрихкодыНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатков
	|ПОМЕСТИТЬ ВТ_Маркировка
	|ИЗ
	|	Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	(ШтрихкодыНоменклатуры.КодМаркировки = &ШтрихКод
	|			ИЛИ ШтрихкодыНоменклатуры.КодМаркировки = &ШтрихКодПолный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Маркировка.Номенклатура.Ссылка КАК Ссылка,
	|	ВТ_Маркировка.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	|	""Штрихкод"" КАК ТипСтрокиЗапроса,
	|	ЕСТЬNULL(СостоянияКодовМаркировки.СостояниеКМ, ЗНАЧЕНИЕ(Перечисление.СостоянияКодовМаркировки.ПустаяСсылка)) КАК ВведенВОборот
	|ПОМЕСТИТЬ ВТШтрихкоды
	|ИЗ
	|	ВТ_Маркировка КАК ВТ_Маркировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СостоянияКодовМаркировки.ШтрихКодНоменклатуры КАК ШтрихКодНоменклатуры,
	|			МАКСИМУМ(СостоянияКодовМаркировки.Регистратор) КАК Регистратор
	|		ИЗ
	|			РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|		ГДЕ
	|			СостоянияКодовМаркировки.ШтрихКодНоменклатуры В
	|					(ВЫБРАТЬ
	|						ВТ_Маркировка.Ссылка
	|					ИЗ
	|						ВТ_Маркировка)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			СостоянияКодовМаркировки.ШтрихКодНоменклатуры) КАК ВТ_СрезПоследних
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	|			ПО ВТ_СрезПоследних.ШтрихКодНоменклатуры = СостоянияКодовМаркировки.ШтрихКодНоменклатуры
	|				И ВТ_СрезПоследних.Регистратор = СостоянияКодовМаркировки.Регистратор
	|		ПО ВТ_Маркировка.Ссылка = ВТ_СрезПоследних.ШтрихКодНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Штрихкоды.ЕдиницаИзмерения.Коэффициент,
	|	Штрихкоды.Владелец,
	|	Штрихкоды.ЕдиницаИзмерения.Наименование,
	|	Штрихкоды.ЕдиницаИзмерения.Ссылка
	|ПОМЕСТИТЬ ВТКоэффициент
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТШтрихкоды КАК ВТШтрихкоды
	|		ПО Штрихкоды.Владелец = ВТШтрихкоды.Ссылка
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Владелец ССЫЛКА Справочник.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 100
	|	ВТШтрихкоды.Ссылка КАК Владелец,
	|	ВТШтрихкоды.ТипСтрокиЗапроса КАК ТипСтрокиЗапроса,
	|	Номенклатура.Наименование КАК Наименование,
	|	"""" КАК Штрихкод,
	|	Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
	|	ЕдиницыИзмерения.Коэффициент КАК ЕдХранОстатковКоэффициент,
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Кратность КАК Кратность,
	|	ЕСТЬNULL(Номенклатура.Родитель.Наименование, """") КАК Производитель,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияКоэффициент, ЕдиницыИзмерения.Коэффициент) КАК ШтрихкодЕдИзмКоэффициент,
	|	ЕСТЬNULL(ВТКоэффициент.ЕдиницаИзмеренияНаименование, ЕдиницыИзмерения.Наименование) КАК ШтрихкодЕдИзмНаименование,
	|	ВТШтрихкоды.ВведенВОборот = ЗНАЧЕНИЕ(Перечисление.СостоянияКодовМаркировки.ВведенВОборот) КАК ВведенВОборот
	|ПОМЕСТИТЬ РезультатВТ
	|ИЗ
	|	ВТШтрихкоды КАК ВТШтрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|				И Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ВТШтрихкоды.Ссылка = Номенклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоэффициент КАК ВТКоэффициент
	|		ПО ВТШтрихкоды.Ссылка = ВТКоэффициент.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Код,
	|	РезультатВТ.Кратность,
	|	РезультатВТ.Производитель,
	|	РезультатВТ.ШтрихкодЕдИзмКоэффициент,
	|	РезультатВТ.ШтрихкодЕдИзмНаименование КАК ШтрихкодЕдИзмНаименование,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	|	РезультатВТ.Владелец.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
	|	РезультатВТ.ВведенВОборот
	|ИЗ
	|	РезультатВТ КАК РезультатВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	РезультатВТ.Штрихкод,
	|	РезультатВТ.Наименование,
	|	РезультатВТ.ЕдИзмНаименование,
	|	РезультатВТ.Код,
	|	РезультатВТ.КодПроизводителя,
	|	РезультатВТ.Производитель,
	|	РезультатВТ.ТипСтрокиЗапроса,
	|	РезультатВТ.Владелец,
	|	РезультатВТ.ЕдХранОстатковКоэффициент,
	|	РезультатВТ.Кратность,
	|	РезультатВТ.ШтрихкодЕдИзмНаименование,
	|	РезультатВТ.ШтрихкодЕдИзмКоэффициент,
	|	ЕСТЬNULL(РезультатВТ.Владелец.ГруппаАВСФилиала.Наименование, ""Е""),
	|	РезультатВТ.Владелец.ТребуетсяМаркировка,
	|	РезультатВТ.ВведенВОборот";

	Запрос.УстановитьПараметр("Штрихкод"       , Штрихкод);
	Запрос.УстановитьПараметр("ШтрихКодПолный" , ШтрихКодПолный);

	ТЗ = Запрос.Выполнить().Выгрузить();	
	
	Возврат ТЗ; 
	//-Кабанов А.В. 15.08.2025 # # UT10-5360		
КонецФункции

Функция ПолучитьЯчейкуПоШтрихКоду(ШкЯчейки, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Массив = Новый Массив;		
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 2) + "-" + Сред(ШкЯчейки, 3, 1) + "-" + Сред(ШкЯчейки, 4, 2);
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 1) + "-" + Сред(ШкЯчейки, 3, 2) + "-" + Сред(ШкЯчейки, 5, 1);
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = ШкЯчейки;
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 2) + "-" + Сред(ШкЯчейки, 4, 1) + "-" + Сред(ШкЯчейки, 5, 1) + "-" + Сред(ШкЯчейки, 6, 2);
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 2) + "-" + Сред(ШкЯчейки, 4, 2) + "-" + Сред(ШкЯчейки, 6, 1) + "-" + Сред(ШкЯчейки, 7, 2);		
	ИмяЯчейки = СокрЛП(ИмяЯчейки);	
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 2) + "-" + Сред(ШкЯчейки, 4, 2) + "-" + Сред(ШкЯчейки, 6, 2);		
	ИмяЯчейки = СокрЛП(ИмяЯчейки);	
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 1) + "-" + Сред(ШкЯчейки, 3, 2) + "-" + Сред(ШкЯчейки, 5, 2);		
	ИмяЯчейки = СокрЛП(ИмяЯчейки);	
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 3) + "-" + Сред(ШкЯчейки, 4, 2) + "-" + Сред(ШкЯчейки, 6, 2) + "-" + Сред(ШкЯчейки, 8, 2) + "-" + Сред(ШкЯчейки, 10, 2);		
	ИмяЯчейки = СокрЛП(ИмяЯчейки);	
	Массив.Добавить(ИмяЯчейки);
	
	ИмяЯчейки = Сред(ШкЯчейки, 1, 1) + "-" + Сред(ШкЯчейки, 2, 2) + "-" + Сред(ШкЯчейки, 4, 2) + "-" + Сред(ШкЯчейки, 6, 2) + "-" + Сред(ШкЯчейки, 8, 2); 
	ИмяЯчейки = СокрЛП(ИмяЯчейки);	
	Массив.Добавить(ИмяЯчейки);
	
	Запрос = Новый Запрос;                                  
	Запрос.Текст = "
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ячейки.Код,
	|	Ячейки.Ссылка
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|ГДЕ
	|	Ячейки.Код В (&Код)
	|   И Ячейки.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("Код", Массив); 
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество () > 0 Тогда		
		
		РезультатЗапроса.Следующий();
		Результат = XMLСтрока(РезультатЗапроса.Ссылка);
		
	Иначе
		
		Если ЗначениеЗаполнено(ШкЯчейки) Тогда

			ЕстьЯчейка = Справочники.Ячейки.НайтиПоРеквизиту("КодДляПоиска", ШкЯчейки);
			
			Если Не ЕстьЯчейка.Пустая() Тогда
				Результат = XMLСтрока(ЕстьЯчейка.Ссылка);
			Иначе			
				Результат = "";
			КонецЕсли;

		КонецЕсли; 
		
	КонецЕсли;
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить ячейку по штрихкоду", ШкЯчейки); 	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОписаниеТовара(ГУИД, UserIdGUID) Экспорт  
	
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК СсылкаТовара,
	|	Номенклатура.Код,
	|	Номенклатура.Наименование,
	|	Номенклатура.Артикул,
	|	Номенклатура.КодПроизводителя,
	|	Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ЕдИзмНаименование
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",НоменклатураСсылка );
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);	 
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить описание товара", НоменклатураСсылка.Наименование); 	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокТоваровДокументаПТУ(ГУИД, UserIdGUID) Экспорт
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД)); 

	Если ПТУСсылка.ПолучитьОбъект() = Неопределено Тогда
		ПТУСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД));
	КонецЕсли;

	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+Кабанов А.В. 11.09.2025 # UT10-5419
	"ВЫБРАТЬ
	|	Константы.НеПроверятьМаркировкиВЭкспрессах
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка КАК СсылкаПТУ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК СсылкаТовара,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоТовара,
	|	МАКСИМУМ(НоменклатураСпр.Наименование) КАК НаименованиеТовара,
	|	МАКСИМУМ(НоменклатураСпр.КодПроизводителя) КАК КодПроизводителяТовара,
	|	МАКСИМУМ(ЕдиницыИзмерения.Код) КАК КодЕдиИзм,
	|	МАКСИМУМ(ЕдиницыИзмерения.Наименование) КАК ЕдИзмНаименование,
	|	МИНИМУМ(ПоступлениеТоваровУслугТовары.Номенклатура.Кратность) КАК Кратность,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураСпр.НормализованныйКод) КАК НормализованныйКод,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Экспресс
	|					И ВТ_Константа.НеПроверятьМаркировкиВЭкспрессах
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ НоменклатураСпр.ТребуетсяМаркировка
	|		КОНЕЦ) КАК ТребуетсяМаркировка, 
	//+Шульман А. 17.10.2025 #UT10-5472
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка И &ТекДата >= ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ДатаОкончанияМаркировкиОстатков, ДАТАВРЕМЯ(3000, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПревышенаДатаМаркировкиОстатков,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ТоварнаяГруппаЧестногоЗнака.Наименование, """") КАК ТоварнаяГруппа
	//-Шульман А. 17.10.2025 #UT10-5472
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО НоменклатураСпр.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = НоменклатураСпр.Ссылка,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е""),
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка И &ТекДата >= ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ТоварнаяГруппаЧестногоЗнака.ДатаОкончанияМаркировкиОстатков, ДАТАВРЕМЯ(3000, 1, 1))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество,
	|	НоменклатураСпр.Наименование,
	|	НоменклатураСпр.КодПроизводителя,
	|	ЕдиницыИзмерения.Код,
	|	ЕдиницыИзмерения.Наименование,
	|	НоменклатураСпр.Кратность,
	|	НоменклатураСпр.НормализованныйКод,
	|	ЕСТЬNULL(ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е""),
	|	ЛОЖЬ,   
	//+Шульман А. 17.10.2025 #UT10-5472
	|	Ложь,
	|	""""
	//-Шульман А. 17.10.2025 #UT10-5472
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ПО НоменклатураСпр.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ПО ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура = НоменклатураСпр.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &Ссылка";
	
	#Область Комментарий
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка КАК СсылкаПТУ,
	//|	ПоступлениеТоваровУслугТовары.Номенклатура КАК СсылкаТовара,
	//|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК КоличествоТовара,
	//|	МАКСИМУМ(НоменклатураСпр.Наименование) КАК НаименованиеТовара,
	//|	МАКСИМУМ(НоменклатураСпр.КодПроизводителя) КАК КодПроизводителяТовара,
	//|	МАКСИМУМ(ЕдиницыИзмерения.Код) КАК КодЕдиИзм,
	//|	МАКСИМУМ(ЕдиницыИзмерения.Наименование) КАК ЕдИзмНаименование,
	//|	МИНИМУМ(ПоступлениеТоваровУслугТовары.Номенклатура.Кратность) КАК Кратность,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураСпр.НормализованныйКод) КАК НормализованныйКод,
	//|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е"") КАК ГруппаАВСФилиала,
	//|	НоменклатураСпр.ТребуетсяМаркировка КАК ТребуетсяМаркировка
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	//|			ПО НоменклатураСпр.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	//|		ПО ПоступлениеТоваровУслугТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|ГДЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугТовары.Ссылка,
	//|	ПоступлениеТоваровУслугТовары.Номенклатура,
	//|	ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е""),
	//|	НоменклатураСпр.ТребуетсяМаркировка
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка,
	//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество,
	//|	НоменклатураСпр.Наименование,
	//|	НоменклатураСпр.КодПроизводителя,
	//|	ЕдиницыИзмерения.Код,
	//|	ЕдиницыИзмерения.Наименование,
	//|	НоменклатураСпр.Кратность,
	//|	НоменклатураСпр.НормализованныйКод,
	//|	ЕСТЬNULL(ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура.ГруппаАВСФилиала.Наименование, ""Е""),
	//|	ЛОЖЬ
	//|ИЗ
	//|	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	//|			ПО НоменклатураСпр.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	//|		ПО ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура = НоменклатураСпр.Ссылка
	//|ГДЕ
	//|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = &Ссылка";
	//-Кабанов А.В. 11.09.2025 # UT10-5419 
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Ссылка", ПТУСсылка);  
	//+Шульман А. 17.10.2025 #UT10-5472 
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	//-Шульман А. 17.10.2025 #UT10-5472
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	                    	МассивВременный = ТаблицуВМассив(ТЗ);

	//Возврат Сериализовать(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список товаров документа ПТУ", Строка(ПТУСсылка.Номер)); 	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокДокументовПТУ( ДокументСсылка = Неопределено, ДокументГУИД = Неопределено, UserGUID = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	//+Кабанов А.В. 11.09.2025 # UT10-5419
	"ВЫБРАТЬ
	|	Константы.НеПроверятьМаркировкиВЭкспрессах
	|ПОМЕСТИТЬ ВТ_Константа
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщика.Объект КАК Объект,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщика.Номенклатура) КАК КоличествоСтрокВБуфере
	|ПОМЕСТИТЬ ВТБуферПоСотруднику
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|ГДЕ
	|	БуферАрмКладовщика.UserId = &UserId
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАрмКладовщикаГМ.Объект КАК Объект,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщикаГМ.ГМ) КАК КоличествоСтрокВБуфереГМ
	|ПОМЕСТИТЬ ВТБуферПоСотрудникуГМ
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщикаГМ
	|ГДЕ
	|	БуферАрмКладовщикаГМ.UserId = &UserId
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаГМ.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БуферАрмКладовщика.Объект КАК Объект,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщика.Номенклатура) КАК КоличествоСтрокВБуфере
	|ПОМЕСТИТЬ ВТБуферПоВсемСотрудникам
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БуферАрмКладовщикаГМ.Объект КАК Объект,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщикаГМ.ГМ) КАК КоличествоСтрокВБуфереГМ
	|ПОМЕСТИТЬ ВТБуферПоВсемСотрудникамГМ
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаГМ КАК БуферАрмКладовщикаГМ
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаГМ.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БуферАрмКладовщика.Объект КАК Объект,
	|	БуферАрмКладовщика.Номенклатура КАК Номенклатура,
	|	СУММА(БуферАрмКладовщика.Quantity) КАК Quantity
	|ПОМЕСТИТЬ ВТБуферПоВсемСотрудникамСНоменклатурой
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщика КАК БуферАрмКладовщика
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщика.Объект,
	|	БуферАрмКладовщика.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТБуферПоВсемСотрудникам.Объект, ВТБуферПоСотруднику.Объект) КАК Объект,
	|	ЕСТЬNULL(ВТБуферПоВсемСотрудникам.КоличествоСтрокВБуфере, 0) КАК КоличествоСтрокВБуфереВсего,
	|	ЕСТЬNULL(ВТБуферПоСотруднику.КоличествоСтрокВБуфере, 0) КАК КоличествоСтрокВБуфереСотрудника,
	|	1 КАК ПараметрСортировкиБуфер
	|ПОМЕСТИТЬ ВТБуферИтог
	|ИЗ
	|	ВТБуферПоСотруднику КАК ВТБуферПоСотруднику
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТБуферПоВсемСотрудникам КАК ВТБуферПоВсемСотрудникам
	|		ПО ВТБуферПоСотруднику.Объект = ВТБуферПоВсемСотрудникам.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(ВТБуферПоВсемСотрудникамГМ.Объект, ВТБуферПоСотрудникуГМ.Объект) КАК Объект,
	|	1 КАК ПараметрСортировкиБуфер,
	|	ЕСТЬNULL(ВТБуферПоВсемСотрудникамГМ.КоличествоСтрокВБуфереГМ, 0) КАК КоличествоСтрокВБуфереВсегоГМ,
	|	ЕСТЬNULL(ВТБуферПоСотрудникуГМ.КоличествоСтрокВБуфереГМ, 0) КАК КоличествоСтрокВБуфереСотрудникаГМ
	|ПОМЕСТИТЬ ВТБуферИтогГМ
	|ИЗ
	|	ВТБуферПоСотрудникуГМ КАК ВТБуферПоСотрудникуГМ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТБуферПоВсемСотрудникамГМ КАК ВТБуферПоВсемСотрудникамГМ
	|		ПО ВТБуферПоСотрудникуГМ.Объект = ВТБуферПоВсемСотрудникамГМ.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	БуферАрмКладовщикаМаркировки.Объект,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАрмКладовщикаМаркировки.Barcode) КАК КоличествоМаркировок
	|ПОМЕСТИТЬ ВТБуферМаркировок
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|ГДЕ
	|	БуферАрмКладовщикаМаркировки.UserId = &UserId
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАрмКладовщикаМаркировки.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Ссылка КАК Документ,
	|	ВложенныйЗапрос.КоличествоСтрок КАК КоличествоСтрок,
	|	ВложенныйЗапрос.ПриемкаГМ,
	|	ВложенныйЗапрос.НоменклатураТребуетсяМаркировка КАК ТребуетсяМаркировка
	|ПОМЕСТИТЬ ВТСписокЗД
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК ОтсутствиеТовара,
	|		МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(Статусы.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ПоступилНаСклад)) КАК Перечисление.СтатусыПриемки)) КАК Статус,
	|		МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(КоличестваСтрок.Значение, ""(0)"") КАК СТРОКА(15))) КАК КоличествоСтрок,
	|		МАКСИМУМ(ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала, ЛОЖЬ)) КАК ПриемкаГМ,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ПоступлениеТоваровУслугТовары.Ссылка.Экспресс
	|						И ВТ_Константа.НеПроверятьМаркировкиВЭкспрессах
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка
	|			КОНЕЦ) КАК НоменклатураТребуетсяМаркировка
	|	ИЗ
	|		Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Статусы
	|			ПО ПоступлениеТоваровУслугТовары.Ссылка = Статусы.Объект
	|				И (Статусы.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК КоличестваСтрок
	|			ПО ПоступлениеТоваровУслугТовары.Ссылка = КоличестваСтрок.Объект
	|				И (КоличестваСтрок.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоСтрок)),
	|		ВТ_Константа КАК ВТ_Константа
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|		И НЕ ПоступлениеТоваровУслугТовары.Ссылка.НомерСкладскогоДокумента = &ПустаяСтрока
	|		И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугТовары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ),
	|		МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(Статусы.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.Обработка)) КАК Перечисление.СтатусыПриемки)),
	|		МАКСИМУМ(ВЫРАЗИТЬ(ЕСТЬNULL(КоличестваСтрок.Значение, ""(0)"") КАК СТРОКА(15))),
	|		МАКСИМУМ(ЛОЖЬ),
	|		МАКСИМУМ(ЛОЖЬ)
	|	ИЗ
	|		Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Статусы
	|			ПО ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = Статусы.Объект
	|				И (Статусы.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК КоличестваСтрок
	|			ПО ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка = КоличестваСтрок.Объект
	|				И (КоличестваСтрок.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.КоличествоСтрок))
	|	ГДЕ
	|		ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Проведен
	|		И ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Дата >= &Дата
	|		И НЕ ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.НомерСкладскогоДокумента = &ПустаяСтрока
	|		И НЕ ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.ВозвратПоставщикуБезРазбораВГП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.ОтсутствиеТовара = ЛОЖЬ
	//+Белов А. 01.06.2026 #UT10-5893
	|	И НЕ ВложенныйЗапрос.Статус в (&СтатусыНеДляПриемки)
	//|	И НЕ ВложенныйЗапрос.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.Завершено)
	//|	И НЕ ВложенныйЗапрос.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути)
	//-Белов А. 01.06.2026 #UT10-5893
	|	И ВЫБОР
	|			КОГДА &ВыбранныйДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	|					ИЛИ &ВыбранныйДокумент = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровНаОтветственноеХранение.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВложенныйЗапрос.Ссылка = &ВыбранныйДокумент
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование КАК Ссылка,
	|	РазмещениеПоЯчейкамТовары.Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеПоЯчейкамТовары.Номенклатура) КАК КоличествоВРазмещении,
	|	СУММА(РазмещениеПоЯчейкамТовары.Количество) КАК Количество,  
	//+Шульман А. 02.10.2025 #UT10-5438
	|	СУММА(ВЫБОР
	|			КОГДА РазмещениеПоЯчейкамТовары.Номенклатура.ТребуетсяМаркировка И РазмещениеПоЯчейкамТовары.Ячейка В(&ЯчейкаДляМаркировки)
	|				ТОГДА РазмещениеПоЯчейкамТовары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДляПеремаркировки
	//-Шульман А. 02.10.2025 #UT10-5438
	|ПОМЕСТИТЬ ВТРазмещениеИтог_1
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокЗД КАК ВТСписокЗД
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТСписокЗД.Документ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен = ИСТИНА
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И (РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|			ИЛИ РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование,
	|	РазмещениеПоЯчейкамТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование КАК Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РазмещениеПоЯчейкамТовары.ГМ) КАК КоличествоВРазмещенииГМ
	|ПОМЕСТИТЬ ВТРазмещениеИтог_1ГМ
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСписокЗД КАК ВТСписокЗД
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТСписокЗД.Документ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен = ИСТИНА
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И РазмещениеПоЯчейкамТовары.ГМ <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТРазмещениеИтог_1.Ссылка КАК Ссылка,
	|	МАКСИМУМ(2) КАК ПараметрСортировкиРазмещения,
	|	СУММА(ВТРазмещениеИтог_1.КоличествоВРазмещении) КАК КоличествоВРазмещении,    
	//+Шульман А. 02.10.2025 #UT10-5438
	|	СУММА(ВТРазмещениеИтог_1.КоличествоДляПеремаркировки) КАК КоличествоДляПеремаркировки
	//-Шульман А. 02.10.2025 #UT10-5438
	|ПОМЕСТИТЬ ВТРазмещениеИтог
	|ИЗ
	|	ВТРазмещениеИтог_1 КАК ВТРазмещениеИтог_1
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРазмещениеИтог_1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокЗД.Документ КАК Ссылка,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|	NULL КАК МаркируемыеТовары
	|ПОМЕСТИТЬ ВТНоменКолвоВПТУ
	|ИЗ
	|	ВТСписокЗД КАК ВТСписокЗД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТСписокЗД.Документ = ПоступлениеТоваровУслугТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСписокЗД.Документ,
	|	ПоступлениеТоваровУслугТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокЗД.Документ,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровНаОтветственноеХранениеТовары.Количество),
	|	СУММА(0)
	|ИЗ
	|	ВТСписокЗД КАК ВТСписокЗД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|		ПО ВТСписокЗД.Документ = ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСписокЗД.Документ,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТНоменКолвоВПТУ.Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНоменКолвоВПТУ.Номенклатура) КАК КоличествоНеРазмещеннныхСтрокНоменклатуры
	|ПОМЕСТИТЬ ВТСписокНеРазмещНомен
	|ИЗ
	|	ВТНоменКолвоВПТУ КАК ВТНоменКолвоВПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмещениеИтог_1 КАК ВТРазмещениеИтог_1
	|		ПО ВТНоменКолвоВПТУ.Ссылка = ВТРазмещениеИтог_1.Ссылка
	|			И ВТНоменКолвоВПТУ.Номенклатура = ВТРазмещениеИтог_1.Номенклатура
	|ГДЕ
	|	ВТНоменКолвоВПТУ.Количество > ЕСТЬNULL(ВТРазмещениеИтог_1.Количество, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменКолвоВПТУ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТНоменКолвоВПТУ.Ссылка,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНоменКолвоВПТУ.Номенклатура) КАК КоличествоОсталостьРазместитьСтрокНоменклатуры,
	|	СУММА(ВТНоменКолвоВПТУ.Количество - ЕСТЬNULL(ВТРазмещениеИтог_1.Количество, 0) + ЕСТЬNULL(ВТБуферПоВсемСотрудникамСНоменклатурой.Quantity, 0)) КАК КоличествоТовараОсталостьРазместить
	|ПОМЕСТИТЬ ВТСписокОсталосьРазмесНомен
	|ИЗ
	|	ВТНоменКолвоВПТУ КАК ВТНоменКолвоВПТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмещениеИтог_1 КАК ВТРазмещениеИтог_1
	|		ПО ВТНоменКолвоВПТУ.Ссылка = ВТРазмещениеИтог_1.Ссылка
	|			И ВТНоменКолвоВПТУ.Номенклатура = ВТРазмещениеИтог_1.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБуферПоВсемСотрудникамСНоменклатурой КАК ВТБуферПоВсемСотрудникамСНоменклатурой
	|		ПО ВТНоменКолвоВПТУ.Ссылка = ВТБуферПоВсемСотрудникамСНоменклатурой.Объект
	|			И ВТНоменКолвоВПТУ.Номенклатура = ВТБуферПоВсемСотрудникамСНоменклатурой.Номенклатура
	|ГДЕ
	|	ВТНоменКолвоВПТУ.Количество > ЕСТЬNULL(ВТРазмещениеИтог_1.Количество, 0) + ЕСТЬNULL(ВТБуферПоВсемСотрудникамСНоменклатурой.Quantity, 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТНоменКолвоВПТУ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокЗД.Документ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугТовары.Номенклатура) КАК КоличествоВПТУ,
	|	3 КАК ПараметрСортировкиДокумент,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент,
	|	МАКСИМУМ(ВТСписокЗД.ПриемкаГМ) КАК ПриемкаГМ,
	|	МАКСИМУМ(ЕСТЬNULL(ВЗ_СтрокиКодовМаркировки.СтрокКодовМаркировки, 0)) КАК СтрокКодовМаркировки,
	|	МАКСИМУМ(ЕСТЬNULL(ВЗ_СтрокиОтсканированноКодовСаркировки.СтрокОтсканированноКодовМаркировки, 0)) КАК СтрокОтсканированноКодовМаркировки,
	|	МАКСИМУМ(ВТСписокЗД.ТребуетсяМаркировка) КАК ТребуетсяМаркировка
	|ПОМЕСТИТЬ ВТСписокЗДИтог
	|ИЗ
	|	ВТСписокЗД КАК ВТСписокЗД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТСписокЗД.Документ = ПоступлениеТоваровУслугТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ПоступлениеТоваровУслугКодыМаркировки.НомерСтроки) КАК СтрокКодовМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.КодыМаркировки КАК ПоступлениеТоваровУслугКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТСписокЗД.Документ
	|					ИЗ
	|						ВТСписокЗД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугКодыМаркировки.Ссылка) КАК ВЗ_СтрокиКодовМаркировки
	|		ПО ВТСписокЗД.Документ = ВЗ_СтрокиКодовМаркировки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка КАК Ссылка,
	|			МАКСИМУМ(ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.НомерСтроки) КАК СтрокОтсканированноКодовМаркировки
	|		ИЗ
	|			Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|		ГДЕ
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТСписокЗД.Документ
	|					ИЗ
	|						ВТСписокЗД)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка) КАК ВЗ_СтрокиОтсканированноКодовСаркировки
	|		ПО ВТСписокЗД.Документ = ВЗ_СтрокиОтсканированноКодовСаркировки.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСписокЗД.Документ,
	|	ПоступлениеТоваровУслугТовары.Ссылка.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСписокЗД.Документ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровНаОтветственноеХранениеТовары.Номенклатура),
	|	""3"",
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Контрагент,
	|	МАКСИМУМ(ЛОЖЬ),
	|	МАКСИМУМ(0),
	|	МАКСИМУМ(0),
	|	МАКСИМУМ(ВТСписокЗД.ТребуетсяМаркировка)
	|ИЗ
	|	ВТСписокЗД КАК ВТСписокЗД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранениеТовары
	|		ПО ВТСписокЗД.Документ = ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСписокЗД.Документ,
	|	ПоступлениеТоваровНаОтветственноеХранениеТовары.Ссылка.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПоступлениеТоваровУслугТовары.ГМ) КАК КоличествоГМ,
	|	ВТСписокЗД.Документ
	|ПОМЕСТИТЬ ВТГМВПоступлении
	|ИЗ
	|	ВТСписокЗД КАК ВТСписокЗД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТСписокЗД.Документ = ПоступлениеТоваровУслугТовары.Ссылка
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.ГМ <> """"
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТСписокЗД.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеТоваровУслугТовары.Номенклатура.ТребуетсяМаркировка
	|					И НЕ(ПоступлениеТоваровУслугТовары.Ссылка.Экспресс
	|							И ВТ_Константа.НеПроверятьМаркировкиВЭкспрессах)
	|				ТОГДА ПоступлениеТоваровУслугТовары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоТоваровСМаркировкой
	|ПОМЕСТИТЬ ВТ_МаркируемыеТовары
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары,
	|	ВТ_Константа КАК ВТ_Константа
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТСписокЗД.Документ
	|			ИЗ
	|				ВТСписокЗД)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокЗДИтог.Документ КАК Ссылка,
	|	ВТСписокЗДИтог.КоличествоВПТУ,
	|	ВТСписокЗДИтог.ПараметрСортировкиДокумент,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТСписокЗДИтог.ПриемкаГМ, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ВТРазмещениеИтогГМ.КоличествоВРазмещенииГМ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТРазмещениеИтог.КоличествоВРазмещении, 0)
	|	КОНЕЦ КАК КоличествоВРазмещении,
	|	ЕСТЬNULL(ВТРазмещениеИтог.ПараметрСортировкиРазмещения, 2) КАК ПараметрСортировкиРазмещения,
	|	ЕСТЬNULL(ВТБуферИтог.ПараметрСортировкиБуфер, 1) КАК ПараметрСортировкиБуфер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТСписокЗДИтог.ПриемкаГМ, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ВТБуферИтогГМ.КоличествоСтрокВБуфереВсегоГМ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТБуферИтог.КоличествоСтрокВБуфереВсего, 0)
	|	КОНЕЦ КАК КоличествоСтрокВБуфереВсего,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТСписокЗДИтог.ПриемкаГМ, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ВТБуферИтогГМ.КоличествоСтрокВБуфереСотрудникаГМ, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТБуферИтог.КоличествоСтрокВБуфереСотрудника, 0)
	|	КОНЕЦ КАК КоличествоСтрокВБуфереСотрудника,
	|	ВТСписокЗДИтог.Документ.Номер КАК НомерДокумента,
	|	ВТСписокЗДИтог.Документ.Дата КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТСписокЗДИтог.ПриемкаГМ, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ВТБуферИтогГМ.КоличествоСтрокВБуфереСотрудникаГМ, 0) > 0
	|		ИНАЧЕ ЕСТЬNULL(ВТБуферИтог.КоличествоСтрокВБуфереСотрудника, 0) > 0
	|	КОНЕЦ КАК ЕстьСтрокиВБуфереКладовщика,
	|	ВТСписокЗДИтог.Документ.НомерСкладскогоДокумента КАК НомерСкладскогоДокумента,
	|	ЕСТЬNULL(ВТСписокНеРазмещНомен.КоличествоНеРазмещеннныхСтрокНоменклатуры, 0) КАК КоличествоНеРазмещеннныхСтрокНоменклатуры,
	|	ЕСТЬNULL(ВТСписокОсталосьРазмесНомен.КоличествоОсталостьРазместитьСтрокНоменклатуры, 0) КАК КоличествоОсталостьРазместитьСтрокНоменклатуры,
	|	ЕСТЬNULL(ВТСписокОсталосьРазмесНомен.КоличествоТовараОсталостьРазместить, 0) КАК КоличествоТовараОсталостьРазместить,
	|	ЕСТЬNULL(ВТСписокЗДИтог.ПриемкаГМ, ЛОЖЬ) КАК ПриемкаГМ,
	|	ЕСТЬNULL(ВТГМВПоступлении.КоличествоГМ, 0) - ЕСТЬNULL(ВТРазмещениеИтогГМ.КоличествоВРазмещенииГМ, 0) КАК КоличествоОсталостьРазместитьСтрокГМ,
	|	ЕСТЬNULL(ВТСписокЗДИтог.Контрагент.Наименование, """") КАК Контрагент,
	|	ЕСТЬNULL(ВТБуферМаркировок.КоличествоМаркировок, 0) > 0 КАК ЕстьСтрокиВБуфереМаркировок,
	|	ЕСТЬNULL(ВТБуферМаркировок.КоличествоМаркировок, 0) КАК КоличествоСтрокВБуфереМаркировок,
	|	ЕСТЬNULL(ВТСписокЗДИтог.СтрокКодовМаркировки, 0) КАК КоличествоОжидаемыхМаркировок,
	|	ЕСТЬNULL(ВТСписокЗДИтог.СтрокОтсканированноКодовМаркировки, 0)    
	//+Шульман А. 02.10.2025 #UT10-5438
	|        + ЕСТЬNULL(ВТРазмещениеИтог.КоличествоДляПеремаркировки, 0)  
	//-Шульман А. 02.10.2025 #UT10-5438
	|   КАК КоличествоОтсканированныхМаркировок,         
	//+Шульман А. 13.11.2025 #UT10-5504    
	|  &ПроверятьСостояниеКодаВЧЗ,  
	|  ВЫБОР КОГДА ВТСписокЗДИтог.Контрагент = &ОсновнойПоставщик ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ПоставкаОтВнешнегоПоставщика,
	//-Шульман А. 13.11.2025 #UT10-5504
	|	ЕСТЬNULL(ВТ_МаркируемыеТовары.КоличествоТоваровСМаркировкой, 0) КАК КоличествоТоваровСМаркировкой,
	|	ВТСписокЗДИтог.ТребуетсяМаркировка КАК ДокументТребуетсяМаркировка
	|ИЗ
	|	ВТСписокЗДИтог КАК ВТСписокЗДИтог
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмещениеИтог КАК ВТРазмещениеИтог
	|		ПО ВТСписокЗДИтог.Документ = ВТРазмещениеИтог.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБуферИтог КАК ВТБуферИтог
	|		ПО ВТСписокЗДИтог.Документ = ВТБуферИтог.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокНеРазмещНомен КАК ВТСписокНеРазмещНомен
	|		ПО ВТСписокЗДИтог.Документ = ВТСписокНеРазмещНомен.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСписокОсталосьРазмесНомен КАК ВТСписокОсталосьРазмесНомен
	|		ПО ВТСписокЗДИтог.Документ = ВТСписокОсталосьРазмесНомен.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГМВПоступлении КАК ВТГМВПоступлении
	|		ПО ВТСписокЗДИтог.Документ = ВТГМВПоступлении.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБуферИтогГМ КАК ВТБуферИтогГМ
	|		ПО ВТСписокЗДИтог.Документ = ВТБуферИтогГМ.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмещениеИтог_1ГМ КАК ВТРазмещениеИтогГМ
	|		ПО ВТСписокЗДИтог.Документ = ВТРазмещениеИтогГМ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБуферМаркировок КАК ВТБуферМаркировок
	|		ПО ВТСписокЗДИтог.Документ = ВТБуферМаркировок.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаркируемыеТовары КАК ВТ_МаркируемыеТовары
	|		ПО ВТСписокЗДИтог.Документ = ВТ_МаркируемыеТовары.Ссылка
	|ГДЕ
	|	(НЕ ЕСТЬNULL(ВТСписокНеРазмещНомен.КоличествоНеРазмещеннныхСтрокНоменклатуры, 0) = 0
	|			ИЛИ НЕ ЕСТЬNULL(ВТСписокОсталосьРазмесНомен.КоличествоОсталостьРазместитьСтрокНоменклатуры, 0) = 0
	|			ИЛИ НЕ ЕСТЬNULL(ВТСписокОсталосьРазмесНомен.КоличествоТовараОсталостьРазместить, 0) = 0
	|			ИЛИ НЕ ЕСТЬNULL(ВТГМВПоступлении.КоличествоГМ, 0) - ЕСТЬNULL(ВТРазмещениеИтогГМ.КоличествоВРазмещенииГМ, 0) = 0)";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * 24 * 90);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");       
	//+Шульман А. 14.10.2025 #UT10-5438
	//+Шульман А. 13.11.2025 #UT10-5504 
	//Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", Константы.ЯчейкаДляМаркировки.Получить());
	МассивЯчейкаДляМаркировки = Новый Массив;
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляМаркировки.Получить());  
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляПеремаркировки.Получить());
	МассивЯчейкаДляМаркировки.Добавить(Константы.ЯчейкаДляВозвратаПоставщику.Получить());
	Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", МассивЯчейкаДляМаркировки);
	//-Шульман А. 14.10.2025 #UT10-5438     
	//+Шульман А. 13.11.2025 #UT10-5504    
	Запрос.УстановитьПараметр("ПроверятьСостояниеКодаВЧЗ", Константы.ПроверятьСостояниеКодаВЧЗ.Получить());  
	Запрос.УстановитьПараметр("ОсновнойПоставщик", Константы.ОсновнойПоставщик.Получить()); 
	//-Шульман А. 13.11.2025 #UT10-5504 
	
	//+Белов А. 01.06.2026 #UT10-5893
	СтатусыНеДляПриемки = Новый Массив;
	СтатусыНеДляПриемки.Добавить(Перечисления.СтатусыПриемки.ВПути);
	СтатусыНеДляПриемки.Добавить(Перечисления.СтатусыПриемки.Завершено);
	СтатусыНеДляПриемки.Добавить(Перечисления.СтатусыПриемки.НеНайденВЭДО);
	СтатусыНеДляПриемки.Добавить(Перечисления.СтатусыПриемки.НаПроверкеВЧЗ); 
	СтатусыНеДляПриемки.Добавить(Перечисления.СтатусыПриемки.ОшибкаПроверкиЧЗ);
	
	Запрос.УстановитьПараметр("СтатусыНеДляПриемки", СтатусыНеДляПриемки); 
	//-Белов А. 01.06.2026 #UT10-5893
	
	Если ЗначениеЗаполнено(UserGUID) Тогда
		UserСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserGUID));
	Иначе 
		UserСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("UserId", UserСсылка);           
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		Запрос.УстановитьПараметр("ВыбранныйДокумент", ДокументСсылка);
	ИначеЕсли ЗначениеЗаполнено(ДокументГУИД) Тогда

		ДокументСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ДокументГУИД));
		
		Если ДокументСсылка.ПолучитьОбъект() = Неопределено Тогда
			ДокументСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ДокументГУИД));			
		КонецЕсли;		
		
		Запрос.УстановитьПараметр("ВыбранныйДокумент", ДокументСсылка);
		
	Иначе 
		Запрос.УстановитьПараметр("ВыбранныйДокумент", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserСсылка, ТекущаяДата(), "", "Получить список документов ПТУ", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокДокументовПТУ_ЧЗ() Экспорт
//+Белов А. 05.06.2026 #UT10-5895
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК СсылкаПТУ,
	|	ЕСТЬNULL(ДокументыЭДОТребующиеОбработки.ТекстОшибкиЧЗ, """") КАК ТекстОшибкиЧЗ,
	|	ПРЕДСТАВЛЕНИЕ(ЗначенияСвойствОбъектов.Значение) КАК Статус,
	|	ПоступлениеТоваровУслуг.Контрагент.Наименование КАК Контрагент,
	|	ПоступлениеТоваровУслуг.Номер,
	|	ПоступлениеТоваровУслуг.Дата,
	|	ПоступлениеТоваровУслуг.НомерСкладскогоДокумента
	|ПОМЕСТИТЬ ВТ_Поступления
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &СтатусПриемки)
	|			И (ЗначенияСвойствОбъектов.Значение В (&ЗначенияСтатусовОтправки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
	|		ПО (ДокументыЭДОТребующиеОбработки.Документ = ПоступлениеТоваровУслуг.Ссылка)
	|ГДЕ
	|	ПоступлениеТоваровУслуг.Дата > &Дата
	|	И ПоступлениеТоваровУслуг.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.НомерСтроки) КАК КоличествоСтрок,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|ПОМЕСТИТЬ ВТ_КоличествоСтрок
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ВТ_Поступления.СсылкаПТУ = ПоступлениеТоваровУслугТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Поступления.СсылкаПТУ,
	|	ВТ_Поступления.ТекстОшибкиЧЗ,
	|	ВТ_Поступления.Статус,
	|	ВТ_Поступления.Контрагент,
	|	ВТ_Поступления.Номер КАК НомерДокумента,
	|	ВТ_Поступления.Дата КАК ДатаДокумента,
	|	ВТ_Поступления.НомерСкладскогоДокумента,
	|	ВТ_КоличествоСтрок.КоличествоСтрок КАК ВсегоСтрокСТР,
	|	ЛОЖЬ КАК ПриемкаГМ,
	|	ИСТИНА КАК ДокументТребуетсяМаркировка
	|ИЗ
	|	ВТ_Поступления КАК ВТ_Поступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоСтрок КАК ВТ_КоличествоСтрок
	|		ПО ВТ_Поступления.СсылкаПТУ = ВТ_КоличествоСтрок.Ссылка";
	
	Запрос.УстановитьПараметр("СтатусПриемки", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
	
	ЗначенияСтатусовОтправки = Новый Массив;
	ЗначенияСтатусовОтправки.Добавить(Перечисления.СтатусыПриемки.НаПроверкеВЧЗ);
	ЗначенияСтатусовОтправки.Добавить(Перечисления.СтатусыПриемки.НеНайденВЭДО);
	ЗначенияСтатусовОтправки.Добавить(Перечисления.СтатусыПриемки.ОшибкаПроверкиЧЗ);
	
	Запрос.УстановитьПараметр("ЗначенияСтатусовОтправки", ЗначенияСтатусовОтправки);
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * 24 * 90);
			
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
		
	Возврат Результат;

//-Белов А. 05.06.2026 #UT10-5895	
КонецФункции



Функция ПолучитьСписокНепроведенныхДокументовПТУ(ДокументСсылка = Неопределено, ДокументГУИД = Неопределено, UserGUID = Неопределено, Transit = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	//+Кабанов А.В. 23.06.2025 # UT10-5295
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЗаказПоставщику) КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ВТ_ТаблицаЗаказовПоставщику
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = СвойствоВПути.Объект
	|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	|ГДЕ
	|	(НЕ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|			ИЛИ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.НомерСкладскогоДокумента = """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	|	И ВЫБОР
	|			КОГДА &ВключатьТранзит
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ПоступлениеТоваровУслугТовары.Ссылка.ТранзитнаяПоставка
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка,
	|	МАКСИМУМ(НЕ ПоступлениеТоваровУслугТовары.ГМ = """") КАК ПриемкаГМ
	|ПОМЕСТИТЬ ВТ_ТаблицаПриемкаПоГМ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	|		ПО ПоступлениеТоваровУслугТовары.Ссылка = СвойствоВПути.Объект
	|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	|ГДЕ
	|	НЕ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|	И НЕ СвойствоВПути.Значение ЕСТЬ NULL
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления
	|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.НомерСкладскогоДокумента = """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	|	И ВЫБОР
	|			КОГДА &ВключатьТранзит
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ПоступлениеТоваровУслугТовары.Ссылка.ТранзитнаяПоставка
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗаказовПоставщику.Ссылка,
	|	ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.Наименование КАК НаименовниеСклада
	|ПОМЕСТИТЬ ВТ_ТаблицаСкладовПоПТУ
	|ИЗ
	|	ВТ_ТаблицаЗаказовПоставщику КАК ВТ_ТаблицаЗаказовПоставщику
	|ГДЕ
	|	НЕ ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.Ссылка ЕСТЬ NULL
	|	И ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка КАК СсылкаПТУ,
	|	ПоступлениеТоваровУслуг.Экспресс,
	|	ПоступлениеТоваровУслуг.Контрагент.Наименование КАК Контрагент,
	|	0 КАК КоличествоСтрок,
	|	ПоступлениеТоваровУслуг.Номер КАК НомерДокумента,
	|	ПоступлениеТоваровУслуг.Дата КАК ДатаДокумента,
	|	ПоступлениеТоваровУслуг.НомерСкладскогоДокумента,
	|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента,
	|	ЕСТЬNULL(ВТ_ТаблицаСкладовПоПТУ.НаименовниеСклада, """") КАК НаименованиеСклада,
	|	ЛОЖЬ КАК ТОХ,
	|	ЕСТЬNULL(ВТ_ТаблицаПриемкаПоГМ.ПриемкаГМ, ЛОЖЬ) КАК ПриемкаГМ,
	|	ПоступлениеТоваровУслуг.ТранзитнаяПоставка КАК Транзит
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаСкладовПоПТУ КАК ВТ_ТаблицаСкладовПоПТУ
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ВТ_ТаблицаСкладовПоПТУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаПриемкаПоГМ КАК ВТ_ТаблицаПриемкаПоГМ
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ВТ_ТаблицаПриемкаПоГМ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	|		ПО ПоступлениеТоваровУслуг.Ссылка = СвойствоВПути.Объект
	|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	|ГДЕ
	|	(НЕ ПоступлениеТоваровУслуг.Проведен
	|			ИЛИ ПоступлениеТоваровУслуг.Проведен
	|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
	|	И НЕ ПоступлениеТоваровУслуг.НомерСкладскогоДокумента = """"
	|	И ПоступлениеТоваровУслуг.Дата >= &Дата
	|	И ВЫБОР
	|			КОГДА &ВключатьТранзит
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ ПоступлениеТоваровУслуг.ТранзитнаяПоставка
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка,
	|	ЛОЖЬ,
	|	ПоступлениеТоваровНаОтветственноеХранение.Контрагент.Наименование,
	|	0,
	|	ПоступлениеТоваровНаОтветственноеХранение.Номер,
	|	ПоступлениеТоваровНаОтветственноеХранение.Дата,
	|	ПоступлениеТоваровНаОтветственноеХранение.НомерСкладскогоДокумента,
	|	ПоступлениеТоваровНаОтветственноеХранение.ДатаВходящегоДокумента,
	|	"""",
	|	ИСТИНА,
	|	ЛОЖЬ,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	|		ПО ПоступлениеТоваровНаОтветственноеХранение.Ссылка = СвойствоВПути.Объект
	|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	|ГДЕ
	|	(НЕ ПоступлениеТоваровНаОтветственноеХранение.Проведен
	|			ИЛИ ПоступлениеТоваровНаОтветственноеХранение.Проведен
	|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	|	И НЕ ПоступлениеТоваровНаОтветственноеХранение.ПометкаУдаления
	|	И НЕ ПоступлениеТоваровНаОтветственноеХранение.НомерСкладскогоДокумента = """"
	|	И ПоступлениеТоваровНаОтветственноеХранение.Дата >= &Дата
	|	И ПоступлениеТоваровНаОтветственноеХранение.ГрузополучательТОХ = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И НЕ ПоступлениеТоваровНаОтветственноеХранение.ВозвратПоставщикуБезРазбораВГП";

	//+Кабанов А.В. 10.12.2024 # UT10-4950	
	//"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка,
	//|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЗаказПоставщику) КАК ЗаказПоставщику
	//|ПОМЕСТИТЬ ВТ_ТаблицаЗаказовПоставщику
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	//|		ПО ПоступлениеТоваровУслугТовары.Ссылка = СвойствоВПути.Объект
	//|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	//|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	//|ГДЕ
	//|	(НЕ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|			ИЛИ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	//|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления
	//|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.НомерСкладскогоДокумента = """"
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	//|	И ВЫБОР
	//|			КОГДА &ВключатьТранзит
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ НЕ ПоступлениеТоваровУслугТовары.Ссылка.ТранзитнаяПоставка
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугТовары.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровУслугТовары.Ссылка,
	//|	МАКСИМУМ(НЕ ПоступлениеТоваровУслугТовары.ГМ = """") КАК ПриемкаГМ
	//|ПОМЕСТИТЬ ВТ_ТаблицаПриемкаПоГМ
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	//|		ПО ПоступлениеТоваровУслугТовары.Ссылка = СвойствоВПути.Объект
	//|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	//|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	//|ГДЕ
	//|	НЕ ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	//|	И НЕ СвойствоВПути.Значение ЕСТЬ NULL
	//|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления
	//|	И НЕ ПоступлениеТоваровУслугТовары.Ссылка.НомерСкладскогоДокумента = """"
	//|	И ПоступлениеТоваровУслугТовары.Ссылка.Дата >= &Дата
	//|	И ВЫБОР
	//|			КОГДА &ВключатьТранзит
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ НЕ ПоступлениеТоваровУслугТовары.Ссылка.ТранзитнаяПоставка
	//|		КОНЕЦ
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПоступлениеТоваровУслугТовары.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_ТаблицаЗаказовПоставщику.Ссылка,
	//|	ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.Наименование КАК НаименовниеСклада
	//|ПОМЕСТИТЬ ВТ_ТаблицаСкладовПоПТУ
	//|ИЗ
	//|	ВТ_ТаблицаЗаказовПоставщику КАК ВТ_ТаблицаЗаказовПоставщику
	//|ГДЕ
	//|	НЕ ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.Ссылка ЕСТЬ NULL
	//|	И ВТ_ТаблицаЗаказовПоставщику.ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПоступлениеТоваровУслуг.Ссылка КАК СсылкаПТУ,
	//|	ПоступлениеТоваровУслуг.Экспресс,
	//|	ПоступлениеТоваровУслуг.Контрагент.Наименование КАК Контрагент,
	//|	0 КАК КоличествоСтрок,
	//|	ПоступлениеТоваровУслуг.Номер КАК НомерДокумента,
	//|	ПоступлениеТоваровУслуг.Дата КАК ДатаДокумента,
	//|	ПоступлениеТоваровУслуг.НомерСкладскогоДокумента,
	//|	ПоступлениеТоваровУслуг.ДатаВходящегоДокумента,
	//|	ЕСТЬNULL(ВТ_ТаблицаСкладовПоПТУ.НаименовниеСклада, """") КАК НаименованиеСклада,
	//|	ЛОЖЬ КАК ТОХ,
	//|	ЕСТЬNULL(ВТ_ТаблицаПриемкаПоГМ.ПриемкаГМ, ЛОЖЬ) КАК ПриемкаГМ,
	//|	ПоступлениеТоваровУслуг.ТранзитнаяПоставка КАК Транзит
	//|ИЗ
	//|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаСкладовПоПТУ КАК ВТ_ТаблицаСкладовПоПТУ
	//|		ПО ПоступлениеТоваровУслуг.Ссылка = ВТ_ТаблицаСкладовПоПТУ.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаПриемкаПоГМ КАК ВТ_ТаблицаПриемкаПоГМ
	//|		ПО ПоступлениеТоваровУслуг.Ссылка = ВТ_ТаблицаПриемкаПоГМ.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	//|		ПО ПоступлениеТоваровУслуг.Ссылка = СвойствоВПути.Объект
	//|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	//|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	//|ГДЕ
	//|	(НЕ ПоступлениеТоваровУслуг.Проведен
	//|			ИЛИ ПоступлениеТоваровУслуг.Проведен
	//|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	//|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления
	//|	И НЕ ПоступлениеТоваровУслуг.НомерСкладскогоДокумента = """"
	//|	И ПоступлениеТоваровУслуг.Дата >= &Дата
	//|	И ВЫБОР
	//|			КОГДА &ВключатьТранзит
	//|				ТОГДА ИСТИНА
	//|			ИНАЧЕ НЕ ПоступлениеТоваровУслуг.ТранзитнаяПоставка
	//|		КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка,
	//|	ЛОЖЬ,
	//|	ПоступлениеТоваровНаОтветственноеХранение.Контрагент.Наименование,
	//|	0,
	//|	ПоступлениеТоваровНаОтветственноеХранение.Номер,
	//|	ПоступлениеТоваровНаОтветственноеХранение.Дата,
	//|	ПоступлениеТоваровНаОтветственноеХранение.НомерСкладскогоДокумента,
	//|	ПоступлениеТоваровНаОтветственноеХранение.ДатаВходящегоДокумента,
	//|	"""",
	//|	ИСТИНА,
	//|	ЛОЖЬ,
	//|	ЛОЖЬ
	//|ИЗ
	//|	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоВПути
	//|		ПО ПоступлениеТоваровНаОтветственноеХранение.Ссылка = СвойствоВПути.Объект
	//|			И (СвойствоВПути.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
	//|			И (СвойствоВПути.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
	//|ГДЕ
	//|	(НЕ ПоступлениеТоваровНаОтветственноеХранение.Проведен
	//|			ИЛИ ПоступлениеТоваровНаОтветственноеХранение.Проведен
	//|				И НЕ СвойствоВПути.Значение ЕСТЬ NULL)
	//|	И НЕ ПоступлениеТоваровНаОтветственноеХранение.ПометкаУдаления
	//|	И НЕ ПоступлениеТоваровНаОтветственноеХранение.НомерСкладскогоДокумента = """"
	//|	И ПоступлениеТоваровНаОтветственноеХранение.Дата >= &Дата
	//|	И ПоступлениеТоваровНаОтветственноеХранение.ГрузополучательТОХ = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	//-Кабанов А.В. 23.06.2025 # UT10-5295
	Запрос.УстановитьПараметр("ВключатьТранзит" , Transit);
	//+Кабанов А.В. 10.12.2024 # UT10-4950
	
	Запрос.УстановитьПараметр("Дата"    , НачалоДня(ДобавитьМесяц(ТекущаяДата(),-1)));
	
	УстановитьПривилегированныйРежим(Истина); 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТЗ Цикл
		Строка.КоличествоСтрок = Строка.СсылкаПТУ.Товары.Количество();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Если ЗначениеЗаполнено(UserGUID) Тогда  
		UserСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserGUID));
	Иначе 
		UserСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();  
	КонецЕсли;
	
	ЗаписатьЛог(UserСсылка, ТекущаяДата(), "", "Получить список непроведенных документов ПТУ", "");
	
	Возврат Результат;

КонецФункции

Функция ПолучитьСписокТранспортныхЕдиниц(DocumentGUID = Неопределено, UserGUID = Неопределено) Экспорт
	
	//+Сёмин Р. 19.12.2025 #UT10-5593
	УстановитьПривилегированныйРежим(Истина);
	
	СтатусыПриемки = Новый Массив;
	СтатусыПриемки.Добавить(Перечисления.СтатусыПриемки.ВПути);
	СтатусыПриемки.Добавить(Перечисления.СтатусыПриемки.ПоступилНаСклад);
	СтатусыПриемки.Добавить(Перечисления.СтатусыПриемки.Обработка);
	СтатусыПриемки.Добавить(Перечисления.СтатусыПриемки.ОбратитеВнимание);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка)) КАК СсылкаПТУ,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Дата КАК ДатаДокумента,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Номер КАК НомерДокумента,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.НомерWMS КАК ТранспортнаяЕдиница,
		|	ПРЕДСТАВЛЕНИЕ(ЗначенияСвойствОбъектов.Значение) КАК СтатусПриемки,
		|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка) КАК Документ,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.НомерСкладскогоДокумента,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Контрагент.Наименование КАК Контрагент,
		|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.ДатаВходящегоДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.УпаковочныеЛисты КАК ПоступлениеТоваровУслугУпаковочныеЛисты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|		ПО ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка = ЗначенияСвойствОбъектов.Объект
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Значение В(&СтатусыПриемки)
		|	И НЕ ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.ПометкаУдаления
		|	И ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Дата >= &Дата";
	
	Запрос.УстановитьПараметр("СтатусыПриемки", СтатусыПриемки);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1)));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(РезультатЗапроса);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Если ЗначениеЗаполнено(UserGUID) Тогда  
		UserСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserGUID));
	Иначе 
		UserСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();  
	КонецЕсли;
	
	ЗаписатьЛог(UserСсылка, ТекущаяДата(), "", "Получить список транспортных единиц", "");
	
	Возврат Результат;
	//-Сёмин Р. 19.12.2025 #UT10-5593
	
КонецФункции

Функция ПолучитьСтатусЭДОПТУ(DocumentGUID, UserGUID) Экспорт
	
	//+Сёмин Р.И. 08.06.2026 #UT10-5901
	ПТУ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	СтатусЭДОПТУ = МСКWEB.ЗначениеДопСвойства(ПТУ, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПодтвержденияЭДОПТУ);
	
	Если НЕ ЗначениеЗаполнено(СтатусЭДОПТУ) Тогда
		СтатусЭДОПТУ = "";
	КонецЕсли;
	
	UserIdСсылка = ПолучитьПользователя(UserGUID);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить статус ЭДО ПТУ", Строка(ПТУ.Номер)); 	
	
	Возврат ДанныеВJSONХранилище(Строка(СтатусЭДОПТУ));
	//-Сёмин Р.И. 08.06.2026 #UT10-5901
	
КонецФункции

Функция ПТУСодержитКодыМаркировкиСНарушеннымСроком(DocumentGUID, UserGUID) Экспорт
	
	//+Сёмин Р.И. 24.06.2026 #UT10-5915
	ПТУ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	НарушенныеКодыМаркировки = ПТУ.КодыМаркировки.НайтиСтроки(Новый Структура("СрокНарушен", Истина));
	
	Результат = НарушенныеКодыМаркировки.Количество() > 0;
	
	UserIdСсылка = ПолучитьПользователя(UserGUID);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "ПТУ содержит коды маркировки с нарушенным мроком", Строка(ПТУ.Номер)); 	
	
	Возврат ДанныеВJSONХранилище(Результат);
	//-Сёмин Р.И. 24.06.2026 #UT10-5915
	
КонецФункции

Функция ПолучитьСписокВходящихСлужебныхЗаписок(ДокументСсылка = Неопределено, ДокументГУИД = Неопределено, UserGUID = Неопределено) Экспорт  

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СлужебнаяЗаписка.Ссылка КАК СсылкаСлужебнаяЗаписка,
	|	СлужебнаяЗаписка.Дата КАК ДатаДокумента,
	|	СлужебнаяЗаписка.Номер КАК НомерДокумента,
	|	СлужебнаяЗаписка.НомерИнвойс ,
	|	СлужебнаяЗаписка.Получатель.Наименование КАК Контрагент,
	|	0 КАК КоличествоГрузомест
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|ГДЕ
	|	СлужебнаяЗаписка.Проведен
	|	И СлужебнаяЗаписка.Входящая
	|	И НЕ СлужебнаяЗаписка.Погружено";
	
	Запрос.УстановитьПараметр("Дата" , НачалоДня(ДобавитьМесяц(ТекущаяДата(), -1)));
	
	УстановитьПривилегированныйРежим(Истина); 
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из ТЗ Цикл
		Строка.КоличествоГрузомест = Строка.СсылкаСлужебнаяЗаписка.ТранспортныеЕдиницы.Количество();
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Если ЗначениеЗаполнено(UserGUID) Тогда  
		UserСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку( Новый УникальныйИдентификатор(UserGUID));
	Иначе 
		UserСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();  
	КонецЕсли;
	
	ЗаписатьЛог(UserСсылка, ТекущаяДата(), "", "Получить список входящих служебных записок", "");
	
	Возврат Результат;

КонецФункции

Функция ПолучитьСписокОбъединений(UserGUID, UnionGUID, Завершенные = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМКладовщикаОбъединениеТЕ.Объединение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто) КАК КоличествоГМ
	|ПОМЕСТИТЬ ВТ_БуферПоКомплектовщику
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаОбъединениеТЕ КАК БуферАРМКладовщикаОбъединениеТЕ
	|ГДЕ
	|	БуферАРМКладовщикаОбъединениеТЕ.UserId = &Комплектовщик
	|	И (&БезОтбораПоДокументу
	|			ИЛИ БуферАРМКладовщикаОбъединениеТЕ.Объединение = &Объединение)
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовщикаОбъединениеТЕ.Объединение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъединениеГМВТЕ.Ссылка КАК СсылкаОбъединение,
	|	ОбъединениеГМВТЕ.Грузополучатель.Наименование КАК Контрагент,
	|	ОбъединениеГМВТЕ.Номер КАК НомерДокумента,
	|	ОбъединениеГМВТЕ.Дата КАК ДатаДокумента,
	|	ПРЕДСТАВЛЕНИЕ(ОбъединениеГМВТЕ.Статус) КАК Статус,
	|	ЕСТЬNULL(ВТ_БуферПоКомплектовщику.КоличествоГМ, 0) КАК КоличествоГрузоместВБуфере
	|ПОМЕСТИТЬ ВТ_Объединения
	|ИЗ
	|	Документ.ОбъединениеГМВТЕ КАК ОбъединениеГМВТЕ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БуферПоКомплектовщику КАК ВТ_БуферПоКомплектовщику
	|		ПО ОбъединениеГМВТЕ.Ссылка = ВТ_БуферПоКомплектовщику.Объединение
	|ГДЕ
	|	ОбъединениеГМВТЕ.Проведен
	|	И ВЫБОР
	|			КОГДА &Завершенные
	|				ТОГДА ОбъединениеГМВТЕ.Комплектовщик = &Комплектовщик
	|						И ОбъединениеГМВТЕ.Статус В (&СписокЗавершенныхСтатусов)
	|			ИНАЧЕ ОбъединениеГМВТЕ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъединений.Создано)
	|					ИЛИ ОбъединениеГМВТЕ.Комплектовщик = &Комплектовщик
	|						И ОбъединениеГМВТЕ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъединений.ВПроцессеОбъединения)
	|		КОНЕЦ
	|	И (&БезОтбораПоДокументу
	|			ИЛИ ОбъединениеГМВТЕ.Ссылка = &Объединение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто) КАК КоличествоГМ,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница = ЗНАЧЕНИЕ(Документ.ТранспортнаяЕдиница.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоГМОбъединено,
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка КАК Объединение
	|ПОМЕСТИТЬ ВТ_КоличествоПоОбъединениям
	|ИЗ
	|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Объединения.СсылкаОбъединение,
	|	ВТ_Объединения.Контрагент,
	|	ВТ_Объединения.НомерДокумента,
	|	ВТ_Объединения.ДатаДокумента,
	|	ВТ_Объединения.Статус,
	|	ВТ_Объединения.КоличествоГрузоместВБуфере,
	|	ВТ_КоличествоПоОбъединениям.КоличествоГМ КАК КоличествоГрузомест,
	|	ВТ_КоличествоПоОбъединениям.КоличествоГМ - ВТ_КоличествоПоОбъединениям.КоличествоГМОбъединено - ВТ_Объединения.КоличествоГрузоместВБуфере КАК НеОбъединено,
	|	ВТ_Объединения.СсылкаОбъединение.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТ_Объединения КАК ВТ_Объединения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КоличествоПоОбъединениям КАК ВТ_КоличествоПоОбъединениям
	|		ПО ВТ_Объединения.СсылкаОбъединение = ВТ_КоличествоПоОбъединениям.Объединение";

	UserСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserGUID));
	
	Запрос.УстановитьПараметр("Комплектовщик", UserСсылка); 
	Запрос.УстановитьПараметр("Завершенные", Завершенные); 
	
	СписокЗавершенныхСтатусов = Новый СписокЗначений;
	СписокЗавершенныхСтатусов.Добавить(Перечисления.СтатусыОбъединений.ОжиданиеПогрузки);
	СписокЗавершенныхСтатусов.Добавить(Перечисления.СтатусыОбъединений.Погружено);
	
	Запрос.УстановитьПараметр("СписокЗавершенныхСтатусов", СписокЗавершенныхСтатусов);  
	
	ОбъединениеСсылка = Неопределено;
	
	Если ЗначениеЗаполнено(UnionGUID) Тогда 	
		ОбъединениеСсылка = Документы.ОбъединениеГМВТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(UnionGUID));		
	КонецЕсли;                              
	
	Запрос.УстановитьПараметр("Объединение", ОбъединениеСсылка);
	Запрос.УстановитьПараметр("БезОтбораПоДокументу", Не ЗначениеЗаполнено(ОбъединениеСсылка));

	
	УстановитьПривилегированныйРежим(Истина); 
	
	Пакет = Запрос.ВыполнитьПакет();
	ТЗ = Пакет[3].Выгрузить();
		
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);    
	
	Если ЗначениеЗаполнено(UnionGUID) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто,
		//+Сёмин Р.И. 08.04.2026 #UT10-5772
		|	БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто.Сборка.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		//-Сёмин Р.И. 08.04.2026 #UT10-5772
		|	БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто.Сборка.Назначение КАК Назначение
		|ИЗ
		|	РегистрСведений.БуферАРМКладовщикаОбъединениеТЕ КАК БуферАРМКладовщикаОбъединениеТЕ
		|ГДЕ
		|	БуферАРМКладовщикаОбъединениеТЕ.Объединение = &Объединение
		|	И БуферАРМКладовщикаОбъединениеТЕ.UserId = &UserId";
		
		Запрос.УстановитьПараметр("UserId", UserСсылка);  
		Запрос.УстановитьПараметр("Объединение", ОбъединениеСсылка);
		
		ГМБуфер = Новый Массив;
		
		Выборка = Запрос.Выполнить().Выбрать();  
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураГМ = Новый Структура();
			СтруктураГМ.Вставить("ГМ", ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ГрузовоеМесто));
			СтруктураГМ.Вставить("Назначение", Строка(Выборка.Назначение));  
			СтруктураГМ.Вставить("ШК", Документы.ГрузовоеМесто.ПолучитьШтрихкодГрузоместа(Выборка.ГрузовоеМесто));
			СтруктураГМ.Вставить("ГУИД", Строка(Выборка.ГрузовоеМесто.УникальныйИдентификатор()));
			//+Сёмин Р.И. 08.04.2026 #UT10-5772
			СтруктураГМ.Вставить("ТребуетсяМаркировка", Выборка.ТребуетсяМаркировка);  
			//-Сёмин Р.И. 08.04.2026 #UT10-5772
			
			ГМБуфер.Добавить(СтруктураГМ);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто,
		//+Сёмин Р.И. 08.04.2026 #UT10-5772
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка.ТребуетсяМаркировка КАК ТребуетсяМаркировка,
		//-Сёмин Р.И. 08.04.2026 #UT10-5772
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка.Назначение КАК Назначение,
		|	ПРЕДСТАВЛЕНИЕ(ОбъединениеГМВТЕТранспортныеЕдиницы.Статус) КАК Статус
		|ИЗ
		|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
		|ГДЕ
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка = &Объединение";
		
		Запрос.УстановитьПараметр("Объединение", ОбъединениеСсылка);
		
		ГМ = Новый Массив;
		
		Выборка = Запрос.Выполнить().Выбрать();  
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураГМ = Новый Структура();
			СтруктураГМ.Вставить("ГМ", ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.ГрузовоеМесто));
			СтруктураГМ.Вставить("Назначение", Строка(Выборка.Назначение));  
			СтруктураГМ.Вставить("ШК", Документы.ГрузовоеМесто.ПолучитьШтрихкодГрузоместа(Выборка.ГрузовоеМесто));
			СтруктураГМ.Вставить("ГУИД", Строка(Выборка.ГрузовоеМесто.УникальныйИдентификатор()));
			СтруктураГМ.Вставить("Статус", Выборка.Статус);
			//+Сёмин Р.И. 08.04.2026 #UT10-5772
			СтруктураГМ.Вставить("ТребуетсяМаркировка", Выборка.ТребуетсяМаркировка);  
			//-Сёмин Р.И. 08.04.2026 #UT10-5772
			
			ГМ.Добавить(СтруктураГМ);
			
		КонецЦикла;	
						
		Результат = ДанныеВJSONХранилище(Новый Структура("Шапка, ГМБуфер, ГМ", МассивВременный, ГМБуфер, ГМ));  
		
	Иначе
		Результат = ДанныеВJSONХранилище(МассивВременный);		
	КонецЕсли;
		
	ЗаписатьЛог(UserСсылка, ТекущаяДата(), "", "Получить список объединений", "");
	
	Возврат Результат;
	
КонецФункции

Функция ОткрытьЗакрытьТЕ(UnionGUID, UserGUID) Экспорт
	
	СтруктураОтвета = Новый Структура("Результат, Сообщение", Ложь, "");   
	
	Объединение = Документы.ОбъединениеГМВТЕ.ПолучитьСсылку(Новый УникальныйИдентификатор(UnionGUID));
	
	Если Объединение.ПолучитьОбъект() = Неопределено Тогда 
		
		СтруктураОтвета.Сообщение = "Не найдено объединение";
		Возврат СтруктураОтвета;  
		
	КонецЕсли;  
	
	UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаОбъединениеТЕ КАК БуферАРМКладовщикаОбъединениеТЕ
	|ГДЕ
	|	БуферАРМКладовщикаОбъединениеТЕ.UserId = &UserId
	|	И БуферАРМКладовщикаОбъединениеТЕ.Объединение = &Объединение
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовщикаОбъединениеТЕ.ГрузовоеМесто";
	
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);  
	Запрос.УстановитьПараметр("Объединение", Объединение);  
	
	Результат = Запрос.Выполнить().Выгрузить(); 
	
	Если Результат.Количество() > 0 Тогда
		
		ОбъединениеОб = Объединение.ПолучитьОбъект();

		ТЕ = Документы.ТранспортнаяЕдиница.СоздатьДокумент();
		ТЕ.Дата = ТекущаяДата();
		ТЕ.Ответственный = Объединение.Комплектовщик;  
		ТЕ.Объединение = Объединение;
		ТЕ.УстановитьСсылкуНового(Документы.ТранспортнаяЕдиница.ПолучитьСсылку(Новый УникальныйИдентификатор()));          
		
		Для каждого Стр Из Результат Цикл
			
			НСтр = ТЕ.ГрузовыеМеста.Добавить();
			НСтр.ГрузовоеМесто = Стр.ГрузовоеМесто;
			НСтр.Вес = Документы.ГрузовоеМесто.ПолучитьВесГМ(Стр.ГрузовоеМесто); 
			
			СтрокаПоиска = ОбъединениеОб.ТранспортныеЕдиницы.Найти(Стр.ГрузовоеМесто, "ГрузовоеМесто");   
			
			Если СтрокаПоиска <> Неопределено Тогда
				
				СтрокаПоиска.Статус = Перечисления.СтатусыОбъединенияГМ.Объединено;
				СтрокаПоиска.ТранспортнаяЕдиница = ТЕ.ПолучитьСсылкуНового();
				
			КонецЕсли;

		КонецЦикла;	  
		
		Если ОбъединениеОб.ТранспортныеЕдиницы.НайтиСтроки(Новый Структура("Статус", Перечисления.СтатусыОбъединенияГМ.Объединено)).Количество() = ОбъединениеОб.ТранспортныеЕдиницы.Количество() Тогда
			
			ОбъединениеОб.Статус = Перечисления.СтатусыОбъединений.ОжиданиеПогрузки;		
			ОбъединениеОб.Объединено = Истина;
			ОбъединениеОб.ВремяОкончанияОбъединения = ТекущаяДата();
			
		КонецЕсли;
		
		Попытка
			
			НачатьТранзакцию();  
			
			ТЕ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);     
			ОбъединениеОб.Записать(); 
			
			НаборБуфера = РегистрыСведений.БуферАРМКладовщикаОбъединениеТЕ.СоздатьНаборЗаписей();	
			НаборБуфера.Отбор.Объединение.Установить(Объединение);
			НаборБуфера.Отбор.UserId.Установить(UserIdСсылка);
			НаборБуфера.Записать(Истина);	   
			
			СтруктураОтвета.Результат = Истина;
			СтруктураОтвета.Сообщение = "Документ: " + Строка(ТЕ) + " был успешно создан и проведен." + Символы.ПС + Символы.ПС + "Приклейте ШК ТЕ на сформированную транспортную единицу";
			
			ТабличныйДокумент = Документы.ТранспортнаяЕдиница.Печать(Объединение, ТЕ.Ссылка, Ложь, Истина);    
			
			Если ТабличныйДокумент <> Неопределено Тогда
				РегистрыСведений.ОчередьПечатиДокументов.ДобавитьТабличныйДокументВОчередь(UserIdСсылка, ТабличныйДокумент, "ТЕ");	
			КонецЕсли;

			ЗафиксироватьТранзакцию();      
			
		Исключение 			
			
		    ОтменитьТранзакцию();                        		
			СтруктураОтвета.Сообщение = ОписаниеОшибки();
			              
		КонецПопытки;
						
	Иначе   
		
		ОбъединениеОб = Объединение.ПолучитьОбъект(); 
		
		Если ЗначениеЗаполнено(ОбъединениеОб.Комплектовщик) И ОбъединениеОб.Комплектовщик <> UserIdСсылка Тогда 
			
			СтруктураОтвета.Сообщение = "Объединение уже начато другим комплектовщиком"; 
			Возврат СтруктураОтвета;  
			
		КонецЕсли; 
		
		СтруктураОтвета.Результат = Истина;
		
		ЧтоТоУжеУпаковано = ЧтоТоУжеУпаковано(Объединение);
		
		Если Не ЗначениеЗаполнено(ОбъединениеОб.Комплектовщик) Тогда
			
			Если Не ЗначениеЗаполнено(ОбъединениеОб.ВремяНачалаОбъединения) Тогда
				ОбъединениеОб.ВремяНачалаОбъединения = ТекущаяДата();   
			Иначе      
				
				Если Не ЧтоТоУжеУпаковано Тогда
					ВремяНачалаОбъединения = ТекущаяДата();	
				КонецЕсли;
				
			КонецЕсли;        
			
			ОбъединениеОб.Комплектовщик = UserIdСсылка;  
			ОбъединениеОб.Статус = Перечисления.СтатусыОбъединений.ВПроцессеОбъединения; 
			ОбъединениеОб.Записать();	
			
		КонецЕсли;	
		
	КонецЕсли; 
	
	Возврат СтруктураОтвета;
		
КонецФункции

Функция ЧтоТоУжеУпаковано(Объединение)
	
	ЧтоТоУжеУпаковано = Ложь;
	
	Для каждого СтрТовара Из Объединение.ТранспортныеЕдиницы Цикл
		
		Если ЗначениеЗаполнено(СтрТовара.ТранспортнаяЕдиница) Тогда
			
			ЧтоТоУжеУпаковано = Истина;
			Прервать;
			
		КонецЕсли; 					
		
	КонецЦикла; 
	
	Возврат ЧтоТоУжеУпаковано;
			
КонецФункции

Функция ПолучитьСписокГрузовыхМестСлужебныхЗаписок(DocumentGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	СлужебнаяЗапискаСсылка = Документы.СлужебнаяЗаписка.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка КАК СсылкаСлужебнаяЗаписка,
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Грузоместо КАК ШтрихкодГрузовогоМеста
	|ИЗ
	|	Документ.СлужебнаяЗаписка.ТранспортныеЕдиницы КАК СлужебнаяЗапискаТранспортныеЕдиницы
	|ГДЕ
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка = &Ссылка
	|	И НЕ СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Погружено";
	
	Запрос.УстановитьПараметр("Ссылка", СлужебнаяЗапискаСсылка);
	
	ТЗ = Запрос.Выполнить().Выгрузить();	         
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список грузовых мест из документа Служебная записка ", "Служебная записка " + СлужебнаяЗапискаСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьСлужебнуюЗапискуВходящую(DocumentGUID, UserIdGUID) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	ЭтоДокументПТУ = Истина;
	
	ДокументСлужебнаяЗаписка = Документы.СлужебнаяЗаписка.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Если ДокументСлужебнаяЗаписка.ПометкаУдаления Тогда
		
		ТекстОшибки = "" + ДокументСлужебнаяЗаписка + " помечен на удаление. Обработка невозможна";
		Результат.Вставить("Ошибка"             , ТекстОшибки);
		Результат.Вставить("КодРезультата"      , 0);
		Результат.Вставить("ЗначениеРезультата" , "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		ДокОбъект           = ДокументСлужебнаяЗаписка.ПолучитьОбъект();
		ДокОбъект.Погружено = Истина;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Результат.Вставить("КодРезультата", 300);

	Исключение      
		
		ТекстОшибки = "" + ДокументСлужебнаяЗаписка + " невозможно записать. Обработка невозможна.";				
		Результат.Вставить("Ошибка"             , ТекстОшибки);
		Результат.Вставить("КодРезультата"      , 2);
		Результат.Вставить("ЗначениеРезультата" , "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецПопытки; 
	
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
	Возврат Результат;

КонецФункции
	
Функция ПолучитьСписокЗаданийНаДоставку(UserIdGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокЗаданиеНаДоставку.Ссылка КАК Документ,
	|	ДокЗаданиеНаДоставку.Водитель.Наименование
	|ПОМЕСТИТЬ ТаблЗаданий
	|ИЗ
	|	Документ.ЗаданиеНаДоставку КАК ДокЗаданиеНаДоставку
	|ГДЕ
	|	ДокЗаданиеНаДоставку.Проведен = ИСТИНА
	|	И ДокЗаданиеНаДоставку.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокЗаданиеНаДоставку.Ссылка,
	|	ДокЗаданиеНаДоставку.Водитель.Наименование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПогрузкаВАвто.Ссылка,
	|	ПогрузкаВАвто.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|ПОМЕСТИТЬ ТаблПогрузок
	|ИЗ
	|	Документ.ПогрузкаВАвто КАК ПогрузкаВАвто
	|ГДЕ
	|	ПогрузкаВАвто.ЗаданиеНаДоставку.Дата >= &Дата
	|	И ПогрузкаВАвто.Проведен = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаданиеНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблЗаданий.Документ КАК Объект,
	|	ТаблЗаданий.Документ.Номер КАК Номер,
	|	ТаблЗаданий.Документ.Дата КАК ДатаДокумента,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ТаблЗаданий.ВодительНаименование, """") КАК СТРОКА(1000)) КАК ВодительНаименование,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1000)) КАК Штрихкод,
	|	ЕСТЬNULL(МаршрутыДоставки.Наименование, """") КАК Маршрут
	|ПОМЕСТИТЬ ВТЗаданияНаДоставкуШапка
	|ИЗ
	|	ТаблЗаданий КАК ТаблЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблПогрузок КАК ТаблПогрузок
	|		ПО ТаблЗаданий.Документ = ТаблПогрузок.ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыДоставки КАК МаршрутыДоставки
	|		ПО ТаблЗаданий.Документ.Маршрут = МаршрутыДоставки.Ссылка
	|ГДЕ
	|	ТаблПогрузок.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧДоставка.ДокументСборки,
	|	ТЧДоставка.Ссылка.Маршрут,
	|	ТЧДоставка.Ссылка.Номер КАК НомерЗаданияНаДоставку,
	|	ТЧДоставка.Ссылка КАК СсылкаЗаданияНаДоставку
	|ПОМЕСТИТЬ ВТЗаданияНаДоставкуТаблица
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ТЧДоставка
	|ГДЕ
	|	ТЧДоставка.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТЗаданияНаДоставкуШапка.Объект
	|			ИЗ
	|				ВТЗаданияНаДоставкуШапка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧДоставка.ДокументСборки,
	|	ТЧДоставка.Ссылка.Маршрут,
	|	ТЧДоставка.Ссылка.Номер,
	|	ТЧДоставка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку,
	|	СУММА(ВЫБОР
	|			КОГДА ГрузовоеМесто.Погружено = ИСТИНА
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПогружено,
	|	СУММА(ВЫБОР
	|			КОГДА ГрузовоеМесто.Погружено = ЛОЖЬ
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоНеЗагружено,
	|	СУММА(1) КАК КоличествоВсего
	|ПОМЕСТИТЬ ВТКоличествоГрузовыхМест
	|ИЗ
	|	ВТЗаданияНаДоставкуТаблица КАК ВТЗаданияНаДоставкуТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|		ПО ВТЗаданияНаДоставкуТаблица.ДокументСборки = ГрузовоеМесто.Сборка
	|ГДЕ
	|	ГрузовоеМесто.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку,
	|	СУММА(ВЫБОР
	|			КОГДА СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Погружено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Погружено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТЗаданияНаДоставкуТаблица КАК ВТЗаданияНаДоставкуТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебнаяЗаписка.ТранспортныеЕдиницы КАК СлужебнаяЗапискаТранспортныеЕдиницы
	|		ПО ВТЗаданияНаДоставкуТаблица.ДокументСборки = СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку,
	|	СУММА(ВЫБОР
	|			КОГДА ОбъединенияСТЕ.ТранспортнаяЕдиница.Погружено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОбъединенияСТЕ.ТранспортнаяЕдиница.Погружено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ОбъединенияСТЕ.ТранспортнаяЕдиница.Ссылка ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ)
	|ИЗ
	|	ВТЗаданияНаДоставкуТаблица КАК ВТЗаданияНаДоставкуТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка КАК Объединение,
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница
	|		ИЗ
	|			Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
	|		ГДЕ
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТЗаданияНаДоставкуТаблица.ДокументСборки
	|					ИЗ
	|						ВТЗаданияНаДоставкуТаблица)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка,
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница) КАК ОбъединенияСТЕ
	|		ПО ВТЗаданияНаДоставкуТаблица.ДокументСборки = ОбъединенияСТЕ.Объединение
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТЗаданияНаДоставкуТаблица.НомерЗаданияНаДоставку,
	|	ВТЗаданияНаДоставкуТаблица.СсылкаЗаданияНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТКоличествоГрузовыхМест.НомерЗаданияНаДоставку,
	|	ВТКоличествоГрузовыхМест.СсылкаЗаданияНаДоставку,
	|	СУММА(ВТКоличествоГрузовыхМест.КоличествоПогружено) КАК КоличествоПогружено,
	|	СУММА(ВТКоличествоГрузовыхМест.КоличествоНеЗагружено) КАК КоличествоНеЗагружено,
	|	СУММА(ВТКоличествоГрузовыхМест.КоличествоВсего) КАК КоличествоВсего
	|ПОМЕСТИТЬ ВТКоличествоГрузовыхМестИтог
	|ИЗ
	|	ВТКоличествоГрузовыхМест КАК ВТКоличествоГрузовыхМест
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТКоличествоГрузовыхМест.НомерЗаданияНаДоставку,
	|	ВТКоличествоГрузовыхМест.СсылкаЗаданияНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗаданияНаДоставкуШапка.Объект,
	|	ВТЗаданияНаДоставкуШапка.Номер,
	|	ВТЗаданияНаДоставкуШапка.ДатаДокумента,
	|	ВТЗаданияНаДоставкуШапка.ВодительНаименование,
	|	ВТЗаданияНаДоставкуШапка.Штрихкод,
	|	ВТЗаданияНаДоставкуШапка.Маршрут,
	|	ВТКоличествоГрузовыхМестИтог.КоличествоПогружено,
	|	ВТКоличествоГрузовыхМестИтог.КоличествоНеЗагружено,
	|	ВТКоличествоГрузовыхМестИтог.КоличествоВсего
	|ИЗ
	|	ВТЗаданияНаДоставкуШапка КАК ВТЗаданияНаДоставкуШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоГрузовыхМестИтог КАК ВТКоличествоГрузовыхМестИтог
	|		ПО ВТЗаданияНаДоставкуШапка.Объект = ВТКоличествоГрузовыхМестИтог.СсылкаЗаданияНаДоставку";	
	
	Запрос.УстановитьПараметр("Дата",ТекущаяДата()- 86400*3);  
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для каждого Запись Из ТЗ Цикл
		Запись.Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Запись.Объект);
	КонецЦикла;                  
	
	//Возврат Сериализовать(ТЗ);
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список заданий на доставку", "");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокЗаданийНаДоставкуИзДокументовРазгрузкаАвто(UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РазгрузкаАвто.ЗаданиеНаДоставку КАК Объект,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(РазгрузкаАвто.Водитель.Наименование, """") КАК СТРОКА(1000)) КАК ВодительНаименование,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(1000)) КАК Штрихкод,
	|	ДокЗаданиеНаДоставку.Номер КАК Номер,
	|	ДокЗаданиеНаДоставку.Дата КАК ДатаДокумента,
	|	ЕСТЬNULL(МаршрутыДоставки.Наименование, """") КАК Маршрут,
	|	РазгрузкаАвто.Ссылка КАК РазгрузкаАвтоГУИД,
	|	РазгрузкаАвто.Номер КАК РазгрузкаАвтоНомер,
	|	РазгрузкаАвто.Грузополучатель КАК ГрузополучательГУИД,
	|	РазгрузкаАвто.Грузополучатель.Наименование КАК ГрузополучательНаименование
	|ПОМЕСТИТЬ ВТРазрузкаАвто
	|ИЗ
	|	Документ.РазгрузкаАвто КАК РазгрузкаАвто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку КАК ДокЗаданиеНаДоставку
	|		ПО РазгрузкаАвто.ЗаданиеНаДоставку = ДокЗаданиеНаДоставку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыДоставки КАК МаршрутыДоставки
	|		ПО (ДокЗаданиеНаДоставку.Маршрут = МаршрутыДоставки.Ссылка)
	|ГДЕ
	|	(РазгрузкаАвто.Водитель = &Водитель
	|			ИЛИ РазгрузкаАвто.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|	И РазгрузкаАвто.Дата >= &Дата
	|	И РазгрузкаАвто.Проведен
	|	И РазгрузкаАвто.ГМПринял = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовыеМестаТабЧасть.Ссылка КАК РазгрузкаАвто,
	|	ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку,
	|	СУММА(1) КАК КоличествоВсего
	|ПОМЕСТИТЬ ВТГрузМестаВДокум
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК ГрузовыеМестаТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто КАК ДокРазгрузкаАвтоШапка
	|		ПО ГрузовыеМестаТабЧасть.Ссылка = ДокРазгрузкаАвтоШапка.Ссылка
	|ГДЕ
	|	(ДокРазгрузкаАвтоШапка.Водитель = &Водитель
	|			ИЛИ ДокРазгрузкаАвтоШапка.Водитель = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка))
	|	И ДокРазгрузкаАвтоШапка.Дата >= &Дата
	|	И ДокРазгрузкаАвтоШапка.Проведен
	|	И ДокРазгрузкаАвтоШапка.ГМПринял = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрузовыеМестаТабЧасть.Ссылка,
	|	ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАРМКладовщикаРазгрузкаАвто.ЗаданиеНаДоставку,
	|	БуферАРМКладовщикаРазгрузкаАвто.Объект,
	|	СУММА(1) КАК Количество
	|ПОМЕСТИТЬ ВТРазгруженоРС
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаРазгрузкаАвто КАК БуферАРМКладовщикаРазгрузкаАвто
	|ГДЕ
	|	БуферАРМКладовщикаРазгрузкаАвто.UserId = &Водитель
	|
	|СГРУППИРОВАТЬ ПО
	|	БуферАРМКладовщикаРазгрузкаАвто.ЗаданиеНаДоставку,
	|	БуферАРМКладовщикаРазгрузкаАвто.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазрузкаАвто.Объект,
	|	ВТРазрузкаАвто.ВодительНаименование,
	|	ВТРазрузкаАвто.Штрихкод,
	|	ВТРазрузкаАвто.Номер,
	|	ВТРазрузкаАвто.ДатаДокумента,
	|	ВТРазрузкаАвто.Маршрут,
	|	ВТРазрузкаАвто.РазгрузкаАвтоГУИД,
	|	ВТРазрузкаАвто.РазгрузкаАвтоНомер,
	|	ВТРазрузкаАвто.ГрузополучательГУИД,
	|	ВТРазрузкаАвто.ГрузополучательНаименование,
	|	ЕСТЬNULL(ВТГрузМестаВДокум.КоличествоВсего, 0) КАК КоличествоВсего,
	|	ЕСТЬNULL(ВТРазгруженоРС.Количество, 0) КАК КоличествоРазгружено,
	|	ЕСТЬNULL(ВТГрузМестаВДокум.КоличествоВсего, 0) - ЕСТЬNULL(ВТРазгруженоРС.Количество, 0) КАК КоличествоНеРазгружено
	|ИЗ
	|	ВТРазрузкаАвто КАК ВТРазрузкаАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрузМестаВДокум КАК ВТГрузМестаВДокум
	|		ПО ВТРазрузкаАвто.РазгрузкаАвтоГУИД = ВТГрузМестаВДокум.РазгрузкаАвто
	|			И ВТРазрузкаАвто.Объект = ВТГрузМестаВДокум.ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазгруженоРС КАК ВТРазгруженоРС
	|		ПО ВТРазрузкаАвто.Объект = ВТРазгруженоРС.ЗаданиеНаДоставку
	|			И ВТРазрузкаАвто.РазгрузкаАвтоГУИД = ВТРазгруженоРС.Объект";
	
	Запрос.УстановитьПараметр("Водитель", UserIdСсылка);		
	Запрос.УстановитьПараметр("Дата",     ТекущаяДата() - 86400 * 10);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	Для каждого Запись Из ТЗ Цикл
		Запись.Штрихкод = ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(Запись.Объект);
	КонецЦикла;                  
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список заданий на доставку из докуметов разгрузка авто ", "Разгрузка авто");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвто(DocumentGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	РазгрузкаВАвтоСсылка = Документы.РазгрузкаАвто.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГрузовыеМестаТабЧасть.Ссылка КАК РазгрузкаАвтоГУИД,
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.Ссылка КАК ГрузовоеМестоГУИД,
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.Номер КАК ГрузовоеМестоНомер,
	|	ДокЗаданиеНаДоставку.Ссылка КАК ЗаданиеНаДоставкуГУИД,
	|	ДокЗаданиеНаДоставку.Номер КАК НомерЗаданияНаДоставку,
	|	ДокЗаданиеНаДоставку.Маршрут.Наименование КАК Маршрут,
	|	ДокРазгрузкаАвтоШапка.Грузополучатель.Наименование КАК ГрузополучательНаименование,
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста,
	|	ВЫБОР
	|		КОГДА ГрузовыеМестаТабЧасть.ГрузовоеМесто.ШтрихкодГрузовогоМеста = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетШтрихкодаГМ   
	|ПОМЕСТИТЬ ВТГрузМестаВДокум
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК ГрузовыеМестаТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто КАК ДокРазгрузкаАвтоШапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку КАК ДокЗаданиеНаДоставку
	|			ПО ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку = ДокЗаданиеНаДоставку.Ссылка
	|		ПО ГрузовыеМестаТабЧасть.Ссылка = ДокРазгрузкаАвтоШапка.Ссылка
	|ГДЕ
	|	ДокРазгрузкаАвтоШапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БуферАРМКладовщикаРазгрузкаАвто.Объект,
	|	БуферАРМКладовщикаРазгрузкаАвто.ГрузовоеМесто,
	|	БуферАРМКладовщикаРазгрузкаАвто.UserId,
	|	БуферАРМКладовщикаРазгрузкаАвто.CreatedDate
	|ПОМЕСТИТЬ ВТОтскан
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаРазгрузкаАвто КАК БуферАРМКладовщикаРазгрузкаАвто
	|ГДЕ
	|	БуферАРМКладовщикаРазгрузкаАвто.Объект = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГрузМестаВДокум.РазгрузкаАвтоГУИД,
	|	ВТГрузМестаВДокум.ГрузовоеМестоГУИД,
	|	ВТГрузМестаВДокум.ГрузовоеМестоНомер,
	|	ВТГрузМестаВДокум.ЗаданиеНаДоставкуГУИД,
	|	ВТГрузМестаВДокум.НомерЗаданияНаДоставку,
	|	ВТГрузМестаВДокум.Маршрут,
	|	ВТГрузМестаВДокум.ГрузополучательНаименование КАК Контрагент,
	|	ВТГрузМестаВДокум.ШтрихкодГрузовогоМеста, 
	|	ВТГрузМестаВДокум.НетШтрихкодаГМ, 
	|	ВЫБОР
	|		КОГДА ВТОтскан.Объект ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Разгружено
	|ИЗ
	|	ВТГрузМестаВДокум КАК ВТГрузМестаВДокум
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтскан КАК ВТОтскан
	|		ПО ВТГрузМестаВДокум.РазгрузкаАвтоГУИД = ВТОтскан.Объект
	|			И ВТГрузМестаВДокум.ГрузовоеМестоГУИД = ВТОтскан.ГрузовоеМесто";
	
	
	Запрос.УстановитьПараметр("Ссылка", РазгрузкаВАвтоСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	         
	
	МассивСтрок = ТЗ.НайтиСтроки(Новый Структура("НетШтрихкодаГМ", Истина));    
	ДокГМ       = Документы.ГрузовоеМесто;
	
	Для каждого Запись Из МассивСтрок Цикл     
		
		ГМОбъект = Запись.ГрузовоеМестоГУИД.ПолучитьОбъект();
		
		Попытка
			
			ГМОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			ГМОбъект.Записать(); 
			Запись.ШтрихкодГрузовогоМеста = ГМОбъект.ШтрихкодГрузовогоМеста;   
			
		Исключение
			Запись.ШтрихкодГрузовогоМеста = ДокГМ.ПолучитьШтрихкодГрузоместа(Запись.ГрузовоеМестоГУИД);                                                                                                   		
		КонецПопытки;
		
	КонецЦикла;  
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список грузовых мест из документа разгрузка авто ", "Разгрузка авто " + РазгрузкаВАвтоСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокГрузовыхМестИзДокументаРазгрузкаАвтоДляПостановкиНаМаршрут(UnloadAutoGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	РазгрузкаВАвтоСсылка = Документы.РазгрузкаАвто.ПолучитьСсылку(Новый УникальныйИдентификатор(UnloadAutoGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ГрузовыеМестаТабЧасть.Ссылка КАК РазгрузкаАвтоГУИД,
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.Ссылка КАК ГрузовоеМестоГУИД,
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.Номер КАК ГрузовоеМестоНомер,
	|	ДокЗаданиеНаДоставку.Ссылка КАК ЗаданиеНаДоставкуГУИД,
	|	ДокЗаданиеНаДоставку.Номер КАК НомерЗаданияНаДоставку,
	|	ДокЗаданиеНаДоставку.Маршрут.Наименование КАК Маршрут,
	|	ДокРазгрузкаАвтоШапка.Грузополучатель.Наименование КАК ГрузополучательНаименование,  
	|	ГрузовыеМестаТабЧасть.ГрузовоеМесто.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста,
	|	ВЫБОР
	|		КОГДА ГрузовыеМестаТабЧасть.ГрузовоеМесто.ШтрихкодГрузовогоМеста = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетШтрихкодаГМ   
	|ПОМЕСТИТЬ ВТГрузМестаВДокум
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК ГрузовыеМестаТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто КАК ДокРазгрузкаАвтоШапка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку КАК ДокЗаданиеНаДоставку
	|			ПО ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку = ДокЗаданиеНаДоставку.Ссылка
	|		ПО ГрузовыеМестаТабЧасть.Ссылка = ДокРазгрузкаАвтоШапка.Ссылка
	|ГДЕ
	|	ДокРазгрузкаАвтоШапка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.ЗаданиеНаДоставку,
	|	Т1.РазгрузкаАвто,
	|	Т1.ГрузовоеМесто,
	|	Т1.UserId,
	|	Т1.DateCreated
	|ПОМЕСТИТЬ ВТОтскан
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут КАК Т1
	|ГДЕ
	|	Т1.РазгрузкаАвто = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТГрузМестаВДокум.РазгрузкаАвтоГУИД,
	|	ВТГрузМестаВДокум.ГрузовоеМестоГУИД,
	|	ВТГрузМестаВДокум.ГрузовоеМестоНомер,
	|	ВТГрузМестаВДокум.ЗаданиеНаДоставкуГУИД,
	|	ВТГрузМестаВДокум.НомерЗаданияНаДоставку,
	|	ВТГрузМестаВДокум.Маршрут,
	|	ВТГрузМестаВДокум.ГрузополучательНаименование КАК Контрагент,
	|	ВТГрузМестаВДокум.ШтрихкодГрузовогоМеста,
	|	ВТГрузМестаВДокум.НетШтрихкодаГМ,
	|	ВЫБОР
	|		КОГДА ВТОтскан.РазгрузкаАвто ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПоставленоНаМаршрут
	|ИЗ
	|	ВТГрузМестаВДокум КАК ВТГрузМестаВДокум
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтскан КАК ВТОтскан
	|		ПО ВТГрузМестаВДокум.РазгрузкаАвтоГУИД = ВТОтскан.РазгрузкаАвто
	|			И ВТГрузМестаВДокум.ГрузовоеМестоГУИД = ВТОтскан.ГрузовоеМесто";
	
	
	Запрос.УстановитьПараметр("Ссылка", РазгрузкаВАвтоСсылка);
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	         
	
	МассивСтрок = ТЗ.НайтиСтроки(Новый Структура("НетШтрихкодаГМ", Истина));    
	ДокГМ       = Документы.ГрузовоеМесто;
	
	Для каждого Запись Из МассивСтрок Цикл     
		
		ГМОбъект = Запись.ГрузовоеМестоГУИД.ПолучитьОбъект();
		
		Попытка
			
			ГМОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			ГМОбъект.Записать(); 
			Запись.ШтрихкодГрузовогоМеста = ГМОбъект.ШтрихкодГрузовогоМеста;   
			
		Исключение
			Запись.ШтрихкодГрузовогоМеста = ДокГМ.ПолучитьШтрихкодГрузоместа(Запись.ГрузовоеМестоГУИД);                                                                                                   		
		КонецПопытки;
		
	КонецЦикла;   
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список грузовых мест из документа разгрузка авто ", "Разгрузка авто - Постановка на маршрут" + РазгрузкаВАвтоСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокМаршрутовИзРазгрузкаАвтоДляПостановкиНаМаршрут(UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РазгрузкаАвто.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку,
	|	ЕСТЬNULL(МаршрутыДоставки.Наименование, """") КАК Маршрут,
	|	ЕСТЬNULL(МаршрутыДоставки.Ссылка, ЗНАЧЕНИЕ(Справочник.МаршрутыДоставки.ПустаяСсылка)) КАК МаршрутСсылка,
	|	ДокЗаданиеНаДоставку.Номер КАК ЗаданиеНаДоставкуНомер,
	|	ДокЗаданиеНаДоставку.Дата КАК ЗаданиеНаДоставкуДата,
	|	РазгрузкаАвто.Ссылка КАК РазгрузкаАвто,
	|	РазгрузкаАвто.Номер КАК РазгрузкаАвтоНомер,
	|	РазгрузкаАвто.Грузополучатель КАК Грузополучатель,
	|	РазгрузкаАвто.Грузополучатель.Наименование КАК ГрузополучательНаименование
	|ПОМЕСТИТЬ ВТРазрузкаАвто
	|ИЗ
	|	Документ.РазгрузкаАвто КАК РазгрузкаАвто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку КАК ДокЗаданиеНаДоставку
	|		ПО РазгрузкаАвто.ЗаданиеНаДоставку = ДокЗаданиеНаДоставку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МаршрутыДоставки КАК МаршрутыДоставки
	|		ПО (ДокЗаданиеНаДоставку.Маршрут = МаршрутыДоставки.Ссылка)
	|ГДЕ
	|	РазгрузкаАвто.Дата >= &Дата
	|	И РазгрузкаАвто.Проведен
	|	И РазгрузкаАвто.ГМПринял <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	И РазгрузкаАвто.ГМПоложилНаМаршрут = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовыеМестаТабЧасть.Ссылка КАК РазгрузкаАвто,
	|	ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку,
	|	СУММА(1) КАК КоличествоВсего
	|ПОМЕСТИТЬ ВТГрузМестаВДокум
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК ГрузовыеМестаТабЧасть
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто КАК ДокРазгрузкаАвтоШапка
	|		ПО ГрузовыеМестаТабЧасть.Ссылка = ДокРазгрузкаАвтоШапка.Ссылка
	|ГДЕ
	|	ДокРазгрузкаАвтоШапка.Дата >= &Дата
	|	И ДокРазгрузкаАвтоШапка.Проведен
	|	И ДокРазгрузкаАвтоШапка.ГМПринял <> ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	И ДокРазгрузкаАвтоШапка.ГМПоложилНаМаршрут = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрузовыеМестаТабЧасть.Ссылка,
	|	ДокРазгрузкаАвтоШапка.ЗаданиеНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РСприемкаГрузМест.ЗаданиеНаДоставку,
	|	РСприемкаГрузМест.РазгрузкаАвто,
	|	СУММА(1) КАК КоличествоПоставленоНаМаршрут
	|ПОМЕСТИТЬ ВТПриемкаГрузовыхМест
	|ИЗ
	|	РегистрСведений.БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут КАК РСприемкаГрузМест
	|
	|СГРУППИРОВАТЬ ПО
	|	РСприемкаГрузМест.ЗаданиеНаДоставку,
	|	РСприемкаГрузМест.РазгрузкаАвто
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазрузкаАвто.РазгрузкаАвто КАК РазгрузкаАвтоГУИД,
	|	ВТРазрузкаАвто.ЗаданиеНаДоставку КАК ЗаданиеНаДоставкуГУИД,
	|	ВТРазрузкаАвто.Маршрут,
	|	ВТРазрузкаАвто.МаршрутСсылка КАК МаршрутГУИД,
	|	ВТРазрузкаАвто.ЗаданиеНаДоставкуНомер КАК ЗаданиеНаДоставкуНомер,
	|	ВТРазрузкаАвто.ЗаданиеНаДоставкуДата КАК ЗаданиеНаДоставкуДата,
	|	ВТРазрузкаАвто.РазгрузкаАвтоНомер,
	|	ВТРазрузкаАвто.Грузополучатель КАК ГрузополучательГУИД,
	|	ВТРазрузкаАвто.Грузополучатель.Наименование КАК ГрузополучательНаименование,
	|	ЕСТЬNULL(ВТГрузМестаВДокум.КоличествоВсего, 0) КАК КоличествоВсего,
	|	ЕСТЬNULL(ВТПриемкаГрузовыхМест.КоличествоПоставленоНаМаршрут, 0) КАК КоличествоПоставленоНаМаршрут,
	|	ЕСТЬNULL(ВТГрузМестаВДокум.КоличествоВсего, 0) - ЕСТЬNULL(ВТПриемкаГрузовыхМест.КоличествоПоставленоНаМаршрут, 0) КАК КоличествоНеПоставленоНаМаршрут
	|ИЗ
	|	ВТРазрузкаАвто КАК ВТРазрузкаАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГрузМестаВДокум КАК ВТГрузМестаВДокум
	|		ПО ВТРазрузкаАвто.РазгрузкаАвто = ВТГрузМестаВДокум.РазгрузкаАвто
	|			И ВТРазрузкаАвто.ЗаданиеНаДоставку = ВТГрузМестаВДокум.ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПриемкаГрузовыхМест КАК ВТПриемкаГрузовыхМест
	|		ПО ВТРазрузкаАвто.ЗаданиеНаДоставку = ВТПриемкаГрузовыхМест.ЗаданиеНаДоставку
	|			И ВТРазрузкаАвто.РазгрузкаАвто = ВТПриемкаГрузовыхМест.РазгрузкаАвто
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку КАК БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку
	|		ПО ВТРазрузкаАвто.ЗаданиеНаДоставку = БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку
	|			И ВТРазрузкаАвто.РазгрузкаАвто = БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто
	|ГДЕ
	|	(БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто ЕСТЬ NULL
	|			ИЛИ БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode = &UserId)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТРазрузкаАвто.Маршрут,
	|	ВТРазрузкаАвто.ЗаданиеНаДоставку,
	|	ВТРазрузкаАвто.РазгрузкаАвто";
	
	
	Запрос.УстановитьПараметр("Дата",     ТекущаяДата() - 86400 * 10);
	Запрос.УстановитьПараметр("UserId",   UserIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);	
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список маршрутов из докуметов разгрузка авто ", "Разгрузка авто");
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьБлокировкуНаМаршрутИзРазгрузкаАвто(StoreKeeperGUID, UnloadAutoGUID, UserIdGUID) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ЗаданиеНаДоставкСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(StoreKeeperGUID));
	РазгрузкаАвтоСсылка = Документы.РазгрузкаАвто.ПолучитьСсылку(Новый УникальныйИдентификатор(UnloadAutoGUID));
	
	// Проверяем, что пользователь уже заблокировал документ разгрузка авто
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто,
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode
	|ИЗ
	|	РегистрСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку КАК БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку
	|ГДЕ
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто = &РазгрузкаАвто
	|	И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode = &UserId";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставкСсылка);
	Запрос.УстановитьПараметр("РазгрузкаАвто", РазгрузкаАвтоСсылка);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	Если РезультатЗапроса.Количество() > 0 Тогда
		
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;		
		
	КонецЕсли; 
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	// Если пользователь не заблокировал, то проверяем не заблокировал, кто то другой
	// если нет, то сами его блокируем
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто,
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode,
	|	ЕСТЬNULL(ЗаданиеНаДоставкуТаблица.Маршрут.Наименование, """") КАК Маршрут,
	|	РазгрузкаАвтоТаблица.Грузополучатель.Наименование КАК ГрузополучательНаименование
	|ИЗ
	|	РегистрСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку КАК БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку КАК ЗаданиеНаДоставкуТаблица
	|		ПО БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку = ЗаданиеНаДоставкуТаблица.Ссылка
	|			И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку = ЗаданиеНаДоставкуТаблица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РазгрузкаАвто КАК РазгрузкаАвтоТаблица
	|		ПО БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто = РазгрузкаАвтоТаблица.Ссылка
	|ГДЕ
	|	БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто = &РазгрузкаАвто
	|	И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode <> &UserId
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставкСсылка);
	Запрос.УстановитьПараметр("РазгрузкаАвто", РазгрузкаАвтоСсылка);
	Запрос.УстановитьПараметр("UserId", UserIdСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество() > 0 Тогда				
		
		ОтменитьТранзакцию();
		ТекстОшибки = "Маршрут " + РезультатЗапроса.Маршрут + " по грузополучателю " + РезультатЗапроса.ГрузополучательНаименование + " уже заблокирован " 
		+ РезультатЗапроса.UserId;
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", ТекстОшибки, РезультатЗапроса.РазгрузкаАвто); 			
		
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;		
		
	Иначе 
		
		МенеджерЗаписи = РегистрыСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаданиеНаДоставку = ЗаданиеНаДоставкСсылка;
		МенеджерЗаписи.РазгрузкаАвто = РазгрузкаАвтоСсылка;
		МенеджерЗаписи.UserIdCode = UserIdСсылка; 
		МенеджерЗаписи.DateCreated = ТекущаяДата();
		МенеджерЗаписи.Записать();
		
	КонецЕсли;                                                          
	
	ЗафиксироватьТранзакцию();	 
	
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
	Возврат Результат;		
	
КонецФункции

Функция ПолучитьОстаткиНоменклатуры(Barcode, GoodGUID, UserIdGUID) Экспорт
	
	Запрос = Новый Запрос;      
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Штрихкоды.Владелец КАК Справочник.Номенклатура) КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	&Штрихкод <> """"
	|	И Штрихкоды.Штрихкод = &Штрихкод
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ 
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура		
	|ГДЕ
	|	Номенклатура.Ссылка = &Номенклатура
	|;		
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ISNULL(ТоварыВЯчейках.Ячейка.Код, &ЗначениеПустое) КАК Ячейка,
	|	ТоварыВЯчейках.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					Товары.Номенклатура
	|				ИЗ
	|					Товары)) КАК ТоварыВЯчейках";
	
	НоменклатураСсылка  =  Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));			
	
	Запрос.УстановитьПараметр("Штрихкод", Barcode);		
	Запрос.УстановитьПараметр("Номенклатура", НоменклатураСсылка);
	Запрос.УстановитьПараметр("ЗначениеПустое", "----");
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить остатки номенклатуры", "Штрихкод " + Barcode + "; " + НоменклатураСсылка);	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстаткиНоменклатуруПоТаблицеЗначений(ТЗ, ПолучитьТЗ = Ложь) Экспорт
	
	Запрос = Новый Запрос;      
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СписокТоваров.Владелец КАК Номенклатура,
	|	СписокТоваров.Наименование,
	|	СписокТоваров.ГруппаАВСФилиала,
	|	СписокТоваров.КодПроизводителя,
	|	СписокТоваров.Производитель
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&СписокТоваров КАК СписокТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейках.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыВЯчейках.Номенклатура,
	|	ТоварыВЯчейках.Ячейка.Код КАК Ячейка,
	|	ТоварыВЯчейках.Ячейка.НеУчитыватьВОперативномУчете КАК НеУчитыватьВОперативномУчете,
	|	ВЫРАЗИТЬ(""ТоварыНаСкладе"" КАК СТРОКА(50)) КАК ИмяТаблицы
	|ПОМЕСТИТЬ ВТНаСкладе
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура
	|				ИЗ
	|					ВТ)) КАК ТоварыВЯчейках
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ЛОЖЬ КАК НеУчитыватьВОперативномУчете,
	|	ВЫРАЗИТЬ(""ТоварыВРезерве"" КАК СТРОКА(50)) КАК ИмяТаблицы,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК Ячейка
	|ПОМЕСТИТЬ ВТВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ВТ.Номенклатура
	|				ИЗ
	|					ВТ)) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНаСкладе.КоличествоОстаток,
	|	ВТНаСкладе.Номенклатура,
	|	ВТНаСкладе.НеУчитыватьВОперативномУчете,
	|	ВТНаСкладе.ИмяТаблицы,
	|	ВТНаСкладе.Ячейка
	|ПОМЕСТИТЬ ВТТоварыВрезервеИнаСкладе
	|ИЗ
	|	ВТНаСкладе КАК ВТНаСкладе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТВРезерве.КоличествоОстаток,
	|	ВТВРезерве.Номенклатура,
	|	ВТВРезерве.НеУчитыватьВОперативномУчете,
	|	ВТВРезерве.ИмяТаблицы,
	|	ВТВРезерве.Ячейка
	|ИЗ
	|	ВТВРезерве КАК ВТВРезерве
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Владелец,
	|	ВТ.Наименование,
	|	ВТ.ГруппаАВСФилиала,
	|	ВТ.КодПроизводителя,
	|	ВТ.Производитель,
	|	ЕСТЬNULL(ВТТоварыВрезервеИнаСкладе.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ВТТоварыВрезервеИнаСкладе.НеУчитыватьВОперативномУчете, ЛОЖЬ) КАК НеУчитыватьВОперативномУчете,
	|	ЕСТЬNULL(ВТТоварыВрезервеИнаСкладе.ИмяТаблицы, """") КАК ИмяТаблицы,
	|	ЕСТЬNULL(ВТТоварыВрезервеИнаСкладе.Ячейка, """") КАК Ячейка
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыВрезервеИнаСкладе КАК ВТТоварыВрезервеИнаСкладе
	|		ПО ВТ.Номенклатура = ВТТоварыВрезервеИнаСкладе.Номенклатура";
	
	Запрос.УстановитьПараметр("СписокТоваров", ТЗ);	
	УстановитьПривилегированныйРежим(Истина);
	РезультатТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПолучитьТЗ = Истина Тогда
		Возврат РезультатТЗ;
	КонецЕсли; 
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	Возврат Результат;
	
КонецФункции

Функция ОбработатьГрузовоеМесто(DeliveryOrderGUID, CargoPlaceGUID, UserIDGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIDGUID);
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	ЗаданиеНаДоставку = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DeliveryOrderGUID));
	ГрузовоеМесто = Документы.ГрузовоеМесто.ПолучитьСсылку(Новый УникальныйИдентификатор(CargoPlaceGUID));
	
	Если ГрузовоеМесто.ПолучитьОбъект() = Неопределено Тогда 
		
		 ГрузовоеМесто = Документы.СлужебнаяЗаписка.ПолучитьСсылку(Новый УникальныйИдентификатор(CargoPlaceGUID));  
		 
		 //+Белов А. 23.01.2025 #UT10-5050
		 Если ГрузовоеМесто.ПолучитьОбъект() = Неопределено Тогда 			 
			 ГрузовоеМесто = Документы.ТранспортнаяЕдиница.ПолучитьСсылку(Новый УникальныйИдентификатор(CargoPlaceGUID));  			 
		 КонецЕсли; 	
		 //-Белов А. 23.01.2025 #UT10-5050
		 
    КонецЕсли;
	
	Если ГрузовоеМесто = Неопределено ИЛИ ГрузовоеМесто.ПолучитьОбъект() = Неопределено Или ЗаданиеНаДоставку = Неопределено Тогда
		
		ТекстОшибки = "Не найдено задание на доставку или грузовое место";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 1);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки
	|ПОМЕСТИТЬ ЗаданиеНаДоставку
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовоеМесто.Ссылка КАК Документ
	|ИЗ
	|	Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|ГДЕ
	|	ГрузовоеМесто.Сборка В
	|			(ВЫБРАТЬ
	|				ЗаданиеНаДоставку.ДокументСборки
	|			ИЗ
	|				ЗаданиеНаДоставку)
	|	И ГрузовоеМесто.Ссылка = &ГрузовоеМесто
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СлужебнаяЗаписка.Ссылка
	|ИЗ
	|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
	|ГДЕ
	|	НЕ СлужебнаяЗаписка.ПометкаУдаления
	|	И НЕ СлужебнаяЗаписка.Погружено
	|	И СлужебнаяЗаписка.Ссылка В
	|			(ВЫБРАТЬ
	|				ЗаданиеНаДоставку.ДокументСборки
	|			ИЗ
	|				ЗаданиеНаДоставку)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТранспортнаяЕдиница.Ссылка
	|ИЗ
	|	Документ.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница
	|ГДЕ
	|	ТранспортнаяЕдиница.Ссылка = &ГрузовоеМесто";

	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
	Запрос.УстановитьПараметр("ГрузовоеМесто", ГрузовоеМесто);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ГрузовоеМесто = Выборка.Документ;
		
		Если ГрузовоеМесто.ПометкаУдаления Тогда
			
			ТекстОшибки = "Грузовое место " + Выборка.Документ + " помечен на удаление. Обработка невозможна";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат.Вставить("КодРезультата", 0);
			Результат.Вставить("ЗначениеРезультата", "");
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		ИначеЕсли ГрузовоеМесто.Погружено Тогда
			
			ТекстОшибки = "Грузовое место " + Выборка.Документ + " уже погружено. Обработка невозможна";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат.Вставить("КодРезультата", 1);
			Результат.Вставить("ЗначениеРезультата", "");
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		Иначе		
			
			Попытка
				
				ДокОбъект = ГрузовоеМесто.ПолучитьОбъект();
				ДокОбъект.Погружено = Истина;
				ДокОбъект.Записать();
				
			Исключение
				
				ТекстОшибки = "Документ грузовое место " + Выборка.Документ + " невозможно записать. Обработка невозможна.";				
				Результат.Вставить("Ошибка", ТекстОшибки);
				Результат.Вставить("КодРезультата", 2);
				Результат.Вставить("ЗначениеРезультата", "");
				Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
				Возврат Результат;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаДоставку.Ссылка,                                                         
		|	ЗаданиеНаДоставку.Водитель КАК Водитель
		|ИЗ
		|	Документ.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
		|ГДЕ
		|	ЗаданиеНаДоставку.Ссылка = &ЗаданиеНаДоставку";
		
		Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ВодительСсылка = Выборка.Водитель;				
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПогрузкаВАвто.Ссылка
		|ИЗ
		|	Документ.ПогрузкаВАвто КАК ПогрузкаВАвто
		|ГДЕ
		|	ПогрузкаВАвто.Водитель = &Водитель 
		|   И ПогрузкаВАвто.ПометкаУдаления = Ложь
		|	И ПогрузкаВАвто.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
		|	И НАЧАЛОПЕРИОДА(ПогрузкаВАвто.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)";						
		
		Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
		Запрос.УстановитьПараметр("Водитель", ВодительСсылка);					
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			
			ДокОбъект = Документы.ПогрузкаВАвто.СоздатьДокумент();
			ДокОбъект.Клеверенс = Истина;
			ДокОбъект.Дата = ТекущаяДата();			
			ДокОбъект.Водитель = ВодительСсылка;
			ДокОбъект.Ответственный = UserIdСсылка;
			ДокОбъект.ЗаданиеНаДоставку = ЗаданиеНаДоставку;
			
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создан документ ""Погрузка в авто""", ДокОбъект);
			
		КонецЕсли;
		
		Стр = ДокОбъект.Погружено.Добавить();
		Стр.Грузоместо = ГрузовоеМесто;

		Если ТипЗнч(ГрузовоеМесто) = Тип("ДокументСсылка.СлужебнаяЗаписка") Тогда 			
			Стр.Контрагент = Стр.Грузоместо.Получатель;
		//+Белов А. 24.01.2025 #UT10-5050
		ИначеЕсли ТипЗнч(ГрузовоеМесто) = Тип("ДокументСсылка.ТранспортнаяЕдиница") Тогда 			
			Стр.Контрагент = Стр.Грузоместо.Объединение.Грузополучатель;
		//-Белов А. 24.01.2025 #UT10-5050
		Иначе
			Стр.Контрагент = Стр.Грузоместо.Сборка.Грузополучатель;
		КонецЕсли;

		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", 
		"Добавлено грузовое место в документ ""Погрузка в авто""", "Погрузка в авто " + ДокОбъект + "; " + "Грузовое место " + ГрузовоеМесто);
		
		//// Проверить, есть ли еще грузовые места для документа "Задание на доставку"
		/////////////////////////////////////////////////////////////////////////////////////////////////////////		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки
		|ПОМЕСТИТЬ ЗаданиеНаДоставку
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМесто.Ссылка
		|ИЗ
		|	Документ.ГрузовоеМесто КАК ГрузовоеМесто
		|ГДЕ
		|	ГрузовоеМесто.Сборка В
		|			(ВЫБРАТЬ
		|				ЗаданиеНаДоставку.ДокументСборки
		|			ИЗ
		|				ЗаданиеНаДоставку)
		|	И ГрузовоеМесто.ПометкаУдаления = ЛОЖЬ
		|	И ГрузовоеМесто.Погружено = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СлужебнаяЗаписка.Ссылка
		|ИЗ
		|	Документ.СлужебнаяЗаписка КАК СлужебнаяЗаписка
		|ГДЕ
		|	СлужебнаяЗаписка.ПометкаУдаления = ЛОЖЬ
		|	И СлужебнаяЗаписка.Погружено = ЛОЖЬ
		|	И СлужебнаяЗаписка.Ссылка В
		|			(ВЫБРАТЬ
		|				ЗаданиеНаДоставку.ДокументСборки
		|			ИЗ
		|				ЗаданиеНаДоставку)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница
		|ИЗ
		|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
		|ГДЕ
		|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЗаданиеНаДоставку.ДокументСборки
		|			ИЗ
		|				ЗаданиеНаДоставку)
		|	И НЕ ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница.Погружено
		|	И НЕ ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница.ПометкаУдаления";

		Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
		Выборка = Запрос.Выполнить().Выбрать();
		/////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Если Выборка.Количество() Тогда
			
			ДокОбъект.Записать();			
			Результат.Вставить("Ошибка", "");
			Результат.Вставить("КодРезультата", 4);
			
			ЗначениеРезультата = СокрЛП(ГрузовоеМесто.Номер) + "; " + Стр.Контрагент.Наименование;
			Результат.Вставить("ЗначениеРезультата", ЗначениеРезультата);						
			
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ ""Погрузка в авто"" записан", ДокОбъект);
			
		Иначе			
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);						
			Результат.Вставить("Ошибка", "");
			Результат.Вставить("КодРезультата", 300);
			Результат.Вставить("ЗначениеРезультата", "");
			Результат.Вставить("Сообщение", "Документ Погрузка в авто: """ + ДокОбъект.Номер + """ " + Строка(ДокОбъект.Дата) + " создан и проведен.");
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Документ ""Погрузка в авто"" проведен", ДокОбъект);
		КонецЕсли;  
		
		//+Белов А. 31.01.2025 #UT10-5050
		Если ТипЗнч(ГрузовоеМесто) = Тип("ДокументСсылка.ТранспортнаяЕдиница")
			И ЗначениеЗаполнено(ГрузовоеМесто.Объединение) 
			И ГрузовоеМесто.Объединение.Статус <> Перечисления.СтатусыОбъединений.Завершено Тогда
			
			ОбъединениеОб = ГрузовоеМесто.Объединение.ПолучитьОбъект(); 
			ОбъединениеОб.Статус = Перечисления.СтатусыОбъединений.Завершено;
			ОбъединениеОб.Записать();     		
			
		КонецЕсли;
		//-Белов А. 31.01.2025 #UT10-5050
		
	Исключение	
		
		ТекстОшибки = "Ошибка записи грузовых мест. " + ОписаниеОшибки() + Символы.ПС;				
		ТекстОшибки = ТекстОшибки + "Документ записан и НЕ проведен.";
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 3);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		
	КонецПопытки;
	
	Возврат Результат;	
	
КонецФункции

Функция ЗаписатьВБуферРазмещенияСПроверкойОстатков(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate,
	Barcode, Quantity, CellGUID, PutIntoManual) Экспорт           
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	GetTableValues = Истина;
	TypeDocument = "ПоступлениеТоваровУслуг";
	GUIDDocument = ObjectGUID;
	НайденныйТовар = FindGoodByBarcode(UserIdGUID, Barcode, TypeDocument, GUIDDocument, GoodGUID, GetTableValues);
	
	SelectedProductIdGUID = GoodGUID;
	ПолучитьТЗ = Истина;                         
	// КоличествоВДокументе, КоличествоВБуфере, СсылкаТовара, КоличествоВРазмещении
	ОстатокПоТоваруВДокументе = ПолучитьОстатокПоТоваруИзДокумента(UserIdGUID, ObjectGUID, Barcode, SelectedProductIdGUID, Истина);
	
	КоличествоНабрано = ОстатокПоТоваруВДокументе[0].КоличествоВБуфере + ОстатокПоТоваруВДокументе[0].КоличествоВРазмещении + Quantity;

	//+Кабанов А.В. 29.08.2025 # UT10-5361
	КоличествоСМаркой = ОстатокПоТоваруВДокументе[0].КоличествоТоваровСМаркировкой;
	
	Если Не КоличествоСМаркой = 0 Тогда
		
		Если  ОстатокПоТоваруВДокументе[0].КоличествоОтсканированныхМаркировок = 0 Тогда
			
			Ошибка = "Ошибка: Номенклатура со штрихкодом " + Barcode + " " + НайденныйТовар[0] .Наименование + " подлежит обязательной маркировке !";
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер размещения с проверкой остатков", Ошибка);				
			Возврат "НоменклатураСоШтрихкодомНеНайдена/НоменклатураПодлежитОбязательнойМаркировке:" + Ошибка;
			
		КонецЕсли;
		
		ОстатокПоТоваруВДокументе[0].КоличествоВДокументе = Мин(ОстатокПоТоваруВДокументе[0].КоличествоВДокументе , ОстатокПоТоваруВДокументе[0].КоличествоОтсканированныхМаркировок);		
		
		//Если (ОстатокПоТоваруВДокументе[0].КоличествоВДокументе - КоличествоНабрано) < 0 Тогда
		//	
		//	Ошибка = "Ошибка: По номенклатура со штрихкодом " + Barcode + " " + НайденныйТовар[0] .Наименование + " отсканированны не все марки !";		
		//	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер размещения с проверкой остатков", Ошибка);				
		//	Возврат "НоменклатураПодлежитОбязательнойМаркировке:" + Ошибка;		
		//	
		//КонецЕсли; 
		
	КонецЕсли;
	//-Кабанов А.В. 29.08.2025 # UT10-5361

	Если ОстатокПоТоваруВДокументе.Количество() = 0 Тогда
		
		Ошибка = "Ошибка: Номенклатура со штрихкодом " + Barcode + " " + НайденныйТовар[0] .Наименование + " в документе не найдена.";	
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер размещения с проверкой остатков", Ошибка);
		Возврат "НоменклатураСоШтрихкодомНеНайдена:" + Ошибка;		
		
	КонецЕсли; 
		
 	Если (ОстатокПоТоваруВДокументе[0].КоличествоВДокументе - КоличествоНабрано) < 0 Тогда
		
		ШаблонТекстаОшибки = "Уже набрано %1 из %2 (%3)" + Символы.ПС;
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "всего в поставке: %2"+ Символы.ПС;		
		ШаблонТекстаОшибки = ШаблонТекстаОшибки + "ПЫТАЕТЕСЬ ВЗЯТЬ 1 (%3)";

		Если ОстатокПоТоваруВДокументе[0].ТоварТребуетсяМаркировка Тогда
			
			КоличествоНеотсканированныхСМаркировок  = ОстатокПоТоваруВДокументе[0].КоличествоТоваровСМаркировкой - ОстатокПоТоваруВДокументе[0].КоличествоОтсканированныхМаркировок;
			
			Если КоличествоНеотсканированныхСМаркировок > 0 Тогда
				ШаблонТекстаОшибки = ШаблонТекстаОшибки + Символы.ПС + "Необходимо отсканировать %4 QR-код";	
			КонецЕсли;
			
		Иначе
			КоличествоНеотсканированныхСМаркировок = 0 ;			
		КонецЕсли;
		
		Ошибка  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекстаОшибки, 
		КоличествоНабрано,				
		ОстатокПоТоваруВДокументе[0].КоличествоВДокументе, 
		НайденныйТовар[0].ЕдИзмНаименование,
		КоличествоНеотсканированныхСМаркировок	
		);						
		
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер размещения с проверкой остатков", Ошибка);				
		Возврат "ПытаетсяВзятьБольшееКолво:" + Ошибка;		
		
	КонецЕсли; 
		
	ОбъектСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));
	
	Если ОбъектСсылка.ПолучитьОбъект() = Неопределено Тогда
		ОбъектСсылка = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));
	КонецЕсли;
	
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку( Новый УникальныйИдентификатор(GoodGUID));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.КодПроизводителя
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));	
	
	МЗ = РегистрыСведений.БуферАрмКладовщика.СоздатьМенеджерЗаписи();	
	МЗ.Объект = ОбъектСсылка;
	МЗ.UserId = UserIdСсылка;                      		
	МЗ.Номенклатура = НоменклатураСсылка;		
	МЗ.CreateDate = CreatedDate;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда                                                  
		
		МЗ.Quantity = МЗ.Quantity + Quantity;
		
		Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда
			МЗ.ВведеноВРучную = PutIntoManual;
		КонецЕсли; 
		
	Иначе
		
		МЗ.Объект = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;
		МЗ.CreateDate = CreatedDate;			
		МЗ.Номенклатура = НоменклатураСсылка;		
		МЗ.Barcode = Barcode;
		МЗ.Quantity = Quantity;
		МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;
		МЗ.Ячейка = ЯчейкаСсылка;
		МЗ.ВведеноВРучную = PutIntoManual;
		
	КонецЕсли;	
	
	МЗ.Записать();
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в РС БуферАРМКладовщика", 
	"ПТУ " + ОбъектСсылка.Номер + ", СклДок "+ Строка(ОбъектСсылка.НомерСкладскогоДокумента) + 
	" , Номенклатура " + Строка(НоменклатураСсылка.КодПроизводителя) + ", " + НоменклатураСсылка.Наименование);
	
	Возврат "Истина: " + Строка(КоличествоНабрано) + ", " +  
	Строка(ОстатокПоТоваруВДокументе[0].КоличествоВДокументе) + ", " + 
	Строка(ОстатокПоТоваруВДокументе[0].КоличествоВБуфере  + Quantity) + ", " +
	Строка(ОстатокПоТоваруВДокументе[0].КоличествоВРазмещении) + ", " + 
	Строка(Quantity) ;
	
КонецФункции

Функция ЗаписатьВБуферМаркировок(ObjectGUID , UserIdGUID , CreatedDate , GoodGUID , MarkData) Экспорт
	
	UserIdСсылка       = ПолучитьПользователя(UserIdGUID);
	ОбъектСсылка       = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));
	ДанныеМаркировки   = ХранилищеJSONВСтруктуру(MarkData);
	
	ШтрихКодМаркировкиКраткий = ДанныеМаркировки.ШтрихКодКраткий;
	ШтрихКодМаркировкиПолный  = ДанныеМаркировки.ШтрихКодПолный; 
	
	//проверяем в буфере маркировок
	ЗаросПоБуферуМаркировок = Новый Запрос;
	ЗаросПоБуферуМаркировок.Текст = 
	"ВЫБРАТЬ
	|	БуферАрмКладовщикаМаркировки.Номенклатура
	|ИЗ
	|	РегистрСведений.БуферАрмКладовщикаМаркировки КАК БуферАрмКладовщикаМаркировки
	|ГДЕ
	|	(БуферАрмКладовщикаМаркировки.Barcode = &ШтрихКодМаркировкиКраткий
	|			ИЛИ БуферАрмКладовщикаМаркировки.Barcode = &ШтрихКодМаркировкиПолный)";
	
	ЗаросПоБуферуМаркировок.УстановитьПараметр("ШтрихКодМаркировкиКраткий", ШтрихКодМаркировкиКраткий);
	ЗаросПоБуферуМаркировок.УстановитьПараметр("ШтрихКодМаркировкиПолный" , ШтрихКодМаркировкиПолный);
	
	//+Шульман А. 20.11.2025 #UT10-5516
	ЗаписьЖурналаРегистрации("ЗаписатьВБуферМаркировок", УровеньЖурналаРегистрации.Информация, , , 
	"ШтрихкодМаркировки Краткий = " + ШтрихКодМаркировкиКраткий +  ", ШтрихкодМаркировки Полный = " + ШтрихКодМаркировкиПолный);   
	//-Шульман А. 20.11.2025 #UT10-5516
	
	РезультатЗапроса = ЗаросПоБуферуМаркировок.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Ошибка = "Ошибка: Маркировка номенклатуры " + ШтрихКодМаркировкиКраткий + " для " + НоменклатураСсылка.Наименование + " уже была отсканированна.";	
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер маркировок", Ошибка);
		Возврат "МаркировкаСоШтрихКодомУжеОтсканированна:" + Ошибка;
		
	КонецЕсли;
	
	//Проверяем в справочнике 
	ЗапросПоСправочнику = Новый Запрос;
	ЗапросПоСправочнику.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ШтрихкодыНоменклатуры.Ссылка КАК ШтрихКодМаркировки
	|ИЗ
	|	Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|ГДЕ
	|	(ШтрихкодыНоменклатуры.КодМаркировки = &ШтрихКодМаркировкиКраткий
	|			ИЛИ ШтрихкодыНоменклатуры.КодМаркировки = &ШтрихКодМаркировкиПолный)";
	
	ЗапросПоСправочнику.УстановитьПараметр("ШтрихКодМаркировкиКраткий" , ШтрихКодМаркировкиКраткий);
	ЗапросПоСправочнику.УстановитьПараметр("ШтрихКодМаркировкиПолный"  , ШтрихКодМаркировкиПолный);
	
	РезультатЗапроса = ЗапросПоСправочнику.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		ВыборкаЗапроса.Следующий();
		мКодМаркировки = ВыборкаЗапроса.ШтрихКодМаркировки;
		
		//Проверяем в ПТУ
		ЗапросПоПТУ = Новый Запрос;
		ЗапросПоПТУ.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.НомерСтроки
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
		|ГДЕ
		|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка = &ОбъектСсылка
		|	И ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки = &КодМаркировки";
		
		ЗапросПоПТУ.УстановитьПараметр("ОбъектСсылка"  , ОбъектСсылка);
		ЗапросПоПТУ.УстановитьПараметр("КодМаркировки" , мКодМаркировки);
		
		РезультатЗапроса = ЗапросПоПТУ.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Ошибка = "Ошибка: Маркировка номенклатуры " + ШтрихКодМаркировкиКраткий + " для " + НоменклатураСсылка.Наименование + " уже внесена в ПТУ.";	
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записать в буфер маркировок", Ошибка);
			Возврат "МаркировкаСоШтрихКодомУжеВнесена:" + Ошибка;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	МЗ                  = РегистрыСведений.БуферАрмКладовщикаМаркировки.СоздатьМенеджерЗаписи();	
	МЗ.Объект           = ОбъектСсылка;
	МЗ.UserId           = UserIdСсылка;
	МЗ.CreateDate       = CreatedDate;			
	МЗ.Номенклатура     = НоменклатураСсылка;		
	МЗ.Barcode          = ШтрихКодМаркировкиКраткий;
	МЗ.BarcodeFull      = ШтрихКодМаркировкиПолный;  

	МЗ.Записать(); 
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Создана запись в РС БуферАрмКладовщикаМаркировки", 
	"ПТУ " + ОбъектСсылка.Номер + ", СклДок "+ Строка(ОбъектСсылка.НомерСкладскогоДокумента) + 
	" , Номенклатура " + Строка(НоменклатураСсылка.КодПроизводителя) + ", " + НоменклатураСсылка.Наименование);
	
	Возврат "Истина";	
	//-Кабанов А.В. 05.09.2025 # UT10-5361	
КонецФункции

Функция FindGoodByBarcodeWithRemains(Barcode, GoodGUID, UserIDGUID) Экспорт
	
	НоменклатураТЗ = FindGoodByBarcode(UserIDGUID, Barcode, "", "", GoodGUID, Истина);
	ОстаткиНоменклатурыТЗ = ПолучитьОстаткиНоменклатуруПоТаблицеЗначений(НоменклатураТЗ, Истина);
	
	МассивВременный = ТаблицуВМассив(ОстаткиНоменклатурыТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	UserIDСсылка = ПолучитьПользователя(UserIDGUID);
	ЗаписатьЛог(UserIDСсылка, ТекущаяДата(), "", 
	"Найти товар по штрихкоду с остатками", "Штрихкод " + Barcode + "; Товар гуид " + GoodGUID);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокГрузовыхМест(DocumentGUID, GetAllRecords, UserIdGUID) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки,
	|	ЗаданиеНаДоставкуДоставка.Ссылка.Маршрут,
	|	ЗаданиеНаДоставкуДоставка.Ссылка.Номер КАК НомерЗаданияНаДоставку,
	|	ЗаданиеНаДоставкуДоставка.Контрагент.Наименование КАК Контрагент
	|ПОМЕСТИТЬ ЗаданиеНаДоставку
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &ДокСсылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки,
	|	ЗаданиеНаДоставкуДоставка.Ссылка.Маршрут,
	|	ЗаданиеНаДоставкуДоставка.Ссылка.Номер,
	|	ЗаданиеНаДоставкуДоставка.Контрагент.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрузовоеМесто.Ссылка КАК ГрузовоеМестоГУИД,
	|	ГрузовоеМесто.Номер КАК ГрузовоеМестоНомер,
	|	ЗаданиеНаДоставку.Маршрут.Наименование КАК Маршрут,
	|	""&ДокСсылка&"" КАК ЗаданиеНаДоставкуГУИД,
	|	ЗаданиеНаДоставку.НомерЗаданияНаДоставку,
	|	ГрузовоеМесто.Погружено КАК Погружено,
	|	ЗаданиеНаДоставку.Контрагент,
	|	ГрузовоеМесто.ШтрихкодГрузовогоМеста КАК ШтрихкодГрузовогоМеста,
	|	ВЫБОР
	|		КОГДА ГрузовоеМесто.ШтрихкодГрузовогоМеста = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НетШтрихкодаГМ
	|ИЗ
	|	Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|		ПО ГрузовоеМесто.Сборка = ЗаданиеНаДоставку.ДокументСборки
	|ГДЕ
	|	(НЕ &GetAllRecords
	|				И ГрузовоеМесто.Погружено = ЛОЖЬ
	|			ИЛИ &GetAllRecords)
	|	И ГрузовоеМесто.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка,
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Номер,
	|	ЗаданиеНаДоставку.Маршрут.Наименование,
	|	""&ДокСсылка&"",
	|	ЗаданиеНаДоставку.НомерЗаданияНаДоставку,
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Погружено,
	|	ЗаданиеНаДоставку.Контрагент,
	|	СлужебнаяЗапискаТранспортныеЕдиницы.Грузоместо,
	|	ВЫБОР
	|		КОГДА СлужебнаяЗапискаТранспортныеЕдиницы.Грузоместо = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СлужебнаяЗаписка.ТранспортныеЕдиницы КАК СлужебнаяЗапискаТранспортныеЕдиницы
	|		ПО ЗаданиеНаДоставку.ДокументСборки = СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка
	|ГДЕ
	|	(НЕ &GetAllRecords
	|				И СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Погружено = ЛОЖЬ
	|			ИЛИ &GetAllRecords)
	|	И СлужебнаяЗапискаТранспортныеЕдиницы.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ТранспортнаяЕдиница,
	|	ВложенныйЗапрос.ТранспортнаяЕдиница.Номер,
	|	ЗаданиеНаДоставку.Маршрут.Наименование,
	|	""&ДокСсылка&"",
	|	ЗаданиеНаДоставку.НомерЗаданияНаДоставку,
	|	ВложенныйЗапрос.ТранспортнаяЕдиница.Погружено,
	|	ЗаданиеНаДоставку.Контрагент,
	|	ВложенныйЗапрос.ТранспортнаяЕдиница.Штрихкод,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ТранспортнаяЕдиница.Штрихкод = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	ЗаданиеНаДоставку КАК ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница,
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка КАК Объединение
	|		ИЗ
	|			Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
	|		ГДЕ
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В
	|					(ВЫБРАТЬ
	|						ЗаданиеНаДоставку.ДокументСборки
	|					ИЗ
	|						ЗаданиеНаДоставку)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.ТранспортнаяЕдиница,
	|			ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка) КАК ВложенныйЗапрос
	|		ПО ЗаданиеНаДоставку.ДокументСборки = ВложенныйЗапрос.Объединение
	|ГДЕ
	|	(НЕ &GetAllRecords
	|				И ВложенныйЗапрос.ТранспортнаяЕдиница.Погружено = ЛОЖЬ
	|			ИЛИ &GetAllRecords)
	|	И ВложенныйЗапрос.ТранспортнаяЕдиница.Проведен" ;

	ДокСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДокСсылка&", "" + DocumentGUID + "");
	
	Запрос.УстановитьПараметр("GetAllRecords", GetAllRecords);
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);    
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	МассивСтрок = ТЗ.НайтиСтроки(Новый Структура("НетШтрихкодаГМ", Истина));    
	ДокГМ       = Документы.ГрузовоеМесто;
	
	Для каждого Запись Из МассивСтрок Цикл     
		
		ГМОбъект = Запись.ГрузовоеМестоГУИД.ПолучитьОбъект();
		
		Попытка
			
			ГМОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
			ГМОбъект.Записать(); 
			Запись.ШтрихкодГрузовогоМеста = ГМОбъект.ШтрихкодГрузовогоМеста;   
			
		Исключение
			Запись.ШтрихкодГрузовогоМеста = ДокГМ.ПолучитьШтрихкодГрузоместа(Запись.ГрузовоеМестоГУИД);                                                                                                   		
		КонецПопытки;
		
	КонецЦикла;    
	
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список грузовых мест ", "Задание на доставку " + ДокСсылка);
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьЯчейкиДляБлокировкиПриИнвентаризации(ObjectGUID, CellsXDTO, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	МассивЯчеек = СериализаторXDTO.ПрочитатьXDTO(CellsXDTO);
	
	МассивЯчеекСсылок = Новый Массив;
	
	Для каждого Элемент Из МассивЯчеек Цикл
		МассивЯчеекСсылок.Добавить(Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент)));
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ячейки.Ссылка
	|ПОМЕСТИТЬ ВТЯчейки
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|ГДЕ
	|	Ячейки.Ссылка В(&Ячейки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаЗаказовПокупателяЗаказано.Ячейка КАК ЯчейкаСборки,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|					ИЛИ НЕ СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|						И СборкаЗаказовПокупателяЗаказано.Ссылка.ПолностьюОткорректирована
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ПризнакИнвентаризации
	|ПОМЕСТИТЬ ВТСборки
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
	|	И СборкаЗаказовПокупателяЗаказано.Ячейка В(&Ячейки)
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.Дата >= &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказовПокупателяЗаказано.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЯчейки.Ссылка КАК СсылкаЯчейки,
	|	ВТЯчейки.Ссылка.Код КАК КодЯчейки,
	|	ISNULL(ВТСборки.ПризнакИнвентаризации, ИСТИНА) КАК ПризнакИнвентаризации
	|ИЗ
	|	ВТЯчейки КАК ВТЯчейки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСборки КАК ВТСборки
	|		ПО ВТЯчейки.Ссылка = ВТСборки.ЯчейкаСборки";
	
	Запрос.УстановитьПараметр("Ячейки", МассивЯчеекСсылок);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * 24 * 90);
	
	УстановитьПривилегированныйРежим(Истина);			
	ТЗ = Запрос.Выполнить().Выгрузить();	     
	УстановитьПривилегированныйРежим(Ложь);			
	
	МассивВременный = ТаблицуВМассив(ТЗ);                                    
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Проверить ячейки на возможность блокировки при инвентаризации", 
	СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивЯчеекСсылок)); 	
	
	ПараметрыОтбора = Новый Структура("ПризнакИнвентаризации", Ложь);	
	ТЗПризнакИнвент = ТЗ.Скопировать(ПараметрыОтбора);
	
	Если ТЗПризнакИнвент.Количество() = 0 Тогда
		УстановитьБлокирокуЯчеек(ObjectGUID, CellsXDTO, Истина, UserIdGUID)		 
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция УстановитьБлокирокуЯчеек(ObjectGUID, CellsXDTO, SetLock, UserIdGUID) Экспорт
	
	Результат = Ложь;
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);	
	ДокументСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));
	
	Если SetLock Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БуферАРМКладовщикаСтатусИнвентЯчеек.Объект,
		|	БуферАРМКладовщикаСтатусИнвентЯчеек.UserId
		|ИЗ
		|	РегистрСведений.БуферАРМКладовщикаСтатусИнвентЯчеек КАК БуферАРМКладовщикаСтатусИнвентЯчеек
		|ГДЕ
		|	БуферАРМКладовщикаСтатусИнвентЯчеек.Объект = &Объект
		|	И БуферАРМКладовщикаСтатусИнвентЯчеек.UserId = &UserId";
		
		Запрос.УстановитьПараметр("Объект", ДокументСсылка);
		Запрос.УстановитьПараметр("UserId", UserIdСсылка); 
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
	КонецЕсли; 
	
	МассивЯчеек = СериализаторXDTO.ПрочитатьXDTO(CellsXDTO);
	МассивЯчеекСсылок = Новый Массив;
	
	НачатьТранзакцию();
	
	Для каждого Элемент Из МассивЯчеек Цикл
		
		СсылкаЯчейка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент));
		МассивЯчеекСсылок.Добавить(СсылкаЯчейка);
		
		ЯчейкаОбъект = СсылкаЯчейка.ПолучитьОбъект();
		ЯчейкаОбъект.НеУчитыватьВОперативномУчете = SetLock;
		ЯчейкаОбъект.Записать();
		
		Если SetLock И РезультатЗапроса.Количество() = 0 Тогда
			
			МЗ = РегистрыСведений.БуферАРМКладовщикаСтатусИнвентЯчеек.СоздатьМенеджерЗаписи();	
			МЗ.Объект = ДокументСсылка;
			МЗ.UserId = UserIdСсылка;                      		
			МЗ.Ячейка = СсылкаЯчейка;	
			МЗ.Статус = Перечисления.СтатусЯчейкиИзЗаданияНаИнвентаризацию.НеНачат;			
			МЗ.CreateDate = ТекущаяДата();
			МЗ.Записать();
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если Не SetLock Тогда
		
		РС = РегистрыСведений.БуферАРМКладовщикаСтатусИнвентЯчеек.СоздатьНаборЗаписей();
		РС.Отбор.Объект.Установить(ДокументСсылка);
		РС.Отбор.UserId.Установить(UserIdСсылка);
		РС.Записать();
		
	КонецЕсли; 
	
	Результат = Истина;
	
	ЗафиксироватьТранзакцию();
	
	Если SetLock Тогда
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Заблокировать ячейки", 
		СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивЯчеекСсылок)); 			
	Иначе 
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Разблокировать ячейки", 
		СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(МассивЯчеекСсылок)); 							
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции

Функция ПолучитьСписокСборокДляЗаблокированнойЯчейки(CellGUID, UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);		
	ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку(Новый УникальныйИдентификатор(CellGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка КАК СборкаГУИД,
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Номер КАК СборкаНомер,
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Дата КАК СборкаДата,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка КАК ЯчейкаГУИД,
	|	СборкаЗаказовПокупателяЗаказано.Ячейка.Код КАК ЯчейкаКод,
	|	ВЫБОР
	|		КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|				ИЛИ НЕ СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|					И СборкаЗаказовПокупателяЗаказано.Ссылка.ПолностьюОткорректирована
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакИнвентаризации
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
	|	И СборкаЗаказовПокупателяЗаказано.Ячейка = &Ячейка
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.Дата >= &Дата
	|	И ВЫБОР
	|			КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|					ИЛИ НЕ СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|						И СборкаЗаказовПокупателяЗаказано.Ссылка.ПолностьюОткорректирована
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Ячейка", ЯчейкаСсылка);                                                                     	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата() - 3600 * 24 * 90);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();                 
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список сборок для заблокированной ячейки", ""); 	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСписокЗаданийНаИнвентаризацию(UserIdGUID) Экспорт
	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаИнвентаризацию.Ссылка КАК Ссылка,
	|	ЗаданиеНаИнвентаризацию.Номер КАК НомерДокумента,
	|	ЗаданиеНаИнвентаризацию.Дата КАК ДатаДокумента,
	|	ИнвентарЯчейки.ЯчейкаДляИнвентаризации.Ссылка КАК СсылкаЯчейки,
	|	ИнвентарЯчейки.ЯчейкаДляИнвентаризации.Код КАК КодЯчейки,
	|	ЗаданиеНаИнвентаризацию.Ответственный,
	|	ЗаданиеНаИнвентаризацию.РегламентноеЗадание
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ЗаданиеНаИнвентаризацию.ИнвентаризируемыеЯчейки КАК ИнвентарЯчейки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаИнвентаризацию КАК ЗаданиеНаИнвентаризацию
	|		ПО ИнвентарЯчейки.Ссылка = ЗаданиеНаИнвентаризацию.Ссылка
	|ГДЕ
	|	ЗаданиеНаИнвентаризацию.Ответственный = &Ответственный
	|	И ЗаданиеНаИнвентаризацию.ДатаВыполнения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И НЕ ЗаданиеНаИнвентаризацию.АРМКладовщика
	|	И НЕ ЗаданиеНаИнвентаризацию.ПометкаУдаления
	|	И ЗаданиеНаИнвентаризацию.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	КодЯчейки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ.РегламентноеЗадание = ИСТИНА
	|				ТОГДА 1
	|			КОГДА ВТ.РегламентноеЗадание = ЛОЖЬ
	|					И ЗаданНаИнвентТовары.Уровень ЕСТЬ NULL
	|				ТОГДА 1
	|			ИНАЧЕ ЗаданНаИнвентТовары.Уровень
	|		КОНЕЦ) КАК Уровень
	|ПОМЕСТИТЬ ВТУровень
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаИнвентаризацию.Товары КАК ЗаданНаИнвентТовары
	|		ПО ВТ.Ссылка = ЗаданНаИнвентТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Ссылка,
	|	ВТ.НомерДокумента,
	|	ВТ.ДатаДокумента,
	|	ВТ.СсылкаЯчейки,
	|	ВТ.КодЯчейки,
	|	ВТ.Ответственный,
	|	ВТ.РегламентноеЗадание,
	|	ВТУровень.Уровень
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ КАК ВТ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТУровень КАК ВТУровень
	|		ПО ВТ.Ссылка = ВТУровень.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ2.Ссылка,
	|	ВТ2.НомерДокумента,
	|	ВТ2.ДатаДокумента,
	|	ВТ2.СсылкаЯчейки,
	|	ВТ2.КодЯчейки,
	|	ВЫБОР
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.НеНачат)
	|			ТОГДА 0
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.ВРаботе)
	|			ТОГДА 1
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.Завершено)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СтатусРаботы,
	|	ВЫБОР
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.НеНачат)
	|			ТОГДА 1
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.ВРаботе)
	|			ТОГДА 0
	|		КОГДА БуферАРМКладовщикаСтатусИнвентЯчеек.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусЯчейкиИзЗаданияНаИнвентаризацию.Завершено)
	|			ТОГДА 2
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПризнакСортировки,
	|	ВТ2.Уровень
	|ИЗ
	|	ВТ2 КАК ВТ2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БуферАРМКладовщикаСтатусИнвентЯчеек КАК БуферАРМКладовщикаСтатусИнвентЯчеек
	|		ПО ВТ2.Ссылка = БуферАРМКладовщикаСтатусИнвентЯчеек.Объект
	|			И ВТ2.СсылкаЯчейки = БуферАРМКладовщикаСтатусИнвентЯчеек.Ячейка
	|			И ВТ2.Ответственный = БуферАРМКладовщикаСтатусИнвентЯчеек.UserId";
	Запрос.УстановитьПараметр("Ответственный", UserIdСсылка);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();                 
	УстановитьПривилегированныйРежим(Ложь);
	
	МассивВременный = ТаблицуВМассив(ТЗ);
	Результат = ДанныеВJSONХранилище(МассивВременный);
	
	ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Получить список заданий на инвентаризацию", ""); 	
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьЗаписьВБуферИнвентаризации(ObjectGUID, GoodGUID, UserIdGUID, CreatedDate, Barcode, Quantity, CellGUID, PutIntoManual) Экспорт
	
	ОбъектСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(ObjectGUID));	
	НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(GoodGUID));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.КодПроизводителя
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НоменклатураСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
	
	ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellGUID));
	
	Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
		UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку( Новый УникальныйИдентификатор(UserIdGUID));				
	Иначе 
		UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
	КонецЕсли;                                
	
	
	МЗ = РегистрыСведений.БуферАРМКладовщикаИнвентПоЯчейкам.СоздатьМенеджерЗаписи();	
	МЗ.Объект = ОбъектСсылка;
	МЗ.UserId = UserIdСсылка;                      		
	МЗ.Номенклатура = НоменклатураСсылка;		
	МЗ.Ячейка = ЯчейкаСсылка;	
	МЗ.CreateDate = CreatedDate;
	МЗ.Прочитать();
	
	Если МЗ.Выбран() Тогда
		
		МЗ.Quantity = МЗ.Quantity + Quantity;
		
		Если Не МЗ.ВведеноВРучную И PutIntoManual Тогда       
			МЗ.ВведеноВРучную = PutIntoManual;
		КонецЕсли; 
		
	Иначе
		
		МЗ.Объект = ОбъектСсылка;
		МЗ.UserId = UserIdСсылка;
		МЗ.CreateDate = CreatedDate;			
		МЗ.Ячейка = ЯчейкаСсылка;	
		МЗ.Номенклатура = НоменклатураСсылка; 		
		МЗ.Barcode = Barcode;
		МЗ.Quantity = Quantity;
		МЗ.КодПроизводителя = РезультатЗапроса.КодПроизводителя;		
		МЗ.ВведеноВРучную = PutIntoManual;
		
	КонецЕсли;	
	
	МЗ.Записать();                                                            
	// Установить статус ячейки
	МЗ = РегистрыСведений.БуферАРМКладовщикаСтатусИнвентЯчеек.СоздатьМенеджерЗаписи();	
	МЗ.Объект = ОбъектСсылка;
	МЗ.UserId = UserIdСсылка;                      		
	МЗ.Ячейка = ЯчейкаСсылка;	
	МЗ.Прочитать();
	МЗ.Статус = Перечисления.СтатусЯчейкиИзЗаданияНаИнвентаризацию.ВРаботе;
	МЗ.Записать();
	
	ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "БуферАРМКладовщикаИнвентПоЯчейкам" , 
	"ЗаданиеНаИнвентаризацию " + Строка(ОбъектСсылка.Номер) + "Номенклатура " + НоменклатураСсылка.КодПроизводителя + ", " + НоменклатураСсылка);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработатьГрузовоеМестоИзРазгрузкаАвто(DeliveryOrderGUID, DocumentGUID, CargoPlaceGUID, UserIdGUID, CreatedDate) Экспорт
	
	РазгрузкаАвтоСсылка = Документы.РазгрузкаАвто.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	ЗаданиеНаДоставкуСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DeliveryOrderGUID));
	ГрузовоеМестоСсылка = Документы.ГрузовоеМесто.ПолучитьСсылку(Новый УникальныйИдентификатор(CargoPlaceGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	МЗ = РегистрыСведений.БуферАРМКладовщикаРазгрузкаАвто.СоздатьМенеджерЗаписи();	
	
	МЗ.ЗаданиеНаДоставку = ЗаданиеНаДоставкуСсылка;
	МЗ.Объект = РазгрузкаАвтоСсылка;
	МЗ.ГрузовоеМесто = ГрузовоеМестоСсылка;
	МЗ.UserId = UserIdСсылка;                      		
	МЗ.CreatedDate = CreatedDate;                                  
	
	МЗ.Записать();                                                            
	
	ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "БуферАРМКладовщикаРазгрузкаАвто" , "РазгрузкаАвто " + РазгрузкаАвтоСсылка );
	
	Возврат Истина;
	
КонецФункции

Функция ПровестиДокументПТУТранзит(DocumentGUID, UserIdGUID, ComingDate, QuantityPlaces) Экспорт
	
	//+Кабанов А.В. 10.12.2024 # UT10-4950
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	ЭтоДокументПТУ = Истина;
	
	ДокументПТУ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Если ДокументПТУ.ПолучитьОбъект() = Неопределено Тогда
		
		ДокументПТУ = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
		ЭтоДокументПТУ = Ложь;
		
		Если ДокументПТУ.ПолучитьОбъект() = Неопределено Тогда
			
			ТекстОшибки = "Не найден документ ПТУ";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат.Вставить("КодРезультата", 1);
			Результат.Вставить("ЗначениеРезультата", "");
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ДокументПТУ.ПометкаУдаления Тогда
		
		ТекстОшибки = ?(ЭтоДокументПТУ,"ПТУ ","Поступление ТОХ ") + ДокументПТУ + " помечен на удаление. Обработка невозможна";
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 0);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		ДокОбъект = ДокументПТУ.ПолучитьОбъект();

		Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда 
			
			Если ДокОбъект.ТранзитнаяПоставка И ЗначениеЗаполнено(ComingDate) И ЗначениеЗаполнено(QuantityPlaces) Тогда
				
				ДокОбъект.ДатаПриходаТовараНаСклад = ?(НачалоДня(ComingDate) = НачалоДня(ТекущаяДата()), ТекущаяДата(), КонецДня(ComingDate));
				ДокОбъект.КоличествоПринятыхМест   = QuantityPlaces;
				
			КонецЕсли;
			
		КонецЕсли;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	
		ТекСтатусПриемки = МСКWEB.ЗначениеДопСвойства(ДокОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки); 
		
		Если ТекСтатусПриемки = Неопределено ИЛИ ТекСтатусПриемки = Перечисления.СтатусыПриемки.ВПути  Тогда
			
			Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") И ДокОбъект.ТранзитнаяПоставка И  ДокОбъект.Статус = Перечисления.СтатусыПТУ.КПоступлению Тогда 
				
				РезультатЗапроса = МСКWEB.ИзменитьСтатусПТУВУТ11(ДокОбъект.ИДДокументаВСмежнойБазе, Перечисления.СтатусыПТУ.ВРаботе, 
				                   ДокОбъект.ДатаПриходаТовараНаСклад, ДокОбъект.КоличествоПринятыхМест); 
				
				Если РезультатЗапроса.Результат Тогда
					
					ДокОбъект.Статус = Перечисления.СтатусыПТУ.ВРаботе;					
					
				Иначе
					
					ТекстОшибки = "Не удалось передать статус транзита в УТ 11 по " + ДокОбъект.Ссылка + ". Повторите попытку."; 
					
					ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка передачи статуса UT11_SetStatusPTU по " 
					+ ТекстОшибки + Символы.ПС + СокрЛП(РезультатЗапроса.ТекстОшибки));

					Результат.Вставить("Ошибка", ТекстОшибки);
					Результат.Вставить("КодРезультата", 0);
					Результат.Вставить("ЗначениеРезультата", "");
					Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//+Белов А. 01.06.2026 #UT10-5893
			Если ЭтоДокументПТУ Тогда

				Если Константы.ПроверкаПТУВЧЗ.Получить() И Документы.ПоступлениеТоваровУслуг.НужнаПроверкаВЧЗ(ДокОбъект.Ссылка) Тогда
					МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.НаПроверкеВЧЗ);					
				Иначе
					МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ПоступилНаСклад);
				КонецЕсли;
				
			Иначе	
				//-Белов А. 01.06.2026 #UT10-5893
				МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ПоступилНаСклад); 
			КонецЕсли;
			
		КонецЕсли;
		
		ДокОбъект.Комментарий = СокрЛП(ДокОбъект.Комментарий) + " Проведен с ТСД " + СокрЛП(UserIdСсылка.Наименование) + " " + Формат(ТекущаяДата(), "ДЛФ=") + ".";
		
        УстановитьПривилегированныйРежим(Истина);
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		УстановитьПривилегированныйРежим(Ложь);

		ТекВремяПоступления = МСКWEB.ЗначениеДопСвойства(ДокОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПоступления); 
		
		Если ТекВремяПоступления = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекВремяПоступления)  Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПоступления, ТекущаяДата());
		КонецЕсли;

	Исключение      
		
		ТекстОшибки = ?(ЭтоДокументПТУ, "ПТУ ", "Поступление ТОХ ") + ДокументПТУ + " невозможно записать. Обработка невозможна.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 2);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецПопытки; 
	
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
	Возврат Результат;

	//-Кабанов А.В. 10.12.2024 # UT10-4950
КонецФункции

Функция ПровестиДокументПТУ(DocumentGUID, UserIdGUID) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	ЭтоДокументПТУ = Истина;
	
	ДокументПТУ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	Если ДокументПТУ.ПолучитьОбъект() = Неопределено Тогда
		
		ДокументПТУ = Документы.ПоступлениеТоваровНаОтветственноеХранение.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));
		ЭтоДокументПТУ = Ложь;
		
		Если ДокументПТУ.ПолучитьОбъект() = Неопределено Тогда
			
			ТекстОшибки = "Не найден документ ПТУ";				
			Результат.Вставить("Ошибка", ТекстОшибки);
			Результат.Вставить("КодРезультата", 1);
			Результат.Вставить("ЗначениеРезультата", "");
			Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ДокументПТУ.ПометкаУдаления Тогда
		
		ТекстОшибки = ?(ЭтоДокументПТУ,"ПТУ ","Поступление ТОХ ") + ДокументПТУ + " помечен на удаление. Обработка невозможна";
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 0);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецЕсли;
	
	Попытка
		
		ДокОбъект = ДокументПТУ.ПолучитьОбъект();
		ДокОбъект.Комментарий = СокрЛП(ДокОбъект.Комментарий)+" Проведен с ТСД "+СокрЛП(UserIdСсылка.Наименование) +" "+Формат(ТекущаяДата(),"ДЛФ=")+".";
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//+Кабанов А.В. 13.11.2024 # UT10-4873
		ТекСтатусПриемки = МСКWEB.ЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки); 
		
		Если ТекСтатусПриемки = Неопределено ИЛИ ТекСтатусПриемки = Перечисления.СтатусыПриемки.ВПути Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ПоступилНаСклад);			
		КонецЕсли;
		//-Кабанов А.В. 13.11.2024 # UT10-4873
		
		//+Кабанов А.В. 03.12.2024 # UT10-4948
		ТекВремяПоступления = МСКWEB.ЗначениеДопСвойства(ДокОбъект.Ссылка,ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПоступления); 
		
		Если ТекВремяПоступления = Неопределено ИЛИ НЕ ЗначениеЗаполнено(ТекВремяПоступления)  Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(ДокОбъект.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.ВремяПоступления, ТекущаяДата());
		КонецЕсли;
		//-Кабанов А.В. 03.12.2024 # UT10-4948

	Исключение      
		
		ТекстОшибки = ?(ЭтоДокументПТУ,"ПТУ ","Поступление ТОХ ")+ ДокументПТУ + " невозможно записать. Обработка невозможна.";				
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат.Вставить("КодРезультата", 2);
		Результат.Вставить("ЗначениеРезультата", "");
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецПопытки; 
	
	Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
	Возврат Результат;
	
КонецФункции

Функция ОбработатьГрузовоеМестоИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UnloadAutoGUID, CargoPlaceGUID, UserIdGUID, CreatedDate) Экспорт
	
	ЗаданиеНаДоставкуСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DeliveryOrderGUID));
	РазгрузкаАвтоСсылка = Документы.РазгрузкаАвто.ПолучитьСсылку(Новый УникальныйИдентификатор(UnloadAutoGUID));	
	ГрузовоеМестоСсылка = Документы.ГрузовоеМесто.ПолучитьСсылку(Новый УникальныйИдентификатор(CargoPlaceGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	МЗ = РегистрыСведений.БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.СоздатьМенеджерЗаписи();	
	
	МЗ.ЗаданиеНаДоставку = ЗаданиеНаДоставкуСсылка;
	МЗ.РазгрузкаАвто     = РазгрузкаАвтоСсылка;
	МЗ.ГрузовоеМесто     = ГрузовоеМестоСсылка;
	МЗ.UserId            = UserIdСсылка;                      		
	МЗ.DateCreated       = CreatedDate;
	
	МЗ.Записать();                                                            
	
	ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут", "РазгрузкаАвто " + РазгрузкаАвтоСсылка );
	
	Возврат Истина;
	
КонецФункции

Функция ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвто(DeliveryOrderGUID, UserIdGUID, StoreKeeperGUID) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	ЗаданиеНаДоставкуСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DeliveryOrderGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	КладовщикСсылка = ПолучитьПользователя(StoreKeeperGUID);
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка КАК Ссылка,
	|	РазгрузкаАвтоГрузовыеМеста.НомерСтроки,
	|	РазгрузкаАвтоГрузовыеМеста.ГрузовоеМесто,
	|	РазгрузкаАвтоГрузовыеМеста.ДатаПереноса,
	|	РазгрузкаАвтоГрузовыеМеста.РТУ,	
	|	ВЫБОР
	|		КОГДА БуферАРМКладовщикаРазгрузкаАвто.ГрузовоеМесто ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПереданоНаСклад,
	|	РазгрузкаАвтоГрузовыеМеста.ПринятоСкладом
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БуферАРМКладовщикаРазгрузкаАвто КАК БуферАРМКладовщикаРазгрузкаАвто
	|		ПО РазгрузкаАвтоГрузовыеМеста.Ссылка = БуферАРМКладовщикаРазгрузкаАвто.Объект
	|			И РазгрузкаАвтоГрузовыеМеста.ГрузовоеМесто = БуферАРМКладовщикаРазгрузкаАвто.ГрузовоеМесто
	|			И РазгрузкаАвтоГрузовыеМеста.Ссылка.Водитель = БуферАРМКладовщикаРазгрузкаАвто.UserId
	|ГДЕ
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И РазгрузкаАвтоГрузовыеМеста.Ссылка.Водитель = &Водитель
	|	И РазгрузкаАвтоГрузовыеМеста.Ссылка.Проведен
	|	И РазгрузкаАвтоГрузовыеМеста.Ссылка.ГМПринял = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.РазгрузкаАвто,
	|	РегистрСведений.БуферАРМКладовщикаРазгрузкаАвто
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставкуСсылка);
	Запрос.УстановитьПараметр("Водитель", UserIdСсылка);
	
	ВыборкаРазгрузкаАвто = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Попытка
		
		Пока ВыборкаРазгрузкаАвто.Следующий() Цикл
			
			РазгрузкаАвтоСсылка = ВыборкаРазгрузкаАвто.Ссылка;
			РазгрузкаАвтоОбъект = РазгрузкаАвтоСсылка.ПолучитьОбъект();
			РазгрузкаАвтоОбъект.ГМПринял = КладовщикСсылка;
			
			РазгрузкаАвтоОбъект.ГрузовыеМеста.Очистить();
			
			ВыборкаГрузовыеМеста = ВыборкаРазгрузкаАвто.Выбрать();
			
			Пока ВыборкаГрузовыеМеста.Следующий() Цикл
				
				Запись = РазгрузкаАвтоОбъект.ГрузовыеМеста.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаГрузовыеМеста);
				
			КонецЦикла; 
			
			РазгрузкаАвтоОбъект.Записать();
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ разгрузка авто (Передано на склад водителем)", Строка(РазгрузкаАвтоОбъект.Номер)); 			
			
			РазгрузкаАвтоОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Проведен документ разгрузка авто (Передано на склад водителем)", Строка(РазгрузкаАвтоОбъект.Номер)); 			
			
			РС = РегистрыСведений.БуферАРМКладовщикаРазгрузкаАвто.СоздатьНаборЗаписей();
			РС.Отбор.ЗаданиеНаДоставку.Установить(ЗаданиеНаДоставкуСсылка);
			РС.Отбор.UserId.Установить(UserIdСсылка);
			РС.Отбор.Объект.Установить(РазгрузкаАвтоСсылка);
			РС.Записать();			
			
		КонецЦикла; 	
		
		ЗафиксироватьТранзакцию();
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		ОтменитьТранзакцию();					
		ТекстОшибки = "Ошибка при записи/проведение документа в 1С: " + ЗаданиеНаДоставкуСсылка + " " + ОписаниеОшибки() + ".";				
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", ТекстОшибки, Строка(РазгрузкаАвтоОбъект.Номер)); 			
		
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецПопытки; 
	
КонецФункции

Функция ЗавершитьРазгрузкуГрузовыхМестИзРазгрузкаАвтоДляПостановкиНаМаршрут(DeliveryOrderGUID, UserIdGUID) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Ошибка", "");
	
	ЗаданиеНаДоставкуСсылка = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(DeliveryOrderGUID));
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);
	
	//+Гавриленков В. 05.04.2025 #UT10-5178 В запрос добавлено поле DateCreated
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка КАК Ссылка,
	|	РазгрузкаАвтоГрузовыеМеста.НомерСтроки,
	|	РазгрузкаАвтоГрузовыеМеста.ГрузовоеМесто,
	|	РазгрузкаАвтоГрузовыеМеста.ДатаПереноса,
	|	ВЫБОР
	|		КОГДА БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.ГрузовоеМесто ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ПринятоСкладом,
	|	РазгрузкаАвтоГрузовыеМеста.ПереданоНаСклад,
	|	РазгрузкаАвтоГрузовыеМеста.РТУ,
	|	ЕСТЬNULL(БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.DateCreated, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПринятияСкладом
	|ИЗ
	|	Документ.РазгрузкаАвто.ГрузовыеМеста КАК РазгрузкаАвтоГрузовыеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут КАК БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут
	|		ПО РазгрузкаАвтоГрузовыеМеста.ГрузовоеМесто = БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.ГрузовоеМесто
	|			И РазгрузкаАвтоГрузовыеМеста.Ссылка = БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.РазгрузкаАвто
	|			И РазгрузкаАвтоГрузовыеМеста.Ссылка.ЗаданиеНаДоставку = БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.ЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку КАК БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку
	|		ПО РазгрузкаАвтоГрузовыеМеста.Ссылка = БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.РазгрузкаАвто
	|			И РазгрузкаАвтоГрузовыеМеста.Ссылка.ЗаданиеНаДоставку = БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.ЗаданиеНаДоставку
	|ГДЕ
	|	РазгрузкаАвтоГрузовыеМеста.Ссылка.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.UserIdCode = &Водитель
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Документ.РазгрузкаАвто
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставкуСсылка);
	Запрос.УстановитьПараметр("Водитель", UserIdСсылка);
	
	ВыборкаРазгрузкаАвто = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Попытка
		
		Пока ВыборкаРазгрузкаАвто.Следующий() Цикл
			
			НачатьТранзакцию();
			
			РазгрузкаАвтоСсылка = ВыборкаРазгрузкаАвто.Ссылка;
			РазгрузкаАвтоОбъект = РазгрузкаАвтоСсылка.ПолучитьОбъект();
			РазгрузкаАвтоОбъект.ГМПоложилНаМаршрут = UserIdСсылка;
			
			РазгрузкаАвтоОбъект.ГрузовыеМеста.Очистить();
			
			ВыборкаГрузовыеМеста = ВыборкаРазгрузкаАвто.Выбрать();
			
			Пока ВыборкаГрузовыеМеста.Следующий() Цикл
				
				Запись = РазгрузкаАвтоОбъект.ГрузовыеМеста.Добавить();				
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаГрузовыеМеста);
				
			КонецЦикла; 
			
			РазгрузкаАвтоОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			РазгрузкаАвтоОбъект.Записать();
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Записан документ разгрузка авто (Положено на маршрут кладовщиком)", Строка(РазгрузкаАвтоОбъект.Номер)); 			
			
			РС = РегистрыСведений.БуферАРМКладовщикаПостановкаГрузовыхМестНаМаршрут.СоздатьНаборЗаписей();
			РС.Отбор.ЗаданиеНаДоставку.Установить(ЗаданиеНаДоставкуСсылка);
			РС.Отбор.UserId.Установить(UserIdСсылка);
			РС.Отбор.РазгрузкаАвто.Установить(РазгрузкаАвтоСсылка);
			РС.Записать();			
			
			
			РС = РегистрыСведений.БуферАРККладовщикаБлокировкаМаршрутаЗаданияНаДоставку.СоздатьНаборЗаписей();
			РС.Отбор.ЗаданиеНаДоставку.Установить(ЗаданиеНаДоставкуСсылка);
			РС.Отбор.РазгрузкаАвто.Установить(РазгрузкаАвтоСсылка);
			РС.Отбор.UserIdCode.Установить(UserIdСсылка);
			РС.Записать();			
			
			ЗафиксироватьТранзакцию();
			
			/// Запись и проведение документа в раздельных транзакций
			НачатьТранзакцию();
			РазгрузкаАвтоОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "Проведен документ разгрузка авто (Положено на маршрут кладовщиком)", Строка(РазгрузкаАвтоОбъект.Номер)); 			
			ЗафиксироватьТранзакцию();
			/// Запись и проведение документа в раздельных транзакций
			
		КонецЦикла; 	
		
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	Исключение
		
		ОтменитьТранзакцию();					
		ТекстОшибки = "Ошибка при записи/проведение документа в 1С: " + ЗаданиеНаДоставкуСсылка + " " + ОписаниеОшибки() + ".";				
		ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", ТекстОшибки, Строка(РазгрузкаАвтоОбъект.Номер)); 			
		
		Результат.Вставить("Ошибка", ТекстОшибки);
		Результат = ARMStoreKeeper.ДанныеВJSONХранилище(Результат);
		Возврат Результат;
		
	КонецПопытки; 
	
КонецФункции

Функция УстановитьСтатусИнвентаризируемойЯчейки(UserIdGUID, DocumentGUID, CellGUID, StatusId) Экспорт
	
	ОбъектСсылка = Документы.ЗаданиеНаИнвентаризацию.ПолучитьСсылку(Новый УникальныйИдентификатор(DocumentGUID));	
	UserIdСсылка = ПолучитьПользователя(UserIdGUID);		
	ЯчейкаСсылка = Справочники.Ячейки.ПолучитьСсылку( Новый УникальныйИдентификатор(CellGUID));
	
	МЗ = РегистрыСведений.БуферАРМКладовщикаСтатусИнвентЯчеек.СоздатьМенеджерЗаписи();	
	МЗ.Объект = ОбъектСсылка;
	МЗ.UserId = UserIdСсылка;                      		
	МЗ.Ячейка = ЯчейкаСсылка;	
	МЗ.Прочитать();
	
	ИмяПеречисления = Метаданные.Перечисления["СтатусЯчейкиИзЗаданияНаИнвентаризацию"].ЗначенияПеречисления[StatusId].Имя;
	МЗ.Статус = Перечисления["СтатусЯчейкиИзЗаданияНаИнвентаризацию"][ИмяПеречисления];
	
	МЗ.CreateDate = ТекущаяДата();
	МЗ.Записать();
	
	ARMStoreKeeper.ЗаписатьЛог(UserIdСсылка, ТекущаяДата(), "", "УстановитьСтатусИнвентаризируемойЯчейки" , 
	"ЗаданиеНаИнвентаризацию " + Строка(ОбъектСсылка.Номер) + " ячейка " + ЯчейкаСсылка + " статус " + МЗ.Статус);
	
	Результат = Истина;
	
	Возврат Результат;                  
	
КонецФункции

Функция ТаблицуВМассив(Таблица) Экспорт
	
	МассивДанных = Новый Массив;                                            
	
	Для каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для каждого Колонка ИЗ Таблица.Колонки Цикл			
			
			Если Колонка.Имя = "СсылкаПТУ" Или Колонка.Имя = "СсылкаТовара"  Или Колонка.Имя = "СсылкаЯчейки" Или Колонка.Имя = "СсылкаЯчейкиКуда" 
				Или Колонка.Имя = "Владелец" Или Колонка.Имя = "Объект" Или Колонка.Имя = "ГрузовоеМестоГУИД" Или Колонка.Имя = "ДокументПТУСсылка"
				Или Колонка.Имя = "Документ" Или Колонка.Имя = "Ссылка" Или Колонка.Имя = "ГрузополучательГУИД" Или Колонка.Имя = "РазгрузкаАвтоГУИД"
				Или Колонка.Имя = "ЗаданиеНаДоставкуГУИД" Или Колонка.Имя = "ФизическоеЛицоГУИД" Или Колонка.Имя = "МаршрутГУИД" Или Колонка.Имя = "СборкаГУИД"
				Или Колонка.Имя = "ЯчейкаГУИД"
				ИЛИ Колонка.Имя = "ЕдиницаИзмеренияСсылка"
				Или Колонка.Имя = "СсылкаСлужебнаяЗаписка" 
				Или Колонка.Имя = "СсылкаОбъединение"
				//+Кабанов А.В. 03.09.2025 # UT10-5361
				ИЛИ Колонка.Имя = "КодМаркировки"
				//-Кабанов А.В. 03.09.2025 # UT10-5361
				Тогда
				
				Попытка
					СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя].УникальныйИдентификатор()));	
				Исключение
					СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);    
				КонецПопытки; 				
				
			Иначе
				СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);				
			КонецЕсли; 
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;         
	
	Возврат МассивДанных;
	
КонецФункции

Функция ПолучитьТЗДляПТУ()
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(75, ДопустимаяДлина.Переменная);
	ОписаниеСтроки = Новый ОписаниеТипов("Строка" , , КвалификаторСтроки );
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);	
	ОписаниеДаты = Новый ОписаниеТипов("Дата", , , КвалификаторДаты);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("НомерДокумента", ОписаниеСтроки);
	ТЗ.Колонки.Добавить("НомерСкладскогоДокумента", ОписаниеСтроки);
	ТЗ.Колонки.Добавить("ДатаДокумента", ОписаниеДаты);
	ТЗ.Колонки.Добавить("Ссылка", ОписаниеСтроки);
	ТЗ.Колонки.Добавить("КоличествоСтрок", ОписаниеСтроки); 
	ТЗ.Колонки.Добавить("ЕстьСтрокиВБуфереКладовщика", Новый ОписаниеТипов("Булево")); 
	
	Возврат ТЗ;
	
КонецФункции

Функция ЗаписатьЛог(UserId, Дата, TSD, Заголовок, Сообщение) Экспорт
	
	Если Константы.ЗаписьЛоговАРМКладовщика.Получить() Тогда
		
		МЗ = РегистрыСведений.ЛогАРМКладовщика.СоздатьМенеджерЗаписи();	
		МЗ.UserId = UserId;                       
		МЗ.Дата = Дата;
		МЗ.TSD = TSD;
		МЗ.Заголовок = Заголовок;
		МЗ.Сообщение = Сообщение;
		МЗ.Записать();	
		
	КонецЕсли; 
	
КонецФункции                                          

Функция ПолучитьПользователя(UserIdGUID) Экспорт
	
	Если UserIdGUID <> Неопределено И ЗначениеЗаполнено(UserIdGUID) Тогда
		UserIdСсылка = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(UserIdGUID));				
	Иначе 
		UserIdСсылка = Справочники.ФизическиеЛица.ПустаяСсылка();			
	КонецЕсли;                                                                                    	
	
	Возврат UserIdСсылка;
	
КонецФункции


#Область Сериализации
Функция Сериализовать(ОбъектСериализации)
	
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	МойXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	
	Возврат МойXML.Закрыть();
	
КонецФункции

Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();
	
	Возврат ТЗ
	
КонецФункции
#КонецОбласти


#Область JSON
Функция ДанныеВJSONХранилище(Данные) Экспорт 
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции                                                

Функция ХранилищеJSONВСтруктуру(Данные) Экспорт
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции
#КонецОбласти


#Область ВспомогательныеФункции

// Функция возвращает результат проверки строки на предмет соответствия
// штрихкоду формата EAN13.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Проверяемый штрихкод.
//
// Возвращаемое значение:
//  <Булево> - Результат проверки.
//
Функция ТипШтрихкодаEAN13ТО(Штрихкод) Экспорт
	
	Результат = (СтрДлина(Штрихкод) = 13
	И КонтрольныйСимволEAN13ТО(Штрихкод) = Прав(Штрихкод, 1));
	
	Возврат Результат;
	
КонецФункции // ТипШтрихкодаEAN13ТО()

// Функция возвращает контрольный символ штрихкода EAN13.
//
// Параметры:
//  Штрихкод - <Строка>
//           - Неполный штрихкод (12 символов), для которого вычисляется
//             контрольный 13-й символ.
//
// Возвращаемое значение:
//  <Строка> - Контрольный символ EAN13.
//  
Функция КонтрольныйСимволEAN13ТО(Штрихкод) Экспорт
	
	Результат   = "";
	Сумма       = 0;
	Коэффициент = 1;
	
	Индекс = Неопределено;
	
	Для Индекс = 1 По 12 Цикл
		
		КодСимв     = КодСимвола(Штрихкод, Индекс);
		Сумма       = Сумма + Коэффициент * (КодСимв - 48);
		Коэффициент = 4 - Коэффициент;
		
	КонецЦикла;
	
	Сумма     = (10 - Сумма % 10) % 10;
	Результат = Символ(Сумма + 48);
	
	Возврат Результат;
	
КонецФункции // КонтрольныйСимволEAN13ТО()

//Транслитерация текста
// Параметры
//   Текст       - Строка, строка для преобразования
// Возвращаемое значение:
//   преобразованная строка
Функция Транслит(Текст) 
	
	НовыйТекст = "";
	
	СЗСоответствиеБукв = Новый СписокЗначений;
	
	СЗСоответствиеБукв.Добавить("j","й");
	СЗСоответствиеБукв.Добавить("c","ц");
	СЗСоответствиеБукв.Добавить("u","у");
	СЗСоответствиеБукв.Добавить("k","к");
	СЗСоответствиеБукв.Добавить("e","е");
	СЗСоответствиеБукв.Добавить("n","н");
	СЗСоответствиеБукв.Добавить("g","г");
	СЗСоответствиеБукв.Добавить("sh","ш");
	СЗСоответствиеБукв.Добавить("sch","щ");
	СЗСоответствиеБукв.Добавить("z","з");
	СЗСоответствиеБукв.Добавить("h","х");
	СЗСоответствиеБукв.Добавить("#","ъ");
	СЗСоответствиеБукв.Добавить("f","ф");
	СЗСоответствиеБукв.Добавить("y","ы");
	СЗСоответствиеБукв.Добавить("v","в");
	СЗСоответствиеБукв.Добавить("a","а"); 
	СЗСоответствиеБукв.Добавить("p","п");
	СЗСоответствиеБукв.Добавить("r","р");
	СЗСоответствиеБукв.Добавить("o","о");
	СЗСоответствиеБукв.Добавить("l","л");
	СЗСоответствиеБукв.Добавить("d","д");
	СЗСоответствиеБукв.Добавить("zh","ж");
	СЗСоответствиеБукв.Добавить("je","э");
	СЗСоответствиеБукв.Добавить("ja","я");
	СЗСоответствиеБукв.Добавить("ch","ч"); 
	СЗСоответствиеБукв.Добавить("s","с");
	СЗСоответствиеБукв.Добавить("m","м");
	СЗСоответствиеБукв.Добавить("i","и");
	СЗСоответствиеБукв.Добавить("t","т");
	СЗСоответствиеБукв.Добавить("'","ь");
	СЗСоответствиеБукв.Добавить("b","б");
	СЗСоответствиеБукв.Добавить("ju","ю");
	СЗСоответствиеБукв.Добавить("jo","ё");
	
	СоответствиеБукв = Новый Соответствие;
	
	Для каждого ЭлементСписка из СЗСоответствиеБукв Цикл
		
		СоответствиеБукв.Вставить(ЭлементСписка.Значение,ЭлементСписка.Представление);
		СоответствиеБукв.Вставить(ЭлементСписка.Представление,ЭлементСписка.Значение);
		
	КонецЦикла;
	
	Для а=1 по СтрДлина(Текст) Цикл
		
		Соответствие1 = СоответствиеБукв[НРЕГ(Сред(Текст,а,1))];
		
		Если Соответствие1 =  Неопределено Тогда
			Соответствие1 = НРЕГ(Сред(Текст,а,1))
		КонецЕсли;
		
		НовыйТекст = НовыйТекст + Соответствие1;
		
	КонецЦикла;                 
	
	Возврат ВРЕГ(НовыйТекст);
	
КонецФункции

//Представление текста в другой раскладке клавиатуры
// Параметры
//   Текст       - Строка, строка для преобразования
// Возвращаемое значение:
//   преобразованная строка
Функция ВДругойРаскладкеКлавиатуры(Текст) 
	
	НовыйТекст= "";
	
	СЗСоответствиеБукв = Новый СписокЗначений;
	
	СЗСоответствиеБукв.Добавить("q","й");
	СЗСоответствиеБукв.Добавить("w","ц");
	СЗСоответствиеБукв.Добавить("e","у");
	СЗСоответствиеБукв.Добавить("r","к");
	СЗСоответствиеБукв.Добавить("t","е");
	СЗСоответствиеБукв.Добавить("y","н");
	СЗСоответствиеБукв.Добавить("u","г");
	СЗСоответствиеБукв.Добавить("i","ш");
	СЗСоответствиеБукв.Добавить("o","щ");
	СЗСоответствиеБукв.Добавить("p","з");
	СЗСоответствиеБукв.Добавить("[","х");
	СЗСоответствиеБукв.Добавить("]","ъ");
	СЗСоответствиеБукв.Добавить("a","ф");
	СЗСоответствиеБукв.Добавить("s","ы");
	СЗСоответствиеБукв.Добавить("d","в");
	СЗСоответствиеБукв.Добавить("f","а"); 
	СЗСоответствиеБукв.Добавить("g","п");
	СЗСоответствиеБукв.Добавить("h","р");
	СЗСоответствиеБукв.Добавить("j","о");
	СЗСоответствиеБукв.Добавить("k","л");
	СЗСоответствиеБукв.Добавить("l","д");
	СЗСоответствиеБукв.Добавить(";","ж");
	СЗСоответствиеБукв.Добавить("'","э");
	СЗСоответствиеБукв.Добавить("z","я");
	СЗСоответствиеБукв.Добавить("x","ч"); 
	СЗСоответствиеБукв.Добавить("c","с");
	СЗСоответствиеБукв.Добавить("v","м");
	СЗСоответствиеБукв.Добавить("b","и");
	СЗСоответствиеБукв.Добавить("n","т");
	СЗСоответствиеБукв.Добавить("m","ь");
	СЗСоответствиеБукв.Добавить(",","б");
	СЗСоответствиеБукв.Добавить(".","ю");
	СЗСоответствиеБукв.Добавить("`","ё");
	
	СоответствиеБукв = Новый Соответствие;
	
	Для каждого ЭлементСписка из СЗСоответствиеБукв Цикл
		
		СоответствиеБукв.Вставить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		СоответствиеБукв.Вставить(ЭлементСписка.Представление, ЭлементСписка.Значение);
		
	КонецЦикла;
	
	Для а=1 по СтрДлина(Текст) Цикл
		
		Соответствие1 = СоответствиеБукв[НРЕГ(Сред(Текст, а, 1))];
		
		Если Соответствие1 =  Неопределено Тогда
			Соответствие1 = НРЕГ(Сред(Текст, а, 1))
		КонецЕсли;
		
		НовыйТекст = НовыйТекст + Соответствие1;
		
	КонецЦикла;                 
	
	Возврат ВРЕГ(НовыйТекст);
	
КонецФункции

Функция ПреобразоватьДату(СтроковаяДата) Экспорт
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-", ""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":", "");
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T", "");
	Возврат Дата(СтроковаяДата);
	
КонецФункции

Функция ВыгрузитьВнешнююОбработкуНаСервер(НомерЗаписи) Экспорт
	
	Попытка	
		
		СпрЗапись = Справочники.ВнешниеОбработкиДляВерсионированияФункционала.НайтиПоКоду(НомерЗаписи, Истина);
		ДвоичныеДанные = СпрЗапись.ХранилищеВнешнейОбработки.Получить();
		ИмяФайла = КаталогВременныхФайлов() + СпрЗапись.Наименование + ".epf";
		
		ДвоичныеДанные.Записать(ИмяФайла);
		Результат = "Внешняя обработка сохранена на сервере 1С " + ИмяФайла;
		
	Исключение
		Результат = "Внешний файл не сохранен " + ОписаниеОшибки(); 
	КонецПопытки; 
	
	Возврат Результат;
	
КонецФункции

Функция РазностьВремени(Время1, Время2);
	
	Разность = Время1 - Время2;
	
	Если Разность > 0 Тогда
		
		Часов = Цел(Разность / 3600);
		Минут = Цел((Разность - Часов * 3600) / 60);
		
		Возврат Дата(1, 1, 1, Часов, Минут, 0);
		
	Иначе
		Возврат Дата(1,1,1,0,0,0);
	КонецЕсли;
	
КонецФункции

Функция МодульЧисла(Число)
	
	Возврат Макс(Число, -Число); 
	
КонецФункции
#КонецОбласти 

