Функция СоздатьКорректировкуПТУ(ПараметрыСтруктура) Экспорт
	//+Белов А. 22.10.2025 #UT10-5464
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	1 КАК Приоритет
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ИДДокументаВСмежнойБазе = &ИДДокументаВСмежнойБазе
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка,
	|	2
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.ИДДокументаВСмежнойБазе = &ИДДокументаВСмежнойБазе
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ИДДокументаВСмежнойБазе", ПараметрыСтруктура.ОснованиеГУИД);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда		
		ДокументОснование = Выборка.Ссылка;
	Иначе
		
		СтруктураВозврата.Сообщение = "Не найден документ основание";
		Возврат СтруктураВозврата;
		
	КонецЕсли;           
	
	Ссылка = ПолучитьКорректировкуПоИД(ПараметрыСтруктура.ГУИД);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Если НЕ Ссылка.Проведен Тогда
			
			Попытка
				
				Об = Ссылка.ПолучитьОбъект();
				Об.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				
				СФ = УчетНДС.НайтиПодчиненныйСчетФактуру(Об.Ссылка, "СчетФактураПолученный");
	
				Если Не ЗначениеЗаполнено(СФ) Тогда
					
					Попытка
						СоздатьСФПоКорректировке(Об.Ссылка, ПараметрыСтруктура)	
					Исключение
					    //ОписаниеОшибки()
					КонецПопытки;
					
				КонецЕсли;
				
			Исключение
				
				СтруктураВозврата.Результат = Ложь;
				СтруктураВозврата.Сообщение = ОписаниеОшибки(); 
				Возврат СтруктураВозврата;
				
			КонецПопытки;
			
		КонецЕсли;                           
		
		СтруктураВозврата.Результат = Истина;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	НДок = Документы.КорректировкаПоступления.СоздатьДокумент();
	НДок.Дата = ТекущаяДата();
	НДок.ВидОперации = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;  
	НДок.Заполнить(ДокументОснование);   
	НДок.ИДДокументаВСмежнойБазе = ПараметрыСтруктура.ГУИД;
	
	НДок.ОтражатьВБухгалтерскомУчете = Истина; 
	
	//+Гавриленков В. 22.01.2026 #UT10-5649
	
	////Для каждого Стр Из ПараметрыСтруктура.Товары Цикл
	////	
	////	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Стр.КодМДМ);
	////	Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Стр.Серия, Истина,, Номенклатура);
	////	
	////	СтрокаНоменклатуры = Неопределено;
	////	СтрокиПоиска = НДок.Товары.НайтиСтроки(Новый Структура("Номенклатура, Цена, СерияНоменклатуры", Номенклатура, Стр.Цена, Серия));
	////	
	////	Если СтрокиПоиска.Количество() > 0 Тогда
	////		СтрокаНоменклатуры = СтрокиПоиска[0];	
	////	Иначе
	////		
	////		СтрокиПоиска = НДок.Товары.НайтиСтроки(Новый Структура("Номенклатура, Цена", Номенклатура, Стр.Цена));	
	////		
	////		Если СтрокиПоиска.Количество() > 0 Тогда
	////			СтрокаНоменклатуры = СтрокиПоиска[0];	
	////		Иначе
	////			
	////			СтрокиПоиска = НДок.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура)); 
	////			
	////			Если СтрокиПоиска.Количество() > 0 Тогда
	////				СтрокаНоменклатуры = СтрокиПоиска[0];
	////			КонецЕсли;
	////			
	////		КонецЕсли;   
	////		
	////	КонецЕсли;
	////	
	////	Если СтрокаНоменклатуры <> Неопределено Тогда
	////		
	////		СтрокаНоменклатуры.Количество = Стр.Количество;
	////		СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Цена * СтрокаНоменклатуры.Количество;
	////		СтрокаНоменклатуры.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаНоменклатуры.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаНоменклатуры.СтавкаНДС));    
	////		СтрокаНоменклатуры.Заказ = Неопределено;
	////			
	////		СтрокаНоменклатуры.ОтражатьТоварныйУчет = Истина;
	////
	////	Иначе
	////		
	////		СтруктураВозврата.Сообщение = "Не найдена Номенклатура " + Стр.КодМДМ + " в поступлении";
	////		РезультатВыполнения = СтруктураВозврата;   
	////		Возврат РезультатВыполнения;
	////		
	////	КонецЕсли;
	////	
	////КонецЦикла; 
	
	НДокТовары = НДок.Товары.Выгрузить();  
	НДокТовары.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево")); 
	
	ИзмененияВнесены = Ложь;
	
	Для каждого Стр Из ПараметрыСтруктура.Товары Цикл
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Стр.КодМДМ);
		Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(Стр.Серия, Истина,, Номенклатура);
		
		СтрокаНоменклатуры = Неопределено;
		СтрокиПоиска = НДокТовары.НайтиСтроки(Новый Структура("Номенклатура, Цена, СерияНоменклатуры, Обработано", Номенклатура, Стр.Цена, Серия, Ложь));
		
		Если СтрокиПоиска.Количество() > 0 Тогда
			
			//СтрокаНоменклатуры = СтрокиПоиска[0];	
			
			КоличествоВсего = 0;
			Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
				КоличествоВсего = КоличествоВсего + СтрокаПоиска.Количество;
			КонецЦикла;
			
			Если Стр.Количество > КоличествоВсего Тогда
				
				КоличествоКУвеличению = Стр.Количество - КоличествоВсего; 
				
				СтрокаПоиска = СтрокиПоиска[0];
				
				СтрокаПоиска.Количество = СтрокаПоиска.Количество + КоличествоКУвеличению; 
				СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
				СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
				СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
				
				СтрокаПоиска.Обработано = Истина;
				ИзмененияВнесены = Истина;
				
			Иначе
				
				КоличествоКУменьшению = КоличествоВсего - Стр.Количество;
				
				Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
					
					Если КоличествоКУменьшению <= 0 Тогда
						Прервать;
					КонецЕсли;    
					
					Если СтрокаПоиска.Количество <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					ТекКоличество = Мин(КоличествоКУменьшению, СтрокаПоиска.Количество);
					
					КоличествоКУменьшению = КоличествоКУменьшению - ТекКоличество; 
					
					СтрокаПоиска.Количество = СтрокаПоиска.Количество - ТекКоличество; 
					СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
					СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
					Если СтрокаПоиска.Количество = 0 Тогда
						СтрокаПоиска.Заказ = Неопределено;
					КонецЕсли;
					СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
					
					СтрокаПоиска.Обработано = Истина;
					ИзмененияВнесены = Истина;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			СтрокиПоиска = НДокТовары.НайтиСтроки(Новый Структура("Номенклатура, Цена, Обработано", Номенклатура, Стр.Цена, Ложь));	
			
			Если СтрокиПоиска.Количество() > 0 Тогда
				//СтрокаНоменклатуры = СтрокиПоиска[0];	
				
				КоличествоВсего = 0;
				Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
					КоличествоВсего = КоличествоВсего + СтрокаПоиска.Количество;
				КонецЦикла;
				
				Если Стр.Количество > КоличествоВсего Тогда
					
					КоличествоКУвеличению = Стр.Количество - КоличествоВсего; 
					
					СтрокаПоиска = СтрокиПоиска[0];
					
					СтрокаПоиска.Количество = СтрокаПоиска.Количество + КоличествоКУвеличению; 
					СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
					СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
					СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
					
					СтрокаПоиска.Обработано = Истина;
					ИзмененияВнесены = Истина;
					
				Иначе
					
					КоличествоКУменьшению = КоличествоВсего - Стр.Количество;
					
					Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
						
						Если КоличествоКУменьшению <= 0 Тогда
							Прервать;
						КонецЕсли;    
						
						Если СтрокаПоиска.Количество <= 0 Тогда
							Продолжить;
						КонецЕсли;
						
						ТекКоличество = Мин(КоличествоКУменьшению, СтрокаПоиска.Количество);
						
						КоличествоКУменьшению = КоличествоКУменьшению - ТекКоличество; 
						
						СтрокаПоиска.Количество = СтрокаПоиска.Количество - ТекКоличество; 
						СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
						СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
						Если СтрокаПоиска.Количество = 0 Тогда
							СтрокаПоиска.Заказ = Неопределено;
						КонецЕсли;
						СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
						
						СтрокаПоиска.Обработано = Истина;
						ИзмененияВнесены = Истина;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				СтрокиПоиска = НДокТовары.НайтиСтроки(Новый Структура("Номенклатура, Обработано", Номенклатура, Ложь)); 
				
				Если СтрокиПоиска.Количество() > 0 Тогда
					//СтрокаНоменклатуры = СтрокиПоиска[0];  
					
					КоличествоВсего = 0;
					Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
						КоличествоВсего = КоличествоВсего + СтрокаПоиска.Количество;
					КонецЦикла;
					
					Если Стр.Количество > КоличествоВсего Тогда
						
						КоличествоКУвеличению = Стр.Количество - КоличествоВсего; 
						
						СтрокаПоиска = СтрокиПоиска[0];
						
						СтрокаПоиска.Количество = СтрокаПоиска.Количество + КоличествоКУвеличению; 
						СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
						СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
						СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
						
						СтрокаПоиска.Обработано = Истина;
						ИзмененияВнесены = Истина;
						
					Иначе
						
						КоличествоКУменьшению = КоличествоВсего - Стр.Количество;
						
						Для Каждого СтрокаПоиска Из СтрокиПоиска Цикл
							
							Если КоличествоКУменьшению <= 0 Тогда
								Прервать;
							КонецЕсли;    
							
							Если СтрокаПоиска.Количество <= 0 Тогда
								Продолжить;
							КонецЕсли;
							
							ТекКоличество = Мин(КоличествоКУменьшению, СтрокаПоиска.Количество);
							
							КоличествоКУменьшению = КоличествоКУменьшению - ТекКоличество; 
							
							СтрокаПоиска.Количество = СтрокаПоиска.Количество - ТекКоличество; 
							СтрокаПоиска.Сумма = СтрокаПоиска.Цена * СтрокаПоиска.Количество;
							СтрокаПоиска.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаПоиска.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаПоиска.СтавкаНДС));    
							Если СтрокаПоиска.Количество = 0 Тогда
								СтрокаПоиска.Заказ = Неопределено;
							КонецЕсли;
							СтрокаПоиска.ОтражатьТоварныйУчет = Истина;
							
							СтрокаПоиска.Обработано = Истина;
							ИзмененияВнесены = Истина;
							
						КонецЦикла;
					
					КонецЕсли; 
					
				КонецЕсли;
				
			КонецЕсли;   
			
		КонецЕсли; 
		
		Если Не ИзмененияВнесены Тогда
			
			СтруктураВозврата.Сообщение = "Не найдена Номенклатура " + Стр.КодМДМ + " в поступлении";
			РезультатВыполнения = СтруктураВозврата;   
			Возврат РезультатВыполнения;
			
		КонецЕсли;
		
	//	Если СтрокаНоменклатуры <> Неопределено Тогда
	//		
	//		СтрокаНоменклатуры.Количество = Стр.Количество;
	//		СтрокаНоменклатуры.Сумма = СтрокаНоменклатуры.Цена * СтрокаНоменклатуры.Количество;
	//		СтрокаНоменклатуры.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(СтрокаНоменклатуры.Сумма, НДок.УчитыватьНДС, НДок.СуммаВключаетНДС, УчетНДС.ПолучитьСтавкуНДС(СтрокаНоменклатуры.СтавкаНДС));    
	//		СтрокаНоменклатуры.Заказ = Неопределено;
	//			
	//		СтрокаНоменклатуры.ОтражатьТоварныйУчет = Истина;
	//		
	//		СтрокиПоиска[0].Обработано = Истина;
	//
	//	Иначе
	//		
	//		Сообщить("2, Не найдена Номенклатура " + Стр.КодМДМ + " в поступлении");
	//		Возврат;
	//		
	//	КонецЕсли;
		
	КонецЦикла;
	
	НДок.Товары.Очистить();
	НДок.Товары.Загрузить(НДокТовары);
	//-Гавриленков В. 22.01.2026 #UT10-5649 	
	
	Попытка
		
		НачатьТранзакцию();
		НДок.Записать(РежимЗаписиДокумента.Проведение); 	
		
		СоздатьСФПоКорректировке(НДок.Ссылка, ПараметрыСтруктура);
		
		СтруктураВозврата.Результат = Истина; 
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Попытка
			НДок.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки;
		
		СтруктураВозврата.Сообщение = "Возникла ошибка при проведении документов: " + ОписаниеОшибки();
		
	КонецПопытки;
		
	Возврат СтруктураВозврата;
	
	//-Белов А. 22.10.2025 #UT10-5464
КонецФункции

Процедура СоздатьСФПоКорректировке(НДок, ПараметрыСтруктура)
	
	НСф = Документы.СчетФактураПолученный.СоздатьДокумент();
	НСф.Дата = ТекущаяДата();
	НСф.Заполнить(НДок.Ссылка);            
	НСф.НомерВходящегоДокумента = ПараметрыСтруктура.НомерСФ;
	НСф.ДатаВходящегоДокумента = XMLЗначение(Тип("Дата"), ПараметрыСтруктура.ДатаСФ);
	
	Если НСф.ДокументыОснования.Количество() > 0 Тогда
		
		СФ = УчетНДС.НайтиПодчиненныйСчетФактуру(НДок.ДокументПоступления, "СчетФактураПолученный");
		
		Если ЗначениеЗаполнено(СФ) Тогда
			
			НСф.ДокументыОснования[0].НомерИсходногоДокумента = СФ.НомерВходящегоДокумента;
			НСф.ДокументыОснования[0].ДатаИсходногоДокумента = СФ.ДатаВходящегоДокумента;
			
		Иначе
			
			НСф.ДокументыОснования[0].НомерИсходногоДокумента = НСф.НомерВходящегоДокумента;
			НСф.ДокументыОснования[0].ДатаИсходногоДокумента = НСф.ДатаВходящегоДокумента;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НСф.Записать(РежимЗаписиДокумента.Проведение);	
	
КонецПроцедуры

Функция ПолучитьКорректировкуПоИД(ИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаПоступления.Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|ГДЕ
	|	КорректировкаПоступления.ИДДокументаВСмежнойБазе = &ИДДокументаВСмежнойБазе
	|	И НЕ КорректировкаПоступления.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИДДокументаВСмежнойБазе", ИД);  
	
	Выборка = Запрос.Выполнить().Выбрать();                
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;                 
	
	Возврат Неопределено;
		
КонецФункции
