&НаКлиенте
Процедура ОтчетЗаявкиНаВозврат(Команда)
		
	ОтчетОбъект = Отчеты.ЗаявкиНаВозврат.Создать();
	СхемаКомпоновкиДанных = ОтчетОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");		
	ФормаНастройки = ОтчетОбъект.ПолучитьФормуНастроек();	
	
	ЗначениеВозврата = ФормаНастройки.ОткрытьМодально();	
	Если ЗначениеВозврата = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли; 

	//Очищаем поле табличного документа                           
	ФормаОтчета = ОтчетОбъект.ПолучитьФорму();	
	
	ДанныеРасшифровки = ФормаОтчета.ДанныеРасшифровки;
	Результат = ФормаОтчета.ЭлементыФормы.Результат;	
	Результат.Очистить();
	
	КомпоновщикНастроек = ОтчетОбъект.КомпоновщикНастроек;
	КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Создаем Макет КД
	КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Создаем Процесор КД	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;	
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);
	
	КомпоновщикНастроек.Инициализировать( Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);	
	
	
	ФормаОтчета.ДанныеРасшифровки = ДанныеРасшифровки;
	
	ФормаОтчета.Открыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтруктураПодчиненностиДокумента(Команда)

	Если Элементы.Список.ТекущаяСтрока = Неопределено тогда
		Возврат
	КонецЕсли;  	
	
	РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Элементы.Список.ТекущаяСтрока.Ссылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПолучитьСерверТО().ПодключитьКлиента(ЭтаФорма); 
	//+Марков И. 05.11.2025 #UT10-5494
	ШтрихкодЗакрываемогоДокумента = "";
	//-Марков И. 05.11.2025 #UT10-5494
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ПолучитьСерверТО().ОтключитьКлиента(ЭтаФорма);  
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//+Марков И. 05.11.2025 #UT10-5494
	Если НЕ ЗначениеЗаполнено(Данные) Тогда 
		Возврат; 
	КонецЕсли;
	
	Если Не СокрЛП(Источник) = "Вручную" Тогда 	
		
		Если ЗначениеЗаполнено(ШтрихкодЗакрываемогоДокумента) И ШтрихкодЗакрываемогоДокумента = Данные Тогда
		
			ШтрихкодЗакрываемогоДокумента = "";
			Возврат;
		
		КонецЕсли;
		
		Если Не ВводДоступен() Тогда
			Возврат;
		КонецЕсли;     
		
	КонецЕсли;
	//-Марков И. 05.11.2025 #UT10-5494
	
	ДокЗаявка = Неопределено;
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ЗаявкаНаВозврат.ПустаяСсылка"));   
	МассивСсылок = ШтрихкодированиеПечатныхФорм.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Данные, Менеджеры);
	
	Если НЕ МассивСсылок.Количество() = 0  Тогда
		
		ДокЗаявка = МассивСсылок[0];  
		
		Если ДокЗаявка.Статус = "Отказ в возврате" Тогда
		 	Предупреждение("В документе " + СокрЛП(ДокЗаявка) + Символы.ПС + "установлен статус 'Отказ в возврате' !", 15, "ВНИМАНИЕ !");				
		КонецЕсли;
		
		//+Марков И. 05.11.2025 #UT10-5494
		Форма = ДокЗаявка.ПолучитьФорму("ФормаДокумента", ЭтаФорма);
		Форма.Открыть();
		//-Марков И. 05.11.2025 #UT10-5494

	Иначе
		
		//+Шульман А. 24.09.2025 #UT10-5433
		Реализация = ШтрихкодированиеПечатныхФорм.ПолучитьРеализациюПоШтрихкоду(Данные);  
		
		Если ЗначениеЗаполнено(Реализация) Тогда       
			
			ДокЗаявка = ПолучитьЗаявкуНаВозвратПоРеализации(Реализация);         
			
			Если ЗначениеЗаполнено(ДокЗаявка) Тогда
			
				Если ДокЗаявка.Статус = "Отказ в возврате" Тогда
				 	Предупреждение("В документе " + СокрЛП(ДокЗаявка) + Символы.ПС + "установлен статус 'Отказ в возврате' !", 15, "ВНИМАНИЕ !");				
				КонецЕсли;
				
				//+Марков И. 05.11.2025 #UT10-5494
				Форма = ДокЗаявка.ПолучитьФорму("ФормаДокумента", ЭтаФорма);
				Форма.Открыть();
				//-Марков И. 05.11.2025 #UT10-5494      
				
			Иначе
				Сообщить("Документ ""Заявка на возврат"" по реализации со штрихкодом " + Данные + " не найден");
			КонецЕсли;
			
		Иначе
		//-Шульман А. 24.09.2025 #UT10-5433
			Сообщить("Документ ""Заявка на возврат"" со штрихкодом " + Данные + " не найден");
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Функция ПоддерживаетсяВидТО(Вид) Экспорт
	
	Результат = Ложь;  
	
	Если Вид = Перечисления.ВидыТорговогоОборудования.СканерШтрихКода
	 Или Вид = Перечисления.ВидыТорговогоОборудования.ТерминалСбораДанных
	 Или Вид = Перечисления.ВидыТорговогоОборудования.СчитывательRFIDМеток Тогда
		Результат = Истина;
	КонецЕсли; 
	
	Возврат Результат; 
	
КонецФункции 

&НаСервереБезКонтекста
Функция ПолучитьРеализациюПоШтрихкоду(Штрихкод)

	Возврат ШтрихкодированиеПечатныхФорм.ПолучитьРеализациюПоШтрихкоду(Штрихкод);

КонецФункции // ()

&НаСервереБезКонтекста
Функция ПолучитьЗаявкуНаВозвратПоРеализации(Реализация)
	
	//+Шульман А. 24.09.2025 #UT10-5433
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаявкаНаВозврат.Ссылка
		|ИЗ
		|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
		|ГДЕ
		|	НЕ ЗаявкаНаВозврат.ПометкаУдаления
		|	И ЗаявкаНаВозврат.Реализация = &Реализация
		|	И ЗаявкаНаВозврат.ОформленоНаПланшете";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	//-Шульман А. 24.09.2025 #UT10-5433

КонецФункции // ()

&НаКлиенте
Процедура ВвестиВручную(Команда)
	
	//+Шульман А. 24.09.2025 #UT10-5433
	ШКРучной = "";
	
	Если ВвестиСтроку(ШКРучной, "Введите штрихкод", 100, Ложь) Тогда
		
		Если ЗначениеЗаполнено(ШКРучной) Тогда
			ВнешнееСобытие("Вручную", "", ШКРучной);
		КонецЕсли;
		
	КонецЕсли;
	//-Шульман А. 24.09.2025 #UT10-5433	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	//+Марков И. 05.11.2025 #UT10-5494
	
	ШтрихкодЗакрываемогоДокумента = ВыбранноеЗначение; 
	
	//-Марков И. 05.11.2025 #UT10-5494
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьЗаявкиСБезусловнымВозвратом(Команда)
	//+Сёмин Р. 17.11.2025 #UT10-5526
	ОткрытьФорму("Документ.ЗаявкаНаВозврат.Форма.ФормаСпискаУпрОтбор");
	//-Сёмин Р. 17.11.2025 #UT10-5526
КонецПроцедуры
