Функция ЗаполнитьТаблицуДокументов(Контрагент, НовыйСпособДоставки) Экспорт
	
	Запрос = Новый Запрос;  
	
	//+Гавриленков В. 26.02.2026 #UT10-5717 Добавлены: 1. Отбор по дате заказа; 2. Таблица остатков по заказам и отбор по этим заказам
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ КонтрагентИФилиалы
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.Ссылка = &Контрагент
		|			ИЛИ Контрагенты.ГоловнойКонтрагент = &Контрагент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Сделка КАК ЗаказПокупателя
		|ПОМЕСТИТЬ ЗаказыОснования
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Проведен
		|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		|	И РеализацияТоваровУслугТовары.Ссылка.Контрагент = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.СпособДоставки,
		|	ЛОЖЬ КАК Перенос
		|ПОМЕСТИТЬ ВТ_ЗаказыОсновная
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Контрагент В
		|			(ВЫБРАТЬ
		|				КонтрагентИФилиалы.Ссылка
		|			ИЗ
		|				КонтрагентИФилиалы КАК КонтрагентИФилиалы)
		|	И ЗаказПокупателя.Проведен
		|	И НЕ ЗаказПокупателя.Ссылка В
		|				(ВЫБРАТЬ
		|					ЗаказыОснования.ЗаказПокупателя
		|				ИЗ
		|					ЗаказыОснования КАК ЗаказыОснования)
		|	И ЗаказПокупателя.СпособДоставки <> &НовыйСпособДоставки
		|	И НЕ(ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
		|				И ЗаказПокупателя.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала)
		|	И ЗаказПокупателя.Дата >= &ДатаНачала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя
		|ПОМЕСТИТЬ ВТ_ОстаткиПоЗаказам
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя В
		|			(ВЫБРАТЬ
		|				Таб.Ссылка
		|			ИЗ
		|				ВТ_ЗаказыОсновная КАК Таб)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ЗаказыОсновная.Ссылка,
		|	ВТ_ЗаказыОсновная.СпособДоставки,
		|	ВТ_ЗаказыОсновная.Перенос
		|ИЗ
		|	ВТ_ЗаказыОсновная КАК ВТ_ЗаказыОсновная
		|ГДЕ
		|	ВТ_ЗаказыОсновная.Ссылка В
		|			(ВЫБРАТЬ
		|				Таб.ЗаказПокупателя
		|			ИЗ
		|				ВТ_ОстаткиПоЗаказам КАК Таб)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("НовыйСпособДоставки", НовыйСпособДоставки);
	//+Гавриленков В. 26.02.2026 #UT10-5717
	Запрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(ТекущаяДата(), -3));
	//-Гавриленков В. 26.02.2026 #UT10-5717
	
	ТаблицаРезультатаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультатаЗапроса;
	
КонецФункции