Процедура Р_ЗагрузитьДокумент(Знач _СтруктураДокумента, Настройка, Отказ) Экспорт
	
	Структура = Р_ЗагрузкаДокументов.ПолучитьДанныеДокумента(_СтруктураДокумента, Настройка);
	СтруктураДокумента = Структура.СтруктураДокумента;
	
	Если Не Структура.ТребуетсяОбновление Тогда
		Возврат;
	КонецЕсли;                            
	
	Если СтруктураДокумента.ТестоваяОтправка = 1 Тогда
		Возврат;
	КонецЕсли;

	Карта = Новый Соответствие;
	Карта.Вставить("Дата", "ДатаДокумента");
	Карта.Вставить("Номер", "НомерДокумента");
	Карта.Вставить("Склад", "КодСкладаМДМ");        
	Карта.Вставить("КодМДМ", "УникальныйИдентификатор"); 
	Карта.Вставить("Проведен", "Статус");
	Карта.Вставить("ПометкаУдаления", "ПометкаУдаления");
	Карта.Вставить("ШтампВерсии", "ШтампВерсии");
	Карта.Вставить("ВалютаДокумента", "КодВалютаМДМ");  
	Карта.Вставить("Комментарий", "Комментарий"); 
	Карта.Вставить("ДатаПоступления", "ДатаПоставки"); 
	//+Шульман А. 13.01.2025 #UT10-5019
	Карта.Вставить("ПополнениеЗапасов", "ПополнениеЗапасов"); 
	//-Шульман А. 13.01.2025 #UT10-5019                  
	//+Шульман А. 01.04.2025 #UT10-5173   
	Карта.Вставить("ПремиальнаяПерекупка", "ПремиальнаяПерекупка");    
	Карта.Вставить("IDСклада", "КодСторонегоскладаМДМ"); 
	//-Шульман А. 01.04.2025 #UT10-5173      
	
	Карта.Вставить("Товары.Номенклатура", "Товары.КодНоменклатурыМДМ"); 
	Карта.Вставить("Товары.Количество", "Товары.Количество");
	Карта.Вставить("Товары.КоличествоМест", "Товары.КоличествоУпаковок");   
	Карта.Вставить("Товары.Цена", "Товары.Цена");   
	Карта.Вставить("Товары.Сумма", "Товары.Сумма");  
	//+Шульман А. 13.01.2025 #UT10-5019  
	//Карта.Вставить("Товары.СуммаНДС", "Товары.СуммаНДС");  
	Карта.Вставить("Товары.СуммаНДС", "Товары.Сумма"); 
	//-Шульман А. 13.01.2025 #UT10-5019
	//Карта.Вставить("Товары.ЕдиницаИзмерения", "Товары.КодЕдиницыИзмеренияМДМ"); 
	//+Шульман А. 01.04.2025 #UT10-5173   
	Карта.Вставить("Товары.ПроизводительПоставщика", "Товары.ПроизводительПоставщика"); 
	//-Шульман А. 01.04.2025 #UT10-5173
	

	Р_ЗагрузкаДокументов.ПолучитьДанныеСсылочногоТипа(Структура, Карта);
	
	Р_ЗагрузкаДокументов.ОбработатьДокументПоКарте(Структура, Карта);
	
	мОбъект = Структура.Объект;  
	
	//+Шульман А. 15.04.2025 #UT10-5190  
	мОбъект.Организация = Константы.ОсновнаяОрганизация.Получить();
	
	Если мОбъект.ПремиальнаяПерекупка Тогда
		
		мОбъект.Контрагент = Константы.ОсновнойПоставщик.Получить();
		мОбъект.ДоговорКонтрагента = мОбъект.Контрагент.ОсновнойДоговорКонтрагента;	
	
	КонецЕсли;    
	//-Шульман А. 15.04.2025 #UT10-5190 
	
	мСклад = мОбъект.Склад;
	
	мОбъект.Подразделение = мСклад.Подразделение; 
	мПодразделение = мОбъект.Подразделение; 
	
	мОбъект.СуммаВключаетНДС = Истина;  
	мОбъект.УчитыватьНДС = Истина;                                   
	//+Шульман А. 02.06.2025 #UT10-5269
	//мОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Подтвержден;  
	мОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Создан;    
	//-Шульман А. 02.06.2025 #UT10-5269
	мОбъект.КратностьВзаиморасчетов = 1;    
	мОбъект.КурсВзаиморасчетов = 1;
	
	//мОбъект.Ответственный = ПолучитьПользователяПоФизЛицу(СтруктураДокумента.КодМенеджераМДМ); 
	
	//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
	ТекДата = '00010101';
	Попытка
		ТекДата = мОбъект.Дата;
	Исключение
	КонецПопытки;
	ДатаНДС = ?(ЗначениеЗаполнено(ТекДата), ТекДата, ТекущаяДата());
	//-Гавриленков В. 18.12.2025 #UT10-5598
	
	Для каждого тзСтрока Из мОбъект.Товары Цикл
		
		тзСтрока.ЕдиницаИзмерения = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков;    
		тзСтрока.ЕдиницаИзмеренияМест = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков; 
		//+Гавриленков В. 01.04.2026 #UT10-5799
		//тзСтрока.Коэффициент = 1;
		тзСтрока.Коэффициент = ?(ЗначениеЗаполнено(тзСтрока.ЕдиницаИзмерения.Коэффициент), тзСтрока.ЕдиницаИзмерения.Коэффициент, 1);
		//-Гавриленков В. 01.04.2026 #UT10-5799
		
		//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
		//тзСтрока.СтавкаНДС = тзСтрока.Номенклатура.СтавкаНДС; 
		тзСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(тзСтрока.Номенклатура, ДатаНДС);
		//-Гавриленков В. 18.12.2025 #UT10-5598
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(тзСтрока, мОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(тзСтрока, мОбъект);
		
	КонецЦикла;  
	
	//СтруктураДокумента.Статус = 0;
	Р_ЗагрузкаДокументов.ЗаписатьДокумент(Структура, Отказ); 
	
КонецПроцедуры    

Функция НужнаПроверкаВЧЗ(Поступление) Экспорт
//+Белов А. 01.06.2026 #UT10-5888
	
	НужноПроверятьВЧЗ = Ложь;
	
	Если Поступление.Контрагент.ИНН <> Константы.ОсновнаяОрганизация.Получить().ИНН 
		И Поступление.КодыМаркировки.Количество() > 0 Тогда
		НужноПроверятьВЧЗ = Истина;	
	КонецЕсли;
	
	Возврат НужноПроверятьВЧЗ;
          
//-Белов А. 01.06.2026 #UT10-5888	
КонецФункции



