
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидыКонтактнойИнформации.ЗагрузитьЗначения(Параметры.ВидыКонтактнойИнформации.ВыгрузитьЗначения());
	ВидыКонтактнойИнформации.ДоступныеЗначения = Параметры.ВидыКонтактнойИнформации.ДоступныеЗначения;
	
	Если Параметры.Свойство("ДоступныеЗначенияКонтактнойИнформации") Тогда
		ДоступныеЗначенияКонтактнойИнформации.Загрузить(Параметры.ДоступныеЗначенияКонтактнойИнформации.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВидыКонтактнойИнформацииПриАктивизацииЯчейки(Элемент)
	
	ТекущиеДанные = Элементы.ВидыКонтактнойИнформации.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущийЭлемент.Имя = "ВидыКонтактнойИнформацииЗначение" Тогда
		СписокВыбора = Элементы.ВидыКонтактнойИнформацииЗначение.СписокВыбора;
		СписокВыбора.Очистить();
		Для каждого СтрокиВидовКИ Из ДоступныеЗначенияКонтактнойИнформации Цикл
			СписокВыбора.Добавить(СтрокиВидовКИ.ВидКИ, Строка(СтрокиВидовКИ.ВидКИ) + " (" + Строка(СтрокиВидовКИ.Родитель) + ")");
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Если Модифицированность Тогда
		
		
		Закрыть(ВидыКонтактнойИнформации);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры
