
Функция PM_6051_DOC_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6051_DOC_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_6051_DOC_FOR_PORTAL");
	
	Результат = МСКWEB.PM_6051_DOC_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_6051_DOC_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_6051_DOC_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат Результат;
	
КонецФункции
