
Функция ЗаполнитьТаблицуКлиентовПоКонтрагентам() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК Контрагент
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабЗнач.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗ КАК ТабЗнач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|			ПО Т1.Контрагент = ТабЗнач.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПроизвольноеСообщение)) КАК Т2
	|			ПО Т2.Контрагент = ТабЗнач.Контрагент	
	|ГДЕ
	|	Т1.Контрагент ЕСТЬ NULL
	|	ИЛИ Т2.Контрагент ЕСТЬ NULL	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.Грузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.Грузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Результат = Запрос.ВыполнитьПакет();
	
	
	ТаблицаКлиент = Неопределено; 
	ТаблицаКлиент = Результат[2].Выгрузить();		
		
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);

	Возврат СтруктураВозврат;
	
КонецФункции	

Функция ЗаполнитьТаблицуКлиентовПоЗаданиямНаДоставку() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК ЗаданиеНаДоставку
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ЗаданиеНаДоставку,
	|	ЕСТЬNULL(Т1.Контрагент, """") КАК Контрагент
	|ПОМЕСТИТЬ ТЗЗаданиеНаДоставку
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаданиеНаДоставку.Доставка КАК Т1
	|		ПО ТЗ.ЗаданиеНаДоставку = Т1.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗЗаданиеНаДоставку.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗЗаданиеНаДоставку КАК ТЗЗаданиеНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|		ПО ((ВЫРАЗИТЬ(Т1.Документ КАК Документ.ЗаданиеНаДоставку)) = ТЗЗаданиеНаДоставку.ЗаданиеНаДоставку)
	|			И ТЗЗаданиеНаДоставку.Контрагент = Т1.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.ПроизвольноеСообщение)) КАК Т2
	|		ПО ((ВЫРАЗИТЬ(Т2.Документ КАК Документ.ЗаданиеНаДоставку)) = ТЗЗаданиеНаДоставку.ЗаданиеНаДоставку)
	|			И ТЗЗаданиеНаДоставку.Контрагент = Т2.Контрагент
	|ГДЕ
	|	(Т1.Контрагент ЕСТЬ NULL
	|			ИЛИ Т2.Контрагент ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.Грузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.Грузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКлиент = Результат[3].Выгрузить();		
		
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);

	Возврат СтруктураВозврат;
	
КонецФункции	

Функция ЗаполнитьТаблицуКлиентовПоЗаказамПоставщику() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗ.ОбъектДокумента КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ЗаказПоставщикуТовары.Заказ КАК Документ.ЗаказПокупателя) КАК ЗаказПокупателя,
	|	ТЗ.ЗаказПоставщику,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.КодПроизводителя,
	|	ЗаказПоставщикуТовары.Номенклатура.Родитель,
	|	ЗаказПоставщикуТовары.Количество
	|ПОМЕСТИТЬ ТЗЗаказыПокупателя
	|ИЗ
	|	ТЗ КАК ТЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|		ПО ТЗ.ЗаказПоставщику = ЗаказПоставщикуТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель
	|ПОМЕСТИТЬ Грузополучатели
	|ИЗ
	|	ТЗЗаказыПокупателя КАК ТЗЗаказыПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т1
	|		ПО ((ВЫРАЗИТЬ(Т1.Документ КАК Документ.ЗаказПоставщику)) = ТЗЗаказыПокупателя.ЗаказПоставщику)
	|			И ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель = Т1.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РассылкаДокументов.СрезПервых(&Дата, ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылокЭлектроннойПочты.СообщениеОЗадержкеПоставки)) КАК Т2
	|		ПО ((ВЫРАЗИТЬ(Т2.Документ КАК Документ.ЗаказПоставщику)) = ТЗЗаказыПокупателя.ЗаказПоставщику)
	|			И ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель = Т2.Контрагент
	|ГДЕ
	|	(Т1.Контрагент ЕСТЬ NULL
	|			ИЛИ Т2.Контрагент ЕСТЬ NULL)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Грузополучатели.ЗаказПокупателяГрузополучатель КАК Клиент,
	|	1 КАК Отправить,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК Адрес
	|ИЗ
	|	Грузополучатели КАК Грузополучатели
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|			ПО (Контрагенты.Ссылка = (ВЫРАЗИТЬ(КонтактнаяИнформация.Объект.Ссылка КАК Справочник.Контрагенты)))
	|		ПО Грузополучатели.ЗаказПокупателяГрузополучатель = Контрагенты.Ссылка
	|ГДЕ
	|	КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами)
	|	И (ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(200))) <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель КАК ЗаказПокупателяГрузополучатель,
	|	ТЗЗаказыПокупателя.Номенклатура,
	|	ТЗЗаказыПокупателя.НоменклатураКодПроизводителя,
	|	ТЗЗаказыПокупателя.НоменклатураРодитель,
	|	СУММА(ТЗЗаказыПокупателя.Количество) КАК Количество
	|ИЗ
	|	ТЗЗаказыПокупателя КАК ТЗЗаказыПокупателя
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЗЗаказыПокупателя.ЗаказПокупателя.Грузополучатель,
	|	ТЗЗаказыПокупателя.НоменклатураКодПроизводителя,
	|	ТЗЗаказыПокупателя.Номенклатура,
	|	ТЗЗаказыПокупателя.НоменклатураРодитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПокупателяГрузополучатель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());	
	Запрос.УстановитьПараметр("ТЗ", ДокументыКОбработке.Выгрузить(, "ОбъектДокумента"));
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаКлиент = Результат[3].Выгрузить();
	ТаблицаТоварыПоКлиентам = Результат[4].Выгрузить();
	
	СтруктураВозврат = Новый Структура;
	СтруктураВозврат.Вставить("ТаблицаКлиент", ТаблицаКлиент);
	СтруктураВозврат.Вставить("ТаблицаТоварыПоКлиентам", ТаблицаТоварыПоКлиентам);

	Возврат СтруктураВозврат;
	
КонецФункции	
