  
////////////Методы веб сервиса///////////////////////////
Функция ПолучитьСуммуДокументовПоПериоду(Тип, ДатаНачала, ДатаОкончания, Контрагент, ДоговорКонтрагента, ТипДокумента)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьСуммуДокументовПоПериоду");
	
	ДатаН = Дата(ДатаНачала);
	ДатаК = Дата(ДатаОкончания);
	
	Если ЗначениеЗаполнено(СокрЛП(Контрагент)) Тогда 		
		Конт = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СокрЛП(Контрагент));		
	Иначе                                                         		
		Конт = Неопределено;                                      		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СокрЛП(ДоговорКонтрагента)) Тогда 		
		Дог = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СокрЛП(ДоговорКонтрагента));		
	Иначе                                                         		
		Дог = Неопределено;                                      		
	КонецЕсли;
	
	//+Марков И. 02.09.2025 #UT10-5410
	Если ЗначениеЗаполнено(СокрЛП(Контрагент)) Или ЗначениеЗаполнено(СокрЛП(ДоговорКонтрагента))  Тогда
		
		Если Конт = Неопределено Или Конт = Справочники.Контрагенты.ПустаяСсылка() Тогда
			
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("message", "Контрагент """ + Контрагент + """ и Договор """ + ДоговорКонтрагента + """ не найдены в базе.");
			СтруктураВозврата.Вставить("code", "NOT_FOUND_KONTRAGENT");
			Результат = ДанныеВJSON(СтруктураВозврата);
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДокументовПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат Результат;			
			
		КонецЕсли; 
		
		Если Дог = Неопределено ИЛИ Дог = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
			
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("message", "Контрагент """ + Контрагент + """ и Договор """ + ДоговорКонтрагента + """ не найдены в базе.");   
			СтруктураВозврата.Вставить("code", "NOT_FOUND_AGREEMENT");
			Результат = ДанныеВJSON(СтруктураВозврата);
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДокументовПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат Результат;			
			
		КонецЕсли;
		
	КонецЕсли;
	//-Марков И. 02.09.2025 #UT10-5410
	
	Если (ЗначениеЗаполнено(Конт) И ЗначениеЗаполнено(Дог)) И 
		(Конт <> Справочники.Контрагенты.ПустаяСсылка() И Дог <> Справочники.ДоговорыКонтрагентов.ПустаяСсылка()) Тогда
		
		Если Конт <> Дог.Владелец Тогда
			
			СтруктураВозврата = Новый Структура;
			СтруктураВозврата.Вставить("message", "Контрагент """ + Контрагент + """ и Договор """ + ДоговорКонтрагента + """. Договор не принадлежит контрагенту.");   
			СтруктураВозврата.Вставить("code", "AGREEMENT_NOT_OWN_KONTRAGENT");
			Результат = ДанныеВJSON(СтруктураВозврата);
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДокументовПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат Результат;			
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ	
	|	(&ПустойКонтрагент
	|			ИЛИ Контрагенты.Ссылка = &Контрагент)
	|;
	|$ТексЗапросаПоДокументу$
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Суммы.Ссылка,
	|	Суммы.ТипДокумента,
	|	Суммы.ШтампВерсии,
	|	Сумма(Суммы.ШтампВерсии) КАК СуммаШтамповВерсий,
	|	Сумма(ВЫБОР
	|		КОГДА Суммы.СуммаДокумента = 0 
	|			ТОГДА 1 
	|		КОГДА (ВЫБОР КОГДА Суммы.СуммаДокумента < 0 Тогда Суммы.СуммаДокумента * -1 Иначе Суммы.СуммаДокумента Конец) * 100 / 2 - (ВЫРАЗИТЬ((ВЫБОР КОГДА Суммы.СуммаДокумента < 0 Тогда Суммы.СуммаДокумента * -1 Иначе Суммы.СуммаДокумента Конец) * 100 / 2 - 0.5 КАК ЧИСЛО(15, 0))) = 0
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК СуммаЧетныхСуммДокументов,
	|	Суммы.Номер,
	|	Суммы.Контрагент,
	|	ПРЕДСТАВЛЕНИЕ(Суммы.Контрагент) КАК КонтрагентПредставление,
	|	Суммы.Период КАК Период,
	|	СУММА(Суммы.СуммаДокумента) КАК Сумма,
	|	Суммы.Контрагент.КодМДМ,
	|	Суммы.ДоговорКонтрагента.КодМДМ
	|ИЗ
	|	Суммы КАК Суммы
	|
	|СГРУППИРОВАТЬ ПО
	|	Суммы.Ссылка,
	|	Суммы.ТипДокумента,
	|	Суммы.ШтампВерсии,
	|	Суммы.Номер,
	|	Суммы.Контрагент,
	|	Суммы.Период,
	|	Суммы.Контрагент.КодМДМ,
	|	Суммы.ДоговорКонтрагента.КодМДМ
	|
	|УПОРЯДОЧИТЬ ПО                                       
	|	Период";
	
	ЭтоПервыйЗапрос = Истина;
	
	ТипыДокументов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипДокумента, ",", Истина);
	
	ВыборкаВидов = Справочники.AMQP_ДокументыВыгрузки.Выбрать();
	
	ТексЗапросаПоДокументу = "";
	ЕстьДокументКВыгрузке = Ложь;
	
	Пока ВыборкаВидов.Следующий() Цикл
		
		Если Не ВыборкаВидов.SOAPBilling Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяДокумента = ВыборкаВидов.ИмяДокумента;
		
		Если ТипыДокументов.Количество() > 0 И ТипыДокументов.Найти(ИмяДокумента) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ВыборкаВидов.Выгружать Тогда
			Продолжить;
		КонецЕсли;  
		
		ЕстьДокументКВыгрузке = Истина;
		
		ЗнакМинус = "";
		
		Если ИмяДокумента = "РеализацияТоваровУслуг" ИЛИ 
			ИмяДокумента = "РасходныйКассовыйОрдер" ИЛИ 
			ИмяДокумента = "ПлатежноеПоручениеИсходящее" ИЛИ
			ИмяДокумента = "КорректировкаДолга" ИЛИ
			ИмяДокумента = "КорректировкаРеализации" Тогда
			ЗнакМинус = "-";
		КонецЕсли;
		
		ТексЗапросаПоДокументу = ТексЗапросаПоДокументу + Символы.ПС + ?(НЕ ЭтоПервыйЗапрос, "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС, "");
		
		Если ИмяДокумента = "КорректировкаДолга" Тогда
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу + 
			"ВЫБРАТЬ
			|	ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Ссылка КАК Ссылка,
			|	""КорректировкаДолга"" КАК ТипДокумента,
			|	ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).ШтампВерсии КАК ШтампВерсии,
			|	ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Номер КАК Номер,
			|	" + ЗнакМинус + "ЕСТЬNULL(ДокВыборки.СуммаВзаиморасчетовОборот, 0) КАК СуммаДокумента,
			|	ЕСТЬNULL(ДокВыборки.СуммаВзаиморасчетовПриход, 0) КАК СуммаДокументаПриход,
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|	ДокВыборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Дата, МЕСЯЦ) КАК Период" +
			?(ЭтоПервыйЗапрос, Символы.ПС + "ПОМЕСТИТЬ Суммы", "") + "
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(
			|			&ДатаНачала,
			|			&ДатаОкончания,
			|			Регистратор,
			|			ВЫРАЗИТЬ(Контрагент КАК Справочник.Контрагенты) В
			|					(ВЫБРАТЬ
			|						Контрагенты.Ссылка
			|					ИЗ
			|						Контрагенты)
			|				И (&ПустойДоговор
			|					ИЛИ ДоговорКонтрагента = &ДоговорКонтрагента)) КАК ДокВыборки
			|ГДЕ
			|	ДокВыборки.Регистратор ССЫЛКА Документ.КорректировкаДолга
			|	И ДокВыборки.Регистратор.НеОтправлятьДокументВУчетныеСистемы = ЛОЖЬ
			|";
			
			Если Тип <> "day" Тогда
				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, """КорректировкаДолга"" КАК ТипДокумента,", "");
				//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Ссылка КАК Ссылка,", "");
				//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).ШтампВерсии КАК ШтампВерсии,", "");
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Номер КАК Номер,", "");
				
			Иначе
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Дата, МЕСЯЦ)", "ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.КорректировкаДолга).Дата");
			КонецЕсли;
			
		ИначеЕсли ИмяДокумента = "КорректировкаРеализации" Тогда
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу +
			"ВЫБРАТЬ
			|	ДокВыборки.Ссылка КАК Ссылка,
			|   """ + ВыборкаВидов.ИмяДокумента + """ КАК ТипДокумента,
			|	ДокВыборки.ШтампВерсии КАК ШтампВерсии,
			|	ДокВыборки.Номер КАК Номер,
			|	" + ЗнакМинус + "СУММА( ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) ) КАК СуммаДокумента,
			|	0 КАК СуммаДокументаПриход,
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|	ДокВыборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ) КАК Период" +
			?(ЭтоПервыйЗапрос, Символы.ПС + "ПОМЕСТИТЬ Суммы", "") + "
			|ИЗ
			|	Документ.КорректировкаРеализации КАК ДокВыборки
			|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
			|		&ДатаНачала,
			|		&ДатаОкончания,
			|		Регистратор,
			|		Контрагент В
			|			(ВЫБРАТЬ
			|				Контрагенты.Ссылка
			|			ИЗ
			|				Контрагенты)) КАК ПродажиОбороты
			|	ПО ДокВыборки.Ссылка = ПродажиОбороты.Регистратор
			|ГДЕ
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) В
			|			(ВЫБРАТЬ
			|				Контрагенты.Ссылка
			|			ИЗ
			|				Контрагенты)
			|	И ДокВыборки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ДокВыборки.Проведен
			|	И (&ПустойДоговор ИЛИ ДокВыборки.ДоговорКонтрагента = &ДоговорКонтрагента)
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокВыборки.Ссылка,
			|	ДокВыборки.ШтампВерсии,
			|	ДокВыборки.Номер,
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты),
			|	ДокВыборки.ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ)";
			
			Если Тип <> "day" Тогда
				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, """КорректировкаРеализации"" КАК ТипДокумента,", "");
				//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.Ссылка КАК Ссылка,", "");
				//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.ШтампВерсии КАК ШтампВерсии,", "");
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.Номер КАК Номер,", ""); 
				
			Иначе				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ)", "ДокВыборки.Дата");
			КонецЕсли;
			
		ИначеЕсли ИмяДокумента = "ОплатаОтПокупателяПлатежнойКартой" Тогда
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу +
			"ВЫБРАТЬ
			|	ДокВыборки.Ссылка КАК Ссылка,
			|   """ + ВыборкаВидов.ИмяДокумента + """ КАК ТипДокумента,
			|	ДокВыборки.Ссылка.ШтампВерсии КАК ШтампВерсии,
			|	ДокВыборки.Ссылка.Номер КАК Номер,
			|	ВЫБОР
			|		 КОГДА ДокВыборки.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|		КОНЕЦ * ДокВыборки.Ссылка.СуммаДокумента КАК СуммаДокумента,
			|	0 КАК СуммаДокументаПриход,
			|	ВЫРАЗИТЬ(ДокВыборки.Ссылка.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|	ДокВыборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Ссылка.Дата, МЕСЯЦ) КАК Период" +
			?(ЭтоПервыйЗапрос, Символы.ПС + "ПОМЕСТИТЬ Суммы", "") + "
			|ИЗ
			|	Документ." + ВыборкаВидов.ИмяДокумента + ".РасшифровкаПлатежа КАК ДокВыборки
			|ГДЕ
			|	ВЫРАЗИТЬ(ДокВыборки.Ссылка.Контрагент КАК Справочник.Контрагенты) В
			|			(ВЫБРАТЬ
			|				Контрагенты.Ссылка
			|			ИЗ
			|				Контрагенты)
			|	И ДокВыборки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ДокВыборки.Ссылка.Проведен
			|	И (&ПустойДоговор ИЛИ ДокВыборки.ДоговорКонтрагента = &ДоговорКонтрагента) 
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокВыборки.Ссылка,
			|	ДокВыборки.Ссылка.ШтампВерсии,
			|	ДокВыборки.Ссылка.Номер,
			|	ВЫРАЗИТЬ(ДокВыборки.Ссылка.Контрагент КАК Справочник.Контрагенты),
			|	ДокВыборки.ДоговорКонтрагента,
			|	ВЫБОР
			|		КОГДА ДокВыборки.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя)
			|			ТОГДА 1
			|		ИНАЧЕ -1
			|	КОНЕЦ * ДокВыборки.Ссылка.СуммаДокумента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Ссылка.Дата, МЕСЯЦ)";
			
			Если Тип <> "day" Тогда
				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, """ОплатаОтПокупателяПлатежнойКартой"" КАК ТипДокумента,", "");
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.Ссылка.Номер КАК Номер,", ""); 
				
			Иначе				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "НАЧАЛОПЕРИОДА(ДокВыборки.Ссылка.Дата, МЕСЯЦ)", "ДокВыборки.Ссылка.Дата");
			КонецЕсли;
			
		Иначе
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу +
			"ВЫБРАТЬ
			|	ДокВыборки.Ссылка КАК Ссылка,
			|   """ + ВыборкаВидов.ИмяДокумента + """ КАК ТипДокумента,
			|	ДокВыборки.ШтампВерсии КАК ШтампВерсии,
			|	ДокВыборки.Номер КАК Номер,
			|	" + ЗнакМинус + "СУММА(ДокВыборки.СуммаДокумента) КАК СуммаДокумента,
			|	0 КАК СуммаДокументаПриход,
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|	ДокВыборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ) КАК Период" +
			?(ЭтоПервыйЗапрос, Символы.ПС + "ПОМЕСТИТЬ Суммы", "") + "
			|ИЗ
			|	Документ." + ВыборкаВидов.ИмяДокумента + " КАК ДокВыборки
			|ГДЕ
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) В
			|			(ВЫБРАТЬ
			|				Контрагенты.Ссылка
			|			ИЗ
			|				Контрагенты)
			|	И ДокВыборки.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И ДокВыборки.Проведен
			|	И (&ПустойДоговор ИЛИ ДокВыборки.ДоговорКонтрагента = &ДоговорКонтрагента)" +
			?(ИмяДокумента = "РеализацияТоваровУслуг", Символы.ПС + "И НЕ ЕСТЬNULL(ДокВыборки.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение, Ложь)", "") + "
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокВыборки.Ссылка,
			|	ДокВыборки.ШтампВерсии,
			|	ДокВыборки.Номер,
			|	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты),
			|	ДокВыборки.ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ)";
			
		КонецЕсли;
		
		Если Тип <> "day" Тогда
			
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, """" + ВыборкаВидов.ИмяДокумента + """" + " КАК ТипДокумента,", "");
			//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.Ссылка КАК Ссылка,", "");
			//ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.ШтампВерсии КАК ШтампВерсии,", "");
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ДокВыборки.Номер КАК Номер,", "");
			
		Иначе
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "НАЧАЛОПЕРИОДА(ДокВыборки.Дата, МЕСЯЦ)", "ДокВыборки.Дата");
		КонецЕсли;
		
		Если ЭтоПервыйЗапрос Тогда
			ЭтоПервыйЗапрос = Ложь;
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого ТипДокумента Из ТипыДокументов Цикл
		
		Если ТипДокумента = "СборкаЗаказовПокупателя" ИЛИ ТипДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда
			
			ЗнакМинус = "-";
			
			ЕстьДокументКВыгрузке = Истина; 
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу + Символы.ПС + ?(НЕ ЭтоПервыйЗапрос, "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС, "");
			
			ТексЗапросаПоДокументу = ТексЗапросаПоДокументу +
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Ссылка,
			|	ВложенныйЗапрос.ТипДокумента,
			|	ВложенныйЗапрос.ШтампВерсии,
			|	ВложенныйЗапрос.Номер,
			|	ВложенныйЗапрос.Контрагент,
			|	ВложенныйЗапрос.ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК Период,
			|	СУММА(ВложенныйЗапрос.СуммаДокумента) КАК СуммаДокумента
			|ПОМЕСТИТЬ СуммыПервый
			|ИЗ
			|	(ВЫБРАТЬ
			|		Сборки.Ссылка КАК Ссылка,
			|		Сборки.ТипДокумента КАК ТипДокумента,
			|		МАКСИМУМ(Сборки.ШтампВерсии) КАК ШтампВерсии,
			|		Сборки.Номер КАК Номер,
			|		Сборки.Контрагент КАК Контрагент,
			|		Сборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|		Сборки.Период КАК Период,
			|		СУММА(Заказы.Сумма / Заказы.Количество * Сборки.Количество) КАК СуммаДокумента,
			|		Сборки.Номенклатура КАК Номенклатура
			|	ИЗ
			|		(ВЫБРАТЬ
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Ссылка КАК Ссылка,
			|			""СборкаЗаказовПокупателя"" КАК ТипДокумента,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).ШтампВерсии КАК ШтампВерсии,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Номер КАК Номер,
			|			СУММА(ДокВыборки.СобраноОборот + ДокВыборки.КСборкеОборот) КАК Количество,
			|			ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
			|			ДокВыборки.ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Дата КАК Период,
			|			ДокВыборки.Номенклатура КАК Номенклатура,
			|			ДокВыборки.ЗаказПокупателя КАК ЗаказПокупателя
			|		ИЗ
			|			РегистрНакопления.ТоварыВСборке.Обороты(
			|					&ДатаНачала,
			|					&ДатаОкончания,
			|					Регистратор,
			|					ВЫРАЗИТЬ(Контрагент КАК Справочник.Контрагенты) В
			|							(ВЫБРАТЬ
			|								Контрагенты.Ссылка
			|							ИЗ
			|								Контрагенты)
			|						И (&ПустойДоговор
			|							ИЛИ ЗаказПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента)) КАК ДокВыборки
			|		ГДЕ
			|			ДокВыборки.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ДокВыборки.ЗаказПокупателя.ДоговорКонтрагента,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Ссылка,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).ШтампВерсии,
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Номер,
			|			ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты),
			|			ВЫРАЗИТЬ(ДокВыборки.Регистратор КАК Документ.СборкаЗаказовПокупателя).Дата,
			|			ДокВыборки.Номенклатура,
			|			ДокВыборки.ЗаказПокупателя) КАК Сборки
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ДокВыборки.ЗаказПокупателя КАК ЗаказПокупателя,
			|				ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
			|				СУММА(ЗаказПокупателяТовары.Сумма) КАК Сумма,
			|				СУММА(ЗаказПокупателяТовары.Количество) КАК Количество
			|			ИЗ
			|				РегистрНакопления.ТоварыВСборке.Обороты(
			|						&ДатаНачала,
			|						&ДатаОкончания,
			|						Регистратор,
			|						ВЫРАЗИТЬ(Контрагент КАК Справочник.Контрагенты) В
			|								(ВЫБРАТЬ
			|									Контрагенты.Ссылка
			|								ИЗ
			|									Контрагенты)
			|							И (&ПустойДоговор
			|								ИЛИ ЗаказПокупателя.ДоговорКонтрагента = &ДоговорКонтрагента)) КАК ДокВыборки
			|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
			|					ПО ДокВыборки.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
			|						И ДокВыборки.Номенклатура = ЗаказПокупателяТовары.Номенклатура
			|			ГДЕ
			|				ДокВыборки.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
			|			
			|			СГРУППИРОВАТЬ ПО
			|				ДокВыборки.ЗаказПокупателя,
			|				ЗаказПокупателяТовары.Номенклатура) КАК Заказы
			|			ПО Сборки.ЗаказПокупателя = Заказы.ЗаказПокупателя
			|				И Сборки.Номенклатура = Заказы.Номенклатура
			|	
			|	СГРУППИРОВАТЬ ПО
			|		Сборки.Ссылка,
			|		Сборки.ТипДокумента,
			|		Сборки.Номер,
			|		Сборки.Контрагент,
			|		Сборки.ДоговорКонтрагента,
			|		Сборки.Период,
			|		Сборки.Номенклатура) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Ссылка,
			|	ВложенныйЗапрос.ТипДокумента,
			|	ВложенныйЗапрос.ШтампВерсии,
			|	ВложенныйЗапрос.Номер,
			|	ВложенныйЗапрос.Контрагент,
			|	ВложенныйЗапрос.ДоговорКонтрагента,
			|	НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)";          
			
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "КАК Документ.СборкаЗаказовПокупателя", "КАК Документ." + ТипДокумента);
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, """" + "СборкаЗаказовПокупателя" + """" + " КАК ТипДокумента,", """" + ТипДокумента + """" + " КАК ТипДокумента,");
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ССЫЛКА Документ.СборкаЗаказовПокупателя", "ССЫЛКА Документ." + ТипДокумента);  
			ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "СУММА(ВложенныйЗапрос.СуммаДокумента)", ЗнакМинус + "СУММА(ВложенныйЗапрос.СуммаДокумента)");  
			
			Если ЭтоПервыйЗапрос Тогда
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ПОМЕСТИТЬ СуммыПервый", "ПОМЕСТИТЬ Суммы");	
			Иначе
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ПОМЕСТИТЬ СуммыПервый", "");	
			КонецЕсли;
			
			Если Тип <> "day" Тогда
				
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ВложенныйЗапрос.ТипДокумента,", "");
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "ВложенныйЗапрос.Номер,", "");

			Иначе
				ТексЗапросаПоДокументу = СтрЗаменить(ТексЗапросаПоДокументу, "НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)", "ВложенныйЗапрос.Период");
			КонецЕсли;
			
			Если ЭтоПервыйЗапрос Тогда
				ЭтоПервыйЗапрос = Ложь;
			КонецЕсли;

		КонецЕсли;
	
	КонецЦикла; 
	
	Если Не ЕстьДокументКВыгрузке Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("message", "В справочнике ""Документы к выгрузке"" нет отмеченных типов документов для выгрузки, через SOAP"); 
		СтруктураВозврата.Вставить("code", "NOT_FOUND_DOCUMENTS");
		Результат = ДанныеВJSON(СтруктураВозврата);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДокументовПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат Результат;			
		
	КонецЕсли; 	
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$ТексЗапросаПоДокументу$", ТексЗапросаПоДокументу);
	
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1, 1, 1));
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаН);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаК));
	Запрос.УстановитьПараметр("Контрагент", Конт);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Не ЗначениеЗаполнено(Конт));
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Дог);
	Запрос.УстановитьПараметр("ПустойДоговор", Не ЗначениеЗаполнено(Дог));                     
	
	Если Тип <> "day" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Суммы.Ссылка,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Суммы.ТипДокумента,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Суммы.ШтампВерсии,", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Суммы.Номер,", "");
		
		Если Тип = "year" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МЕСЯЦ", "ГОД");
		ИначеЕсли Тип = "month-of-year" Тогда
			//Ничего не делаем, так как подобная группировка уже зашита в запросе
		ИначеЕсли Тип = "day-of-month" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "МЕСЯЦ", "ДЕНЬ");		
		КонецЕсли;  
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если Тип = "day" Тогда
			
			Документ = Выборка.Ссылка;
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("GUID", Строка(Документ.УникальныйИдентификатор()));
			СтруктураСтроки.Вставить("ТипДокумента", AMQP_РаботаСДокументами.ПолучитьТипДокументаИзБиллингаДля1С(Выборка.ТипДокумента));
			СтруктураСтроки.Вставить("Версия", Выборка.ШтампВерсии);
			СтруктураСтроки.Вставить("Номер", Выборка.Номер);
			СтруктураСтроки.Вставить("Дата", Выборка.Период);
			СтруктураСтроки.Вставить("Контрагент", Выборка.КонтрагентПредставление);
			СтруктураСтроки.Вставить("КонтрагентКодМДМ", Выборка.КонтрагентКодМДМ);
			СтруктураСтроки.Вставить("ДоговорКонтрагентаКодМДМ", Выборка.ДоговорКонтрагентаКодМДМ);
			СтруктураСтроки.Вставить("Сумма", Выборка.Сумма);
			
		Иначе
			
			СтруктураСтроки = Новый Структура;
			СтруктураСтроки.Вставить("Период", Выборка.Период);
			СтруктураСтроки.Вставить("Контрагент", Выборка.КонтрагентПредставление);
			СтруктураСтроки.Вставить("КонтрагентКодМДМ", Выборка.КонтрагентКодМДМ);
			СтруктураСтроки.Вставить("ДоговорКонтрагентаКодМДМ", Выборка.ДоговорКонтрагентаКодМДМ);
			СтруктураСтроки.Вставить("Сумма", Выборка.Сумма);
			СтруктураСтроки.Вставить("СуммаШтамповВерсий", Выборка.СуммаШтамповВерсий);
			СтруктураСтроки.Вставить("СуммаЧетныхСуммДокументов", Выборка.СуммаЧетныхСуммДокументов);
			
		КонецЕсли;
		
		МассивВозврата.Добавить(СтруктураСтроки);                                                 
		
	КонецЦикла;
	
	Результат = ДанныеВJSON(МассивВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьСуммуДокументовПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;
	
КонецФункции

Функция ПовторноВыгрузитьДокумент(Тип, GUID, Получатель)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПовторноВыгрузитьДокумент");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат", Ложь);
	СтруктураВозврата.Вставить("Сообщение", "");
	
	Если Не Тип = "ОприходованиеТоваров" И Не Тип = "СписаниеТоваров" Тогда
		ТипДокумента = AMQP_РаботаСДокументами.ПолучитьТипДокументаИзБиллингаДля1С(Тип); 
	Иначе
		ТипДокумента = Тип;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТипДокумента) Тогда
		
		СтруктураВозврата.Сообщение = "Не найден такой тип документа";

		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПовторноВыгрузитьДокумент " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
		Возврат РезультатВыполнения;  
		
	КонецЕсли;  
	
	ДополнЗаголовки = Неопределено;

	Если ЗначениеЗаполнено(Получатель) Тогда
		
		ДополнЗаголовки = Новый СписокЗначений;
		ДополнЗаголовки.Добавить("app_Receiver_id", Получатель); 
		
	КонецЕсли; 
	
	Попытка
		
		СсылкаНаДокумент = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(GUID));
		ОбъектДокумента = СсылкаНаДокумент.ПолучитьОбъект();
		
		Если ОбъектДокумента = Неопределено Тогда
			СтруктураВозврата.Сообщение = "Не найден документ по такому GUID";	
		Иначе
						
			Попытка				
				
				ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", ТипДокумента);
				
				Если ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver1_Ver2 Тогда 
					AMQP_РаботаСДокументами.СоздатьИсходящееСообщение(ОбъектДокумента, Ложь,,, ДополнЗаголовки); 
					AMQP_РаботаСДокументами_ver2.СоздатьИсходящееСообщение(ОбъектДокумента, Ложь,,, ДополнЗаголовки);
				ИначеЕсли ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver_1 Тогда
					AMQP_РаботаСДокументами.СоздатьИсходящееСообщение(ОбъектДокумента, Ложь,,, ДополнЗаголовки);
				ИначеЕсли ТипДокумента = "СборкаЗаказовПокупателя" ИЛИ ТипДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда
					AMQP_РаботаСДокументами.СоздатьИсходящееСообщение(ОбъектДокумента, Ложь,,, ДополнЗаголовки); 
				Иначе 
					AMQP_РаботаСДокументами_ver2.СоздатьИсходящееСообщение(ОбъектДокумента, Ложь,,, ДополнЗаголовки);				
				КонецЕсли; 				

				СтруктураВозврата.Сообщение = "Документ успешно выгружен повторно";
				СтруктураВозврата.Результат = Истина; 
				
			Исключение	   
				
				СтруктураВозврата.Сообщение = ОписаниеОшибки();
				
			КонецПопытки;   
			
		КонецЕсли;
		
	Исключение
		
		СтруктураВозврата.Сообщение = ОписаниеОшибки();
		
	КонецПопытки;
	
	РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПовторноВыгрузитьДокумент " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
		
КонецФункции

Функция ПовторноВыгрузитьСборку(НомерЗаказаКлиента, ИдентификаторЗаказа, ИдентификаторКонтрагента)  
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПовторноВыгрузитьСборку");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("status", "");
	СтруктураВозврата.Вставить("message", "");

	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЗаказа));	
	Если ЗаказПокупателя.ПолучитьОбъект() = Неопределено Тогда
		
		СтруктураВозврата.Вставить("status", "еrror");
		СтруктураВозврата.Вставить("message", "Заказ клиента не обнаружен " + НомерЗаказаКлиента);
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПовторноВыгрузитьСборку " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
		Возврат РезультатВыполнения;
		
	КонецЕсли; 
	                                                    
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИдентификаторКонтрагента);
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Сборка
	|ПОМЕСТИТЬ ВТСборка
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|ГДЕ
	|	ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|	И ТоварыВСборкеОбороты.ЗаказПокупателя = &ЗаказПокупателя
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Регистратор КАК ДокументЗаписи,
	|	ВЫБОР
	|		КОГДА ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректировка,
	|	ТоварыВСборкеОбороты.Сборка КАК Сборка,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ КАК Контрагент,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ КАК Договор,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер КАК Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата КАК Дата,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	СУММА(ТоварыВСборкеОбороты.СуммаСобрано) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСборка КАК ВТСборка
	|		ПО ТоварыВСборкеОбороты.Сборка = ВТСборка.Сборка
	|ГДЕ
	|	(ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|			ИЛИ ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя)
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка,
	|	ТоварыВСборкеОбороты.Контрагент,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата,
	|	ТоварыВСборкеОбороты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ЭтоКорректировка
	|ИТОГИ ПО
	|	Сборка";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
			
	РезультатЗапроса = Запрос.Выполнить();
	Попытка
		
		Если РезультатЗапроса.Пустой() Тогда
			
			СтруктураВозврата.status = "error";					
			СтруктураВозврата.message = "Не найдены документы для заказа " + НомерЗаказаКлиента;
			
			РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПовторноВыгрузитьСборку " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
			Возврат РезультатВыполнения;
			
		Иначе
			
			ВыборкаСборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сборка");								       
			
			Пока ВыборкаСборка.Следующий() Цикл
				
				AMQP_РаботаСДокументами.ПроверкаДокументаВБиллинге(ВыборкаСборка.Сборка, Истина);
				AMQP_РаботаСДокументами.ПодтверждениеДокументаВБиллинге(ВыборкаСборка.Сборка);
				
				Выборка = ВыборкаСборка.Выбрать();
				
				Пока Выборка.Следующий() Цикл										
					
					Если Выборка.ЭтоКорректировка  Тогда
						AMQP_РаботаСДокументами.ОтправитьДокументКорректировкиВБиллинг(Выборка.ДокументЗаписи);	
					КонецЕсли; 										
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураВозврата.status = "ок";
	    СтруктураВозврата.message = "";
		
	Исключение
		
		СтруктураВозврата.status = "еrror";
	    СтруктураВозврата.message = ОписаниеОшибки();
		
	КонецПопытки; 
	
	РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПовторноВыгрузитьСборку " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьДокументыПоЗаказуКлиента(УникальныйИдентификаторЗаказа)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьДокументыПоЗаказуКлиента");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("status", "");
	СтруктураВозврата.Вставить("message", "");
	СтруктураВозврата.Вставить("data", "");
	
	ЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(УникальныйИдентификаторЗаказа));
	
	Если ЗаказПокупателя.ПолучитьОбъект() = Неопределено Тогда
		
		СтруктураВозврата.Вставить("status", "еrror");
		СтруктураВозврата.Вставить("message", "Заказ клиента не обнаружен. ГУИД " + УникальныйИдентификаторЗаказа);
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДокументыПоЗаказуКлиента " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
		Возврат РезультатВыполнения;
		
	КонецЕсли; 
	
	Контрагент = ЗаказПокупателя.Контрагент;
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();	

	
	// Получить документы реализации, корректировок реализаций
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДокВыборки.Ссылка,
	               |	""РеализацияТоваровУслуг"" КАК ТипДокумента,
	               |	ДокВыборки.ШтампВерсии КАК ШтампВерсии,
	               |	ДокВыборки.Номер,
	               |	-СУММА(ДокВыборки.СуммаДокумента) КАК СуммаДокумента,
	               |	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	               |	ДокВыборки.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |	ДокВыборки.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТРеализТовУсл
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Товары КАК ДокВыборкиТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК ДокВыборки
	               |		ПО ДокВыборкиТовары.Ссылка = ДокВыборки.Ссылка
	               |ГДЕ
	               |	ДокВыборкиТовары.ЗаказПокупателя = &ЗаказПокупателя
	               |	И ДокВыборки.ДоговорКонтрагента.ВыгружаетсяВБиллинг = ИСТИНА
	               |	И ДокВыборки.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокВыборки.Ссылка,
	               |	ДокВыборки.ШтампВерсии,
	               |	ДокВыборки.Номер,
	               |	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты),
	               |	ДокВыборки.ДоговорКонтрагента,
	               |	ДокВыборки.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДокВыборки.Ссылка,
	               |	""КорректировкаРеализации"" КАК ТипДокумента,
	               |	ДокВыборки.ШтампВерсии КАК ШтампВерсии,
	               |	ДокВыборки.Номер,
	               |	-СУММА(ПродажиОбороты.СтоимостьОборот) КАК СуммаДокумента,
	               |	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	               |	ДокВыборки.ДоговорКонтрагента,
	               |	ДокВыборки.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТКорректРеализации
	               |ИЗ
	               |	Документ.КорректировкаРеализации КАК ДокВыборки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	               |				,
	               |				,
	               |				Регистратор,
	               |				ДокументПродажи В
	               |						(ВЫБРАТЬ
	               |							ВТРеализТовУсл.Ссылка
	               |						ИЗ
	               |							ВТРеализТовУсл КАК ВТРеализТовУсл)
	               |					И ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	               |					И ЗаказПокупателя = &ЗаказПокупателя) КАК ПродажиОбороты
	               |		ПО ДокВыборки.Ссылка = ПродажиОбороты.Регистратор
	               |ГДЕ
	               |	ДокВыборки.ДоговорКонтрагента.ВыгружаетсяВБиллинг = ИСТИНА
	               |	И ДокВыборки.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокВыборки.Ссылка,
	               |	ДокВыборки.ШтампВерсии,
	               |	ДокВыборки.Номер,
	               |	ВЫРАЗИТЬ(ДокВыборки.Контрагент КАК Справочник.Контрагенты),
	               |	ДокВыборки.ДоговорКонтрагента,
	               |	ДокВыборки.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТРеализТовУсл.Ссылка,
	               |	ВТРеализТовУсл.ТипДокумента,
	               |	ВТРеализТовУсл.ШтампВерсии,
	               |	ВТРеализТовУсл.Номер,
	               |	ВТРеализТовУсл.СуммаДокумента,
	               |	ВТРеализТовУсл.Контрагент,
	               |	ВТРеализТовУсл.ДоговорКонтрагента,
	               |	ВТРеализТовУсл.Дата
	               |ПОМЕСТИТЬ СуммаДокумента
	               |ИЗ
	               |	ВТРеализТовУсл КАК ВТРеализТовУсл
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТКорректРеализации.Ссылка,
	               |	ВТКорректРеализации.ТипДокумента,
	               |	ВТКорректРеализации.ШтампВерсии,
	               |	ВТКорректРеализации.Номер,
	               |	ВТКорректРеализации.СуммаДокумента,
	               |	ВТКорректРеализации.Контрагент,
	               |	ВТКорректРеализации.ДоговорКонтрагента,
	               |	ВТКорректРеализации.Дата
	               |ИЗ
	               |	ВТКорректРеализации КАК ВТКорректРеализации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Суммы.Ссылка,
	               |	Суммы.ТипДокумента,
	               |	Суммы.ШтампВерсии,
	               |	Суммы.Номер,
	               |	Суммы.Контрагент,
	               |	ПРЕДСТАВЛЕНИЕ(Суммы.Контрагент) КАК КонтрагентПредставление,
	               |	Суммы.Дата КАК Дата,
	               |	СУММА(Суммы.СуммаДокумента) КАК Сумма,
	               |	Суммы.Контрагент.КодМДМ,
	               |	Суммы.ДоговорКонтрагента.КодМДМ
	               |ИЗ
	               |	СуммаДокумента КАК Суммы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Суммы.Ссылка,
	               |	Суммы.ТипДокумента,
	               |	Суммы.ШтампВерсии,
	               |	Суммы.Номер,
	               |	Суммы.Контрагент,
	               |	Суммы.Дата,
	               |	Суммы.Контрагент.КодМДМ,
	               |	Суммы.ДоговорКонтрагента.КодМДМ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	
	МассивВозврата = Новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Документ = РезультатЗапроса.Ссылка;
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("GUID", Строка(Документ.УникальныйИдентификатор()));
		СтруктураСтроки.Вставить("ТипДокумента", РезультатЗапроса.ТипДокумента);
		СтруктураСтроки.Вставить("Версия", РезультатЗапроса.ШтампВерсии);
		СтруктураСтроки.Вставить("Номер", РезультатЗапроса.Номер);
		СтруктураСтроки.Вставить("Дата", РезультатЗапроса.Дата);
		СтруктураСтроки.Вставить("Контрагент", РезультатЗапроса.КонтрагентПредставление);
		СтруктураСтроки.Вставить("КонтрагентКодМДМ", РезультатЗапроса.КонтрагентКодМДМ);
		СтруктураСтроки.Вставить("ДоговорКонтрагентаКодМДМ", РезультатЗапроса.ДоговорКонтрагентаКодМДМ);
		СтруктураСтроки.Вставить("Сумма", РезультатЗапроса.Сумма);
		
		МассивВозврата.Добавить(СтруктураСтроки);
		
	КонецЦикла; 
	
	// Получить сборки заказов покупателей, корректировки сборок
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Сборка
	|ПОМЕСТИТЬ ВТСборка
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|ГДЕ
	|	ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|	И ТоварыВСборкеОбороты.ЗаказПокупателя = &ЗаказПокупателя
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОбороты.Регистратор КАК ДокументЗаписи,
	|	ВЫБОР
	|		КОГДА ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоКорректировка,
	|	ТоварыВСборкеОбороты.Сборка КАК Сборка,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ КАК Контрагент,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ КАК Договор,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер КАК Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата КАК Дата,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	СУММА(ТоварыВСборкеОбороты.СуммаСобрано) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке КАК ТоварыВСборкеОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСборка КАК ВТСборка
	|		ПО ТоварыВСборкеОбороты.Сборка = ВТСборка.Сборка
	|ГДЕ
	|	(ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.СборкаЗаказовПокупателя
	|			ИЛИ ТоварыВСборкеОбороты.Регистратор ССЫЛКА Документ.КорректировкаСборкиЗаказовПокупателя)
	|	И ТоварыВСборкеОбороты.Контрагент = &Контрагент
	|	И ТоварыВСборкеОбороты.Сборка.Договор.ВыгружаетсяВБиллинг = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОбороты.Сборка,
	|	ТоварыВСборкеОбороты.Контрагент,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя,
	|	ТоварыВСборкеОбороты.Контрагент.КодМДМ,
	|	ТоварыВСборкеОбороты.Сборка.Договор.КодМДМ,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Номер,
	|	ТоварыВСборкеОбороты.ЗаказПокупателя.Дата,
	|	ТоварыВСборкеОбороты.Регистратор
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	ЭтоКорректировка
	|ИТОГИ ПО
	|	Сборка";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
			
	РезультатЗапроса = Запрос.Выполнить();
	
	Попытка
		
		Если Не РезультатЗапроса.Пустой() Тогда
					
			ВыборкаСборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Сборка");								       
			
			Пока ВыборкаСборка.Следующий() Цикл
				
				ДокументОбъект = ВыборкаСборка.Сборка.ПолучитьОбъект(); 
				СтруктураСборки = Новый Структура;
				СтруктураСборки.Вставить("agreement_mdm_id", Строка(ДокументОбъект.Договор.КодМДМ));
				СтруктураСборки.Вставить("app_id", Строка(Константы.База.Получить()));
				СтруктураСборки.Вставить("request_id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));	
				СтруктураСборки.Вставить("request_id_name", ДокументОбъект.Номер);
				СтруктураСборки.Вставить("request_id_date", Формат(ДокументОбъект.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));

									
				ТЗСтрокиЗаказов =  AMQP_РаботаСДокументами.СформироватьСтрокуЗаказов(ДокументОбъект, Истина);
				МассивТранзакций = Новый Массив;

				Для каждого Стр Из ТЗСтрокиЗаказов Цикл
					
					СтруктураДанных = Новый Структура;
					СтруктураДанных.Вставить("order_id", Строка(Стр.Ссылка.УникальныйИдентификатор()));
					СтруктураДанных.Вставить("amount", AMQP_РаботаСДокументами.ПреобразоватьЧисло(Стр.Сумма));
					СтруктураДанных.Вставить("order_id_name", Стр.Ссылка.Номер);
					СтруктураДанных.Вставить("order_id_date", Формат(Стр.Ссылка.Дата, "ДФ=""гггг-ММ-дд'T'ЧЧ:мм:сс"""));
					МассивТранзакций.Добавить(СтруктураДанных);
					
				КонецЦикла; 	
					
				СтруктураСборки.Вставить("orders", МассивТранзакций);
				
			    /////////////////////////////////////////////////////				
				
				СтруктураСтроки = Новый Структура;
				СтруктураСтроки.Вставить("GUID", Строка(ВыборкаСборка.Сборка.УникальныйИдентификатор()));
				СтруктураСтроки.Вставить("ТипДокумента", "СборкаЗаказовПокупателя");
				СтруктураСтроки.Вставить("Данные", СтруктураСборки);
				
				МассивВозврата.Добавить(СтруктураСтроки);								
				//////////////////////////////////////////////////////
				
				Выборка = ВыборкаСборка.Выбрать();
				
				Пока Выборка.Следующий() Цикл										
					
					Если Выборка.ЭтоКорректировка  Тогда
						
						// Документ Корректировка сборки заказов покупателя
						ДокументОбъект = Выборка.ДокументЗаписи.ПолучитьОбъект(); 
						СтруктураКорректировки = Новый Структура;
						
						СтруктураКорректировки.Вставить("request_id", Строка(Выборка.ДокументЗаписи.УникальныйИдентификатор()));
						СтруктураКорректировки.Вставить("app_id", Строка(Константы.База.Получить()));
						СтруктураКорректировки.Вставить("correction_request_id", Строка(ДокументОбъект.Ссылка.УникальныйИдентификатор()));
						
						ТЗ = AMQP_РаботаСДокументами.СформироватьСтрокуКорректировкиЗаказов(ДокументОбъект, Истина);
						
						МассивТранзакций = Новый Массив;
						
						Для каждого Стр Из ТЗ Цикл
							
							СтруктураДанных = Новый Структура;
							СтруктураДанных.Вставить("source_order_id", Строка(Стр.Ссылка.УникальныйИдентификатор()));
							СтруктураДанных.Вставить("amount", AMQP_РаботаСДокументами.ПреобразоватьЧисло(Стр.Сумма));
							МассивТранзакций.Добавить(СтруктураДанных);
							
						КонецЦикла; 	
							
						СтруктураКорректировки.Вставить("transactions", МассивТранзакций);
						
						СтруктураСтроки = Новый Структура;
						СтруктураСтроки.Вставить("GUID", Строка(ДокументОбъект.УникальныйИдентификатор()));
						СтруктураСтроки.Вставить("ТипДокумента", "КорректировкаСборкиЗаказовПокупателя");
						СтруктураСтроки.Вставить("Данные", СтруктураКорректировки);
						
						МассивВозврата.Добавить(СтруктураСтроки);								

					КонецЕсли; 										
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураВозврата.status = "ок";
	    СтруктураВозврата.message = "";
		СтруктураВозврата.data = МассивВозврата;
		
	Исключение
		
		СтруктураВозврата.status = "еrror";
	    СтруктураВозврата.message = ОписаниеОшибки();
		
	КонецПопытки; 
	
	РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДокументыПоЗаказуКлиента " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ПолучитьДатуНачалаВыгрузкиДокументов()
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьДатуНачалаВыгрузкиДокументов");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("status", "");
	СтруктураВозврата.Вставить("message", "");
	СтруктураВозврата.Вставить("data", "");

	Попытка 
		
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ДатаНачалаВыгрузки", Константы.AMQP_ДатаНачалаВыгрузки.Получить());
				
		СтруктураВозврата.status = "ок";
	    СтруктураВозврата.data = СтруктураСтроки;
			
	Исключение
		СтруктураВозврата.status = "еrror";
	    СтруктураВозврата.message = ОписаниеОшибки();
	КонецПопытки; 
	
	РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДатуНачалаВыгрузкиДокументов " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьНачальныйБаланс(КодДоговораМДМ, ДатаБаланса)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьБалансНаДату");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("status", Ложь);
	СтруктураВозврата.Вставить("message", "");
	СтруктураВозврата.Вставить("data", 0);
	
	Если Не ЗначениеЗаполнено(КодДоговораМДМ) Тогда
		
		СтруктураВозврата.message = "Не заполнен код мдм договора";
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьБалансНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
		Возврат РезультатВыполнения;
		
	КонецЕсли;
	
	Договор = Неопределено;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.КодМДМ = &КодМДМ";
	
	Запрос.УстановитьПараметр("КодМДМ", КодДоговораМДМ);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Количество() > 1 Тогда
		
		СтруктураВозврата.message = "Обнаружено несколько договоров с кодом МДМ: " + КодДоговораМДМ;
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьБалансНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
		Возврат РезультатВыполнения;

	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Договор = Выборка.Ссылка;	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Договор) Тогда
		
		СтруктураВозврата.message = "Договор " + КодДоговораМДМ + " не найден в базе Торговле";	
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьБалансНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
		Возврат РезультатВыполнения;

	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Дата, ДоговорКонтрагента = &Договор) КАК ВзаиморасчетыСКонтрагентамиОстатки";
	
	Запрос.УстановитьПараметр("Дата", ДатаБаланса);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураВозврата.data = Выборка.Сумма;	
	КонецЕсли;
	
	СтруктураВозврата.status = Истина;
	
	РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьБалансНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ПроверитьНастройкуДокументаВыгрузки(Документ)
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
	
	ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", Документ); 
	
	Если Не ЗначениеЗаполнено(ДокументВыгрузки) 
		ИЛИ Не ДокументВыгрузки.Выгружать Тогда
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("Результат", Ложь);
		СтруктураСообщения.Вставить("Сообщение", "В базе не настроена или выключена выгрузка документа: " + Документ);
		
		СтруктураВозврата.Сообщение = ДанныеВJSON(СтруктураСообщения);
		СтруктураВозврата.Результат = Ложь;
	
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

Функция ПолучитьМассивКроссовЗаПериод(ДатаН, ДатаО, ТипЭлемента)

	ЗапросКросс = Новый Запрос;
	ЗапросКросс.УстановитьПараметр("ДатаНачала", ДатаН);
	ЗапросКросс.УстановитьПараметр("ДатаОкончания", ?(Не ЗначениеЗаполнено(ДатаО), ТекущаяДата(), ДатаО));
	
	Если ТипЭлемента = "РеализацияТоваровУслуг" ИЛИ ТипЭлемента = "КорректировкаРеализации" Тогда
		
		ЗапросКросс.Текст = "ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг
		|	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка";  
		
		ЗапросКросс.Текст = СтрЗаменить(ЗапросКросс.Текст, "РеализацияТоваровУслуг", ТипЭлемента);
		
	Иначе 
		
		ЗапросКросс.Текст = "ВЫБРАТЬ
		|	СчетФактураВыданный.ДокументОснование,
		|	СчетФактураВыданный.Ссылка
		|ПОМЕСТИТЬ ВТ_СФ
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
		|			ИЛИ СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка
		|ПОМЕСТИТЬ ВТ_ОснованияКросс
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг
		|	И РеализацияТоваровУслугТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_СФ.ДокументОснование
		|			ИЗ
		|				ВТ_СФ)
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииТовары.Ссылка
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.ЗаказПокупателя.КроссДокинг
		|	И КорректировкаРеализацииТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_СФ.ДокументОснование
		|			ИЗ
		|				ВТ_СФ)
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СФ.Ссылка
		|ИЗ
		|	ВТ_СФ КАК ВТ_СФ
		|ГДЕ
		|	ВТ_СФ.ДокументОснование В
		|			(ВЫБРАТЬ
		|				ВТ_ОснованияКросс.Ссылка
		|			ИЗ
		|				ВТ_ОснованияКросс)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_СФ.Ссылка";
		
	КонецЕсли; 
	
	МассивДокументовКросс = ЗапросКросс.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
	
	Возврат МассивДокументовКросс;

КонецФункции

Функция ПолучитьОбщийМассивКроссовЗаПериод(ДатаН, ДатаО)

	ЗапросКросс = Новый Запрос;
	ЗапросКросс.УстановитьПараметр("ДатаНачала", ДатаН);
	ЗапросКросс.УстановитьПараметр("ДатаОкончания", ?(Не ЗначениеЗаполнено(ДатаО), ТекущаяДата(), ДатаО));
	
	ЗапросКросс.Текст = "ВЫБРАТЬ
	                    |	СчетФактураВыданный.ДокументОснование,
	                    |	СчетФактураВыданный.Ссылка
	                    |ПОМЕСТИТЬ ВТ_СФ
	                    |ИЗ
	                    |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	                    |ГДЕ
	                    |	СчетФактураВыданный.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                    |	И (СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.РеализацияТоваровУслуг
	                    |			ИЛИ СчетФактураВыданный.ДокументОснование ССЫЛКА Документ.КорректировкаРеализации)
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	РеализацияТоваровУслугТовары.Ссылка
	                    |ПОМЕСТИТЬ ВТ_ОснованияКросс
	                    |ИЗ
	                    |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                    |ГДЕ
	                    |	РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг
	                    |	И РеализацияТоваровУслугТовары.Ссылка В
	                    |			(ВЫБРАТЬ
	                    |				ВТ_СФ.ДокументОснование
	                    |			ИЗ
	                    |				ВТ_СФ)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	РеализацияТоваровУслугТовары.Ссылка
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	КорректировкаРеализацииТовары.Ссылка
	                    |ИЗ
	                    |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                    |ГДЕ
	                    |	КорректировкаРеализацииТовары.ЗаказПокупателя.КроссДокинг
	                    |	И КорректировкаРеализацииТовары.Ссылка В
	                    |			(ВЫБРАТЬ
	                    |				ВТ_СФ.ДокументОснование
	                    |			ИЗ
	                    |				ВТ_СФ)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	КорректировкаРеализацииТовары.Ссылка
	                    |;
	                    |
	                    |////////////////////////////////////////////////////////////////////////////////
	                    |ВЫБРАТЬ
	                    |	ВТ_СФ.Ссылка
	                    |ИЗ
	                    |	ВТ_СФ КАК ВТ_СФ
	                    |ГДЕ
	                    |	ВТ_СФ.ДокументОснование В
	                    |			(ВЫБРАТЬ
	                    |				ВТ_ОснованияКросс.Ссылка
	                    |			ИЗ
	                    |				ВТ_ОснованияКросс)
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ВТ_СФ.Ссылка
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	РеализацияТоваровУслугТовары.Ссылка
	                    |ИЗ
	                    |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                    |ГДЕ
	                    |	РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг
	                    |	И РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	РеализацияТоваровУслугТовары.Ссылка
	                    |
	                    |ОБЪЕДИНИТЬ ВСЕ
	                    |
	                    |ВЫБРАТЬ
	                    |	КорректировкаРеализацииТовары.Ссылка
	                    |ИЗ
	                    |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                    |ГДЕ
	                    |	КорректировкаРеализацииТовары.ЗаказПокупателя.КроссДокинг
	                    |	И КорректировкаРеализацииТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	КорректировкаРеализацииТовары.Ссылка";
		
	
	МассивДокументовКросс = ЗапросКросс.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"); 
	
	Возврат МассивДокументовКросс;

КонецФункции

Функция ПолучитьДанныеДокументовПоДиапазонуВерсий(ВерсияНачало, ВерсияКонец, Документ, Суммировать, ДатаНачала, ДатаОкончания)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьДанныеДокументовПоДиапазонуВерсий");
	
	//+Бычков О. 28.08.2025 #UT10-5397
	// Вставка
	ТекМаркер = "<marker>6b35e660-2303-4a8d-8611-0d32f64cfa57</marker>";
	ТекДлина = СтрДлина(ТекМаркер);
	Если Лев(Документ, ТекДлина) = ТекМаркер Тогда
		
		// Использован специальный маркер, который означает, что в параметр переданы и вид документа и вид документа базы-корреспондента.
		// Получаем эти виды отдельно.
		ТекДокумент = Сред(Документ, ТекДлина + 1);
		ТекДокументы = СтрокаВМассивСтрок(ТекДокумент, ",");
		
		Документ = ТекДокументы[0];
		
		ДокументКорреспондента = ТекДокументы[1];
		
	КонецЕсли;
	//-Бычков О. 28.08.2025 #UT10-5397
	
	Если Документ = "ПеремещениеТоваровМеждуСкладами" Тогда  
		
		РезультатПроверки = ПроверитьНастройкуДокументаВыгрузки("РеализацияТоваровУслуг"); 
		
		Если Не РезультатПроверки.Результат Тогда
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДанныеДокументовПоДиапазонуВерсий " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат РезультатПроверки.Сообщение;
			
		КонецЕсли;     
		
		РезультатПроверки = ПроверитьНастройкуДокументаВыгрузки("ПоступлениеТоваровУслуг"); 
		
		Если Не РезультатПроверки.Результат Тогда
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДанныеДокументовПоДиапазонуВерсий " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат РезультатПроверки.Сообщение;
			
		КонецЕсли; 
	
	Иначе
		
		РезультатПроверки = ПроверитьНастройкуДокументаВыгрузки(Документ); 
		
		Если Не РезультатПроверки.Результат Тогда
			
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДанныеДокументовПоДиапазонуВерсий " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			
			Возврат РезультатПроверки.Сообщение;
			
		КонецЕсли; 		
		
	КонецЕсли;
		
	ДатаН = Дата(ДатаНачала);
	ДатаО = Дата(ДатаОкончания);
	
	МассивВозврата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВерсияНачало", ВерсияНачало);
	Запрос.УстановитьПараметр("ВерсияКонец", ВерсияКонец);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаН);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(Не ЗначениеЗаполнено(ДатаО), ТекущаяДата(), ДатаО));
	Запрос.УстановитьПараметр("ИНН", Константы.ОсновнаяОрганизация.Получить().ИНН); 
	Запрос.УстановитьПараметр("ОсновнойПоставщик", Константы.ОсновнойПоставщик.Получить());
	
	//Исключаем документы кросс-докинга
	Если Документ = "РеализацияТоваровУслуг" 
		ИЛИ Документ = "КорректировкаРеализации"
		ИЛИ Документ = "СчетФактураВыданный" Тогда
		
		Запрос.УстановитьПараметр("МассивДокументовКросс", ПолучитьМассивКроссовЗаПериод(ДатаН, ДатаО, Документ)); 
		
	Иначе                                                                          
		Запрос.УстановитьПараметр("МассивДокументовКросс", Новый Массив()); 
	КонецЕсли;
	
	ТекстЗапроса = ""; 
	
	Если Суммировать Тогда
		
		ТекстЗапроса = ПолучитьЗапросСпискаЭлементов(Документ) + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Элементы.Ссылка) КАК Количество,
		|	СУММА(ВТ_Элементы.Ссылка.ШтампВерсии) КАК СуммаВерсий,
		|	МИНИМУМ(ВТ_Элементы.Ссылка.ШтампВерсии) КАК ВерсияНачало,
		|	МАКСИМУМ(ВТ_Элементы.Ссылка.ШтампВерсии) КАК ВерсияКонец,
		|	Сумма(Выбор когда ВТ_Элементы.Ссылка.Проведен Тогда 1 Иначе 0 Конец) КАК Проведено
		|ИЗ
		|	ВТ_Элементы КАК ВТ_Элементы";
		
		//+Бычков О. 28.08.2025 #UT10-5397
		// Было
		//ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверки(Документ);  
		// Стало
		ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверки(Документ, ДокументКорреспондента, Запрос);  
		//-Бычков О. 28.08.2025 #ERP-1556
		
		
		Запрос.Текст = ТекстЗапроса;
		
		СтруктураВозврата = Новый Структура("ВерсияНачало, ВерсияКонец, Количество, СуммаВерсий, Проведено");
		
		Выборка = Запрос.Выполнить().Выбрать();		
		
		Если Выборка.Следующий() Тогда
			
			СтруктураВозврата.ВерсияНачало = ?(ЗначениеЗаполнено(Выборка.ВерсияНачало), Выборка.ВерсияНачало, 0);
			СтруктураВозврата.ВерсияКонец = ?(ЗначениеЗаполнено(Выборка.ВерсияКонец), Выборка.ВерсияКонец, 0);
			СтруктураВозврата.СуммаВерсий = ?(ЗначениеЗаполнено(Выборка.СуммаВерсий), Выборка.СуммаВерсий, 0);
			СтруктураВозврата.Количество = Выборка.Количество; 
			СтруктураВозврата.Проведено = Выборка.Проведено; 
			
		КонецЕсли;  
		
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
			
		Возврат РезультатВыполнения; 		
					
	Иначе
		
		ТекстЗапроса = ПолучитьЗапросСпискаЭлементов(Документ) + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Элементы.Ссылка КАК Ссылка,
		|	ВТ_Элементы.Ссылка.ШтампВерсии КАК Версия,
		|	ВТ_Элементы.Ссылка.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Элементы.Ссылка) КАК Представление,
		|	ВТ_Элементы.Ссылка.Проведен КАК Проведен
		|ИЗ
		|	ВТ_Элементы КАК ВТ_Элементы";      
		
		//+Бычков О. 28.08.2025 #UT10-5397
		// Было
		//ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверки(Документ);
		// Стало
		ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверки(Документ, ДокументКорреспондента, Запрос);
		//-Бычков О. 28.08.2025 #UT10-5397
		
		
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МассивВозврата.Добавить(Новый Структура("GUID, Версия, Дата, Представление, Тип, Проведен", Строка(Выборка.Ссылка.УникальныйИдентификатор()), Выборка.Версия, Выборка.Дата, Выборка.Представление, Выборка.Ссылка.Метаданные().Имя, Выборка.Проведен));
			
		КонецЦикла;			
		
	КонецЕсли;

	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
		
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДанныеДокументовПоДиапазонуВерсий " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьДанныеРегистровПоПериоду(Регистр, ИмяРесурса, Суммировать, ДатаНачала, ДатаОкончания)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ПолучитьДанныеРегистровПоПериоду");
			
	ДатаН = Дата(ДатаНачала);
	ДатаО = Дата(ДатаОкончания);
	
	МассивВозврата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаН);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(НЕ ЗначениеЗаполнено(ДатаО), ТекущаяДата(), ДатаО));
	Запрос.УстановитьПараметр("ИНН", Константы.ОсновнаяОрганизация.Получить().ИНН); 
	Запрос.УстановитьПараметр("ВидДенежныхСредствНаличные", Перечисления.ВидыДенежныхСредств.Наличные);
	
	//Исключаем документы кросс-докинга
	Запрос.УстановитьПараметр("МассивДокументовКросс", ПолучитьОбщийМассивКроссовЗаПериод(ДатаН, ДатаО)); 
	
	ТекстЗапроса = "";
	
	Если Суммировать Тогда
		
		ТекстЗапроса = ПолучитьЗапросСпискаЭлементовРегистра(Регистр, ИмяРесурса) + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Элементы.Регистратор) КАК Количество,
		|	СУММА(ВТ_Элементы.Ресурс) КАК СуммаРесурсов,
		|	МИНИМУМ(ВТ_Элементы.Регистратор.Дата) КАК ПериодНачало,
		|	МАКСИМУМ(ВТ_Элементы.Регистратор.Дата) КАК ПериодКонец
		|ИЗ
		|	ВТ_Элементы КАК ВТ_Элементы";
				
		ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверкиРегистров(Регистр);  
		
		Запрос.Текст = ТекстЗапроса;
		
		СтруктураВозврата = Новый Структура("ПериодНачало, ПериодКонец, Количество, СуммаРесурсов");
		
		Выборка = Запрос.Выполнить().Выбрать();		
		
		Если Выборка.Следующий() Тогда
			
			СтруктураВозврата.ПериодНачало = ?(ЗначениеЗаполнено(Выборка.ПериодНачало), Выборка.ПериодНачало, 0);
			СтруктураВозврата.ПериодКонец = ?(ЗначениеЗаполнено(Выборка.ПериодКонец), Выборка.ПериодКонец, 0);
			СтруктураВозврата.СуммаРесурсов = ?(ЗначениеЗаполнено(Выборка.СуммаРесурсов), Выборка.СуммаРесурсов, 0);
			СтруктураВозврата.Количество = Выборка.Количество; 
			
		КонецЕсли;  
		
		РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
			
		Возврат РезультатВыполнения; 		
					
	Иначе
		
		ТекстЗапроса = ПолучитьЗапросСпискаЭлементовРегистра(Регистр, ИмяРесурса) + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Элементы.Регистратор КАК Регистратор,
		|	ВТ_Элементы.Ресурс КАК Ресурс,
		|	ВТ_Элементы.Регистратор.Дата КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(ВТ_Элементы.Регистратор) КАК Представление
		|ИЗ
		|	ВТ_Элементы КАК ВТ_Элементы";      
		 
		ТекстЗапроса = ТекстЗапроса + ДополнитьЗапросУсловиямиСверкиРегистров(Регистр);
		
		Запрос.Текст = ТекстЗапроса;
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			МассивВозврата.Добавить(Новый Структура("GUID, Ресурс, Дата, Представление, Тип", Строка(Выборка.Регистратор.УникальныйИдентификатор()), Выборка.Ресурс, Выборка.Дата, Выборка.Представление, Выборка.Регистратор.Метаданные().Имя));
			
		КонецЦикла;			
		
	КонецЕсли;

	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
		
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьДанныеРегистровПоПериоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ПолучитьОстаткиТоварыНаСкладахНаДату(ОтборСкладыСтрокой, ДатаОкончания, ОтборНоменклатураСтрокой, ОтборВидНоменклатурыСтрокой)

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ПолучитьОстаткиТоварыНаСкладахНаДату");
	
	//ОТБОР ПО СКЛАДАМ  
	МассивСкладов = Новый Массив; 

	Если ЗначениеЗаполнено(ОтборСкладыСтрокой) Тогда
		
		ОтборСклады = СтрокаВМассивСтрок(ОтборСкладыСтрокой, ";");
				
		Для Каждого Скл из ОтборСклады Цикл  
			
			СкладСсылка = Справочники.Склады.НайтиПоРеквизиту("КодМДМ", Скл);
			
			Если ЗначениеЗаполнено(СкладСсылка) Тогда
				МассивСкладов.Добавить(СкладСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найден склад в базе УТ10 по коду МДМ " + Скл);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	

	КонецЕсли;

	//ОТБОР ПО НОМЕНКЛАТУРЕ      
	МассивНоменклатуры = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОтборНоменклатураСтрокой) Тогда
		
		ОтборНоменклатура = СтрокаВМассивСтрок(ОтборНоменклатураСтрокой, ";");
	
		Для Каждого Ном из ОтборНоменклатура Цикл  
			
			НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Ном);
			
			Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				МассивНоменклатуры.Добавить(НоменклатураСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена номенклатура в базе УТ10 по коду МДМ " + Ном);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;
	
	//ОТБОР ПО ВИДУ НОМЕНКЛАТУРЫ
	МассивВидаНоменклатуры = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОтборВидНоменклатурыСтрокой) Тогда
		
		ОтборВидНоменклатуры = СтрокаВМассивСтрок(ОтборВидНоменклатурыСтрокой, ";");
	
		Для Каждого ВидНом из ОтборВидНоменклатуры Цикл  
			
			ВидНомСсылка = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("КодМДМ", ВидНом);
			
			Если ЗначениеЗаполнено(ВидНомСсылка) Тогда    
				
				Если СокрЛП(ВидНомСсылка.Наименование) = "Товар" Тогда
					МассивВидаНоменклатуры.Добавить(ВидНомСсылка);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;	
	
	ДатаОстатков = КонецДня(ДатаОкончания)+1;
	
	МассивВозврата = Новый Массив;
		
	Запрос = Новый Запрос;   
	                 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТоварыНаСкладахОстатки.Склад.КодМДМ КАК КодМДМ_Склад,
	              |	ТоварыНаСкладахОстатки.Номенклатура.Наименование КАК Наименование,
	              |	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Бит_ИнвентарныйНомер,
	              |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Остаток,
	              |	ТоварыНаСкладахОстатки.Номенклатура.КодМДМ КАК КодМДМ_Номенклатура
	              |ИЗ
	              |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	              |			&Д,
	              |			   3 = 3
	              |				И 2 = 2 И 1 = 1) КАК ТоварыНаСкладахОстатки";
	
	Если МассивНоменклатуры.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Номенклатура В (&МассивНоменклатуры)");
		Запрос.УстановитьПараметр("МассивНоменклатуры",  МассивНоменклатуры);	
		
	КонецЕсли;
	
	Если МассивСкладов.Количество()>0 Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Склад В (&МассивСкладов)");
		Запрос.УстановитьПараметр("МассивСкладов",  МассивСкладов); 
	
	КонецЕсли;
	
	Если МассивВидаНоменклатуры.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "3 = 3", "Номенклатура.ВидНоменклатуры В (&МассивВидаНоменклатуры)");
        Запрос.УстановитьПараметр("МассивВидаНоменклатуры",  МассивВидаНоменклатуры);  
		
	ИначеЕсли ЗначениеЗаполнено(ОтборВидНоменклатурыСтрокой) Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "3 = 3", "Не Номенклатура.ВидНоменклатуры = &ВидНоменклатурыТовар");
		Запрос.УстановитьПараметр("ВидНоменклатурыТовар",  Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар", Истина)); 
   		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Д", ДатаОстатков);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Новый Структура("КодМДМ_Склад, КодМДМ_Номенклатура, Наименование, Бит_ИнвентарныйНомер, Остаток", Результат.КодМДМ_Склад, Результат.КодМДМ_Номенклатура, Результат.Наименование, Результат.Бит_ИнвентарныйНомер, Результат.Остаток));	
	КонецЦикла;
	
	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьОстаткиТоварыНаСкладахНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
		
КонецФункции

Функция ПолучитьОборотыТоварыНаСкладахЗаПериод(ОтборСкладыСтрокой, ДатаНачала, ДатаОкончания, ОтборНоменклатураСтрокой)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ПолучитьОборотыТоварыНаСкладахЗаПериод");
	
	//ОТБОР ПО СКЛАДАМ  
	МассивСкладов = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОтборСкладыСтрокой) Тогда
		
		ОтборСклады = СтрокаВМассивСтрок(ОтборСкладыСтрокой, ";");

		Для Каждого Скл из ОтборСклады Цикл  
			
			СкладСсылка = Справочники.Склады.НайтиПоРеквизиту("КодМДМ", Скл);
			
			Если ЗначениеЗаполнено(СкладСсылка) Тогда
				МассивСкладов.Добавить(СкладСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найден склад в базе УТ10 по коду МДМ " + Скл);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;
	
	//ОТБОР ПО НОМЕНКЛАТУРЕ    
	МассивНоменклатуры = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборНоменклатураСтрокой) Тогда
		
		ОтборНоменклатура = СтрокаВМассивСтрок(ОтборНоменклатураСтрокой, ";");

		Для Каждого Ном из ОтборНоменклатура Цикл  
			
			НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Ном);
			
			Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				МассивНоменклатуры.Добавить(НоменклатураСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена номенклатура в базе УТ10 по коду МДМ " + Ном);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	 
	
	КонецЕсли;

	МассивВозврата = Новый Массив;
		
	Запрос = Новый Запрос;   
	                 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТоварыНаСкладахОстаткиИОбороты.Склад.КодМДМ КАК КодМДМ_Склад,
	              |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Наименование КАК Наименование,
	              |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.Артикул КАК Бит_ИнвентарныйНомер,
	              |	ТоварыНаСкладахОстаткиИОбороты.Номенклатура.КодМДМ КАК КодМДМ_Номенклатура,
	              |	ТоварыНаСкладахОстаткиИОбороты.Регистратор,
	              |	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток,
	              |	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток,
	              |	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход,
	              |	ТоварыНаСкладахОстаткиИОбороты.КоличествоРасход,
	              |	ПРЕДСТАВЛЕНИЕ(ТоварыНаСкладахОстаткиИОбороты.Регистратор)
	              |ИЗ
	              |	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(
	              |			&НачДата,
	              |			&КонДата,
	              |			Регистратор,
	              |			,
	              |			
	              |				2 = 2
	              |				И 1 = 1) КАК ТоварыНаСкладахОстаткиИОбороты";
  
	Если МассивНоменклатуры.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Номенклатура В (&МассивНоменклатуры)");
		Запрос.УстановитьПараметр("МассивНоменклатуры",  МассивНоменклатуры);	
		
	КонецЕсли;
	
	Если МассивСкладов.Количество()>0 Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Склад В (&МассивСкладов)");
		Запрос.УстановитьПараметр("МассивСкладов",  МассивСкладов); 
	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачДата", ДатаНачала);
	Запрос.УстановитьПараметр("КонДата", КонецДня(ДатаОкончания)+1);

	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл  
		
		Структура = Новый Структура;  
		
		Если ЗначениеЗаполнено(Результат.Регистратор) Тогда
			РегистраторКод = Строка(Результат.Регистратор.УникальныйИдентификатор());
		Иначе
			РегистраторКод = "";
		КонецЕсли;
		
		Структура.Вставить("РегистраторКод", РегистраторКод);
		Структура.Вставить("РегистраторПредставление", ?(ЗначениеЗаполнено(Результат.РегистраторПредставление), Результат.РегистраторПредставление, ""));
		Структура.Вставить("КодМДМ_Склад", Результат.КодМДМ_Склад);
		Структура.Вставить("КодМДМ_Номенклатура", Результат.КодМДМ_Номенклатура);
        Структура.Вставить("Наименование", Результат.Наименование);
		Структура.Вставить("Бит_ИнвентарныйНомер", Результат.Бит_ИнвентарныйНомер);
        Структура.Вставить("КоличествоНачальныйОстаток", Результат.КоличествоНачальныйОстаток);
		Структура.Вставить("КоличествоПриход", Результат.КоличествоПриход);
        Структура.Вставить("КоличествоРасход", Результат.КоличествоРасход);
		Структура.Вставить("КоличествоКонечныйОстаток", Результат.КоличествоКонечныйОстаток);

		МассивВозврата.Добавить(Структура);
		
	КонецЦикла;
	
	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьОборотыТоварыНаСкладахЗаПериод " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	  
КонецФункции

Функция ПолучитьОстаткиДенежныеСредстваНаДату(ОтборОрганизацииСтрокой, ОтборКассыСтрокой, ДатаОкончания)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ПолучитьОстаткиДенежныеСредстваНаДату");
	
	ДатаОстатков = КонецДня(ДатаОкончания)+1;
	
	//ОТБОР ПО ОРГАНИЗАЦИЯМ  
	МассивОрганизаций = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборОрганизацииСтрокой) Тогда
		
		ОтборОрганизации = СтрокаВМассивСтрок(ОтборОрганизацииСтрокой, ";");

		Для Каждого Орг из ОтборОрганизации Цикл  
			
			ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("КодМДМГоловнойОрганизации", Орг);
			
			Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
				МассивОрганизаций.Добавить(ОрганизацияСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена организация в базе УТ10 по коду МДМ " + Орг);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;		

	КонецЕсли;

	//ОТБОР ПО КАССАМ   
	ОтборКассы = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборКассыСтрокой) Тогда
		
		ОтборКассы = СтрокаВМассивСтрок(ОтборКассыСтрокой, ";");  
		
		Для Каждого Касса из ОтборКассы Цикл  
			
			КассаСсылка = Справочники.Кассы.НайтиПоРеквизиту("КодМДМГоловнойКассы", Касса);
			
			Если Не ЗначениеЗаполнено(КассаСсылка) Тогда

				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена касса в базе УТ10 по коду МДМ " + Касса);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Запрос = Новый Запрос;   
	                 
	Запрос.Текст ="ВЫБРАТЬ
	              |	ДенежныеСредстваОстатки.Организация.КодМДМГоловнойОрганизации КАК ОрганизацияКодМДМ,
	              |	ДенежныеСредстваОстатки.БанковскийСчетКасса.КодМДМГоловнойКассы КАК КассаКодМДМ,
	              |	ДенежныеСредстваОстатки.СуммаОстаток,
	              |	ДенежныеСредстваОстатки.Организация.Наименование,
	              |	ЕСТЬNULL(Кассы.Наименование, """") КАК КассаНаименование
	              |ПОМЕСТИТЬ ВТ
	              |ИЗ
	              |	РегистрНакопления.ДенежныеСредства.Остатки(
	              |			&ДатаОстатков,
	              |			1 = 1
	              |				И ВидДенежныхСредств = &Наличные
	              |				И 2 = 2) КАК ДенежныеСредстваОстатки
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	              |		ПО ДенежныеСредстваОстатки.БанковскийСчетКасса.КодМДМГоловнойКассы = Кассы.КодМДМ
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ.ОрганизацияКодМДМ,
	              |	ВТ.КассаКодМДМ,
	              |	СУММА(ВТ.СуммаОстаток) КАК СуммаОстаток,
	              |	ВТ.ОрганизацияНаименование,
	              |	ВТ.КассаНаименование
	              |ИЗ
	              |	ВТ КАК ВТ
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	ВТ.ОрганизацияКодМДМ,
	              |	ВТ.КассаКодМДМ,
	              |	ВТ.ОрганизацияНаименование,
	              |	ВТ.КассаНаименование"; 
	
	Если ОтборКассы.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "БанковскийСчетКасса.КодМДМГоловнойКассы В (&ОтборКассы)");
		Запрос.УстановитьПараметр("ОтборКассы",  ОтборКассы);	
		
	КонецЕсли;
	
	Если МассивОрганизаций.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Организация В (&МассивОрганизаций)");
		Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);	
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Наличные",  Перечисления.ВидыДенежныхСредств.Наличные);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;

	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Новый Структура("ОрганизацияКодМДМ, ОрганизацияНаименование, КассаКодМДМ, КассаНаименование, СуммаОстаток", Результат.ОрганизацияКодМДМ, Результат.ОрганизацияНаименование, Результат.КассаКодМДМ, Результат.КассаНаименование, Результат.СуммаОстаток));	
	КонецЦикла;

	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьОстаткиДенежныеСредстваНаДату " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьОборотыДенежныеСредстваЗаПериод(ОтборОрганизацииСтрокой, ОтборКассыСтрокой, ДатаНачала, ДатаОкончания)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ПолучитьОборотыДенежныеСредстваЗаПериод");
	
	ДатаОстатков = КонецДня(ДатаОкончания)+1;
	
	//ОТБОР ПО ОРГАНИЗАЦИЯМ  
	МассивОрганизаций = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборОрганизацииСтрокой) Тогда
		
		ОтборОрганизации = СтрокаВМассивСтрок(ОтборОрганизацииСтрокой, ";");

		Для Каждого Орг из ОтборОрганизации Цикл  
			
			ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("КодМДМГоловнойОрганизации", Орг);
			
			Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
				МассивОрганизаций.Добавить(ОрганизацияСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена организация в базе УТ10 по коду МДМ " + Орг);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;		

	КонецЕсли;
	
	//ОТБОР ПО КАССАМ   
	ОтборКассы = Новый Массив;
	
	Если ЗначениеЗаполнено(ОтборКассыСтрокой) Тогда
		
		ОтборКассы = СтрокаВМассивСтрок(ОтборКассыСтрокой, ";");  
		
		Для Каждого Касса из ОтборКассы Цикл  
			
			КассаСсылка = Справочники.Кассы.НайтиПоРеквизиту("КодМДМГоловнойКассы", Касса);
			
			Если Не ЗначениеЗаполнено(КассаСсылка) Тогда 
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена касса в базе УТ10 по коду МДМ " + Касса);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;

	Запрос 		 = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваОстаткиИОбороты.Регистратор,
	               |	ДенежныеСредстваОстаткиИОбороты.БанковскийСчетКасса.КодМДМГоловнойКассы КАК КассаКодМДМ,
	               |	ДенежныеСредстваОстаткиИОбороты.Организация.КодМДМГоловнойОрганизации КАК ОрганизацияКодМДМ,
	               |	ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток,
	               |	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток,
	               |	ДенежныеСредстваОстаткиИОбороты.СуммаПриход,
	               |	ДенежныеСредстваОстаткиИОбороты.СуммаРасход,
	               |	ПРЕДСТАВЛЕНИЕ(ДенежныеСредстваОстаткиИОбороты.Регистратор),
	               |	ДенежныеСредстваОстаткиИОбороты.Организация.Наименование,
	               |	ЕСТЬNULL(Кассы.Наименование, """") КАК КассаНаименование
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			Регистратор,
	               |			,
	               |			1 = 1
	               |				И ВидДенежныхСредств = &Наличные
	               |				И 2 = 2) КАК ДенежныеСредстваОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	               |		ПО ДенежныеСредстваОстаткиИОбороты.БанковскийСчетКасса.КодМДМГоловнойКассы = Кассы.КодМДМ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Регистратор,
	               |	ВТ.КассаКодМДМ,
	               |	ВТ.ОрганизацияКодМДМ,
	               |	СУММА(ВТ.СуммаНачальныйОстаток) КАК СуммаНачальныйОстаток,
	               |	СУММА(ВТ.СуммаКонечныйОстаток) КАК СуммаКонечныйОстаток,
	               |	СУММА(ВТ.СуммаПриход) КАК СуммаПриход,
	               |	СУММА(ВТ.СуммаРасход) КАК СуммаРасход,
	               |	ВТ.РегистраторПредставление,
	               |	ВТ.ОрганизацияНаименование,
	               |	ВТ.КассаНаименование
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Регистратор,
	               |	ВТ.КассаКодМДМ,
	               |	ВТ.ОрганизацияКодМДМ,
	               |	ВТ.РегистраторПредставление,
	               |	ВТ.ОрганизацияНаименование,
	               |	ВТ.КассаНаименование";
	
	
	Если ОтборКассы.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "БанковскийСчетКасса.КодМДМГоловнойКассы В (&ОтборКассы)");
		Запрос.УстановитьПараметр("ОтборКассы",  ОтборКассы);	
		
	КонецЕсли;

	Если МассивОрганизаций.Количество()>0 Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "Организация В (&МассивОрганизаций)");
		Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);	
		
	КонецЕсли;

	Запрос.УстановитьПараметр("Наличные",  Перечисления.ВидыДенежныхСредств.Наличные); 
	Запрос.УстановитьПараметр("НачДата", ДатаНачала);
	Запрос.УстановитьПараметр("КонДата", ДатаОстатков);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;

	Пока Результат.Следующий() Цикл    
		
		Если ЗначениеЗаполнено(Результат.Регистратор) Тогда
			РегистраторКод = Строка(Результат.Регистратор.УникальныйИдентификатор());
		Иначе
			РегистраторКод = "";
		КонецЕсли;

		МассивВозврата.Добавить(Новый Структура("ОрганизацияКодМДМ, ОрганизацияНаименование, КассаКодМДМ, КассаНаименование, РегистраторПредставление, РегистраторКод, СуммаНачальныйОстаток, СуммаПриход, СуммаРасход, СуммаКонечныйОстаток", Результат.ОрганизацияКодМДМ, Результат.ОрганизацияНаименование, Результат.КассаКодМДМ, Результат.КассаНаименование, Результат.РегистраторПредставление, РегистраторКод, Результат.СуммаНачальныйОстаток, Результат.СуммаПриход, Результат.СуммаРасход, Результат.СуммаКонечныйОстаток ));	
		
	КонецЦикла;

	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ПолучитьОборотыДенежныеСредстваЗаПериод " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция СтрокаВМассивСтрок(Знач Стр, Разделитель)
	
    Результат = Новый Массив;
    
    Строки = СтрЗаменить(Стр, Разделитель, Символы.ПС);
    
    Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
        Результат.Добавить(СтрПолучитьСтроку(Строки, Индекс));
    КонецЦикла;
    
    Возврат Результат;
	
КонецФункции

Функция ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугИКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров()

//+Бычков О. 28.08.2025 #UT10-5397
// Вставка
	ТекРезультат = "НЕ ВТ_Элементы.Ссылка.Контрагент.ИНН ЕСТЬ NULL И НЕ ВТ_Элементы.Ссылка.Организация.ИНН ЕСТЬ NULL И ВТ_Элементы.Ссылка.Контрагент.ИНН = ВТ_Элементы.Ссылка.Организация.ИНН";
	Возврат ТекРезультат;
//-Бычков О. 28.08.2025 #UT10-5397

КонецФункции // ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугИКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров()

Функция ПолучитьТекстУсловияВыгрузкиКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров()

//+Бычков О. 28.08.2025 #UT10-5397
// Вставка
	Возврат ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугИКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров();
//-Бычков О. 28.08.2025 #UT10-5397

КонецФункции // ПолучитьТекстУсловияВыгрузкиКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров()

Функция ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугВПеремещениеТоваров()
//+Бычков О. 31.07.2026 #UT10-5984
// Вставка

	Возврат ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугИКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров();

//-Бычков О. 31.07.2026 #UT10-5984
КонецФункции


//+Бычков О. 28.08.2025 #UT10-5397
// Было
//Функция ДополнитьЗапросУсловиямиСверки(ТипЭлемента)
// Стало
Функция ДополнитьЗапросУсловиямиСверки(ТипЭлемента, Знач пТипЭлементаКорреспондента, пЗапрос)
//-Бычков О. 28.08.2025 #UT10-5397
	
	ТекстЗапроса = "";
	
	Если ТипЭлемента = "РеализацияТоваровУслуг" ИЛИ ТипЭлемента = "КорректировкаРеализации" Тогда		
		ТекстЗапроса = ТекстЗапроса + " НЕ ЕСТЬNULL(ВТ_Элементы.Ссылка.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение, Ложь) И НЕ ВТ_Элементы.Ссылка В (&МассивДокументовКросс)";		
	ИначеЕсли ТипЭлемента = "СчетФактураВыданный" Тогда
		ТекстЗапроса = ТекстЗапроса + " НЕ ЕСТЬNULL(ВТ_Элементы.Ссылка.ДокументОснование.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение, Ложь) И НЕ ВТ_Элементы.Ссылка В (&МассивДокументовКросс)";
	ИначеЕсли ТипЭлемента = "ПоступлениеТоваровУслуг" Тогда
		ТекстЗапроса = ТекстЗапроса + " НЕ ВТ_Элементы.Ссылка.Контрагент.ИНН = &ИНН";
	ИначеЕсли ТипЭлемента = "ПеремещениеТоваровМеждуСкладами" Тогда 
		ТекстЗапроса = ТекстЗапроса + " 
		|		ВЫБОР
		|			КОГДА ВТ_Элементы.Ссылка ССЫЛКА Документ.РеализацияТоваровУслуг
		|				ТОГДА ЕСТЬNULL(ВТ_Элементы.Ссылка.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение, ЛОЖЬ)
		|			КОГДА ВТ_Элементы.Ссылка ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|					И (НЕ ВТ_Элементы.Ссылка.ТранзитнаяПоставка ИЛИ ВТ_Элементы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПТУ.Закрыт))
		|				ТОГДА ВТ_Элементы.Ссылка.Контрагент.ИНН = &ИНН
		//+Бычков О. 28.07.2026 #UT10-5977
		// Вставка
		|			КОГДА ВТ_Элементы.Ссылка ССЫЛКА Документ.ПоступлениеТоваровНаОтветственноеХранение
		|				ТОГДА Истина
		//-Бычков О. 28.07.2026 #UT10-5977
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ"; 
	ИначеЕсли ТипЭлемента = "КорректировкаДолга" Тогда
		ТекстЗапроса = ТекстЗапроса + " НЕ ВТ_Элементы.Ссылка.НеОтправлятьДокументВУчетныеСистемы";   
	ИначеЕсли ТипЭлемента = "ВозвратТоваровПоставщику" Тогда
		ТекстЗапроса = ТекстЗапроса + " ВТ_Элементы.Ссылка.Контрагент = &ОсновнойПоставщик";
	ИначеЕсли ТипЭлемента = "АктВыполненныхРабот" Тогда
		ТекстЗапроса = ТекстЗапроса + " ВТ_Элементы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусАктаВыполненныхРабот.КОплате)"; 
	//+Бычков О. 28.08.2025 #UT10-5397
	// Вставка
	ИначеЕсли ТипЭлемента = "ВыкупСОтветственногоХранения" Тогда
	
		ТекДатаСменыОП_ГП = Константы.ДатаСменыОП_ГП.Получить();
		пЗапрос.УстановитьПараметр("ДатаСменыОП_ГП", ТекДатаСменыОП_ГП);
		пЗапрос.УстановитьПараметр("ДатаСменыОП_ГПЗаполнена", ЗначениеЗаполнено(ТекДатаСменыОП_ГП));
		пЗапрос.УстановитьПараметр("ПополнениеДляОбособленногоПодразделенияЮЛ", Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить());
		пЗапрос.УстановитьПараметр("ПустойФилиал", Метаданные.Документы.ВыкупСОтветственногоХранения.Реквизиты.Филиал.Тип.ПривестиЗначение(Неопределено));
		
		ТекстУсловияЭтоОП = "ВЫБОР
			|			КОГДА &ДатаСменыОП_ГПЗаполнена
			|				ТОГДА &ПополнениеДляОбособленногоПодразделенияЮЛ = ИСТИНА И ВТ_Элементы.Ссылка.Дата >= &ДатаСменыОП_ГП
			|					ИЛИ &ПополнениеДляОбособленногоПодразделенияЮЛ = ЛОЖЬ И ВТ_Элементы.Ссылка.Дата < &ДатаСменыОП_ГП
			|			ИНАЧЕ &ПополнениеДляОбособленногоПодразделенияЮЛ
			|		КОНЕЦ"; 
		
		ТекстУсловияВыгрузкиВПеремещение = "ВЫБОР
			|			КОГДА 
			|				" + ТекстУсловияЭтоОП + "
			|				ТОГДА Истина
			|			ИНАЧЕ НЕ ВТ_Элементы.Ссылка.Филиал = &ПустойФилиал И НЕ ВТ_Элементы.Ссылка.Статус = Значение(Перечисление.СтатусыТОХ.ВозвратПоБраку)
			|		КОНЕЦ"; 
		
		Если пТипЭлементаКорреспондента = "ПеремещениеТоваров" Тогда
			
			ТекстЗапроса = ТекстЗапроса + " 
				|		" + ТекстУсловияВыгрузкиВПеремещение; 
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + " 
				|		НЕ (" + ТекстУсловияВыгрузкиВПеремещение + ")"; 
			
		КонецЕсли;
		
	ИначеЕсли ТипЭлемента = "КорректировкаПоступления" Тогда
		
		ТекстУсловияВыгрузкиВПеремещение = ПолучитьТекстУсловияВыгрузкиКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров();
		
		Если пТипЭлементаКорреспондента = "ПеремещениеТоваров" Тогда
			
			ТекстЗапроса = ТекстЗапроса + " 
				|		" + ТекстУсловияВыгрузкиВПеремещение; 
			
		Иначе
			
			ТекстЗапроса = ТекстЗапроса + " 
				|		НЕ (" + ТекстУсловияВыгрузкиВПеремещение + ")"; 
			
		КонецЕсли;
	//+Бычков О. 31.07.2026 #UT10-5984
	// Вставка
	ИначеЕсли ТипЭлемента = "СчетФактураПолученный" Тогда
		
		ТекТекстУсловияВыгрузкиПТУВПеремещение = ПолучитьТекстУсловияВыгрузкиПоступленияТоваровИУслугВПеремещениеТоваров();
		
		ТекТекстУсловияВыгрузкиПТУВПеремещение = СтрЗаменить(ТекТекстУсловияВыгрузкиПТУВПеремещение, "ВТ_Элементы.Ссылка", "Выразить(ВТ_Элементы.Ссылка.ДокументОснование КАК Документ.ПоступлениеТоваровУслуг)");

		ТекТекстУсловияВыгрузкиКорПТУВПеремещение = ПолучитьТекстУсловияВыгрузкиКорректировкиПоступленияТоваровИУслугВПеремещениеТоваров();
		
		ТекТекстУсловияВыгрузкиКорПТУВПеремещение = СтрЗаменить(ТекТекстУсловияВыгрузкиКорПТУВПеремещение, "ВТ_Элементы.Ссылка", "Выразить(ВТ_Элементы.Ссылка.ДокументОснование КАК Документ.КорректировкаПоступления)");
		
		ТекстЗапроса = ТекстЗапроса + " 
			|		ВЫБОР
			|			КОГДА ВТ_Элементы.Ссылка.ДокументОснование ССЫЛКА Документ.ПоступлениеТоваровУслуг
			|				ТОГДА НЕ (" + ТекТекстУсловияВыгрузкиПТУВПеремещение + ")
			|			КОГДА ВТ_Элементы.Ссылка.ДокументОснование ССЫЛКА Документ.КорректировкаПоступления
			|				ТОГДА НЕ (" + ТекТекстУсловияВыгрузкиКорПТУВПеремещение + ")
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ";
		
	//-Бычков О. 31.07.2026 #UT10-5984	
	//-Бычков О. 28.08.2025 #UT10-5397
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ТекстЗапроса = " ГДЕ " + ТекстЗапроса;		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ДополнитьЗапросУсловиямиСверкиРегистров(ТипЭлемента)

	//Адаптация условий функции ДополнитьЗапросУсловиямиСверки под регистры
	
	ТекстЗапроса = "";
	
	Если ТипЭлемента = "ТоварыНаСкладах" Тогда
		
		ТекстЗапроса = "ВЫБОР
					   |	КОГДА ТИПЗНАЧЕНИЯ(ВТ_Элементы.Регистратор) = ТИП(Документ.РеализацияТоваровУслуг) ИЛИ ТИПЗНАЧЕНИЯ(ВТ_Элементы.Регистратор) = ТИП(Документ.КорректировкаРеализации)
					   |		ТОГДА НЕ ВТ_Элементы.Регистратор В (&МассивДокументовКросс)
					   |	ИНАЧЕ
					   |		ИСТИНА
					   |	КОНЕЦ";   
	
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
		ТекстЗапроса = " ГДЕ " + ТекстЗапроса;		
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьЗапросСпискаЭлементов(ТипЭлемента)
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Элементы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ВерсияНачало <> 0
	|				ТОГДА РеализацияТоваровУслуг.Ссылка.ШтампВерсии >= &ВерсияНачало
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ВерсияКонец <> 0
	|				ТОГДА РеализацияТоваровУслуг.Ссылка.ШтампВерсии <= &ВерсияКонец
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И РеализацияТоваровУслуг.Дата Между &ДатаНачала И &ДатаОкончания";	
	
	Если ТипЭлемента = "ПеремещениеТоваровМеждуСкладами" Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ВерсияНачало <> 0
		|				ТОГДА ПоступлениеТоваровУслуг.Ссылка.ШтампВерсии >= &ВерсияНачало
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ВерсияКонец <> 0
		|				ТОГДА ПоступлениеТоваровУслуг.Ссылка.ШтампВерсии <= &ВерсияКонец
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ПоступлениеТоваровУслуг.Дата Между &ДатаНачала И &ДатаОкончания"; 
		
	//+Бычков О. 28.07.2026 #UT10-5977
	// Вставка
		ТекстЗапроса = ТекстЗапроса 
		+ "
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|" 
		+ "ВЫБРАТЬ
		  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка
		  |ИЗ
		  |	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение,
		  |	Константы КАК Константы
		  |ГДЕ
		  |	ВЫБОР
		  |			КОГДА &ВерсияНачало <> 0
		  |				ТОГДА ПоступлениеТоваровНаОтветственноеХранение.Ссылка.ШтампВерсии >= &ВерсияНачало
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ
		  |	И ВЫБОР
		  |			КОГДА &ВерсияКонец <> 0
		  |				ТОГДА ПоступлениеТоваровНаОтветственноеХранение.Ссылка.ШтампВерсии <= &ВерсияКонец
		  |			ИНАЧЕ ИСТИНА
		  |		КОНЕЦ
		  |	И ПоступлениеТоваровНаОтветственноеХранение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		  |	И &ТекстУсловияЭтоБазаОбособленногоПодразделения"; 
		
		ТекТекстУсловия = ПолучитьТекстУсловияЭтоБазаОбособленногоПодразделения("ПоступлениеТоваровНаОтветственноеХранение");
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловияЭтоБазаОбособленногоПодразделения", ТекТекстУсловия);
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслуг", ТипЭлемента);
			
		Если ТипЭлемента = "ПоступлениеТоваровУслуг" Тогда
		
			ТекстЗапроса = ТекстЗапроса 
			+ "
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|" 
			+ "ВЫБРАТЬ
			  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка
			  |ИЗ
			  |	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение,
			  |	Константы КАК Константы
			  |ГДЕ
			  |	ВЫБОР
			  |			КОГДА &ВерсияНачало <> 0
			  |				ТОГДА ПоступлениеТоваровНаОтветственноеХранение.Ссылка.ШтампВерсии >= &ВерсияНачало
			  |			ИНАЧЕ ИСТИНА
			  |		КОНЕЦ
			  |	И ВЫБОР
			  |			КОГДА &ВерсияКонец <> 0
			  |				ТОГДА ПоступлениеТоваровНаОтветственноеХранение.Ссылка.ШтампВерсии <= &ВерсияКонец
			  |			ИНАЧЕ ИСТИНА
			  |		КОНЕЦ
			  |	И ПоступлениеТоваровНаОтветственноеХранение.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			  |	И НЕ &ТекстУсловияЭтоБазаОбособленногоПодразделения"; 
			
			ТекТекстУсловия = ПолучитьТекстУсловияЭтоБазаОбособленногоПодразделения("ПоступлениеТоваровНаОтветственноеХранение");
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстУсловияЭтоБазаОбособленногоПодразделения", ТекТекстУсловия);
			
		КонецЕсли;
	//-Бычков О. 28.07.2026 #UT10-5977
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";       
	
	//+Бычков О. 28.07.2026 #UT10-5977
	// Было
	//Если ТипЭлемента = "ПеремещениеТоваровМеждуСкладами" Тогда
	//	//Для перемещений используется объединенный запрос с реализацями (с отборами) и поступлениями			
	//Иначе     
	//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РеализацияТоваровУслуг", ТипЭлемента);
	//КонецЕсли;
	// Стало
	// Перенёс это выше, поскольку там уже проверяются и обрабатываются нужные условия.
	//-Бычков О. 28.07.2026 #UT10-5977
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьЗапросСпискаЭлементовРегистра(ТипЭлемента, ИмяРесурса)

	ТекстЗапроса = "ВЫБРАТЬ
	               |	РегистрНакопления.Регистратор КАК Регистратор,
	               |	РегистрНакопления." + ИмяРесурса + "Оборот КАК Ресурс
	               |ПОМЕСТИТЬ ВТ_Элементы
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, 1 = 1) КАК РегистрНакопления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
				   |;";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТоварыНаСкладах", ТипЭлемента);
	
	Если ТипЭлемента = "ДенежныеСредства" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1 = 1", "ВидДенежныхСредств = &ВидДенежныхСредствНаличные");	
	КонецЕсли;

	Возврат ТекстЗапроса;

КонецФункции

Функция ПолучитьИмяПриложения()
	
	Возврат Константы.AMQP_ИдентификаторИнформацСистемы.Получить();

КонецФункции

Процедура НастроитьЗапросОстатковТоваровОрганизаций(Запрос, 
	Детально, МассивОрганизаций, МассивСкладов, МассивНоменклатуры, МассивВидаНоменклатуры, Знач ОтборВидНоменклатурыСтрокой)
//+Бычков О. 01.09.2025 #UT10-5403
// Вставка
	
	Если Детально Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТоварыОрганизацийМТОстаткиИОбороты.Регистратор КАК Регистратор,
		               |	ПРЕДСТАВЛЕНИЕ(ТоварыОрганизацийМТОстаткиИОбороты.Регистратор),
		               |	ТоварыОрганизацийМТОстаткиИОбороты.Организация.КодМДМ,
		               |	&КодМДМОсновногоСклада КАК СкладКодМДМ,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура.Наименование КАК НоменклатураНаименование,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура.Артикул КАК НоменклатураИнвентарныйНомер,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоНачальныйОстаток,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоПриход,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоРасход,
		               |	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоКонечныйОстаток,
		               |	ЛОЖЬ КАК ТОХ
		               |ИЗ
		               |	РегистрНакопления.ТоварыОрганизацийМТ.ОстаткиИОбороты(&ДатаНачала, &Дата, Регистратор, , &ТекстДополнительныхУсловийПоТоварамОрганизацийМТ) КАК ТоварыОрганизацийМТОстаткиИОбороты
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТоварыОХ.Регистратор,
		               |	ПРЕДСТАВЛЕНИЕ(ТоварыОХ.Регистратор),
		               |	ТоварыОХ.Организация.КодМДМ,
		               |	&КодМДМОсновногоСклада,
		               |	ТоварыОХ.Номенклатура.КодМДМ,
		               |	ТоварыОХ.Номенклатура.Наименование,
		               |	ТоварыОХ.Номенклатура.Артикул,
		               |	СУММА(ТоварыОХ.КоличествоНачальныйОстаток),
		               |	СУММА(ТоварыОХ.КоличествоПриход),
		               |	СУММА(ТоварыОХ.КоличествоРасход),
		               |	СУММА(ТоварыОХ.КоличествоКонечныйОстаток),
		               |	ИСТИНА
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор КАК Регистратор,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Организация КАК Организация,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Номенклатура КАК Номенклатура,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
		               |		ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток
		               |	ИЗ
		               |		РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.ОстаткиИОбороты(&ДатаНачала, &Дата, Регистратор, , &ТекстДополнительныхУсловийПоТоварамТОХпоДаннымПоставщиков) КАК ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.Регистратор,
		               |		ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.Организация,
		               |		ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.Номенклатура,
		               |		-ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.КоличествоНачальныйОстаток,
		               |		-ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.КоличествоПриход,
		               |		-ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.КоличествоРасход,
		               |		-ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты.КоличествоКонечныйОстаток
		               |	ИЗ
		               |		РегистрНакопления.ТоварыОтветственногоХраненияПереданные.ОстаткиИОбороты(&ДатаНачала, &Дата, Регистратор, , &ТекстДополнительныхУсловийПоТоварамОтветственногоХраненияПереданным) КАК ТоварыОтветственногоХраненияПереданныеОстаткиИОбороты) КАК ТоварыОХ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыОХ.Регистратор,
		               |	ТоварыОХ.Организация,
		               |	ТоварыОХ.Номенклатура,
		               |	ТоварыОХ.Организация.КодМДМ,
		               |	ТоварыОХ.Номенклатура.КодМДМ,
		               |	ТоварыОХ.Номенклатура.Наименование,
		               |	ТоварыОХ.Номенклатура.Артикул
		               |
		               |ИМЕЮЩИЕ
		               |	(НЕ СУММА(ТоварыОХ.КоличествоНачальныйОстаток) = 0
		               |		ИЛИ НЕ СУММА(ТоварыОХ.КоличествоПриход) = 0
		               |		ИЛИ НЕ СУММА(ТоварыОХ.КоличествоРасход) = 0
		               |		ИЛИ НЕ СУММА(ТоварыОХ.КоличествоКонечныйОстаток) = 0)"; 
		
	Иначе
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ТоварыОрганизацийОстатки.Организация.КодМДМ,
		               |	&КодМДМОсновногоСклада КАК СкладКодМДМ,
		               |	ТоварыОрганизацийОстатки.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
		               |	ТоварыОрганизацийОстатки.Номенклатура.Наименование КАК НоменклатураНаименование,
		               |	ТоварыОрганизацийОстатки.Номенклатура.Артикул КАК НоменклатураИнвентарныйНомер,
		               |	ТоварыОрганизацийОстатки.КоличествоОстаток КАК Остаток,
		               |	ЛОЖЬ КАК ТОХ
		               |ИЗ
		               |	РегистрНакопления.ТоварыОрганизацийМТ.Остатки(&Дата, &ТекстДополнительныхУсловийПоТоварамОрганизацийМТ) КАК ТоварыОрганизацийОстатки
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ТоварыОХ.Организация.КодМДМ,
		               |	&КодМДМОсновногоСклада,
		               |	ТоварыОХ.Номенклатура.КодМДМ,
		               |	ТоварыОХ.Номенклатура.Наименование,
		               |	ТоварыОХ.Номенклатура.Артикул,
		               |	СУММА(ТоварыОХ.КоличествоОстаток),
		               |	ИСТИНА
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		ТоварыТОХпоДаннымПоставщиковОстатки.Организация КАК Организация,
		               |		ТоварыТОХпоДаннымПоставщиковОстатки.Номенклатура КАК Номенклатура,
		               |		ТоварыТОХпоДаннымПоставщиковОстатки.КоличествоОстаток КАК КоличествоОстаток
		               |	ИЗ
		               |		РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(&Дата, &ТекстДополнительныхУсловийПоТоварамТОХпоДаннымПоставщиков) КАК ТоварыТОХпоДаннымПоставщиковОстатки
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		ТоварыОтветственногоХраненияПереданныеОстатки.Организация,
		               |		ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура,
		               |		-ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток
		               |	ИЗ
		               |		РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(&Дата, &ТекстДополнительныхУсловийПоТоварамОтветственногоХраненияПереданным) КАК ТоварыОтветственногоХраненияПереданныеОстатки) КАК ТоварыОХ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТоварыОХ.Организация,
		               |	ТоварыОХ.Номенклатура,
		               |	ТоварыОХ.Организация.КодМДМ,
		               |	ТоварыОХ.Номенклатура.КодМДМ,
		               |	ТоварыОХ.Номенклатура.Наименование,
		               |	ТоварыОХ.Номенклатура.Артикул
		               |
		               |ИМЕЮЩИЕ
		               |	НЕ СУММА(ТоварыОХ.КоличествоОстаток) = 0"; 
		
	КонецЕсли;                  
	
	ТекОсновнойСклад = Константы.ОсновнойСклад.Получить();
	
	Запрос.УстановитьПараметр("КодМДМОсновногоСклада", ТекОсновнойСклад.КодМДМ);
	
	ТекТекстДополнительныхУсловийОтбораДанных = "";
	ТекРазделитель = "";
	
	Если ЗначениеЗаполнено(МассивОрганизаций) Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "Организация В (&Организации)");
		Запрос.УстановитьПараметр("Организации", МассивОрганизаций);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МассивНоменклатуры) Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "Номенклатура В (&Номенклатура)");
		Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
		
	КонецЕсли;

	Если МассивВидаНоменклатуры.Количество()>0 Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "Номенклатура.ВидНоменклатуры В (&МассивВидаНоменклатуры)");
		
        Запрос.УстановитьПараметр("МассивВидаНоменклатуры",  МассивВидаНоменклатуры);
		
	ИначеЕсли ЗначениеЗаполнено(ОтборВидНоменклатурыСтрокой) Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "Не Номенклатура.ВидНоменклатуры = &ВидНоменклатурыТовар");
		Запрос.УстановитьПараметр("ВидНоменклатурыТовар",  Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар", Истина)); 
   		
	КонецЕсли;

	Если ЗначениеЗаполнено(МассивСкладов) Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "&ОсновнойСклад В (&Склады)");
		Запрос.УстановитьПараметр("Склады", МассивСкладов);
		Запрос.УстановитьПараметр("ОсновнойСклад", ТекОсновнойСклад);
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстДополнительныхУсловийПоТоварамТОХпоДаннымПоставщиков", ТекТекстДополнительныхУсловийОтбораДанных);	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстДополнительныхУсловийПоТоварамОтветственногоХраненияПереданным", ТекТекстДополнительныхУсловийОтбораДанных);
	
	Если ЗначениеЗаполнено(МассивСкладов) Тогда
		
		ДобавитьКТекстуДополнительноеУсловие(ТекТекстДополнительныхУсловийОтбораДанных, ТекРазделитель, "Склад В (&Склады)");
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстДополнительныхУсловийПоТоварамОрганизацийМТ", ТекТекстДополнительныхУсловийОтбораДанных);
	
	Запрос.Текст = ТекстЗапроса;
	
//-Бычков О. 01.09.2025 #UT10-5403	
КонецПроцедуры

Функция ПолучитьДанныеОстатковТоваровОрганизаций(ДатаНачала, ДатаОкончания, ОтборОрганизацииСтрокой, ОтборСкладыСтрокой, ОтборНоменклатураСтрокой, ОтборВидНоменклатурыСтрокой, Детально)
//+Бычков О. 01.09.2025 #UT10-5403
// Вставка

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис: Запуск. ПолучитьДанныеОстатковТоваровОрганизаций");
	
	ДатаНачала = Дата(ДатаНачала);
	ДатаОстатков = Дата(ДатаОкончания);
	МассивВозврата = Новый Массив;

	//ОТБОР ПО ОРГАНИЗАЦИЯМ
	МассивОрганизаций = Новый Массив;
	Если ЗначениеЗаполнено(ОтборОрганизацииСтрокой) Тогда
		
		ОтборОрганизации = СтрокаВМассивСтрок(ОтборОрганизацииСтрокой, ";");
		
		Для Каждого Орг из ОтборОрганизации Цикл  
			
			ОрганизацияСсылка = Справочники.Организации.НайтиПоРеквизиту("КодМДМ", Орг);
			Если ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
				МассивОрганизаций.Добавить(ОрганизацияСсылка);
			Иначе         
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена организация в базе УТ10 по коду МДМ " + Орг);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения; 
				
			КонецЕсли;    
			
		КонецЦикла;
		
	КонецЕсли;
	
	//ОТБОР ПО СКЛАДАМ  
	МассивСкладов = Новый Массив; 

	Если ЗначениеЗаполнено(ОтборСкладыСтрокой) Тогда
		
		ОтборСклады = СтрокаВМассивСтрок(ОтборСкладыСтрокой, ";");
				
		Для Каждого Скл из ОтборСклады Цикл  
			
			СкладСсылка = Справочники.Склады.НайтиПоРеквизиту("КодМДМ", Скл);
			
			Если ЗначениеЗаполнено(СкладСсылка) Тогда
				МассивСкладов.Добавить(СкладСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найден склад в базе УТ10 по коду МДМ " + Скл);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	

	КонецЕсли;
	
	//ОТБОР ПО НОМЕНКЛАТУРЕ
	МассивНоменклатуры = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОтборНоменклатураСтрокой) Тогда
		
		ОтборНоменклатура = СтрокаВМассивСтрок(ОтборНоменклатураСтрокой, ";");
	
		Для Каждого Ном из ОтборНоменклатура Цикл  
			
			НоменклатураСсылка = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Ном);
			
			Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				МассивНоменклатуры.Добавить(НоменклатураСсылка);
			Иначе  
				
				СтруктураВозврата = Новый Структура;
				СтруктураВозврата.Вставить("Результат", Ложь);
				СтруктураВозврата.Вставить("Сообщение", "Не найдена номенклатура в базе УТ10 по коду МДМ " + Ном);
				
				РезультатВыполнения = ДанныеВJSON(СтруктураВозврата);
					
				Возврат РезультатВыполнения;  
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;
	
	//ОТБОР ПО ВИДУ НОМЕНКЛАТУРЫ
	МассивВидаНоменклатуры = Новый Массив; 
	
	Если ЗначениеЗаполнено(ОтборВидНоменклатурыСтрокой) Тогда
		
		ОтборВидНоменклатуры = СтрокаВМассивСтрок(ОтборВидНоменклатурыСтрокой, ";");
	
		Для Каждого ВидНом из ОтборВидНоменклатуры Цикл  
			
			ВидНомСсылка = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("КодМДМ", ВидНом);
			
			Если ЗначениеЗаполнено(ВидНомСсылка) Тогда    
				
				Если СокрЛП(ВидНомСсылка.Наименование) = "Товар" Тогда
					МассивВидаНоменклатуры.Добавить(ВидНомСсылка);	
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;	
	
	КонецЕсли;	
	
	Запрос = Новый Запрос;   

	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);   
	Запрос.УстановитьПараметр("Дата", Новый Граница(КонецДня(ДатаОстатков), ВидГраницы.Включая));
	
	НастроитьЗапросОстатковТоваровОрганизаций(Запрос, Детально, МассивОрганизаций, МассивСкладов, МассивНоменклатуры, МассивВидаНоменклатуры, ОтборВидНоменклатурыСтрокой);
	
	Выборка = Запрос.Выполнить().Выбрать();		
			
	Если НЕ Детально Тогда
		
		Пока Выборка.Следующий() Цикл		
			
			Структура = Новый Структура;      
			Структура.Вставить("ОрганизацияКодМДМ", Выборка.ОрганизацияКодМДМ);
			Структура.Вставить("СкладКодМДМ", Выборка.СкладКодМДМ);
			Структура.Вставить("НоменклатураКодМДМ", Выборка.НоменклатураКодМДМ);
			Структура.Вставить("НоменклатураНаименование", Выборка.НоменклатураНаименование);
			Структура.Вставить("НоменклатураИнвентарныйНомер", Выборка.НоменклатураИнвентарныйНомер);
			Структура.Вставить("ТОХ", Выборка.ТОХ);
			Структура.Вставить("Остаток", Выборка.Остаток);
			
			МассивВозврата.Добавить(Структура);
			
		КонецЦикла;	  
				
	Иначе

		Пока Выборка.Следующий() Цикл		
			
			Если НЕ ЗначениеЗаполнено(Выборка.Регистратор) Тогда
				Продолжить;
			КонецЕсли;
			
			Структура = Новый Структура;      
			Структура.Вставить("РегистраторИдентификатор", Строка(Выборка.Регистратор.УникальныйИдентификатор()));
			Структура.Вставить("РегистраторПредставление", ?(ЗначениеЗаполнено(Выборка.РегистраторПредставление), Выборка.РегистраторПредставление, ""));
			Структура.Вставить("ОрганизацияКодМДМ", Выборка.ОрганизацияКодМДМ);
			Структура.Вставить("СкладКодМДМ", Выборка.СкладКодМДМ);
			Структура.Вставить("НоменклатураКодМДМ", Выборка.НоменклатураКодМДМ);    
			Структура.Вставить("НоменклатураНаименование", Выборка.НоменклатураНаименование);
			Структура.Вставить("НоменклатураИнвентарныйНомер", Выборка.НоменклатураИнвентарныйНомер);
			Структура.Вставить("ТОХ", Выборка.ТОХ);
			Структура.Вставить("НачальныйОстаток", Выборка.КоличествоНачальныйОстаток);
			Структура.Вставить("Приход", Выборка.КоличествоПриход);
			Структура.Вставить("Расход", Выборка.КоличествоРасход);
			Структура.Вставить("КонечныйОстаток", Выборка.КоличествоКонечныйОстаток);
			
			МассивВозврата.Добавить(Структура);
			
		КонецЦикла;		
		
	КонецЕсли;	
	
	РезультатВыполнения = ДанныеВJSON(МассивВозврата);
		
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Billing", УровеньЖурналаРегистрации.Информация,,,"Веб-сервис:Завершение. ПолучитьДанныеОстатковТоваровОрганизаций " 
	+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
//-Бычков О. 01.09.2025 #UT10-5403
КонецФункции

////////////Вспомогательные процедуры/////////////////////
Функция ДанныеВJSON(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные,, "ОбработатьНеподдерживаемоеСвойствоJSON", МСК);
	JsonСтрока = ЗаписьJSON.Закрыть(); 

	Возврат JsonСтрока;
	
КонецФункции

Процедура ДобавитьКТекстуДополнительноеУсловие(пТекст, пРазделитель, пУсловие)

//+Бычков О. 01.09.2025 #UT10-5403
// Вставка
	пТекст = пТекст 
	+ пРазделитель
	+ пУсловие;
	
	пРазделитель = " 
	|И ";
//-Бычков О. 01.09.2025 #UT10-5403	

КонецПроцедуры // ДобавитьКТекстуДополнительноеУсловие()

Функция ПолучитьТекстУсловияЭтоБазаОбособленногоПодразделения(пТаблицаДокументов, пТаблицаКонстант = "Константы")
//+Бычков О. 28.07.2026 #UT10-5977
// Вставка

	ТекРезультат = "ВЫБОР
		  |				КОГДА " + пТаблицаКонстант + ".ДатаСменыОП_ГП = ДАТАВРЕМЯ(1, 1, 1)
		  |					ТОГДА " + пТаблицаКонстант + ".ПополнениеДляОбособленногоПодразделенияЮЛ
		  |				ИНАЧЕ ВЫБОР
		  |						КОГДА " + пТаблицаКонстант + ".ПополнениеДляОбособленногоПодразделенияЮЛ
		  |								И " + пТаблицаДокументов + ".Дата >= " + пТаблицаКонстант + ".ДатаСменыОП_ГП
		  |							ТОГДА ИСТИНА
		  |						КОГДА НЕ " + пТаблицаКонстант + ".ПополнениеДляОбособленногоПодразделенияЮЛ
		  |								И " + пТаблицаДокументов + ".Дата < " + пТаблицаКонстант + ".ДатаСменыОП_ГП
		  |							ТОГДА ИСТИНА
		  |						ИНАЧЕ ЛОЖЬ
		  |					КОНЕЦ
		  |			КОНЕЦ";
	
	Возврат ТекРезультат;
	
//-Бычков О. 28.07.2026 #UT10-5977
КонецФункции

 
