#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Статус = 0 Тогда
		ПроверяемыеРеквизиты.Очистить();
	Иначе
		РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие);
		Если РеквизитыСобытия.ИсточникСобытия <> Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
			ИндексЭлемента = ПроверяемыеРеквизиты.Найти("ДатаОтправки");
			Если ИндексЭлемента <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(ИндексЭлемента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаОтправки = Неопределено;
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обработка пометки удаления
	Если Не ЭтоНовый() И Статус <> 0 Тогда
		Если Не Ссылка.ПометкаУдаления И ПометкаУдаления Тогда
			Статус = 0;
		КонецЕсли;
	КонецЕсли;
	
	ИсточникСобытия = Неопределено;
	Если ЗначениеЗаполнено(Событие) Тогда
		ИсточникСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие).ИсточникСобытия;
	КонецЕсли;
	
	ОтправкаВручную = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтправкаВручную") Тогда
		ОтправкаВручную = ДополнительныеСвойства.ОтправкаВручную;
	КонецЕсли;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка
		И Статус = 1
		И Не ОтправкаВручную Тогда
		
		// Создание регламентного задания (получение уникального идентификатора)
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание = Неопределено Тогда
			
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ПЛ_УведомленияПоРегламентнымПроверкам);
			Задание.Использование = Истина;
			Задание.Наименование = ПЛ_УведомленияОСобытиях.ПодставитьПараметрыВСтроку(НСтр("ru = 'Рассылка %1 по группе %2'"), Ссылка, Событие);
			
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ДатаНачала = ДатаОтправки;
			Расписание.ВремяНачала = ДатаОтправки;
			
			Задание.Расписание = Расписание;
			Задание.Записать();
			
			РегламентноеЗадание = Задание.УникальныйИдентификатор;
			
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			Задание.Удалить();
		КонецЕсли;
		
		РегламентноеЗадание = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭлПочта = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта);
	СервисПочтовойРассылки = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки);
	СМС = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС);
	Напоминание = (СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение);
	
	ОтправкаВручную = Ложь;
	Если ДополнительныеСвойства.Свойство("ОтправкаВручную") Тогда
		ОтправкаВручную = ДополнительныеСвойства.ОтправкаВручную;
	КонецЕсли;
	
	РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие);
	
	Если РеквизитыСобытия.ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка
		И Статус = 1
		И Не ОтправкаВручную
		И ЗначениеЗаполнено(ДатаОтправки) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			
			ЗаданиеИзменено = Ложь;
			
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ДатаНачала = ДатаОтправки;
			Расписание.ВремяНачала = ДатаОтправки;
			
			Если Строка(Расписание) <> Строка(Задание.Расписание) Тогда
				Задание.Расписание = Расписание;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			НаименованиеЗадания = ПЛ_УведомленияОСобытиях.ПодставитьПараметрыВСтроку(НСтр("ru = 'Рассылка %1 по группе %2'"), Ссылка, Событие);
			Если Задание.Наименование <> НаименованиеЗадания Тогда
				Задание.Наименование = НаименованиеЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Задание.Использование <> Булево(Статус) Тогда
				Задание.Использование = Статус;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Задание.Параметры.Количество() <> 1 Или Задание.Параметры[0] <> Событие Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка.Событие);
				ПараметрыЗадания.Добавить(Ссылка);
				Задание.Параметры = ПараметрыЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если ЗаданиеИзменено Тогда
				Задание.Записать();
			КонецЕсли;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли