//+Пашкин О.А. 08.09.2025 #UT10-5414
Перем ПроверкаУсловияНетДанныхКМаркировке Экспорт; 	
//-Пашкин О.А. 08.09.2025 #UT10-5414

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособИзготовления, СпособВводаВОборот");
	
	Заголовок = "Укажите реквизиты шапки документа";
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Заголовок = "Укажите реквизиты табличной части товары документа";
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура");
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если Товары.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Не заполнена табличная часть товары");
		Отказ = ИСТИНА;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	//+Марков И. 13.09.2025 #UT10-5421
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НЕ МАКСИМУМ(НЕ ОтчетОНанесенииКИЗТовары.ЧужойКИЗ
	|				И НЕ ОтчетОНанесенииКИЗТовары.ТоварОтсутствует
	|				И НЕ ЕСТЬNULL(ОтчетОНанесенииКИЗТовары.ШтрихКодМаркировки.СрокГодности < ОтчетОНанесенииКИЗТовары.Ссылка.Дата, Ложь)) КАК НетДанныхКМаркировке
	|ИЗ
	|	Документ.ОтчетОНанесенииКИЗ.Товары КАК ОтчетОНанесенииКИЗТовары
	|ГДЕ
	|	ОтчетОНанесенииКИЗТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтчетОНанесенииКИЗТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ПроверкаУсловияНетДанныхКМаркировке = ?(Выборка.Следующий(), Выборка.НетДанныхКМаркировке, Ложь);
	//-Марков И. 13.09.2025 #UT10-5421
	
	Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен ИЛИ ПроверкаУсловияНетДанныхКМаркировке Тогда
		
		Если ЗначениеЗаполнено(Основание) И НЕ ПроверкаУсловияНетДанныхКМаркировке Тогда
					
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.ОтчетОНанесении;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Проведен Тогда 
			
			НаборСостоянийТоваров = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
			НаборСостоянийТоваров.Отбор.Регистратор.Установить(Ссылка);
			НаборСостоянийТоваров.Записать(); 
			
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
		
		Для Каждого СтрокаТовары Из Товары Цикл
			
			Если НЕ СтрокаТовары.ТоварОтсутствует И ЗначениеЗаполнено(СтрокаТовары.ШтрихКодМаркировки) 
				И (НЕ СтрокаТовары.ШтрихКодМаркировки.СрокГодности < ЭтотОбъект.Дата ИЛИ СтрокаТовары.ЧужойКИЗ) Тогда
				
				НоваяЗапись                      = НаборЗаписей.Добавить();
				НоваяЗапись.Документ             = Ссылка;
				НоваяЗапись.ШтрихКодНоменклатуры = СтрокаТовары.ШтрихКодМаркировки;
				//+Марков И. 13.09.2025 #UT10-5421
				НоваяЗапись.СостояниеКМ          = ?(СтрокаТовары.ЧужойКИЗ, Перечисления.СостоянияКодовМаркировки.ВведенВОборот, Перечисления.СостоянияКодовМаркировки.Нанесен);    
				//-Марков И. 13.09.2025 #UT10-5421
				НоваяЗапись.Признак              = ?(СтрокаТовары.ЧужойКИЗ, Перечисления.ПризнакКодовМаркировки.ЧужойКИЗ, Перечисления.ПризнакКодовМаркировки.СвойКИЗ);  
				
			КонецЕсли;
			
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	//+Пашкин О.А. 08.09.2025 #UT10-5414	
	//Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И Тогда
	Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И НЕ ПроверкаУсловияНетДанныхКМаркировке Тогда
	//-Пашкин О.А. 08.09.2025 #UT10-5414			
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВводВОборотКИЗ.Ссылка
		|ИЗ
		|	Документ.ВводВОборотКИЗ КАК ВводВОборотКИЗ
		|ГДЕ
		|	ВводВОборотКИЗ.Основание = &Основание
		|	И ВводВОборотКИЗ.Проведен";
		
		Запрос.УстановитьПараметр("Основание",ЭтотОбъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ДанныеЗаполнения           = ЭтотОбъект; 
			
			НовыйДокументЗНЭ           = Документы.ВводВОборотКИЗ.СоздатьДокумент();	
			ЗаполнитьЗначенияСвойств(НовыйДокументЗНЭ,ДанныеЗаполнения);
			НовыйДокументЗНЭ.Основание = ЭтотОбъект.Ссылка;
			НовыйДокументЗНЭ.Номер     = "";
			НовыйДокументЗНЭ.Дата      = ТекущаяДата();                               
			НовыйДокументЗНЭ.Статус    = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен;
			
			Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл   
				
				//Марков И. 17.09.2025 #UT10-5425 добавлена проверка срока годности
				Если НЕ СтрокаТовары.ЧужойКИЗ И НЕ СтрокаТовары.ТоварОтсутствует И НЕ СтрокаТовары.ШтрихКодМаркировки.СрокГодности < ЭтотОбъект.Дата Тогда 
					НоваяСтрокаТовары = НовыйДокументЗНЭ.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаТовары); 
				КонецЕсли;                                                             
				
			КонецЦикла;
			
			НовыйДокументЗНЭ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.ВводВОборот;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

	//+Пашкин О.А. 08.09.2025 #UT10-5414	
	Если  Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан И ПроверкаУсловияНетДанныхКМаркировке Тогда
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			Если ЗначениеЗаполнено(Основание.Основание) Тогда
				
				МаркировкаОбъект = Основание.Основание.ПолучитьОбъект();
				МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Завершен;
				МаркировкаОбъект.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	//-Пашкин О.А. 08.09.2025 #UT10-5414	

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	//+Шульман А. 02.10.2025 #UT10-5445
	//Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл
		
		//Запрос = Новый Запрос;     
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	ПулКодовМаркировкиСУЗ.ДокументОснование,
		//|	ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию,
		//|	ПулКодовМаркировкиСУЗ.КодМаркировки,
		//|	ПулКодовМаркировкиСУЗ.ХешСуммаКодаМаркировки
		//|ИЗ
		//|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		//|ГДЕ
		//|	ПулКодовМаркировкиСУЗ.GTIN = &GTIN
		//|	И ПулКодовМаркировкиСУЗ.Номенклатура = &Номенклатура
		//|	И ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &ЗаказНаЭмиссию";
		//
		//Запрос.УстановитьПараметр("GTIN", СтрокаТовары.GTIN);
		//Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);  
		//Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ДанныеЗаполнения.Ссылка);  
		
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Если НЕ РезультатЗапроса.Пустой() Тогда
	//		
	//		Выборка = РезультатЗапроса.Выбрать();
	//		
	//		Пока Выборка.Следующий() Цикл
	//			
	//			НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
	//			НайденныйЭлемент = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", Выборка.КодМаркировки);
	//			НоваяСтрокаТовары.ШтрихКодМаркировки = НайденныйЭлемент;
	//			НоваяСтрокаТовары.Номенклатура = СтрокаТовары.Номенклатура;
	//			
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ") Тогда
		ЗаполнитьПоЗаказуНаЭмиссию(ДанныеЗаполнения);
	КонецЕсли;                         
	//-Шульман А. 02.10.2025 #UT10-5445
	
КонецПроцедуры

Процедура ЗаполнитьПоЗаказуНаЭмиссию(ЗаказНаЭмиссию)  
	
	//+Шульман А. 02.10.2025 #UT10-5445
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ЗаказНаЭмиссию, , "Номер, Дата");
	ЭтотОбъект.Основание = ЗаказНаЭмиссию;
	ЭтотОбъект.Дата = ТекущаяДата();         
	
	Запрос = Новый Запрос;     
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказНаЭмиссиюТовары.Номенклатура,
	|	ШтрихкодыНоменклатуры.Ссылка КАК ШтрихКодМаркировки
	|ИЗ
	|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	|			ПО ПулКодовМаркировкиСУЗ.КодМаркировки = ШтрихкодыНоменклатуры.КодМаркировки
	|		ПО ЗаказНаЭмиссиюТовары.Номенклатура = ПулКодовМаркировкиСУЗ.Номенклатура
	|			И ЗаказНаЭмиссиюТовары.GTIN = ПулКодовМаркировкиСУЗ.GTIN
	|			И (ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию = &ЗаказНаЭмиссию)
	|			И (ЗаказНаЭмиссиюТовары.Ссылка = &ЗаказНаЭмиссию)";
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссию", ЗаказНаЭмиссию);  
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл    
		
		ДобСтрока = Товары.Добавить();
		ДобСтрока.Номенклатура = Выборка.Номенклатура;
		ДобСтрока.ШтрихКодМаркировки = Выборка.ШтрихКодМаркировки;
		
	КонецЦикла;
	//-Шульман А. 02.10.2025 #UT10-5445

КонецПроцедуры

//+Пашкин О.А. 08.09.2025 #UT10-5414
ПроверкаУсловияНетДанныхКМаркировке = ЛОЖЬ;
//-Пашкин О.А. 08.09.2025 #UT10-5414
