#Область КриптоПровайдер

&НаКлиенте
Функция ПолучитьСписокКриптоПровайдеровWindows() Экспорт
	СписокПровайдеров = Новый СписокЗначений;
	СписокПровайдеров.Добавить(75, "КриптоПро CSP (ГОСТ Р 34.10-2001)");
	СписокПровайдеров.Добавить(80, "КриптоПро CSP (ГОСТ Р 34.10-2012)");

	//СписокПровайдеров.Добавить(80, "КриптоПро CSP (ГОСТ Р 34.10-2012)");
	//СписокПровайдеров.Добавить(81, "КриптоПро CSP (ГОСТ Р 34.10-2012 Strong)");
	//СписокПровайдеров.Добавить(2, "Infotecs Vipnet CSP");    
	Возврат СписокПровайдеров;
КонецФункции
&НаКлиенте
Функция ПолучитьСписокСертификатов(КриптоПровайдер) Экспорт
	СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
	Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	ПерсональноеХранилище = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;
	ХранилищеСертов = Менеджер.ПолучитьХранилищеСертификатов(ПерсональноеХранилище);
	МассивСертификатов = ХранилищеСертов.ПолучитьВсе();
	СписокЗначений = Новый СписокЗначений;
	Для Каждого Серт Из МассивСертификатов Цикл
		СписокЗначений.Добавить(Серт.Отпечаток, СформироватьИмяПоСертификату(Серт) );	
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатПоОтпечатку(КриптоПровайдер, Знач Отпечаток) Экспорт
	СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
	Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	ПерсональноеХранилище = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;
	ХранилищеСертов = Менеджер.ПолучитьХранилищеСертификатов(ПерсональноеХранилище);
	Если ТипЗнч(Отпечаток) = Тип("Строка") Тогда
		Отпечаток = ПолучитьДвоичныеДанныеИзHexСтроки(Отпечаток);
	КонецЕсли;
	Возврат ХранилищеСертов.НайтиПоОтпечатку(Отпечаток);
КонецФункции
&НаКлиенте
Функция СформироватьИмяПоСертификату(Сертификат) Экспорт
	Если ТипЗнч(Сертификат) = Тип("Строка") Тогда
		Поз = Найти(Сертификат, "CN=");
		Если Поз > 0 Тогда
			Владелец = Сред(Сертификат, Поз + 3);
			ПозРазделителя = Найти(Владелец, ",");
			Если ПозРазделителя > 0 Тогда
				Владелец = Лев(Владелец, ПозРазделителя - 1);
			КонецЕсли;
		Иначе
			Владелец = "";
		КонецЕсли;
		Поз = Найти(Сертификат, "SN=");
		Если Поз > 0 Тогда
			Владелец = Сред(Сертификат, Поз + 3);
			ПозРазделителя = Найти(Владелец, ",");
			Если ПозРазделителя > 0 Тогда
				Владелец = Лев(Владелец, ПозРазделителя - 1);
			КонецЕсли;
			Поз = Найти(Сертификат, "GN=");
			Если Поз > 0 Тогда
				Имя = Сред(Сертификат, Поз + 3);
				ПозРазделителя = Найти(Имя, ",");
				Если ПозРазделителя > 0 Тогда
					Владелец = Владелец + " " + Лев(Имя, ПозРазделителя - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Поз = Найти(Сертификат, "O=");
		Если Поз > 0 Тогда
			Организация = Сред(Сертификат, Поз + 2);
			ПозРазделителя = Найти(Организация, ",");
			Если ПозРазделителя > 0 Тогда
				Организация = Лев(Организация, ПозРазделителя - 1);
			КонецЕсли;
		Иначе
			Организация = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(Организация) ИЛИ ЗначениеЗаполнено(Владелец) Тогда
			Возврат Организация + " (" + Владелец + ")";
		Иначе
			Возврат Сертификат;
		КонецЕсли;
	Иначе
		Результат = ?(Сертификат.Субъект.Свойство("O"), Сертификат.Субъект.O, "") + " (" 
					+ ?(Сертификат.Субъект.Свойство("SN"), 
						Сертификат.Субъект.SN + " " 
													+ ?(Сертификат.Субъект.Свойство("GN"), 
														Сертификат.Субъект.GN, 
														""), 
						Сертификат.Субъект.CN)
					+ "). Выдан " + Сертификат.Издатель.CN;
		Возврат СтрЗаменить(Результат, Символ(0), "");	//Убираем нулевые байты
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПодписатьДокументЭП(КриптоПровайдер, ОтпечатокСертификата, ДвоичныеДанные, ПарольКСертификату) Экспорт
	#Если НЕ ВебКлиент Тогда
		СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
		Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);

		Менеджер.ПарольДоступаКЗакрытомуКлючу = ПарольКСертификату;
		Менеджер.ВключениеСертификатовВПодпись = РежимВключенияСертификатовКриптографии.ВключатьСертификатСубъекта;
		Если ОтпечатокСертификата = Неопределено Тогда
			Сообщить("Не выбран сертификат!");
			Возврат "";
		КонецЕсли;
		Попытка
			ДвоичныеДанныеПодписи = Менеджер.Подписать(ДвоичныеДанные, ПолучитьСертификатПоОтпечатку(КриптоПровайдер, ОтпечатокСертификата) );
		Исключение
			Сообщить(ИнформацияОбОшибке().Причина.Описание );
			Возврат "";
		КонецПопытки;
		Возврат ОбработатьСтрокуBase64(Base64Строка(ДвоичныеДанныеПодписи) );
	#Иначе
		Возврат "";
	#КонецЕсли	
КонецФункции

&НаКлиенте
Функция ПроверитьПодписьДокумента(КриптоПровайдер, ОтпечатокСертификата, ЗначениеПодписи, Подпись) Экспорт
	СписокБиблиотекLinux = "/opt/cprocsp/lib/amd64/libcapilite.so";
	Менеджер = Новый МенеджерКриптографии("",СписокБиблиотекLinux,КриптоПровайдер);
	Если ОтпечатокСертификата = Неопределено Тогда
		Сообщить("Не выбран сертификат!");
		Возврат "";
	КонецЕсли;  
	Попытка
		Если Найти(ЗначениеПодписи, ".tmp") Тогда
			Менеджер.ПроверитьПодпись(ЗначениеПодписи, Base64Значение(Подпись), ПолучитьСертификатПоОтпечатку(КриптоПровайдер, ОтпечатокСертификата) );	
		Иначе
			Менеджер.ПроверитьПодпись(Base64Значение(ЗначениеПодписи), Base64Значение(Подпись), ПолучитьСертификатПоОтпечатку(КриптоПровайдер, ОтпечатокСертификата) );
		КонецЕсли;
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
КонецФункции



#КонецОбласти


Функция ОбработатьСтрокуBase64(Знач СтрокаBase64, URLEncoded = Ложь)
	ОбработаннаяСтрока = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, Символы.НПП, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, Символы.ВК, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, " ", "");
	Возврат ОбработаннаяСтрока;
КонецФункции


