Процедура ПоказатьИсториюОформленияТОХ(ДокументСсылка) Экспорт
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИсторияОфромленияТОХ.СписокТоваров
		|ИЗ
		|	РегистрСведений.ИсторияОфромленияТОХ КАК ИсторияОфромленияТОХ
		|ГДЕ
		|	ИсторияОфромленияТОХ.Документ = &Документ";	
		Запрос.УстановитьПараметр("Документ", ДокументСсылка);
		
		Выборка = Запрос.Выполнить().Выбрать();	
		
		Если Выборка.Следующий() Тогда
			
			СтруктураХранения = Выборка.СписокТоваров.Получить();
			
			Если СтруктураХранения.Свойство("СписокТоваров") Тогда
				СписокТоваров = СтруктураХранения.СписокТоваров;				
			КонецЕсли;		
						
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СписокТоваров) Тогда
			
			ТабличныйДокумент = ДанныеТаблицыЗначенийВТабличныйДокумент(СписокТоваров);
			ТабличныйДокумент.Показать("История оформления ТОХ");
			
		Иначе
			Сообщить("Не удалось найти Историю оформления ТОХ для текущего документа.");
		КонецЕсли;		
				
	КонецЕсли;
	
КонецПроцедуры

Функция ДанныеТаблицыЗначенийВТабличныйДокумент(СписокТоваров)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(СписокТоваров);       
	Построитель.Вывести(ТабличныйДокумент);
		
	Возврат ТабличныйДокумент;

КонецФункции