
// Позволяет клиентской конфигурации предоставить параметры соединения с RMQ
//
Процедура ПрисвоитьПараметрыАвторизации(
		Адрес,
		Порт,
		Логин,
		Пароль,
		ВиртуальныйХост
	) Экспорт
	
	Адрес = Константы.AMQP_Адрес.Получить();
	Порт = Число(Константы.AMQP_Порт.Получить());
	Логин = Константы.AMQP_Логин.Получить();
	Пароль = Константы.AMQP_Пароль.Получить();
	ВиртуальныйХост = Константы.AMQP_ВиртуальныйХост.Получить();
		
КонецПроцедуры

Функция ПолучитьИмяОчередиBIT_MDM() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодпискиНаОчередиСообщений.ИмяОчереди
	|ИЗ
	|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
	|ГДЕ
	|	ПодпискиНаОчередиСообщений.Наименование = ""BIT_MDM""
	|	И ПодпискиНаОчередиСообщений.Активно = ИСТИНА
	|	И ПодпискиНаОчередиСообщений.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ИмяОчереди;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

