	
Функция КонвертироватьЗначение(Тип, Знач Значение)
	
	Результат = Значение;
	
	Если ТипЗнч(Значение) <> Тип И ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Результат = NULL;
		
		Если Тип = Тип("Дата") Тогда
			
			Если Найти(Значение, "T") > 0 Тогда
				Результат = XMLЗначение(Тип, Значение);
			Иначе
				Результат = Строка(Значение);;
			КонецЕсли;
			
		Иначе    
			
			ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
			
			Если ОбъектМетаданных <> Неопределено И Не ЗначениеЗаполнено(Значение) Тогда        
				
				Менеджер = МСК.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя()); 
				Результат = Менеджер.ПустаяСсылка();  
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат = NULL Тогда
		Результат = XMLЗначение(Тип, Значение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОбработатьДокументПоКарте(Структура, Карта) Экспорт
	
	СтруктураДокумента = Структура.СтруктураДокумента;
	СтруктураМетаданных = Структура.ОписаниеМетаданных;
	Объект = Структура.Объект;
	Отбор = Новый Структура("Источник, Идентификатор");  
	
	СтруктураПриемников = Новый Структура;
	
	Для Каждого КлючЗначение Из Карта Цикл
		
		ПутьКДаннымИсточника = КлючЗначение.Значение; 
		
		Если ПутьКДаннымИсточника = Неопределено Тогда
			ПутьКДаннымИсточника = КлючЗначение.Ключ;
		КонецЕсли;
		
		МассивИсточника = МСК._СтрРазделить(ПутьКДаннымИсточника, ".");	
		МассивПриемника = МСК._СтрРазделить(КлючЗначение.Ключ, ".");
		
		ОбъектМетаданных = ЗначениеОбъекта(Структура.ОписаниеМетаданных, МассивПриемника);
		Тип = ОбъектМетаданных.Тип.Типы()[0];
		
		Если МассивПриемника.Количество() = 1 Тогда
			
			Значение = КонвертироватьЗначение(Тип, СтруктураДокумента[МассивИсточника[0]]);
			Объект[МассивПриемника[0]] = Значение;
			
		Иначе
			
			Источник = СтруктураДокумента[МассивИсточника[0]];
			ИмяТабличнойЧасти = МассивПриемника[0];
			
			СтруктураПриемника = Неопределено;
			Если Не СтруктураПриемников.Свойство(ИмяТабличнойЧасти, СтруктураПриемника) Тогда     
				
				СтруктураПриемника = Новый Структура("Источник, Реквизиты", МассивИсточника[0], Новый Структура);
				СтруктураПриемников.Вставить(ИмяТабличнойЧасти, СтруктураПриемника);   
				
			КонецЕсли;     
			
			СтруктураПриемника.Реквизиты.Вставить(МассивПриемника[1], МассивИсточника[1]);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если Не ЗначениеЗаполнено(СтруктураПриемников) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СтруктураПриемников Цикл
		
		Приемник = Объект[КлючЗначение.Ключ];                
		Приемник.Очистить();
		Источник = СтруктураДокумента[КлючЗначение.Значение.Источник];
		
		Для Каждого Строка Из Источник Цикл
			
			НоваяСтрока = Приемник.Добавить();
			
			Для Каждого КлючЗначениеРеквизиты Из КлючЗначение.Значение.Реквизиты Цикл  
				
				Значение = Строка[КлючЗначениеРеквизиты.Значение];    
				Тип = ТипЗнч(НоваяСтрока[КлючЗначениеРеквизиты.Ключ]);
				НоваяСтрока[КлючЗначениеРеквизиты.Ключ] = КонвертироватьЗначение(Тип, Значение); 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗначениеОбъекта(Объект, Массив) Экспорт
	
	Значение = Объект;
	
	Для Каждого Ключ Из Массив Цикл
		Значение = Значение[Ключ];
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции

Функция ПолучитьСсылкуПоКодуИсточника(ОбъектМетаданных, Источник, ВызыватьИсключение = Истина) Экспорт
	
	Если ТипЗнч(Источник) = Тип("ОбъектXDTO") Тогда
		КодИсточника = Источник.GUID;
	Иначе
		КодИсточника = Источник;
	КонецЕсли;
	
	Результат = Неопределено;
	
	Если КодИсточника = "00000000-0000-0000-0000-000000000000" Или КодИсточника = Неопределено Тогда
		
		Менеджер = МСК.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		Результат = Менеджер.ПустаяСсылка();
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	ОбъектМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ОбъектМетаданных
		|ГДЕ
		|	ОбъектМетаданных.КодМДМ = &КодИсточника";
		
		Запрос = Новый Запрос(СтрЗаменить(ТекстЗапроса, "Справочник.ФизическиеЛица", ОбъектМетаданных.ПолноеИмя()));   
			
		Запрос.УстановитьПараметр("КодИсточника", КодИсточника);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Количество() > 1 Тогда
				ВызватьИсключение "Множество объектов с одинаковым кодом источника";
			КонецЕсли;
			
			Выборка.Следующий();
			Результат = Выборка.Ссылка;
			
		Иначе
			
			Если ВызыватьИсключение Тогда
				ВызватьИсключение СтрШаблон("Ссылка на несуществующий объект %1 %2", ОбъектМетаданных.ПолноеИмя(), КодИсточника);
			КонецЕсли;
			
			Результат = NULL;
					
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОбъектПоПараметрамПоиска(ОбъектМетаданных, СтруктураПоиска, ШтампВерсии, ЭтоГруппа = Ложь, СоздаватьЕслиНеНайден = Истина) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	ОбъектМетаданных.Ссылка КАК Ссылка,
	|	ОбъектМетаданных.ШтампВерсии КАК ШтампВерсии
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ОбъектМетаданных";
	
	ОбъектМетаданныхПолноеИмя = ОбъектМетаданных.ПолноеИмя();
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.ЗаказПоставщику", ОбъектМетаданныхПолноеИмя);
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	
	Оператор = Схема.ПакетЗапросов[0].Операторы[0];
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Для Каждого КлючЗначение Из СтруктураПоиска Цикл
		
		ПолеВложеннойТаблицы = СтрШаблон("ОбъектМетаданных.%1 = &%1", КлючЗначение.Ключ);
		Оператор.Отбор.Добавить(ПолеВложеннойТаблицы);
		Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		
	КонецЦикла;
	
	Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	
	Объект = Неопределено;
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Если СоздаватьЕслиНеНайден Тогда
			
			Объект = СоздатьНовыйОбъектМетаданных(ОбъектМетаданных, ЭтоГруппа);
			Объект.Заполнить(Неопределено);    
			ЗаполнитьЗначенияСвойств(Объект, СтруктураПоиска);
			
		Иначе
			Объект = NULL;
		КонецЕсли;
		
	Иначе  
		
		Выборка = Результат.Выбрать();
		
		Если Выборка.Количество() = 2 Тогда
			ВызватьИсключение "Найдено несколько объектов, удовлетворяющим критериям поиска объекта";
		КонецЕсли;
		
		Выборка.Следующий();    
		
		Если ТипЗнч(ШтампВерсии) = Тип("Строка") Тогда
			ШтампВерсии = XMLЗначение(Тип("Число"), ШтампВерсии);
		КонецЕсли;
					
		Если Выборка.ШтампВерсии <= ШтампВерсии Тогда 
			Объект = Выборка.Ссылка.ПолучитьОбъект(); 
		КонецЕсли;
		
	КонецЕсли;   
	
	Если Объект <> Неопределено И Объект <> NULL Тогда
		
        Объект.ШтампВерсии = ШтампВерсии; 
		Объект.ОбменДанными.Загрузка = Истина;   
		
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Функция ПолучитьОбъектПоКодуИсточника(ОбъектМетаданных, КодИсточника, ШтампВерсии, ЭтоГруппа = Ложь, СоздаватьЕслиНеНайден = Истина) Экспорт
	
	СтруктураПоиска = Новый Структура("КодМДМ", КодИсточника);
	
	Возврат ПолучитьОбъектПоПараметрамПоиска(ОбъектМетаданных, СтруктураПоиска, ШтампВерсии, ЭтоГруппа, СоздаватьЕслиНеНайден);
	
КонецФункции

Функция СоздатьНовыйОбъектМетаданных(ОбъектМетаданных, ЭтоГруппа = Ложь) Экспорт
	
	Менеджер = МСК.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	
	Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
		
		Если ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
			Объект = Менеджер.СоздатьДокумент();
		Иначе      
			
			Если ЭтоГруппа Тогда
				Объект = Менеджер.СоздатьГруппу();
			Иначе
				Объект = Менеджер.СоздатьЭлемент();
			КонецЕсли;  
			
		КонецЕсли;
		
	Иначе
		ВызватьИсключение "Неверный тип данных";
	КонецЕсли;
	
	Возврат Объект;

КонецФункции

Процедура ПолучитьДанныеСсылочногоТипа(Структура, Карта) Экспорт
	
	СтруктураДокумента = Структура.СтруктураДокумента;
	                                                    
	ТаблицаКонвертации = Новый ТаблицаЗначений;
	ТаблицаКонвертации.Колонки.Добавить("Реквизит", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаКонвертации.Колонки.Добавить("ТабличнаяЧасть", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаКонвертации.Колонки.Добавить("Индекс", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаКонвертации.Колонки.Добавить("Источник", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаКонвертации.Колонки.Добавить("Идентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	
	МассивИсточников = Новый Массив;
	
	Для Каждого КлючЗначение Из Карта Цикл
		
		ОбъектМетаданных = Неопределено;
		
		Если ТипЗнч(КлючЗначение.Значение) = Тип("Структура") Тогда
			
			ПутьКДаннымИсточника = КлючЗначение.Значение.ПутьКДанным;
			
			Если КлючЗначение.Значение.Тип = "СсылочныйТип" Тогда     
				
				ОбъектМетаданных = Метаданные.НайтиПоТипу(КлючЗначение.Значение.ТипЗначения);
				Карта[КлючЗначение.Ключ] = ПутьКДаннымИсточника;  
				
			КонецЕсли;
			
		Иначе
			ПутьКДаннымИсточника = КлючЗначение.Значение;
		КонецЕсли;
		
		Если ПутьКДаннымИсточника = Неопределено Тогда
			ПутьКДаннымИсточника = КлючЗначение.Ключ;
		КонецЕсли;
		
		МассивИсточника = МСК._СтрРазделить(ПутьКДаннымИсточника, ".");	
		МассивПриемника = МСК._СтрРазделить(КлючЗначение.Ключ, ".");
		
		Если ОбъектМетаданных = Неопределено Тогда
			
			МетаданныеРеквизита = ЗначениеОбъекта(Структура.ОписаниеМетаданных, МассивПриемника);
			
			Если МетаданныеРеквизита.Тип.Типы().Количество() > 1 Тогда
				ВызватьИсключение "Составной тип не поддерживается";
			КонецЕсли;  
			
			ОбъектМетаданных = Метаданные.НайтиПоТипу(МетаданныеРеквизита.Тип.Типы()[0]);  
			
		КонецЕсли;
		
		Если ОбъектМетаданных <> Неопределено И ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Тогда
			
			ПолноеИмя = ОбъектМетаданных.ПолноеИмя();
			
			Если МассивИсточников.Найти(ПолноеИмя) = Неопределено Тогда
				МассивИсточников.Добавить(ПолноеИмя);
			КонецЕсли;
			
			Если МассивПриемника.Количество() = 1 Тогда                                        
				
				Идентификатор = ЗначениеОбъекта(Структура.СтруктураДокумента, МассивИсточника);
				
				Если ЗначениеЗаполнено(Идентификатор) Тогда
					
					НоваяСтрока = ТаблицаКонвертации.Добавить();
					НоваяСтрока.Реквизит = МассивИсточника[0];
					НоваяСтрока.Источник = ПолноеИмя;
					НоваяСтрока.Идентификатор = Идентификатор;
					
				КонецЕсли;
				
			Иначе
				
				Массив = Структура.СтруктураДокумента[МассивИсточника[0]];
				
				Если ЗначениеЗаполнено(Массив) Тогда
					
					Для Индекс = 0 По Массив.ВГраница() Цикл
						
						Идентификатор = Массив[Индекс][МассивИсточника[1]];
						
						Если ЗначениеЗаполнено(Идентификатор) Тогда
							
							НоваяСтрока = ТаблицаКонвертации.Добавить();
							НоваяСтрока.Реквизит = МассивИсточника[1];
							НоваяСтрока.ТабличнаяЧасть = МассивИсточника[0];
							НоваяСтрока.Индекс = Индекс;
							НоваяСтрока.Источник = ПолноеИмя;
							НоваяСтрока.Идентификатор = Идентификатор;
							
						КонецЕсли;
							
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(МассивИсточников) Тогда
		Возврат;
	КонецЕсли;   
	
	МассивОшибок = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаКонвертации.Источник КАК Источник,
	|	ТаблицаКонвертации.Идентификатор КАК Идентификатор,
	|	ТаблицаКонвертации.Реквизит КАК Реквизит,
	|	ТаблицаКонвертации.ТабличнаяЧасть КАК ТабличнаяЧасть,
	|	ТаблицаКонвертации.Индекс КАК Индекс
	|ПОМЕСТИТЬ ТаблицаКонвертации
	|ИЗ
	|	&ТаблицаКонвертации КАК ТаблицаКонвертации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Источник,
	|	Идентификатор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ТаблицаКонвертации", ТаблицаКонвертации);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
	Шаблон =
	"ВЫБРАТЬ
	|	ТаблицаКонвертации.Источник КАК Источник,
	|	ТаблицаКонвертации.Идентификатор КАК Идентификатор,
	|	ТаблицаКонвертации.Реквизит КАК Реквизит,
	|	ТаблицаКонвертации.ТабличнаяЧасть КАК ТабличнаяЧасть,
	|	ТаблицаКонвертации.Индекс КАК Индекс,
	|	ОбъектМетаданных.Ссылка КАК Ссылка
	|ИЗ
	|	ТаблицаКонвертации КАК ТаблицаКонвертации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтатьиЗатрат КАК ОбъектМетаданных
	|		ПО ТаблицаКонвертации.Идентификатор = ОбъектМетаданных.КодМДМ
	|ГДЕ
	|	ТаблицаКонвертации.Источник = ""Справочник.СтатьиЗатрат""";
	
	МассивЗапросов = Новый Массив;
	
	Для Каждого Источник Из МассивИсточников Цикл
		
		ТекстЗапроса = СтрЗаменить(Шаблон, "Справочник.СтатьиЗатрат", Источник);   
		
		МассивЗапросов.Добавить(ТекстЗапроса);
		
	КонецЦикла;
	
	Запрос.Текст = МодульРегламентныхЗаданий.СтрСоединить(МассивЗапросов, Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка = NULL Тогда
			
			СтрокаОшибка = СтрШаблон("Не найдена ссылка %1 с идентификатором %2", Выборка.Источник, Выборка.Идентификатор);
			
			Если МассивОшибок.Найти(СтрокаОшибка) = Неопределено Тогда
				МассивОшибок.Добавить(СтрокаОшибка);  			
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ТабличнаяЧасть) Тогда
			Объект = СтруктураДокумента[Выборка.ТабличнаяЧасть][Выборка.Индекс];
		Иначе
			Объект = СтруктураДокумента;
		КонецЕсли;     
		
		Объект[Выборка.Реквизит] = Выборка.Ссылка;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивОшибок) Тогда
		ВызватьИсключение МодульРегламентныхЗаданий.СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОписаниеМетаданных(Структура, КоллекцияМетаданных)
	
	Для Каждого Реквизит Из КоллекцияМетаданных Цикл
		Структура.Вставить(Реквизит.Имя, Реквизит);
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеОбъектаМетаданных(ПолноеИмя) Экспорт
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмя); 
	
	Если МетаданныеОбъекта = Неопределено Тогда
		ВызватьИсключение "Неверный аргумент";
	КонецЕсли;
	
	Результат = Новый Структура;
	ДобавитьОписаниеМетаданных(Результат, МетаданныеОбъекта.СтандартныеРеквизиты);
	
	Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(МетаданныеОбъекта) Тогда
		
		ДобавитьОписаниеМетаданных(Результат, МетаданныеОбъекта.Реквизиты);
		
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл 
			
			СтруктураТабличнаяЧасть = Новый Структура;
			ДобавитьОписаниеМетаданных(СтруктураТабличнаяЧасть, ТабличнаяЧасть.Реквизиты);
			Результат.Вставить(ТабличнаяЧасть.Имя, СтруктураТабличнаяЧасть);  
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьДанныеДокумента(Сообщение, Настройки, КодИсточника = Неопределено) Экспорт
	
	Структура = Новый Структура;
	
	СтруктураДокумента = Сообщение;
	
	Структура.Вставить("СтруктураДокумента", СтруктураДокумента);
	Структура.Вставить("Настройки", ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Настройки, "ИмяСправочника, ДатаНачалаЗагрузки"));
	Структура.Вставить("Менеджер", Документы[Структура.Настройки.ИмяСправочника]);
	Структура.Вставить("ТребуетсяОбновление", Истина);                                    
	Структура.Вставить("ПолноеИмя", СтрШаблон("Документ.%1", Структура.Настройки.ИмяСправочника));
	Структура.Вставить("Метаданные", Метаданные.НайтиПоПолномуИмени(Структура.ПолноеИмя));
	Структура.Вставить("ОписаниеМетаданных", ОписаниеОбъектаМетаданных(Структура.ПолноеИмя));
	Структура.Вставить("ИмяПриложения", "");//ДанныеСообщения.ИмяПриложения);
	
	Структура.Вставить("Параметры", Новый Структура);                
	
	Объект = ПолучитьОбъектПоКодуИсточника(Структура.Метаданные, СтруктураДокумента.УникальныйИдентификатор, СтруктураДокумента.ШтампВерсии);
	
	Структура.Вставить("Объект", Объект);
	
	Если Объект <> Неопределено Тогда
		Структура.Вставить("Ссылка", Объект.Ссылка);
		Объект.ДополнительныеСвойства.Вставить("Р_ЗагрузкаДокументов");
	Иначе                         
		Структура.Вставить("Ссылка", Структура.Менеджер.ПустаяСсылка());
	КонецЕсли;    	
	
	// проверим период загрузки
	ДатаДокумента = Неопределено;
	
	Если Объект <> Неопределено И Не Объект.Ссылка.Пустая() Тогда
		ДатаДокумента = Объект.Дата;
	КонецЕсли;
	
	Дата = Неопределено;
	
	Если Структура.СтруктураДокумента.Свойство("ДатаДокумента", Дата) И ЗначениеЗаполнено(Дата) Тогда
		
		Если Найти(Дата, "T") > 0 Тогда
			Дата = XMLЗначение(Тип("Дата"), Дата);
		Иначе
			Дата = Дата(Дата);
		КонецЕсли;              
		
		Если ДатаДокумента = Неопределено Тогда
			ДатаДокумента = Дата;
		Иначе
			ДатаДокумента = Мин(Дата, ДатаДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	Структура.Вставить("ДатаДокументаМеньшеДатыЗагрузки", ЗначениеЗаполнено(ДатаДокумента) И Структура.Настройки.ДатаНачалаЗагрузки > ДатаДокумента);
	
	Если Структура.ДатаДокументаМеньшеДатыЗагрузки Тогда                                                                        
		НеЗагружатьДокумент(Структура, "Документ не попадает в период загрузки");
	КонецЕсли;
	
	// другие проверки
	Если Структура.ТребуетсяОбновление И Объект = Неопределено Тогда // объект найден, но штамп версии больше, чем в сообщении
		Структура.ТребуетсяОбновление = Ложь;
	КонецЕсли; 
	
	Если Структура.ТребуетсяОбновление Тогда
		Структура.Объект.ДополнительныеСвойства.Вставить("Р_СтруктураДокумента", СтруктураДокумента);
	КонецЕсли;
	
	ЭтаСсылка = Структура.Ссылка;
	
	Если ЭтаСсылка.Пустая() И Объект <> Неопределено Тогда
		
		ЭтаСсылка = Объект.ПолучитьСсылкуНового();
		Если ЭтаСсылка.Пустая() Тогда
			
			ЭтаСсылка = Структура.Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор);
			Объект.УстановитьСсылкуНового(ЭтаСсылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Структура.Вставить("ЭтаСсылка", ЭтаСсылка);
	
	Возврат Структура;
	
КонецФункции

Процедура НеЗагружатьДокумент(Структура, Причина)
	
	Комментарий = СтрШаблон("%1:%2:%3:%4:%5:%6", 
		Структура.ПолноеИмя,
		Структура.СтруктураДокумента.УникальныйИдентификатор,
		Структура.СтруктураДокумента.НомерДокумента,
		Формат(Дата(Структура.СтруктураДокумента.ДатаДокумента), "ДФ=dd.MM.yy"));
		//Структура.ИмяПриложения,
		//Причина);
		
	ЗаписьЖурналаРегистрации("ЗагрузкаДокументов.Пропуск", УровеньЖурналаРегистрации.Предупреждение, Структура.Метаданные, Структура.Ссылка, Комментарий);
	Структура.ТребуетсяОбновление = Ложь;
	
КонецПроцедуры

Процедура ОчиститьПользователей(Объект) Экспорт
	
	Если Объект.ДополнительныеСвойства.Свойство("Р_ЗагрузкаДокументов") Тогда
		
		Для Каждого КлючЗначение Из Новый Структура("Автор, Менеджер, Ответственный") Цикл
			
			Если AMQP_РаботаСДокументами_ver2.ЕстьРеквизитОбъекта(КлючЗначение.Ключ, Объект.Метаданные()) Тогда
				Объект[КлючЗначение.Ключ] = Неопределено; 			
			КонецЕсли;                                    
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаписатьДокумент(Структура, Отказ) Экспорт
	
	Объект = Структура.Объект;
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	СтруктураДокумента = Структура.СтруктураДокумента;
	
	Если СтруктураДокумента.Статус = 0 И Объект.Проведен Тогда
		РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;		
	КонецЕсли;
	
	Если СтруктураДокумента.Статус = 1 Тогда 
		
		Если Не Объект.ПроверитьЗаполнение() Тогда   
			
			Отказ = Истина;
			ВызватьИсключение "Ошибка проверки заполнения";			
			
		КонецЕсли;

		РежимЗаписи = РежимЗаписиДокумента.Проведение;
		
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("ПометкаУдаления") Тогда
		Объект.ПометкаУдаления = СтруктураДокумента.ПометкаУдаления; 	
	КонецЕсли;
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		Объект.ОбменДанными.Загрузка = Ложь; 	
	Иначе
		ОчиститьПользователей(Объект);       	
	КонецЕсли;  
	
	Объект.Записать(РежимЗаписи); 

КонецПроцедуры

