
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Определяет уникальность сообщения
//
// Параметры:
//    СтруктураПроверки - Структура - Параметры сообщения
//
// Возвращаемое значение
//    Булево - Признак уникальности сообщения
//
Функция СообщениеУникально(СтруктураПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ПОМЕСТИТЬ РезультатПроверки
	|ИЗ
	|	РегистрСведений.ПЛ_Уведомления КАК Уведомления
	|ГДЕ
	|	Уведомления.Уведомление = &Уведомление
	|	И Уведомления.Источник = &Источник
	|	И Уведомления.СпособДоставки = &СпособДоставки
	|	И Уведомления.Адресат = &Адресат
	|	И Уведомления.Адрес = &Адрес
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(Уведомления.Период) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Уведомления.ТемаСообщения      КАК Тема,
	|	Уведомления.ТекстСообщения     КАК Текст,
	|	Уведомления.КонтрольнаяСумма   КАК КонтрольнаяСумма
	|ИЗ
	|	РегистрСведений.ПЛ_Уведомления.СрезПоследних КАК Уведомления
	|ГДЕ
	|	Уведомления.Уведомление = &Уведомление
	|	И Уведомления.Источник = &Источник
	|	И Уведомления.СпособДоставки = &СпособДоставки
	|	И Уведомления.Адресат = &Адресат
	|	И Уведомления.Адрес = &Адрес
	|	И 1 В
	|			(ВЫБРАТЬ
	|				РезультатПроверки.Поле1
	|			ИЗ
	|				РезультатПроверки)
	|";
	
	Запрос.УстановитьПараметр("Уведомление",      СтруктураПроверки.Уведомление);
	Запрос.УстановитьПараметр("СпособДоставки",   СтруктураПроверки.СпособДоставки);
	Запрос.УстановитьПараметр("Адресат",          СтруктураПроверки.Адресат);
	Запрос.УстановитьПараметр("Адрес",            Строка(СтруктураПроверки.Адрес));
	
	Если ТипЗнч(СтруктураПроверки.Источник) = Тип("Структура") Или Не ЗначениеЗаполнено(СтруктураПроверки.Источник) Тогда
		Запрос.УстановитьПараметр("Источник",     Неопределено);
	Иначе
		Запрос.УстановитьПараметр("Источник",     СтруктураПроверки.Источник);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Сообщение = РезультатЗапроса.Выгрузить()[0];
		
		Возврат (СтруктураПроверки.Тема <> Сообщение.Тема)
			Или (СтруктураПроверки.Текст <> Сообщение.Текст)
			Или (СтруктураПроверки.КонтрольнаяСумма <> Сообщение.КонтрольнаяСумма);
	КонецЕсли;
	
КонецФункции

// Записывает протокол отправки уведомлений
//
// Параметры:
//    СтруктураПроверки - Структура - Параметры сообщения
//    Источник - СправочникСсылка.ПЛ_События - Источник события
//    Отправлено - Булево - Признак того, что сообщение отправлено
//
Процедура СделатьЗаписьОбОтправкеУведомления(СтруктураУведомления, Знач Источник, Отправлено = Ложь) Экспорт
	
	НаборЗаписейУведомления = РегистрыСведений.ПЛ_Уведомления.СоздатьНаборЗаписей();
	
	Если Не Отправлено Тогда
	
		ТекущаяДата = ТекущаяДатаСеанса();
		Если ТипЗнч(Источник) = Тип("Структура") Тогда
			Источник = Неопределено;
		КонецЕсли;
		
		ТаблицаУведомлений = НаборЗаписейУведомления.ВыгрузитьКолонки();
		
		Для каждого СтрокаАдресата Из СтруктураУведомления.АдресатыРасширенно Цикл
			
			СтрокаУведомления = ТаблицаУведомлений.Добавить();
			СтрокаУведомления.Период           = ТекущаяДата;
			СтрокаУведомления.Уведомление      = СтруктураУведомления.Уведомление;
			СтрокаУведомления.Источник         = Источник;
			СтрокаУведомления.СпособДоставки   = СтруктураУведомления.СпособДоставки;
			СтрокаУведомления.Адресат          = СтрокаАдресата.Адресат;
			СтрокаУведомления.Адрес            = СтрокаАдресата.Адрес;
			СтрокаУведомления.ТемаСообщения    = СтруктураУведомления.Тема;
			СтрокаУведомления.ТекстСообщения   = СтруктураУведомления.Текст;
			СтрокаУведомления.КонтрольнаяСумма = СтруктураУведомления.КонтрольнаяСумма;
			СтрокаУведомления.Отправлено       = Ложь;
		КонецЦикла;
		
		НаборЗаписейУведомления.Загрузить(ТаблицаУведомлений);
		НаборЗаписейУведомления.Записать(Ложь);
		
	Иначе
		
		Если ТипЗнч(Источник) = Тип("Структура") Тогда
			Источник = Неопределено;
		КонецЕсли;
		
		ТаблицаУведомлений = НаборЗаписейУведомления.ВыгрузитьКолонки();
		
		Адресаты = Новый Массив;
		Адреса = Новый Массив;
		
		Для каждого СтрокаАдресата Из СтруктураУведомления.АдресатыРасширенно Цикл
			Адресаты.Добавить(СтрокаАдресата.Адресат);
			Адреса.Добавить(Строка(СтрокаАдресата.Адрес));
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	*,
		|	ИСТИНА КАК Отправлено
		|	
		|ИЗ
		|	РегистрСведений.ПЛ_Уведомления.СрезПоследних(,
		|		Уведомление = &Уведомление
		|		И (Источник = &Источник ИЛИ &ИсточникПуст)
		|		И СпособДоставки = &СпособДоставки
		|		И Адресат В (&Адресаты)
		|		И Адрес В (&Адреса)
		|		И ТемаСообщения ПОДОБНО &ТемаСообщения
		|		И ТекстСообщения ПОДОБНО &ТекстСообщения
		|		И КонтрольнаяСумма = &КонтрольнаяСумма
		|	) КАК Уведомления
		|";
		
		Запрос.УстановитьПараметр("Уведомление",      СтруктураУведомления.Уведомление);
		Запрос.УстановитьПараметр("Источник",         Источник);
		Запрос.УстановитьПараметр("ИсточникПуст",     Не ЗначениеЗаполнено(Источник));
		Запрос.УстановитьПараметр("СпособДоставки",   СтруктураУведомления.СпособДоставки);
		Запрос.УстановитьПараметр("Адресаты",         Адресаты);
		Запрос.УстановитьПараметр("Адреса",           Адреса);
		Запрос.УстановитьПараметр("ТемаСообщения",    "%" + СтруктураУведомления.Тема + "%");
		//Макарова 05.05.2018  <<  
		Запрос.УстановитьПараметр("ТекстСообщения",   "%" + Лев(СтруктураУведомления.Текст,1022) + "%");
		//Макарова 05.05.2018 >>
		Запрос.УстановитьПараметр("КонтрольнаяСумма", СтруктураУведомления.КонтрольнаяСумма);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.ПЛ_Уведомления.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли