Перем Соединение Экспорт;
Перем ОписаниеОшибки Экспорт;
Перем ДатаОбмена Экспорт;
Перем ИДТекущегоОбмена Экспорт;
Перем ТаблицаОтветаПоЗаданиям Экспорт;
Перем ТаблицаРазмещенияЗаказов Экспорт;
Перем ТаблицаОтработанныхДокументовКЗаказу Экспорт;
Перем ФормаОбработки Экспорт;
Перем ПоследнийНомерСообщения;
Перем НомерСообщенияПротокола Экспорт;
Перем НомерФайла Экспорт;
Перем МассивСозданныхЗаказовПокупателей Экспорт ;
Перем  СозданоЗаказовМоих;



Процедура ПолучитьИмяСервераИИмяКаталогаОбмена(Знач ПолныйFTPАдрес, ИмяСервера, ИмяКаталога) Экспорт
	
	АдресОбмена = НормализоватьFTPАдрес(ПолныйFTPАдрес);
	
	// принцип получения адреса такой, все что до первой черты / или \ - это имя сервера, потом каталог
	АдресОбмена = СтрЗаменить(АдресОбмена, "\", "/");
	
	ПозицияПрямогоСлеша = Найти(АдресОбмена, "/");
	
	Если ПозицияПрямогоСлеша = 0 Тогда
		
		ИмяСервера = АдресОбмена;
		ИмяКаталога = "";
		
		
	Иначе
		
		ИмяСервера = Сред(АдресОбмена, 1, ПозицияПрямогоСлеша - 1);
		ИмяКаталога = Сред(АдресОбмена, ПозицияПрямогоСлеша);
		
		// последний должен быть слеш у имени каталога
		Если Сред(ИмяКаталога, СтрДлина(ИмяКаталога)) <> "/" Тогда
			ИмяКаталога = ИмяКаталога + "/";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция УстановитьСоединениеСFTP(ИмяFTPСервера,ИмяКаталогаСервера) Экспорт
	
	ИмяКаталогаСервера = "";
	ИмяFTPСервера = "";
	
	// нужно по полному имени получить имя сервера и имя каталога
	ПолучитьИмяСервераИИмяКаталогаОбмена(НастройкаОбмена.FTPАдресОбмена, ИмяFTPСервера, ИмяКаталогаСервера);
	
	// если не задано имя сервера или каталога то невозможно обмениваться данными
	Если ПустаяСтрока(ИмяFTPСервера) Тогда
		
		ОписаниеОшибки = "Не задан сервер обмена информацией через FTP.";
		СоздатьЗаписьПротокола(ОписаниеОшибки,Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Ложь;
		
	КонецЕсли;
	
	// соединение
	Соединение = ВыполнитьFTPПодключениеКСерверу(ИмяFTPСервера, НастройкаОбмена);
	
	Если Соединение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// каталог проверяем
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера);
	
	Если Не НаличиеКаталога Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	// Проверим подкаталог out
	НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера + "/" + ИмяКаталогаФайлаДляМосквы + "/");
	
	Если Не НаличиеКаталога Тогда 
		
		Сообщить("Не найден каталог на FTP с именем " + ИмяКаталогаФайлаДляМосквы,СтатусСообщения.ОченьВажное);
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверим подкаталог in
	//НаличиеКаталога = ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, ИмяКаталогаСервера+"/FromMoscwow_Vladimir/");
	//Если Не НаличиеКаталога Тогда 
	//	Возврат Ложь;
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// функция выполняет FTP подключение к серверу
Функция ВыполнитьFTPПодключениеКСерверу(Знач ИмяFTPСервера, НастройкиОбмена)       
	
	#Если Клиент Тогда
		Состояние("Выполняется подключение к FTP: " + ИмяFTPСервера);
		СоздатьЗаписьПротокола("Выполняется подключение к FTP: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения, Ложь);
	#КонецЕсли
	
	Попытка
		
		Соединение = Новый FTPСоединение(ИмяFTPСервера, НастройкиОбмена.ПортFTPСоединения, 
		НастройкиОбмена.ПользовательFTPСоединения, НастройкиОбмена.ПарольFTPСоединения, , НастройкиОбмена.ПассивноеFTPСоединение);						
		
	Исключение
		
		// ошибка при подключении к ftp
		СоздатьЗаписьПротокола("Ошибка при подключении к FTP : " + ИмяFTPСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Неопределено;
		
	КонецПопытки;
	
	СоздатьЗаписьПротокола("Соединение установлено: " + ИмяFTPСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения,Ложь);
	
	Возврат Соединение;
	
КонецФункции

// функция проверяет наличие катаога на FTP сервере
Функция ПроверитьНаличиеКаталогаНаFTPСервере(Соединение, Знач ИмяКаталогаСервера)
	
	Если ПустаяСтрока(ИмяКаталогаСервера) Тогда
		Возврат Истина;
	КонецЕсли;
	
	//надо сначала проверить что сам каталог доступа есть
	Попытка
		
		МассивНайденныхКаталогов = Соединение.НайтиФайлы(ИмяКаталогаСервера, "");
		
	Исключение
		
		// ошибка при подключении к ftp
		СоздатьЗаписьПротокола("Ошибка при соединении с FTP : " + ИмяКаталогаСервера + " ! " + ОписаниеОшибки(), Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
		Возврат Ложь;
		
	КонецПопытки;
	
	Для Каждого НайденныйКаталог Из МассивНайденныхКаталогов Цикл
		
		// если не каталог - то дальше ищем
		Если НЕ НайденныйКаталог.ЭтоКаталог() Тогда
			Продолжить;
		КонецЕсли;
		
		// большие и маленькие буквы считаются различными
		Если НайденныйКаталог.ПолноеИмя + "/" <> ИмяКаталогаСервера Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЦикла;
	
	// если не найден каталог для обмена
	СоздатьЗаписьПротокола("Не найден FTP каталог обмена информацией: " + ИмяКаталогаСервера, Перечисления.бит_ОперацияОбменаСПорталом.УстановкаСоединения);
	
	Возврат Ложь;
	
КонецФункции

// функция нормализует ftp адрес (отрезает не нужное)
Функция НормализоватьFTPАдрес(Знач FTPАдрес) Экспорт
	
	ИтоговыйАдрес = СокрЛП(FTPАдрес);
	ПозицияFTP = Найти(Врег(ИтоговыйАдрес), "FTP://");
	
	Если ПозицияFTP = 1 Тогда
		
		ИтоговыйАдрес = Сред(ИтоговыйАдрес, 7);	
		
	КонецЕсли;
	
	Возврат ИтоговыйАдрес;
	
КонецФункции

Процедура СоздатьЗаписьПротокола(Описание, ОперацияОбменаСПорталом,ЭтоОшибка = Истина) Экспорт
	
	Если ЗначениеЗаполнено(Описание) Тогда
		
		Если ФормаОбработки <> Неопределено Тогда
			ФормаОбработки.ЭлементыФормы.ПолеПротокола.ДобавитьСтроку(Строка(ОперацияОбменаСПорталом) + ": " + Описание);
		КонецЕсли;
		
		Если НастройкаОбмена.СохранятьПротоколОбмена Тогда
			
			НомерСообщенияПротокола = НомерСообщенияПротокола + 1;
			МенеджерЗаписи = РегистрыСведений.бит_ПротоколОбмена.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ИД_обмена = ИДТекущегоОбмена;
			МенеджерЗаписи.ОперацияОбмена = ОперацияОбменаСПорталом;
			МенеджерЗаписи.НомерСообщения = НомерСообщенияПротокола;
			МенеджерЗаписи.Ошибка = ЭтоОшибка;
			МенеджерЗаписи.Описание = Описание;
			МенеджерЗаписи.Дата = ДатаОбмена;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаписатьФайлы(Файл, Входящий = Истина) Экспорт
	
	Попытка
		
		НомерФайла = НомерФайла + 1;
		МенеджерЗаписи = РегистрыСведений.бит_ФайлыОбмена.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ИД_обмена = ИДТекущегоОбмена;
		МенеджерЗаписи.ВходящиеИсходящие = Входящий;
		МенеджерЗаписи.НомерФайла = НомерФайла;
		МенеджерЗаписи.ИмяФайла = Файл.ИмяФайла;
		МенеджерЗаписи.Файл =  Новый ХранилищеЗначения(Новый ДвоичныеДанные(Файл.ПолноеИмяФайла), Новый СжатиеДанных);
		МенеджерЗаписи.ДатаОбмена = ДатаОбмена;
		МенеджерЗаписи.Записать();
		
	Исключение
		Сообщить("" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры	

Процедура ВыполнитьОбмен(РежимРаботы) Экспорт
	
	Перем ИмяFTPСервера, ИмяКаталогаСервера;
	
	ВыгруженоЗаказов = 0;
	
	//Очистим таблицу заданий;
	ТаблицаОтветаПоЗаданиям.Очистить();
	ТаблицаОтработанныхДокументовКЗаказу = Неопределено;
	ТаблицаРазмещенияЗаказов = Неопределено;
	ТаблицаЗаданий100 = Неопределено;
	ТаблицаЗаданий103 = Неопределено;
	
	//Подключение к ftp
	ДатаОбмена = ТекущаяДата();
	ИДТекущегоОбмена = Новый УникальныйИдентификатор();
	НомерСообщенияПротокола = 0;
	НомерФайла = 0;
	
	ПроверитьНастройкиПодключения = УстановитьСоединениеСFTP(ИмяFTPСервера,ИмяКаталогаСервера);
	
	Если Не ПроверитьНастройкиПодключения Тогда
		Возврат;
	КонецЕсли; 
	
	// Здесь надо положить в каталог данные о текущих контрагентах и договорах!! (процедура описана в кнопке
	// формы списка справочника "Контрагенты"
	Текст = Новый ТекстовыйДокумент; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Код КАК КодДоговора,
	               |	ДоговорыКонтрагентов.Наименование КАК НаименованиеДоговора,
	               |	ДоговорыКонтрагентов.Владелец.Код КАК КодКонтрагента,
	               |	ДоговорыКонтрагентов.Владелец.ИНН КАК ИНН,
	               |	ДоговорыКонтрагентов.Владелец.ИсточникКонтакта КАК ИсточникКонтакта,
	               |	ДоговорыКонтрагентов.Владелец.IDАварда КАК IDАварда,
	               |	ДоговорыКонтрагентов.Подарки,
	               |	ДоговорыКонтрагентов.Дата,
	               |	ДоговорыКонтрагентов.Номер,
	               |	ДоговорыКонтрагентов.СрокДействия
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыКонтрагентов.Владелец.Ссылка = ДоговорыКонтрагентов.Владелец.ГоловнойКонтрагент
	               |	И ДоговорыКонтрагентов.Организация = &Организация";
	
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.ИНН) Тогда 
			Продолжить;
		КонецЕсли;
		
		КодДоговора = Выборка.КодДоговора;    
		НаименованиеДоговора = Выборка.НаименованиеДоговора;    
		КодКонтрагента = Выборка.КодКонтрагента;  
		ИНН = Выборка.ИНН;      
		Дата = Выборка.Дата;
		Номер = Выборка.Номер;
		СрокДействия = Выборка.СрокДействия;
		
		Текст.ДобавитьСтроку(СокрЛП(КодДоговора) + "@" + СокрЛП(НаименованиеДоговора) + "@" + Дата + "@" + Номер + "@" + СрокДействия + 
		"@" + СокрЛП(КодКонтрагента) + "@" + СокрЛП(ИНН) + "@" + СокрЛП(Выборка.ИсточникКонтакта) + "@" + СокрЛП(Выборка.IDАварда) + "@" + СокрЛП(Выборка.Подарки));
		
	КонецЦикла;
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	Текст.Записать(ВременныйКаталог + "Sverka.txt");
	
	Если РежимРаботы = 1 Тогда
		
		Соединение.Записать(ВременныйКаталог + "Sverka.txt", ИмяКаталогаСервера + "/" + ИмяКаталогаФайлаДляМосквы + "/Sverka.txt");
		Возврат;
		
	Иначе      
		
		// Отправка по эл. почте
		
		УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		
		Если НЕ Константы.НеОтправлятьПочту.Получить() И ЗначениеЗаполнено(УчетнаяЗапись) И Текст.КоличествоСтрок() > 0 Тогда 
			
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Сверка контрагентов с Самарой";
			
			МылоКонтрагента = "";
			МылоКонтрагента = "buh@moskvorechie.ru";
			
			Почта = Новый ИнтернетПочта; 
			Почта.Подключиться(Профиль);
			
			Попытка
				Почта.Подключиться(Профиль);
			Исключение
				
				Сообщить("Не сумел подключиться к почтовому серверу!");
				Возврат;
				
			КонецПопытки;
			
			Сообщение.Получатели.Добавить(МылоКонтрагента);   
			Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
			Сообщение.Вложения.Добавить(ВременныйКаталог + "Sverka.txt", ТипФайлаТабличногоДокумента.TXT);
			
			Почта.Послать(Сообщение);
			
			Сообщение.Получатели.Очистить();
			Сообщение.Вложения.Очистить();
			Почта.Отключиться();
			Сообщить("Сверка в Москву отослана",СтатусСообщения.Информация);
			
			Если Прав(ВременныйКаталог,1) = "\" Тогда
				ВременныйКаталог = Сред(ВременныйКаталог, 1, СтрДлина(ВременныйКаталог) - 1);
			КонецЕсли;			
			
			УдалитьФайлы(ВременныйКаталог);

		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	

КонецПроцедуры

Процедура СоздатьЗаказПоставщику(Постащик, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Поставщик КАК Поставщик,
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ЕСТЬNULL(бит_СоставЗаказа.ЦенаПоставщика, 0) КАК ЦенаПоставщика
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя.Поставщик В (&Поставщик)
	|				И ЗаказПокупателя.Организация = &Организация) КАК ЗаказыПокупателейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|				,
	|				ЗаказПоставщику.Контрагент В (&Поставщик)
	|					И ЗаказПокупателя.Организация = &Организация) КАК РазмещениеЗаказовПокупателейОстатки
	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
	|			И ЗаказыПокупателейОстатки.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
	|			И ЗаказыПокупателейОстатки.ДоговорКонтрагента = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				,
	|				ДокументРезерва.Поставщик =&Поставщик
	|					И ДокументРезерва.Организация = &Организация) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|			И ЗаказыПокупателейОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|			И ЗаказыПокупателейОстатки.ДоговорКонтрагента = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоставЗаказа КАК бит_СоставЗаказа
	|		ПО ЗаказыПокупателейОстатки.Номенклатура = бит_СоставЗаказа.Номенклатура
	|			И ЗаказыПокупателейОстатки.ЗаказПокупателя.Поставщик = бит_СоставЗаказа.Поставщик
	|			И ЗаказыПокупателейОстатки.ЗаказПокупателя = бит_СоставЗаказа.Заказ
	|ИТОГИ
	|	СУММА(Количество),
	|	МАКСИМУМ(ЦенаПоставщика)
	|ПО
	|	Поставщик,
	|	ЗаказПокупателя,
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Поставщик", Постащик);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	ВыборкаПоставщиков = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаПоставщиков.Количество() > 0 Тогда
		
		Пока ВыборкаПоставщиков.Следующий() Цикл
			
			Если ВыборкаПоставщиков.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
			ЗаказПоставщику.Склад = Константы.ОсновнойСклад.Получить();		
			
			Если Не ЗначениеЗаполнено(ЗаказПоставщику.Склад) Тогда
				ЗаказПоставщику.Склад = Справочники.бит_НастройкиОбменаСПорталом.Москворечье.СкладПортала;	
			КонецЕсли;	
			
			ЗаказПоставщику.Дата = ТекущаяДата();
			
			ЗаказПоставщику.Контрагент = ВыборкаПоставщиков.Поставщик;
			ЗаказПоставщику.ДоговорКонтрагента = ЗаказПоставщику.Контрагент.ОсновнойДоговорКонтрагента;
			ЗаказПоставщику.Организация = Организация;
			
			ЗаказПоставщику.СтруктурнаяЕдиница = ВыборкаПоставщиков.Поставщик.ОсновнойБанковскийСчет;
			ЗаказПоставщику.СуммаВключаетНДС   = Истина;
			ЗаказПоставщику.УчитыватьНДС       = Истина;
			
			ЗаказПоставщику.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
			ЗаказПоставщику.КратностьВзаиморасчетов = 1;
			ЗаказПоставщику.КурсВзаиморасчетов = 1;
			
			ВыборкаЗаказов = ВыборкаПоставщиков.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЗаказов.Следующий() Цикл
				
				Если ВыборкаЗаказов.Количество <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				ВыборкаНоменклатуры = ВыборкаЗаказов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаНоменклатуры.Следующий()  Цикл
					
					Если ВыборкаНоменклатуры.Количество <= 0 Тогда
						Продолжить;
					КонецЕсли;
					
					НоваяСтрока = ЗаказПоставщику.Товары.Добавить();
					
					НоваяСтрока.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
					
					//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
					//НоваяСтрока.СтавкаНДС = ВыборкаНоменклатуры.Номенклатура.СтавкаНДС;
					НоваяСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(ВыборкаНоменклатуры.Номенклатура, ЗаказПоставщику.Дата);
					//-Гавриленков В. 18.12.2025 #UT10-5598
					НоваяСтрока.ЕдиницаИзмерения = ВыборкаНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков;
					НоваяСтрока.Коэффициент = НоваяСтрока.ЕдиницаИзмерения.Коэффициент;
					НоваяСтрока.Цена = ВыборкаНоменклатуры.ЦенаПоставщика;
					
					Если ЗначениеЗаполнено(ВыборкаЗаказов.ЗаказПокупателя) Тогда
						НоваяСтрока.Заказ = ВыборкаЗаказов.ЗаказПокупателя;
					КонецЕсли;
					
					НоваяСтрока.Количество = ВыборкаНоменклатуры.Количество;
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЗаказПоставщику);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЗаказПоставщику);
					
				КонецЦикла;	
				
			КонецЦикла;	

			ЗаказПоставщику.Товары.Сортировать("Номенклатура");
			ЗаказПоставщику.СуммаДокумента = ЗаказПоставщику.Товары.Итог("Сумма");

			Попытка

				ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
				ЗаказСозданИПроведен = Истина;

			Исключение					

				ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
				ЗаказСозданИПроведен = Ложь;
				
				Сообщить("Не удалось провести документ: " + ЗаказПоставщику);
			
			КонецПопытки;
			
			// Теперь надо этот документ послать в Смартэк
			Если ЗаказСозданИПроведен Тогда
				
				Фрм = Обработки.ПослатьЗаказПоставщику.ПолучитьФорму("Отчет");
				Фрм.ВнешнееОткрытие = Истина;
				Фрм.ЗаказПоставщику =ЗаказПоставщику.Ссылка;
				Фрм.ПослатьПоПочте = Истина;
				Фрм.Открыть();
			
			КонецЕсли;
		
		КонецЦикла;			
	
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьТаблицуЗаданий(ИмяФайла) Экспорт
	
	//будем возвращать структуру заданий
	Таблица100 = Новый ТаблицаЗначений;
	Таблица100.Колонки.Добавить("НомерЗадания");
	Таблица100.Колонки.Добавить("КодЗадания");
	Таблица100.Колонки.Добавить("НомерЗаказа");	
	Таблица100.Колонки.Добавить("ПримечаниеЗаказа");
	Таблица100.Колонки.Добавить("НомерСкладаПоставщика");
	Таблица100.Колонки.Добавить("IDКлиента");
	Таблица100.Колонки.Добавить("IDДоговора");
	Таблица100.Колонки.Добавить("НазваниеКлиента");
	Таблица100.Колонки.Добавить("НомерДоговора");
	Таблица100.Колонки.Добавить("ИНН");
	Таблица100.Колонки.Добавить("ВидОплаты");
	Таблица100.Колонки.Добавить("ТипРезерва");
	Таблица100.Колонки.Добавить("ОписаниеЗаказа");
	
	Таблица103 = Новый ТаблицаЗначений;
	Таблица103.Колонки.Добавить("НомерЗадания");
	Таблица103.Колонки.Добавить("КодЗадания");
	Таблица103.Колонки.Добавить("НомерЗаказа");	
	Таблица103.Колонки.Добавить("Действие");
	Таблица103.Колонки.Добавить("НомерНовогоЗаказа");
	
	Текст = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста.ANSI);
	СтрокаТекст = Текст.Прочитать();
	ПозицияРазделителяСтроки = Найти(СтрокаТекст, "|#|");
	
	Если ПозицияРазделителяСтроки > 0 Тогда
		
		Стр = Сред(СтрокаТекст, 1, ПозицияРазделителяСтроки - 1);
		СтрокаТекст = Сред(СтрокаТекст,ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
		
	Иначе
		Стр = Неопределено;
	КонецЕсли;
	
	Пока Стр <> Неопределено Цикл
		
		МассивСтроки = РазобратьСтроку(Стр);
		
		Попытка
			
			Если МассивСтроки[2] = "100" Тогда
				
				НоваяСтрока = Таблица100.Добавить();
				НоваяСтрока.НомерЗадания = МассивСтроки[1]; 
				НоваяСтрока.КодЗадания = МассивСтроки[2];
				НоваяСтрока.НомерЗаказа = МассивСтроки[3]; 
				НоваяСтрока.ПримечаниеЗаказа = МассивСтроки[4];
				НоваяСтрока.НомерСкладаПоставщика = МассивСтроки[5];
				НоваяСтрока.IDКлиента = МассивСтроки[6];
				НоваяСтрока.IDДоговора = МассивСтроки[7];
				НоваяСтрока.НазваниеКлиента = МассивСтроки[8];
				НоваяСтрока.НомерДоговора = МассивСтроки[9];
				НоваяСтрока.ИНН = МассивСтроки[10];
				НоваяСтрока.ВидОплаты = МассивСтроки[11];
				НоваяСтрока.ТипРезерва = МассивСтроки[12];
				НоваяСтрока.ОписаниеЗаказа = МассивСтроки[14];
				
			ИначеЕсли МассивСтроки[2] = "103" Тогда
				
				НоваяСтрока = Таблица103.Добавить();
				НоваяСтрока.НомерЗадания = МассивСтроки[1]; 
				НоваяСтрока.КодЗадания = МассивСтроки[2];
				НоваяСтрока.НомерЗаказа = МассивСтроки[3]; 
				НоваяСтрока.Действие = МассивСтроки[4];
				НоваяСтрока.НомерНовогоЗаказа = МассивСтроки[5];	
				
			КонецЕсли;
			
			ПозицияРазделителяСтроки = Найти(СтрокаТекст, "|#|");
			
			Если ПозицияРазделителяСтроки > 0 Тогда
				
				Стр = Сред(СтрокаТекст, 1, ПозицияРазделителяСтроки - 1);
				СтрокаТекст = Сред(СтрокаТекст, ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
				
			Иначе
				Стр = Неопределено;
			КонецЕсли;
			
		Исключение
			
			Стр = Неопределено;
			Таблица100.Очистить();
			ОписаниеОшибки = "Не правильный формат файла 'task.dat'";
			Прервать;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Задания = Новый Структура;
	Задания.Вставить("Таблица100", Таблица100);
	Задания.Вставить("Таблица103", Таблица103);
	
	Возврат Задания;
	
КонецФункции

Функция ПолучитьТаблицуКЗаказу(ИмяФайла) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерЗаказа");
	Таблица.Колонки.Добавить("IDстроки");
	Таблица.Колонки.Добавить("НомерТовара");
	Таблица.Колонки.Добавить("ФирмаПроизводитель");
	Таблица.Колонки.Добавить("НомерПроизводителя");
	Таблица.Колонки.Добавить("Наименование");
	Таблица.Колонки.Добавить("ЦенаДляКлиента");
	Таблица.Колонки.Добавить("ЦенаПоставщика");
	Таблица.Колонки.Добавить("Количество");
	Таблица.Колонки.Добавить("Примечание");
	
	Текст = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста.ANSI);
	СтрокаТекст = Текст.Прочитать();
	
	ПозицияРазделителяСтроки = Найти(СтрокаТекст,"|#|");
	
	Если ПозицияРазделителяСтроки > 0 Тогда
		
		Стр = Сред(СтрокаТекст, 1, ПозицияРазделителяСтроки - 1);
		СтрокаТекст = Сред(СтрокаТекст,ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
		
	Иначе
		Стр = Неопределено;
	КонецЕсли;
	
	Пока Стр <> Неопределено Цикл
		
		МассивСтроки = РазобратьСтроку(Стр);
		
		Попытка
			
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.НомерЗаказа = МассивСтроки[1]; 
			НоваяСтрока.IDстроки = МассивСтроки[2];               
			НоваяСтрока.НомерТовара = МассивСтроки[3];
			НоваяСтрока.ФирмаПроизводитель = МассивСтроки[4];
			НоваяСтрока.НомерПроизводителя = МассивСтроки[5];
			НоваяСтрока.Наименование = МассивСтроки[6];
			НоваяСтрока.ЦенаДляКлиента = МассивСтроки[7];
			НоваяСтрока.ЦенаПоставщика = МассивСтроки[8];
			НоваяСтрока.Количество = МассивСтроки[9];
			НоваяСтрока.Примечание = МассивСтроки[10];
			
			ПозицияРазделителяСтроки = Найти(СтрокаТекст, "|#|");
			
			Если ПозицияРазделителяСтроки > 0 Тогда
				
				Стр = Сред(СтрокаТекст, 1, ПозицияРазделителяСтроки - 1);
				СтрокаТекст = Сред(СтрокаТекст,ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
				
			Иначе
				Стр = Неопределено;
			КонецЕсли;
			
		Исключение
			
			Стр = Неопределено;
			Таблица.Очистить();
			ОписаниеОшибки = "Не правильный формат файла '101.dat'";
			Возврат Таблица;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьТаблицуСогласованияЗаказов(ИмяФайла) Экспорт
	
	//Таблица = Новый ТаблицаЗначений;
	//Таблица.Колонки.Добавить("НомерЗаказа");	
	//Таблица.Колонки.Добавить("Действие");
	//Таблица.Колонки.Добавить("НомерНовогоЗаказа");
	//
	//Текст = Новый ЧтениеТекста(ИмяФайла,КодировкаТекста.ANSI);
	//СтрокаТекст = Текст.Прочитать();
	//ПозицияРазделителяСтроки = Найти(СтрокаТекст,"|#|");
	//Если ПозицияРазделителяСтроки > 0 Тогда
	//	Стр = Сред(СтрокаТекст,1,ПозицияРазделителяСтроки-1);
	//	СтрокаТекст = Сред(СтрокаТекст,ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
	//Иначе
	//	Стр = Неопределено;
	//КонецЕсли;
	//Пока Стр<>Неопределено Цикл
	//	
	//	МассивСтроки = РазобратьСтроку(Стр);
	//	//Теперь перенесем в таблицу, удобней будет работать, а может просто красиво будет
	//	Попытка
	//		
	//		НоваяСтрока = Таблица.Добавить();
	//		НоваяСтрока.НомерЗаказа = МассивСтроки[1]; 
	//		НоваяСтрока.Действие = МассивСтроки[2];
	//		НоваяСтрока.НомерНовогоЗаказа = МассивСтроки[3]; 
	//		
	//		ПозицияРазделителяСтроки = Найти(СтрокаТекст,"|#|");
	//		Если ПозицияРазделителяСтроки > 0 Тогда
	//			Стр = Сред(СтрокаТекст,1,ПозицияРазделителяСтроки-1);
	//			СтрокаТекст = Сред(СтрокаТекст,ПозицияРазделителяСтроки + 3, СтрДлина(СтрокаТекст));
	//		Иначе
	//			Стр = Неопределено;
	//		КонецЕсли;
	//		
	//	Исключение
	//		
	//		Стр = Неопределено;
	//		Таблица.Очистить();
	//		ОписаниеОшибки = "Не правильный формат файла '103.dat'";
	//		Возврат Таблица;
	//	КонецПопытки;
	//	
	//КонецЦикла;
	//
	//Возврат Таблица;
	//
КонецФункции

//Возвращаем структуру
Функция РазобратьСтроку(Стр) Экспорт
	
	Массив = Новый Массив;
	Индекс = 1;
	СтрН = Стр;	
	Массив.Добавить("");	
	ПозицияРазделителя = 1;
	
	Пока ПозицияРазделителя<>0 Цикл
		
		ПозицияРазделителя = Найти(СтрН, "|*|");
		Значение = СокрЛп(Сред(СтрН, 1, ПозицияРазделителя - 1));
		
		Если Индекс = 2 Тогда
			
			// удаление ведущих нулей
			Пока Лев(Значение, 1) = "0" Цикл
				Значение = Сред(Значение, 2);
			КонецЦикла;
			
		КонецЕсли;	
		
		Значение = СтрЗаменить(Значение, Символы.ПС, " ");
		Массив.Добавить(Значение);
		СтрН = Сред(СтрН, ПозицияРазделителя + 3, СтрДлина(СтрН));
		Индекс = Индекс + 1; 		
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция НайтиКонтрика(ИНН, IDКлиента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И Контрагенты.ID = &ID";
	
	Запрос.УстановитьПараметр("ИНН", СокрЛП(ИНН));
	Запрос.УстановитьПараметр("ID", СокрЛП(IDКлиента));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();	

КонецФункции

Процедура СформироватьЗаказы(ТаблицаЗаданий, ТаблицаКЗаказу) Экспорт
	
	ТаблицаЗаданий.Сортировать("НомерЗаказа");
	ТаблицаКЗаказу.Сортировать("НомерЗаказа");
	
	МассивСозданныхЗаказовПокупателей = Новый Массив;
	
	ЗагруженоЗаказов = 0;
	СозданоЗаказовМоих = 0;	
	
	Для Каждого СтрокаЗадания Из ТаблицаЗаданий Цикл

		НоваяНоменклатура = Новый Массив;
		НовыеКонтрагенты = Новый Массив;
		Макет = ПолучитьМакет("Макет");
		ТабДок = Новый ТабличныйДокумент;
		
		//Записать все в регистр
		ТаблицаПервичногоВида = Новый ТаблицаЗначений;
		ТаблицаПервичногоВида.Колонки.Добавить("IDПоставщика");
		ТаблицаПервичногоВида.Колонки.Добавить("IDСтроки");
		ТаблицаПервичногоВида.Колонки.Добавить("Номенклатура");
		ТаблицаПервичногоВида.Колонки.Добавить("Цена");
		ТаблицаПервичногоВида.Колонки.Добавить("ЦенаПоставщика");
		ТаблицаПервичногоВида.Колонки.Добавить("Количество");
		ТаблицаПервичногоВида.Колонки.Добавить("Поставщик");
		ТаблицаПервичногоВида.Колонки.Добавить("ДоговорПоставщика");
		
		ЗаказУжеГрузился = Ложь;
		
		//Проверим а не загружался этот заказа
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_ВыгруженныеЗагруженныеДокументыПортал.Документ
		|ИЗ
		|	РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
		|ГДЕ
		|	бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗаказа = &НомерЗаказа
		|	И бит_ВыгруженныеЗагруженныеДокументыПортал.Документ ССЫЛКА Документ.ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("НомерЗаказа",СтрокаЗадания.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаказУжеГрузился = Истина;			
		КонецЕсли;
		
		Если ЗаказУжеГрузился = Истина Тогда //Если грузился тогда отбой
			
			СтрокаОтвета = ТаблицаОтветаПоЗаданиям.Добавить();
			СтрокаОтвета.НомерЗадания = СтрокаЗадания.НомерЗадания;
			СтрокаОтвета.СостояниеЗадания = 1;
			СтрокаОтвета.Сообщение = "Заказ уже был обработан.";
			СоздатьЗаписьПротокола("Заказ уже был обработан: " + СтрокаЗадания.НомерЗаказа, Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
			
			Продолжить;	
			
		КонецЕсли;	
		
		СтрокиЗаказов = ТаблицаКЗаказу.НайтиСтроки(Новый Структура("НомерЗаказа", СтрокаЗадания.НомерЗаказа));
		
		Если СтрокиЗаказов.Количество() > 0 Тогда //Если заказ не пустой, тогда можно его создать
			
			НачатьТранзакцию();
			ОтменаДействия = Ложь;
			
			Попытка
				
				ЗаказПокупателя = Документы.ЗаказПокупателя.СоздатьДокумент();
				
				ТаблицаЦенПоставщика = Новый ТаблицаЗначений;
				ТаблицаЦенПоставщика.Колонки.Добавить("Цена");
				ТаблицаЦенПоставщика.Колонки.Добавить("Номенклатура");
				
				ЗаказПокупателя.Дата=ТекущаяДата();
				ЗаказПокупателя.Организация = НастройкаОбмена.Организация;
				ЗаказПокупателя.НомерЗаданияНаПортале =  СтрокаЗадания.НомерЗаказа;
				
				Если НЕ ПустаяСтрока(СтрокаЗадания.ИНН) Тогда
					Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрокаЗадания.ИНН);	
				иначе
					
					Сообщить("Не указан ИНН у контрагента : " + СтрокаЗадания.НазваниеКлиента + " .Заказ НЕ СФОРМИРОВАН!!");
					ОтменаДействия = Истина;
					Продолжить;
					
				КонецЕсли; 
				
				Если Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда	
					
					Контрагент = Справочники.Контрагенты.СоздатьЭлемент();
					Контрагент.Наименование = СтрокаЗадания.НазваниеКлиента;
					Контрагент.НаименованиеПолное = СтрокаЗадания.НазваниеКлиента;
					Контрагент.Покупатель = Истина;
					Контрагент.ИНН = СтрокаЗадания.ИНН;
					
					Если ЗначениеЗаполнено(НастройкаОбмена.ПапкаДляНовыхПокупателей) И НастройкаОбмена.ПапкаДляНовыхПокупателей.ЭтоГруппа = Истина Тогда
						Контрагент.Родитель = НастройкаОбмена.ПапкаДляНовыхПокупателей;
					КонецЕсли;
					
					Контрагент.ID = СтрокаЗадания.IDКлиента;
					Контрагент.Записать();
					Контрагент = Контрагент.Ссылка;
					НовыеКонтрагенты.Добавить(Контрагент);
					
				КонецЕсли;	
				
				ЗаказПокупателя.Контрагент = Контрагент;
				
				//Найдем договор
				ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ID", СтрокаЗадания.IDДоговора,, Контрагент);
				
				Если Не ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
					
					//Создаем договора
					ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
					
					Если Не ЗначениеЗаполнено(НастройкаОбмена.ВалютаПокупки) ИЛИ НастройкаОбмена.ВалютаПокупки = Константы.ВалютаРегламентированногоУчета.Получить() 
						ИЛИ НастройкаОбмена.ПересчитыватьВРубли Тогда
						ДоговорКонтрагента.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
					Иначе
						ДоговорКонтрагента.ВалютаВзаиморасчетов = НастройкаОбмена.ВалютаПокупки;
					КонецЕсли;
					
					ДоговорКонтрагента.Организация = НастройкаОбмена.Организация;
					ДоговорКонтрагента.Владелец = Контрагент;
					ДоговорКонтрагента.ОбособленныйУчетТоваровПоЗаказамПокупателей = Истина;
					ДоговорКонтрагента.Наименование = "Договор № " + СтрокаЗадания.НомерДоговора;
					ДоговорКонтрагента.Номер = СтрокаЗадания.НомерДоговора;
					ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
					ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
					ДоговорКонтрагента.ID = СтрокаЗадания.IDДоговора;
					ДоговорКонтрагента.Записать();
					
					Об = Контрагент.ПолучитьОбъект();
					Об.ОсновнойДоговорКонтрагента =  ДоговорКонтрагента.Ссылка ;
					
					Попытка
						Об.Записать();
					Исключение
						Сообщить("Не смог назначить основной договор у контрагента : " + Контрагент);
					КонецПопытки;
					
					ДоговорКонтрагента = ДоговорКонтрагента.Ссылка;
					
				КонецЕсли;
				
				ЗаказПокупателя.ДоговорКонтрагента = ДоговорКонтрагента;
				
				ЗаказПокупателя.СкладГруппа = НастройкаОбмена.СкладПортала;
				ЗаказПокупателя.СтруктурнаяЕдиница = ЗаказПокупателя.Организация.ОсновнойБанковскийСчет;
				
				Если Не ЗначениеЗаполнено(НастройкаОбмена.ВалютаПокупки) ИЛИ НастройкаОбмена.ВалютаПокупки = Константы.ВалютаРегламентированногоУчета.Получить() 
					ИЛИ НастройкаОбмена.ПересчитыватьВРубли Тогда
					
					ЗаказПокупателя.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
					ЗаказПокупателя.КратностьВзаиморасчетов = 1;
					ЗаказПокупателя.КурсВзаиморасчетов = 1;
					
				Иначе
					
					ЗаказПокупателя.ВалютаДокумента = НастройкаОбмена.ВалютаПокупки;
					СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ЗаказПокупателя.ВалютаДокумента, ЗаказПокупателя.Дата);
					ЗаказПокупателя.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
					ЗаказПокупателя.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
					
				КонецЕсли;
				
				ЗаказПокупателя.УчитыватьНДС = Истина;
				ЗаказПокупателя.СуммаВключаетНДС = Истина;
				ЗаказПокупателя.Комментарий = СтрокаЗадания.ОписаниеЗаказа;
				ЗаказПокупателя.бит_СпособДоставки = ПолучитьСпособДоставкиИзКомментария(СтрокаЗадания.ОписаниеЗаказа);
				
				Для Каждого СтрокаЗаказа Из СтрокиЗаказов Цикл
					
					Если ЗначениеЗаполнено(СтрокаЗаказа.НомерТовара) Тогда
						Артикул = СтрокаЗаказа.НомерТовара;
					Иначе
						Артикул = Лев(Строка(СтрокаЗаказа.ФирмаПроизводитель), 2) + "-" + СтрокаЗаказа.НомерПроизводителя;
					КонецЕсли;
					
					ДанныеПоставщика = РегистрыСведений.бит_СоответствиеНомераСкладРеквизитамПоставщика.Получить(Новый Структура("НомерСклада", СтрокаЗадания.НомерСкладаПоставщика));
					
					НайденнаяНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
					
					Если НЕ ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда  
						
						НайденнаяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
						
						Если ДанныеПоставщика.Количество() > 0 И ЗначениеЗаполнено(ДанныеПоставщика.Контрагент) И ЗначениеЗаполнено(ДанныеПоставщика.ДоговорКонтрагента) Тогда
							НайденнаяНоменклатура.ХозяинПрайса = ДанныеПоставщика.Контрагент;
						КонецЕсли;
						
						НайденнаяНоменклатура.Услуга = Ложь; 
						//+Гавриленков В. 11.12.2025 #UT10-5574
						НайденнаяНоменклатура.СтавкаНДС = ?(ЗаказПокупателя.Дата >= '20260101', Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
						НайденнаяНоменклатура.Наименование = СтрокаЗаказа.Наименование;
						НайденнаяНоменклатура.НаименованиеПолное = СтрокаЗаказа.Наименование;
						НайденнаяНоменклатура.Артикул = Артикул;
						НайденнаяНоменклатура.бит_НомерПроизводителя = СтрокаЗаказа.НомерПроизводителя;
						НайденнаяНоменклатура.Комментарий = СтрокаЗаказа.Примечание;
						
						Если ЗначениеЗаполнено(СтрокаЗаказа.ФирмаПроизводитель) Тогда
							
							Производитель = Справочники.бит_Производители.НайтиПоНаименованию(СтрокаЗаказа.ФирмаПроизводитель);	
							
							Если Не ЗначениеЗаполнено(Производитель) Тогда
								
								Производитель = Справочники.бит_Производители.СоздатьЭлемент();
								Производитель.Наименование = СтрокаЗаказа.ФирмаПроизводитель;
								Производитель.Записать();
								Производитель = Производитель.Ссылка;
								
							КонецЕсли;	
							
							НайденнаяНоменклатура.бит_Производитель = Производитель;	
							
						КонецЕсли;	
						
						ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоРеквизиту("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
						
						Если Не ЗначениеЗаполнено(ВидНоменклатуры) Тогда
							
							ВидНоменклатуры = Справочники.ВидыНоменклатуры.СоздатьЭлемент();
							ВидНоменклатуры.Наименование = "Товар";
							ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар;
							ВидНоменклатуры.Записать();
							ВидНоменклатуры = ВидНоменклатуры.Ссылка;
							
						КонецЕсли;	
						
						НайденнаяНоменклатура.ВидНоменклатуры = ВидНоменклатуры;
						НайденнаяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
						НайденнаяНоменклатура.Записать();					
						НайденнаяНоменклатура.ВестиУчетПоСериям = Истина;
						НайденнаяНоменклатура.Записать();
						
						НоваяЕдиницаИзмерений = Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
						НоваяЕдиницаИзмерений.ЕдиницаПоКлассификатору = НайденнаяНоменклатура.БазоваяЕдиницаИзмерения;
						НоваяЕдиницаИзмерений.Наименование = Строка(НайденнаяНоменклатура.БазоваяЕдиницаИзмерения);
						НоваяЕдиницаИзмерений.Владелец = НайденнаяНоменклатура.Ссылка;
						НоваяЕдиницаИзмерений.Коэффициент = 1;
						НоваяЕдиницаИзмерений.Записать();
						
						НоваяЕдиницаИзмерений = НоваяЕдиницаИзмерений.Ссылка;
						НайденнаяНоменклатура.ЕдиницаХраненияОстатков = НоваяЕдиницаИзмерений;
						НайденнаяНоменклатура.ЕдиницаДляОтчетов = НоваяЕдиницаИзмерений;
						НайденнаяНоменклатура.Записать();
						
						НайденнаяНоменклатура = НайденнаяНоменклатура.Ссылка;
						НоваяНоменклатура.Добавить(НайденнаяНоменклатура);
						
					КонецЕсли;
					
					НоваяСтрока = ЗаказПокупателя.Товары.Добавить();
					СтрокаЦенПоставщика = ТаблицаЦенПоставщика.Добавить();
					СтрокаЦенПоставщика.Номенклатура = НайденнаяНоменклатура;
					СтрокаЦенПоставщика.Цена = СтрокаЗаказа.ЦенаПоставщика; 
					НоваяСтрока.Номенклатура = НайденнаяНоменклатура;
					НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
					НоваяСтрока.ЕдиницаИзмеренияМест = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
					НоваяСтрока.Коэффициент = 1;
					НоваяСтрока.Количество = Число(СтрокаЗаказа.Количество);
					НоваяСтрока.КоличествоМест = НоваяСтрока.Количество;
					
					СтрокаПервичная = ТаблицаПервичногоВида.Добавить();				
					СтрокаПервичная.IDПоставщика = СтрокаЗадания.НомерСкладаПоставщика;
					
					Если ДанныеПоставщика.Количество() > 0 И ЗначениеЗаполнено(ДанныеПоставщика.Контрагент) И ЗначениеЗаполнено(ДанныеПоставщика.ДоговорКонтрагента) Тогда
						
						СтрокаПервичная.Поставщик = ДанныеПоставщика.Контрагент;
						СтрокаПервичная.ДоговорПоставщика = ДанныеПоставщика.ДоговорКонтрагента;
						ЗаказПокупателя.Поставщик = СтрокаПервичная.Поставщик;
						
					КонецЕсли;

					СтрокаПервичная.IDСтроки = СтрокаЗаказа.IDСтроки;
					СтрокаПервичная.Номенклатура = НайденнаяНоменклатура;
					СтрокаПервичная.Цена = СтрокаЗаказа.ЦенаДляКлиента;
					
					СтрокаПервичная.ЦенаПоставщика = СтрокаЗаказа.ЦенаПоставщика;
					СтрокаПервичная.Количество = Число(СтрокаЗаказа.Количество);
					
					//Записать все в регистр
					
					//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
					//НоваяСтрока.СтавкаНДС = НоваяСтрока.Номенклатура.СтавкаНДС;
					НоваяСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НоваяСтрока.Номенклатура, ЗаказПокупателя.Дата);
					//-Гавриленков В. 18.12.2025 #UT10-5598
					
					Если НоваяСтрока.Количество>0 Тогда
						
						Если НастройкаОбмена.ПересчитыватьВРубли Тогда
							НоваяСтрока.Цена = СтрокаЗаказа.ЦенаДляКлиента * НастройкаОбмена.КурсПересчета;
						Иначе
							НоваяСтрока.Цена = СтрокаЗаказа.ЦенаДляКлиента;
						КонецЕсли;
						
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ЗаказПокупателя);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ЗаказПокупателя);
						
					Иначе	
						
						НоваяСтрока.Сумма = 0;
						НоваяСтрока.Цена = 0;			
						
					КонецЕсли;
					
				КонецЦикла;
				
				//Сделаем авторазмещение
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВидимостьСерии",     Ложь);
				СтруктураПараметров.Вставить("Авторезервирование", Истина);
				СтруктураПараметров.Вставить("Авторазмещение",     Ложь);
				СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам);
				
				ЗаказПокупателя.Товары.Свернуть("Номенклатура,ЕдиницаИзмерения,ЕдиницаИзмеренияМест,Коэффициент,СтавкаНДС,ХарактеристикаНоменклатуры", "Количество,Сумма,СуммаНДС");
				
				Для Каждого Строка Из ЗаказПокупателя.Товары Цикл
					
					СтрокаТабличнойЧасти = Строка;
					
					// Выполнить общие действия для всех документов при изменении Суммы.
					#Если Клиент Тогда
						ОбработкаТабличныхЧастей.ПриИзмененииСуммыТабЧасти(СтрокаТабличнойЧасти, ЗаказПокупателя, глЗначениеПеременной("глТекущийПользователь"),, 
						          истина, , истина, "Товары");
					#Иначе
						СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
					#КонецЕсли
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЗаказПокупателя);	
					
				КонецЦикла;	
				
				ЗаказПокупателя.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);
				
				//Запишем первичный вид заказа покупателя
				
				Попытка
					
					ЗаказПокупателя.Записать(РежимЗаписиДокумента.Проведение);
					ЗаказСозданИПроведен = Истина;
					
				Исключение					
					
					ЗаказПокупателя.Записать(РежимЗаписиДокумента.Запись);
					СоздатьЗаписьПротокола("Не удалось провести документ: " + ЗаказПокупателя, Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
					ЗаказСозданИПроведен = Ложь;
					
				КонецПопытки;
				
				Если ЗаказСозданИПроведен Тогда
					
					СозданоЗаказовМоих = СозданоЗаказовМоих + 1;
					
					Если ФЛ_ЗаказПоставщику Тогда
						МассивСозданныхЗаказовПокупателей.Добавить(ЗаказПокупателя.Ссылка);
					КонецЕсли;
					
				КонецЕсли;
				
				НаборЗаписи = РегистрыСведений.бит_СоставЗаказа.СоздатьНаборЗаписей();
				НаборЗаписи.Отбор.Заказ.Установить(ЗаказПокупателя.Ссылка);
				
				ТаблицаПервичногоВида.Колонки.Добавить("Заказ");
				ТаблицаПервичногоВида.ЗаполнитьЗначения(ЗаказПокупателя.Ссылка, "Заказ");
				НаборЗаписи.Прочитать();
				
				Для Каждого Строка Из ТаблицаПервичногоВида Цикл
					
					НоваяСтрока = НаборЗаписи.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
					
				КонецЦикла;					
				
				НаборЗаписи.Записать();
				
				//Запишем первичный вид заказа покупателя
				
				ЗагруженоЗаказов = ЗагруженоЗаказов + 1;
				МенеджерЗаписи = РегистрыСведений.бит_ВыгруженныеЗагруженныеДокументыПортал.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Документ = ЗаказПокупателя.Ссылка;
				МенеджерЗаписи.Заказ = ЗаказПокупателя.Ссылка;
				МенеджерЗаписи.НомерЗаказа = СтрокаЗадания.НомерЗаказа;
				МенеджерЗаписи.НомерЗадания = СтрокаЗадания.НомерЗадания;
				МенеджерЗаписи.Записать();
				
				СоздатьЗаписьПротокола("Создан документ: " + Строка(ЗаказПокупателя), Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов, Ложь);
				
				Если НастройкаОбмена.ФормироватьЗаказыПоставщикуПриПоступленииЗаказаПокупателя Тогда
					
					//////////////////////////////////ЗАКАЗ ПОСТАВЩИКУ//////////////////////////////////
					//Теперь надо сделать автоматическое размещение в заказе поставщику
					ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
					ЗаказПоставщику.Заполнить(ЗаказПокупателя.Ссылка);
					ЗаказПоставщику.Дата = ТекущаяДата();
					
					//Теперь заполним реквизиты поставщика по складу
					ДанныеПоставщика = РегистрыСведений.бит_СоответствиеНомераСкладРеквизитамПоставщика.Получить(Новый Структура("НомерСклада", СтрокаЗадания.НомерСкладаПоставщика));
					
					Если ДанныеПоставщика.Количество()>0 И ЗначениеЗаполнено(ДанныеПоставщика.Контрагент) И ЗначениеЗаполнено(ДанныеПоставщика.ДоговорКонтрагента) Тогда
						
						ЗаказПоставщику.Контрагент = ДанныеПоставщика.Контрагент;
						ЗаказПоставщику.ДоговорКонтрагента = ДанныеПоставщика.ДоговорКонтрагента;
						
						Если Не ЗначениеЗаполнено(ДанныеПоставщика.Валюта) ИЛИ ДанныеПоставщика.Валюта = Константы.ВалютаРегламентированногоУчета.Получить() 
							ИЛИ ДанныеПоставщика.ПересчитыватьВРубли Тогда
							
							ЗаказПоставщику.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
							ЗаказПоставщику.КратностьВзаиморасчетов = 1;
							ЗаказПоставщику.КурсВзаиморасчетов = 1;
							
						Иначе
							
							ЗаказПоставщику.ВалютаДокумента = ДанныеПоставщика.Валюта;
							СтруктураКурсаДокумента = МодульВалютногоУчета.ПолучитьКурсВалюты(ЗаказПоставщику.ВалютаДокумента, ЗаказПоставщику.Дата);
							ЗаказПоставщику.КратностьВзаиморасчетов = СтруктураКурсаДокумента.Кратность;
							ЗаказПоставщику.КурсВзаиморасчетов = СтруктураКурсаДокумента.Курс;
							
						КонецЕсли;
						
					Иначе
						
						ОтменаДействия = Истина;
						СоздатьЗаписьПротокола("Не заполнена информация по реквизитам склада поставщика.", Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
						
					КонецЕсли;
					
					//Теперь заполним реквизиты поставщика по складу
					//И цены поставщиков 
					
					Для Каждого Строка Из ЗаказПоставщику.Товары Цикл
						
						СтрокиЦен = ТаблицаЦенПоставщика.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
						
						Если СтрокиЦен.Количество()> 0 Тогда
							
							Если ДанныеПоставщика.ПересчитыватьВРубли Тогда
								Строка.Цена =СтрокиЦен[0].Цена * ДанныеПоставщика.КурсПересчета;
							Иначе
								Строка.Цена = СтрокиЦен[0].Цена;
							КонецЕсли;
							
							ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Строка, ЗаказПоставщику);
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, ЗаказПоставщику);
							
						Иначе
							
							СоздатьЗаписьПротокола("Не задана цена поставщика.", Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
							
						КонецЕсли;
						
					КонецЦикла;
					
					Попытка
						ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
					Исключение					
						
						ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
						СоздатьЗаписьПротокола("Не удалось провести документ: " + ЗаказПоставщику, Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
						
					КонецПопытки;
					
					СоздатьЗаписьПротокола("Создан документ: " + Строка(ЗаказПоставщику),Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов,Ложь);
					
				КонецЕсли; //НастройкаОбмена.ФормироватьЗаказыПоставщикуПриПоступленииЗаказаПокупателя
				
			Исключение
				
				ОтменаДействия = Истина;
				СоздатьЗаписьПротокола("Ошибка обработки задания: " + СтрокаЗадания.НомерЗадания +  " " + ОписаниеОшибки(),
				            Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов, Ложь);
				ОтменитьТранзакцию();
				
			КонецПопытки;
			
			Если ОтменаДействия = Ложь Тогда
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	ЗагруженоКоличество = ЗагруженоЗаказов;
	
	// Печать вновь созданных контрагентов и номенклатуры
	ЕстьЧтоПоказать = 0;
	
	Если НоваяНоменклатура.Количество()>0 Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДок.Вывести(ОбластьМакета);
		
		Для каждого ТекСтр Из НоваяНоменклатура Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Наименование = СокрЛП(ТекСтр.Наименование);
			ОбластьМакета.Параметры.Код = ТекСтр.Код;
			ОбластьМакета.Параметры.Артикул = ТекСтр.Артикул;
			ОбластьМакета.Параметры.Производитель = ТекСтр.бит_Производитель;
			ОбластьМакета.Параметры.НомерПроизводителя = ТекСтр.бит_НомерПроизводителя;
			ОбластьМакета.Параметры.ID = ТекСтр.ID;
			ОбластьМакета.Параметры.Поставщик = ТекСтр.ХозяинПрайса;
			 											
			ТабДок.Вывести(ОбластьМакета);
			ЕстьЧтоПоказать = 1;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если НовыеКонтрагенты.Количество() > 0 Тогда
		
		// Узнаю: есть ли уже контрагенты с ИНН, совпадающим с вновь созданным!!!
		ФильтрПоИНН = Новый Массив;
		
		Для каждого ТекСтр Из НовыеКонтрагенты Цикл
			ФильтрПоИНН.Добавить(ТекСтр.ИНН);
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Контрагенты.ИНН
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(НЕ Контрагенты.Ссылка В (&Ссылка))
		|	И Контрагенты.ИНН В(&ИНН)";
		
		Запрос.УстановитьПараметр("Ссылка", НовыеКонтрагенты);
		Запрос.УстановитьПараметр("ИНН", ФильтрПоИНН);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Свернуть("ИНН");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка1");
		ТабДок.Вывести(ОбластьМакета);
		
		Для каждого ТекСтр Из НовыеКонтрагенты Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка1");
			ОбластьМакета.Параметры.Наименование = СокрЛП(ТекСтр.Наименование) ;
			ОбластьМакета.Параметры.ИНН = ТекСтр.ИНН;
			
			НайденнаяСтрока = Результат.Найти(ТекСтр.ИНН, "ИНН");
			
			Если НайденнаяСтрока <> Неопределено Тогда
				ОбластьМакета.Параметры.Примечание = "Уже есть такой ИНН !";
			Иначе
				ОбластьМакета.Параметры.Примечание = "";
			КонецЕсли;
			 											
			ТабДок.Вывести(ОбластьМакета);
			ЕстьЧтоПоказать = 1;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Если ЕстьЧтоПоказать = 1 Тогда
		
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.Показать();
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПодтвержденияЗаказов(ТаблицаСогласованияЗаказов) Экспорт
	
	Для Каждого СтрокаЗадания Из ТаблицаСогласованияЗаказов Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	бит_ВыгруженныеЗагруженныеДокументыПортал.Документ
		|ИЗ
		|	РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
		|ГДЕ
		|	бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗаказа = &НомерЗаказа
		|	И бит_ВыгруженныеЗагруженныеДокументыПортал.Документ ССЫЛКА Документ.ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("НомерЗаказа", СтрокаЗадания.НомерЗаказа);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Если СтрокаЗадания.Действие = "0" ИЛИ СтрокаЗадания.Действие = "2" Тогда //Заказ будет изменен
				
				ЗакрытиеЗаказаПокупателя = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
				ЗакрытиеЗаказаПокупателя.Дата = ТекущаяДата();
				ЗакрытиеЗаказаПокупателя.Заполнить(Выборка.Документ);
				
				Если СтрокаЗадания.Действие = "2" Тогда
					
					СоздатьЗаписьПротокола(Строка(Выборка.Документ) + " заказ закрыт и изменен.", Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
					ЗакрытиеЗаказаПокупателя.Заказы[0].ПричинаЗакрытияЗаказа = "Изменение заказа.";
					
				Иначе
					
					СоздатьЗаписьПротокола(Строка(Выборка.Документ) + " отменен пользователем.", Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
					ЗакрытиеЗаказаПокупателя.Заказы[0].ПричинаЗакрытияЗаказа = "Заказ отменен заказчиком.";
					
				КонецЕсли;
				
				Попытка
					ЗакрытиеЗаказаПокупателя.Записать(РежимЗаписиДокумента.Проведение);				
				Исключение					
					
					ЗакрытиеЗаказаПокупателя.Записать(РежимЗаписиДокумента.Запись);
					СоздатьЗаписьПротокола("Не удалось провести документ: " + Строка(ЗакрытиеЗаказаПокупателя), Перечисления.бит_ОперацияОбменаСПорталом.ОбработкаЗагруженныхФайлов);
					
				КонецПопытки;
				
			КонецЕсли;
			
			СтрокаОтвета = ТаблицаОтветаПоЗаданиям.Добавить();
			СтрокаОтвета.НомерЗадания = СтрокаЗадания.НомерЗадания;
			СтрокаОтвета.СостояниеЗадания = 0;
			СтрокаОтвета.Сообщение = "";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция СформироватьТаблицуРазмещенияЗаказов() Экспорт
	
	ТаблицаРазмещенияЗаказов = Новый ТаблицаЗначений;
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("НомерЗаказа");
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("IDТовара");
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("Резерв");
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("ВПути");
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("НаБудущее");
	ТаблицаРазмещенияЗаказов.Колонки.Добавить("Цена");
	
	ТаблицаОтработанныхДокументовКЗаказу = Новый ТаблицаЗначений;
	ТаблицаОтработанныхДокументовКЗаказу.Колонки.Добавить("Документ");
	ТаблицаОтработанныхДокументовКЗаказу.Колонки.Добавить("Заказ");
	ТаблицаОтработанныхДокументовКЗаказу.Колонки.Добавить("НомерЗаказа");
	
	//Получим документы которые на сайт еще не выгружались
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Заказ,
	|	ВложенныйЗапрос.НомерЗадания
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Ссылка КАК Ссылка,
	|		ВложенныйЗапрос.Дата КАК Дата,
	|		бит_ВыгруженныеЗагруженныеДокументыПортал.Заказ КАК Заказ,
	|		бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗадания КАК НомерЗадания
	|	ИЗ
	|		(ВЫБРАТЬ
	|			КорректировкаЗаказаПокупателя.Ссылка КАК Ссылка,
	|			КорректировкаЗаказаПокупателя.Дата КАК Дата
	|		ИЗ
	|			Документ.КорректировкаЗаказаПокупателя КАК КорректировкаЗаказаПокупателя
	|		ГДЕ
	|			КорректировкаЗаказаПокупателя.Проведен = ИСТИНА
	|			И ЛОЖЬ
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			КорректировкаЗаказаПоставщику.Ссылка,
	|			КорректировкаЗаказаПоставщику.Дата
	|		ИЗ
	|			Документ.КорректировкаЗаказаПоставщику КАК КорректировкаЗаказаПоставщику
	|		ГДЕ
	|			КорректировкаЗаказаПоставщику.Проведен = ИСТИНА
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗаказПоставщику.Ссылка,
	|			ЗаказПоставщику.Дата
	|		ИЗ
	|			Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|		ГДЕ
	|			ЗаказПоставщику.Проведен = ИСТИНА
	|			И ЗаказПоставщику.бит_ПодтвержденПолностью = ИСТИНА) КАК ВложенныйЗапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
	|			ПО ВложенныйЗапрос.Ссылка = бит_ВыгруженныеЗагруженныеДокументыПортал.Документ) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.Заказ ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	ВыгруженныеЗаказы = Новый Массив;	
	СписокЗаказовПокупателей = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			
			Если Выборка.Ссылка.Товары.Количество() > 0 Тогда
				
				Список = Выборка.Ссылка.Товары.ВыгрузитьКолонку("Заказ");
				
				Для Каждого Заказ Из Список Цикл
					СписокЗаказовПокупателей.Добавить(Заказ);
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
			
			Заказ = Выборка.Ссылка.ЗаказПокупателя;
			СписокЗаказовПокупателей.Добавить(Заказ);
			
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.КорректировкаЗаказаПоставщику") Тогда
			
			Если ЗначениеЗаполнено(Выборка.Ссылка.ЗаказПоставщику) И Выборка.Ссылка.ЗаказПоставщику.Товары.Количество() > 0 Тогда
				
				Список = Выборка.Ссылка.ЗаказПоставщику.Товары.ВыгрузитьКолонку("Заказ");
				
				Для Каждого Заказ Из Список Цикл
					СписокЗаказовПокупателей.Добавить(Заказ);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Для Каждого Заказ Из СписокЗаказовПокупателей Цикл
		
		//Для каждого заказа покупателя будем брать анализ на дату документов
		Если ВыгруженныеЗаказы.Найти(Заказ) = Неопределено Тогда
			
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодробныйЗаказ.Номенклатура КАК Номенклатура,
			|	ОстаткиПоЗаказу.Запланировано КАК Запланировано,
			|	ЕСТЬNULL(ОстаткиПоЗаказу.ОтгруженоОтменено, 0) КАК ОтгруженоОтменено,
			|	ЕСТЬNULL(ОстаткиПоЗаказу.ОсталосьОтгрузить, 0) КАК ОсталосьОтгрузить,
			|	ЕСТЬNULL(ОстаткиПоЗаказу.Резерв, 0) КАК Резерв,
			|	ЕСТЬNULL(ОстаткиПоЗаказу.Заказано, 0) КАК Заказано,
			|	ЕСТЬNULL(ОстаткиПоЗаказу.Цена, 0) КАК Цена,
			|	ПодробныйЗаказ.IDСтроки КАК IDСтроки,
			|	ЕСТЬNULL(ПодробныйЗаказ.Количество, 0) КАК Количество,
			|	ПодробныйЗаказ.НомерЗаказа КАК НомерЗаказа,
			|	ПодробныйЗаказ.НомерЗадания КАК НомерЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		бит_СоставЗаказа.IDСтроки КАК IDСтроки,
			|		бит_СоставЗаказа.Номенклатура КАК Номенклатура,
			|		бит_СоставЗаказа.Цена КАК Цена,
			|		бит_СоставЗаказа.Количество КАК Количество,
			|		бит_СоставЗаказа.ЦенаПоставщика КАК ЦенаПоставщика,
			|		бит_СоставЗаказа.IDПоставщика КАК IDПоставщика,
			|		бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗаказа КАК НомерЗаказа,
			|		бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗадания КАК НомерЗадания
			|	ИЗ
			|		РегистрСведений.бит_СоставЗаказа КАК бит_СоставЗаказа
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
			|			ПО бит_СоставЗаказа.Заказ = бит_ВыгруженныеЗагруженныеДокументыПортал.Документ
			|	ГДЕ
			|		бит_СоставЗаказа.Заказ = &Заказ) КАК ПодробныйЗаказ
			|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ЗаказыПокупателейОстаткиИОбороты.Номенклатура КАК Номенклатура,
			|			СУММА(ЗаказыПокупателейОстаткиИОбороты.КоличествоПриход) КАК Запланировано,
			|			СУММА(ЗаказыПокупателейОстаткиИОбороты.КоличествоРасход) КАК ОтгруженоОтменено,
			|			СУММА(ЗаказыПокупателейОстаткиИОбороты.КоличествоКонечныйОстаток) КАК ОсталосьОтгрузить,
			|			СУММА(ЕСТЬNULL(РезервыКомпании.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыКПередаче.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыКПолучению.КоличествоОстаток, 0)) КАК Резерв,
			|			СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателей.КоличествоОстаток, 0)) КАК Заказано,
			|			СРЕДНЕЕ(ЗаказыПокупателейОстаткиИОбороты.Цена) КАК Цена
			|		ИЗ
			|			РегистрНакопления.ЗаказыПокупателей.ОстаткиИОбороты(, &ДатаАнализа, , , ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстаткиИОбороты
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаАнализа, ДокументРезерва = &Заказ) КАК РезервыКомпании
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыКомпании.Номенклатура
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(&ДатаАнализа, ЗаказПокупателя = &Заказ) КАК РазмещениеЗаказовПокупателей
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РазмещениеЗаказовПокупателей.Номенклатура
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаАнализа, ) КАК РезервыТоваровКомпании
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыТоваровКомпании.Номенклатура
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&ДатаАнализа, ) КАК ТоварыКПередачеКомпании
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = ТоварыКПередачеКомпании.Номенклатура
			|					И ЗаказыПокупателейОстаткиИОбороты.СтатусПартии = ТоварыКПередачеКомпании.СтатусПартии
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПередачеСоСкладов.Остатки(&ДатаАнализа, ДокументРезерва = &Заказ) КАК РезервыКПередаче
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыКПередаче.Номенклатура
			|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(&ДатаАнализа, ДокументРезерва = &Заказ) КАК РезервыКПолучению
			|				ПО ЗаказыПокупателейОстаткиИОбороты.Номенклатура = РезервыКПолучению.Номенклатура
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ЗаказыПокупателейОстаткиИОбороты.Номенклатура) КАК ОстаткиПоЗаказу
			|		ПО (ОстаткиПоЗаказу.Номенклатура = ПодробныйЗаказ.Номенклатура)
			|ИТОГИ
			|	МАКСИМУМ(Запланировано),
			|	МАКСИМУМ(ОтгруженоОтменено),
			|	МАКСИМУМ(ОсталосьОтгрузить),
			|	МАКСИМУМ(Резерв),
			|	МАКСИМУМ(Заказано),
			|	МАКСИМУМ(Цена),
			|	СУММА(Количество),
			|	МАКСИМУМ(НомерЗаказа),
			|	МАКСИМУМ(НомерЗадания)
			|ПО
			|	Номенклатура,
			|	IDСтроки";
			
			Запрос.УстановитьПараметр("ДатаАнализа", ТекущаяДата());
			Запрос.УстановитьПараметр("Заказ", Заказ);
			ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл
				
				Заказано = ВыборкаПоНоменклатуре.Заказано;
				
				ВыборкаПоID = ВыборкаПоНоменклатуре.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоID.Следующий() Цикл
					
					Если ВыборкаПоID.Количество > 0 ИЛИ Заказано > 0 Тогда 
						
						НоваяСтрока = ТаблицаРазмещенияЗаказов.Добавить();
						НоваяСтрока.НомерЗаказа = СокрЛП(ВыборкаПоID.НомерЗаказа);
						НоваяСтрока.IDТовара = Число(ВыборкаПоID.IDСтроки);
						
						КоличествоЗарезервировано = 0;
						
						Если Заказано > 0 Тогда
							
							Если ВыборкаПоID.Количество >= Заказано Тогда
								
								НоваяСтрока.Резерв = Заказано;
								КоличествоЗарезервировано = НоваяСтрока.Резерв;
								Заказано = 0;
								
							Иначе
								
								НоваяСтрока.Резерв = ВыборкаПоID.Количество;
								КоличествоЗарезервировано = НоваяСтрока.Резерв;
								Заказано = Заказано - ВыборкаПоID.Количество;
								
							КонецЕсли;
							
						КонецЕсли;
						
						НеРазмещено = ВыборкаПоID.Количество - КоличествоЗарезервировано;
						
						Если НеРазмещено > 0 Тогда
							НоваяСтрока.НаБудущее = НеРазмещено;
						КонецЕсли;		
						
						Если НастройкаОбмена.ПересчитыватьВРубли Тогда //Вернем цены в курс
							НоваяСтрока.Цена = ВыборкаПоID.Цена / НастройкаОбмена.КурсПересчета;
						Иначе
							НоваяСтрока.Цена = ВыборкаПоID.Цена;
						КонецЕсли;
						
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			ВыгруженныеЗаказы.Добавить(Заказ);	
			СтрокаОтработанныхДокументовКЗаказу = ТаблицаОтработанныхДокументовКЗаказу.Добавить();
			СтрокаОтработанныхДокументовКЗаказу.Документ = Выборка.Ссылка;
			СтрокаОтработанныхДокументовКЗаказу.НомерЗаказа = СокрЛП(Заказ.Номер);
			СтрокаОтработанныхДокументовКЗаказу.Заказ = Заказ;
			
			СтрокаОтвета = ТаблицаОтветаПоЗаданиям.Добавить();
			СтрокаОтвета.НомерЗадания = СокрЛП(ПолучитьНомерЗаданияПоЗаказу(Заказ));
			СтрокаОтвета.СостояниеЗадания = 0;
			СтрокаОтвета.Сообщение = "";
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецФункции	

//Функция формирует файлы ответов
Функция СформироватьФайлПоТаблицеЗначений(ИмяФайла,Таблица)
	
	Если Таблица <> Неопределено И Таблица.Количество() > 0 Тогда
		
		Файл = Новый ТекстовыйДокумент;
		СтрокаТекст = "";
		КолвоКолонок = Таблица.Колонки.Количество();
		ПоследняКолонка = Таблица.Колонки.Получить(КолвоКолонок - 1);
		
		Для Каждого Строка Из Таблица Цикл
			
			Для Каждого Колонка Из Таблица.Колонки Цикл
				СтрокаТекст = СтрокаТекст + Формат(Строка[Колонка.Имя], "ЧН=; ЧГ=0") + ?(ПоследняКолонка = Колонка, "", "|*|");	
			КонецЦикла;	
			
			СтрокаТекст = СтрокаТекст + "|#|";
			
		КонецЦикла;
		
		Файл.УстановитьТекст(СтрокаТекст);
		Файл.Записать(ИмяФайла, "windows-1251");
		Возврат Истина;	
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

Функция ПолучитьНомерЗаданияПоЗаказу(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ВыгруженныеЗагруженныеДокументыПортал.НомерЗадания
	|ИЗ
	|	РегистрСведений.бит_ВыгруженныеЗагруженныеДокументыПортал КАК бит_ВыгруженныеЗагруженныеДокументыПортал
	|ГДЕ
	|	бит_ВыгруженныеЗагруженныеДокументыПортал.Документ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НомерЗадания;
	Иначе
		Возврат "";
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьСпособДоставкиИзКомментария(ОписаниеЗаказа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_СпособыДоставки.Ссылка,
	|	бит_СпособыДоставки.ПараметрСайта
	|ИЗ
	|	Справочник.бит_СпособыДоставки КАК бит_СпособыДоставки
	|ГДЕ
	|	бит_СпособыДоставки.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ПараметрСайта) И Найти(Нрег(ОписаниеЗаказа), Нрег(Выборка.ПараметрСайта)) > 0 Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции

ТаблицаОтветаПоЗаданиям = Новый ТаблицаЗначений;
ТаблицаОтветаПоЗаданиям.Колонки.Добавить("НомерЗадания");
ТаблицаОтветаПоЗаданиям.Колонки.Добавить("СостояниеЗадания");
ТаблицаОтветаПоЗаданиям.Колонки.Добавить("Сообщение");

НастройкаОбмена = Справочники.бит_НастройкиОбменаСПорталом.Москворечье;
ИмяКаталогаФайлаДляМосквы = НастройкаОбмена.ПапкаФайловДляМосквы; 

ОписаниеОшибки = "";