///////////////////Работа с сервером///////////////////
Функция ПолучитьСоединениеССерверомЧеков(Таймаут = 3) Экспорт
	
	Если ИспользоватьАутификациюНаКассовомСервере() Тогда
		Возврат Новый HTTPСоединение(Константы.АтолАдресВебСервера.Получить(),Константы.АтолПортВебСервера.Получить(),Константы.ЛогинКассовогоСервера.Получить(),Константы.ПарольКассовогоСервера.Получить(),,Таймаут);
	Иначе
		Возврат Новый HTTPСоединение(Константы.АтолАдресВебСервера.Получить(),Константы.АтолПортВебСервера.Получить(),,,,Таймаут);
	КонецЕсли;	
	
КонецФункции

Функция ИспользоватьАутификациюНаКассовомСервере()
	
	Возврат ПолучитьВерсиюСервераЧислом() >= 101070;
		
КонецФункции

Функция ИспользоватьНовыеРеквизитыВЧеках()
	
	Возврат ПолучитьВерсиюСервераЧислом() >= 101070;
		
КонецФункции

Функция ПолучитьВерсиюСервераЧислом()
	
	Версия = Константы.ВерсияКассовогоСервера.Получить();
	
	Если ЗначениеЗаполнено(Версия) Тогда
		
		Представление = Строка(Версия);
		Представление = СтрЗаменить(Представление, ".", "");
		
		Попытка
			Возврат Число(Представление);			
		Исключение
		    Возврат 0;
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ВернутьОписаниеОшибкиОтправкиЧекаВОчередьПоКоду(КодСостояния)
	
	Если КодСостояния = 401 Тогда
		Возврат "Авторизация не пройдена";
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат "ККТ не активирована";
	ИначеЕсли КодСостояния = 404 Тогда
		Возврат "ККТ по заданному идентификатору не найдена или ККТ по умолчанию не выбрана";
	ИначеЕсли КодСостояния = 408 Тогда
		Возврат "За 30 секунд не удалось захватить управление драйвером (занят фоновыми непрерываемыми задачами). Повторите запрос позже. Может произойти при включенной настройке validateRequestsOnAdd.";
	ИначеЕсли КодСостояния = 409 Тогда
		Возврат "Задание с таким же uuid уже существует";
	ИначеЕсли КодСостояния = 420 Тогда
		Возврат "Произошла ошибка во время проверки формата задания";
	Иначе
		Возврат "Не идентифицированный код состояния";
	КонецЕсли;
	
КонецФункции

Функция ВернутьОписаниеОшибкиОбновленияСтатусаКассы(КодСостояния)
	
	Если КодСостояния = 401 Тогда
		Возврат "Авторизация не пройдена";
	ИначеЕсли КодСостояния = 403 Тогда
		Возврат "ККТ не активирована";
	ИначеЕсли КодСостояния = 404 Тогда
		Возврат "ККТ по заданному идентификатору не найдена или ККТ по умолчанию не выбрана или задание с указанным UUID не найдено";
	ИначеЕсли КодСостояния = 408 Тогда
		Возврат "За 30 секунд не удалось захватить управление драйвером (занят фоновыми непрерываемыми задачами). Повторите запрос позже";
	ИначеЕсли КодСостояния = 420 Тогда
		Возврат "Ошибка при выполнении запроса";
	Иначе
		Возврат "Не идентифицированный код состояния";
	КонецЕсли;
	
КонецФункции

Функция ИспользоватьПечатьЧековЧерезСервер() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Использовать = Константы.АтолИспользоватьПечатьЧерезСервер.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Использовать;
	
КонецФункции

Функция ИспользоватьПечатьЧековЧерезСерверАМРВодитель() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Использовать = Константы.АтолИспользоватьПечатьЧерезСерверАРМВодитель.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Использовать;
	
КонецФункции

Функция ИспользоватРегламентныеЗаданияДляРаботыССерверомЧеков() Экспорт
	
	Возврат ИспользоватьПечатьЧековЧерезСервер() ИЛИ ИспользоватьПечатьЧековЧерезСерверАМРВодитель();
	
КонецФункции

Функция ПолучитьПользователяЗакрытияОткрытияСмены(Касса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыКассСрезПоследних.Пользователь
	|ИЗ
	|	РегистрСведений.СтатусыКасс.СрезПоследних(
	|			,
	|			Касса.ИД = &ИД
	|				И Пользователь <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК СтатусыКассСрезПоследних";
	
	Запрос.УстановитьПараметр("ИД", Касса.ИД);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Пользователь;
	Иначе 
		Возврат Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецФункции

Функция ФФД12()
	
	Возврат Константы.ФорматФискальныхДанных.Получить() = Перечисления.ФорматыФискальныхДанных.ОдинДва;
	
КонецФункции

Функция ВыводитьЧекСТоварамиИДругимиРеквизитами(Коррекция)
	
	Если ФФД12() Тогда
		Возврат Истина;
	Иначе
		Возврат Не Коррекция;
	КонецЕсли;	
		
КонецФункции


///////////////////Работа с чеками///////////////////
Процедура ОбновлениеСтатусовЗаданийНаПробитиеЧеков() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление статусов заданий на пробитие чеков", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат; 
		
	КонецЕсли;
	
	Если НЕ ИспользоватРегламентныеЗаданияДляРаботыССерверомЧеков() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Обновление статусов чеков.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаданийНаПробитиеЧеков,, "Начало выполнения регламентного задания ОбновлениеСтатусовЗаданийНаПробитиеЧеков");		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаПробитиеЧека.ПКО,
	               |	ЗаданияНаПробитиеЧека.ГУИД,
	               |	ЗаданияНаПробитиеЧека.Статус
	               |ИЗ
	               |	РегистрСведений.ЗаданияНаПробитиеЧека КАК ЗаданияНаПробитиеЧека
	               |ГДЕ
	               |	НЕ ЗаданияНаПробитиеЧека.Статус В (&СтатусыНеДляПроверки)";
	
	СтатусыНеДляПроверки = Новый СписокЗначений;
	СтатусыНеДляПроверки.Добавить("ready");
	СтатусыНеДляПроверки.Добавить("error");
	СтатусыНеДляПроверки.Добавить("prepare"); 	
	//+Белов А. 22.01.2026 #UT10-5638
	СтатусыНеДляПроверки.Добавить("check"); 	
	//-Белов А. 22.01.2026 #UT10-5638
	
	Запрос.УстановитьПараметр("СтатусыНеДляПроверки", СтатусыНеДляПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПКО = ВыборкаДетальныеЗаписи.ПКО;
		ГУИД = ВыборкаДетальныеЗаписи.ГУИД;
		
		ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКО.Метаданные(), ПКО, "Начало обновления статуса ГУИД: " + ГУИД);		
				
		СтруктураВозврата = ПроверитьЧекНаСервере(ГУИД, ПКО);
		
		Если СтруктураВозврата.Результат Тогда
			
			Если ЗначениеЗаполнено(СтруктураВозврата.НомерЧека) Тогда
				
				ПКООбъект = ПКО.ПолучитьОбъект();
				ПКООбъект.ОбменДанными.Загрузка = Истина;    
				
				//+Белов А. 13.11.2024 #UT10-4894
				ПКООбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
				//-Белов А. 13.11.2024 #UT10-4894
				
				Если ТипЗнч(ПКО) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") И ПКООбъект.Аннулирован И ЗначениеЗаполнено(ПКООбъект.НомерЧекаККМ) Тогда
					ПКООбъект.НомерЧекаККМАннулирование = СтруктураВозврата.НомерЧека;
				Иначе
					ПКООбъект.НомерЧекаККМ = СтруктураВозврата.НомерЧека;
				КонецЕсли; 
				
				ПКООбъект.Записать(РежимЗаписиДокумента.Запись);
				
			КонецЕсли;
			
			ИзменитьСтатусЗаданияНаПробитиеЧека(ПКО, ГУИД, СтруктураВозврата.Статус, Ложь, ?(Не ЗначениеЗаполнено(СтруктураВозврата.НомерЧека), СтруктураВозврата.Сообщение, ""));
			
			ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКО.Метаданные(), ПКО, "Изменен статус на " + СтруктураВозврата.Статус);		
			
			Если СтруктураВозврата.Статус = "error" Тогда
				ЗаписьЖурналаРегистрации("Обновление статусов чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, ПКО.Метаданные(), ПКО, "Обнаружен статус error при обновлении задания на печать: " + ГУИД);				
			КонецЕсли;
			
		Иначе
			
			Если ВыборкаДетальныеЗаписи.Статус = "unknown" И СтруктураВозврата.КодОшибки = 505 Тогда
				ИзменитьСтатусЗаданияНаПробитиеЧека(ПКО, ГУИД, "error", Ложь, СтруктураВозврата.Сообщение);	
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	
	//Отправляем предварительные задания на печать
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаПробитиеЧека.ПКО,
	               |	ЗаданияНаПробитиеЧека.ГУИД,
	               |	ЗаданияНаПробитиеЧека.ПКО.Касса КАК ПКОКасса,
	               |	ЗаданияНаПробитиеЧека.ТекстОшибки
	               |ИЗ
	               |	РегистрСведений.ЗаданияНаПробитиеЧека КАК ЗаданияНаПробитиеЧека
	               |ГДЕ
	               |	ЗаданияНаПробитиеЧека.Статус В (&СтатусыДляОтправки)
	               |	И НЕ ЗаданияНаПробитиеЧека.Обработан
	               |ИТОГИ ПО
	               |	ПКОКасса";
	
	СтатусыДляОтправки = Новый СписокЗначений;
	СтатусыДляОтправки.Добавить("prepare");
	
	Запрос.УстановитьПараметр("СтатусыДляОтправки", СтатусыДляОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Касса = ВыборкаДетальныеЗаписи.ПКОКасса;
		
		ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получение статуса возможности отправки предварительных документов по кассе " + Строка(Касса));			
		
		МожноЛиПечататьСтруктура = МожноПечататьЧеки(Касса);
		
		Если Не МожноЛиПечататьСтруктура.Результат Тогда
			
			ЗаписьЖурналаРегистрации("Обновление статусов чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, "Получен отрицательный ответ при запросе отправки предварительных документов по кассе " + Строка(Касса) + Символы.ПС + МожноЛиПечататьСтруктура.Сообщение);				
			Продолжить; 
			
		Иначе
			ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен положительный ответ при запросе отправки предварительных документов по кассе " + Строка(Касса));				
		КонецЕсли;

		Выборка = ВыборкаДетальныеЗаписи.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			//+Белов А. 22.01.2026 #UT10-5638
			//Для этих видов докуменов используем отложенную проверку по биллингу
			Если (ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.КорректировкаРеализации"))
				И Выборка.ПКО.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг Тогда
				
				//+Белов А. 28.08.2026 #UT10-6002
				Если ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И Выборка.ПКО.ДоговорКонтрагента.ЛицевойСчет Тогда
					
					Если РаботаСТоварамиНаДоставке.ТоварПередан(Выборка.ПКО) Тогда
						
						ИзменитьСтатусЗаданияНаПробитиеЧека(Выборка.ПКО, Выборка.ГУИД, "prepare", Истина, Выборка.ТекстОшибки);
						Чеки.ЗаписатьНовоеЗадание(Выборка.ПКО, "check");  
						
					КонецЕсли;
					
				Иначе
					//-Белов А. 28.08.2026 #UT10-6002
					
					ИзменитьСтатусЗаданияНаПробитиеЧека(Выборка.ПКО, Выборка.ГУИД, "prepare", Истина, Выборка.ТекстОшибки);
					Чеки.ЗаписатьНовоеЗадание(Выборка.ПКО, "check");  
					
				КонецЕсли;	
				 
				Продолжить;
				
			КонецЕсли;    
			//-Белов А. 22.01.2026 #UT10-5638
							
			Если ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
				СтруктураВозврата = ОтправитьЧекВОчередьНаПечать(Выборка.ПКО, Истина, Выборка.ПКО.Аннулирован И ЗначениеЗаполнено(Выборка.ПКО.НомерЧекаККМ));
			ИначеЕсли ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
				
				Если Выборка.ПКО.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя Тогда
					СтруктураВозврата = ОтправитьЧекВОчередьНаПечать(Выборка.ПКО, Истина,, Константы.АдресПортала.Получить());
				Иначе
					СтруктураВозврата = ОтправитьЧекНаВозвратВОчередьНаПечать(Выборка.ПКО, Истина, Константы.АдресПортала.Получить());
				КонецЕсли; 
				
			ИначеЕсли ТипЗнч(Выборка.ПКО) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				СтруктураВозврата = ОтправитьЧекВОчередьНаПечать(Выборка.ПКО, Истина);
			Иначе
				СтруктураВозврата = ОтправитьЧекНаВозвратВОчередьНаПечать(Выборка.ПКО);
			КонецЕсли;
			
			Если НЕ СтруктураВозврата.Результат Тогда
				
				ИзменитьСтатусЗаданияНаПробитиеЧека(Выборка.ПКО, Выборка.ГУИД, "prepare", Ложь, СтруктураВозврата.Сообщение);
				ЗаписьЖурналаРегистрации("Обновление статусов чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Выборка.ПКО.Метаданные(), Выборка.ПКО, "Не удалось поменять статус с prepare на new. Документ не был отправлен в очередь на печать" + Символы.ПС + СтруктураВозврата.Сообщение);								
				
			Иначе
				
				ИзменитьСтатусЗаданияНаПробитиеЧека(Выборка.ПКО, Выборка.ГУИД, "prepare", Истина, Выборка.ТекстОшибки);
				ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, Выборка.ПКО.Метаданные(), Выборка.ПКО, "Документ успешно изменил статус с prepare на new и отправлен в очередь на печать");								
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Обновление статусов чеков.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаданийНаПробитиеЧеков,, "Окончание выполнения регламентного задания ОбновлениеСтатусовЗаданийНаПробитиеЧеков");		
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки() Экспорт
//+Белов А. 22.01.2026 #UT10-5638

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление статусов заданий на пробитие чеков проверки", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат; 
		
	КонецЕсли;
	
	Если НЕ ИспользоватРегламентныеЗаданияДляРаботыССерверомЧеков() Тогда
		Возврат;
	КонецЕсли;  
	
	ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки,, "Начало выполнения регламентного задания ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки");		
	
	//Отправляем предварительные задания на печать
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаданияНаПробитиеЧека.ПКО,
	               |	ЗаданияНаПробитиеЧека.ГУИД,
	               |	ЗаданияНаПробитиеЧека.ПКО.Касса КАК ПКОКасса,
	               |	ЗаданияНаПробитиеЧека.ТекстОшибки,
	               |	ЗаданияНаПробитиеЧека.Период,
	               |	ЗаданияНаПробитиеЧека.Тест
	               |ИЗ
	               |	РегистрСведений.ЗаданияНаПробитиеЧека КАК ЗаданияНаПробитиеЧека
	               |ГДЕ
	               |	ЗаданияНаПробитиеЧека.Статус В(&СтатусыДляОтправки)
	               |	И НЕ ЗаданияНаПробитиеЧека.Обработан
	               |ИТОГИ ПО
	               |	ПКОКасса";
	
	СтатусыДляОтправки = Новый СписокЗначений;
	СтатусыДляОтправки.Добавить("check");
	
	Запрос.УстановитьПараметр("СтатусыДляОтправки", СтатусыДляОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Касса = ВыборкаДетальныеЗаписи.ПКОКасса; 
		
		ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получение статуса возможности отправки предварительных документов по кассе " + Строка(Касса));			
		
		МожноЛиПечататьСтруктура = МожноПечататьЧеки(Касса);
		
		Если Не МожноЛиПечататьСтруктура.Результат Тогда
			
			ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, "Получен отрицательный ответ при запросе отправки предварительных документов по кассе " + Строка(Касса) + Символы.ПС + МожноЛиПечататьСтруктура.Сообщение);				
			Продолжить; 
			
		Иначе
			ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен положительный ответ при запросе отправки предварительных документов по кассе " + Строка(Касса));				
		КонецЕсли;   
		
		Выборка = ВыборкаДетальныеЗаписи.Выбрать(); 
		
		МассивИдентификаторов = Новый Массив;
		
		Пока Выборка.Следующий() Цикл
			
			Если ТипЗнч(Выборка.ПКО) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.Тест Тогда
				МассивИдентификаторов.Добавить(Выборка.ГУИД);
			Иначе
				МассивИдентификаторов.Добавить(Строка(Выборка.ПКО.УникальныйИдентификатор()));
			КонецЕсли; 	
			
		КонецЦикла;        
		
		ТаблицаОплаченныхДокументов = ПолучитьТаблицуОплаченныхДокументовИзБиллинга(МассивИдентификаторов);
		
		//Если не смогли достучаться до биллинга, то пропускаем
		Если МассивИдентификаторов.Количество() > 0 И ТаблицаОплаченныхДокументов = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
			
			ДокументПечати = Выборка.ПКО; 
			//Коррекция = НачалоДня(Выборка.Период) <> НачалоДня(ТекущаяДата()); 
			Коррекция = Ложь;
			
			Если Выборка.Тест Тогда
				ГУИД = Выборка.ГУИД;	
			Иначе
				ГУИД = Строка(ДокументПечати.УникальныйИдентификатор());
			КонецЕсли;
				
			Если ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				СтрокаВТаблице = ТаблицаОплаченныхДокументов.Найти(ГУИД, "source_id");  
				
				Если СтрокаВТаблице = Неопределено Тогда
					
					ИзменитьСтатусЗаданияНаПробитиеЧека(ДокументПечати, Выборка.ГУИД, "check", Ложь, "Не удалось получить данные из биллинга по оплате");
					Продолжить;
					
				КонецЕсли;
				
				Если СтрокаВТаблице.is_paid Тогда
					СтруктураВозврата = ОтправитьЧекВОчередьНаПечать(ДокументПечати, Истина,,, Коррекция);	
				Иначе					
					
					ТекстОшибки = "";
					
					Если Не СтрокаВТаблице.found Тогда
						ТекстОшибки = "Такая реализация в биллинге не была найдена";	
					ИначеЕсли Не СтрокаВТаблице.is_paid Тогда					
						ТекстОшибки = "Реализация пока не оплачена";
					КонецЕсли; 
					
					ИзменитьСтатусЗаданияНаПробитиеЧека(ДокументПечати, Выборка.ГУИД, "check", Ложь, ТекстОшибки);	
					
					Продолжить;
					
				КонецЕсли;						
				
			ИначеЕсли ТипЗнч(ДокументПечати) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				
				Реализация = ПолучитьРеализациюПоКорректировке(ДокументПечати);                   
				
				Если ЗначениеЗаполнено(Реализация.НомерЧекаККМ) Тогда 				
					СтруктураВозврата = ОтправитьЧекНаВозвратВОчередьНаПечать(ДокументПечати, Истина,, Коррекция);					
				Иначе          
					//Ждем когда реализация распечатается и проставится номер чека
					Продолжить;				
				КонецЕсли;  
				
			Иначе
				Продолжить;
			КонецЕсли;  
			
			
			Если НЕ СтруктураВозврата.Результат Тогда
				
				ИзменитьСтатусЗаданияНаПробитиеЧека(ДокументПечати, Выборка.ГУИД, "check", Ложь, СтруктураВозврата.Сообщение);
				ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Ошибка", УровеньЖурналаРегистрации.Ошибка, ДокументПечати.Метаданные(), ДокументПечати, "Не удалось поменять статус с check на new. Документ не был отправлен в очередь на печать" + Символы.ПС + СтруктураВозврата.Сообщение);								
				
			Иначе
				
				ИзменитьСтатусЗаданияНаПробитиеЧека(ДокументПечати, Выборка.ГУИД, "check", Истина, Выборка.ТекстОшибки);
				ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Обработка", УровеньЖурналаРегистрации.Информация, ДокументПечати.Метаданные(), ДокументПечати, "Документ успешно изменил статус с check на new и отправлен в очередь на печать");								
				
			КонецЕсли;    
			
		КонецЦикла;  
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки,, "Начало выполнения регламентного задания ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки");		
	
//-Белов А. 22.01.2026 #UT10-5638	
КонецПроцедуры

Функция ПолучитьТаблицуОплаченныхДокументовИзБиллинга(МассивИдентификаторов)
	
	Тело = ОбщегоНазначения.ВернутьJSON(Новый Структура("source_ids", МассивИдентификаторов));
	
	СтруктураРезультата = AMQP_РаботаСДокументами.ОтправитьЗапросВБиллинг("api/v2/client/check-realization-payment", "Получение данных по оплате реализаций",,,,, Тело);
	
	Если СтруктураРезультата.Результат <> 0 Тогда
		
		ЗаписьЖурналаРегистрации("Обновление статусов чеков проверки.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегламентныеЗадания.ОбновлениеСтатусовЗаданийНаПробитиеЧековПроверки,, "Возникла ошибка при получении данных из биллинга: " + СтруктураРезультата.Сообщение);		
		Возврат Неопределено;
		
	КонецЕсли;   
	
	Возврат ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(СтруктураРезультата.Данные);	
	
КонецФункции                                                               

Процедура ИзменитьСтатусЗаданияНаПробитиеЧека(ПКО, ГУИД, НовыйСтатус, Обработан, ТекстОшибки)
	
	НаборЗаписей = РегистрыСведений.ЗаданияНаПробитиеЧека.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПКО.Установить(ПКО);
	НаборЗаписей.Прочитать();
	
	Для каждого ЗаписьНабора ИЗ НаборЗаписей Цикл
		
		Если ЗаписьНабора.ГУИД <> ГУИД Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьНабора.Статус = НовыйСтатус;
		ЗаписьНабора.Обработан = Обработан;
		ЗаписьНабора.ТекстОшибки = ТекстОшибки;
		ЗаписьНабора.ДатаОбновления = ТекущаяДата();
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ОтправитьНефискальныйЧекВОчередьНаПечать(Текст, Касса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Печать чеков.Начало", УровеньЖурналаРегистрации.Информация, , , "Начало выполнения функции отправки нефискального чека на сервер печати");		
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ГУИД = Строка(Новый УникальныйИдентификатор());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/requests?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка  
		
		СтруктураЗапроса = Новый Структура;      
		СтруктураЗапроса.Вставить("uuid", ГУИД);
		
		МассивСтрок = Новый Массив; 
		
		СтруктураСтроки = Новый Структура; 
		СтруктураСтроки.Вставить("type", "nonFiscal");
		
		МассивЭлементов = Новый Массив;
		МассивЭлементов.Добавить(Новый Структура("type, text, alignment", "text", Текст, "left"));
		
		СтруктураСтроки.Вставить("items", МассивЭлементов);
		
		МассивСтрок.Добавить(СтруктураСтроки);  
		
		СтруктураЗапроса.Вставить("request", МассивСтрок);
	
		СтрокаЗапросаJS = ВернутьJSON(СтруктураЗапроса);
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, , , "Успешно сформирован JSON для отправки на сервер" + Символы.ПС + СтрокаЗапросаJS);		
		
	Исключение
		
		ТекстОшибки = "Ошибка формирования менеджера задания (JSON)" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;   
		
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , СтруктураВозврата.Сообщение);
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапросаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		
		Соединение = ПолучитьСоединениеССерверомЧеков(10);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, , , "Подключение и отправка нефискального чека на сервер " + СерверОтправки + " выполнена успешно! " + Символы.ПС + Ответ);		
		
	Исключение 	
		
		ТекстОшибки = "Ошибка отправки нефискального чека на сервер" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;  
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат СтруктураВозврата;		
		
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 201 Тогда
		
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния) + Символы.ПС + ВернутьОписаниеОшибкиОтправкиЧекаВОчередьПоКоду(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, , , СтруктураВозврата.Сообщение);		
		
		Возврат СтруктураВозврата;   
		
	Иначе
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, , , "Получен успешный ответ при отправке нефискального чека на сервер. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Сообщение = "Чек успешно отправлен в очередь!";
	
	ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, , , "Успешное завершение выполнения функции отправки нефискального чека на сервер печати");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьЧекВОчередьНаПечать(ПКОСсылка, Электронный = Ложь, Аннулирование = Ложь, МестоРасчетов = "", Коррекция = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Печать чеков.Начало", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Начало выполнения функции отправки ПКО на сервер печати");		
	
	Касса = ПКОСсылка.Касса;
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ГУИД = Строка(Новый УникальныйИдентификатор());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/requests?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		
		Если Аннулирование Тогда
			СтруктураJSON = СформироватьСтруктуруДляВозврата(ГУИД, Касса, ПКОСсылка, Электронный, МестоРасчетов, Коррекция);
		Иначе
			СтруктураJSON = СформироватьСтруктуруДляФискальногоЧека(ГУИД, Касса, ПКОСсылка, Электронный, МестоРасчетов, Коррекция);
		КонецЕсли;
	
		СтрокаЗапросаJS = ВернутьJSON(СтруктураJSON);
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Успешно сформирован JSON для отправки на сервер" + Символы.ПС + СтрокаЗапросаJS);		
		
	Исключение
		
		ТекстОшибки = "Ошибка формирования менеджера задания (JSON)" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, ПКОСсылка.Метаданные(), ПКОСсылка, СтруктураВозврата.Сообщение);		
		
		Возврат СтруктураВозврата;   
		
	КонецПопытки;
	
	//+Сёмин Р.И. 08.09.2026 #UT10-6020
	////+Сёмин Р.И. 08.07.2026 #UT10-5935
	//КодыМаркировки = Новый Массив;
	//
	//Если Константы.ИспользоватьПроверкуМаркировокТСПИоТ.Получить() Тогда
	//	
	//	//+Сёмин Р.И. 05.08.2026 #UT10-5994
	//	//Если ВДокументеЛицевойИлиРозничныйДоговор(ПКОСсылка) Тогда
	//	Если ВДокументеЛицевойИлиРозничныйДоговор(ПКОСсылка) И НЕ ЭтоОплатаКартойИлиПКОСЛицевымСчетом(ПКОСсылка) Тогда
	//	//-Сёмин Р.И. 05.08.2026 #UT10-5994	
	//		
	//		лСтруктураЧека = Новый Структура;
	//		РезультатЗапросаМаркировкиПоДокументу = ПолучитьМаркировкуПоДокументу(ПКОСсылка, Ложь, лСтруктураЧека, Истина);
	//		
	//		Если НЕ РезультатЗапросаМаркировкиПоДокументу.Пустой() Тогда
	//			
	//			КодыМаркировки = РезультатЗапросаМаркировкиПоДокументу.Выгрузить().ВыгрузитьКолонку("ШК");
	//			
	//			//+Сёмин Р.И. 04.08.2026 #UT10-5994
	//			//Если Аннулирование Тогда
	//			//	РезультатРегистрацииПродажиПИоТ = ЗарегистрироватьПродажуВозвратПИоТ(КодыМаркировки, Константы.АдресТСПИоТ.Получить(), "Возврат", "ПечатьЧека", ПКОСсылка, "Печать чеков.Обработка");
	//			//Иначе
	//			//	РезультатРегистрацииПродажиПИоТ = ЗарегистрироватьПродажуВозвратПИоТ(КодыМаркировки, Константы.АдресТСПИоТ.Получить(), "Продажа", "ПечатьЧека", ПКОСсылка, "Печать чеков.Обработка");
	//			//КонецЕсли;
	//			//
	//			//Если НЕ РезультатРегистрацииПродажиПИоТ.Результат Тогда
	//			//	
	//			//	СтруктураВозврата.Сообщение = РезультатРегистрацииПродажиПИоТ.Сообщение;
	//			//	ЗаписатьНовоеЗадание(ПКОСсылка, "error", СтруктураВозврата.Сообщение, ГУИД);
	//			//	
	//			//	Возврат СтруктураВозврата;
	//			//	
	//			//КонецЕсли;
	//			
	//			ЗаписатьЗаданиеСоСтатусомError = Истина;
	//			
	//			Если Аннулирование Тогда
	//				ДействиеПИоТ = "Возврат";
	//			Иначе
	//				ДействиеПИоТ = "Продажа";
	//			КонецЕсли;
	//			
	//			РезультатПроверкиКодовМаркировкиПИоТ = ПроверитьКодыМаркировкиПИоТ(КодыМаркировки, Константы.АдресТСПИоТ.Получить(), ДействиеПИоТ, "Проверка при печати чека", ПКОСсылка);
	//			
	//			Если РезультатПроверкиКодовМаркировкиПИоТ.Результат Тогда
	//				
	//				ЗаписатьЗаданиеСоСтатусомError = Ложь;
	//				
	//				Для Каждого Стр Из КодыМаркировки Цикл
	//					
	//					РезультатРегистрацииПродажиПИоТ = ЗарегистрироватьПродажуВозвратПИоТ(Стр, Константы.АдресТСПИоТ.Получить(), ДействиеПИоТ, "Печать чека", ПКОСсылка, "Печать чеков.Обработка");
	//					
	//					Если НЕ РезультатРегистрацииПродажиПИоТ.Результат Тогда
	//						
	//						ЗаписатьЗаданиеСоСтатусомError = Истина;
	//						СтруктураВозврата.Сообщение = РезультатРегистрацииПродажиПИоТ.Сообщение;
	//						
	//						Прервать;
	//						
	//					КонецЕсли;
	//					
	//				КонецЦикла;
	//				
	//			Иначе
	//				СтруктураВозврата.Сообщение = РезультатПроверкиКодовМаркировкиПИоТ.Сообщение;
	//			КонецЕсли;
	//			
	//			Если ЗаписатьЗаданиеСоСтатусомError Тогда
	//				
	//				ЗаписатьНовоеЗадание(ПКОСсылка, "error", СтруктураВозврата.Сообщение, ГУИД);
	//				
	//				Возврат СтруктураВозврата;
	//				
	//			КонецЕсли;
	//			//-Сёмин Р.И. 04.08.2026 #UT10-5994
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////-Сёмин Р.И. 08.07.2026 #UT10-5935
	//-Сёмин Р.И. 08.09.2026 #UT10-6020
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапросаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		
		Соединение = ПолучитьСоединениеССерверомЧеков(10);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Подключение и отправка чека на сервер " + СерверОтправки + " выполнена успешно! " + Символы.ПС + Ответ);		
		
	Исключение
		
		ЗаписатьНовоеЗадание(ПКОСсылка, "unknown",, ГУИД);
		
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Ошибка, ПКОСсылка.Метаданные(), ПКОСсылка, "Запрос на отправку чека на сервер отвалился по таймауту, но статус был записан в регистр сведений ЗаданияНаПробитиеЧека для дальнейшего уточнения. ГУИД: " + ГУИД);
		
		СтруктураВозврата.Результат = Истина;
		СтруктураВозврата.Сообщение = "Чек успешно отправлен в очередь!";
		
		ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Успешное завершение выполнения функции отправки ПКО на сервер печати");
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 201 Тогда
		
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния) + Символы.ПС + ВернутьОписаниеОшибкиОтправкиЧекаВОчередьПоКоду(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, ПКОСсылка.Метаданные(), ПКОСсылка, СтруктураВозврата.Сообщение);
		
		Возврат СтруктураВозврата; 
		
	Иначе
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Получен успешный ответ при отправке чека на сервер. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
	КонецЕсли;
	
	ЗаписатьНовоеЗадание(ПКОСсылка, "new",, ГУИД);
	
	ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Чек успешно записан в регистр сведений ЗаданияНаПробитиеЧека. ГУИД: " + ГУИД);		
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Сообщение = "Чек успешно отправлен в очередь!";
	
	ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, ПКОСсылка.Метаданные(), ПКОСсылка, "Успешное завершение выполнения функции отправки ПКО на сервер печати");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьЧекНаВозвратВОчередьНаПечать(РКОСсылка, Электронный = Ложь, МестоРасчетов = "", Коррекция = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Печать чеков.Начало", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Начало выполнения функции отправки РКО на сервер печати");		
	
	Касса = РКОСсылка.Касса;
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	ГУИД = Строка(Новый УникальныйИдентификатор());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/requests?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		
		СтруктураJSON = СформироватьСтруктуруДляВозврата(ГУИД, Касса, РКОСсылка, Электронный, МестоРасчетов, Коррекция);
		СтрокаЗапросаJS = ВернутьJSON(СтруктураJSON);
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Успешно сформирован JSON для отправки на сервер" + Символы.ПС + СтрокаЗапросаJS);		
		
	Исключение
		
		ТекстОшибки = "Ошибка формирования менеджера задания (JSON)" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, РКОСсылка.Метаданные(), РКОСсылка, СтруктураВозврата.Сообщение);		
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	//+Сёмин Р.И. 08.09.2026 #UT10-6020
	////+Сёмин Р.И. 10.07.2026 #UT10-5935
	//КодыМаркировки = Новый Массив;
	//
	//Если Константы.ИспользоватьПроверкуМаркировокТСПИоТ.Получить() Тогда
	//	
	//	//+Сёмин Р.И. 05.08.2026 #UT10-5994
	//	//Если ВДокументеЛицевойИлиРозничныйДоговор(РКОСсылка) Тогда
	//	Если ВДокументеЛицевойИлиРозничныйДоговор(РКОСсылка) И НЕ ЭтоОплатаКартойИлиПКОСЛицевымСчетом(РКОСсылка) Тогда
	//	//-Сёмин Р.И. 05.08.2026 #UT10-5994	
	//		
	//		лСтруктураЧека = Новый Структура;
	//		РезультатЗапросаМаркировкиПоДокументу = ПолучитьМаркировкуПоДокументу(РКОСсылка, Ложь, лСтруктураЧека, Истина);
	//		
	//		Если НЕ РезультатЗапросаМаркировкиПоДокументу.Пустой() Тогда
	//			
	//			КодыМаркировки = РезультатЗапросаМаркировкиПоДокументу.Выгрузить().ВыгрузитьКолонку("ШК");
	//			
	//			//+Сёмин Р.И. 04.08.2026 #UT10-5994
	//			//РезультатРегистрацииПродажиПИоТ = ЗарегистрироватьПродажуВозвратПИоТ(КодыМаркировки, Константы.АдресТСПИоТ.Получить(), "Возврат", "ПечатьЧека", РКОСсылка, "Печать чеков.Обработка");
	//			//
	//			//Если НЕ РезультатРегистрацииПродажиПИоТ.Результат Тогда
	//			//	
	//			//	СтруктураВозврата.Сообщение = РезультатРегистрацииПродажиПИоТ.Сообщение;
	//			//	ЗаписатьНовоеЗадание(РКОСсылка, "error", СтруктураВозврата.Сообщение, ГУИД);
	//			//	
	//			//	Возврат СтруктураВозврата;
	//			//	
	//			//КонецЕсли;
	//			
	//			ЗаписатьЗаданиеСоСтатусомError = Истина;
	//			
	//			ДействиеПИоТ = "Возврат";
	//			
	//			РезультатПроверкиКодовМаркировкиПИоТ = ПроверитьКодыМаркировкиПИоТ(КодыМаркировки, Константы.АдресТСПИоТ.Получить(), ДействиеПИоТ, "Проверка при печати чека", РКОСсылка);
	//			
	//			Если РезультатПроверкиКодовМаркировкиПИоТ.Результат Тогда
	//				
	//				ЗаписатьЗаданиеСоСтатусомError = Ложь;
	//				
	//				Для Каждого Стр Из КодыМаркировки Цикл
	//					
	//					РезультатРегистрацииПродажиПИоТ = ЗарегистрироватьПродажуВозвратПИоТ(Стр, Константы.АдресТСПИоТ.Получить(), ДействиеПИоТ, "Печать чека", РКОСсылка, "Печать чеков.Обработка");
	//					
	//					Если НЕ РезультатРегистрацииПродажиПИоТ.Результат Тогда
	//						
	//						ЗаписатьЗаданиеСоСтатусомError = Истина;
	//						СтруктураВозврата.Сообщение = РезультатРегистрацииПродажиПИоТ.Сообщение;
	//						
	//						Прервать;
	//						
	//					КонецЕсли;
	//					
	//				КонецЦикла;
	//				
	//			Иначе
	//				СтруктураВозврата.Сообщение = РезультатПроверкиКодовМаркировкиПИоТ.Сообщение;
	//			КонецЕсли;
	//			
	//			Если ЗаписатьЗаданиеСоСтатусомError Тогда
	//				
	//				ЗаписатьНовоеЗадание(РКОСсылка, "error", СтруктураВозврата.Сообщение, ГУИД);
	//				
	//				Возврат СтруктураВозврата;
	//				
	//			КонецЕсли;
	//			//-Сёмин Р.И. 04.08.2026 #UT10-5994
	//			
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	////-Сёмин Р.И. 10.07.2026 #UT10-5935
	//-Сёмин Р.И. 08.09.2026 #UT10-6020
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапросаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		
		Соединение = ПолучитьСоединениеССерверомЧеков(10);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Подключение и отправка чека на сервер " + СерверОтправки + " выполнена успешно! " + Символы.ПС + Ответ);		
		
	Исключение
		
		ЗаписатьНовоеЗадание(РКОСсылка, "unknown",, ГУИД);
		
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Ошибка, РКОСсылка.Метаданные(), РКОСсылка, "Запрос на отправку чека на сервер отвалился по таймауту, но статус был записан в регистр сведений ЗаданияНаПробитиеЧека для дальнейшего уточнения. ГУИД: " + ГУИД);
		
		СтруктураВозврата.Результат = Истина;
		СтруктураВозврата.Сообщение = "Чек успешно отправлен в очередь!";
		
		ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Успешное завершение выполнения функции отправки РКО на сервер печати");
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 201 Тогда
		
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния) + Символы.ПС + ВернутьОписаниеОшибкиОтправкиЧекаВОчередьПоКоду(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, РКОСсылка.Метаданные(), РКОСсылка, СтруктураВозврата.Сообщение);
		
		Возврат СтруктураВозврата; 
		
	Иначе
		ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Получен успешный ответ при отправке чека на сервер. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
	КонецЕсли;
	
	ЗаписатьНовоеЗадание(РКОСсылка, "new",, ГУИД);
	
	ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Чек успешно записан в регистр сведений ЗаданияНаПробитиеЧека. ГУИД: " + ГУИД);		
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Сообщение = "Чек успешно отправлен в очередь!";
	
	ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, РКОСсылка.Метаданные(), РКОСсылка, "Успешное завершение выполнения функции отправки РКО на сервер печати");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПроверитьЧекНаСервере(ГУИД, ПКО)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение, Статус, НомерЧека, КодОшибки", Ложь, "", "", 0, 0);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Результат = ПолучитьСоединениеССерверомЧеков();
	НовыйЗапрос = Новый HTTPЗапрос("/api/v2/requests/" + ГУИД + "?deviceID=" + ПКО.Касса.ИД);
	
	Попытка
		
		НовыйОтвет = Результат.Получить(НовыйЗапрос);
		Тело = НовыйОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON.УстановитьСтроку(Тело);
		Данные = ПрочитатьJSON(ЧтениеJSON);
		ЗаписьЖурналаРегистрации("Обновление статусов чеков.Обработка", УровеньЖурналаРегистрации.Информация, ПКО.Метаданные(), ПКО, "Получен ответ от сервера " + СерверОтправки + Символы.ПС + Тело);		
		
	Исключение
		
		ТекстОшибки = "Обнаружены ошибки при получении ответа от сервера " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Обновление статусов чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, ПКО.Метаданные(), ПКО, ТекстОшибки);		
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	Если Данные.Свойство("results") И Данные.results.Количество() > 0 Тогда
		
		Результат = Данные.results[0];
		
		Если Результат.status = "error" Тогда
			СтруктураВозврата.Сообщение = Результат.error.description + ". КодОшибки " + Строка(Результат.error.code);	
		ИначеЕсли Результат.status = "ready" Тогда
			
			//+Белов А. 04.02.2026 #UT10-5641 - если отправляются коды маркировки, то при статусе ready этих параметров может не быть. Значит марки не прошли проверку, либо нет связи с ИСМ или другая ошибка 			
			Если Результат.Свойство("result") И Результат.result.Свойство("fiscalParams") Тогда
			//-Белов А. 04.02.2026 #UT10-5641
			
				СтруктураВозврата.Сообщение = "Чек успешно распечатан";				
				СтруктураВозврата.НомерЧека = Результат.result.fiscalParams.fiscalDocumentNumber;  	   
				
			Иначе
				
				//+Белов А. 04.02.2026 #UT10-5641
				Результат.status = "error"; 
				
				Если Результат.Свойство("error") И Результат.error.code > 0 Тогда
					СтруктураВозврата.Сообщение = Результат.error.description + ". КодОшибки " + Строка(Результат.error.code);	
				КонецЕсли;  
				
				Если Результат.Свойство("result") И Результат.result.Свойство("validateMarks") И Результат.result.validateMarks.Количество() > 0 Тогда
					
					СтруктураВозврата.Сообщение	= СтруктураВозврата.Сообщение + Символы.ПС + ОбщегоНазначения.ВернутьJSON(Результат.result.validateMarks);
					
					//Если ПроверкаМарок.Свойство("driverError") И ПроверкаМарок.driverError.code > 0 Тогда
					//	СтруктураВозврата.Сообщение	= СтруктураВозврата.Сообщение + Символы.ПС + "Ошибка драйвера при проверке КМ: " + ПроверкаМарок.driverError.error + ". КодОшибки " + Строка(ПроверкаМарок.driverError.code);						
					//КонецЕсли;	
					
				КонецЕсли;  
				//-Белов А. 04.02.2026 #UT10-5641			
				
			КонецЕсли;
			
			
		Иначе   
			
			Если Результат.Свойство("error") И Результат.error.code > 0 Тогда
				СтруктураВозврата.Сообщение = Результат.error.description + ". КодОшибки " + Строка(Результат.error.code);	
			КонецЕсли; 
			
		КонецЕсли;
		
		СтруктураВозврата.Статус = Результат.status;
		СтруктураВозврата.Результат = Истина;

	Иначе
		
		Если Данные.Свойство("error") И Данные.error.Свойство("description") Тогда
			
			ТекстОшибки = Данные.error.description;
			СтруктураВозврата.КодОшибки = Данные.error.code;        
			
		Иначе
			ТекстОшибки = "В ответе отсутствует результат в необходимом формате";
		КонецЕсли;
	
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Обновление статусов чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, ПКО.Метаданные(), ПКО, ТекстОшибки);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
			
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СформироватьСтруктуруДляВозврата(уникИД, Касса, ДополнительныеПараметры, Электронный, МестоРасчетов, Коррекция)
	
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СтруктураJSON = Новый Структура();
	СтруктураJSON.Вставить("uuid", уникИД);
	МассивПараметров = Новый Массив();
	СтруктураЧека = Новый Структура();
	
	//+Белов А. 02.02.2026 #UT10-5641 	
	ВыводитьЧекСТоварамиИДругимиРеквизитами = ВыводитьЧекСТоварамиИДругимиРеквизитами(Коррекция);
	//-Белов А. 02.02.2026 #UT10-5641
	
	//Тип задания
	//sell - чек прихода buy - чек расхода sellReturn - чек возврата прихода buyReturn - чек возврата расхода
	Если Коррекция Тогда  
		
		type = "buyCorrection"; 
		СтруктураЧека.Вставить("correctionType", "self");
		СтруктураЧека.Вставить("correctionBaseDate", Формат(ДополнительныеПараметры.Дата, "ДФ=гггг.ММ.дд"));
		СтруктураЧека.Вставить("correctionBaseNumber", ДополнительныеПараметры.Номер); 
		
	Иначе
		type = "sellReturn";            
	КонецЕсли;

	СтруктураЧека.Вставить("type", type);
	//Электронный чек
	СтруктураЧека.Вставить("electronically", Электронный);   
	
	//taxationType Система налогообложения
	taxationType = "osn";
	Если Не ПустаяСтрока(taxationType) Тогда
		СтруктураЧека.Вставить("taxationType", taxationType);
	КонецЕсли;  
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641
		
		//useVAT18 использовать при регистрации чека ставку налога 18%
		СтруктураЧека.Вставить("useVAT18", Ложь);
		
		//+Белов А. 28.08.2025 #
		Если ЗначениеЗаполнено(МестоРасчетов) Тогда
			СтруктураЧека.Вставить("paymentsPlace", МестоРасчетов);		
		КонецЕсли;   
		//-Белов А. 28.08.2025 #
		
	КонецЕсли; 
		
	//данные о кассире
	СтруктураОператор = Новый Структура();
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") И ЗначениеЗаполнено(ДополнительныеПараметры.ИДПлатежа) Тогда
		
		Если Коррекция Тогда
			
			СтруктураОператор.Вставить("name", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.ИНН);
			КонецЕсли; 
			
		Иначе
			СтруктураОператор.Вставить("name", "Администратор");
		КонецЕсли;      
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда  	
		СтруктураОператор.Вставить("name", "Администратор");                                         	
	Иначе
		
		Если Коррекция Тогда
			
			СтруктураОператор.Вставить("name", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.ИНН);
			КонецЕсли;  
			
		Иначе  
			
			СтруктураОператор.Вставить("name", ДополнительныеПараметры.Ответственный.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН);
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураЧека.Вставить("operator", СтруктураОператор); 
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641		
		СтруктураЧека.Вставить("clientInfo", ПолучитьДанныеОПокупателе(ДополнительныеПараметры, Электронный)); 		
	КонецЕсли; 
	
	//+Белов А. 17.03.2026 #UT10-5758
	МаркировкаПоНоменклатуре = ПолучитьМаркировкуПоДокументу(ДополнительныеПараметры, Истина, СтруктураЧека);
	ЕстьКодыМаркировки = МаркировкаПоНоменклатуре.Количество() > 0; 
	//-Белов А. 17.03.2026 #UT10-5758
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641  		
		СтруктураЧека.Вставить("items", ПолучитьМассивПозиций(ДополнительныеПараметры, МаркировкаПоНоменклатуре));		
	Иначе
		СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ДополнительныеПараметры.СуммаДокумента, Истина, Истина, 20);
		
		Налоги = Новый Массив;
		
		СтруктураНДС = Новый Структура();
		СтруктураНДС.Вставить("type", "vat22");
		СтруктураНДС.Вставить("sum", СуммаНДС); 
		
		Налоги.Добавить(СтруктураНДС);
		
		СтруктураЧека.Вставить("taxes", Налоги);  		
		
	КонецЕсли;
	
	СтруктураЧека.Вставить("payments", ПолучитьМассивОплат(ДополнительныеПараметры));
	
	//+Белов А. 05.08.2025 #
	Если ИспользоватьНовыеРеквизитыВЧеках() Тогда
		ДополнитьСтруктуруЧекаНовымиРеквизитами(СтруктураЧека, ДополнительныеПараметры, Электронный, МестоРасчетов);	
	КонецЕсли;
	//-Белов А. 05.08.2025 #
	
	//+Белов А. 02.02.2026 #UT10-5641	
	Если ПробиватьВЧекахКодыМаркировки() И ЕстьКодыМаркировки Тогда
		
		СтруктураЧека.Вставить("validateMarkingCodes", Истина);
		
		УведомленияПродажи = Новый Структура();
		УведомленияПродажи.Вставить("timeZone", ПолучитьТаймЗону());
		
		СтруктураЧека.Вставить("salesNotice", УведомленияПродажи);
		
	КонецЕсли;
	//-Белов А. 02.02.2026 #UT10-5641
	
	СтруктураJSON.Вставить("request", СтруктураЧека);
	
	Возврат СтруктураJSON;
	
КонецФункции

Функция СформироватьСтруктуруДляФискальногоЧека(уникИД, Касса, ДополнительныеПараметры, Электронный, МестоРасчетов, Коррекция)
		
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	СтруктураJSON = Новый Структура();
	СтруктураJSON.Вставить("uuid", уникИД);
	МассивПараметров = Новый Массив();
	СтруктураЧека = Новый Структура();
	
	//+Белов А. 02.02.2026 #UT10-5641
	ВыводитьЧекСТоварамиИДругимиРеквизитами = ВыводитьЧекСТоварамиИДругимиРеквизитами(Коррекция);
	//-Белов А. 02.02.2026 #UT10-5641
	
	//Тип задания
	//sell - чек прихода buy - чек расхода sellReturn - чек возврата прихода buyReturn - чек возврата расхода 	
	Если Коррекция Тогда  
		
		type = "sellCorrection"; 
		
		СтруктураЧека.Вставить("correctionType", "self");
        СтруктураЧека.Вставить("correctionBaseDate", Формат(ДополнительныеПараметры.Дата, "ДФ=гггг.ММ.дд"));  
		СтруктураЧека.Вставить("correctionBaseNumber", ДополнительныеПараметры.Номер);
		
	Иначе     
		type = "sell"; 
	КонецЕсли;
	
	СтруктураЧека.Вставить("type", type);
	//Электронный чек
	СтруктураЧека.Вставить("electronically", Электронный); 
		
	//taxationType Система налогообложения
	taxationType = "osn";
	Если Не ПустаяСтрока(taxationType) Тогда
		СтруктураЧека.Вставить("taxationType", taxationType);
	КонецЕсли;  
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641
				
		//useVAT18 использовать при регистрации чека ставку налога 18%
		СтруктураЧека.Вставить("useVAT18", Ложь);    
		
		Если ЗначениеЗаполнено(МестоРасчетов) Тогда
			СтруктураЧека.Вставить("paymentsPlace", МестоРасчетов);		
		КонецЕсли;   
		
	КонецЕсли;
	
	//данные о кассире
	СтруктураОператор = Новый Структура(); 
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") И ЗначениеЗаполнено(ДополнительныеПараметры.ИДПлатежа) Тогда
		
		Если Коррекция Тогда
			
			СтруктураОператор.Вставить("name", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.ИНН);
			КонецЕсли; 
			
		Иначе
			СтруктураОператор.Вставить("name", "Администратор");
		КонецЕсли;  
		
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СтруктураОператор.Вставить("name", "Администратор");       
		
	Иначе     
		
		Если Коррекция Тогда
			
			СтруктураОператор.Вставить("name", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ПараметрыСеанса.ТекущийПользователь.ФизЛицо.ИНН);
			КонецЕсли; 
			
		Иначе  
			
			СтруктураОператор.Вставить("name", ДополнительныеПараметры.Ответственный.ФизЛицо.Наименование);
			Если ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН <> "" Тогда
				СтруктураОператор.Вставить("vatin", ДополнительныеПараметры.Ответственный.ФизЛицо.ИНН);
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЕсли;

	СтруктураЧека.Вставить("operator", СтруктураОператор);  
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641		
		СтруктураЧека.Вставить("clientInfo", ПолучитьДанныеОПокупателе(ДополнительныеПараметры, Электронный));   		
	КонецЕсли;    
	
	//+Белов А. 17.03.2026 #UT10-5758
	МаркировкаПоНоменклатуре = ПолучитьМаркировкуПоДокументу(ДополнительныеПараметры, Ложь, СтруктураЧека);
	ЕстьКодыМаркировки = МаркировкаПоНоменклатуре.Количество() > 0; 
	//-Белов А. 17.03.2026 #UT10-5758
	
	//+Белов А. 03.02.2026 #UT10-5641
	//Если Не Коррекция Тогда          
	Если ВыводитьЧекСТоварамиИДругимиРеквизитами Тогда
	//-Белов А. 03.02.2026 #UT10-5641 
		СтруктураЧека.Вставить("items", ПолучитьМассивПозиций(ДополнительныеПараметры, МаркировкаПоНоменклатуре));		
	Иначе
		
		СуммаНДС = УчетНДС.РассчитатьСуммуНДС(ДополнительныеПараметры.СуммаДокумента, Истина, Истина, 20);
		
		Налоги = Новый Массив;
		
		СтруктураНДС = Новый Структура();
		СтруктураНДС.Вставить("type", "vat22");
		СтруктураНДС.Вставить("sum", СуммаНДС); 
		
		Налоги.Добавить(СтруктураНДС);  
		СтруктураЧека.Вставить("taxes", Налоги);	
		
	КонецЕсли;
		
	СтруктураЧека.Вставить("payments", ПолучитьМассивОплат(ДополнительныеПараметры));
	
	//+Белов А. 05.08.2025 #
	Если ИспользоватьНовыеРеквизитыВЧеках() Тогда
		ДополнитьСтруктуруЧекаНовымиРеквизитами(СтруктураЧека, ДополнительныеПараметры, Электронный, МестоРасчетов);	
	КонецЕсли;
	//-Белов А. 05.08.2025 #   
	
	//+Белов А. 02.02.2026 #UT10-5641	
	Если ПробиватьВЧекахКодыМаркировки() И ЕстьКодыМаркировки Тогда
		
		СтруктураЧека.Вставить("validateMarkingCodes", Истина);
		
		УведомленияПродажи = Новый Структура();
		УведомленияПродажи.Вставить("timeZone", ПолучитьТаймЗону());
		
		СтруктураЧека.Вставить("salesNotice", УведомленияПродажи);
		
	КонецЕсли;
	//-Белов А. 02.02.2026 #UT10-5641
		
	СтруктураJSON.Вставить("request", СтруктураЧека);
	
	Возврат СтруктураJSON;
	
КонецФункции 

Функция ПолучитьМассивПозиций(ДополнительныеПараметры, МаркировкаПоНоменклатуре)
	
	//данные о товарах массив items
	МассивПозиций = Новый Массив();
	
	//+Белов А. 02.02.2026 #UT10-5641
	Если ПробиватьВЧекахКодыМаркировки() И МаркировкаПоНоменклатуре.Количество() > 0 Тогда
			
		Для Каждого Стр Из ДополнительныеПараметры.ПозицииЧекККМ Цикл
			
			Если Стр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс Тогда
				
				СтруктураПозиции = Новый Структура();
				СтруктураПозиции.Вставить("type", "position");
				СтруктураПозиции.Вставить("name", "Аванс");
				СтруктураПозиции.Вставить("paymentMethod", "advance");
				СтруктураПозиции.Вставить("paymentObject", "payment");
				СтруктураПозиции.Вставить("price", Стр.Цена);
				СтруктураПозиции.Вставить("quantity", Стр.Количество);
				СтруктураПозиции.Вставить("amount", Стр.Сумма);
				СтруктураПозиции.Вставить("tax", ПолучитьСтруктуруСтавкиНДС(Стр));
				
				МассивПозиций.Добавить(СтруктураПозиции);
				
			ИначеЕсли Стр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар Тогда

				КоличествоТовара = Стр.Количество;
			
				МассивСтруктурМаркировки = МаркировкаПоНоменклатуре.Получить(Стр.Позиция);
				Если МассивСтруктурМаркировки = Неопределено Тогда
					МассивСтруктурМаркировки = Новый Массив;
				КонецЕсли;
				
				Для Каждого ПозицияМаркировки Из МассивСтруктурМаркировки Цикл
					
					Если КоличествоТовара = 0 Тогда
						Продолжить;
					КонецЕсли;     
					
					Если ПозицияМаркировки.Использован Тогда
						Продолжить;
					КонецЕсли;
					
					СтруктураПозиции = Новый Структура();
					СтруктураПозиции.Вставить("type", "position");
					СтруктураПозиции.Вставить("name", Стр.Позиция.Наименование);
					СтруктураПозиции.Вставить("paymentMethod", "fullPayment");
					СтруктураПозиции.Вставить("paymentObject", "commodityWithMarking");
					СтруктураПозиции.Вставить("price", Стр.Цена);
					СтруктураПозиции.Вставить("quantity", 1);
					СтруктураПозиции.Вставить("amount", Стр.Цена);
					СтруктураПозиции.Вставить("tax", ПолучитьСтруктуруСтавкиНДС(Стр));
					СтруктураПозиции.Вставить("imcParams", ПозицияМаркировки.Маркировка);
					
					//+Сёмин Р.И. 09.09.2026 #UT10-6020
					Если ПозицияМаркировки.Свойство("ПроверкаПИоТ") Тогда
						
						industryAttribute = "UUID=" + ПозицияМаркировки.ПроверкаПИоТ.reqId + "&Time=" + XMLСтрока(ПозицияМаркировки.ПроверкаПИоТ.reqTimestamp);
						
						Если ПозицияМаркировки.ПроверкаПИоТ.isCheckedOffline Тогда
							industryAttribute = industryAttribute + "&Inst=" + СокрЛ(ПозицияМаркировки.ПроверкаПИоТ.inst) + "&Ver=" + СокрЛП(ПозицияМаркировки.ПроверкаПИоТ.version);
						КонецЕсли;
						
						industryInfo = Новый Структура;
						industryInfo.Вставить("industryAttribute", industryAttribute);
						
						
						industryInfo.Вставить("date", Формат(ПозицияМаркировки.ПроверкаПИоТ.ДатаДокумента, "ДФ=гггг.ММ.дд"));
						industryInfo.Вставить("number", ПозицияМаркировки.ПроверкаПИоТ.НомерДокумента);
						industryInfo.Вставить("fois", "030"); //Министерство промышленности и торговли Российской Федерации
						
						industryInfoМассив = Новый Массив;
						industryInfoМассив.Добавить(industryInfo);
						
						СтруктураПозиции.Вставить("industryInfo", industryInfoМассив);
						
					КонецЕсли;
					//-Сёмин Р.И. 09.09.2026 #UT10-6020
					
					МассивПозиций.Добавить(СтруктураПозиции);               
					
					ПозицияМаркировки.Использован = Истина;
					
					КоличествоТовара = КоличествоТовара - 1;
					
				КонецЦикла;
				
				Если КоличествоТовара > 0 Тогда
					
					СтруктураПозиции = Новый Структура();
					СтруктураПозиции.Вставить("type", "position");
					СтруктураПозиции.Вставить("name", Стр.Позиция.Наименование);
					СтруктураПозиции.Вставить("paymentMethod", "fullPayment");
					СтруктураПозиции.Вставить("paymentObject", "commodity");
					СтруктураПозиции.Вставить("price", Стр.Цена);
					СтруктураПозиции.Вставить("quantity", КоличествоТовара);
					СтруктураПозиции.Вставить("amount", Стр.Цена * КоличествоТовара);
					СтруктураПозиции.Вставить("tax", ПолучитьСтруктуруСтавкиНДС(Стр));
					
					МассивПозиций.Добавить(СтруктураПозиции);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		//-Белов А. 02.02.2026 #UT10-5641
		
		Для Каждого Стр Из ДополнительныеПараметры.ПозицииЧекККМ Цикл
			
			СтруктураПозиции = Новый Структура();
			
			СтруктураПозиции.Вставить("type", "position");
			
			Если Стр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс Тогда
				
				СтруктураПозиции.Вставить("name", "Аванс");
				СтруктураПозиции.Вставить("paymentMethod", "advance");
				СтруктураПозиции.Вставить("paymentObject", "payment");
				
			ИначеЕсли Стр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар Тогда
				
				СтруктураПозиции.Вставить("name", Стр.Позиция.Наименование);
				СтруктураПозиции.Вставить("paymentMethod", "fullPayment");
				СтруктураПозиции.Вставить("paymentObject", "commodity");
				
			КонецЕсли;
			
			СтруктураПозиции.Вставить("price", Стр.Цена);
			СтруктураПозиции.Вставить("quantity", Стр.Количество);
			СтруктураПозиции.Вставить("amount", Стр.Сумма);
			СтруктураПозиции.Вставить("tax", ПолучитьСтруктуруСтавкиНДС(Стр));
			
			МассивПозиций.Добавить(СтруктураПозиции);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивПозиций;
	
КонецФункции

Функция ПолучитьСтруктуруСтавкиНДС(Стр)
	
	СтруктураНДС = Новый Структура();
	Если Стр.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		СтруктураНДС.Вставить("type", "none");
	ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		СтруктураНДС.Вставить("type", "vat20");
	ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда	
		СтруктураНДС.Вставить("type", "vat120");
		//+Гавриленков В. 05.12.2025 #UT10-5574
	ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда
		СтруктураНДС.Вставить("type", "vat22");
	ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда	
		СтруктураНДС.Вставить("type", "vat122");
		//-Гавриленков В. 05.12.2025 #UT10-5574
	ИначеЕсли Стр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		СтруктураНДС.Вставить("type", "vat18");
	Иначе
		СтруктураНДС.Вставить("type", "none");
	КонецЕсли; 
	
	Возврат СтруктураНДС;
	
КонецФункции

Функция ПолучитьТаймЗону() Экспорт
	
	СоответствиеЗоныКоду = Новый Соответствие;
	СоответствиеЗоныКоду.Вставить("+2", 1);
	СоответствиеЗоныКоду.Вставить("+3", 2);
	СоответствиеЗоныКоду.Вставить("+4", 3);
	СоответствиеЗоныКоду.Вставить("+5", 4);
	СоответствиеЗоныКоду.Вставить("+6", 5);
	СоответствиеЗоныКоду.Вставить("+7", 6);
	СоответствиеЗоныКоду.Вставить("+8", 7);
	СоответствиеЗоныКоду.Вставить("+9", 8);
	СоответствиеЗоныКоду.Вставить("+10", 9);
	СоответствиеЗоныКоду.Вставить("+11", 10);
	СоответствиеЗоныКоду.Вставить("+12", 11);
		
	ЧасовойПоясПредсталение = "+3";
	
	ЧасовойПоясФилиала = Константы.ЧасовойПоясФилиала.Получить();
	
	Если ЗначениеЗаполнено(ЧасовойПоясФилиала) Тогда
		ЧасовойПоясПредсталение = Строка(ЧасовойПоясФилиала);	
	КонецЕсли;
		
	Возврат СоответствиеЗоныКоду.Получить(ЧасовойПоясПредсталение);
	
КонецФункции

Функция ПолучитьМассивОплат(ДополнительныеПараметры) 
	
	//формирование стуктуры оплат
	МассивОплат = Новый Массив();
	
	Для каждого Стр ИЗ ДополнительныеПараметры.ОплатыЧекККМ Цикл
		
		СтруктураОплаты = Новый Структура();
		
		Если Стр.Тип = Перечисления.ТипыОплатЧекККМ.Наличные Тогда
			СтруктураОплаты.Вставить("type", "cash");
		ИначеЕсли Стр.Тип = Перечисления.ТипыОплатЧекККМ.Безналичные Тогда
			СтруктураОплаты.Вставить("type", "electronically");
		ИначеЕсли Стр.Тип = Перечисления.ТипыОплатЧекККМ.Предоплата Тогда
			СтруктураОплаты.Вставить("type", "prepaid");
		КонецЕсли;
		
		СтруктураОплаты.Вставить("sum", Стр.Сумма);
		
		МассивОплат.Добавить(СтруктураОплаты);
		
	КонецЦикла;
	
	Возврат МассивОплат;
		
КонецФункции

Функция ПолучитьДанныеОПокупателе(ДополнительныеПараметры, Электронный)
	
	//данные о покупателе
	
	СтруктураПокупатель = Новый Структура();
	
	АдресEmail = ПолучитьEmail(ДополнительныеПараметры.Контрагент);
	Если Не ЗначениеЗаполнено(АдресEmail) И Электронный Тогда
		АдресEmail = Константы.РезервныйEmailДляОтправкиЭлектронныхЧеков.Получить();		
	КонецЕсли;
	
	Если АдресEmail <> "" Тогда
		СтруктураПокупатель.Вставить("emailOrPhone", АдресEmail);
	КонецЕсли;   
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		ЗаполняемСтруктуруПокупателя = ДополнительныеПараметры.РасшифровкаПлатежа[0].ДоговорКонтрагента.БизнесКарта;
	Иначе
		ЗаполняемСтруктуруПокупателя = НЕ (ДополнительныеПараметры.ДоговорКонтрагента.РозничнаяПродажа ИЛИ ДополнительныеПараметры.ДоговорКонтрагента.ЛицевойСчет);
	КонецЕсли;  	
	
	Если ЗаполняемСтруктуруПокупателя Тогда
		
		Если ДополнительныеПараметры.Контрагент.ИНН <> "" Тогда 
			
			СтруктураПокупатель.Вставить("name", СокрЛП(?(ЗначениеЗаполнено(ДополнительныеПараметры.Контрагент.НаименованиеПолное),ДополнительныеПараметры.Контрагент.НаименованиеПолное,ДополнительныеПараметры.Контрагент.Наименование)));
			СтруктураПокупатель.Вставить("vatin", ДополнительныеПараметры.Контрагент.ИНН);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат СтруктураПокупатель;
		
КонецФункции

Процедура ДополнитьСтруктуруЧекаНовымиРеквизитами(СтруктураЧека, ДополнительныеПараметры, Электронный, МестоРасчетов)
	
	//+Белов А. 04.08.2025 #
	ЭтоИнтернетЧек = МестоРасчетов = Константы.АдресПортала.Получить();	
	
	Если Электронный Тогда
		
		//Способы оплаты
		//1 — банковская карта;
		//2 — мобильное приложение (например, Apple Pay, Google Pay);
		//3 — электронное средство платежа (например, Яндекс.Деньги, WebMoney);
		//4 — безналичный перевод (включая СБП — Систему быстрых платежей);
		//5 — иная форма безналичной оплаты. 					
		СпособОплаты = 1;		
		ИдентификаторПлатежа = "1";
		
		Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
			
			ИдентификаторПлатежа = ДополнительныеПараметры.RRNКодОперации;
			
			Если ДополнительныеПараметры.RRNКодОперации = "111111111111" И ЗначениеЗаполнено(ДополнительныеПараметры.ТекстСлипЧека) Тогда 
				
				ИдентификаторПлатежа = ПолучитьSBPRRNИзСлипЧека(ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ДополнительныеПараметры.ТекстСлипЧека, Символы.ПС));
				СпособОплаты = 1; 
				
			ИначеЕсли Не ЗначениеЗаполнено(ИдентификаторПлатежа) Тогда
				
				ИдентификаторПлатежа = ДополнительныеПараметры.ИДПлатежа;
				
				Если Найти(ДополнительныеПараметры.ДанныеПоОплате, "Card") = 0 Тогда
					СпособОплаты = 1;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
		//формирование стуктуры безналичных оплат
		МассивБезналичныхОплат = Новый Массив();
		
		Для каждого Стр ИЗ ДополнительныеПараметры.ОплатыЧекККМ Цикл
			
			Если Стр.Тип = Перечисления.ТипыОплатЧекККМ.Безналичные Тогда	
				МассивБезналичныхОплат.Добавить(Новый Структура("sum, paymentMethod, electronicallyId", Стр.Сумма, СпособОплаты, ИдентификаторПлатежа));					
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивБезналичныхОплат.Количество() > 0 Тогда
			СтруктураЧека.Вставить("paymentsAddInfo", МассивБезналичныхОплат);	
		КонецЕсли;		
		
		СтруктураЧека.Вставить("internet", ЭтоИнтернетЧек);		
		
	КонецЕсли;
	
	//-Белов А. 04.08.2025 # 

КонецПроцедуры

Функция ПолучитьEmail(Контрагент) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Объект КАК Объект,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Представление КАК Представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Ссылка
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Ссылка", Контрагент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОтправкиЧеков);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат СокрЛП(ВыборкаДетальныеЗаписи.Представление); 

	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат "";
	
КонецФункции
 
Функция ПолучитьСтатусЗаданияПечатиПКО(ПКО, ДополнятьСтатус = Ложь, МассивСсылок = Неопределено) Экспорт
//+Гавриленков В. 31.05.2025 #UT10-5251 Добавлен параметр МассивСсылок
	
	УстановитьПривилегированныйРежим(Истина);   
	
	Если МассивСсылок = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗаданияНаПробитиеЧекаСрезПоследних.Статус,
		|	ЗаданияНаПробитиеЧекаСрезПоследних.ТекстОшибки
		|ИЗ
		|	РегистрСведений.ЗаданияНаПробитиеЧека.СрезПоследних(, ПКО = &ПКО) КАК ЗаданияНаПробитиеЧекаСрезПоследних";
		
		Запрос.УстановитьПараметр("ПКО", ПКО);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			УстановитьПривилегированныйРежим(Ложь);
			Возврат Выборка.Статус + ?(ДополнятьСтатус И ЗначениеЗаполнено(Выборка.ТекстОшибки), " (" + Выборка.ТекстОшибки + ")", "");  
			
		КонецЕсли;  
		
	//+Гавриленков В. 11.06.2025 #UT10-5251	
	Иначе
		
		Соответствие = Новый Соответствие;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаданияНаПробитиеЧекаСрезПоследних.Статус,
		               |	ЗаданияНаПробитиеЧекаСрезПоследних.ТекстОшибки,
		               |	ЗаданияНаПробитиеЧекаСрезПоследних.ПКО
		               |ИЗ
		               |	РегистрСведений.ЗаданияНаПробитиеЧека.СрезПоследних(, ПКО В (&МассивСсылок)) КАК ЗаданияНаПробитиеЧекаСрезПоследних";
		
		Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);  
		
		Таб = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Реализация Из МассивСсылок Цикл  
			
			НайденнаяСтрока = Таб.Найти(Реализация, "ПКО");
			Соответствие.Вставить(Реализация, ?(НайденнаяСтрока = Неопределено , "", НайденнаяСтрока.Статус + ?(ДополнятьСтатус И ЗначениеЗаполнено(НайденнаяСтрока.ТекстОшибки), " (" + НайденнаяСтрока.ТекстОшибки + ")", "")));
			
		КонецЦикла;   
		
		Возврат Соответствие;
		
	КонецЕсли; 
	//-Гавриленков В. 11.06.2025 #UT10-5251
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат "";	
	
КонецФункции

Процедура ЗаполнитьСоставЧекаККМДляПКО(ПКООбъект) Экспорт
	
	ПКООбъект.ПозицииЧекККМ.Очистить();
	ПКООбъект.ОплатыЧекККМ.Очистить();  
	
	//Если лицевой счет, то печатаем всю сумму на аванс
	Если ПлатежныйДокументЛицевойСчет(ПКООбъект) Тогда
		
		СуммаДокумента = ПКООбъект.СуммаДокумента;
		
		НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
		НСтр.Количество = 1;
		НСтр.Цена = СуммаДокумента;
		НСтр.Сумма = СуммаДокумента; 
		//+Гавриленков В. 05.12.2025 #UT10-5574
		//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		//-Гавриленков В. 05.12.2025 #UT10-5574
		
		НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Наличные;
		НСтр.Сумма = СуммаДокумента;
		
		Возврат;	                         
		
	КонецЕсли;
	
	СписокРеализаций = Новый СписокЗначений;
	
	Для каждого Стр ИЗ ПКООбъект.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СписокРеализаций.Добавить(Стр.ДокументРасчетовСКонтрагентом);	
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокРеализаций", СписокРеализаций);
	
	Если ПКООбъект.Проведен Тогда
		
		МоментСразуПередДокументом = Новый Граница(ПКООбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
		Запрос.УстановитьПараметр("Дата", МоментСразуПередДокументом);
		
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток) КАК Остаток,
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Ссылка КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&Дата, ДокументРасчетовСКонтрагентом В (&СписокРеализаций)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.СуммаВзаиморасчетовРасход) КАК Оплата,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Оплаты
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, &Дата, Регистратор, ДокументРасчетовСКонтрагентом В (&СписокРеализаций)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
	               |ГДЕ
	               |	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.Предоплата) КАК Предоплата,
	               |	ВложенныйЗапрос.Реализация КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Предоплаты
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.СуммаВзаиморасчетов) КАК Предоплата,
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка КАК Реализация
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.ДокументыРасчетовСКонтрагентом КАК РеализацияТоваровУслугДокументыРасчетовСКонтрагентом
	               |	ГДЕ
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка В(&СписокРеализаций)
	               |		И РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка.Проведен
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СУММА(ВТ_Оплаты.Оплата),
	               |		ВТ_Оплаты.Реализация
	               |	ИЗ
	               |		ВТ_Оплаты КАК ВТ_Оплаты
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_Оплаты.Реализация
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.СуммаВзаиморасчетов,
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом
	               |	ИЗ
	               |		Документ.КорректировкаРеализации.ДокументыРасчетовСКонтрагентом КАК КорректировкаРеализацииДокументыРасчетовСКонтрагентом
	               |	ГДЕ
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом В(&СписокРеализаций)
	               |		И КорректировкаРеализацииДокументыРасчетовСКонтрагентом.Ссылка.Проведен
	               |		И КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом <> КорректировкаРеализацииДокументыРасчетовСКонтрагентом.Ссылка.ДокументРеализации) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Реализация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Остатки.Реализация,
	               |	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТ_Предоплаты.Предоплата, 0) КАК Предоплата
	               |ИЗ
	               |	ВТ_Остатки КАК ВТ_Остатки
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Предоплаты КАК ВТ_Предоплаты
	               |		ПО ВТ_Остатки.Реализация = ВТ_Предоплаты.Реализация";
		
	ТаблицаПредоплат = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	ПродажиОбороты.ДокументПродажи
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(, &Дата, , ДокументПродажи В (&СписокРеализаций)) КАК ПродажиОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Номенклатура,
	               |	ПродажиОбороты.ДокументПродажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура,
	               |	ВТ_Товары.Количество,
	               |	ВТ_Товары.ДокументПродажи,
	               |	ВТ_Товары.Сумма,
	               |	ВТ_Товары.Сумма / ВТ_Товары.Количество КАК Цена
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары";
	
	ТаблицаТоваровПоРеализациям = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр ИЗ ПКООбъект.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			СтрПоиска = ТаблицаПредоплат.Найти(Стр.ДокументРасчетовСКонтрагентом, "Реализация");	
			
			Если СтрПоиска <> Неопределено Тогда
				
				//Если в ПКО погасили только часть остатка реализации, то это аванс
				Если СтрПоиска.Остаток <> Стр.СуммаВзаиморасчетов Тогда
					
					НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
					НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
					НСтр.Количество = 1;
					НСтр.Цена = Стр.СуммаВзаиморасчетов;
					НСтр.Сумма = Стр.СуммаВзаиморасчетов;
					//+Гавриленков В. 05.12.2025 #UT10-5574
					//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
					НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
					//-Гавриленков В. 05.12.2025 #UT10-5574
					
					//В ином случае получаем список товаров с учетом корректировок 
					//и добавляем предоплату если она есть чтобы закрыть сумму по товарам
				Иначе
					
					СтрокиПоиска = ТаблицаТоваровПоРеализациям.НайтиСтроки(Новый Структура("ДокументПродажи", Стр.ДокументРасчетовСКонтрагентом));
					
					ОстатокДляСписанияПоРеализации = СтрПоиска.Остаток;
					
					Для каждого СтрТовара ИЗ СтрокиПоиска Цикл
						
						//Данное условие введено для исключительных ситуаций у которых в релизации несколько
						//одинаковых товаров с разными ценами
						КоличествоРазрядов = СтрДлина(СтрТовара.Цена) - СтрДлина(Цел(СтрТовара.Цена)) - 1;
						
						Если КоличествоРазрядов > 2 Тогда
							
							ТаблицаТоваровПоиска = Стр.ДокументРасчетовСКонтрагентом.Товары.Выгрузить(Новый Структура("Номенклатура", СтрТовара.Номенклатура));
							
							Если ТаблицаТоваровПоиска.Итог("Сумма") = СтрТовара.Сумма Тогда
								
								Для каждого СтрТ Из ТаблицаТоваровПоиска Цикл
									
									НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
									НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
									НСтр.Позиция = СтрТ.Номенклатура;
									НСтр.Количество = СтрТ.Количество;
									НСтр.Цена = СтрТ.Цена;
									НСтр.Сумма = СтрТ.Сумма;
									НСтр.СтавкаНДС = Стр.СтавкаНДС; 
									
								КонецЦикла; 
								
							Иначе
								
								НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
								НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
								НСтр.Позиция = СтрТовара.Номенклатура;
								НСтр.Количество = СтрТовара.Количество;
								НСтр.Цена = СтрТовара.Цена;
								НСтр.Сумма = СтрТовара.Сумма;
								НСтр.СтавкаНДС = Стр.СтавкаНДС;
								
							КонецЕсли; 
							
						Иначе
							
							НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
							НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
							НСтр.Позиция = СтрТовара.Номенклатура;
							НСтр.Количество = СтрТовара.Количество;
							НСтр.Цена = СтрТовара.Цена;
							НСтр.Сумма = СтрТовара.Сумма;
							НСтр.СтавкаНДС = Стр.СтавкаНДС;
							
						КонецЕсли;
						
						ОстатокДляСписанияПоРеализации = ОстатокДляСписанияПоРеализации - СтрТовара.Сумма;
						
					КонецЦикла;
					
					//Бывает по реализации оформлена корректировка, но взаиморасчет списывается по другим реализацям
					//в этом случает будет висеть пустой взаиморасчет без товаров. Это будет аванс
					//возможно здесь стоит выводить не просто аванс, а товары погашенных реализаций (в случае если они полностью погашены)
					Если ОстатокДляСписанияПоРеализации > 0 Тогда
						
						НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
						НСтр.Количество = 1;
						НСтр.Цена = ОстатокДляСписанияПоРеализации;
						НСтр.Сумма = ОстатокДляСписанияПоРеализации;
						//+Гавриленков В. 05.12.2025 #UT10-5574
						//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
						НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
						//-Гавриленков В. 05.12.2025 #UT10-5574
						
						ОстатокДляСписанияПоРеализации = 0;
						
						//В этом случае обнуляем предоплату, так как она не нужна чтобы покрыть 
						//стоимость всех товары, так как корректировка была не большую сумму
						СтрПоиска.Предоплата = 0;
						
					ИначеЕсли ОстатокДляСписанияПоРеализации = 0 Тогда
						
						СтрПоиска.Предоплата = 0;
						
					ИначеЕсли ОстатокДляСписанияПоРеализации < 0 Тогда
						
						СтрПоиска.Предоплата = ОстатокДляСписанияПоРеализации * -1;
						
					КонецЕсли;
					
					Если СтрПоиска.Предоплата > 0 Тогда
						
						НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Предоплата;
						НСтр.Сумма = СтрПоиска.Предоплата;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Если документом расчета не является реализация, то это аванс
		Иначе
			
			НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
			НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
			НСтр.Количество = 1;
			НСтр.Цена = Стр.СуммаВзаиморасчетов;
			НСтр.Сумма = Стр.СуммаВзаиморасчетов; 
			//+Гавриленков В. 05.12.2025 #UT10-5574
			//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
			НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
			//-Гавриленков В. 05.12.2025 #UT10-5574
			
		КонецЕсли;
		
		НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Наличные;
		НСтр.Сумма = Стр.СуммаВзаиморасчетов;
		
	КонецЦикла;
	
	ПКООбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	ПКООбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаККМДляРКО(РКООбъект) Экспорт
	
	РКООбъект.ПозицииЧекККМ.Очистить();
	РКООбъект.ОплатыЧекККМ.Очистить();	
	
	Для каждого Стр ИЗ РКООбъект.РасшифровкаПлатежа Цикл
		
		Если ЗначениеЗаполнено(Стр.ДокументРасчетовСКонтрагентом) Тогда
			
			Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				ОткорректированныеТовары = ПолучитьОткорректированныеТоварыПоРелизации(Стр.ДокументРасчетовСКонтрагентом);
				СуммаОткорректированных = ОткорректированныеТовары.Итог("Сумма");
				
				Если СуммаОткорректированных = Стр.СуммаВзаиморасчетов Тогда
					
					Для каждого СтрКор ИЗ ОткорректированныеТовары Цикл
						
						НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
						ЗаполнитьЗначенияСвойств(НСтр, СтрКор);
						
					КонецЦикла;
					
				Иначе
					
					НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
					НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
					НСтр.Количество = 1;
					НСтр.Цена = Стр.СуммаВзаиморасчетов;
					НСтр.Сумма = Стр.СуммаВзаиморасчетов; 
					//+Гавриленков В. 05.12.2025 #UT10-5574
					//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					НСтр.СтавкаНДС = ?(РКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
					//-Гавриленков В. 05.12.2025 #UT10-5574
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") ИЛИ ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
				
				НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
				НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
				НСтр.Количество = 1;
				НСтр.Цена = Стр.СуммаВзаиморасчетов;
				НСтр.Сумма = Стр.СуммаВзаиморасчетов;
				//+Гавриленков В. 05.12.2025 #UT10-5574
				//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
				НСтр.СтавкаНДС = ?(РКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
				//-Гавриленков В. 05.12.2025 #UT10-5574
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НСтр = РКООбъект.ОплатыЧекККМ.Добавить();
	НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Наличные;
	НСтр.Сумма = РКООбъект.СуммаДокумента;
			
	РКООбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	РКООбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаККМДляОПК_Оплата(ПКООбъект) Экспорт
	
	ПКООбъект.ПозицииЧекККМ.Очистить();
	ПКООбъект.ОплатыЧекККМ.Очистить();  
	
	//Если лицевой счет, то печатаем всю сумму на аванс
	Если ПлатежныйДокументЛицевойСчет(ПКООбъект) Тогда
		
		СуммаДокумента = ПКООбъект.СуммаДокумента;
		
		НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
		НСтр.Количество = 1;
		НСтр.Цена = СуммаДокумента;
		НСтр.Сумма = СуммаДокумента; 
		//+Гавриленков В. 05.12.2025 #UT10-5574
		//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
		НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		//-Гавриленков В. 05.12.2025 #UT10-5574
		
		НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Безналичные;
		НСтр.Сумма = СуммаДокумента;
		
		Возврат;	                         
		
	КонецЕсли;
	
	СписокРеализаций = Новый СписокЗначений;
	
	Для каждого Стр ИЗ ПКООбъект.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			СписокРеализаций.Добавить(Стр.ДокументРасчетовСКонтрагентом);	
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокРеализаций", СписокРеализаций);
	
	Если ПКООбъект.Проведен Тогда
		
		МоментСразуПередДокументом = Новый Граница(ПКООбъект.Ссылка.МоментВремени(), ВидГраницы.Исключая);
		Запрос.УстановитьПараметр("Дата", МоментСразуПередДокументом); 
		
	Иначе
		Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	КонецЕсли;
	
		Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток) КАК Остаток,
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Ссылка КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Остатки
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(&Дата, ДокументРасчетовСКонтрагентом В (&СписокРеализаций)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.СуммаВзаиморасчетовРасход) КАК Оплата,
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Оплаты
	               |ИЗ
	               |	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, &Дата, Регистратор, ДокументРасчетовСКонтрагентом В (&СписокРеализаций)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
	               |ГДЕ
	               |	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	               |			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПлатежноеПоручениеВходящее)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.Предоплата) КАК Предоплата,
	               |	ВложенныйЗапрос.Реализация КАК Реализация
	               |ПОМЕСТИТЬ ВТ_Предоплаты
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.СуммаВзаиморасчетов) КАК Предоплата,
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка КАК Реализация
	               |	ИЗ
	               |		Документ.РеализацияТоваровУслуг.ДокументыРасчетовСКонтрагентом КАК РеализацияТоваровУслугДокументыРасчетовСКонтрагентом
	               |	ГДЕ
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка В(&СписокРеализаций)
	               |		И РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка.Проведен
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СУММА(ВТ_Оплаты.Оплата),
	               |		ВТ_Оплаты.Реализация
	               |	ИЗ
	               |		ВТ_Оплаты КАК ВТ_Оплаты
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_Оплаты.Реализация
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.СуммаВзаиморасчетов,
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом
	               |	ИЗ
	               |		Документ.КорректировкаРеализации.ДокументыРасчетовСКонтрагентом КАК КорректировкаРеализацииДокументыРасчетовСКонтрагентом
	               |	ГДЕ
	               |		КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом В(&СписокРеализаций)
	               |		И КорректировкаРеализацииДокументыРасчетовСКонтрагентом.Ссылка.Проведен
	               |		И КорректировкаРеализацииДокументыРасчетовСКонтрагентом.ДокументРасчетовСКонтрагентом <> КорректировкаРеализацииДокументыРасчетовСКонтрагентом.Ссылка.ДокументРеализации) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Реализация
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Остатки.Реализация,
	               |	ЕСТЬNULL(ВТ_Остатки.Остаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ВТ_Предоплаты.Предоплата, 0) КАК Предоплата
	               |ИЗ
	               |	ВТ_Остатки КАК ВТ_Остатки
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Предоплаты КАК ВТ_Предоплаты
	               |		ПО ВТ_Остатки.Реализация = ВТ_Предоплаты.Реализация";
		
	ТаблицаПредоплат = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура,
	               |	СУММА(ПродажиОбороты.КоличествоОборот) КАК Количество,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	ПродажиОбороты.ДокументПродажи
	               |ПОМЕСТИТЬ ВТ_Товары
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(, &Дата, , ДокументПродажи В (&СписокРеализаций)) КАК ПродажиОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.Номенклатура,
	               |	ПродажиОбороты.ДокументПродажи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Товары.Номенклатура,
	               |	ВТ_Товары.Количество,
	               |	ВТ_Товары.ДокументПродажи,
	               |	ВТ_Товары.Сумма,
	               |	ВТ_Товары.Сумма / ВТ_Товары.Количество КАК Цена
	               |ИЗ
	               |	ВТ_Товары КАК ВТ_Товары";
	
	ТаблицаТоваровПоРеализациям = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр ИЗ ПКООбъект.РасшифровкаПлатежа Цикл
		
		Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			СтрПоиска = ТаблицаПредоплат.Найти(Стр.ДокументРасчетовСКонтрагентом, "Реализация");	
			
			Если СтрПоиска <> Неопределено Тогда
				
				//Если в ПКО погасили только часть остатка реализации, то это аванс
				Если СтрПоиска.Остаток <> Стр.СуммаВзаиморасчетов Тогда
					
					НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
					НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
					НСтр.Количество = 1;
					НСтр.Цена = Стр.СуммаВзаиморасчетов;
					НСтр.Сумма = Стр.СуммаВзаиморасчетов;
					//+Гавриленков В. 05.12.2025 #UT10-5574
					//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
					//-Гавриленков В. 05.12.2025 #UT10-5574
					
					//В ином случае получаем список товаров с учетом корректировок 
					//и добавляем предоплату если она есть чтобы закрыть сумму по товарам
				Иначе
					
					СтрокиПоиска = ТаблицаТоваровПоРеализациям.НайтиСтроки(Новый Структура("ДокументПродажи", Стр.ДокументРасчетовСКонтрагентом));
					
					ОстатокДляСписанияПоРеализации = СтрПоиска.Остаток;
					
					Для каждого СтрТовара ИЗ СтрокиПоиска Цикл
						
						//Данное условие введено для исключительных ситуаций у которых в релизации несколько
						//одинаковых товаров с разными ценами
						КоличествоРазрядов = СтрДлина(СтрТовара.Цена) - СтрДлина(Цел(СтрТовара.Цена)) - 1;
						
						Если КоличествоРазрядов > 2 Тогда
							
							ТаблицаТоваровПоиска = Стр.ДокументРасчетовСКонтрагентом.Товары.Выгрузить(Новый Структура("Номенклатура", СтрТовара.Номенклатура));
							
							Если ТаблицаТоваровПоиска.Итог("Сумма") = СтрТовара.Сумма Тогда
								
								Для каждого СтрТ Из ТаблицаТоваровПоиска Цикл
									
									НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
									НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
									НСтр.Позиция = СтрТ.Номенклатура;
									НСтр.Количество = СтрТ.Количество;
									НСтр.Цена = СтрТ.Цена;
									НСтр.Сумма = СтрТ.Сумма;
									НСтр.СтавкаНДС = Стр.СтавкаНДС; 
									
								КонецЦикла; 
								
							КонецЕсли; 
							
						Иначе
							
							НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
							НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
							НСтр.Позиция = СтрТовара.Номенклатура;
							НСтр.Количество = СтрТовара.Количество;
							НСтр.Цена = СтрТовара.Цена;
							НСтр.Сумма = СтрТовара.Сумма;
							НСтр.СтавкаНДС = Стр.СтавкаНДС;
							
						КонецЕсли;
						
						ОстатокДляСписанияПоРеализации = ОстатокДляСписанияПоРеализации - СтрТовара.Сумма;
						
					КонецЦикла;
					
					//Бывает по реализации оформлена корректировка, но взаиморасчет списывается по другим реализацям
					//в этом случает будет висеть пустой взаиморасчет без товаров. Это будет аванс
					//возможно здесь стоит выводить не просто аванс, а товары погашенных реализаций (в случае если они полностью погашены)
					Если ОстатокДляСписанияПоРеализации > 0 Тогда
						
						НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
						НСтр.Количество = 1;
						НСтр.Цена = ОстатокДляСписанияПоРеализации;
						НСтр.Сумма = ОстатокДляСписанияПоРеализации; 
						//+Гавриленков В. 05.12.2025 #UT10-5574
						//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
						НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
						//-Гавриленков В. 05.12.2025 #UT10-5574
						
						ОстатокДляСписанияПоРеализации = 0;
						
						//В этом случае обнуляем предоплату, так как она не нужна чтобы покрыть 
						//стоимость всех товары, так как корректировка была не большую сумму
						СтрПоиска.Предоплата = 0;
						
					ИначеЕсли ОстатокДляСписанияПоРеализации = 0 Тогда
						
						СтрПоиска.Предоплата = 0;
						
					ИначеЕсли ОстатокДляСписанияПоРеализации < 0 Тогда
						
						СтрПоиска.Предоплата = ОстатокДляСписанияПоРеализации * -1;
						
					КонецЕсли;
					
					Если СтрПоиска.Предоплата > 0 Тогда
						
						НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Предоплата;
						НСтр.Сумма = СтрПоиска.Предоплата;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Если документом расчета не является реализация, то это аванс
		Иначе
			
			НСтр = ПКООбъект.ПозицииЧекККМ.Добавить();
			НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
			НСтр.Количество = 1;
			НСтр.Цена = Стр.СуммаВзаиморасчетов;
			НСтр.Сумма = Стр.СуммаВзаиморасчетов; 
			//+Гавриленков В. 05.12.2025 #UT10-5574
			//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
			НСтр.СтавкаНДС = ?(ПКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
			//-Гавриленков В. 05.12.2025 #UT10-5574
			
		КонецЕсли;
		
		НСтр = ПКООбъект.ОплатыЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Безналичные;
		НСтр.Сумма = Стр.СуммаВзаиморасчетов;
		
	КонецЦикла;
	
	ПКООбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	ПКООбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаККМДляОПК_Возврат(РКООбъект) Экспорт
	
	РКООбъект.ПозицииЧекККМ.Очистить();
	РКООбъект.ОплатыЧекККМ.Очистить();	
	
	Для каждого Стр ИЗ РКООбъект.РасшифровкаПлатежа Цикл
		
		Если ЗначениеЗаполнено(Стр.ДокументРасчетовСКонтрагентом) Тогда
			
			Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				
				ОткорректированныеТовары = ПолучитьОткорректированныеТоварыПоРелизацииОПК(Стр.ДокументРасчетовСКонтрагентом);
				СуммаОткорректированных = ОткорректированныеТовары.Итог("Сумма");
				
				Если СуммаОткорректированных = Стр.СуммаВзаиморасчетов Тогда
					
					Для каждого СтрКор ИЗ ОткорректированныеТовары Цикл
						
						НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
						НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
						ЗаполнитьЗначенияСвойств(НСтр, СтрКор);
											
					КонецЦикла;
					
				Иначе
					
					НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
					НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
					НСтр.Количество = 1;
					НСтр.Цена = Стр.СуммаВзаиморасчетов;
					НСтр.Сумма = Стр.СуммаВзаиморасчетов; 
					//+Гавриленков В. 05.12.2025 #UT10-5574
					//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					НСтр.СтавкаНДС = ?(РКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
					//-Гавриленков В. 05.12.2025 #UT10-5574
					
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
				
				НСтр = РКООбъект.ПозицииЧекККМ.Добавить();
				НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Аванс;
				НСтр.Количество = 1;
				НСтр.Цена = Стр.СуммаВзаиморасчетов;
				НСтр.Сумма = Стр.СуммаВзаиморасчетов;  
				//+Гавриленков В. 05.12.2025 #UT10-5574
				//НСтр.СтавкаНДС = Перечисления.СтавкиНДС.НДС20; 
				НСтр.СтавкаНДС = ?(РКООбъект.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
				//-Гавриленков В. 05.12.2025 #UT10-5574
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НСтр = РКООбъект.ОплатыЧекККМ.Добавить();
	НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Безналичные;
	НСтр.Сумма = РКООбъект.СуммаДокумента;
			
	РКООбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	РКООбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");
	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаККМДляРеализации(РеализацияОбъект) Экспорт
	
	РеализацияОбъект.ПозицииЧекККМ.Очистить();
	РеализацияОбъект.ОплатыЧекККМ.Очистить(); 
	
	Для каждого СтрТ Из РеализацияОбъект.Товары Цикл
		
		НСтр = РеализацияОбъект.ПозицииЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
		НСтр.Позиция = СтрТ.Номенклатура;
		НСтр.Количество = СтрТ.Количество;
		НСтр.Цена = СтрТ.Цена;
		НСтр.Сумма = СтрТ.Сумма;
		НСтр.СтавкаНДС = СтрТ.СтавкаНДС; 
		
	КонецЦикла; 
	
	НСтр = РеализацияОбъект.ОплатыЧекККМ.Добавить();
	НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Предоплата;
	НСтр.Сумма = РеализацияОбъект.СуммаДокумента;	
	
	РеализацияОбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	РеализацияОбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");   
	
	//+Белов А. 13.11.2024 #UT10-4894
	РеализацияОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуНаДатыЗапрета", Истина);
	//-Белов А. 13.11.2024 #UT10-4894
	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаККМДляКорректировкиРеализации(КорректировкаОбъект) Экспорт
	
	КорректировкаОбъект.ПозицииЧекККМ.Очистить();
	КорректировкаОбъект.ОплатыЧекККМ.Очистить(); 
	
	СуммаСкорректирована = 0;
	
	Для каждого СтрТ Из КорректировкаОбъект.Товары Цикл
		
		Если Не СтрТ.Количество < СтрТ.КоличествоДоИзменения Тогда
			Продолжить;			
		КонецЕсли;
		
		НСтр = КорректировкаОбъект.ПозицииЧекККМ.Добавить();
		НСтр.Тип = Перечисления.ТипыПозицийЧекККМ.Товар;
		НСтр.Позиция = СтрТ.Номенклатура;
		НСтр.Количество = СтрТ.КоличествоДоИзменения - СтрТ.Количество;
		НСтр.Цена = СтрТ.ЦенаДоИзменения;
		НСтр.Сумма = НСтр.Цена * НСтр.Количество;
		НСтр.СтавкаНДС = СтрТ.СтавкаНДСДоИзменения; 
		
		СуммаСкорректирована = СуммаСкорректирована + НСтр.Сумма;
		
	КонецЦикла; 
	
	НСтр = КорректировкаОбъект.ОплатыЧекККМ.Добавить();
	НСтр.Тип = Перечисления.ТипыОплатЧекККМ.Предоплата;
	НСтр.Сумма = СуммаСкорректирована;	
	
	КорректировкаОбъект.ПозицииЧекККМ.Свернуть("Тип, Позиция, СтавкаНДС, Цена", "Количество, Сумма");
	КорректировкаОбъект.ОплатыЧекККМ.Свернуть("Тип", "Сумма");
	
КонецПроцедуры

Функция ПоверитьКорректностьЗаполненияОПК_Возврат(Объект) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	СписокРеализаций = Новый СписокЗначений;
	СписокПриходников = Новый СписокЗначений;
	СписокИныхДокументов = Новый СписокЗначений;
	
	ТЗРасшифровка = Объект.РасшифровкаПлатежа.Выгрузить();
	ТЗРасшифровка.Свернуть("ДокументРасчетовСКонтрагентом");
	
	Для каждого Стр ИЗ ТЗРасшифровка Цикл
		
		Если ЗначениеЗаполнено(Стр.ДокументРасчетовСКонтрагентом) Тогда
			
			Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				СписокРеализаций.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			ИначеЕсли ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
				ИЛИ ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее")
				ИЛИ ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
				СписокПриходников.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			Иначе
				СписокИныхДокументов.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			КонецЕсли;
			
		Иначе
			
			СтруктураВозврата.Сообщение = "Обнаружены строки без заполненного реквизита 'Документ расчета с контрагентом'";
			Возврат СтруктураВозврата;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокИныхДокументов.Количество() > 0 Тогда
		
		СтруктураВозврата.Сообщение = "В качестве документов расчетов с контрагентом обнаружены документы, печать которых не предусмотрена системой!";
		Возврат СтруктураВозврата;
		
	КонецЕсли;
			
	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПоверитьКорректностьЗаполненияРеализации(Объект, МассивСсылок = Неопределено) Экспорт
//+Гавриленков В. 31.05.2025 #UT10-5251 добавлен параметр МассивОбъектов	
	
	Если МассивСсылок = Неопределено Тогда
		
		СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
		
		Если Не Объект.Проведен Тогда 
			
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Сообщение = "Документ не проведен";
			
		ИначеЕсли Не Объект.ДоговорКонтрагента.ЛицевойСчет Тогда 
			
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Сообщение = "В договоре у контрагента не установлен признак Лицевой счет"; 
			
		//+Белов А. 22.01.2026 #UT10-5638
		//ИначеЕсли Объект.ДокументыРасчетовСКонтрагентом.Итог("СуммаВзаиморасчетов") <> Объект.СуммаДокумента И Не ВсяРеализацияПогашена(Объект.Ссылка) Тогда
		//Если галка КонтролироватьВзаиморасчетыЧерезСистемуБиллинг стоит, то делаем отложенную печать	
		ИначеЕсли Не Объект.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг И Объект.ДокументыРасчетовСКонтрагентом.Итог("СуммаВзаиморасчетов") <> Объект.СуммаДокумента И Не ВсяРеализацияПогашена(Объект.Ссылка) Тогда
		//-Белов А. 22.01.2026 #UT10-5638	
				
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Сообщение = "Сумма предоплаты по документу не равна сумме документа";
			
			//+Белов А. 10.10.2024 #UT10-4803
		ИначеЕсли ВсяРеализацияСкорректирована(Объект.Ссылка) Тогда
			
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Сообщение = "Вся реализация была скорректирована";
			
			//-Белов А. 10.10.2024 #UT10-4803
		КонецЕсли;
		
		Возврат СтруктураВозврата;    
		
	//+Гавриленков В. 31.05.2025 #UT10-5251	
	Иначе      
		
		сч = 0;
		Пока сч < МассивСсылок.Количество() Цикл 
			
			Объект = МассивСсылок.Получить(сч);
			
			Если (Не Объект.Проведен)
				ИЛИ (Не Объект.ДоговорКонтрагента.ЛицевойСчет)
				//+Белов А. 22.01.2026 #UT10-5638
				//Или (Объект.ДокументыРасчетовСКонтрагентом.Итог("СуммаВзаиморасчетов") <> Объект.СуммаДокумента И Не ВсяРеализацияПогашена(Объект.Ссылка)) Тогда 
				//Если галка КонтролироватьВзаиморасчетыЧерезСистемуБиллинг стоит, то делаем отложенную печать
				ИЛИ (Не Объект.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг И Объект.ДокументыРасчетовСКонтрагентом.Итог("СуммаВзаиморасчетов") <> Объект.СуммаДокумента И Не ВсяРеализацияПогашена(Объект.Ссылка)) Тогда 
				//-Белов А. 22.01.2026 #UT10-5638		
				
				МассивСсылок.Удалить(сч);
				
			Иначе
				 сч = сч + 1;
			КонецЕсли;	
				
		КонецЦикла;
		
		РезультатПроверки = ВсяРеализацияСкорректирована(Неопределено, МассивСсылок);
		
		Возврат РезультатПроверки;
		
	КонецЕсли;
		
КонецФункции

Функция ПоверитьКорректностьЗаполненияКорректировкиРеализации(Объект) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
	
	Если Не Объект.ДоговорКонтрагента.ЛицевойСчет Тогда
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "В договоре у контрагента не установлен признак Лицевой счет";    
		
	Иначе 
		
		Реализация = ПолучитьРеализациюПоКорректировке(Объект);                   
		СтатусЗаданияПечати = Чеки.ПолучитьСтатусЗаданияПечатиПКО(Реализация);
		
		Если Не ЗначениеЗаполнено(СтатусЗаданияПечати) Тогда
			
			//+Белов А. 22.01.2026 #UT10-5638 реализации у нас будут печататься в отложенном режиме
			СтруктураВозврата.Результат = Ложь;
			СтруктураВозврата.Сообщение = "Нет задания на печать реализации";
			//Если Не ЗначениеЗаполнено(Реализация.НомерЧекаККМ) Тогда
			//	
			//	СтруктураВозврата.Результат = Ложь;
			//	СтруктураВозврата.Сообщение = "Нет задания на печать реализации и номера чека";
			//	
			//КонецЕсли;   
			//-Белов А. 22.01.2026 #UT10-5638
			
		КонецЕсли;                                                                                  
	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

Функция ВсяРеализацияПогашена(Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СуммаВзаиморасчетовОстаток = 0 Тогда
			Возврат Истина;
		Иначе
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

Функция ВсяРеализацияСкорректирована(Реализация, МассивРеализаций = Неопределено)  
//+Гавриленков В. 31.05.2025 #UT10-5251 добавлен параметр МассивРеализаций)
	
	Если МассивРеализаций = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор КАК Корректировка
		|ПОМЕСТИТЬ ВТ_КорректировкиРеализации
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор.ДокументРеализации = ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(КорректировкаРеализацииТовары.КоличествоДоКорректировки - КорректировкаРеализацииТовары.Количество, 0) * -1) КАК КоличествоСкорректировано
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_КорректировкиРеализации.Корректировка
		|			ИЗ
		|				ВТ_КорректировкиРеализации)";
		
		Запрос.УстановитьПараметр("Реализация", Реализация);  
		
		КоличествоСкорректировано = 0;
		
		Выборка = Запрос.Выполнить().Выбрать();           
		
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КоличествоСкорректировано) Тогда
			
			КоличествоСкорректировано = Выборка.КоличествоСкорректировано;	
			
			Если КоличествоСкорректировано * -1 = Реализация.Товары.Итог("Количество") Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЕсли;	           
		
		Возврат Ложь;
		
	Иначе     
		
		Соответствие = Новый Соответствие;  
		
		Если МассивРеализаций.Количество() = 0 Тогда
			Возврат Соответствие;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор КАК Корректировка
		|ПОМЕСТИТЬ ВТ_КорректировкиРеализации
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом В (&МассивРеализаций)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
		|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор.ДокументРеализации = ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(КорректировкаРеализацииТовары.КоличествоДоКорректировки - КорректировкаРеализацииТовары.Количество, 0) * -1) КАК КоличествоСкорректировано,
		|	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации КАК ДокументРеализации
		|ИЗ
		|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
		|ГДЕ
		|	КорректировкаРеализацииТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_КорректировкиРеализации.Корректировка
		|			ИЗ
		|				ВТ_КорректировкиРеализации)
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииТовары.Ссылка.ДокументРеализации";
		
		Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);  
		
		Таб = Запрос.Выполнить().Выгрузить();
		
		Для Каждого Реализация Из МассивРеализаций Цикл 
			
			НайденнаяСтрока = Таб.Найти(Реализация, "ДокументРеализации");  
			
			Если НайденнаяСтрока <> Неопределено И ЗначениеЗаполнено(НайденнаяСтрока.КоличествоСкорректировано) Тогда
				
				Если НайденнаяСтрока.КоличествоСкорректировано * -1 = Реализация.Товары.Итог("Количество") Тогда
					
					Соответствие.Вставить(Реализация, Ложь);
					Продолжить;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Соответствие.Вставить(Реализация, Истина);
			
		КонецЦикла; 
		
		Возврат Соответствие;
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьОткорректированныеТоварыПоРелизацииОПК(Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ЗапросДатПлатежныхДокументов.Дата) КАК МинимальнаяДатаВводаПлатежногоДокумента
	               |ПОМЕСТИТЬ ВТ_Дата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Дата КАК Дата
	               |	ИЗ
	               |		Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	               |	ГДЕ
	               |		ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = &Реализация
	               |		И ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Проведен) КАК ЗапросДатПлатежныхДокументов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура КАК Позиция,
	               |	ПродажиОбороты.КоличествоОборот * -1 КАК Количество,
	               |	ПродажиОбороты.СтоимостьОборот * -1 КАК Сумма,
	               |	ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот КАК Цена,
				   //+Гавриленков В. 05.12.2025 #UT10-5574 ВременноеУсловиеСтавкиНДС
				   //|	ВЫБОР 
				   //|		КОГДА ПродажиОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
				   //|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
				   //|		ИНАЧЕ ПродажиОбороты.Номенклатура.СтавкаНДС
				   //|	КОНЕЦ КАК СтавкаНДС 
				   |	ВЫБОР
				   |		КОГДА ПродажиОбороты.Период >= &ДатаСтавкиНДС
		           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
				   |		ИНАЧЕ ВЫБОР
				   |			КОГДА ПродажиОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
				   |				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
				   |			ИНАЧЕ ПродажиОбороты.Номенклатура.СтавкаНДС
				   |		КОНЕЦ
				   |	КОНЕЦ КАК СтавкаНДС
				   //-Гавриленков В. 05.12.2025 #UT10-5574
	               |ИЗ
	               |	ВТ_Дата КАК ВТ_Дата
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , Регистратор, ДокументПродажи = &Реализация) КАК ПродажиОбороты
	               |		ПО (ПродажиОбороты.Период >= ВТ_Дата.МинимальнаяДатаВводаПлатежногоДокумента)
	               |ГДЕ
	               |	ПродажиОбороты.КоличествоОборот < 0";  
	
	//+Гавриленков В. 05.12.2025 #UT10-5574
	Запрос.УстановитьПараметр("ДатаСтавкиНДС", Дата("20260101000000"));
	//-Гавриленков В. 05.12.2025 #UT10-5574
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

Функция ПолучитьОткорректированныеТоварыПоРелизации(Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МИНИМУМ(ЗапросДатПлатежныхДокументов.Дата) КАК МинимальнаяДатаВводаПлатежногоДокумента
	               |ПОМЕСТИТЬ ВТ_Дата
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Дата КАК Дата
	               |	ИЗ
	               |		Документ.ПлатежноеПоручениеВходящее.РасшифровкаПлатежа КАК ПлатежноеПоручениеВходящееРасшифровкаПлатежа
	               |	ГДЕ
	               |		ПлатежноеПоручениеВходящееРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = &Реализация
	               |		И ПлатежноеПоручениеВходящееРасшифровкаПлатежа.Ссылка.Проведен
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата
	               |	ИЗ
	               |		Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |	ГДЕ
	               |		ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = &Реализация
	               |		И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата) КАК ЗапросДатПлатежныхДокументов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПродажиОбороты.Номенклатура КАК Позиция,
	               |	ПродажиОбороты.КоличествоОборот * -1 КАК Количество,
	               |	ПродажиОбороты.СтоимостьОборот * -1 КАК Сумма,
	               |	(ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот) КАК Цена,
				    //+Гавриленков В. 05.12.2025 #UT10-5574 ВременноеУсловиеСтавкиНДС
				   //|	ВЫБОР
				   //|		КОГДА ПродажиОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
				   //|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
				   //|		ИНАЧЕ ПродажиОбороты.Номенклатура.СтавкаНДС
				   //|	КОНЕЦ КАК СтавкаНДС
				   //-Гавриленков В. 05.12.2025 #UT10-5574
				   |	ВЫБОР
				   |		КОГДА ПродажиОбороты.Период >= &ДатаСтавкиНДС
		           |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС22)
				   |		ИНАЧЕ ВЫБОР
				   |			КОГДА ПродажиОбороты.Номенклатура.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
				   |				ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС20)
				   |			ИНАЧЕ ПродажиОбороты.Номенклатура.СтавкаНДС
				   |		КОНЕЦ
				   |	КОНЕЦ КАК СтавкаНДС
	               |ИЗ
	               |	ВТ_Дата КАК ВТ_Дата
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, , Регистратор, ДокументПродажи = &Реализация) КАК ПродажиОбороты
	               |		ПО (ПродажиОбороты.Период >= ВТ_Дата.МинимальнаяДатаВводаПлатежногоДокумента)
	               |ГДЕ
	               |	ПродажиОбороты.КоличествоОборот < 0";
				   
	//+Гавриленков В. 05.12.2025 #UT10-5574
	Запрос.УстановитьПараметр("ДатаСтавкиНДС", Дата("20260101000000"));
	//-Гавриленков В. 05.12.2025 #UT10-5574			   
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗ;
	
КонецФункции

Функция ПоверитьКорректностьСоставаЧекаККМ(Объект) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
	
	Если Объект.ПозицииЧекККМ.Итог("Сумма") <> Объект.ОплатыЧекККМ.Итог("Сумма") Тогда
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Сумма по таблице позиций не совпадает с суммой по таблице оплат";
		
		Возврат СтруктураВозврата;
		
	ИначеЕсли Объект.ПозицииЧекККМ.Количество() = 0 ИЛИ Объект.ОплатыЧекККМ.Количество() = 0 Тогда 
		
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Отсутствуют позиции или оплаты в составе чека";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;	
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПоверитьКорректностьЗаполненияРКО(Объект) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	СписокРеализаций = Новый СписокЗначений;
	СписокПриходников = Новый СписокЗначений;
	СписокИныхДокументов = Новый СписокЗначений;
	
	ТЗРасшифровка = Объект.РасшифровкаПлатежа.Выгрузить();
	ТЗРасшифровка.Свернуть("ДокументРасчетовСКонтрагентом");
	
	Для каждого Стр ИЗ ТЗРасшифровка Цикл
		
		Если ЗначениеЗаполнено(Стр.ДокументРасчетовСКонтрагентом) Тогда
			
			Если ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				СписокРеализаций.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			ИначеЕсли ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") 
				ИЛИ ТипЗнч(Стр.ДокументРасчетовСКонтрагентом) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
				СписокПриходников.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			Иначе
				СписокИныхДокументов.Добавить(Стр.ДокументРасчетовСКонтрагентом);
			КонецЕсли;
			
		Иначе
			
			СтруктураВозврата.Сообщение = "Обнаружены строки без заполненного реквизита 'Документ расчета с контрагентом'";
			Возврат СтруктураВозврата;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если СписокИныхДокументов.Количество() > 0 Тогда
		
		СтруктураВозврата.Сообщение = "В качестве документов расчетов с контрагентом обнаружены документы, печать которых не предусмотрена системой!";
		Возврат СтруктураВозврата;
		
	КонецЕсли;
			
	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПКОАннулирован(ПКО) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Аннулирование
	|	И РасходныйКассовыйОрдер.ДокументОснование = &ДокументОснование
	|	И РасходныйКассовыйОрдер.Проведен";
	
	Запрос.УстановитьПараметр("ДокументОснование", ПКО);
	
	Выборка = Запрос.Выполнить().Выбрать();           
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;		
	КонецЕсли;         
	
	Возврат Ложь;	
		
КонецФункции

Функция ЕстьПлатежныйДокументПоРеализации(Реализация) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
	|ГДЕ
	|	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ОплатаОтПокупателяПлатежнойКартой)";
	
	Запрос.УстановитьПараметр("Реализация", Реализация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;		
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьКассуПоВодителю(Водитель, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаСрезПоследних.СтруктурнаяЕдиница КАК Касса
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(
	|			,
	|			СтруктурнаяЕдиница ССЫЛКА Справочник.Кассы
	|				И ФизическоеЛицо = &ФизическоеЛицо
	|				И СтруктурнаяЕдиница.Владелец = &Организация
	|				И СтруктурнаяЕдиница.ПометкаУдаления = ЛОЖЬ) КАК ОтветственныеЛицаСрезПоследних";  
	
	Запрос.УстановитьПараметр("ФизическоеЛицо", Водитель);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Касса;		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции


///////////////////Коды маркировки///////////////////
Функция ПробиватьВЧекахКодыМаркировки() Экспорт
	
	Возврат Константы.ПробиватьВЧекахКодыМаркировки.Получить() И ФФД12();
	
КонецФункции

//+Сёмин Р.И. 09.07.2026 #UT10-5935
//Функция ПолучитьМаркировкуПоДокументу(Документ, ЭтоВозврат, СтруктураЧека)
Функция ПолучитьМаркировкуПоДокументу(Документ, ЭтоВозврат, СтруктураЧека, ВернутьРезультатЗапроса = Ложь)
//-Сёмин Р.И. 09.07.2026 #UT10-5935	
	
	//+Белов А. 04.05.2026 #UT10-5841
	Если СтруктураЧека.Свойство("clientInfo") И СтруктураЧека.clientInfo.Свойство("vatin") И ЗначениеЗаполнено(СтруктураЧека.clientInfo.vatin) Тогда
		Возврат Новый Соответствие;	
	КонецЕсли;
	//-Белов А. 04.05.2026 #UT10-5841
	
	//+Сёмин Р.И. 09.09.2026 #UT10-6020
	ВыводитьДанныеПроверкиШтрихкодовПИоТ = Константы.ИспользоватьПроверкуМаркировокТСПИоТ.Получить() И ВДокументеЛицевойИлиРозничныйДоговор(Документ) И НЕ ЭтоОплатаКартойИлиПКОСЛицевымСчетом(Документ);
	//-Сёмин Р.И. 09.09.2026 #UT10-6020
	
	МаркировкаПоНоменклатуре = Новый Соответствие; 
	МаркировкиИсключения = Новый Массив;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Документ.КодМаркировки.Номенклатура КАК Номенклатура,
		|	Документ.КодМаркировки КАК ШК,
		|	ВЫБОР
		|		КОГДА Документ.Ссылка.ДоговорКонтрагента.ЛицевойСчет
		|				ИЛИ Документ.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
		|			ТОГДА ""itemPieceSold""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.УчастникОборота)
		|					ТОГДА ""itemPieceForSale""
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
		|					ТОГДА ""itemPieceSold""
		|				ИНАЧЕ ""itemPieceForSale""
		|			КОНЕЦ
		|	КОНЕЦ КАК itemEstimatedStatus
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Документ.КодМаркировки.Номенклатура,
		|	Документ.КодМаркировки,
		|	ВЫБОР
		|		КОГДА Документ.Ссылка.ДоговорКонтрагента.ЛицевойСчет
		|				ИЛИ Документ.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
		|			ТОГДА ""itemPieceSold""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.УчастникОборота)
		|					ТОГДА ""itemPieceForSale""
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
		|					ТОГДА ""itemPieceSold""
		|				ИНАЧЕ ""itemPieceForSale""
		|			КОНЕЦ
		|	КОНЕЦ
		|ИЗ
		|	Документ.КорректировкаРеализации.КодыМаркировки КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивДокументов)";
	
	//+Сёмин Р.И. 09.09.2026 #UT10-6020
	Если ВыводитьДанныеПроверкиШтрихкодовПИоТ Тогда
		Запрос.Текст = ПолучитьТекстЗапросаМаркировокПоНоменклатуреСПроверкамиПИоТ();
	КонецЕсли;
	//-Сёмин Р.И. 09.09.2026 #UT10-6020
	
	Если ТипЗнч(Документ) = Тип("Массив") Тогда
		МассивДокументов = Документ;
	Иначе
		
		МассивДокументов = Новый Массив;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			МассивДокументов.Добавить(Документ);
		Иначе
			МассивДокументов = ПолучитьМассивДокументовПоРасшифровкеПлатежа(Документ);	
		КонецЕсли;
		
	КонецЕсли;   
	
	//+Белов А. 15.04.2026 #UT10-5813
	УбратьДокументыИзРасшифровкиПоФильтру(МассивДокументов, МаркировкиИсключения);
	//-Белов А. 15.04.2026 #UT10-5813
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	//+Сёмин Р.И. 09.07.2026 #UT10-5935
	Если ВернутьРезультатЗапроса Тогда
		Возврат Запрос.Выполнить();
	КонецЕсли;
	//-Сёмин Р.И. 09.07.2026 #UT10-5935
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Номенклатура = Выборка.Номенклатура;
		ШК = Выборка.ШК; 		  
		
		//+Белов А. 15.04.2026 #UT10-5813
		Если МаркировкиИсключения.Найти(ШК) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		//-Белов А. 15.04.2026 #UT10-5813
		
		ПолныйКодМаркировки = ШК.ПолныйКодМаркировки.Получить();
		
		//Если на находим разделитель групп, то это забагованный код маркировки, пытаемся его исправить
		Если Найти(ПолныйКодМаркировки, "<GS>") = 0 И Найти(ПолныйКодМаркировки, Символ(29)) = 0 Тогда
			
			ПолныйКодМаркировкиДоработанный = ДобавитьВКодМаркировкиНедостающиеСимволы(ПолныйКодМаркировки);
			
			Если ПолныйКодМаркировкиДоработанный = Неопределено Тогда
				
				//Значит не добавляем этот код маркировки в чек, иначе он вообще не пробьется
				ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Документ.Метаданные(), Документ, "Код маркировки: " + ПолныйКодМаркировки + " при печати чека был пропущен, так как его структура не валидна");		
				Продолжить;
				
			Иначе
				ПолныйКодМаркировки = ПолныйКодМаркировкиДоработанный;	
			КонецЕсли;					
			
		КонецЕсли;
		
		СтруктураМаркировки = Новый Структура;
		СтруктураМаркировки.Вставить("imcType", "auto");
		СтруктураМаркировки.Вставить("imc", КодироватьСтрокуВBase64(СтрЗаменить(ПолныйКодМаркировки, "<GS>", Символ(29))));
		
		Если ЭтоВозврат Тогда
			СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceReturn");
		Иначе
			
			//+Белов А. 17.03.2026 #UT10-5757
			СтруктураМаркировки.Вставить("itemEstimatedStatus", Выборка.itemEstimatedStatus);
			//Если СтруктураЧека.Свойство("clientInfo") И СтруктураЧека.clientInfo.Свойство("vatin") Тогда
			//	СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceForSale");
			//Иначе
			//	СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceSold");
			//КонецЕсли;  
			//-Белов А. 17.03.2026 #UT10-5757
			
		КонецЕсли;
		
		СтруктураМаркировки.Вставить("imcModeProcessing", 0);
		
		МассивМаркировки = МаркировкаПоНоменклатуре.Получить(Номенклатура);
		
		Если МассивМаркировки = Неопределено Тогда
			
			МассивМаркировки = Новый Массив;
			МаркировкаПоНоменклатуре.Вставить(Номенклатура, МассивМаркировки);
			
		КонецЕсли;  
		
		//+Сёмин Р.И. 09.07.2026 #UT10-6020
		//МассивМаркировки.Добавить(Новый Структура("Маркировка, Использован", СтруктураМаркировки, Ложь));
		
		СтрокаМассиваМаркировки = Новый Структура;
		СтрокаМассиваМаркировки.Вставить("Маркировка", СтруктураМаркировки);
		СтрокаМассиваМаркировки.Вставить("Использован", Ложь);
		
		Если ВыводитьДанныеПроверкиШтрихкодовПИоТ Тогда
			
			ПроверкаПИоТ = Новый Структура;
			
			ПроверкаПИоТ.Вставить("reqId", Выборка.reqId);
			ПроверкаПИоТ.Вставить("reqTimestamp", Выборка.reqTimestamp);
			ПроверкаПИоТ.Вставить("isCheckedOffline", Выборка.isCheckedOffline);
			ПроверкаПИоТ.Вставить("inst", Выборка.inst);
			ПроверкаПИоТ.Вставить("version", Выборка.version);
			ПроверкаПИоТ.Вставить("ДатаДокумента", Выборка.ДатаДокумента);
			ПроверкаПИоТ.Вставить("НомерДокумента", Выборка.НомерДокумента);
			
			СтрокаМассиваМаркировки.Вставить("ПроверкаПИоТ", ПроверкаПИоТ);
			
		КонецЕсли;
		
		МассивМаркировки.Добавить(СтрокаМассиваМаркировки);
		//-Сёмин Р.И. 09.07.2026 #UT10-6020
		
	КонецЦикла;
	
	Возврат МаркировкаПоНоменклатуре;
	
КонецФункции 

Процедура УбратьДокументыИзРасшифровкиПоФильтру(МассивДокументов, МаркировкиИсключения)
	//+Белов А. 15.04.2026 #UT10-5813  
	
	МассивДокументовУдаления = Новый Массив;
	
	Для каждого Документ Из МассивДокументов Цикл
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			ДоговорКонтрагента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Документ, "ДоговорКонтрагента");
			
			Если Не ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДоговорКонтрагента, "ЛицевойСчет") 
				И Не ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДоговорКонтрагента, "РозничнаяПродажа") Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗначенияСвойствОбъектов.Объект
				|ИЗ
				|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
				|ГДЕ
				|	ЗначенияСвойствОбъектов.Объект = &Объект
				|	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
				
				Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("DS_Документ_ID"));  
				Запрос.УстановитьПараметр("Объект", Документ);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				//Если отправлен через ЭДО, то не отправляем маркировки по документу
				Если Выборка.Следующий() Тогда
					
					МассивДокументовУдаления.Добавить(Документ);
					Продолжить;
					
				КонецЕсли;     
				
				УсловияРаботыСЧЗ = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДоговорКонтрагента, "УсловияРаботыСЧЗ"); 
				
				Если УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВыводИзОборотаКИЗТовары.ШтрихКодМаркировки
					|ИЗ
					|	Документ.ВыводИзОборотаКИЗ.Товары КАК ВыводИзОборотаКИЗТовары
					|ГДЕ
					|	ВыводИзОборотаКИЗТовары.Ссылка.Основание = &Основание
					|	И ВыводИзОборотаКИЗТовары.Ссылка.Проведен";
					
					Запрос.УстановитьПараметр("Основание", Документ);  
					
					Выборка = Запрос.Выполнить().Выбрать(); 
					
					Пока Выборка.Следующий() Цикл
						МаркировкиИсключения.Добавить(Выборка.ШтрихКодМаркировки);
					КонецЦикла;		 
					
				КонецЕсли;                                                                     		
				
			КонецЕсли;
			
		КонецЕсли;  
		
	КонецЦикла;  
	
	Для каждого ДокументУдаления Из МассивДокументовУдаления Цикл
		
		Пока МассивДокументов.Найти(ДокументУдаления) <> Неопределено Цикл
			МассивДокументов.Удалить(МассивДокументов.Найти(ДокументУдаления));		
		КонецЦикла;  
		
	КонецЦикла;
	
	//-Белов А. 15.04.2026 #UT10-5813		
КонецПроцедуры

Функция ПолучитьМассивДокументовПоРасшифровкеПлатежа(Документ)
	
	МетаданныеДокумента = Документ.Метаданные(); 
	
	Если ОбщегоНазначения.ЕстьТабЧастьДокумента("РасшифровкаПлатежа", МетаданныеДокумента) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПлатежныйДокумент.ДокументРасчетовСКонтрагентом
		|ПОМЕСТИТЬ ВТ_Расшифровка
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПлатежныйДокумент
		|ГДЕ
		|	ПлатежныйДокумент.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Расшифровка.ДокументРасчетовСКонтрагентом
		|ИЗ
		|	ВТ_Расшифровка КАК ВТ_Расшифровка
		|ГДЕ
		|	ВТ_Расшифровка.ДокументРасчетовСКонтрагентом ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Расшифровка.ДокументРасчетовСКонтрагентом";
		
		Запрос.УстановитьПараметр("Ссылка", Документ); 
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПриходныйКассовыйОрдер", МетаданныеДокумента.Имя);
		
		МассивДокументовРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРасчетовСКонтрагентом");   
		
		//Если РКО или Оплата картой с типом - Возврат, то коды маркировки надо брать из корректировок. Подбираем их по сумме
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
			ИЛИ (ТипЗнч(Документ) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") И Документ.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ВозвратДенежныхСредствПокупателю) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор КАК Корректировка,
			|	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.СуммаВзаиморасчетовОборот * -1) КАК Сумма
			|ПОМЕСТИТЬ ВТ_Корректировки
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом В (&МассивДокументовРасчетов)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
			|ГДЕ
			|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
			|
			|СГРУППИРОВАТЬ ПО
			|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Корректировки.Корректировка
			|ИЗ
			|	ВТ_Корректировки КАК ВТ_Корректировки
			|ГДЕ
			|	ВТ_Корректировки.Сумма = &Сумма";
			
			Запрос.УстановитьПараметр("МассивДокументовРасчетов", МассивДокументовРасчетов);
			Запрос.УстановитьПараметр("Сумма", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "СуммаДокумента"));
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				МассивВозврата = Новый Массив;
				МассивВозврата.Добавить(Выборка.Корректировка);
				
				Возврат МассивВозврата;
				
			КонецЕсли;   
			
		Иначе
			Возврат МассивДокументовРасчетов;			
		КонецЕсли; 	
		
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

Функция ДобавитьВКодМаркировкиНедостающиеСимволы(Знач ИсходнаяСтрока) Экспорт
	
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.Global = Истина;
	
	// Маска: (91 + 4 символа) и (92)
	RegExp.Pattern = "(91.{4})(92)";
	
	// Символ Group Separator
	GS = "<GS>"; 
	
	// Формируем результат: GS + первая группа + GS + вторая группа
	Результат = RegExp.Replace(ИсходнаяСтрока, GS + "$1" + GS + "$2"); 
	
	Если Найти(Результат, "<GS>") > 0 Тогда
		Возврат Результат;	
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции  

Функция ПроверитьКодМаркировкиПродолжение(МассивКодовМаркировкиBase64, АдресТСПиоТ, Порт, ЗащищенноеСоединение) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("КодОшибки", 0);
	Результат.Вставить("ОписаниеОшибки", "");
	Результат.Вставить("ПродажаРазрешена", Ложь);
	Результат.Вставить("ПричинаЗапрета", "");
	Результат.Вставить("ДанныеТовара", Неопределено);
	Результат.Вставить("Комментарий", "");
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("codes", МассивКодовМаркировкиBase64);
	
	//♯а1с:1028
	ИнформацияОКлиенте = Новый Структура;
	ИнформацияОКлиенте.Вставить("name", "1С ПМСР");
	ИнформацияОКлиенте.Вставить("version", "1.0.0");
	ИнформацияОКлиенте.Вставить("id", "65329da4-01d1-48ba-9db8-ed58b3892774"); 		
	ИнформацияОКлиенте.Вставить("token", "token");
	
	ПараметрыЗапроса.Вставить("client_info", ИнформацияОКлиенте);
	
	ТекстЗапроса = Чеки.ВернутьJSON(ПараметрыЗапроса);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json");
	ЗаголовокHTTP.Вставить("Accept",         "application/json");
	
	URL = "/api/v2/codes/check";
	HTTPЗапрос = Новый HTTPЗапрос(URL, ЗаголовокHTTP);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса, КодировкаТекста.UTF8);
	
	HTTPСоединение = Новый HTTPСоединение(АдресТСПиоТ, Порт, , , , 10, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	
	Попытка
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Исключение
		ВызватьИсключение "Ошибка при выполнении запроса: " + ОписаниеОшибки();
	КонецПопытки;
	
	Если HTTPОтвет.КодСостояния = 200 Тогда
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Ответ = Чеки.ВернутьСтруктуруИзJSON(ТекстОтвета);
		
		Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("codesResponse") Тогда
			ОтветПоКоду = Ответ.codesResponse[0];
			
			Если ОтветПоКоду.Свойство("codes") И ТипЗнч(ОтветПоКоду.codes) = Тип("Массив") И ОтветПоКоду.codes.Количество() > 0 Тогда
				ДанныеКода = ОтветПоКоду.codes[0];
				Результат.ДанныеТовара = ДанныеКода;
				
				ПричинаЗапретаПродажи = "";
				
				ОффЛайнПроверка = ОтветПоКоду.isCheckedOffline;
				Если ОффЛайнПроверка Тогда
					//♯а1с:1031
					Если ДанныеКода.isBlocked Тогда
						ПричинаЗапретаПродажи = "Товар заблокирован по решению органов власти";
					Иначе
						ПродажаРазрешена = Истина;
						ДобавитьКомментарий(Результат.Комментарий, "ОффЛайн проверка");
					КонецЕсли;
				Иначе
					Если НЕ ДанныеКода.found Тогда
						ПричинаЗапретаПродажи = "Код не найден в ГИС МТ";
					ИначеЕсли ДанныеКода.isBlocked Тогда
						ПричинаЗапретаПродажи = "Товар заблокирован по решению органов власти";
					ИначеЕсли ДанныеКода.sold Тогда
						ПричинаЗапретаПродажи = "Товар уже был продан ранее";
					ИначеЕсли НЕ ДанныеКода.realizable Тогда
						ПричинаЗапретаПродажи = "Товар не введен в оборот или выведен из оборота";
					ИначеЕсли НЕ ДанныеКода.utilised Тогда
						ПричинаЗапретаПродажи = "Код маркировки не нанесен на упаковку";
					ИначеЕсли НЕ ДанныеКода.valid Тогда
						ПричинаЗапретаПродажи = "Неверная структура кода маркировки";
					ИначеЕсли НЕ ДанныеКода.verified Тогда
						ПричинаЗапретаПродажи = "Ошибка проверки крипто-подписи";
					ИначеЕсли ДанныеКода.Свойство("expireDate") И ДанныеКода.expireDate <> Неопределено Тогда
						// Проверка срока годности
						ДатаИстечения = Дата(ДанныеКода.expireDate);
						Если ДатаИстечения < ТекущаяДата() Тогда
							ПричинаЗапретаПродажи = "Истек срок годности товара";
						КонецЕсли;
					Иначе
						ПродажаРазрешена = Истина;
						ДобавитьКомментарий(Результат.Комментарий, "ОнЛайн проверка");
					КонецЕсли;
				КонецЕсли;
				
				Если ПродажаРазрешена Тогда
					Результат.ПродажаРазрешена = ПродажаРазрешена;
				Иначе
					Результат.ПродажаРазрешена = ПродажаРазрешена;
					Результат.ПричинаЗапретаПродажи = ПричинаЗапретаПродажи;
				КонецЕсли;
			Иначе
				ВызватьИсключение "Неизвестный формат ответа от ТС ПИоТ #2";
			КонецЕсли;
		Иначе
			ВызватьИсключение "Неизвестный формат ответа от ТС ПИоТ #1";
		КонецЕсли;
	Иначе
		// Обработка HTTP-ошибок
		Результат.КодОшибки = HTTPОтвет.КодСостояния;
				
		// Особые коды ошибок по документации
		Если HTTPОтвет.КодСостояния = 203 Тогда
			Результат.ОписаниеОшибки = "Аварийный режим ТС ПИоТ, продажа разрешена";
			Результат.ПродажаРазрешена = Истина; // По документации, при 203 продажа разрешается ♯а1с:1033
			ДобавитьКомментарий(Результат.Комментарий, "Аварийный режим ТС ПИоТ, продажа разрешена");
		ИначеЕсли HTTPОтвет.КодСостояния = 400 Тогда
			Результат.ОписаниеОшибки = "Неверный формат запроса: " + ТекстЗапроса;
		ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
			Результат.ОписаниеОшибки = "Internal Server Error - внутренняя ошибка сервера при обработке запроса";		
		ИначеЕсли HTTPОтвет.КодСостояния = 504 Тогда
			Результат.ОписаниеОшибки = "Gateway Timeout - превышено время ожидания ответа от upstream сервиса";	
		ИначеЕсли HTTPОтвет.КодСостояния = 514 Тогда
			Результат.ОписаниеОшибки = "Таймаут: нет ответа от ГИС МТ и ЛМ ЧЗ";
		Иначе
			Результат.ОписаниеОшибки = "HTTP ошибка: " + HTTPОтвет.КодСостояния;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПроверитьКодыМаркировкиПИоТ(КодМассивКодовМаркировки, АдресТСПиоТ, Действие = "Продажа", Событие = "", Источник = Неопределено) Экспорт
	
	//+Сёмин Р.И. 06.07.2026 #UT10-5935
	Если ЗначениеЗаполнено(Событие) Тогда
		Операция = Событие;
	Иначе
		Операция = Действие;
	КонецЕсли;
	
	КодыМаркировкиДляПроверки = Новый ТаблицаЗначений;
	КодыМаркировкиДляПроверки.Колонки.Добавить("ШтрихкодНоменклатуры");
	КодыМаркировкиДляПроверки.Колонки.Добавить("ПолныйКодМаркировки");
	КодыМаркировкиДляПроверки.Колонки.Добавить("КороткийКодМаркировки");
	
	Если ТипЗнч(КодМассивКодовМаркировки) <> Тип("Массив") Тогда
		ДобавитьКодМаркировкиВТаблицуДляПроверкиПИоТ(КодМассивКодовМаркировки, КодыМаркировкиДляПроверки);
	Иначе
		
		Для Каждого Стр Из КодМассивКодовМаркировки Цикл
			ДобавитьКодМаркировкиВТаблицуДляПроверкиПИоТ(Стр, КодыМаркировкиДляПроверки);
		КонецЦикла;
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Сообщение", "");
	Результат.Вставить("Результат", Ложь);
	Результат.Вставить("Данные", Неопределено);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("codes", КодыМаркировкиДляПроверки.ВыгрузитьКолонку("ПолныйКодМаркировки"));
	
	//♯а1с:1028
	ИнформацияОКлиенте = Новый Структура;
	ИнформацияОКлиенте.Вставить("name", "1С ПМСР");
	ИнформацияОКлиенте.Вставить("version", "1.0.0");
	ИнформацияОКлиенте.Вставить("id", "55329da4-01d1-48ba-9db8-ed58b3892774"); 		
	ИнформацияОКлиенте.Вставить("token", "85329da4-01d1-48ba-9db8-ed58b3892774");
	ИнформацияОКлиенте.Вставить("inn", Константы.ОсновнаяОрганизация.Получить().ИНН);
	
	ПараметрыЗапроса.Вставить("client_info", ИнформацияОКлиенте);
		
	URL = "/api/v2/codes/check";
	
	ПолученыДанныеПоКодамИзПИоТ = Ложь;
	
	HTTPОтвет = OPI_ЗапросыHTTP.PostСТелом(АдресТСПиоТ + URL, ПараметрыЗапроса,,,Истина,,1,2);	
		
	Если HTTPОтвет.КодСостояния = 200 Тогда
		
		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Ответ = ВернутьСтруктуруИзJSON(ТекстОтвета);
		
		Если ТипЗнч(Ответ) = Тип("Структура") И Ответ.Свойство("codesResponse") Тогда
			
			ОтветПоКоду = Ответ.codesResponse[0];
			
			Если ОтветПоКоду.Свойство("codes") И ТипЗнч(ОтветПоКоду.codes) = Тип("Массив") И ОтветПоКоду.codes.Количество() > 0 Тогда
				
				ПолученыДанныеПоКодамИзПИоТ = Истина;
				
				ТаблицаПроверенныхКодов = Новый ТаблицаЗначений; 
				ТаблицаПроверенныхКодов.Колонки.Добавить("ДействиеРезрешено");
				ТаблицаПроверенныхКодов.Колонки.Добавить("ДанныеКода");
				ТаблицаПроверенныхКодов.Колонки.Добавить("ПричинаЗапрета");
				
				Для Каждого ДанныеКода Из ОтветПоКоду.codes Цикл
					
					ДействиеРезрешено = Ложь;					
					ПричинаЗапрета = "";
					
					ОффЛайнПроверка = ОтветПоКоду.isCheckedOffline;
					Если ОффЛайнПроверка Тогда
						
						Если ДанныеКода.isBlocked Тогда
							ПричинаЗапрета = "Товар заблокирован по решению органов власти";
						Иначе                         						
							ДействиеРезрешено = Истина;							
						КонецЕсли;                  
						
					Иначе  
						
						Если Действие = "Продажа" Тогда
	
							Если НЕ ДанныеКода.found Тогда
								ПричинаЗапрета = "Код не найден в ГИС МТ";
							ИначеЕсли ДанныеКода.isBlocked Тогда
								ПричинаЗапрета = "Товар заблокирован по решению органов власти";
							ИначеЕсли ДанныеКода.sold Тогда
								ПричинаЗапрета = "Товар уже был продан ранее";
							ИначеЕсли НЕ ДанныеКода.realizable Тогда
								ПричинаЗапрета = "Товар не введен в оборот или выведен из оборота";
							ИначеЕсли НЕ ДанныеКода.utilised Тогда
								ПричинаЗапрета = "Код маркировки не нанесен на упаковку";
							ИначеЕсли НЕ ДанныеКода.valid Тогда
								ПричинаЗапрета = "Неверная структура кода маркировки";
							ИначеЕсли НЕ ДанныеКода.verified Тогда
								ПричинаЗапрета = "Ошибка проверки крипто-подписи";
								// Владелец
							//ИначеЕсли НЕ ДанныеКода.isOwner Тогда
							//	ПричинаЗапрета = "Код маркировки не принадлежит организации " + Константы.ОсновнаяОрганизация.Получить();
								
							ИначеЕсли ДанныеКода.Свойство("expireDate") И ДанныеКода.expireDate <> Неопределено Тогда
								
								// Проверка срока годности
								ДатаИстечения = XMLЗначение(Тип("Дата"), ДанныеКода.expireDate);
								Если ДатаИстечения < ТекущаяДата() Тогда
									ПричинаЗапрета = "Истек срок годности товара"; 
								Иначе
									ДействиеРезрешено = Истина;	
								КонецЕсли;  
								
							Иначе     					
								ДействиеРезрешено = Истина;						
							КонецЕсли;
							
						ИначеЕсли Действие = "Возврат" Тогда
							
							Если НЕ ДанныеКода.found Тогда
								ПричинаЗапрета = "Код не найден в ГИС МТ";
							ИначеЕсли ДанныеКода.isBlocked Тогда
								ПричинаЗапрета = "Товар заблокирован по решению органов власти";
							ИначеЕсли ДанныеКода.sold Тогда
								ПричинаЗапрета = "Товар уже был продан ранее";
							ИначеЕсли НЕ ДанныеКода.utilised Тогда
								ПричинаЗапрета = "Код маркировки не нанесен на упаковку";
							ИначеЕсли НЕ ДанныеКода.valid Тогда
								ПричинаЗапрета = "Неверная структура кода маркировки";
							ИначеЕсли НЕ ДанныеКода.verified Тогда
								ПричинаЗапрета = "Ошибка проверки крипто-подписи";								
							Иначе     					
								ДействиеРезрешено = Истина;						
							КонецЕсли;        
							
						КонецЕсли;
						
					КонецЕсли;  
					
					НСтр = ТаблицаПроверенныхКодов.Добавить();
					НСтр.ДействиеРезрешено = ДействиеРезрешено;  
					НСтр.ДанныеКода = ДанныеКода;     
					НСтр.ПричинаЗапрета = ПричинаЗапрета;
					
				КонецЦикла;                   
				
				СтрокиКодовСРазрешенныимДействием = ТаблицаПроверенныхКодов.НайтиСтроки(Новый Структура("ДействиеРезрешено", Истина));
				
				Если СтрокиКодовСРазрешенныимДействием.Количество() = ТаблицаПроверенныхКодов.Количество() Тогда
					Результат.Результат = Истина;
				Иначе
					
					Результат.Результат = Ложь;
					
					Если ТипЗнч(КодМассивКодовМаркировки) = Тип("Массив") Тогда
						Результат.Сообщение = "Не все коды разрешены для операции " + Операция + ". Разрешено: " + Строка(СтрокиКодовСРазрешенныимДействием.Количество()) + " из " + Строка(ТаблицаПроверенныхКодов.Количество());
					Иначе
						Результат.Сообщение = ПричинаЗапрета;
					КонецЕсли;
					
				КонецЕсли;	
				
				Результат.Данные = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаПроверенныхКодов);   
				
			Иначе
				Результат.Сообщение = "Неизвестный формат ответа от ТС ПИоТ #2. " + ТекстОтвета;
			КонецЕсли;    
			
		Иначе
			Результат.Сообщение = "Неизвестный формат ответа от ТС ПИоТ #1. " + ТекстОтвета;
		КонецЕсли;  
		
	Иначе
				
		// Особые коды ошибок по документации
		Если HTTPОтвет.КодСостояния = 203 Тогда
			
			Результат.Сообщение = "Аварийный режим ТС ПИоТ, продажа разрешена";
			Результат.Результат = Истина; // По документации, при 203 продажа разрешается ♯а1с:1033
			
		ИначеЕсли HTTPОтвет.КодСостояния = 400 Тогда
			Результат.Сообщение = "Неверный формат запроса: " + Чеки.ВернутьJSON(ПараметрыЗапроса);
		ИначеЕсли HTTPОтвет.КодСостояния = 500 Тогда
			Результат.Сообщение = "Internal Server Error - внутренняя ошибка сервера при обработке запроса";		
		ИначеЕсли HTTPОтвет.КодСостояния = 504 Тогда
			Результат.Сообщение = "Gateway Timeout - превышено время ожидания ответа от upstream сервиса";	
		ИначеЕсли HTTPОтвет.КодСостояния = 514 Тогда
			Результат.Сообщение = "Таймаут: нет ответа от ГИС МТ и ЛМ ЧЗ";
		Иначе
			Результат.Сообщение = "Не получен ответ от сервиса ПИоТ. HTTP ошибка: " + HTTPОтвет.КодСостояния;
		КонецЕсли;      
		
	КонецЕсли;
	
	Если ПолученыДанныеПоКодамИзПИоТ Тогда
		
		Для Каждого Стр Из ТаблицаПроверенныхКодов Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИсторияКодовМаркировокПиОТ.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Дата = ТекущаяДата();
			МенеджерЗаписи.Успешно = Стр.ДействиеРезрешено;
			МенеджерЗаписи.Данные = ВернутьJSON(Стр.ДанныеКода);
			МенеджерЗаписи.Действие = Операция;
			МенеджерЗаписи.ПричинаЗапрета = Стр.ПричинаЗапрета;
			
			//+Сёмин Р.И. 08.09.2026 #UT10-6020
			МенеджерЗаписи.isCheckedOffline = ОтветПоКоду.isCheckedOffline;
			МенеджерЗаписи.reqId = ОтветПоКоду.reqId;
			МенеджерЗаписи.reqTimestamp = ОтветПоКоду.reqTimestamp;
			
			Если ОтветПоКоду.isCheckedOffline Тогда
				
				Если ОтветПоКоду.Свойство("inst") Тогда
					МенеджерЗаписи.inst = ОтветПоКоду.inst;
				КонецЕсли;
				
				Если ОтветПоКоду.Свойство("version") Тогда
					МенеджерЗаписи.version = ОтветПоКоду.version;
				КонецЕсли;
				
			КонецЕсли;
			//-Сёмин Р.И. 08.09.2026 #UT10-6020
			
			Если ЗначениеЗаполнено(Источник) Тогда
				МенеджерЗаписи.Документ = Источник;
			КонецЕсли;
			
			Если ТипЗнч(КодМассивКодовМаркировки) = Тип("Массив") Тогда
				
				СтрокиКодМаркировки = КодыМаркировкиДляПроверки.НайтиСтроки(Новый Структура("КороткийКодМаркировки", Стр.ДанныеКода.printView));
				
				Если ЗначениеЗаполнено(СтрокиКодМаркировки) Тогда
					МенеджерЗаписи.ШтрихкодНоменклатуры = СтрокиКодМаркировки.Получить(0).ШтрихкодНоменклатуры;
				КонецЕсли;
				
			Иначе
				МенеджерЗаписи.ШтрихкодНоменклатуры = КодМассивКодовМаркировки;
			КонецЕсли;
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Стр Из КодыМаркировкиДляПроверки Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИсторияКодовМаркировокПиОТ.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Дата = ТекущаяДата();
			МенеджерЗаписи.Успешно = Ложь;
			МенеджерЗаписи.Действие = Операция;
			МенеджерЗаписи.ПричинаЗапрета = Результат.Сообщение;
			
			Если ЗначениеЗаполнено(Источник) Тогда
				МенеджерЗаписи.Документ = Источник;
			КонецЕсли;
			
			МенеджерЗаписи.ШтрихкодНоменклатуры = Стр.ШтрихкодНоменклатуры;
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	//-Сёмин Р.И. 06.07.2026 #UT10-5935
	
КонецФункции

Процедура ДобавитьКодМаркировкиВТаблицуДляПроверкиПИоТ(КодМаркировки, ТаблицаКодовДляПроверки)
	
	//+Сёмин Р.И. 08.07.2026 #UT10-5935
	НовСтр = ТаблицаКодовДляПроверки.Добавить();
	НовСтр.ШтрихкодНоменклатуры = КодМаркировки;
	НовСтр.КороткийКодМаркировки = КодМаркировки.КодМаркировки;
	
	ПолныйКодМаркировки = КодМаркировки.ПолныйКодМаркировки.Получить();
	
	Если Найти(ПолныйКодМаркировки, "<GS>") = 0 И Найти(ПолныйКодМаркировки, Символ(29)) = 0 Тогда
		
		ПолныйКодМаркировки = ДобавитьВКодМаркировкиНедостающиеСимволы(ПолныйКодМаркировки);
		ПолныйКодМаркировки = СтрЗаменить(ПолныйКодМаркировки, "<GS>", Символ(29));
		
	КонецЕсли;
	
	НовСтр.ПолныйКодМаркировки = КодироватьСтрокуВBase64(ПолныйКодМаркировки);
	//-Сёмин Р.И. 08.07.2026 #UT10-5935
	
КонецПроцедуры

Функция ЗарегистрироватьПродажуВозвратПИоТ(КодМассивКодовМаркировки, АдресТСПиоТ, Действие = "Продажа", Событие = "", Источник = Неопределено, ИмяСобытияЖР = "РучнаяРегистрацияПродажиВозвратаПИоТ") Экспорт
	
	//+Сёмин Р.И. 07.07.2026 #UT10-5935
	Если ЗначениеЗаполнено(Событие) Тогда
		Операция = Событие;
	Иначе
		Операция = Действие;
	КонецЕсли;
	
	КодыМаркировкиДляРегистрации = Новый ТаблицаЗначений;
	КодыМаркировкиДляРегистрации.Колонки.Добавить("ШтрихкодНоменклатуры");
	КодыМаркировкиДляРегистрации.Колонки.Добавить("КороткийКодМаркировки");
	
	Если ТипЗнч(КодМассивКодовМаркировки) <> Тип("Массив") Тогда
		ДобавитьКодМаркировкиВТаблицуДляРегистрацииПИоТ(КодМассивКодовМаркировки, КодыМаркировкиДляРегистрации);
	Иначе
		
		Для Каждого Стр Из КодМассивКодовМаркировки Цикл
			ДобавитьКодМаркировкиВТаблицуДляРегистрацииПИоТ(Стр, КодыМаркировкиДляРегистрации);
		КонецЦикла;
		
	КонецЕсли;
	
	КодыМаркировкиRfc1738 = КодыМаркировкиДляРегистрации.ВыгрузитьКолонку("КороткийКодМаркировки");
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение, Данные", Ложь, "", Неопределено);
	
	НеУдалосьЗарегистрировать = Новый Массив;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("cis_list", КодыМаркировкиRfc1738);
		
	Если Действие = "Продажа" Тогда
		URL = "/api/v2/lmSell";  
	ИначеЕсли Действие = "Возврат" Тогда 
		URL = "/api/v2/lmReturn";
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		ИмяСобытияЖР,
		УровеньЖурналаРегистрации.Информация,
		?(ЗначениеЗаполнено(Источник), Источник.Метаданные(), ""),
		?(ЗначениеЗаполнено(Источник), Источник, ""),
		"В ПИоТ направлен запрос на регистрацию действия " + Действие + " по кодам:" + Символы.ПС + МодульРегламентныхЗаданий.СтрСоединить(КодыМаркировкиRfc1738, Символы.ПС)
	);
	
	ПолученыДанныеРегистрацииПИоТ = Ложь;
	   
	HTTPОтвет = OPI_ЗапросыHTTP.PostСТелом(АдресТСПиоТ + URL, ПараметрыЗапроса,,,Истина,,1,2);	
	
	Если HTTPОтвет.КодСостояния = 200 Тогда

		ТекстОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Ответ = ВернутьСтруктуруИзJSON(ТекстОтвета);
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖР,
			УровеньЖурналаРегистрации.Информация,
			?(ЗначениеЗаполнено(Источник), Источник.Метаданные(), ""),
			?(ЗначениеЗаполнено(Источник), Источник, ""),
			"Ответ из ПиОТ по действию " + Действие + " :" + ТекстОтвета 
		);
		
		//+Сёмин Р.И. 04.08.2026 #UT10-5994
		results = Неопределено;
		
		Если ТипЗнч(Ответ) = Тип("Массив") Тогда
			results = Ответ;
		ИначеЕсли ТипЗнч(Ответ) = Тип("Структура") Тогда
			
			Если НЕ Ответ.Свойство("results") Тогда
				СтруктураВозврата.Сообщение = "Неизвестный формат ответа от ТС ПИоТ #3. " + ТекстОтвета;
			Иначе
				results = Ответ.results;
			КонецЕсли;
			
		Иначе
			СтруктураВозврата.Сообщение = "Неизвестный формат ответа от ТС ПИоТ #4. " + ТекстОтвета;
		КонецЕсли;
		
		//Если НЕ Ответ.Свойство("results") Тогда
		//	СтруктураВозврата.Сообщение = "Неизвестный формат ответа от ТС ПИоТ #3. " + ТекстОтвета;
		//Иначе        
		
		Если results <> Неопределено Тогда
		//-Сёмин Р.И. 04.08.2026 #UT10-5994
		
			ПолученыДанныеРегистрацииПИоТ = Истина;
			
			ТаблицаЗарегистрированныхКодов = Новый ТаблицаЗначений; 
			ТаблицаЗарегистрированныхКодов.Колонки.Добавить("ДействиеРезрешено");
			ТаблицаЗарегистрированныхКодов.Колонки.Добавить("КодМаркировки");
			
			//Для Каждого Результат Из Ответ.results Цикл
			Для Каждого Результат Из results Цикл
				
				НСтр = ТаблицаЗарегистрированныхКодов.Добавить(); 
				
				Если Результат.Свойство("success") Тогда
					НСтр.ДействиеРезрешено = Результат.success;   				
				Иначе 
					
					//Если свойство success отсутствует, то действие уже было выполнено (т.е. запрос на регистрацию дейстия повторный)
					НСтр.ДействиеРезрешено = Истина;
					
				КонецЕсли;
				
				НСтр.КодМаркировки = Результат.cis;
				
				Если НЕ НСтр.ДействиеРезрешено Тогда
					НеУдалосьЗарегистрировать.Добавить(НСтр.КодМаркировки);
				КонецЕсли;
				
			КонецЦикла;     
			
			СтрокиКодовСРазрешенныимДействием = ТаблицаЗарегистрированныхКодов.НайтиСтроки(Новый Структура("ДействиеРезрешено", Истина));
			
			Если СтрокиКодовСРазрешенныимДействием.Количество() = ТаблицаЗарегистрированныхКодов.Количество() Тогда
				
				СтруктураВозврата.Результат = Истина;
				
				ЗаписьЖурналаРегистрации(
					ИмяСобытияЖР,
					УровеньЖурналаРегистрации.Информация,
					?(ЗначениеЗаполнено(Источник), Источник.Метаданные(), ""),
					?(ЗначениеЗаполнено(Источник), Источник, ""),
					"Регистрация в ПИоТ действия " + Действие + " выполнена успешно."
				);
				
			Иначе
				
				СтруктураВозврата.Сообщение = "Не все коды разрешены для действия " + Действие + ". Список запрещенных кодов:" + Символы.ПС + МодульРегламентныхЗаданий.СтрСоединить(НеУдалосьЗарегистрировать, Символы.ПС);
				
				ЗаписьЖурналаРегистрации(
					ИмяСобытияЖР,
					УровеньЖурналаРегистрации.Ошибка,
					?(ЗначениеЗаполнено(Источник), Источник.Метаданные(), ""),
					?(ЗначениеЗаполнено(Источник), Источник, ""),
					СтруктураВозврата.Сообщение
				);
				
			КонецЕсли;
			
			СтруктураВозврата.Данные = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗарегистрированныхКодов);
			
		КонецЕсли;
		
	Иначе
		
		СтруктураВозврата.Сообщение = "Ответ из ПиОТ по действию " + Действие + ": HTTP ошибка " + Строка(HTTPОтвет.КодСостояния);
		
		Попытка
			СтруктураВозврата.Сообщение = СтруктураВозврата.Сообщение + Символы.ПС + HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Исключение
		КонецПопытки;
		
		ЗаписьЖурналаРегистрации(
			ИмяСобытияЖР,
			УровеньЖурналаРегистрации.Ошибка,
			?(ЗначениеЗаполнено(Источник), Источник.Метаданные(), ""),
			?(ЗначениеЗаполнено(Источник), Источник, ""),
			СтруктураВозврата.Сообщение
		);
		
	КонецЕсли;
	
	Если ПолученыДанныеРегистрацииПИоТ Тогда
		
		Для Каждого Стр Из ТаблицаЗарегистрированныхКодов Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИсторияКодовМаркировокПиОТ.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Дата = ТекущаяДата();
			МенеджерЗаписи.Успешно = Стр.ДействиеРезрешено;
			МенеджерЗаписи.Действие = Операция;
			
			Если ЗначениеЗаполнено(Источник) Тогда
				МенеджерЗаписи.Документ = Источник;
			КонецЕсли;
			
			Если ТипЗнч(КодМассивКодовМаркировки) = Тип("Массив") Тогда
				
				СтрокиКодМаркировки = КодыМаркировкиДляРегистрации.НайтиСтроки(Новый Структура("КороткийКодМаркировки", Стр.КодМаркировки));
				
				Если ЗначениеЗаполнено(СтрокиКодМаркировки) Тогда
					МенеджерЗаписи.ШтрихкодНоменклатуры = СтрокиКодМаркировки.Получить(0).ШтрихкодНоменклатуры;
				КонецЕсли;
				
			Иначе
				МенеджерЗаписи.ШтрихкодНоменклатуры = КодМассивКодовМаркировки;
			КонецЕсли;
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		Для Каждого Стр Из КодыМаркировкиДляРегистрации Цикл
			
			МенеджерЗаписи = РегистрыСведений.ИсторияКодовМаркировокПиОТ.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Дата = ТекущаяДата();
			МенеджерЗаписи.Успешно = Ложь;
			МенеджерЗаписи.Действие = Операция;
			МенеджерЗаписи.ПричинаЗапрета = СтрЗаменить(СтруктураВозврата.Сообщение, Символы.ПС, " ");
			
			Если ЗначениеЗаполнено(Источник) Тогда
				МенеджерЗаписи.Документ = Источник;
			КонецЕсли;
			
			МенеджерЗаписи.ШтрихкодНоменклатуры = Стр.ШтрихкодНоменклатуры;
			
			Попытка
				МенеджерЗаписи.Записать();
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	//-Сёмин Р.И. 07.07.2026 #UT10-5935
	
КонецФункции

Процедура ДобавитьКодМаркировкиВТаблицуДляРегистрацииПИоТ(КодМаркировки, ТаблицаКодовДляРегистрации)
	
	//+Сёмин Р.И. 08.07.2026 #UT10-5935
	НовСтр = ТаблицаКодовДляРегистрации.Добавить();
	НовСтр.ШтрихкодНоменклатуры = КодМаркировки;
	НовСтр.КороткийКодМаркировки = КодироватьСтрокуВRFC1738(КодМаркировки.КодМаркировки);
	//-Сёмин Р.И. 08.07.2026 #UT10-5935
	
КонецПроцедуры

Функция ПолучитьТекстЗапросаМаркировокПоНоменклатуреСПроверкамиПИоТ()
	
	//+Сёмин Р.И. 09.09.2026 #UT10-6020
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Документ.КодМаркировки.Номенклатура КАК Номенклатура,
		|	Документ.КодМаркировки КАК ШК,
		|	ВЫБОР
		|		КОГДА Документ.Ссылка.ДоговорКонтрагента.ЛицевойСчет
		|				ИЛИ Документ.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
		|			ТОГДА ""itemPieceSold""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.УчастникОборота)
		|					ТОГДА ""itemPieceForSale""
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
		|					ТОГДА ""itemPieceSold""
		|				ИНАЧЕ ""itemPieceForSale""
		|			КОНЕЦ
		|	КОНЕЦ КАК itemEstimatedStatus,
		|	Документ.Ссылка.Дата КАК ДатаДокумента,
		|	Документ.Ссылка.Номер КАК НомерДокумента
		|ПОМЕСТИТЬ ВТ_Предварительная
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивДокументов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Документ.КодМаркировки.Номенклатура,
		|	Документ.КодМаркировки,
		|	ВЫБОР
		|		КОГДА Документ.Ссылка.ДоговорКонтрагента.ЛицевойСчет
		|				ИЛИ Документ.Ссылка.ДоговорКонтрагента.РозничнаяПродажа
		|			ТОГДА ""itemPieceSold""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.УчастникОборота)
		|					ТОГДА ""itemPieceForSale""
		|				КОГДА Документ.Ссылка.ДоговорКонтрагента.УсловияРаботыСЧЗ = ЗНАЧЕНИЕ(Перечисление.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд)
		|					ТОГДА ""itemPieceSold""
		|				ИНАЧЕ ""itemPieceForSale""
		|			КОНЕЦ
		|	КОНЕЦ,
		|	Документ.Ссылка.Дата,
		|	Документ.Ссылка.Номер
		|ИЗ
		|	Документ.КорректировкаРеализации.КодыМаркировки КАК Документ
		|ГДЕ
		|	Документ.Ссылка В(&МассивДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ИсторияКодовМаркировокПиОТ.Дата) КАК Дата,
		|	ИсторияКодовМаркировокПиОТ.ШтрихкодНоменклатуры
		|ПОМЕСТИТЬ ВТ_ДатыПроверокПИоТ
		|ИЗ
		|	РегистрСведений.ИсторияКодовМаркировокПиОТ КАК ИсторияКодовМаркировокПиОТ
		|ГДЕ
		|	ИсторияКодовМаркировокПиОТ.ШтрихкодНоменклатуры В
		|			(ВЫБРАТЬ
		|				ВТ_Предварительная.ШК
		|			ИЗ
		|				ВТ_Предварительная)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияКодовМаркировокПиОТ.ШтрихкодНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДатыПроверокПИоТ.ШтрихкодНоменклатуры,
		|	ВТ_ДатыПроверокПИоТ.Дата,
		|	ИсторияКодовМаркировокПиОТ.isCheckedOffline,
		|	ИсторияКодовМаркировокПиОТ.reqId,
		|	ИсторияКодовМаркировокПиОТ.reqTimestamp,
		|	ИсторияКодовМаркировокПиОТ.inst,
		|	ИсторияКодовМаркировокПиОТ.version
		|ПОМЕСТИТЬ ВТ_ПроверкиПИоТ
		|ИЗ
		|	ВТ_ДатыПроверокПИоТ КАК ВТ_ДатыПроверокПИоТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияКодовМаркировокПиОТ КАК ИсторияКодовМаркировокПиОТ
		|		ПО ВТ_ДатыПроверокПИоТ.ШтрихкодНоменклатуры = ИсторияКодовМаркировокПиОТ.ШтрихкодНоменклатуры
		|			И ВТ_ДатыПроверокПИоТ.Дата = ИсторияКодовМаркировокПиОТ.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Предварительная.Номенклатура,
		|	ВТ_Предварительная.ШК,
		|	ВТ_Предварительная.itemEstimatedStatus,
		|	ВТ_Предварительная.ДатаДокумента,
		|	ВТ_Предварительная.НомерДокумента,
		|	ЕСТЬNULL(ВТ_ПроверкиПИоТ.reqId, """") КАК reqId,
		|	ЕСТЬNULL(ВТ_ПроверкиПИоТ.reqTimestamp, 0) КАК reqTimestamp,
		|	ЕСТЬNULL(ВТ_ПроверкиПИоТ.isCheckedOffline, ЛОЖЬ) КАК isCheckedOffline,
		|	ЕСТЬNULL(ВТ_ПроверкиПИоТ.inst, """") КАК inst,
		|	ЕСТЬNULL(ВТ_ПроверкиПИоТ.version, """") КАК version
		|ИЗ
		|	ВТ_Предварительная КАК ВТ_Предварительная
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроверкиПИоТ КАК ВТ_ПроверкиПИоТ
		|		ПО ВТ_Предварительная.ШК = ВТ_ПроверкиПИоТ.ШтрихкодНоменклатуры";
	
	Возврат ТекстЗапроса;
	//-Сёмин Р.И. 09.09.2026 #UT10-6020
	
КонецФункции

Процедура ДобавитьКомментарий(Комментарий, Текст)
	
	Комментарий = ?(ПустаяСтрока(Комментарий), Строка(ТекущаяДата()) + ": (check) ", Комментарий + Символы.ПС) + Текст;
	
КонецПроцедуры




///////////////////Работа с кассами///////////////////
Процедура ОбновитьСтатусыКасс() Экспорт   
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		ЗаписьЖурналаРегистрации("Обновить статусы касс", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
	КонецЕсли;
	
	Если НЕ ИспользоватРегламентныеЗаданияДляРаботыССерверомЧеков() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Ссылка КАК Касса
	               |ИЗ
	               |	Справочник.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.ИД <> """"
	               |	И Кассы.ОбновлятьСтатусКассыССервера";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Чеки.ОбновитьСтатусКассыССервера(Выборка.Касса);
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ОбновитьСтатусКассыССервера(Касса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Начало выполнения функции получения статуса кассы");		
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение, СтатусСмены, КрышкаОткрыта, БумагаВставлена, Ошибка", Ложь, "", "", "", "", "");
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/operations/queryDeviceStatus?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		Соединение = Чеки.ПолучитьСоединениеССерверомЧеков(60);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получение статуса кассы с сервера: " + СерверОтправки + " выполнено успешно! " + Символы.ПС + Ответ);				
	Исключение
		ТекстОшибки = "Ошибка получения статуса кассы " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 200 Тогда
		
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния) + Символы.ПС + ВернутьОписаниеОшибкиОбновленияСтатусаКассы(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);
		
		Если ОтветHTTP.КодСостояния = 401 ИЛИ ОтветHTTP.КодСостояния = 403 ИЛИ ОтветHTTP.КодСостояния = 404 Тогда
			СтруктураВозврата.Ошибка = ВернутьОписаниеОшибкиОбновленияСтатусаКассы(ОтветHTTP.КодСостояния);
		Иначе
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	Иначе
	
		СтруктураСтатуса = ВернутьСтруктуруИзJSON(Ответ);
		
		Если СтруктураСтатуса.Свойство("deviceStatus") Тогда
			
			Если СтруктураСтатуса.deviceStatus.Свойство("shift") Тогда               			
				СтруктураВозврата.СтатусСмены = СтруктураСтатуса.deviceStatus.shift;
			КонецЕсли;
			
			Если СтруктураСтатуса.deviceStatus.Свойство("coverOpened") Тогда               			
				СтруктураВозврата.КрышкаОткрыта = СтруктураСтатуса.deviceStatus.coverOpened;
			КонецЕсли;
			
			Если СтруктураСтатуса.deviceStatus.Свойство("paperPresent") Тогда               			
				СтруктураВозврата.БумагаВставлена = СтруктураСтатуса.deviceStatus.paperPresent;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен успешный ответ запросе статуса кассы. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
		
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыКасс.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураВозврата);
	МенеджерЗаписи.Касса = Касса;
	МенеджерЗаписи.Записать(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Окончание выполнения функции открытия получения статуса кассы");		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура ПолучитьПараметрыФискальныхНакопителей() Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Получить параметры фискальников", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат; 
		
	КонецЕсли;
	
	Если НЕ ИспользоватРегламентныеЗаданияДляРаботыССерверомЧеков() Тогда
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Ссылка КАК Касса
	               |ИЗ
	               |	Справочник.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.ИД <> """"
	               |	И Кассы.ОбновлятьСтатусКассыССервера";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл		
		
		СтруктураВозврата = ПолучитьПараметрыФискальногоНакопителяПоКассе(Выборка.Касса);		
		
		Если СтруктураВозврата.Результат Тогда
			ЗаписьЖурналаРегистрации("Получение параметров фискальника", УровеньЖурналаРегистрации.Информация,,, "Параметры фискальника:" + ВернутьJSON(СтруктураВозврата.ПараметрыФискальника));
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьПараметрыФискальногоНакопителяПоКассе(Касса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Начало выполнения функции получения параметров фискальника");		
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение, ПараметрыФискальника", Ложь, "", Новый Структура());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/operations/queryFnInfo?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		
		Соединение = Чеки.ПолучитьСоединениеССерверомЧеков(60);
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получение параметров фискальника с сервера: " + СерверОтправки + " выполнено успешно! " + Символы.ПС + Ответ);				
		
	Исключение
		
		ТекстОшибки = "Ошибка получения статуса фискальника " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 200 Тогда
		
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);
		
		СтруктураВозврата.Ошибка = ТекстОшибки;
		Возврат СтруктураВозврата;
		
	Иначе
	
		СтруктураФискальника = ВернутьСтруктуруИзJSON(Ответ);
		
		ПараметрыФискальника = Новый Структура("id,validityDate,criticalError,memoryOverflow,needReplacement,ofdTimeout,resourceExhausted", Касса.ИД);
		
		ЗаполнитьЗначенияСвойств(ПараметрыФискальника, СтруктураФискальника.fnInfo.validity);		
		ЗаполнитьЗначенияСвойств(ПараметрыФискальника, СтруктураФискальника.fnInfo.warnings);		
		
		СтруктураВозврата.ПараметрыФискальника = ПараметрыФискальника;
		
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен успешный ответ запроса параметров фискальника. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
		
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Окончание выполнения функции получения параметров фискальника");		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОткрытьЗакрытьСмену(Касса, Закрыть = Ложь, Кассир = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Начало выполнения функции открытия закрытия смены");		
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");

	ГУИД = Строка(Новый УникальныйИдентификатор());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/requests?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		СтруктураJSON = СформироватьСтруктуруДляОткрытияЗакрытияСмены(ГУИД, ?(Закрыть, "ЗакрытиеСмены", "ОткрытиеСмены"), Кассир);
		СтрокаЗапросаJS = Чеки.ВернутьJSON(СтруктураJSON);
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Успешно сформирован JSON для отправки на сервер" + Символы.ПС + СтрокаЗапросаJS);		
	Исключение
		ТекстОшибки = "Ошибка формирования менеджера задания (JSON)" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапросаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Соединение = Чеки.ПолучитьСоединениеССерверомЧеков();
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Открытие закрытие смены " + СерверОтправки + " выполнено успешно! " + Символы.ПС + Ответ);		
	Исключение
		ТекстОшибки = "Ошибка открытия закрытия смены " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 201 Тогда
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	Иначе
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен успешный ответ при открытии закрытии смены. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	
	МенеджерЗаписи = РегистрыСведений.СтатусыКасс.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Касса = Касса;
	МенеджерЗаписи.СтатусСмены = ?(Закрыть, "closed", "opened");
	МенеджерЗаписи.Комментарий = ?(Закрыть, "Смена закрыта", "Смена открыта"); 
	Если ЗначениеЗаполнено(Кассир) Тогда
		МенеджерЗаписи.Пользователь = Кассир;
	Иначе 
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	МенеджерЗаписи.Записать(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Окончания выполнения функции открытия закрытия смены");		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ХОтчет(Касса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации("Операции с кассой.Начало", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Начало выполнения функции снятия Х-отчета");		
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");

	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");

	ГУИД = Строка(Новый УникальныйИдентификатор());
	
	HTTPЗапрос = Новый HTTPЗапрос();
	HTTPЗапрос.АдресРесурса = "/api/v2/requests?deviceID=" + Касса.ИД;
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");
	
	Попытка
		СтруктураJSON = СформироватьСтруктуруДляСнятияХОтчета(ГУИД);
		СтрокаЗапросаJS = Чеки.ВернутьJSON(СтруктураJSON);
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Успешно сформирован JSON для отправки на сервер" + Символы.ПС + СтрокаЗапросаJS);		
	Исключение
		ТекстОшибки = "Ошибка формирования менеджера задания (JSON)" + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	КонецПопытки;
	
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапросаJS, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Соединение = Чеки.ПолучитьСоединениеССерверомЧеков();
		ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Снятие Х-отчета " + СерверОтправки + " выполнено успешно! " + Символы.ПС + Ответ);		
	Исключение
		ТекстОшибки = "Ошибка снятия Х-отчета " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	КонецПопытки;

	Если Не ОтветHTTP.КодСостояния = 201 Тогда
		ТекстОшибки = "При получении ответа от сервера обнаружена ошибка. Код состояния " + Строка(ОтветHTTP.КодСостояния);
		СтруктураВозврата.Сообщение = ТекстОшибки;
		ЗаписьЖурналаРегистрации("Операции с кассой.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.Кассы, Касса, СтруктураВозврата.Сообщение);		
		Возврат СтруктураВозврата;
	Иначе
		ЗаписьЖурналаРегистрации("Операции с кассой.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Получен успешный ответ при снятии Х-отчета. Код состояния " + Строка(ОтветHTTP.КодСостояния));			
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
		
	ЗаписьЖурналаРегистрации("Операции с кассой.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Касса, "Окончания выполнения функции снятия Х-отчета");		
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьСтатусКассы(Касса) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураВозврата = Новый Структура("СтатусСмены, КрышкаОткрыта, БумагаВставлена, Комментарий, Ошибка", "", "", "", "", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыКассСрезПоследних.СтатусСмены,
	               |	СтатусыКассСрезПоследних.Комментарий,
	               |	СтатусыКассСрезПоследних.КрышкаОткрыта,
	               |	СтатусыКассСрезПоследних.БумагаВставлена,
	               |	СтатусыКассСрезПоследних.Ошибка
	               |ИЗ
	               |	РегистрСведений.СтатусыКасс.СрезПоследних(, Касса.ИД = &ИД) КАК СтатусыКассСрезПоследних";
	
	Запрос.УстановитьПараметр("ИД", Касса.ИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
				
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураВозврата;	
	
КонецФункции

Функция СформироватьСтруктуруДляОткрытияЗакрытияСмены(ГУИД, Операция, Кассир = Неопределено)
    
    Если Операция = "ОткрытиеСмены" Тогда
        ТипОперации = "openShift";
    ИначеЕсли Операция = "ЗакрытиеСмены" Тогда    
        ТипОперации = "closeShift";
    Иначе
        Возврат Неопределено;
    КонецЕсли;
    
    УИД = Формат(ТекущаяДата(),"ДФ=ддММггггЧЧммсс");
	
	Если Кассир <> Неопределено Тогда
		СтруктураОператор = Новый Структура("name", Строка(Кассир));
	Иначе
		СтруктураОператор = Новый Структура("name", Строка(ПараметрыСеанса.ТекущийПользователь));
	КонецЕсли;
    
    СтруктураЧека = Новый Структура;
    СтруктураЧека.Вставить("type", ТипОперации);
    СтруктураЧека.Вставить("operator", СтруктураОператор);
    
    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(СтруктураЧека);
    
    СтруктураJSON = Новый Структура();
    СтруктураJSON.Вставить("uuid", ГУИД);
    СтруктураJSON.Вставить("request", МассивПараметров);
    
    Возврат СтруктураJSON;
    
КонецФункции

Функция СформироватьСтруктуруДляСнятияХОтчета(ГУИД)
    
    ТипОперации = "reportX";
    
    СтруктураОператор = Новый Структура("name", Строка(ПараметрыСеанса.ТекущийПользователь));
    
    СтруктураЧека = Новый Структура;
    СтруктураЧека.Вставить("type", ТипОперации);
    СтруктураЧека.Вставить("operator", СтруктураОператор);
    
    МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(СтруктураЧека);
    
    СтруктураJSON = Новый Структура();
    СтруктураJSON.Вставить("uuid", ГУИД);
    СтруктураJSON.Вставить("request", МассивПараметров);
    
    Возврат СтруктураJSON;
    
КонецФункции

Процедура НапечататьСлипЧек(Документ, ПечататьВторойСлип = Ложь) Экспорт
	
	СлипНаПечать = Документ.ТекстСлипЧека;   
	ВторойСлипНаПечать = "";      
	
	СимволыРазделенияСлипЧеков = Константы.СимволыРазделенияСлипЧеков.Получить();
	
	Если ЗначениеЗаполнено(СимволыРазделенияСлипЧеков) Тогда
		
		НомерСтрокиОтреза = Найти(Документ.ТекстСлипЧека, СимволыРазделенияСлипЧеков);
		
		Если НомерСтрокиОтреза <> 0 Тогда
			
			СлипНаПечать = Лев(СлипНаПечать, НомерСтрокиОтреза - 1);		
			ВторойСлипНаПечать = Сред(Документ.ТекстСлипЧека, НомерСтрокиОтреза + СтрДлина(СимволыРазделенияСлипЧеков)); 
			
		Иначе
			
			ВторойСлипНаПечать = СлипНаПечать;	
			
		КонецЕсли;  
		
	Иначе 
		
		ВторойСлипНаПечать = СлипНаПечать;
		
	КонецЕсли;

	
	Чеки.ОтправитьНефискальныйЧекВОчередьНаПечать(СлипНаПечать, Документ.Касса);
	
	Если ПечататьВторойСлип Тогда
		Чеки.ОтправитьНефискальныйЧекВОчередьНаПечать(ВторойСлипНаПечать, Документ.Касса);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОписаниеСменыПоСтатусу(Статус) Экспорт
	
	Если Статус = "expired" Тогда
		Возврат "Смена истекла";
	ИначеЕсли Статус = "opened" Тогда
		Возврат "Смена открыта";
	ИначеЕсли Статус = "closed" Тогда
		Возврат "Смена закрыта";
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция МожноПечататьЧеки(Касса) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
	
	СтруктураВозвратаСтатуса = ПолучитьСтатусКассы(Касса);
	
	Если СтруктураВозвратаСтатуса.СтатусСмены = "expired" Тогда
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = "Смена превысила 24 часа";
	КонецЕсли;
	
	Если СтруктураВозвратаСтатуса.КрышкаОткрыта = "Да" Тогда
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = СтруктураВозврата.Сообщение + ?(ЗначениеЗаполнено(СтруктураВозврата.Сообщение), Символы.ПС, "") + "Открыта крышка кассового аппарата";
	КонецЕсли;
	
	Если СтруктураВозвратаСтатуса.БумагаВставлена = "Нет" Тогда
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = СтруктураВозврата.Сообщение + ?(ЗначениеЗаполнено(СтруктураВозврата.Сообщение), Символы.ПС, "") + "Не вставлена бумага в кассовый аппарат";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураВозвратаСтатуса.Ошибка) Тогда
		СтруктураВозврата.Результат = Ложь;
		СтруктураВозврата.Сообщение = СтруктураВозврата.Сообщение + ?(ЗначениеЗаполнено(СтруктураВозврата.Сообщение), Символы.ПС, "") + СтруктураВозвратаСтатуса.Ошибка;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции


///////////////////Работа с документами///////////////////
Процедура ОтправитьДокументНаПечать(Док, ВозвратПродажи = Ложь, Электронный = Истина) Экспорт 
	
	Если Чеки.ИспользоватьПечатьЧековЧерезСерверАМРВодитель() Тогда
		
		Если ЗначениеЗаполнено(Док.Касса.ИД) И Док.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
						
			ЗаписьЖурналаРегистрации("Печать чеков.Начало", УровеньЖурналаРегистрации.Информация,,"Начало отправки документов на печать");								
			
			Если Док.Ссылка.Проведен Тогда
				
				Если Док.ПозицииЧекККМ.Количество() = 0 Тогда 					
					ЗаполнитьСоставЧекаУДокументаСсылки(Док.Ссылка);	
				КонецЕсли;	
				
				МожноЛиПечататьСтруктура = Чеки.МожноПечататьЧеки(Док.Касса);
				
				Если Не МожноЛиПечататьСтруктура.Результат Тогда
					
					ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Док.Касса , "По кассе " + Строка(Док.Касса) + " в данный момент нельзя печатать чеки" + Символы.ПС + МожноЛиПечататьСтруктура.Сообщение + Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
					Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "prepare", МожноЛиПечататьСтруктура.Сообщение);
					
				Иначе      			
					
					РезультатПроверки = Чеки.ПоверитьКорректностьСоставаЧекаККМ(Док.Ссылка);
					
					Если Не РезультатПроверки.Результат Тогда
						Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "error", "При проверке корректности состава Чека ККМ обнаружены ошибки" + Символы.ПС + РезультатПроверки.Сообщение);						
					Иначе
						
						Если Электронный Тогда
							EmailКонтрагента = Чеки.ПолучитьEmail(Док.Контрагент);
						Иначе
							EmailКонтрагента = "Проверка не нужна";							
						КонецЕсли; 					
						
						//Из АРМ Водителя можно отправлять только электронные чеки
						Если Не ЗначениеЗаполнено(EmailКонтрагента) Тогда                                                                                          						
							Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "error", "У контрагента не заполнен Email для печати электронного чека");						
						Иначе  
							
							//+Белов А. 22.01.2026 #UT10-5638  
							//Для этих видов докуменов используем отложенную проверку по биллингу
							Если (ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
								ИЛИ ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации"))
								И Док.Ссылка.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг Тогда
								
								//+Белов А. 28.08.2026 #UT10-6002
								Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И Док.Ссылка.ДоговорКонтрагента.ЛицевойСчет Тогда
									
									Если РаботаСТоварамиНаДоставке.ТоварПередан(Док.Ссылка) Тогда						
										Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "check"); 
									Иначе
										ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Док.Ссылка.Метаданные(), Док.Ссылка , "Документ не был отправлен в очередь на печать. Ожидаем статус доставки - товар передан");								
									КонецЕсли;
									
								Иначе
								//-Белов А. 28.08.2026 #UT10-6002									
									Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "check");
								КонецЕсли;
								
							Иначе
							//-Белов А. 22.01.2026 #UT10-5638
								
								Если ВозвратПродажи Тогда
									СтруктураВозврата = Чеки.ОтправитьЧекНаВозвратВОчередьНаПечать(Док.Ссылка, Электронный);
								Иначе
									СтруктураВозврата = Чеки.ОтправитьЧекВОчередьНаПечать(Док.Ссылка, Электронный);	
									
									Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
										ОтправитьЧекиИзПлатежногоДокументаПоРеализациям(Док.Ссылка);	
									КонецЕсли;
									
								КонецЕсли;							
								
								Если НЕ СтруктураВозврата.Результат Тогда
									
									ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Док.Ссылка.Метаданные(), Док.Ссылка , "Документ не был отправлен в очередь на печать" + Символы.ПС + СтруктураВозврата.Сообщение + Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
									Чеки.ЗаписатьНовоеЗадание(Док.Ссылка, "prepare", СтруктураВозврата.Сообщение);  
									
								КонецЕсли; 							
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Док.Ссылка.Метаданные(), Док.Ссылка, "Документ был записан, но не проведен. Чек не был отправлен на печать в ККМ");		
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация,,, "Окончание отправки документов на печать");								
			
		КонецЕсли;		
		
	КонецЕсли;    
		
КонецПроцедуры

Функция ПолучитьРеализациюПоКорректировке(Знач Корректировка)
	
	Реализация = Неопределено;
	ДокументПроверки = Корректировка;
	
	Пока Не ЗначениеЗаполнено(Реализация) Цикл
		
		Если НЕ ЗначениеЗаполнено(ДокументПроверки.ДокументРеализации) Тогда
			
			Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			Прервать; 
			
		ИначеЕсли ТипЗнч(ДокументПроверки.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Реализация = ДокументПроверки.ДокументРеализации;
		Иначе
			ДокументПроверки = ДокументПроверки.ДокументРеализации;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Реализация;
	
КонецФункции  

Процедура ЗаполнитьФормуДляПечатиЧеков(ЭтотОбъект, ЭлементыФормы) Экспорт 
	
	Если НЕ ЭтотОбъект.ЭтоНовый() И Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
		
		СтатусЗаданияНаПечать = Чеки.ПолучитьСтатусЗаданияПечатиПКО(ЭтотОбъект.Ссылка);
		
		Если СтатусЗаданияНаПечать = "error" Тогда
			ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Чек.Текст = "Чек (возникли ошибки при печати)";	
		КонецЕсли;
		
	КонецЕсли;  
	
	РезультатПроверки = Истина;	
	
	Если ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда      
		
		РезультатПроверки = Чеки.ПоверитьКорректностьЗаполненияРеализации(ЭтотОбъект).Результат; 
		
		Если ЭтотОбъект.ЭтоНовый() Тогда
			ЭтотОбъект.Касса = Константы.ОсновнаяКассаДляПечатиЧеков.Получить();		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ЭтотОбъект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда                        
		
		РезультатПроверки = Чеки.ПоверитьКорректностьЗаполненияКорректировкиРеализации(ЭтотОбъект).Результат; 
		
		Если ЭтотОбъект.ЭтоНовый() Тогда
			ЭтотОбъект.Касса = Константы.ОсновнаяКассаДляПечатиЧеков.Получить();		
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не РезультатПроверки Тогда
		
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.Чек.Доступность = Ложь;		
		ЭлементыФормы.ОсновнаяПанель.Страницы.ЧекККМ.Видимость = Ложь;
		
	КонецЕсли;  
   	
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаУДокументаСсылки(Документ) Экспорт
	
	ДокументОбъект = Документ.ПолучитьОбъект();           
	
	ЗаполнитьСоставЧекаУДокументаОбъекта(ДокументОбъект);		
	 
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
КонецПроцедуры

Процедура ЗаполнитьСоставЧекаУДокументаОбъекта(ДокументОбъект) Экспорт
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		ЗаполнитьСоставЧекаККМДляРеализации(ДокументОбъект);
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаРеализации") Тогда
		ЗаполнитьСоставЧекаККМДляКорректировкиРеализации(ДокументОбъект);           
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		ЗаполнитьСоставЧекаККМДляПКО(ДокументОбъект);                              
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		ЗаполнитьСоставЧекаККМДляРКО(ДокументОбъект);
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОплатаОтПокупателяПлатежнойКартой") Тогда
		
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя Тогда
			ЗаполнитьСоставЧекаККМДляОПК_Оплата(ДокументОбъект);  
		Иначе
			ЗаполнитьСоставЧекаККМДляОПК_Возврат(ДокументОбъект);
		КонецЕсли;
	
	КонецЕсли;   

КонецПроцедуры

Процедура ОтправитьЧекиИзПлатежногоДокументаПоРеализациям(ПлатежныйДокумент) Экспорт 
	
	Если НЕ ПлатежныйДокументЛицевойСчет(ПлатежныйДокумент) Тогда
		Возврат;	
	КонецЕсли;
	
	ТаблицаРеализацийНаПечать = ПолучитьТаблицуРеализацийДляПечатиЧекаИзПлатежногоДокумента(ПлатежныйДокумент);
	
	Для каждого СтрТаблицы Из ТаблицаРеализацийНаПечать Цикл 
		
		Если Не СтрТаблицы.НаПечать Тогда
			Продолжить;	
		КонецЕсли;   
		
		Документ = СтрТаблицы.Документ;
		
		ДокументОб = Документ.ПолучитьОбъект();
		ЗаполнитьСоставЧекаККМДляРеализации(ДокументОб);  
		ДокументОб.ОбменДанными.Загрузка = Истина;
		ДокументОб.Записать();    
		
		//+Белов А. 22.01.2026 #UT10-5638
		//Чеки.ОтправитьЧекВОчередьНаПечать(Документ, Истина);
		Если Не Документ.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг Тогда
			Чеки.ОтправитьЧекВОчередьНаПечать(Документ, Истина);
		Иначе
			
			//+Белов А. 28.08.2026 #UT10-6002
			//Чеки.ЗаписатьНовоеЗадание(Документ, "check"); 
			Если Документ.ДоговорКонтрагента.ЛицевойСчет Тогда
				
				Если РаботаСТоварамиНаДоставке.ТоварПередан(Документ) Тогда						
					Чеки.ЗаписатьНовоеЗадание(Документ, "check");								
				КонецЕсли; 
				
			Иначе
				Чеки.ЗаписатьНовоеЗадание(Документ, "check");								
			КонецЕсли;  		
			//-Белов А. 28.08.2026 #UT10-6002
			
		КонецЕсли;
		//-Белов А. 22.01.2026 #UT10-5638
			
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьТаблицуРеализацийДляПечатиЧекаИзПлатежногоДокумента(ПлатежныйДокумент)
	
	ТаблицаВозврата = Новый ТаблицаЗначений;
	ТаблицаВозврата.Колонки.Добавить("Документ");
	ТаблицаВозврата.Колонки.Добавить("НаПечать");
	ТаблицаВозврата.Колонки.Добавить("ТекстОшибки");	
	
	Для каждого СтрРасшифровки Из ПлатежныйДокумент.РасшифровкаПлатежа Цикл
		
		Документ = СтрРасшифровки.ДокументРасчетовСКонтрагентом;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			НСтр = ТаблицаВозврата.Добавить();
			НСтр.Документ = Документ;
			НСтр.НаПечать = Ложь;
			
			Если ЗначениеЗаполнено(Документ.НомерЧекаККМ) Тогда				
				НСтр.ТекстОшибки = "У реализации уже заполнен номер чека ККМ";
			ИначеЕсли Не Документ.ДоговорКонтрагента.ЛицевойСчет Тогда
				НСтр.ТекстОшибки = "У договора не стоит галка Лицевой счет";				
			Иначе   
				
				СтатусЗаданияНаПечатьПоРеализации = ПолучитьСтатусЗаданияПечатиПКО(Документ); 
				
				Если ЗначениеЗаполнено(СтатусЗаданияНаПечатьПоРеализации) И (Найти(СтатусЗаданияНаПечатьПоРеализации, "error") = 0) Тогда
					НСтр.ТекстОшибки = "Реализация уже отправлена на печать";				
				//+Белов А. 22.01.2026 #UT10-5638
				//ИначеЕсли Не ВсяРеализацияПогашена(Документ) Тогда
				ИначеЕсли Не Документ.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг И Не ВсяРеализацияПогашена(Документ) Тогда
				//-Белов А. 22.01.2026 #UT10-5638	
					НСтр.ТекстОшибки = "Реализация не погашена полностью платежными документами";				
				Иначе
					НСтр.НаПечать = Истина;	
				КонецЕсли; 
				
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ТаблицаВозврата;
	
КонецФункции

Функция ПлатежныйДокументЛицевойСчет(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		
		Если ЗначениеЗаполнено(Документ.ДоговорКонтрагента) Тогда
			Возврат Документ.ДоговорКонтрагента.ЛицевойСчет;                     
		Иначе    
			
			Если Документ.РасшифровкаПлатежа.Количество() > 0 Тогда
				
				ЭтоЛицевойСчет = Истина;
				ЕстьДоговорВРасшифровке = Ложь;
				
				//Проверяем что все договоры - это лицевой счет
				Для каждого СтрокаРасшифровки Из Документ.РасшифровкаПлатежа Цикл  
					
					Если ЗначениеЗаполнено(СтрокаРасшифровки.ДоговорКонтрагента) Тогда
						
						ЕстьДоговорВРасшифровке = Истина;
						
						Если Не СтрокаРасшифровки.ДоговорКонтрагента.ЛицевойСчет Тогда
							ЭтоЛицевойСчет = Ложь;	
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Возврат ЭтоЛицевойСчет И ЕстьДоговорВРасшифровке;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.ОплатаОтПокупателяПлатежнойКартой") Тогда
		
		Если Документ.РасшифровкаПлатежа.Количество() > 0 Тогда
			Возврат Документ.РасшифровкаПлатежа[0].ДоговорКонтрагента.ЛицевойСчет;	
		КонецЕсли;
		
	КонецЕсли;                                                                     
	
	Возврат Ложь;
		
КонецФункции

Функция ПолучитьСписокРТУБезЧека(Организация, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	СписокРеализаций = Новый СписокЗначений;
	СписокРТУ = Новый МенеджерВременныхТаблиц;
	
	ДатаПереходаНаРаботуСЛицевымиСчетами = Константы.ДатаПереходаНаРаботуСЛицевымиСчетами.Получить();
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		Если ДатаНачала < ДатаПереходаНаРаботуСЛицевымиСчетами Тогда
			ДатаНачала = ДатаПереходаНаРаботуСЛицевымиСчетами;	
		КонецЕсли;
		
	Иначе
		ДатаНачала = ДатаПереходаНаРаботуСЛицевымиСчетами;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	ЗапросРТУ = Новый Запрос;
	ЗапросРТУ.МенеджерВременныхТаблиц = СписокРТУ;
	//Марков И. 23.06.2025 #UT10-5298 Добавлено условия для проверки связи КРТУ и РТУ
	ЗапросРТУ.Текст = 
	"ВЫБРАТЬ
	|	РТУ.Ссылка КАК Ссылка,
	|	РТУ.СуммаДокумента КАК РеквизитСумма
	|ПОМЕСТИТЬ СписокРТУ
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РТУ
	|ГДЕ
	|	РТУ.Проведен
	|	И РТУ.НомерЧекаККМ = 0
	|	И РТУ.ДоговорКонтрагента.ЛицевойСчет
	|	И РТУ.Организация = &Организация
	|	И РТУ.ДоговорКонтрагента.ДатаНачалаРаботыЛицевогоСчета <= РТУ.Дата
	|	И РТУ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор КАК Корректировка,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом КАК Реализация
	|ПОМЕСТИТЬ ВТ_КорректировкиРеализации
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДокументРасчетовСКонтрагентом В
	|				(ВЫБРАТЬ
	|					СписокРТУ.Ссылка
	|				ИЗ
	|					СписокРТУ)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|	И ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор.ДокументРеализации = ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(КорректировкаРеализацииТовары.КоличествоДоКорректировки - КорректировкаРеализацииТовары.Количество, 0) * -1) КАК КоличествоСкорректировано,
	|	ВТ_КорректировкиРеализации.Реализация
	|ПОМЕСТИТЬ ВТ_КоличествоСкорректированоПоРеализациям
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КорректировкиРеализации КАК ВТ_КорректировкиРеализации
	|		ПО КорректировкаРеализацииТовары.Ссылка = ВТ_КорректировкиРеализации.Корректировка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КорректировкиРеализации.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
	|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_КоличествоПоРеализациям
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокРТУ.Ссылка
	|			ИЗ
	|				СписокРТУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка КАК Реализация,
	|	СУММА(РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.СуммаВзаиморасчетов) КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВТ_СуммыПоТабЧастиРеализаций
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДокументыРасчетовСКонтрагентом КАК РеализацияТоваровУслугДокументыРасчетовСКонтрагентом
	|ГДЕ
	|	РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка В
	|			(ВЫБРАТЬ
	|				СписокРТУ.Ссылка
	|			ИЗ
	|				СписокРТУ)
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТоваровУслугДокументыРасчетовСКонтрагентом.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокРТУ.Ссылка КАК Ссылка
	|ИЗ
	|	СписокРТУ КАК СписокРТУ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПоТабЧастиРеализаций КАК ВТ_СуммыПоТабЧастиРеализаций
	|		ПО СписокРТУ.Ссылка = ВТ_СуммыПоТабЧастиРеализаций.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|				,
	|				ДокументРасчетовСКонтрагентом В
	|					(ВЫБРАТЬ
	|						СписокРТУ.Ссылка
	|					ИЗ
	|						СписокРТУ)) КАК Взаиморасчеты
	|		ПО СписокРТУ.Ссылка = Взаиморасчеты.ДокументРасчетовСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоПоРеализациям КАК ВТ_КоличествоПоРеализациям
	|		ПО СписокРТУ.Ссылка = ВТ_КоличествоПоРеализациям.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоСкорректированоПоРеализациям КАК ВТ_КоличествоСкорректированоПоРеализациям
	|		ПО СписокРТУ.Ссылка = ВТ_КоличествоСкорректированоПоРеализациям.Реализация
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ЕСТЬNULL(ВТ_СуммыПоТабЧастиРеализаций.СуммаВзаиморасчетов, 0) <> СписокРТУ.Ссылка.СуммаДокумента
	|					И НЕ ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0) = 0
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ЕСТЬNULL(ВТ_КоличествоСкорректированоПоРеализациям.КоличествоСкорректировано, 0) * -1 <> ЕСТЬNULL(ВТ_КоличествоПоРеализациям.Количество, 0)
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СписокРТУ.Ссылка.Дата";
	 
	ЗапросРТУ.УстановитьПараметр("Организация", Организация);
	ЗапросРТУ.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросРТУ.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = ЗапросРТУ.Выполнить();
	
	Если НЕ(Результат.Пустой()) Тогда
		
		Массив = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		СписокРеализаций.ЗагрузитьЗначения(Массив);
		
	КонецЕсли;
	
	Возврат СписокРеализаций;
	
КонецФункции

Функция ПолучитьСписокКРТУБезЧека(Организация, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	СписокКорректировок = Новый СписокЗначений;
	СписокКРТУ = Новый МенеджерВременныхТаблиц;
	
	ДатаПереходаНаРаботуСЛицевымиСчетами = Константы.ДатаПереходаНаРаботуСЛицевымиСчетами.Получить();
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		
		Если ДатаНачала < ДатаПереходаНаРаботуСЛицевымиСчетами Тогда
			ДатаНачала = ДатаПереходаНаРаботуСЛицевымиСчетами;	
		КонецЕсли;
		
	Иначе
		ДатаНачала = ДатаПереходаНаРаботуСЛицевымиСчетами;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	ЗапросКРТУ = Новый Запрос;
	ЗапросКРТУ.МенеджерВременныхТаблиц = СписокКРТУ;
	ЗапросКРТУ.Текст = 
	"ВЫБРАТЬ
	|	КРТУ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КРТУ
	|ГДЕ
	|	КРТУ.Проведен
	|	И КРТУ.НомерЧекаККМ = 0
	|	И КРТУ.ДоговорКонтрагента.ЛицевойСчет
	|	И КРТУ.Организация = &Организация
	|	И НЕ КРТУ.ДокументРеализации ЕСТЬ NULL
	|	И (КРТУ.ДокументРеализации ССЫЛКА Документ.РеализацияТоваровУслуг
	|			ИЛИ КРТУ.ДокументРеализации ССЫЛКА Документ.КорректировкаРеализации)
	|	И КРТУ.ДокументРеализации.НомерЧекаККМ <> 0
	|	И КРТУ.ДоговорКонтрагента.ДатаНачалаРаботыЛицевогоСчета <= КРТУ.Дата
	|	И КРТУ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	ЗапросКРТУ.УстановитьПараметр("Организация", Организация);
	ЗапросКРТУ.УстановитьПараметр("ДатаНачала", ДатаНачала);
	ЗапросКРТУ.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = ЗапросКРТУ.Выполнить();
	
	Если НЕ(Результат.Пустой()) Тогда
		
		Массив = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
		СписокКорректировок.ЗагрузитьЗначения(Массив);
		
	КонецЕсли;
	
	Возврат СписокКорректировок;
	
КонецФункции


///////////////////Отправка копии чеков///////////////////
Процедура ОтправкаКопииЧеков() Экспорт
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Не ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		Сообщить("Не заполнена основная учетная запись электнонной почты");
		Возврат;
		
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Константы.СБИС_ИдентификаторКлиента.Получить()) Тогда
		
		Сообщить("Не заполнен идентификатор клиента");
		Возврат;
		
	КонецЕсли;
	
	ПользовательДляОтправки = Неопределено;
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		
		Для каждого Доступ Из УчетнаяЗапись.ДоступКУчетнойЗаписи Цикл
			
			Если Доступ.Администрирование Тогда
				
				ПользовательДляОтправки = Доступ.Пользователь;	
				Прервать;
				
			КонецЕсли; 			
			
		КонецЦикла;    		
		
	КонецЕсли;
	
	Если ПользовательДляОтправки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьОтправкиКопииЧеков.Период,
	|	ОчередьОтправкиКопииЧеков.Email КАК Email,
	|	ОчередьОтправкиКопииЧеков.Документ КАК Документ,
	|	ОчередьОтправкиКопииЧеков.Статус
	|ИЗ
	|	РегистрСведений.ОчередьОтправкиКопииЧеков КАК ОчередьОтправкиКопииЧеков
	|ГДЕ
	|	(ОчередьОтправкиКопииЧеков.Статус = ""ВОчереди""
	|			ИЛИ ВЫБОР
	|				КОГДА ОчередьОтправкиКопииЧеков.Статус = ""Ошибка""
	|					ТОГДА ОчередьОтправкиКопииЧеков.КоличествоПопыток < 2
	|			КОНЕЦ)
	|ИТОГИ ПО
	|	Email,
	|	Документ"; 
	
	СоответствиеЭлектронныхПисем = Новый Соответствие;
	
	ВыборкаПочта = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Email");
	
	Пока ВыборкаПочта.Следующий() Цикл        
		
		МассивМенеджеровЗаписей = Новый Массив;
		
		НовоеПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент(); 
		НовоеПисьмо.Дата = ТекущаяДата();
		НовоеПисьмо.ЗаголовокПисьма = "Копии чеков";
		НовоеПисьмо.Тема            = "Запрос копии чеков от " + Формат(ТекущаяДата(), "ДЛФ=DT");  
		НовоеПисьмо.Кому		    = ВыборкаПочта.Email;
		НовоеПисьмо.УчетнаяЗапись   = УчетнаяЗапись; 
		НовоеПисьмо.СтатусПисьма    = Перечисления.СтатусыПисем.Исходящее;
		НовоеПисьмо.ЕстьВложения    = Истина;  
		НовоеПисьмо.УстановитьСсылкуНового(Документы.ЭлектронноеПисьмо.ПолучитьСсылку(Новый УникальныйИдентификатор()));
		
		Получатель = НовоеПисьмо.КомуТЧ.Добавить();
		Получатель.АдресЭлектроннойПочты = ВыборкаПочта.Email;
		
		МассивФайлов = Новый Массив;
		
		ВыборкаДокумента = ВыборкаПочта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Документ");
		
		Пока ВыборкаДокумента.Следующий() Цикл
			
			БылаОшибка = Ложь;
			Отменено = Ложь;
			ТекстОшибки = "";
			
			Попытка
				
				СтруктураЧека = ПолучитьЧекПоДокументу(ВыборкаДокумента.Документ);
				
				Отменено = СтруктураЧека.Отменено;	
				БылаОшибка = Не СтруктураЧека.Результат;
				
				Если СтруктураЧека.Результат Тогда					
									
					ИмяФайла = КаталогВременныхФайлов() + Формат(ВыборкаДокумента.Документ.НомерЧекаККМ, "ЧГ=0") + ".pdf"; 
					СтруктураЧека.Данные.Записать(ИмяФайла);
					
					МассивФайлов.Добавить(ИмяФайла);
										
				Иначе
					ТекстОшибки = СтруктураЧека.Сообщение;					
				КонецЕсли;
				
			Исключение           
				
			    БылаОшибка = Истина;
				ТекстОшибки = ОписаниеОшибки();
				
			КонецПопытки;
					
			ВыборкаДетальные = ВыборкаДокумента.Выбрать();
			
			Пока ВыборкаДетальные.Следующий() Цикл
				
				Запись = РегистрыСведений.ОчередьОтправкиКопииЧеков.СоздатьМенеджерЗаписи();
				Запись.Документ = ВыборкаДокумента.Документ; 
				Запись.Период = ВыборкаДетальные.Период;
				Запись.Статус = ?(БылаОшибка, ?(Отменено, "Отменено", "Ошибка"), "Отправлено"); 
				Запись.Email = ВыборкаПочта.Email;
				Запись.КоличествоПопыток = Запись.КоличествоПопыток + ?(ВыборкаДетальные.Статус = "Ошибка", 1, 0); 
				Запись.ДатаОбновленияСтатуса = ТекущаяДата();
				Запись.ТекстОшибки = ТекстОшибки;  
				
				МассивМенеджеровЗаписей.Добавить(Запись);
				
			КонецЦикла;
			
		КонецЦикла;                                   
		
		Если МассивФайлов.Количество() > 0 Тогда
			
			ИмяВременногоФайлаАрхива = ПолучитьИмяВременногоФайла("zip");
			ИмяФайла = "Чеки.zip";   
			
			ЗаписьZIP = Новый ЗаписьZipФайла(ИмяВременногоФайлаАрхива,,, МетодСжатияZIP.Сжатие, УровеньСжатияZIP.Оптимальный);
			
			Для каждого Файл Из МассивФайлов Цикл
				ЗаписьZIP.Добавить(Файл);	
			КонецЦикла; 
			
			ЗаписьZIP.Записать();
			
			НовыйФайл = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
			
			ПолученныйФайл = Новый Файл(ИмяВременногоФайлаАрхива);
			НовыйФайл = Справочники.ВложенияЭлектронныхПисем.СоздатьЭлемент();
			НовыйФайл.Объект = НовоеПисьмо.ПолучитьСсылкуНового();
			НовыйФайл.ИмяФайла = ИмяФайла;
			НовыйФайл.Наименование = ИмяФайла;
			НовыйФайл.Хранилище = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПолученныйФайл.ПолноеИмя), Новый СжатиеДанных());
			НовыйФайл.Записать();
			
			НовоеПисьмо.Записать();
			
			Для каждого Запись Из МассивМенеджеровЗаписей Цикл
				Запись.Записать(Истина);	
			КонецЦикла;
						
			СоответствиеЭлектронныхПисем.Вставить(НовоеПисьмо.Ссылка);  
			
			УдалитьФайлы(ИмяВременногоФайлаАрхива); 
			
			Для каждого Файл Из МассивФайлов Цикл
				УдалитьФайлы(Файл); 
			КонецЦикла; 
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Если СоответствиеЭлектронныхПисем.Количество() > 0 Тогда
		УправлениеЭлектроннойПочтой.ОтправитьПисьма(СоответствиеЭлектронныхПисем, глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), ПользовательДляОтправки);		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЧекПоДокументу(Документ) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Отменено, Сообщение, Данные", Ложь, Ложь, "", Неопределено);
	
	Если Не ЗначениеЗаполнено(Документ.НомерЧекаККМ) Тогда
		
		СтруктураВозврата.Отменено = Истина;
		СтруктураВозврата.Сообщение = "У документа не заполнен реквизит НомерЧекаККМ";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;  
	
	НомерЧекаККМ = Документ.НомерЧекаККМ;
	
	СтруктураПечати = ПолучитьИнформациюПоПечати(Документ);
	
	Если Не ЗначениеЗаполнено(СтруктураПечати.ДатаПечати) Тогда
		
		СтруктураВозврата.Отменено = Истина;
		СтруктураВозврата.Сообщение = "Не удалось получить по документу данные по печати чека";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли; 	
		
	ДатаПечати = СтруктураПечати.ДатаПечати;
	ГУИД = СтруктураПечати.ГУИД; 
	
	СтруктураРегНомера = ПолучитьРегистрационныйНомерККТ(ДатаПечати, ГУИД, Документ);
	
	Если Не СтруктураРегНомера.Результат Тогда
		
		СтруктураВозврата.Сообщение = "Не удалось получить регистрационный номер ККМ: " + СтруктураРегНомера.Сообщение;
		
		Возврат СтруктураВозврата;

	КонецЕсли;
	
	РегистрационныйНомер = СтруктураРегНомера.Номер;
	
	СтруктураАутификации = ПолучитьПараметрыАутификацииииСБИС();	
	
	Если Не СтруктураАутификации.Результат Тогда 	                 
		
		СтруктураВозврата.Сообщение = "Проблемы при аутификации в СБИС: " + СтруктураАутификации.Сообщение;	
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;     
	
	SID = СтруктураАутификации.Данные.sid; 
	ИНН = Константы.ОсновнаяОрганизация.Получить().ИНН;
	
	СтруктураФискальногоНакопителя = ПолучитьНомерФискальногоНакопителя(РегистрационныйНомер, ДатаПечати, SID, ИНН);
	
	Если Не СтруктураФискальногоНакопителя.Результат Тогда
		
		СтруктураВозврата.Сообщение = "Проблемы при получении номера накопителя: " + СтруктураФискальногоНакопителя.Сообщение;	
		
		Возврат СтруктураВозврата;
		
	КонецЕсли; 
	
	НомерНакопителя = СтруктураФискальногоНакопителя.Номер;
		
	HTTPСоединение = Новый HTTPСоединение("api.sbis.ru", , , , , 10, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	HTTPЗапрос = Новый HTTPЗапрос("/ofd/v1/orgs/" + Строка(ИНН) + "/kkts/" + Строка(РегистрационныйНомер) + "/storages/" + Строка(НомерНакопителя) + "/docs/" + Формат(НомерЧекаККМ, "ЧГ=0") + "?docDate=" + Формат(ДатаПечати, "ДФ=yyyy-MM-ddT00:00:00") + "&format=pdf"); 	
	HTTPЗапрос.Заголовки.Вставить("Cookie", "sid=" + SID);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ОтветСтрока = Ответ.ПолучитьТелоКакСтроку();   
		
		СтруктураВозврата.Сообщение = ОтветСтрока; 
		Возврат СтруктураВозврата;
				
	КонецЕсли;   
	
	ДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные();
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Данные = ДвоичныеДанные; 
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьИнформациюПоПечати(Документ)
	
	СтруктураВозврата = Новый Структура("ДатаПечати, ГУИД", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ГУИД,
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ДатаОбновления КАК ДатаПечати
	|ИЗ
	|	РегистрСведений.ЗаданияНаПробитиеЧека.СрезПоследних(
	|			,
	|			ПКО = &Документ
	|				И Статус = ""ready"") КАК ЗаданияНаПробитиеЧекаСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
		
КонецФункции

Функция ПолучитьРегистрационныйНомерККТ(ДатаПечати, ГУИД, Документ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ДатаПечати < (ТекущаяДата() - 86400*29) Тогда
		ГУИД = ПолучитьПоследнийНапечатанныйГУИДПоКассе(Документ.Касса);		
	КонецЕсли;
	
	СерверОтправки = Константы.АтолАдресВебСервера.Получить() + ":" + Формат(Константы.АтолПортВебСервера.Получить(), "ЧГ=0");
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение, Номер, КодОшибки", Ложь, "", "", 0, 0);
	
	ЧтениеJSON = Новый ЧтениеJSON;
	Результат = ПолучитьСоединениеССерверомЧеков();
	НовыйЗапрос = Новый HTTPЗапрос("/api/v2/requests/" + ГУИД + "?deviceID=" + Документ.Касса.ИД);
	
	Попытка
		
		НовыйОтвет = Результат.Получить(НовыйЗапрос);
		
		Если НовыйОтвет.КодСостояния <> 200 Тогда
			
			ТекстОшибки = "Код ошибки " + Строка(НовыйОтвет.КодСостояния);
			СтруктураВозврата.Сообщение = ТекстОшибки; 
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;

		Тело = НовыйОтвет.ПолучитьТелоКакСтроку();
		ЧтениеJSON.УстановитьСтроку(Тело);
		Данные = ПрочитатьJSON(ЧтениеJSON);
	
	Исключение
		
		ТекстОшибки = "Обнаружены ошибки при получении ответа от сервера " + СерверОтправки + Символы.ПС + ОписаниеОшибки();
		СтруктураВозврата.Сообщение = ТекстОшибки;	
		
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	Если Данные.Свойство("results") И Данные.results.Количество() > 0 Тогда
		
		Результат = Данные.results[0];
		
		Если Результат.status = "error" Тогда
			СтруктураВозврата.Сообщение = Результат.error.description + ". КодОшибки " + Строка(Результат.error.code);	
		ИначеЕсли Результат.status = "ready" Тогда
			
			СтруктураВозврата.Сообщение = "Номер успешно получен";				
			СтруктураВозврата.Номер = Результат.result.fiscalParams.registrationNumber;    
			СтруктураВозврата.Результат = Истина;
			
		Иначе   
			
			Если Результат.Свойство("error") И Результат.error.code > 0 Тогда
				СтруктураВозврата.Сообщение = Результат.error.description + ". КодОшибки " + Строка(Результат.error.code);	
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		
		Если Данные.Свойство("error") И Данные.error.Свойство("description") Тогда
			
			ТекстОшибки = Данные.error.description;
			СтруктураВозврата.КодОшибки = Данные.error.code;        
			
		Иначе
			ТекстОшибки = "В ответе отсутствует результат в необходимом формате";
		КонецЕсли;
	
		СтруктураВозврата.Сообщение = ТекстОшибки;
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
			
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьПоследнийНапечатанныйГУИДПоКассе(Касса)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ГУИД
	|ИЗ
	|	РегистрСведений.ЗаданияНаПробитиеЧека.СрезПоследних КАК ЗаданияНаПробитиеЧекаСрезПоследних
	|ГДЕ
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ПКО.Касса = &Касса
	|	И ЗаданияНаПробитиеЧекаСрезПоследних.Статус = ""ready""
	|	И ЗаданияНаПробитиеЧекаСрезПоследних.ДатаОбновления >= &ДатаОбновления";
	
	Запрос.УстановитьПараметр("Касса", Касса); 
	Запрос.УстановитьПараметр("ДатаОбновления", ТекущаяДата() - 86400 * 10);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ГУИД;
	КонецЕсли;               
	
	Возврат "";	
		
КонецФункции

Функция ПолучитьПараметрыАутификацииииСБИС()
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");
	
	СтруктураЗапроса = Новый Структура("login,password,app_client_id", Константы.СБИС_Логин.Получить(), Константы.СБИС_Пароль.Получить(), Константы.СБИС_ИдентификаторКлиента.Получить());
	
	HTTPСоединение = Новый HTTPСоединение("api.sbis.ru", , , , , 2, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	HTTPЗапрос = Новый HTTPЗапрос("/oauth/service/"); 	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json"); 
	HTTPЗапрос.УстановитьТелоИзСтроки(ВернутьJSON(СтруктураЗапроса), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	
	ОтветJSONСтрока = Ответ.ПолучитьТелоКакСтроку("UTF8");
	
	Если ЗначениеЗаполнено(СокрЛП(ОтветJSONСтрока)) Тогда
		
		Попытка
			
			СтруктураВозврата.Данные = ВернутьСтруктуруИзJSON(ОтветJSONСтрока);		
			СтруктураВозврата.Результат = Истина;
			
		Исключение          			
			СтруктураВозврата.Сообщение = СокрЛП(ОтветJSONСтрока); 		    
		КонецПопытки;  
		
	Иначе	
		СтруктураВозврата.Сообщение = "Не удалось получить данные аутификации СБИС";
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции

Функция ПолучитьНомерФискальногоНакопителя(РегистрационныйНомер, ДатаПечати, SID, ИНН)
	
	СтруктураВозврата = Новый Структура("Результат, Номер, Сообщение", Ложь, Неопределено, "");
	
	МассивСтатусовПроверки = Новый Массив;
	МассивСтатусовПроверки.Добавить("2");
	МассивСтатусовПроверки.Добавить("3");
	
	Для каждого Статус Из МассивСтатусовПроверки Цикл
		
		ФискальныеНакопители = ПолучитьФискальныеПоСтатусу(РегистрационныйНомер, SID, ИНН, Статус);
		
		Если ЗначениеЗаполнено(ФискальныеНакопители) Тогда
						
			Для каждого Накопитель Из ФискальныеНакопители Цикл
				
				ДатаНачала = XMLЗначение(Тип("Дата"), Накопитель.effectiveFrom);
				
				Если Статус = "2" Тогда
					ДатаОкончания = XMLЗначение(Тип("Дата"), Накопитель.fsFinishDate);				
				Иначе
					ДатаОкончания = XMLЗначение(Тип("Дата"), Накопитель.effectiveTo);
				КонецЕсли;
								
				Если ДатаПечати >= ДатаНачала И ДатаПечати <= ДатаОкончания Тогда

					СтруктураВозврата.Результат = Истина;
					СтруктураВозврата.Номер = Накопитель.StorageId;
					
					Возврат СтруктураВозврата;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата.Сообщение = "Не удалось получить номер фискального накопителя по дате печати";	
	
	Возврат СтруктураВозврата;
		
КонецФункции 

Функция ПолучитьФискальныеПоСтатусу(РегистрационныйНомер, SID, ИНН, Статус) 
	
	HTTPСоединение = Новый HTTPСоединение("api.sbis.ru", , , , , 2, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	HTTPЗапрос = Новый HTTPЗапрос("/ofd/v1/orgs/" + ИНН + "/kkts/" + РегистрационныйНомер + "/storages?status=" + Статус); 	
	HTTPЗапрос.Заголовки.Вставить("Cookie", "sid=" + SID);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	ОтветJSONСтрока = Ответ.ПолучитьТелоКакСтроку("UTF8");
	
	Если ЗначениеЗаполнено(СокрЛП(ОтветJSONСтрока)) Тогда
		
		Попытка   		        
			
			ФискальныеНакопители = ВернутьСтруктуруИзJSON(ОтветJSONСтрока);						
			
			Возврат ФискальныеНакопители;
			
		Исключение          			
		КонецПопытки;  
		
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции

Функция МожноОтправитьКопиюЧекаИзДокумента(Документ) Экспорт
	
	Если Не ЗначениеЗаполнено(Документ.НомерЧекаККМ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Документ.Касса) Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	СтруктураПечати = ПолучитьИнформациюПоПечати(Документ);
	
	Если Не ЗначениеЗаполнено(СтруктураПечати.ДатаПечати) Тогда		
		Возврат Ложь;                                          	
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(Константы.СБИС_ИдентификаторКлиента.Получить())
		ИЛИ Не ЗначениеЗаполнено(Константы.СБИС_Логин.Получить()) 
		ИЛИ Не ЗначениеЗаполнено(Константы.СБИС_Пароль.Получить()) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Возврат Истина;
		
КонецФункции

Процедура ОтправитьКопиюЧекСФормыДокумента(Документ) Экспорт
	
	Email = Чеки.ПолучитьEmail(Документ.Контрагент);
	
	#Если Клиент Тогда
		
		Если ВвестиСтроку(Email, "Введите email для отправки копии чека") Тогда
			
			Если Не ЗначениеЗаполнено(Email) Тогда
				
				Сообщить("Введите email для отправки"); 
				Возврат;
				
			КонецЕсли; 
			
			ДобавитьДокументВОчередьОтправкиКопийЧеков(Документ, Email);
			
			Сообщить("Документ был успешно добавлен в очередь отправки копий чеков");
			
		КонецЕсли; 
		
	#КонецЕсли 
		
КонецПроцедуры

Процедура ДобавитьДокументВОчередьОтправкиКопийЧеков(Документ, Email) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьОтправкиКопииЧеков.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Документ = Документ; 
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Статус = "ВОчереди"; 
	МенеджерЗаписи.Email = Email;
	МенеджерЗаписи.Записать(Истина); 
		
КонецПроцедуры


///////////////////Дубли чеков///////////////////
Функция ПолучитьИнформациюПоПечатиЛюбогоДокумента(Дата)
	
	СтруктураВозврата = Новый Структура("ДатаПечати, ГУИД, Документ", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ГУИД,
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ДатаОбновления КАК ДатаПечати,
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ПКО КАК Документ
	|ИЗ
	|	РегистрСведений.ЗаданияНаПробитиеЧека.СрезПоследних(, Статус = ""ready"") КАК ЗаданияНаПробитиеЧекаСрезПоследних
	|ГДЕ
	|	ЗаданияНаПробитиеЧекаСрезПоследних.ДатаОбновления МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата; 
		
КонецФункции

Функция ПолучитьСписокЧековЗаПериод(ВремяНачала, ВремяОкончания) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение, Данные", Ложь, "", Неопределено);
	
	СтруктураПечати = ПолучитьИнформациюПоПечатиЛюбогоДокумента(ВремяНачала);
	
	Если Не ЗначениеЗаполнено(СтруктураПечати.ДатаПечати) Тогда
		
		СтруктураВозврата.Сообщение = "Не удалось получить по документу данные по печати чека";
		
		Возврат СтруктураВозврата;
		
	КонецЕсли; 
	
	Документ = СтруктураПечати.Документ;	
	ДатаПечати = СтруктураПечати.ДатаПечати;
	ГУИД = СтруктураПечати.ГУИД; 
	
	СтруктураРегНомера = ПолучитьРегистрационныйНомерККТ(ДатаПечати, ГУИД, Документ);
	
	Если Не СтруктураРегНомера.Результат Тогда
		
		СтруктураВозврата.Сообщение = "Не удалось получить регистрационный номер ККМ: " + СтруктураРегНомера.Сообщение;
		
		Возврат СтруктураВозврата;

	КонецЕсли;
	
	РегистрационныйНомер = СтруктураРегНомера.Номер;	
	СтруктураАутификации = ПолучитьПараметрыАутификацииииСБИС();	
	
	Если Не СтруктураАутификации.Результат Тогда 	                 
		
		СтруктураВозврата.Сообщение = "Проблемы при аутификации в СБИС: " + СтруктураАутификации.Сообщение;	
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;     
	
	SID = СтруктураАутификации.Данные.sid; 
	ИНН = Константы.ОсновнаяОрганизация.Получить().ИНН;  
	
	СтруктураФискальногоНакопителя = ПолучитьНомерФискальногоНакопителя(РегистрационныйНомер, ДатаПечати, SID, ИНН);
	
	Если Не СтруктураФискальногоНакопителя.Результат Тогда
		
		СтруктураВозврата.Сообщение = "Проблемы при получении номера накопителя: " + СтруктураФискальногоНакопителя.Сообщение;	
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;   	
	
	НомерНакопителя = СтруктураФискальногоНакопителя.Номер;
		
	HTTPСоединение = Новый HTTPСоединение("api.sbis.ru", , , , , 10, Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено));
	HTTPЗапрос = Новый HTTPЗапрос("/ofd/v1/orgs/" + Строка(ИНН) + "/kkts/" + Строка(РегистрационныйНомер) + "/storages/" + Строка(НомерНакопителя) + "/docs?dateFrom=" + Формат(ВремяНачала, "ДФ=yyyy-MM-ddTHH:mm:ss") + "&dateTo=" + Формат(ВремяОкончания, "ДФ=yyyy-MM-ddTHH:mm:ss") + "&limit=1000"); 	
	HTTPЗапрос.Заголовки.Вставить("Cookie", "sid=" + SID);
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ОтветСтрока = Ответ.ПолучитьТелоКакСтроку();   
		
		СтруктураВозврата.Сообщение = ОтветСтрока; 
		Возврат СтруктураВозврата;
				
	КонецЕсли;   
	
	Данные = Ответ.ПолучитьТелоКакСтроку();
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Данные = Данные; 	
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПроверитьНаДублиВПределахДня(Дата, ВремяНачала = Неопределено, ВремяОкончания = Неопределено) Экспорт
		
	Если ВремяНачала = Неопределено Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПроверкиПоДублямЧековСрезПоследних.ВремяОкончания) КАК ВремяОкончания
		|ИЗ
		|	РегистрСведений.ПроверкиПоДублямЧеков.СрезПоследних(
		|			,
		|			День = &День
		|				И Успешно) КАК ПроверкиПоДублямЧековСрезПоследних";
		
		Запрос.УстановитьПараметр("День", Дата);  
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() И Выборка.ВремяОкончания <> NULL Тогда
			ВремяНачала = НачалоДня(Дата) + (Выборка.ВремяОкончания + 1 - Дата('00010101'));
		Иначе
			ВремяНачала = НачалоДня(Дата);	
		КонецЕсли;         
		
	КонецЕсли; 
	
	Если ВремяОкончания = Неопределено Тогда
		
		Т = ТекущаяДата();
		ВремяОкончания = НачалоДня(Дата) + (Т - НачалоДня(Т));
		
	КонецЕсли; 
	
	ГУИДПроверки = Строка(Новый УникальныйИдентификатор);
	
	МенеджерПроверки = РегистрыСведений.ПроверкиПоДублямЧеков.СоздатьМенеджерЗаписи(); 
	МенеджерПроверки.Период = ТекущаяДата();
	МенеджерПроверки.День = Дата;
	МенеджерПроверки.ВремяНачала = ВремяНачала;
	МенеджерПроверки.ВремяОкончания = ВремяОкончания;
	МенеджерПроверки.ГУИД = ГУИДПроверки;         
	
	СтруктураЧеков = Чеки.ПолучитьСписокЧековЗаПериод(ВремяНачала, ВремяОкончания);
	
	Если СтруктураЧеков.Результат Тогда
			
		Данные = СтруктураЧеков.Данные;
		ДанныеСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(Данные); 
		Дубли = НайтиДублиЗаказов(ДанныеСтруктура); 
		
		МенеджерПроверки.КоличествоДублей = Дубли.Количество();
		МенеджерПроверки.Успешно = Истина;		
		
		Если Дубли.Количество() > 0 Тогда
			
			ЗаписьЖурналаРегистрации("Дубли чеков.Проверка", УровеньЖурналаРегистрации.Предупреждение,,,"Обнаружено: " + Строка(Дубли.Количество()) + " дублей чеков. День: " + Формат(Дата,"ДФ=dd.MM.yyyy" ));
			
			НаборДублей = РегистрыСведений.ДублиПоЧекам.СоздатьНаборЗаписей();
			НаборДублей.Отбор.ГУИД.Установить(ГУИДПроверки);	
			
			Инд = 0;
			
			Для каждого ГруппаДублей Из Дубли Цикл	
				
				МассивНомеровЧековККМ = Новый Массив;
				
				Для каждого ЭлементГруппы Из ГруппаДублей Цикл
					МассивНомеровЧековККМ.Добавить(ЭлементГруппы.receipt.fiscalDocumentNumber);	
				КонецЦикла;    
				
				ДатаЧека = Чеки.UNIXВДату(ГруппаДублей[0].receipt.dateTime);
				
				ДокументПоНомерамЧекаККМ = ПолучитьДокументПоНомерамЧекаККМ(МассивНомеровЧековККМ, ДатаЧека);
				
				Если ДокументПоНомерамЧекаККМ <> Неопределено И ДокументПоНомерамЧекаККМ.Количество() = МассивНомеровЧековККМ.Количество() Тогда
					Продолжить;
				КонецЕсли;
				
				Инд = Инд + 1;
				
				Запись = НаборДублей.Добавить();
				Запись.Период = ТекущаяДата();
				Запись.ГУИД = ГУИДПроверки; 
				Запись.НомерДубля = Инд;
				Запись.Данные = ОбщегоНазначения.ВернутьJSON(ГруппаДублей);  
				Запись.Сумма = ГруппаДублей[0].receipt.totalSum / 100; 
				Запись.Дата = ДатаЧека; 
				Запись.Документ = ?(ДокументПоНомерамЧекаККМ = Неопределено, Неопределено, ДокументПоНомерамЧекаККМ[0]);
							
			КонецЦикла; 
			
			НаборДублей.Записать(Истина);
			
		КонецЕсли;
		
	Иначе
		МенеджерПроверки.ТекстОшибки = СтруктураЧеков.Сообщение;
	КонецЕсли; 
	
	МенеджерПроверки.Записать();
		
КонецФункции 

Функция ПолучитьДокументПоНомерамЧекаККМ(МассивНомеровЧековККМ, ДатаЧека)
    
    Если МассивНомеровЧековККМ.Количество() = 0 Тогда
        Возврат Неопределено; // Если искать нечего, возвращаем пустой массив
    КонецЕсли;

    ТекстЗапроса = "";
    
    // Перебираем метаданные всех документов конфигурации
    Для Каждого МетаданныеДокумента Из Метаданные.Документы Цикл
        
        // Проверяем наличие реквизита "НомерЧекаККМ" у документа
        Если МетаданныеДокумента.Реквизиты.Найти("НомерЧекаККМ") <> Неопределено Тогда
            
            ТекстЧасти = 
                "ВЫБРАТЬ
                |   Док.Ссылка КАК Ссылка,
                |   Док.НомерЧекаККМ КАК НомерЧекаККМ
                |ИЗ
                |   Документ." + МетаданныеДокумента.Имя + " КАК Док
                |ГДЕ
                |   Док.НомерЧекаККМ В(&МассивНомеровЧековККМ) И Док.Дата Между &ДатаНач и &ДатаКон";
                
            // Если текст запроса уже содержит данные, добавляем соединение
            Если Не ПустаяСтрока(ТекстЗапроса) Тогда
                ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;
            КонецЕсли;
            
            // Прибавляем новую часть к общему тексту
            ТекстЗапроса = ТекстЗапроса + ТекстЧасти;
            
        КонецЕсли;
        
    КонецЦикла;
    
    // Если не найдено ни одного документа с таким реквизитом
    Если ПустаяСтрока(ТекстЗапроса) Тогда
        Возврат Новый Массив; 
    КонецЕсли;
    
    // Инициализируем и выполняем запрос
    Запрос = Новый Запрос;
    Запрос.Текст = ТекстЗапроса;
    Запрос.УстановитьПараметр("МассивНомеровЧековККМ", МассивНомеровЧековККМ);
	Запрос.УстановитьПараметр("ДатаНач", ДобавитьМесяц(ДатаЧека, -1));
	Запрос.УстановитьПараметр("ДатаКон", ДобавитьМесяц(ДатаЧека, 1));
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();    
    НайденныеДокументы = Новый Массив;
    
    Пока Выборка.Следующий() Цикл
        НайденныеДокументы.Добавить(Выборка.Ссылка);
    КонецЦикла;
	
	Если НайденныеДокументы.Количество() > 0 Тогда
		Возврат НайденныеДокументы; 	
	КонецЕсли; 
	
    Возврат Неопределено;

КонецФункции

Функция НайтиДублиЗаказов(МассивЗаказов)
	
	// 1. Создаем Таблицу Значений с жесткой типизацией колонок
	ТЗ_Заказы = Новый ТаблицаЗначений;
	ТЗ_Заказы.Колонки.Добавить("ИндексМассива", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0)));
	ТЗ_Заказы.Колонки.Добавить("dateTime", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 0)));
	ТЗ_Заказы.Колонки.Добавить("totalSum", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	ТЗ_Заказы.Колонки.Добавить("cashTotalSum", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));    
	
	// 2. Заполняем ТЗ данными из массива, отсеивая лишнее (например, openShift)
	Для Индекс = 0 По МассивЗаказов.ВГраница() Цикл
		ЭлементМассива = МассивЗаказов[Индекс];
		
		ДанныеЧека = Неопределено;
		Если ЭлементМассива.Свойство("receipt", ДанныеЧека) Тогда 
			
			НоваяСтрока = ТЗ_Заказы.Добавить();
			НоваяСтрока.ИндексМассива = Индекс;
			НоваяСтрока.dateTime      = ДанныеЧека.dateTime;
			НоваяСтрока.totalSum      = ДанныеЧека.totalSum;
			НоваяСтрока.cashTotalSum       = ДанныеЧека.cashTotalSum;
			
		КонецЕсли;
	КонецЦикла;
	
	МассивВсехДублей = Новый Массив;
	
	// Если чеков нет, возвращаем пустой массив
	Если ТЗ_Заказы.Количество() = 0 Тогда
		Возврат МассивВсехДублей;
	КонецЕсли;
	
	// 3. Запрос для поиска дублей
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.ИндексМассива КАК ИндексМассива,
	|	ТЗ.dateTime КАК dateTime,
	|	ТЗ.totalSum КАК totalSum,
	|	ТЗ.cashTotalSum КАК cashTotalSum
	|ПОМЕСТИТЬ ВТ_ИсходныеДанные
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.dateTime КАК dateTime,
	|	ВТ_ИсходныеДанные.totalSum КАК totalSum,
	|	ВТ_ИсходныеДанные.cashTotalSum КАК cashTotalSum
	|ПОМЕСТИТЬ ВТ_Дубли
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ИсходныеДанные.dateTime,
	|	ВТ_ИсходныеДанные.totalSum,
	|	ВТ_ИсходныеДанные.cashTotalSum
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ВТ_ИсходныеДанные.ИндексМассива) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИсходныеДанные.ИндексМассива КАК ИндексМассива,
	|	ВТ_ИсходныеДанные.dateTime КАК dateTime,
	|	ВТ_ИсходныеДанные.totalSum КАК totalSum,
	|	ВТ_ИсходныеДанные.cashTotalSum КАК cashTotalSum
	|ИЗ
	|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Дубли КАК ВТ_Дубли
	|		ПО ВТ_ИсходныеДанные.dateTime = ВТ_Дубли.dateTime
	|			И ВТ_ИсходныеДанные.totalSum = ВТ_Дубли.totalSum
	|				И ВТ_ИсходныеДанные.cashTotalSum = ВТ_Дубли.cashTotalSum
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ИсходныеДанные.dateTime,
	|	ВТ_ИсходныеДанные.totalSum,
	|	ВТ_ИсходныеДанные.cashTotalSum";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ_Заказы);
	
	// 4. Выполняем запрос и пакуем дубли в массив массивов
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивТекущейГруппы = Неопределено;
	Пред_dateTime = Неопределено;
	Пред_totalSum = Неопределено;
	Пред_cashTotalSum = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		// Если комбинация даты и суммы сменилась — значит началась новая группа дублей
		Если Пред_dateTime <> Выборка.dateTime Или Пред_totalSum <> Выборка.totalSum Или Пред_cashTotalSum <> Выборка.cashTotalSum Тогда
			
			// Создаем новый массив для новой группы
			МассивТекущейГруппы = Новый Массив;
			// Сразу кладем его в общий массив (в 1С массивы передаются по ссылке, 
			// поэтому мы сможем его заполнять дальше)
			МассивВсехДублей.Добавить(МассивТекущейГруппы);
			
			// Запоминаем новые значения для следующих итераций
			Пред_dateTime = Выборка.dateTime;
			Пред_totalSum = Выборка.totalSum;
			Пред_cashTotalSum = Выборка.cashTotalSum;
			
		КонецЕсли;
		
		// Добавляем оригинальную структуру заказа во вложенный массив текущей группы
		МассивТекущейГруппы.Добавить(МассивЗаказов[Выборка.ИндексМассива]);
		
	КонецЦикла;
	
	Возврат МассивВсехДублей;
	
КонецФункции


///////////////////Вспомогательные процедуры///////////////////
Функция ВернутьJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура,,"ОбработатьНеподдерживаемоеСвойствоJSON",Чеки);
	JsonСтрока = ЗаписьJSON.Закрыть();  	
	
	Возврат JsonСтрока;
	
КонецФункции

Функция ВернутьСтруктуруИзJSON(Строка) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Ложь);
	
	Возврат Данные;
	
КонецФункции

Функция ОбработатьНеподдерживаемоеСвойствоJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат "";
	
КонецФункции

Функция ЗаписатьНовоеЗадание(Документ, Статус, Ошибка = "", ГУИД = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ГУИД = Неопределено Тогда
		ГУИД = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ЗаданияНаПробитиеЧека.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.ПКО = Документ;
	МенеджерЗаписи.ГУИД = ГУИД;
	МенеджерЗаписи.Статус = Статус;
	МенеджерЗаписи.ТекстОшибки = Ошибка;
	МенеджерЗаписи.Записать();   
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

Функция ПолучитьSBPRRNИзСлипЧека(МассивСтрокСлипЧека) Экспорт

	SbpRRN = "";

	Для каждого Строка Из МассивСтрокСлипЧека Цикл
		
		Если Найти(Строка, "SbpRRN:") > 0 Тогда
			
			SbpRRN = СтрЗаменить(Строка, "SbpRRN:", "");
			SbpRRN = СокрЛП(SbpRRN); 
			Прервать;
			
		КонецЕсли;
		
		//+Марков И. 21.04.2025 #UT10-5204
		Если Найти(Строка, "QR RRN:") > 0 Тогда
			
			SbpRRN = СтрЗаменить(Строка, "QR RRN:", "");
			SbpRRN = СокрЛП(SbpRRN); 
			Прервать;
			
		КонецЕсли;
		//-Марков И. 21.04.2025 #UT10-5204
		
	КонецЦикла;
	
	Возврат SbpRRN;
		
КонецФункции

Функция КодироватьСтрокуВBase64(Знач Строка,
                               Знач Кодировка = Неопределено,
                               Знач ЗаписатьBOM = Ложь) Экспорт

   // Устанавливаем кодировку по умолчанию, если не указана
   Если Не ЗначениеЗаполнено(Кодировка) Тогда
       Кодировка = КодировкаТекста.UTF8;
   КонецЕсли;

   // Преобразуем строку в двоичные данные
   ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Строка, Кодировка, ЗаписатьBOM);

   // Кодируем двоичные данные в Base64
   Результат = Base64Строка(ДвоичныеДанные);

   Возврат Результат;

КонецФункции

Функция КодироватьСтрокуВRFC1738(КодМаркировки)
	
	//+Сёмин Р.И. 07.07.2026 #UT10-5935
	Возврат КодироватьСтроку(КодМаркировки, СпособКодированияСтроки.КодировкаURL);
	//-Сёмин Р.И. 07.07.2026 #UT10-5935
	
КонецФункции

Функция ПолучитьМассивМаркировки(Документ, Номенклатура, ЭтоВозврат, СтруктураЧека)
	
	МассивВозврата = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугКодыМаркировки.Ссылка,
	|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки КАК ШК
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК РеализацияТоваровУслугКодыМаркировки
	|ГДЕ
	|	РеализацияТоваровУслугКодыМаркировки.Ссылка = &Ссылка
	|	И РеализацияТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура = &Номенклатура";  
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", Документ.Метаданные().Имя);
	
	Запрос.УстановитьПараметр("Ссылка", Документ);  
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);  
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Пока Выборка.Следующий() Цикл
		
		ШК = Выборка.ШК;
		
		СтруктураМаркировки = Новый Структура; 
		СтруктураМаркировки.Вставить("imcType", "auto");
		СтруктураМаркировки.Вставить("imc", КодироватьСтрокуВBase64(СтрЗаменить(ШК.ПолныйКодМаркировки.Получить(), "<GS>", Символ(29)))); 		
		
		Если ЭтоВозврат Тогда
			СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceReturn");
		Иначе
			
			Если СтруктураЧека.Свойство("clientInfo") И СтруктураЧека.clientInfo.Свойство("vatin") Тогда
				СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceForSale");
			Иначе
				СтруктураМаркировки.Вставить("itemEstimatedStatus", "itemPieceSold");
			КонецЕсли;			
			
		КонецЕсли;
				
		СтруктураМаркировки.Вставить("imcModeProcessing", 0);
			
		МассивВозврата.Добавить(СтруктураМаркировки); 
		
	КонецЦикла;            

	Возврат МассивВозврата;	
	
КонецФункции

Функция UNIXВДату(Unix) Экспорт
		
	Возврат МестноеВремя('19700101' + Unix); 
	
КонецФункции

Функция ВДокументеЛицевойИлиРозничныйДоговор(Док)
	
	//+Сёмин Р.И. 09.07.2026 #UT10-5935
	ДоговорКонтрагента = Неопределено;
	ЭтоЛицевойИлиРозничныйДоговор = Ложь;
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		ДоговорКонтрагента = Док.РасшифровкаПлатежа[0].ДоговорКонтрагента;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
		ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
		ИЛИ ТипЗнч(Док) = Тип("ДокументСсылка.КорректировкаРеализации")
		Тогда
		
		ДоговорКонтрагента = Док.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ЭтоЛицевойИлиРозничныйДоговор = ДоговорКонтрагента.РозничнаяПродажа ИЛИ ДоговорКонтрагента.ЛицевойСчет;
	КонецЕсли;
	
	Возврат ЭтоЛицевойИлиРозничныйДоговор;
	//-Сёмин Р.И. 09.07.2026 #UT10-5935
	
КонецФункции

Функция ЭтоОплатаКартойИлиПКОСЛицевымСчетом(Док)
	
	//+Сёмин Р.И. 05.08.2026 #UT10-5994
	ДоговорКонтрагента = Неопределено;
	ЭтоЛицевойСчет = Ложь;
	
	Если ТипЗнч(Док) = Тип("ДокументСсылка.ОплатаОтПокупателяПлатежнойКартой") Тогда
		ДоговорКонтрагента = Док.РасшифровкаПлатежа[0].ДоговорКонтрагента;
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		ДоговорКонтрагента = Док.ДоговорКонтрагента;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ЭтоЛицевойСчет = ДоговорКонтрагента.ЛицевойСчет;
	КонецЕсли;
	
	Возврат ЭтоЛицевойСчет;
	//-Сёмин Р.И. 05.08.2026 #UT10-5994
	
КонецФункции

