

Процедура РегламентноеВыполнение() Экспорт 
	СозданиеВходящейСлужебнойЗаписки();
КонецПроцедуры

Процедура СозданиеВходящейСлужебнойЗаписки()
	
	ЗапросЗаявокНаВозврат = Новый Запрос;
	ЗапросЗаявокНаВозврат.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Ссылка КАК ЗаявкаНаВозврат
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.ОтправленВФилиал)
	|	И ЗаявкаНаВозврат.Проведен";
	
	РезультатЗапросаЗаявокНаВозврат = ЗапросЗаявокНаВозврат.Выполнить();
	
	Если НЕ РезультатЗапросаЗаявокНаВозврат.Пустой() Тогда
		
		ВыборкаЗаявокНаВозврат = РезультатЗапросаЗаявокНаВозврат.Выбрать();
		
		ТаблицаСсылок = Новый ТаблицаЗначений;
		ТаблицаСсылок.Колонки.Добавить("ГУИДЗаявкиНаВозврат");
		
		Пока ВыборкаЗаявокНаВозврат.Следующий() Цикл
			
			НоваяСтрокаТаблицы = ТаблицаСсылок.Добавить();
			НоваяСтрокаТаблицы.ГУИДЗаявкиНаВозврат = СокрЛП(ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат.УникальныйИдентификатор());
			
		КонецЦикла;
		
		Если НЕ ТаблицаСсылок.Количество() = 0 Тогда
			
			Результат = МСКWEB.ПолучитьДанныеДляСлужебныхЗаписокВходящих(ТаблицаСсылок);
			
			Если Результат.Загружен Тогда 
				
				СписокДанных = Результат.СписокДанных;
				
				Для Каждого СтрокаСпискаДанных Из СписокДанных Цикл
					
					ЕстьСлужебнаяЗаписка = Документы.СлужебнаяЗаписка.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе",СокрЛП(СтрокаСпискаДанных.ГУИДИнвойса));
					
					Если ЕстьСлужебнаяЗаписка.Пустая() Тогда
						
						НовыйДокументСлужебнаяЗаписка                         = Документы.СлужебнаяЗаписка.СоздатьДокумент();
						НовыйДокументСлужебнаяЗаписка.Дата                    = ТекущаяДата();
						НовыйДокументСлужебнаяЗаписка.Ответственный           = ПараметрыСеанса.ТекущийПользователь;
						НовыйДокументСлужебнаяЗаписка.Входящая                = Истина; 
						НовыйДокументСлужебнаяЗаписка.ИДДокументаВСмежнойБазе = СокрЛП(СтрокаСпискаДанных.ГУИДИнвойса);
						НовыйДокументСлужебнаяЗаписка.ЗаявкаНаВозврат 		  = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаСпискаДанных.ГУИДЗаявкиНаВозврат));
						НовыйДокументСлужебнаяЗаписка.НомерИнвойс             = СокрЛП(СтрокаСпискаДанных.НомерИнвойс);
						НовыйДокументСлужебнаяЗаписка.Комментарий             = СокрЛП(СтрокаСпискаДанных.Комментарий);
						НовыйДокументСлужебнаяЗаписка.Экспертиза              = Истина;  
						
						ПромКодФилиала = СокрЛП(Константы.КодФилиала.Получить());
						Если ЗначениеЗаполнено(ПромКодФилиала) Тогда
							НовыйДокументСлужебнаяЗаписка.Получатель = Справочники.Контрагенты.НайтиПоРеквизиту(?(СтрДлина(ПромКодФилиала) = 36 , "КодМДМ","IDФилиала"),ПромКодФилиала);
						КонецЕсли;
						
						Если НЕ СтрокаСпискаДанных.СписокТЕ.Количество() = 0 Тогда 
							
							Для Каждого СтрокаТЕ Из СтрокаСпискаДанных.СписокТЕ Цикл
								
								НоваяСтрокаТаблицыТЕ            = НовыйДокументСлужебнаяЗаписка.ТранспортныеЕдиницы.Добавить();
								НоваяСтрокаТаблицыТЕ.Грузоместо = СокрЛП(СтрокаТЕ);
								
							КонецЦикла;						
							
						КонецЕсли;
						
						Попытка
							НовыйДокументСлужебнаяЗаписка.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ЗаписьЖурналаРегистрации("Создание входящей служебной записки", УровеньЖурналаРегистрации.Предупреждение, , ,
							"Не удалось создать Служебную записку по инвойсу УТ11 номер "+СокрЛП(СтрокаСпискаДанных.НомерИнвойс)+" "+ОписаниеОшибки());							
						КонецПопытки;						
						
					КонецЕсли;				
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
