
Процедура СформироватьПолкиДляЯчеек(ЭтоРостов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                                                        
	|	Ячейки.Ссылка,               
	|	Ячейки.Код
	|ИЗ
	|	Справочник.Ячейки КАК Ячейки
	|";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	КоличествоЗаписей = РезультатЗапроса.Количество();
	НомерЗаписи = 0;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ОбработкаПрерыванияПользователя();
		СвойстаЯчейки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(РезультатЗапроса.Код, "-");

		Если СвойстаЯчейки.Количество() >= 4 Тогда
			
			НомерЗаписи = НомерЗаписи + 1;

			Если ЭтоРостов Тогда
				Полка = СвойстаЯчейки[0] + "-" + СвойстаЯчейки[1] + "-" + СвойстаЯчейки[2];
			Иначе				
				Полка = СвойстаЯчейки[0] + "-" + СвойстаЯчейки[1] + "-" + СвойстаЯчейки[2] + "-" + СвойстаЯчейки[3];
			КонецЕсли;

			ЭлементОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ЭлементОбъект.Полка = Полка;
			ЭлементОбъект.ОбменДанными.Загрузка = Истина;
			
			Попытка 				
				
				ЭлементОбъект.Записать();	
				Сообщить(Строка(НомерЗаписи) + " - """ + Строка(КоличествоЗаписей) + """" );
				
			Исключение
				
				Сообщить(Строка(НомерЗаписи) + " " + РезультатЗапроса.Код + " " + ОписаниеОшибки());
				Продолжить;
				
			КонецПопытки; 
			
		Иначе 
			Сообщить(РезультатЗапроса.Код + " - полка не сформирована.");
		КонецЕсли; 		
		
	КонецЦикла; 
	
	Сообщить("Наименования полок для ячеек сформированы.");

КонецПроцедуры
