
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция СписокШаблоновВыборки() Экспорт
	
	СхемыВыборки = Новый ТаблицаЗначений;
	СхемыВыборки.Колонки.Добавить("Имя");
	СхемыВыборки.Колонки.Добавить("Синоним");
	СхемыВыборки.Колонки.Добавить("Комментарий");
	
	ВерсияУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	
	Если ЗначениеЗаполнено(ВерсияУТ) Тогда
		Для каждого МетаданныеМакета Из Метаданные.Справочники.ПЛ_Подписчики.Макеты Цикл
			Если Найти(МетаданныеМакета.Имя, ВерсияУТ) Тогда
				НоваяСхема = СхемыВыборки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСхема, МетаданныеМакета);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СхемыВыборки;
	
КонецФункции

Функция ДополнительныеАдресаты(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДополнительныеАдресаты.Адресат КАК Адресат
	|ИЗ
	|	Справочник.ПЛ_Подписчики.ДополнительныеАдресаты КАК ДополнительныеАдресаты
	|ГДЕ
	|	ДополнительныеАдресаты.Ссылка = &Ссылка
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Адресат");
	
КонецФункции

Процедура ЗаполнитьАдресатовПоСпискуРассылки(Ссылка, АдресатыРасширенно, СпособДоставки = Неопределено) Экспорт
	
	СправочникОбъект = Ссылка.ПолучитьОбъект();
	
	СхемаВыборкиАдресатов = СправочникОбъект.СхемаВыборки.Получить();
	НастройкиВыборкиАдресатов = СправочникОбъект.НастройкиВыборки.Получить();
	
	Если СхемаВыборкиАдресатов <> Неопределено
		И НастройкиВыборкиАдресатов <> Неопределено Тогда
		
		АдресСхемыВыборкиАдресатов = ПоместитьВоВременноеХранилище(СхемаВыборкиАдресатов, Новый УникальныйИдентификатор);
		АдресНастроекВыборкиАдресатов = ПоместитьВоВременноеХранилище(НастройкиВыборкиАдресатов, Новый УникальныйИдентификатор);
		
		СписокАдресатов = ПЛ_УведомленияОСОбытиях.ПолучитьСписокАдресатов("", "", АдресСхемыВыборкиАдресатов, АдресНастроекВыборкиАдресатов);
		ВидыКонтактнойИнформации = СправочникОбъект.ВидыКонтактнойИнформации.Получить();
		
		КонтактнаяИнформация = Неопределено;
		Если СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
			Или СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
			КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатов, "АдресЭлектроннойПочты", ВидыКонтактнойИнформации);
		ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
			КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатов, "НомерТелефона", ВидыКонтактнойИнформации);
		ИначеЕсли СпособДоставки = Неопределено Тогда
			КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатов,, ВидыКонтактнойИнформации);
		КонецЕсли;
		
		Если КонтактнаяИнформация <> Неопределено Тогда
			Для каждого СтрокаКИ Из КонтактнаяИнформация Цикл
				НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
				НовыйАдресатРасширенно.Адресат = СтрокаКИ.Объект;
				НовыйАдресатРасширенно.Адрес = СтрокаКИ.Представление;
				НовыйАдресатРасширенно.Идентификатор = Справочники.ПЛ_УведомленияОСобытиях.ИдентификаторАдресата(СтрокаКИ.Объект);
			КонецЦикла;
		КонецЕсли;
		
		Для каждого АдресатСписка Из СписокАдресатов Цикл
			Если ТипЗнч(АдресатСписка) = Тип("Строка") Тогда
				НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
				НовыйАдресатРасширенно.Адресат = АдресатСписка;
				НовыйАдресатРасширенно.Адрес = АдресатСписка;
				НовыйАдресатРасширенно.Идентификатор = "";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДополнительныеАдресаты = Справочники.ПЛ_Подписчики.ДополнительныеАдресаты(Ссылка);
	
	СписокАдресатовДополнительно = Новый Массив;
	СписокАдресатовДополнительноСтрокой = Новый Массив;
	
	Для каждого ДополнительныйАдресат Из ДополнительныеАдресаты Цикл
		Если ТипЗнч(ДополнительныйАдресат) = Тип("Строка") Тогда
			СписокАдресатовДополнительноСтрокой.Добавить(ДополнительныйАдресат);
		Иначе
			СписокАдресатовДополнительно.Добавить(ДополнительныйАдресат);
		КонецЕсли;
	КонецЦикла;
	
	ВидыКонтактнойИнформации = СправочникОбъект.ВидыКонтактнойИнформацииДополнительно.Получить();
	
	КонтактнаяИнформация = Неопределено;
	Если СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
		Или СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
		КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатовДополнительно, "АдресЭлектроннойПочты", ВидыКонтактнойИнформации);
	ИначеЕсли СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
		КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатовДополнительно, "НомерТелефона", ВидыКонтактнойИнформации);
	ИначеЕсли СпособДоставки = Неопределено Тогда
		КонтактнаяИнформация = ПЛ_УведомленияОСОбытиях.КонтактнаяИнформация(СписокАдресатов,, ВидыКонтактнойИнформации);
	КонецЕсли;
	
	Если КонтактнаяИнформация <> Неопределено Тогда
		Для каждого СтрокаКИ Из КонтактнаяИнформация Цикл
			НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
			НовыйАдресатРасширенно.Адресат = СтрокаКИ.Объект;
			НовыйАдресатРасширенно.Адрес = СтрокаКИ.Представление;
			НовыйАдресатРасширенно.Идентификатор = Справочники.ПЛ_УведомленияОСобытиях.ИдентификаторАдресата(СтрокаКИ.Объект);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого АдресатСписка Из СписокАдресатовДополнительноСтрокой Цикл
		НовыйАдресатРасширенно = АдресатыРасширенно.Добавить();
		НовыйАдресатРасширенно.Адресат = АдресатСписка;
		НовыйАдресатРасширенно.Адрес = АдресатСписка;
		НовыйАдресатРасширенно.Идентификатор = "";
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли