#Область Служебные

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции


Функция РазложитьСтрокуВМассивПодстрок(Знач Строка, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, СокращатьНепечатаемыеСимволы = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Строка) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Строка, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Строка, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Строка = Сред(Строка, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Строка, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Строка) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Строка));
		Иначе
			Результат.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция EmailValid(Адрес)

    //Адрес = "test@me@gmail.narod.am";
    ЛатинскиеБуквы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
    Цифры = "0123456789";

    //ищем крайний справа символ @ для правильного выделения локальной и доменной части
    ИндексСобаки = Найти(Адрес,"@");

    //1. строка адреса вообще не содержит разделителя
    Если ИндексСобаки = 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    УрезаемаяСтрока = Сред(Адрес, ИндексСобаки+1);
    Пока Найти(УрезаемаяСтрока,"@") > 0 Цикл
        ИндексСобаки = ИндексСобаки + Найти(УрезаемаяСтрока,"@");
        УрезаемаяСтрока = Сред(УрезаемаяСтрока, ИндексСобаки+1);
    КонецЦикла;

    ДоменнаяЧасть = Сред(Адрес, ИндексСобаки+1);
    ЛокальнаяЧасть = Лев(Адрес, ИндексСобаки-1);

    //2. Проверяем длину локальной части
    Если СтрДлина(ЛокальнаяЧасть) < 1 ИЛИ СтрДлина(ЛокальнаяЧасть) > 64 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //3. Проверяем длину доменной части
    Если СтрДлина(ДоменнаяЧасть) < 1 ИЛИ СтрДлина(ДоменнаяЧасть) > 255 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //4. Проверяем что локальная части не начинается и не заканчивается на "."
    Если Лев(ЛокальнаяЧасть, 1) = "." ИЛИ Прав(ЛокальнаяЧасть, 1) = "." Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //5. Локальная части не содержит 2 или более "." подряд
    Если Найти(ЛокальнаяЧасть, "..") > 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //Проверка доменной части

    //6. Доменная часть не начинается с точки
    Если Лев(ДоменнаяЧасть, 1) = "." Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //7. Доменная часть не содержит 2 или более "." подряд
    Если Найти(ДоменнаяЧасть, "..") > 0 Тогда
        Возврат ЛОЖЬ;
    КонецЕсли;

    //8. Проверка частей доменной части
    //каждая часть начинается с буквы и заканчивается буквой или цифрой
    //каждая часть длиной не более 63 символов
    ИдентификаторыДоменнойЧасти = РазложитьСтрокуВМассивПодстрок(ДоменнаяЧасть, ".");
	Если ИдентификаторыДоменнойЧасти.Количество() = 1 Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
    Для Каждого ИдентификаторДомена ИЗ ИдентификаторыДоменнойЧасти Цикл
        Если СтрДлина(ИдентификаторДомена) > 63 Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Лев(ИдентификаторДомена,1)) = 0
            //для доменов, нарушающих RFC 1035 п.2.3.1, например @1c.ru :)
            И Найти(Цифры, Лев(ИдентификаторДомена,1)) = 0
        Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;

        Если Найти(ЛатинскиеБуквы, Прав(ИдентификаторДомена,1)) = 0 И Найти(Цифры, Прав(ИдентификаторДомена,1)) = 0 Тогда
            Возврат ЛОЖЬ;
        КонецЕсли;
    КонецЦикла;
    //Все проверки пройдены - радуемся
    Возврат ИСТИНА;
КонецФункции

&НаСервере
Функция СформироватьТекстПисьма(СтруктураЗаполнения)
	ТекстПисьма = "";
	ШаблонПисьма = 
	"
	|<h3>Сообщение от пользователя модуля интеграции DiState-1C</h3>
	|<p>От: [ИМЯ_ПОЛЬЗОВАТЕЛЯ] из компании: [ИМЯ_КОМПАНИИ]</p>
	|<p>Текст предложения</p>
	|<pre>[ТЕКСТ_СООБЩЕНИЯ]</pre>
	|<br>
	|<p>Сведения об отправителе</p>
	|<p>Сертификат: [ДАННЫЕ_СЕРТИФИКАТА]</p>
	|<p>[ДАННЫЕ_ОРГАНИЗАЦИИ]</p>
	|<p>Версия конфигурации: [ВЕРСИЯ_КОНФИГУРАЦИИ]</p>
	|<p>Версия платформы 1С: [ВЕРСИЯ_ПЛАТФОРМЫ]</p>
	|<p>Версия обработки: [ВЕРСИЯ_ОБРАБОТКИ]</p>
	|";
	ВерсияКонфигурации = Метаданные.Синоним + " (" + Метаданные.Версия + ")";
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = СисИнфо.ВерсияПриложения;
	ВерсияОбработки = "2.2.3 (21.02.19)";
	
	ТекстПисьма = ШаблонПисьма;
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ИМЯ_ПОЛЬЗОВАТЕЛЯ]", 	СтруктураЗаполнения.ИмяПользователя);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ИМЯ_КОМПАНИИ]", 		СтруктураЗаполнения.ИмяОрганизации);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ТЕКСТ_СООБЩЕНИЯ]", 	СтруктураЗаполнения.ТекстПредложения);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ДАННЫЕ_СЕРТИФИКАТА]", 	СтруктураЗаполнения.Сертификат);
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ДАННЫЕ_ОРГАНИЗАЦИИ]", 	Объект.Организация.Наименование 
																	+ " ИНН " + Объект.Организация.ИНН 
																	+ " КПП " + Объект.Организация.КПП);
	Иначе
		ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ДАННЫЕ_ОРГАНИЗАЦИИ]", "Неопределено");
	КонецЕсли;
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ВЕРСИЯ_КОНФИГУРАЦИИ]", ВерсияКонфигурации);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ВЕРСИЯ_ПЛАТФОРМЫ]", 	ВерсияПлатформы);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "[ВЕРСИЯ_ОБРАБОТКИ]", 	ВерсияОбработки);
	
	Возврат ТекстПисьма;
КонецФункции

&НаСервере
Функция ОтправитьПисьмо(ТекстПисьма)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	Результат = ОбработкаОбъект.ОтправитьПисьмоВТехПоддержку(ИмяПользователя, ПочтовыйАдрес, ТекстПисьма);
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Область КриптоПровайдер

&НаСервере
Функция ПолучитьСписокКриптоПровайдеровWindows()
	СписокПровайдеров = Новый СписокЗначений;
	СписокПровайдеров.Добавить(75, "КриптоПро CSP (ГОСТ Р 34.10-2001)");
	//СписокПровайдеров.Добавить(80, "КриптоПро CSP (ГОСТ Р 34.10-2012)");
	//СписокПровайдеров.Добавить(81, "КриптоПро CSP (ГОСТ Р 34.10-2012 Strong)");
	//СписокПровайдеров.Добавить(2, "Infotecs Vipnet CSP");    
	Возврат СписокПровайдеров;
КонецФункции

&НаКлиенте
Функция ПолучитьСписокСертификатов()
	Менеджер = Новый МенеджерКриптографии("","",КриптоПровайдер);
	ПерсональноеХранилище = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;
	ХранилищеСертов = Менеджер.ПолучитьХранилищеСертификатов(ПерсональноеХранилище);
	МассивСертификатов = ХранилищеСертов.ПолучитьВсе();
	СписокЗначений = Новый СписокЗначений;
	Для Каждого Серт Из МассивСертификатов Цикл
		СписокЗначений.Добавить(Серт.Отпечаток, СформироватьИмяПоСертификату(Серт) );	
	КонецЦикла;
	Возврат СписокЗначений;
КонецФункции

&НаКлиенте
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	Менеджер = Новый МенеджерКриптографии("","",КриптоПровайдер);
	ПерсональноеХранилище = ТипХранилищаСертификатовКриптографии.ПерсональныеСертификаты;
	ХранилищеСертов = Менеджер.ПолучитьХранилищеСертификатов(ПерсональноеХранилище);
	Возврат ХранилищеСертов.НайтиПоОтпечатку(Отпечаток);
КонецФункции


&НаКлиенте
Функция СформироватьИмяПоСертификату(Сертификат)
	Если ТипЗнч(Сертификат) = Тип("Строка") Тогда
		Поз = Найти(Сертификат, "CN=");
		Если Поз > 0 Тогда
			Владелец = Сред(Сертификат, Поз + 3);
			ПозРазделителя = Найти(Владелец, ",");
			Если ПозРазделителя > 0 Тогда
				Владелец = Лев(Владелец, ПозРазделителя - 1);
			КонецЕсли;
		Иначе
			Владелец = "";
		КонецЕсли;
		Поз = Найти(Сертификат, "SN=");
		Если Поз > 0 Тогда
			Владелец = Сред(Сертификат, Поз + 3);
			ПозРазделителя = Найти(Владелец, ",");
			Если ПозРазделителя > 0 Тогда
				Владелец = Лев(Владелец, ПозРазделителя - 1);
			КонецЕсли;
			Поз = Найти(Сертификат, "GN=");
			Если Поз > 0 Тогда
				Имя = Сред(Сертификат, Поз + 3);
				ПозРазделителя = Найти(Имя, ",");
				Если ПозРазделителя > 0 Тогда
					Владелец = Владелец + " " + Лев(Имя, ПозРазделителя - 1);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Поз = Найти(Сертификат, "O=");
		Если Поз > 0 Тогда
			Организация = Сред(Сертификат, Поз + 2);
			ПозРазделителя = Найти(Организация, ",");
			Если ПозРазделителя > 0 Тогда
				Организация = Лев(Организация, ПозРазделителя - 1);
			КонецЕсли;
		Иначе
			Организация = "";
		КонецЕсли;
		Если ЗначениеЗаполнено(Организация) ИЛИ ЗначениеЗаполнено(Владелец) Тогда
			Возврат Организация + " (" + Владелец + ")";
		Иначе
			Возврат Сертификат;
		КонецЕсли;
	Иначе
		Возврат ?(Сертификат.Субъект.Свойство("O"), Сертификат.Субъект.O, "") + " (" 
					+ ?(Сертификат.Субъект.Свойство("SN"), 
						Сертификат.Субъект.SN + " " 
													+ ?(Сертификат.Субъект.Свойство("GN"), 
														Сертификат.Субъект.GN, 
														""), 
						Сертификат.Субъект.CN)
					+ "). Выдан " + Сертификат.Издатель.CN;
	КонецЕсли;
КонецФункции


&НаСервере
Функция ПолучитьСписокДоступныхСертификатов(МассивОтпечатков)
	Попытка
		ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
		СписокДоступныхОтпечатков = ОбработкаОбъект.ПолучитьСписокДоступныхСертификатов(МассивОтпечатков);
	Исключение
		Возврат Новый Массив;	
	КонецПопытки;
	Возврат СписокДоступныхОтпечатков;
КонецФункции


#КонецОбласти


#Область Интерфейс

&НаКлиенте
Процедура Отправить(Команда)
	Если ПроверитьЗаполнение() Тогда
		Если EmailValid(ПочтовыйАдрес) Тогда
			//ОписаниеОповещения = Новый ОписаниеОповещения("ОтправитьЗавершение", ЭтаФорма);
			//ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			ОтправитьЗавершение();	
		Иначе
			Сообщить("Некорректный адрес электронной почты");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(СтрокаПароля = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	//Если НЕ ЗначениеЗаполнено(СтрокаПароля) ИЛИ СтрокаПароля = КодВозвратаДиалога.Отмена Тогда
	//	Сообщить("Не указан пароль от почты");
	//	Возврат;
	//КонецЕсли;
	СтруктураЗаполнения = Новый Структура("ИмяПользователя,ИмяОрганизации,ПочтовыйАдрес,ТекстПредложения,Сертификат");
	Если ЗначениеЗаполнено(Объект.ОтпечатокСертификата) Тогда
		Попытка
			СтруктураЗаполнения.Сертификат = СформироватьИмяПоСертификату(ПолучитьСертификатПоОтпечатку(Объект.ОтпечатокСертификата) );	
		Исключение
		КонецПопытки;
	КонецЕсли;
	СтруктураЗаполнения.ИмяПользователя = ИмяПользователя;
	СтруктураЗаполнения.ИмяОрганизации = ИмяОрганизации;
	СтруктураЗаполнения.ПочтовыйАдрес = ПочтовыйАдрес;
	СтруктураЗаполнения.ТекстПредложения = ТекстПредложения;
	ТекстПисьма = СформироватьТекстПисьма(СтруктураЗаполнения);
	Результат = ОтправитьПисьмо(ТекстПисьма);
	ПоказатьОповещениеПользователя(Результат.Заголовок, ,Результат.Текст);
	Закрыть();	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	Если Параметры.Свойство("КриптоПровайдер") Тогда
		КриптоПровайдер = Параметры.КриптоПровайдер;
	КонецЕсли;
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ИмяОрганизации = Объект.Организация.Наименование;
	КонецЕсли;
	Элементы.ПочтовыйСервис.СписокВыбора.Добавить("smtp.yandex.ru", "Яндекс (smtp.yandex.ru)");
	Элементы.ПочтовыйСервис.СписокВыбора.Добавить("smtp.mail.ru", "Mail.ru (smpt.mail.ru)");
	Элементы.ПочтовыйСервис.СписокВыбора.Добавить("smtp.gmail.com", "Google (smtp.gmail.com)");
	Элементы.ПочтовыйСервис.СписокВыбора.Добавить("smtp.rambler.ru", "Rambler (smtp.rambler.ru)");
	Элементы.ПочтовыйСервис.СписокВыбора.Добавить("smtp.mail.yahoo.com", "Yahoo (smtp.mail.yahoo.com)");
КонецПроцедуры

&НаКлиенте
Процедура СогласиеНаОбработкуПДнПриИзменении(Элемент)
	Элементы.Отправить.Доступность = СогласиеНаОбработкуПДн;
КонецПроцедуры

&НаКлиенте
Процедура ПочтовыйАдресПриИзменении(Элемент)
	Собака = Найти(ПочтовыйАдрес, "@");
	Если Собака > 0 Тогда
		Домен = Сред(ПочтовыйАдрес, Собака + 1);
		Если Найти(Домен, "yandex.ru") Тогда ПочтовыйСервис = "smtp.yandex.ru" КонецЕсли;
		Если Найти(Домен, "mail.ru") Тогда ПочтовыйСервис = "smtp.mail.ru" КонецЕсли;
		Если Найти(Домен, "gmail.com") Тогда ПочтовыйСервис = "smtp.gmail.com" КонецЕсли;
		Если Найти(Домен, "rambler.ru") Тогда ПочтовыйСервис = "smtp.rambler.ru" КонецЕсли;
		Если Найти(Домен, "yahoo.com") Тогда ПочтовыйСервис = "smtp.mail.yahoo.com" КонецЕсли;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти