Функция ПолучитьДоговорПеревозчика(Перевозчик)  Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Владелец", Перевозчик);  
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;                 
	
	Возврат Неопределено;
	
	
КонецФункции

Процедура СоздатьТРНПоЗаявке(Заявка) Экспорт
	
	МассивРеализаций = Документы.ЗаданиеНаДоставку.ПолучитьМассивРеализацийДляОтправкиВЭДО(Заявка.ЗаданиеНаДоставку);
	
	Если МассивРеализаций.Количество() = 0 Тогда
		
		Сообщить("Отсутствуют реализации для создания ТРН");
		Возврат;
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивРеализаций)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Реализации.Ссылка КАК Реализация,
	|	МАКСИМУМ(ЕСТЬNULL(ТранспортнаяНакладнаяДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ТРН
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ПО ВТ_Реализации.Ссылка = ТранспортнаяНакладнаяДокументыОснования.ДокументОснование
	|			И (НЕ ТранспортнаяНакладнаяДокументыОснования.Ссылка.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Реализации.Ссылка";
	
	Запрос.УстановитьПараметр("МассивРеализаций", МассивРеализаций);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	КоличествоСоздано = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.ТРН) Тогда
			Продолжить;	
		КонецЕсли;  
		
		КоличествоСоздано = КоличествоСоздано + 1;
		
		ТН = Документы.ТранспортнаяНакладная.СоздатьДокумент();
		ТН.Дата = ТекущаяДата();
		ТН.ЗаданиеНаДоставку = Заявка.ЗаданиеНаДоставку;    
		ТН.ЗаказЗаявка = Заявка;
		ТН.Заполнить(Выборка.Реализация);  													
		ТН.Записать(РежимЗаписиДокумента.Проведение);   
		
	КонецЦикла;      
	
	Сообщить("Было успешно создано: " + Строка(КоличествоСоздано) + " документов");
	
КонецПроцедуры
