
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаДоставку") Тогда	 
		
		Автомобиль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Автомобиль");
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		Контрагент = Автомобиль.ТранспортнаяКомпания;
		ДоговорКонтрагента = Документы.ЗаказЗаявка.ПолучитьДоговорПеревозчика(Контрагент);
		ЗаданиеНаДоставку = ДанныеЗаполнения; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		Контрагент = Автомобиль.ТранспортнаяКомпания;
		ДоговорКонтрагента = Документы.ЗаказЗаявка.ПолучитьДоговорПеревозчика(Контрагент);
		ЗаданиеНаДоставку = ДанныеЗаполнения.ЗаданиеНаДоставку; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(ЗаданиеНаДоставку) Тогда
		
		МассивРеквизитовПроверки = Новый Массив;
		МассивРеквизитовПроверки.Добавить("ТелефонКонтрагента");
		МассивРеквизитовПроверки.Добавить("ДатаПогрузки");
		МассивРеквизитовПроверки.Добавить("КоличествоГрузомест");
		МассивРеквизитовПроверки.Добавить("ВесГруза");
		МассивРеквизитовПроверки.Добавить("ОбъемГруза");
		МассивРеквизитовПроверки.Добавить("Грузоподъемность");
		МассивРеквизитовПроверки.Добавить("Вместимость");
		
		Для каждого Рекв Из МассивРеквизитовПроверки Цикл
			
			Если Не ЗначениеЗаполнено(ЭтотОбъект[Рекв]) Тогда
				
				Сообщить("Не заполнен реквизит: " + Рекв);
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Грузополучатели.Количество() = 0 Тогда
			
			Сообщить("Заполните грузополучателей");
			Отказ = Истина;
	
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	ОтветПеревозчика = "";
	
КонецПроцедуры

