Перем АдресСервисаПоддержки;
Перем ВеткаРазработки;
Перем НомерВерсии;
Перем ДатаРелиза;  

Перем ИспользоватьЛицензирование;

////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область ПодключениеВнешнейОбработки	      //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ПодключениеВнешнейОбработки

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	ПараметрыРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ПараметрыРегистрации.Вставить("Наименование", НСтр("ru = 'Модуль интеграции СЭДО DiState'"));
	ПараметрыРегистрации.Вставить("Версия", "2.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	ПараметрыРегистрации.Вставить("Информация", НСтр("ru = 'Модуль интеграции СЭДО DiState'"));
	//	ПараметрыРегистрации.Вставить("ВерсияБСП", "1.2.1.4");
	
	ТаблицаКоманд = ПолучитьТаблицуКоманд();
	
	ДобавитьКоманду(ТаблицаКоманд,
	НСтр("ru = 'Модуль интеграции СЭДО DiState'"),
	"Distate",
	"ОткрытиеФормы",
	Истина);
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции // СведенияОВнешнейОбработке()

Функция ПолучитьТаблицуКоманд()
	
	Команды = Новый ТаблицаЗначений;
	Команды.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	Команды.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	Команды.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	Возврат Команды;

КонецФункции

Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;

КонецПроцедуры

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти ПодключениеВнешнейОбработки      	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////






////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#Область ИнтерфейсОбработки 				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ИнтерфейсОбработки

////////////////////////////////////////////////////////////////////////
///////		Общие интерфейсные вызовы обработки					////////

Функция СформироватьСтруктуруДляРегистрации() 										Экспорт
	
	Возврат ЭДО_СформироватьСтруктуруДляРегистрации();	

КонецФункции

Функция ПолучитьСписокКриптоПровайдеров() 											Экспорт
	
	СписокПровайдеров = Новый СписокЗначений;
	СписокПровайдеров.Добавить(75, "КриптоПро CSP (ГОСТ Р 34.10-2001)");
	СписокПровайдеров.Добавить(80, "КриптоПро CSP (ГОСТ Р 34.10-2012)");   
	Возврат СписокПровайдеров;	

КонецФункции

Функция ЗаменитьИнфоПоляВДокументе(ДанныеДокумента, СтруктураИнфоПолей) 			Экспорт
	
	Результат = XML_ЗаменитьИнфоПоляВДокументе(ДанныеДокумента, СтруктураИнфоПолей);
	Возврат Результат;

КонецФункции

Функция ПолучитьМассивТоваровДокумента(ДанныеДокумента) 							Экспорт
	
	Возврат XML_ПрочитатьМассивТоваровДокумента(ДанныеДокумента);

КонецФункции

Функция ПолучитьИмяВеткиРазработки() 												Экспорт
	
	Возврат ВеткаРазработки;	

КонецФункции

Функция ПолучитьНомерВерсииРелиза()													Экспорт
	
	Возврат НомерВерсии;	

КонецФункции

////////////////////////////////////////////////////////////////////////
///////		Интерфейсные вызовы к системе ЭДО					////////

//Лицензируемые методы
Функция МассовоОтправитьПодписанныеДокументы(МассивСтруктур) 					Экспорт	
	
	Если НЕ ЛИЦ_ЛицензияДействительна() Тогда
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = ЭДО_МассовоОтправитьПодписанныеДокументы(МассивСтруктур);
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция МассовоСоздатьДокументыВЭДО(МассивСтруктур) 							Экспорт
	
	Если НЕ ЛИЦ_ЛицензияДействительна() Тогда
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = ЭДО_МассовоСоздатьДокументы(МассивСтруктур);
	ЗаписатьЖурналВФайл();
	Возврат Результат;	

КонецФункции

Функция ОтправитьПодписанныйДокумент(Контрагент, ТипДокумента, Контент, Подпись, СсылкаНаДокумент = Неопределено) Экспорт
	
	Если НЕ ЛИЦ_ЛицензияДействительна() Тогда
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Результат = ЭДО_ОтправитьПодписанныйДокумент(Контрагент, ТипДокумента, Контент, Подпись, СсылкаНаДокумент);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПолучитьСписокКонтрагентовВСистеме(МассивИНН) 							Экспорт	
	
	Если ЛИЦ_ЛицензияДействительна() Тогда
		Возврат ЭДО_ПолучитьСписокКонтрагентовВСистеме(МассивИНН);
	Иначе
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Новый Массив;
		
	КонецЕсли;

КонецФункции

Функция АвторизацияПоЛогинуИПаролю(АдресСервера, ИмяВхода, Пароль) 				Экспорт
	
	КНП_СкорректироватьАдресСервера(АдресСервера);	
	Результат = API_АвторизацияПоПаролю(Новый Структура("Login,Password", ИмяВхода, Пароль));	
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;	

КонецФункции

Функция АвторизацияПоСертификату(АдресСервера, ДанныеАвторизации) 				Экспорт
	
	КНП_СкорректироватьАдресСервера(АдресСервера);
	Результат = API_АвторизацияПоСертификату(ДанныеАвторизации);	
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВосстановитьКонтрагентаИзАрхива(ИдентификаторКонтрагента) 				Экспорт
	
	Результат = API_АктивироватьКонтрагента(ИдентификаторКонтрагента);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюБанков(БИКБанка = Неопределено) 					Экспорт
	
	Результат = ЭДО_СинхронизацияБанков(БИКБанка);	
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюВалют() 											Экспорт
	
	Результат = API_ПолучитьСписокВалют();	
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюЕдиницИзмерения() 								Экспорт
	
	Результат = ЭДО_СинхронизацияЕдиницИзмерения();		
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюКонтрагентов(ПолнаяЗагрузка = Ложь) 				Экспорт
	
	Результат = ЭДО_СинхронизацияКонтрагентов(ПолнаяЗагрузка);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюРегионов(БезАвторизации = Ложь) 					Экспорт
	
	Результат = API_ПолучитьСписокРегионов(БезАвторизации);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ВыполнитьСинхронизациюСтран() 											Экспорт
	
	Результат = API_ПолучитьСписокСтран();		
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ЗагрузкаДокументов(ДатаНачала, ДатаКонца) 								Экспорт
	
	ТаблицаДанных = ВходящиеДокументы.Выгрузить();
	ТаблицаДанных.Очистить();
	МассивВходящихПакетов = ЭДО_ЗагрузитьМассивВходящихЭД(ДатаНачала, ДатаКонца);
	
	Если ЗначениеЗаполнено(МассивВходящихПакетов) И ЗначениеЗаполнено(МассивВходящихПакетов.МассивПакетов) Тогда
		ЭДО_ОбработатьЭД(МассивВходящихПакетов.МассивПакетов, ТаблицаДанных);
	ИначеЕсли ЗначениеЗаполнено(МассивВходящихПакетов.ОписаниеОшибки) Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат МассивВходящихПакетов.ОписаниеОшибки;
		
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат ТаблицаДанных;

КонецФункции

Функция ЗакончитьПроцессАвторизации(Знач ПараметрыВозврата) 					Экспорт
	
	API_ЗакончитьАвторизацию(ПараметрыВозврата);
	
	ЗаписатьЖурналВФайл();
	Возврат ПараметрыВозврата;

КонецФункции

Функция ЗарегистрироватьсяВЭДО(СтруктураДанных, Подпись) 						Экспорт
	
	Контент = ЭДО_СформироватьЗапросНаРегистрацию(СтруктураДанных);
	Контент.Вставить("signature", КНП_ОбработатьСтрокуBase64(Подпись));
	Контент.Вставить("content", "please give me a sign");
	
	СтрокаКонтента = КНП_ЗаписатьJSONНаСервере(Контент);
	Результат = API_Регистрация(СтрокаКонтента);	
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ОтклонитьПриглашениеОтКонтрагента(ИдентификаторКонтрагента) 			Экспорт
	
	Результат = API_ДеактивироватьКонтрагента(ИдентификаторКонтрагента);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ОтправитьЗапросНаОбменСКонтрагентом(ИдентификаторКонтрагента) 			Экспорт
	
	Результат = API_СоздатьЗапросНаОбменСКонтрагентом(ИдентификаторКонтрагента);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ОтправитьПодписанноеИнфоСообщение(Контент, Подпись) 					Экспорт
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("content", Контент);
	СтруктураТелаЗапроса.Вставить("signature", КНП_ОбработатьСтрокуBase64(Подпись));
	Результат = API_ОтправитьДокументСПодписью("information_message", КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса));
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
		
		Если Результат.Получить("success") = Истина Тогда
			ВывестиУведомлениеПользователю("Информационное сообщение о регистрации успешно подписано. Рекомендуем переавторизоваться");	
		Иначе
			ВывестиУведомлениеПользователю(Результат.Получить("codeDescription") );
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ОтправитьПодписаннуюКвитанцию(ИдентификаторЭД, Контент, Подпись, Команда) Экспорт
	
	Результат = ЭДО_ОтправитьПодписаннуюКвитанцию(ИдентификаторЭД, Контент, Подпись, Команда);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПодписатьДокумент(ИдентификаторДокумента, Контент, Подпись) 			Экспорт
	
	Результат = ЭДО_ПодписатьСлужебныйДокумент(ИдентификаторДокумента, Контент, Подпись);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПолучитьДанныеАрхиваДокументов(МассивДокументов) 						Экспорт
	
	МассивДанныхПакета = ЭДО_ПолучитьДанныеАрхива(МассивДокументов);
	ЗаписатьЖурналВФайл();
	Возврат МассивДанныхПакета;

КонецФункции

Функция ПолучитьДанныеКонтрагентаПоИНН(ИННКонтрагента) 							Экспорт
	
	Результат = ЭДО_ПолучитьДанныеКонтрагентаПоИНН(ИННКонтрагента);
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция 	ПолучитьДанныеКонтрагентаПоИД(Знач ИДКонтрагента) 						Экспорт
	
	ИДКонтрагента = КНП_ЧислоБезГруппВВидеСтроки(ИДКонтрагента);
	Результат = ЭДО_ПолучитьДанныеКонтрагентаПоИД(ИДКонтрагента);
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция 	ПолучитьДанныеПакетаДокументов(ИдентификаторПакета) 					Экспорт
	
	Результат = ЭДО_ПолучитьДанныеПакетаДокументов(ИдентификаторПакета);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПолучитьДокументыВОбработке(ДатаНачала, ДатаКонца) 						Экспорт
	
	ТаблицаДанных = ЭДО_ПолучитьСписокДокументовВОбработке(ДатаНачала, ДатаКонца);
	ЗаписатьЖурналВФайл();
	Возврат ТаблицаДанных;

КонецФункции

Функция ПолучитьДокументыНаПодпись() 											Экспорт
	
	МассивСтруктур = ЭДО_ПолучитьСписокДокументовНаПодпись();
	ЗаписатьЖурналВФайл();
	Возврат МассивСтруктур;

КонецФункции

Функция ПолучитьИнфоСообщение() 												Экспорт
	
	Результат = Неопределено;
	ИнфоСооб = API_ПолучитьИнфоСообщение();
	
	Если ТипЗнч(ИнфоСооб) = Тип("Соответствие") Тогда
		
		Если ИнфоСооб.Получить("success") <> Неопределено Тогда
			
			Если ИнфоСооб.Получить("success") = Истина Тогда
				Результат = ИнфоСооб.Получить("content");
			Иначе
				ВывестиУведомлениеПользователю(ИнфоСооб.Получить("codeDescription") );
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПолучитьСписокДоступныхСертификатов(СписокОтпечатков, АдресСервера) 	Экспорт
	
	Если АдресСервера = Неопределено Тогда АдресСервера = HostAddress КонецЕсли;
	
	МассивДоступныхОтпечатков = ЭДО_ПолучитьСписокДоступныхСертификатов(АдресСервера, СписокОтпечатков);
	
	ЗаписатьЖурналВФайл();
	Возврат МассивДоступныхОтпечатков;

КонецФункции

Функция ПоместитьКонтрагентаВАрхив(ИдентификаторКонтрагента) 					Экспорт
	
	Результат = API_ДеактивироватьКонтрагента(ИдентификаторКонтрагента);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПринятьПриглашениеОтКонтрагента(ИдентификаторКонтрагента) 				Экспорт
	
	Результат = API_АктивироватьКонтрагента(ИдентификаторКонтрагента);	
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция СоздатьXMLДокументаИВернутьДляПодписания(СтрокаТаблицы) 				Экспорт
	
	Результат = Неопределено;
	
	Если МОП_ЭтоНеформализованныйДокумент(СтрокаТаблицы.Ссылка) Тогда
		Результат = ПолучитьДанныеНеформализованногоДокумента(СтрокаТаблицы.Ссылка);	
	Иначе
		
		//Белов Формирумем ХМЛ по СФ
		ДокументФормирования = Неопределено;
		
		Если СтрокаТаблицы.Свойство("СФ") И ЗначениеЗаполнено(СтрокаТаблицы.СФ) Тогда
			ДокументФормирования = СтрокаТаблицы.СФ;
		Иначе
			ДокументФормирования = СтрокаТаблицы.Ссылка;
		КонецЕсли;
		
		СтруктураЗапроса = ЭДО_СформироватьЭД(ДокументФормирования, СтрокаТаблицы.УПД);
		Результат = API_СоздатьXMLДокумента(ДокументФормирования, СтруктураЗапроса, СтрокаТаблицы.УПД);
		
		Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
			Результат = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция СоздатьXMLКвитанциюОбУточненииИВернутьДляПодписания(СтруктураДанных) 	Экспорт
	
	СтруктураЗапроса = ЭДО_СформироватьКвитанциюОтУточнении(СтруктураДанных.Тип, СтруктураДанных.Ссылка, СтруктураДанных.Причина);
	Результат = API_СоздатьКвитанциюОбОтклонении(СтруктураДанных.Идентификатор, СтруктураДанных.Тип, СтруктураЗапроса.ТелоЗапроса );
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция СоздатьXMLКвитанциюОПриемеИВернутьДляПодписания(СтруктураДанных) 		Экспорт
	
	СтруктураЗапроса = ЭДО_СформироватьКвитанциюОПриеме(СтруктураДанных.Тип, СтруктураДанных.Ссылка);
	Результат = API_СоздатьКвитанциюОПриеме(СтруктураДанных.Идентификатор, СтруктураЗапроса.ТелоЗапроса, СтруктураЗапроса.ТипДокумента );
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция СоздатьXMLКвитанциюОбАннулированииИВернутьДляПодписания(СтруктураДанных) 		Экспорт
	
	СтруктураЗапроса = ЭДО_СформироватьКвитанциюОбАннулировании(СтруктураДанных.ПричинаАннулирования, СтруктураДанных.Ссылка);
	Результат = API_СоздатьАннулированиеДокумента(СтруктураДанных.Идентификатор, СтруктураЗапроса.ТелоЗапроса );
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции



////////////////////////////////////////////////////////////////////////
///////		Интерфейсные вызовы к системе 1С					////////

//Лицензируемые вызовы
Функция ОбновитьРеквизитыКонтрагента(СтруктураДанных, СсылкаНаКонтрагента) 		Экспорт
	
	Если НЕ ЛИЦ_ЛицензияДействительна() Тогда
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Ложь;
		
	КонецЕсли;
	
	Результат = РС_ОбновитьРеквизитыКонтрагента(СтруктураДанных, СсылкаНаКонтрагента);
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция СоздатьНовогоКонтрагента(СтруктураДанныхКонтрагента) 					Экспорт
	
	Если НЕ ЛИЦ_ЛицензияДействительна() Тогда
		
		ВывестиУведомлениеПользователю("Лицензия не активирована! Опция недоступна");
		Возврат Ложь;
		
	КонецЕсли;
	
	Результат = МОП_СоздатьКонтрагента(СтруктураДанныхКонтрагента);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции


Функция ПолучитьБанковскийСчетОрганизации(СсылкаНаОрганизацию) 					Экспорт
	
	СтруктураВозврата = Новый Структура("БИК,НомерСчета");
	ДанныеПоСчету = МОП_ПолучитьБанковскийСчетОрганизации(СсылкаНаОрганизацию);
	
	Если ЗначениеЗаполнено(ДанныеПоСчету) Тогда
		
		Если КНП_ЕстьРеквизит(ДанныеПоСчету, "Банк") Тогда
			СтруктураВозврата.БИК = ДанныеПоСчету.Банк.Код;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ДанныеПоСчету, "НомерСчета") Тогда
			СтруктураВозврата.НомерСчета = ДанныеПоСчету.НомерСчета;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ПолучитьВсехКонтрагентов(ОтборБезИдентификатора = Ложь)					Экспорт
	Возврат РС_ПолучитьВсехКонтрагентов(ОтборБезИдентификатора);	
КонецФункции

Функция ПолучитьДанныеНеформализованногоДокумента(СсылкаНаДокумент) 			Экспорт
	
	СтруктураДанных = Новый Структура("title,number,date,originFileName,content,typeTitle");
	ТипДокумента = ЭДО_ОпределелитьТипНеформализованного(СсылкаНаДокумент);
	СтруктураДанных.typeTitle = ТипДокумента;
	СтруктураДанных.title = ТипДокумента;
	СтруктураДанных.number = СсылкаНаДокумент.Номер;
	СтруктураДанных.date = Формат(СсылкаНаДокумент.Дата, "ДФ=dd.MM.yyyy");
	СтруктураДанных.originFileName = СтрЗаменить(ТипДокумента, " ", "_") + ".pdf";
	
	Если ТипДокумента = "Акт сверки" Тогда
		
		ТабДок = КЗП_ПолучитьПФАктаСверки(СсылкаНаДокумент);
		СтруктураДанных.content = РС_ПодготовитьВложениеКНеформализованномуДокументу(ТабДок);
		
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат СтруктураДанных;

КонецФункции

Функция ПолучитьДокументы(ОтборВид = "", ОтборКлиент = Неопределено, ДатаНачала = Неопределено, ДатаКонца = Неопределено, Отправленные = Ложь, Коммент = "", УПД = Ложь) Экспорт
	
	Возврат РС_ПолучитьДокументы(ОтборВид, ОтборКлиент, ДатаНачала, ДатаКонца, Отправленные, Коммент, УПД);

КонецФункции

Функция ПолучитьДокументПоИдентификатору(Идентификатор) Экспорт
	
	Возврат РС_ПолучитьДокументПоИдентификатору(Идентификатор);

КонецФункции

Функция ПолучитьОрганизациюПоИННОГРН(ИНН, ОГРН, ВернутьМассив = Ложь) 			Экспорт
	
	Возврат МОП_ПолучитьОрганизацию(ИНН, ОГРН,,ВернутьМассив);	

КонецФункции

Функция ПолучитьПечатнуюФормуНеформализованногоДокумента(СсылкаНаДокумент) 		Экспорт
	
	Результат = Новый ТабличныйДокумент;
	ТипДокумента = ЭДО_ОпределелитьТипНеформализованного(СсылкаНаДокумент);
	
	Если ТипДокумента = "Акт сверки" Тогда
		Результат = КЗП_ПолучитьПФАктаСверки(СсылкаНаДокумент);
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ПолучитьСтруктуруАдресаОрганизации(СсылкаНаОрганизацию) 				Экспорт
	
	Возврат КЗП_ПолучитьСтруктуруАдресаИзБазы(СсылкаНаОрганизацию, КНП_ИмяКонфигурации());	

КонецФункции

Функция ПолучитьСтруктуруКонтрагента(СсылкаНаКонтрагента) 						Экспорт
	
	Результат = МОП_ПолучитьСтруктуруДанныхКонтрагента(СсылкаНаКонтрагента);	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Процедура ПривязатьИдентификаторКОбъекту1С(Объект,Идентификатор = Неопределено, Знач Переписывать = Ложь, Знач СвязанныеДокументы = Ложь) Экспорт
	
	РС_ПривязатьИдентификаторКОбъекту1С(Объект, Идентификатор, Переписывать, СвязанныеДокументы);	

КонецПроцедуры

Процедура ПривязатьИдентификаторПодразделенияВ1С(Объект, Идентификатор, Знач Переписывать = Ложь) Экспорт
	
	РС_ПривязатьИдентификаторПодразделенияВ1С(Объект, Идентификатор, Переписывать);	

КонецПроцедуры

Функция ПроверитьКорректностьЗаполненияРеквизитов() 							Экспорт
	
	Возврат КНП_ПроверкаКорректностиЗаполненияРеквизитов();	

КонецФункции

Функция	НайтиНесопоставленнуюНоменклатуру(СтрокаТЧ)								Экспорт
	
	Результат = РС_НайтиНесопоставленнуюНоменклатуру(СтрокаТЧ);
	ЗаписатьЖурналВФайл();
	Возврат Результат;	

КонецФункции

Функция	НайтиНесопоставленныеСтатьи(СтрокаТЧ)									Экспорт
	
	Результат = РС_НайтиНесопоставленныеСтатьиРасходов(СтрокаТЧ);
	ЗаписатьЖурналВФайл();
	Возврат Результат;	

КонецФункции

Процедура СоздатьДокументВ1С(СтрокаТЧ) 											Экспорт
	
	РС_СоздатьДокумент(СтрокаТЧ);
	ЗаписатьЖурналВФайл();

КонецПроцедуры

Функция СформироватьПечатнуюФормуXML(ДанныеXML, ТипФормы, Подписан = Ложь)		Экспорт
	
	Результат = ПФ_СформироватьПечатнуюФормуXML(ДанныеXML, ТипФормы, Подписан);
	ЗаписатьЖурналВФайл();
	Возврат Результат;	

КонецФункции

Процедура СформироватьРеквизитыВБазе() 											Экспорт
	
	КНП_СформироватьРеквизитыВБазе();

КонецПроцедуры



////////////////////////////////////////////////////////////////////////
///////		Интерфейсные вызовы системы лицензирования			////////

Функция ЛицензияДействительна()													Экспорт
	
	Возврат ЛИЦ_ЛицензияДействительна();	

КонецФункции

Функция ПолучитьДатуРелиза()													Экспорт
	
	Возврат ЛИЦ_ПолучитьДатуРелиза();	

КонецФункции

Функция ПолучитьНовуюВерсиюМодуля(ХешЗначение) 									Экспорт
	
	Возврат ЛИЦ_ПолучитьНовуюВерсиюМодуля(ХешЗначение);

КонецФункции

Функция ПолучитьСписокДоступныхМодулей() 										Экспорт
	
	Возврат ЛИЦ_ПолучитьСписокДоступныхМодулей();	

КонецФункции

Функция ПолучитьТокенЛицензии(ПинКод, ОрганизацияРегистрации) 					Экспорт
	
	Возврат ЛИЦ_ПолучитьТокенЛицензии(ПинКод, ОрганизацияРегистрации);

КонецФункции

Функция ПроверитьТокенЛицензии() 												Экспорт
	
	Возврат ЛИЦ_ПроверитьТокенЛицензии();

КонецФункции

Функция ПрочитатьТокенВСистеме() 												Экспорт
	
	Возврат ЛИЦ_ПрочитатьТокенВСистеме();

КонецФункции

Процедура СохранитьТокенВСистеме(Токен, ОрганизацияРегистрации) 					Экспорт
	
	ЛИЦ_СохранитьТокенВСистеме(Токен, ОрганизацияРегистрации);	

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////
///////		Интерфейсные вызовы системы техподдержки			//////////

//TODO
Функция ОтправитьПисьмоВТехПоддержку(ИмяПользователя, ПочтовыйАдрес, ТекстПисьма) Экспорт
	
КонецФункции


Функция	ПолучитьТаблицуСопоставленияНоменклатур()								Экспорт
	
	Результат = РС_ПолучитьТаблицуСопоставленийНоменклатур();
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция	СохранитьТаблицуСопоставленияНоменклатур(ТаблицаДанных)					Экспорт
	
	Результат = РС_ЗаписатьТаблицуСопоставленийНоменклатур(ТаблицаДанных);
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция	ПолучитьТаблицуСопоставленияСтатейРасходов()							Экспорт
	
	Результат = РС_ПолучитьТаблицуСопоставленийСтатейРасходов();
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция	СохранитьТаблицуСопоставленияСтатейРасходов(ТаблицаДанных)				Экспорт
	
	Результат = РС_ЗаписатьТаблицуСопоставленийСтатейРасходов(ТаблицаДанных);
	ЗаписатьЖурналВФайл();
	
	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////
///////		Интерфейсные вызовы дополнительных обработчиков		////////

Функция ДополнительныйОбработчикПринятиеДокумента(ДанныеДокумента, ТипДокумента)				Экспорт
	
	Возврат ДО_ПринятиеДокумента(ДанныеДокумента, ТипДокумента);	

КонецФункции


//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#КонецОбласти ИнтерфейсОбработки		 			  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область JSON-парсер               		      //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область JSONпарсер 

// 1С:JSON. JavaScript Object Notation парсер и сериализатор.
//
// Copyright © 2010-2013 Александр Переверзев
//
// Данная лицензия разрешает лицам, получившим копию данного программного 
// обеспечения и сопутствующей документации (в дальнейшем именуемыми «Программное 
// Обеспечение»), безвозмездно использовать Программное Обеспечение без ограничений, 
// включая неограниченное право на использование, копирование, изменение, 
// добавление, публикацию, распространение, сублицензирование и/или продажу копий 
// Программного Обеспечения, также как и лицам, которым предоставляется данное 
// Программное Обеспечение, при соблюдении следующих условий:
//
// Указанное выше уведомление об авторском праве и данные условия должны быть 
// включены во все копии или значимые части данного Программного Обеспечения.
//
// ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО 
// ГАРАНТИЙ, ЯВНО ВЫРАЖЕННЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ 
// ГАРАНТИЯМИ ТОВАРНОЙ ПРИГОДНОСТИ, СООТВЕТСТВИЯ ПО ЕГО КОНКРЕТНОМУ НАЗНАЧЕНИЮ И 
// ОТСУТСТВИЯ НАРУШЕНИЙ ПРАВ. НИ В КАКОМ СЛУЧАЕ АВТОРЫ ИЛИ ПРАВООБЛАДАТЕЛИ НЕ НЕСУТ 
// ОТВЕТСТВЕННОСТИ ПО ИСКАМ О ВОЗМЕЩЕНИИ УЩЕРБА, УБЫТКОВ ИЛИ ДРУГИХ ТРЕБОВАНИЙ ПО 
// ДЕЙСТВУЮЩИМ КОНТРАКТАМ, ДЕЛИКТАМ ИЛИ ИНОМУ, ВОЗНИКШИМ ИЗ, ИМЕЮЩИМ ПРИЧИНОЙ ИЛИ 
// СВЯЗАННЫМ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ 
// ИЛИ ИНЫМИ ДЕЙСТВИЯМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
//
//
// Александр Переверзев
// e-mail: a.v.pereverzev@gmail.com
// Версия: 2.0.0.17
//
//
// Особенности:
//	Парсер и сериализатор поддерживают два режима (формата) работы:
//		- Стандартный – полная поддержка стандарта JSON (подробнее см. <http://www.JSON.org/> и 
//		  <http://www.ietf.org/rfc/rfc4627.txt?number=4627>);
//		- Альтернативный – направлен на применение в проектах подразумевающих постоянный двусторонний
//		  обмен данными, по каналам связи Интернет, и требующих повышенную скорость обработки данных,
//		  минимизацию пересылаемых пакетов данных и однозначную идентификацию ссылочных типов во входящих данных.
//
//	Независимо от режима работы сериализатор, по требованию (см. Настройки), позволяет автоматически передавать 
//	не только уникальный идентификатор ссылки, но и ее представление, а парсер в свою очередь, 
//	анализируя входные данные, опускает представления ссылок, не включая их в результирующий набор данных.
//
//	При работе с проектами, в исходящих строковых данных которых не гарантируется отсутствие символов из диапазонов:
//		[0x007f, 0x009f], 0x00ad, [0x0600, 0x0604], 0x070f, [0x17b4, 0x17b5], 
//		[0x200c, 0x200f], [0x2028, 0x202f] [0x2060, 0x206f], 0xfeff, [0xfff0, 0xffff], 
//	рекомендуется не отключать настройку (см. Настройки) полного маскирования символов 
//	(подробнее см. <https://github.com/douglascrockford/JSON-js/blob/master/json2.js> и <http://sadesign.ru/tools/unicode>).
//
//	Независимо от режима работы сериализатор, по требованию (см. Настройки), может маскировать кириллические символы 
//	современных алфавитов славянских языков "АБВГҐДЂЃЕЀЁЄЖЗЅИЍІЇЙЈКЛЉМНЊОПРСТЋЌУЎФХЦЧЏШЩЪЫЬЭЮЯ" (включая нижний регистр) 
//	(подробнее см. <http://ru.wikipedia.org/wiki/Кириллица> и <http://ru.wikipedia.org/wiki/Кириллица_в_Юникоде>).
//
//	Поддерживаются все среды исполнения с ограничением сериализуемых типов. Используется кроссплатформенный код.
//
//
//
// История изменения:
//	Версия 2.0.0.17:
//		- (Новое) Маскирование кириллических символов современных алфавитов славянских языков (по требованию);
//		- (Новое) Поддержка сериализатором типов: ДвоичныеДанные, Картинка, ХранилищеЗначения;
//		- (Изменение) Рефакторинг переменных и процедур;
//		- (Исправление) Сериализация типа COMSafeArray;
//		- (Исправление) Удалены лишние ключевые слова "Экспорт".
//		- (Оптимизация) Уменьшение проверок связанных с режимом и параметрами парсинга и сериализцаии;
//		- (Оптимизация) Проверка необходимости анализа форматирования вынесена из процедуры анализа форматирования;
//		- (Оптимизация) Изменен алгоритм автоматического приведение объекта к структуре или соответствию в зависимости от имен свойств;
//		- (Оптимизация) Отказ от явного приведения типов в пользу неявного в операторах условий;
//		- (Оптимизация) Отказ от оператора "Попытка Исключение" при преобразовании строки к уникальному идентификатору;
//		- (Оптимизация) Изменен порядок проверки типов при парсинге.
//	Версия 2.0.0.15
//		- Релиз.
//
//
//
// Методы:
//	ПрочитатьJSON – парсер;
//	ЗаписатьJSON – сериализатор.
//
// Настройки и параметры:
//
//	Параметры функций:
//		Стандарт – определяет режим работы парсера и сериализатора:
//			- Истина		– стандартный режим (значение по умолчанию);
//			- Ложь			– альтернативный режим;
//			- Неопределено	– автоматическое определение режима входящих данных
//							  (только парсер, не рекомендуется – влияет на производительность).
//
//		ПредставленияСсылок – позволяет автоматически передавать не только значение ссылки, но и ее представление:
//			- Истина		- ссылка парсится и сериализуется как объект с двумя свойствами "Ссылка" и "Представление";
//			- Ложь			- ссылка парсится и сериализуется как уникальный идентификатор ссылки (значение по умолчанию);
//			- Неопределено	– автоматическое определение формата ссылок во входящих данных
//							  (только парсер, не рекомендуется – влияет на производительность).
//
//	Настройки:
//		АвтоматическоеПриведениеОбъектаКСтруктуре – автоматическое приведение объекта к структуре, а не к соответствию.
//			Настройка изменяется в функции "АвтоматическоеПриведениеОбъектаКСтруктуре" (по умолчанию отключена).
//			Автоматическое приведение к структуре выполняется только для объектов имена свойств, которых могут быть 
//			использованы как ключи структуры, все остальные объекты преобразуются в соответствие.
//
//		ПолноеМаскированиеСимволов – маскирование символов некорректно обрабатываемых JavaScript-ом.
//			Настройка изменяется в функции "НастройкаПолноеМаскированиеСимволов" (по умолчанию включена).
//			Не рекомендуется к использованию, так как влияет на производительность, но гарантирует безопасную передачу данных.
//			Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
//		МаскированиеКириллицы – маскирование кириллических символов современных алфавитов славянских языков.
//			Настройка изменяется в функции "НастройкаМаскированиеКириллицы" (по умолчанию отключена).
//			Не рекомендуется к использованию, так как влияет на производительность.
//			Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
//		НеявноеПриведениеПримитивныхЗначенийКлюча – неявное приведение примитивных значений ключей соответствий к строке.
//			Настройка изменяется в функции "НеявноеПриведениеПримитивныхЗначенийКлюча" (по умолчанию отключена).
//
//
// Альтернативный режим:
//		- Не поддерживается форматирование, как во входящих, так и в исходящих данных;
//		- Сериализация ссылочных типов в строковое служебное представление.
//
//
// Приятности:
//	Парсер:
//		- Устойчивость к некорректным данным и не подверженность injection атакам;
//		- Продвинутый синтаксический анализатор (указывает место и тип ошибки в данных);
//		- Поддержка форматирования во входящих данных (только стандартный режим);
//		- Безопасный разбор форматирования - незамаскированные символы форматирования в строковых значениях не будут утеряны;
//		- Поддержка строк в одинарных и в двойных кавычках;
//		- Автоматическое приведение объекта к структуре или соответствию в зависимости от имен свойств¹;
//		- Автоматическое преобразование к типу Дата строки вида "9999-99-99T99:99:99Z";
//		- Автоматическое преобразование к типу УникальныйИдентификатор строки вида "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
//		- Автоматического определение режима (стандартного или альтернативного) входящих данных;
//		- Автоматического определение необходимости отсечения представления ссылок;
//		- Однозначная идентификация ссылок (только альтернативный режим).
//	Сериализатор:
//		- Поддержка форматирования исходящих данных (только стандартный режим);
//		- Широкий состав сериализуемых типов данных, в том числе ссылок;
//		- Автоматическое приведение значений ключей соответствий к строковому представлению в формате 1С²;
//		- Автоматическое преобразование неподдерживаемых типов к строке;
//		- Маскирование кириллических символов современных алфавитов славянских языков;
//		- Нечувствительность к локализации³.
// ----
//  ¹ Если все имена свойства входящего объекта могут быть использованы как ключи структуры, 
//    то такой объект будет автоматически приведен к структуре, а не к соответствию. Управляется настройкой.
//  ² Управляется настройкой.
//  ³ При сериализации некоторых типов, исходящие объекты которых имеют обязательные свойства, 
//    такие представления и имена таких свойств всегда имеют русскую локализацию.
//
//
// Неприятности:
//		- Нестандартно форматированный код (Alt+Shift+F в помощь) на гране читаемости; 
//		- Сериализатор ориентирован, на средние-крупные пакеты данных.
//
// Сериализуемые типы:
//	Сервер, толстый клиент, тонкий клиент, веб-клиент:
//		- Неопределено;
//		- Null;
//		- Примитивные типы (все);
//		- Универсальные коллекции значений (клиентские);
//		- УникальныйИдентификатор;
//		- ДвоичныеДанные;
//		- Картинка.
//	Сервер, толстый клиент:
//		- Универсальные коллекции значений (серверные);
//		- ЛюбаяСсылка;
//		- Запрос;
//		- РезультатЗапроса;
//		- ВыборкаИзРезультатаЗапроса;
//		- ПостроительЗапроса;
//		- ПостроительОтчета;
//		- ХранилищеЗначения.
//	Сервер:
//		- ДанныеФормыКоллекция;
//		- ДанныеФормыСтруктураСКоллекцией;
//		- ДанныеФормыДерево.
//
// Порядок сериализации типов:
//		- Неопределено - сериализуется как Null;
//		- Null - согласно стандарту;
//		- Примитивные типы - согласно стандарту;
//		- Массивы и COMSafeArray - массив, согласно стандарту:
//				[ Значение, ... ]
//
//		- Структуры и соответствия – объект, согласно стандарту;
//				{ Ключ:Значение, ... }
//
//		- СписокЗначений - массив объектов с тремя свойствами "Значение", "Представление" и "Пометка";
//				[ { "Значение":Значение, "Представление":Представление, "Пометка":Пометка }, ... ]
//
//		- КлючИЗначение - объект с двумя свойствами "Ключ" и "Значени";
//				{ "Ключ":Ключ, "Значение":Значение }
//
//		- ТаблицаЗначений - массив объектов: 
//				[ { Колонка:Значение, ... }, ... ]
//
//		- ДеревоЗначений - массив объектов с обязательным свойством "Строки":
//				[ { Колонка:Значение, ... , "Строки":[ { Колонка:Значение, ... , "Строки":[ ... ] } , ... ] }, ... ]
//
//		- УникальныйИдентификатор - приведение к строке вида "XXXXXXXX-XXXX-XXXX-XXXX-XXXXXXXXXXXX";
//
//		- ЛюбаяСсылка:
//			- Стандартный режим - получение уникального идентификатора ссылки (в том числе и для перечислений) и его сериализация;
//			- Альтернативный режим - приведение к строке служебного вида "¦ref¦ ... ¦";
//
//		  При сериализации ссылок в режиме автоматически передачи не только сериализованного значения ссылки, 
//		  но и ее представления. Каждая ссылка передается как объект с двумя свойствами "Ссылка" и "Представление";
//				{ "Ссылка":Ссылка, "Представление":Представление }
//
//		- Запрос - автоматически выполняется и сериализуется как таблица значений;
//		- РезультатЗапроса - сериализуется как таблица значений;
//		- ВыборкаИзРезультатаЗапроса - сериализуется как структура значений текущей запись результата запроса;
//		- ПостроительЗапроса - автоматически выполняется и сериализуется как таблица значений;
//		- ПостроительОтчета - автоматически выполняется и сериализуется как таблица значений;
//		- ДанныеФормыКоллекция - сериализуется как таблица значений;
//		- ДанныеФормыСтруктураСКоллекцией - сериализуется как таблица значений;
//		- ДанныеФормыДерево - сериализуется как дерево значений;
//		- ДвоичныеДанные - кодируется по алгоритму base64¹ и сериализуется как строка;
//		- Картинка - автоматически преобразуется и сериализуется как двоичные данные;
//		- ХранилищеЗначения - автоматически извлекается сохраненное значение и сериализуется в зависимости от типа извлеченного значения.
// ----
//  ¹ Следуя рекомендациям стандарта, сериализатор при кодировании по алгоритму base64, не добавляет переводы строк 
//    в результирующие данные (подробнее см. <http://tools.ietf.org/html/rfc4648#section-3.1>).
//
// Производительность:
//	Производительность парсера исключительно зависит от набора входящих данных, а также от наличия форматирования.
//	Наихудшим вариантом является форматированный массив чисел, наилучшим - неформатированный массив строк.
//
//	Intel Core 2 Duo T5870 @ 2GHz - форматированный массив со всеми приблизительно равномерно встречающимися типами данных:
//		Парсер:			35 Кбайт/с.
//		Сериализатор:	165 Кбайт/с.
//
// Примечание:
//	Мало комментариев - без комментариев.
//
// Всем удачного программирования :)
//
//
// ─────────────────────────────────────────────────────────────────────────────
//	JSON
//
Функция ПрочитатьJSON83(Значение)
	
	тЧтение = Неопределено;
	Выполнить("тЧтение = Новый ЧтениеJSON;");
	тЧтение.УстановитьСтроку(Значение);
	
	Результат = "";
	Выполнить("Результат = ПрочитатьJSON(тЧтение, Истина);");
	
	Возврат Результат;

КонецФункции

// JSON парсер.
//
// Параметры:
//	Значение - Строка. Строка данных в формате JSON для парсинга;
//
//  Стандарт - Неопределено, Булево. Режим работы:
//		- Истина - стандартный режим (значение по умолчанию);
//		- Ложь - альтернативный режим;
//		- Неопределено - автоопределение режима;
//
//  ПредставленияСсылок - Неопределено, Булево. Режим передачи ссылочных типов, с их представлением или без:
//		- Истина - ссылки передаются вместе со своим представлением, как объекты с двумя свойствами содержащими саму ссылку и ее представление;
//		- Ложь - ссылки передаются без представления (значение по умолчанию).
//		- Неопределено - автоопределение режима.
// 
// Возвращаемое значение:
//  Набор данных согласно содержимому входящих данных. 
//
Функция ПрочитатьJSON82(Значение, Стандарт = Истина, ПредставленияСсылок = Ложь) 
	
	Возврат jsonПрочитатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
	
КонецФункции // ПрочитатьJSON()

Функция ЗаписатьJSON83(Значение)
	
	тЗапись = Неопределено;
	Выполнить("тЗапись = Новый ЗаписьJSON;");
	
	ПараметрыЗаписи = Неопределено;
	Выполнить("ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,,,,,Истина,Истина,,Ложь);");
	тЗапись.УстановитьСтроку(ПараметрыЗаписи);
	
	Результат = "";
	Выполнить("ЗаписатьJSON(тЗапись, Значение);");
	
	Результат = тЗапись.Закрыть();
	Возврат Результат;	

КонецФункции

// JSON сериализатор.
//
// Параметры:
//	Значение. Набор данных сериализуемых в формат JSON;
//
//  Стандарт - Булево. Режим работы:
//		- Истина - стандартный режим (значение по умолчанию);
//		- Ложь - альтернативный режим;
//
//  ПредставленияСсылок - Булево. Режим передачи ссылочных типов, с их представлением или без:
//		- Истина - ссылки передаются вместе со своим представлением, как объекты с двумя свойствами содержащими саму ссылку и ее представление;
//		- Ложь - ссылки передаются без представления (значение по умолчанию).
// 
// Возвращаемое значение:
//  Строка. Строка данных в формате JSON согласно содержимому входящих данных. 
//
Функция ЗаписатьJSON82(Значение, Стандарт = Истина, ПредставленияСсылок = Ложь) 
	
	Возврат jsonЗаписатьИнициализация(Значение, Стандарт, ПредставленияСсылок);
	
КонецФункции // ЗаписатьJSON()

// ─────────────────────────────────────────────────────────────────────────────
//  ЛОКАЛИЗАЦИЯ
Функция СформироватьСтрокуПоШаблону(Строка, Параметры)
	
	Результат = Строка;
	
	Для Каждого Параметр Из Параметры Цикл
		Результат = СтрЗаменить(Результат, "[" + Параметр.Ключ + "]", Строка(Параметр.Значение));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СформироватьСтрокуПоШаблону()

Функция ИсключениеПустойПакетДанных()
	
	Возврат НСтр("ru = 'JSON: Пустой пакет данных.'; uk = 'JSON: Порожній пакет даних.'");
	
КонецФункции // ИсключениеНеожиданноеОкончаниеСтроки()

Функция ИсключениеНекорректныйПакетДанных(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный пакет данных в позиции [Индекс].'; uk = 'JSON: Некоректний пакет даних у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйПакетДанных()

Функция ИсключениеНеожиданноеОкончаниеПакетаДанных()
	
	Возврат НСтр("ru = 'JSON: Неожиданное окончание пакета данных.'; uk = 'JSON: Несподіване закінчення пакета даних.'");
	
КонецФункции // ИсключениеНеожиданноеОкончаниеПакетаДанных()

Функция ИсключениеНеожиданноеОкончаниеМассива(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неожиданное окончание массива в позиции [Индекс].'; uk = 'JSON: Несподіване закінчення масиву у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНеожиданноеОкончаниеМассива()

Функция ИсключениеНеожиданноеОкончаниеОбъетка(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неожиданное окончание объекта в позиции [Индекс].'; uk = 'JSON: Несподіване закінчення об''єкту у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНеожиданноеОкончаниеОбъетка()

Функция ИсключениеНекорректныйТипNull(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Null в позиции [Индекс].'; uk = 'JSON: Некоректний тип Null у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипNull()

Функция ИсключениеНекорректныйТипБулево(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Булево в позиции [Индекс].'; uk = 'JSON: Некоректний тип Булево у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипБулево()

Функция ИсключениеНекорректныйТипНеопределено(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный тип Неопределено в позиции [Индекс].'; uk = 'JSON: Некоректний тип Невизначено у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйТипНеопределено()

Функция ИсключениеНекорректныйФорматСтроки(Индекс)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат строки в позиции [Индекс].'; uk = 'JSON: Некоректний формат рядка у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс));
	
КонецФункции // ИсключениеНекорректныйФорматСтроки()

Функция ИсключениеНекорректныйФорматДаты(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат даты [Значение] в позиции [Индекс].'; uk = 'JSON: Некоректний формат дати [Значение] у позиції [Индекс].'"),
	Новый Структура("Индекс", Индекс, Символ(034) + Значение + Символ(034)));
	
КонецФункции // ИсключениеНекорректныйФорматДаты()

Функция ИсключениеНекорректныйФорматЧисла(Индекс, Значение)
	
	Если ПустаяСтрока(Значение) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Неверный формат данных в позиции [Индекс].'; uk = 'JSON: Невірний формат даних у позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Некорректный формат числа [Значение] в позиции [Индекс].'; uk = 'JSON: Некоректний формат числа [Значение] у позиції [Индекс].'"),
		Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНекорректныйФорматЧисла()

Функция ИсключениеНедопустимыйСимвол(Индекс, Символ)
	
	Если (Символ = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый символ в позиции [Индекс].'; uk = 'JSON: Неприпустимий символ в позиції [Индекс].'"),
		Новый Структура("Индекс", Индекс));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый символ в позиции [Индекс], ожидается [Символ].'; uk = 'JSON: Неприпустимий символ в позиції [Индекс], очікується [Символ].'"),
		Новый Структура("Индекс,Символ", Индекс, Символ(034) + Символ + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНедопустимыйСимвол()

Функция ИсключениеНеопознанныйТип(Индекс, Тип)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип [Тип] в позиции [Индекс].'; uk = 'JSON: Неприпустимий тип [Тип] у позиції [Индекс].'"),
	Новый Структура("Индекс,Тип", Индекс, Символ(034) + Тип + Символ(034)));
	
КонецФункции // ИсключениеНеопознанныйТип()

Функция ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Невозможно преобразовать значение [Значение] в позиции [Индекс].'; uk = 'JSON: Неможливо перетворити значення [Значение] у позиції [Индекс].'"),
	Новый Структура("Индекс,Значение", Индекс, Символ(034) + Значение + Символ(034)));
	
КонецФункции // ИсключениеНевозможноПреобразоватьЗначение()

Функция ИсключениеНекорректныйПараметр(Параметр)
	
	Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимое значение параметра [Параметр].'; uk = 'JSON: Неприпустиме значення параметра [Параметр].'"),
	Новый Структура("Параметр", Символ(034) + Параметр + Символ(034)));
	
КонецФункции // ИсключениеНекорректныйПараметр()

Функция ИсключениеНедопустимыйТипКлюча(Индекс, Значение)
	
	Если (Индекс = Неопределено) Тогда
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип значения ключа [Тип].'; uk = 'JSON: Неприпустимий тип значення ключа [Тип].'"),
		Новый Структура("Тип", ТипЗнч(Значение)));
		
	Иначе
		
		Возврат СформироватьСтрокуПоШаблону(НСтр("ru = 'JSON: Недопустимый тип значения ключа [Тип] в позиции [Индекс].'; uk = 'JSON: Неприпустимий тип значення ключа [Тип] в позиції [Индекс].'"),
		Новый Структура("Индекс,Тип", Индекс, Символ(034) + ТипЗнч(Значение) + Символ(034)));
		
	КонецЕсли;
	
КонецФункции // ИсключениеНедопустимыйТипКлюча()

Функция ИсключениеНевозможноВыполнитьЗапрос(Описание)
	
	Позиция = Найти(Описание, "}: "); Если Позиция Тогда Позиция = Позиция + 3; Иначе Позиция = 1; КонецЕсли;
	Длина = Найти(Описание, Символы.ПС); Если Длина Тогда Длина = Длина - Позиция; Иначе Длина = СтрДлина(Описание); КонецЕсли;
	Возврат НСтр("ru = 'JSON: Невозможно выполнить запрос. '; uk = 'JSON: Неможливо виконати запит. '") + Сред(Описание, Позиция, Длина) + ".";
	
КонецФункции // ИсключениеНевозможноВыполнитьЗапрос()

// ─────────────────────────────────────────────────────────────────────────────
//  НАСТРОЙКИ

// Функция управляющая настройкой "АвтоматическоеПриведениеОбъектаКСтруктуре".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется автоматическое приведение объекта к структуре; 
//		- Ложь - автоматическое приведение объекта к структуре не выполняется, все объекты преобразуются в соответствие. 
//
// Примечание:
//  Автоматическое приведение к структуре выполняется только для объектов имена свойств которых могут быть 
//  использованы как ключи структуры, все остальные объекты преобразуются в соответствие.
//
Функция НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()
	
	Возврат Ложь;	// Измените для использования автоматического приведения объекта к структуре.
	
КонецФункции // НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре()

// Функция управляющая настройкой "ПолноеМаскированиеСимволов".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется полное маскирование символов некорректно обрабатываемых JavaScript-ом; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаПолноеМаскированиеСимволов()
	
	Возврат Истина;	// Измените для неполного маскирования символов.
	
КонецФункции // НастройкаПолноеМаскированиеСимволов()

// Функция управляющая настройкой "МаскированиеКириллицы".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется маскирование кириллических символов; 
//		- Ложь - маскирование выполняется только согласно стандарту и дополнительно маскируются специальные символы. 
//
// Примечание:
//	Маскирование специальных символов из диапазона [0x0000, 0x001f] выполняется в не зависимости от настройки.
//
Функция НастройкаМаскированиеКириллицы()
	
	Возврат Ложь; // Измените для маскирования кириллических символов.
КонецФункции

// Функция управляющая настройкой "НеявноеПриведениеПримитивныхЗначенийКлюча".
//
// Возвращаемое значение:
//  Булево. Значение настройки:
//		- Истина - выполняется неявное приведение примитивных типов значений ключей соответствий к их строковому представлению в формате 1С; 
//		- Ложь - неявное приведение примитивных типов значений ключей соответствий к строковому представлению не выполняется. 
//
// Примечание:
//	Неявно приводимые типы: Null, Булево, Число, Дата, Строка, УникальныйИдентификатор.
//
Функция НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()
	
	Возврат Ложь;	// Измените для использования неявного приведения примитивных значений ключей соответствий к строке.
	
КонецФункции // НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча()

// ─────────────────────────────────────────────────────────────────────────────
//  ПАРСЕР

Функция jsonПрочитатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок)
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) И (Не Стандарт = Неопределено) Тогда 
		ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); 
	КонецЕсли; 
	
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) И (Не ПредставленияСсылок = Неопределено) Тогда 
		ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); 
	КонецЕсли; 
	
	// Использование более общего случая параметров.
	Альтернативный = (Стандарт = Неопределено) Или (Не Стандарт); 
	Стандарт = (Стандарт = Неопределено) Или Стандарт; 
	ПредставленияСсылок = (ПредставленияСсылок = Неопределено) Или ПредставленияСсылок;
	
	// Схема подстановок шестнадцатиричной системы.
	СхемаПодстановок = Новый Соответствие; 
	ШестнадцатиричнаяСистема = "0123456789abcdef"; 
	ДесятичноеЧисло = 0;
	
	Для ВторойРазряд = 1 По 16 Цикл 
		
		Для ПервыйРазряд = 1 По 16 Цикл 
			
			СхемаПодстановок.Вставить(Сред(ШестнадцатиричнаяСистема, ВторойРазряд, 1) + Сред(ШестнадцатиричнаяСистема, ПервыйРазряд, 1), ДесятичноеЧисло); 
			ДесятичноеЧисло = ДесятичноеЧисло + 1; 
			
		КонецЦикла; 
		
	КонецЦикла;
	
	// Вспомогательные данные.
	ВспомогательныеДанные = Новый Структура("ТипСтроки,СхемаПодстановок,АвтоматическиПриводитьКСтруктуре",
	Тип("Строка"),
	СхемаПодстановок,
	(НастройкаАвтоматическоеПриведениеОбъектаКСтруктуре() = Истина));
	
	// Стартовые значения.
	Индекс = 1; 
	Длина = СтрДлина(Значение);
	
	// Форматирование (первый шаг парсера).
	Если Стандарт Тогда 
		
		СимволыФорматирования = " " + Символы.ВК + Символы.ПС + Символы.Таб; 
		jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
		
	КонецЕсли;
	
	Если (Индекс > Длина) Тогда 
		ВызватьИсключение ИсключениеПустойПакетДанных(); 
	КонецЕсли; 
	
	// Парсер.
	Возврат jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Истина);
	
КонецФункции // jsonПрочитатьИнициализация()

Функция jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, ПервыйУровень)
	
	Символ = Сред(Значение, Индекс, 1);
	
	Если (Символ = """") Или (Символ = "'") Тогда        																	// " , '
		
		// Строка.
		Подстрока = Сред(Значение, Индекс + 1); 
		Начало = Индекс; 
		
		Пока Истина Цикл
			
			Позиция = Найти(Подстрока, Символ);
			
			Если (Позиция > 0) Тогда
				
				Индекс = Индекс + Позиция; 
				Откат = Позиция - 1; 
				Маскировка = Ложь; 
				
				Пока (Сред(Подстрока, Откат, 1) = "\") И Откат Цикл 
					
					Маскировка = Не Маскировка; 
					Откат = Откат - 1; 
					
				КонецЦикла;
				
				Если Маскировка Тогда 
					Подстрока = Сред(Подстрока, Позиция + 1); 
				Иначе 
					Прервать; 
				КонецЕсли;
				
			Иначе
				ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных();
			КонецЕсли;
			
		КонецЦикла;
		
		// Строка.
		Результат = jsonПрочитатьСтроку(Сред(Значение, Начало + 1, Индекс - Начало - 1), Стандарт, Начало, ВспомогательныеДанные.СхемаПодстановок, (Символ = "'"));
		
		Если jsonПрочитатьОпределитьДату(Результат) Тогда
			// Дата.
			Результат = jsonПрочитатьДату(Результат, Начало);
		ИначеЕсли jsonПрочитатьОпределитьИдентификатор(Результат) Тогда
			// Идентификатор.
			Результат = jsonПрочитатьИдентификатор(Результат, Начало);
		Иначе
			
			Если Альтернативный И jsonПрочитатьОпределитьВнутреннийТип(Результат) Тогда
				// Внутренний тип.
				Результат = jsonПрочитатьВнутреннийТип(Результат, Начало);
			КонецЕсли;
			
		КонецЕсли;
		
		// Корректировка индекса.
		Индекс = Индекс + 1;
		
	ИначеЕсли (Символ = "[") Тогда																							// [
		
		// Массив.
		Результат = Новый Массив;
		
		Индекс = Индекс + 1; 
		
		Если Стандарт Тогда 
			jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
		КонецЕсли; 
		
		Если (Индекс > Длина) Тогда 
			ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); 
		КонецЕсли;
		
		Символ = Сред(Значение, Индекс, 1); 
		
		Если (Символ = "]") Тогда														// ] 
			
			// Пустой массив.
			Индекс = Индекс + 1;
			
		Иначе
			
			Пока (Индекс <= Длина) Цикл
				
				// Значение.
				Результат.Добавить(jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь));
				
				Символ = Сред(Значение, Индекс, 1);
				
				Если (Символ = "]") Тогда																					// ]
					// Окончание массива.
					Индекс = Индекс + 1; Прервать;
				Иначе
					
					// Продолжение массива.
					Если (Символ = ",") Тогда																				// ,
						Индекс = Индекс + 1; 
						
						Если Стандарт Тогда 
							jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
						КонецЕсли; 
						
						Если (Индекс >= Длина) Тогда 
							ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); 
						КонецЕсли;
						
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли (Символ = "{") Тогда																							// {
		
		// Объект.
		Индекс = Индекс + 1; 
		
		Если Стандарт Тогда 
			jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
		КонецЕсли; 
		
		Если (Индекс > Длина) Тогда 
			ВызватьИсключение ИсключениеНеожиданноеОкончаниеМассива(Длина); 
		КонецЕсли;
		
		Символ = Сред(Значение, Индекс, 1); Если (Символ = "}") Тогда														// } 
			
			// Пустой объект.
			Индекс = Индекс + 1;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда 
				Результат = Новый Структура; 
			Иначе 
				Результат = Новый Соответствие; 
			КонецЕсли; 
			
		Иначе
			
			Результат = Новый Соответствие;
			
			ТипСтроки = ВспомогательныеДанные.ТипСтроки; 
			
			Пока (Индекс <= Длина) Цикл
				
				// Ключ.
				Начало = Индекс; 
				КлючЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь); 
				
				Если (Не ТипЗнч(КлючЭлемента) = ТипСтроки) Тогда 
					ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Начало, КлючЭлемента); 
				КонецЕсли;
				
				Символ = Сред(Значение, Индекс, 1);
				
				Если (Символ = ":") Тогда																					// :
					
					Индекс = Индекс + 1; 
					
					Если Стандарт Тогда 
						jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
					КонецЕсли; 
					
					Если (Индекс >= Длина) Тогда 
						ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); 
					КонецЕсли;
					
				Иначе
					ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ":");
				КонецЕсли;
				
				// Значение.
				ЗначениеЭлемента = jsonПрочитать(Значение, Стандарт, Альтернативный, ПредставленияСсылок, Индекс, Длина, ВспомогательныеДанные, СимволыФорматирования, Ложь);
				
				// Коллекция.
				Результат.Вставить(КлючЭлемента, ЗначениеЭлемента);
				
				Символ = Сред(Значение, Индекс, 1);
				
				Если (Символ = "}") Тогда																					// }
					// Окончание объекта.
					Индекс = Индекс + 1; Прервать;
				Иначе
					
					// Продолжение объекта.
					Если (Символ = ",") Тогда																				// ,
						
						Индекс = Индекс + 1; 
						
						Если Стандарт Тогда 
							jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
						КонецЕсли; 
						
						Если (Индекс >= Длина) Тогда 
							ВызватьИсключение ИсключениеНеожиданноеОкончаниеОбъетка(Длина); 
						КонецЕсли;
						
					Иначе
						ВызватьИсключение ИсключениеНедопустимыйСимвол(Индекс, ",");
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// Структура или соответствие.
			Если ВспомогательныеДанные.АвтоматическиПриводитьКСтруктуре Тогда
				
				РезультатСтруктура = Новый Структура; 
				
				Для Каждого Элемент Из Результат Цикл 
					
					Попытка 
						РезультатСтруктура.Вставить(Элемент.Ключ, Элемент.Значение); 
					Исключение 
						
						РезультатСтруктура = Результат; 
						АвтоматическоеПриведениеНеВыполнено = Истина; 
						Прервать; 
						
					КонецПопытки; 
					
				КонецЦикла;
				
				Результат = РезультатСтруктура;
				
				// Ссылка.
				Если ПредставленияСсылок Тогда 
					Результат = jsonПрочитатьСсылку(Результат, (АвтоматическоеПриведениеНеВыполнено = Истина)); 
				КонецЕсли;
				
			Иначе
				
				// Ссылка.
				Если ПредставленияСсылок Тогда 
					Результат = jsonПрочитатьСсылку(Результат, Истина); 
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Иначе
		
		// Остальные примитивные типы.
		Если (Символ = "n") Тогда
			
			// Null.
			Если (Сред(Значение, Индекс, 4) = "null") Тогда 
				
				Индекс = Индекс + 4; 
				Результат = Неопределено; 
				
			Иначе 
				ВызватьИсключение ИсключениеНекорректныйТипNull(Индекс); 
			КонецЕсли;
			
		ИначеЕсли (Символ = "t") Тогда
			
			// Истина.
			Если (Сред(Значение, Индекс, 4) = "true") Тогда 
				
				Индекс = Индекс + 4; 
				Результат = Истина; 
				
			Иначе 
				ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); 
			КонецЕсли;
			
		ИначеЕсли (Символ = "f") Тогда
			
			// Ложь.
			Если (Сред(Значение, Индекс, 5) = "false") Тогда 
				
				Индекс = Индекс + 5; 
				Результат = Ложь; 
				
			Иначе 
				ВызватьИсключение ИсключениеНекорректныйТипБулево(Индекс); 
			КонецЕсли;
			
		ИначеЕсли (Символ = "u") Тогда
			
			// Неопределено.
			Если (Сред(Значение, Индекс, 9) = "undefined") Тогда 
				
				Индекс = Индекс + 9; 
				Результат = Неопределено; 
				
			Иначе 
				ВызватьИсключение ИсключениеНекорректныйТипНеопределено(Индекс); 
			КонецЕсли;
			
		Иначе
			
			// Число.
			Начало = Индекс; 
			
			Пока Найти("-+0123456789.", Символ) И (Индекс <= Длина) Цикл 
				
				Индекс = Индекс + 1; 
				Символ = Сред(Значение, Индекс, 1); 
				
			КонецЦикла;
			
			// Преобразование числа.
			Попытка
				Результат = Число(Сред(Значение, Начало, Индекс - Начало));
			Исключение
				ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
			КонецПопытки;
			
			// Экспоненциальная часть.
			Если (Символ = "E") Или (Символ = "e") Тогда
				
				// Степень.
				Индекс = Индекс + 1; 
				Позиция = Индекс; 
				Символ = Сред(Значение, Индекс, 1); 
				
				Пока Найти("-+0123456789", Символ) И (Индекс <= Длина) Цикл
					
					Индекс = Индекс + 1; 
					Символ = Сред(Значение, Индекс, 1); 
					
				КонецЦикла;
				
				// Преобразование степени.
				Попытка
					Степень = Число(Сред(Значение, Позиция, Индекс - Позиция));
				Исключение
					ВызватьИсключение ИсключениеНекорректныйФорматЧисла(Начало, Сред(Значение, Начало, Индекс - Начало)); 
				КонецПопытки;
				
				// Возвидение числа в степень.
				Результат = Результат * Pow(10, Степень);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Форматирование.
	Если Стандарт Тогда 
		jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования); 
	КонецЕсли; 
	
	Если ПервыйУровень Тогда 
		
		Если (Индекс <= Длина) Тогда 
			ВызватьИсключение ИсключениеНекорректныйПакетДанных(Индекс); 
		КонецЕсли; 
		
	Иначе 
		
		Если (Индекс > Длина) Тогда 
			ВызватьИсключение ИсключениеНеожиданноеОкончаниеПакетаДанных(); 
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // jsonПрочитать()

Функция jsonПрочитатьОпределитьДату(Значение)
	
	// Проверка.
	Если (СтрДлина(Значение) = 20) Тогда
		
		Если (Сред(Значение, 05, 1) = "-") И				// -
			(Сред(Значение, 08, 1) = "-") И				// -
			(Сред(Значение, 11, 1) = "T") И				// T
			(Сред(Значение, 14, 1) = ":") И				// :
			(Сред(Значение, 17, 1) = ":") И				// :
			(Сред(Значение, 20, 1) = "Z") Тогда			// Z
			
			// Год. 
			Если Найти("0123456789", Сред(Значение, 01, 1)) И
				Найти("0123456789", Сред(Значение, 02, 1)) И
				Найти("0123456789", Сред(Значение, 03, 1)) И
				Найти("0123456789", Сред(Значение, 04, 1)) И
				// Месяц.
				Найти("0123456789", Сред(Значение, 06, 1)) И
				Найти("0123456789", Сред(Значение, 07, 1)) И
				// День.
				Найти("0123456789", Сред(Значение, 09, 1)) И
				Найти("0123456789", Сред(Значение, 10, 1)) И
				// Час.
				Найти("0123456789", Сред(Значение, 12, 1)) И
				Найти("0123456789", Сред(Значение, 13, 1)) И
				// Минута.
				Найти("0123456789", Сред(Значение, 15, 1)) И
				Найти("0123456789", Сред(Значение, 16, 1)) И
				// Секунда.
				Найти("0123456789", Сред(Значение, 18, 1)) И
				Найти("0123456789", Сред(Значение, 19, 1)) Тогда
				Возврат Истина; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьДату()

Функция jsonПрочитатьОпределитьИдентификатор(Значение)
	
	// Проверка.
	Если (СтрДлина(Значение) = 36) Тогда
		
		Если (Сред(Значение, 09, 1) = "-") И					// -
			(Сред(Значение, 14, 1) = "-") И					// -
			(Сред(Значение, 19, 1) = "-") И					// -
			(Сред(Значение, 24, 1) = "-") Тогда				// -
			
			// Первая часть. 
			Для Индекс = 01 По 08 Цикл 
				
				Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда 
					Возврат Ложь; 
				КонецЕсли; 
				
			КонецЦикла;
			
			// Вторая часть. 
			Для Индекс = 10 По 13 Цикл 
				
				Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда 
					Возврат Ложь; 
				КонецЕсли; 
				
			КонецЦикла;
			
			// Третья часть. 
			Для Индекс = 15 По 18 Цикл 
				
				Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда 
					Возврат Ложь; 
				КонецЕсли; 
				
			КонецЦикла;
			
			// Четвертая часть. 
			Для Индекс = 20 По 23 Цикл 
				
				Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда 
					Возврат Ложь; 
				КонецЕсли; 
				
			КонецЦикла;
			
			// Пятая часть. 
			Для Индекс = 25 По 36 Цикл 
				
				Если Не Найти("0123456789ABCDEFabcdef", Сред(Значение, Индекс, 1)) Тогда 
					Возврат Ложь; 
				КонецЕсли; 
				
			КонецЦикла;
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // jsonПрочитатьОпределитьИдентификатор()

Функция jsonПрочитатьОпределитьВнутреннийТип(Значение)
	
	// Поиск.
	Возврат (Лев(Значение, 1) = "¦") И (Сред(Значение, 5, 1) = "¦") И (Прав(Значение, 1) = "¦"); // ¦xxx¦ ... ¦
	
КонецФункции // jsonПрочитатьОпределитьВнутреннийТип()

Функция jsonПрочитатьСтроку(Значение, Стандарт, Индекс, СхемаПодстановок, ОдинарнаяКавычка)
	
	// Последоавтельность перемаскировки.
	ПоследоавтельностьПеремаскировки = "\" + Символ(65535);
	
	// Демаскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
	"\\",			ПоследоавтельностьПеремаскировки),		// Перемаскирование последовательности.
	"\/",			"/"),           // x2f
	"\b",			Символ(008)),	// x08
	"\t",			Символы.Таб),   // x09
	"\n",			Символы.ПС),    // x0a
	"\f",			Символы.ПФ),    // x0c
	"\r",			Символы.ВК),    // x0d
	"\""",			"""");          // x22
	
	// Демаскирование Юникод символов.
	Позиция = Найти(Результат, "\u"); 
	
	Пока Позиция Цикл
		
		СтаршийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 2, 2))]; 
		МладшийБайт = СхемаПодстановок[НРег(Сред(Результат, Позиция + 4, 2))]; 
		
		Если (СтаршийБайт = Неопределено) Или (МладшийБайт = Неопределено) Тогда 
			ВызватьИсключение ИсключениеНекорректныйФорматСтроки(Индекс); 
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, Сред(Результат, Позиция, 6), Символ(256 * СтаршийБайт + МладшийБайт)); 
		Позиция = Найти(Результат, "\u");
		
		
	КонецЦикла;
	
	// Одинарная кавычка.
	Если ОдинарнаяКавычка Тогда 
		Результат = СтрЗаменить(Результат, "\'", "'"); 
	КонецЕсли;
	
	// Демаскирование перемаскированой последовательности.
	Возврат СтрЗаменить(Результат, ПоследоавтельностьПеремаскировки, "\");				
	
КонецФункции // jsonПрочитатьСтроку()

Функция jsonПрочитатьДату(Значение, Индекс)
	
	// Поиск.
	Попытка
		Возврат Дата(Лев(Значение, 4) + Сред(Значение, 06, 2) + Сред(Значение, 09, 2) + 
		Сред(Значение, 12, 2) + Сред(Значение, 15, 2) + Сред(Значение, 18, 2));
	Исключение
		ВызватьИсключение ИсключениеНекорректныйФорматДаты(Индекс, Значение);
	КонецПопытки;
	
КонецФункции // jsonПрочитатьДату()

Функция jsonПрочитатьСсылку(Значение, Соответствие)
	
	Перем Ссылка;
	
	// Ссылка.
	Если (Значение.Количество() = 2) Тогда 
		
		Если Соответствие Тогда
			
			Ссылка = Значение.Получить("Ссылка"); 
			
			Если (Не Ссылка = Неопределено) И (Не Значение.Получить("Представление") = Неопределено) Тогда 
				Возврат Ссылка; 
			КонецЕсли;
			
		Иначе
			
			Если Значение.Свойство("Представление") И Значение.Свойство("Ссылка", Ссылка) Тогда 
				Возврат Ссылка; 
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Значение;
	
КонецФункции // jsonПрочитатьСсылку()

Функция jsonПрочитатьИдентификатор(Значение, Индекс)
	
	// Поиск.
	Возврат Новый УникальныйИдентификатор(Значение);
	
КонецФункции // jsonПрочитатьИдентификатор()

Функция jsonПрочитатьВнутреннийТип(Значение, Индекс)
	
	// Поиск.
	Тип = Сред(Значение, 2, 3); Данные = Сред(Значение, 6, СтрДлина(Значение) - 6);
	
	Если (Тип = "ref") Тогда
		
		Попытка
			Возврат ЗначениеИзСтрокиВнутр("{""#""," + СтрЗаменить(СтрЗаменить(Данные, "×", ":"), "÷", ",") + "}");
		Исключение
			ВызватьИсключение ИсключениеНевозможноПреобразоватьЗначение(Индекс, Значение);
		КонецПопытки;
		
	КонецЕсли;
	
	ВызватьИсключение ИсключениеНеопознанныйТип(Индекс, Тип);
	
КонецФункции // jsonПрочитатьВнутреннийТип()

Процедура jsonПрочитатьПропуститьФорматирование(Значение, Стандарт, Индекс, Длина, СимволыФорматирования)
	
	// Пропуск форматирования.
	Пока (Индекс <= Длина) И Найти(СимволыФорматирования, Сред(Значение, Индекс, 1)) Цикл 
		Индекс = Индекс + 1; 
	КонецЦикла;
	// Пробел его не видно, \r, \n, \t .
	
КонецПроцедуры // jsonПрочитатьПропуститьФорматирование()

// ─────────────────────────────────────────────────────────────────────────────
//  СЕРИАЛИЗАТОР

Функция jsonЗаписатьИнициализация(Значение, Знач Стандарт, Знач ПредставленияСсылок)
	
	// Проверка параметров.
	Если (Не Стандарт = Истина) И (Не Стандарт = Ложь) Тогда 
		ВызватьИсключение ИсключениеНекорректныйПараметр("Стандарт"); 
	КонецЕсли; 
	
	Если (Не ПредставленияСсылок = Истина) И (Не ПредставленияСсылок = Ложь) Тогда 
		ВызватьИсключение ИсключениеНекорректныйПараметр("ПредставленияСсылок"); 
	КонецЕсли; 
	
	ВспомогательныеДанные = Новый Структура;
	ВспомогательныеДанные.Вставить("ПримитивныеТипы", Новый ОписаниеТипов("Null,Булево,Число,Дата,УникальныйИдентификатор") );
	ВспомогательныеДанные.Вставить("Массивы", Новый ОписаниеТипов("Массив,ФиксированныйМассив,ФиксированнаяКоллекция") );
	ВспомогательныеДанные.Вставить("Структуры", Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура") );													// Массивы.
	ВспомогательныеДанные.Вставить("Соответствия", Новый ОписаниеТипов("Структура,ФиксированнаяСтруктура,Соответствие,ФиксированноеСоответствие") );		// Соответсвия.	
	ВспомогательныеДанные.Вставить("Построители", Новый ОписаниеТипов("ПостроительЗапроса,ПостроительОтчета"));
	ВспомогательныеДанные.Вставить("КлиентскиеТипы", Новый ОписаниеТипов("ДанныеФормыКоллекция,ДанныеФормыСтруктураСКоллекцией,ДанныеФормыДерево"));
	ВспомогательныеДанные.Вставить("ТипДопустимыхКлючей", Новый ОписаниеТипов("Строка"));	
	
	// Типы допустимых ключей.
	Если (НастройкаНеявноеПриведениеПримитивныхЗначенийКлюча() = Истина) Тогда 
		ВспомогательныеДанные.ТипДопустимыхКлючей = Новый ОписаниеТипов("Null,Булево,Число,Дата,Строка,УникальныйИдентификатор"); 
	КонецЕсли;
	
	// форматирование.
	Если Стандарт Тогда 
		
		Смещение = ""; 
		Отступ = " "; 
		Табуляция = "    "; 
		ПереносСтроки = Символы.ПС; 
		
	Иначе 
		
		Смещение = ""; 
		Отступ = ""; 
		Табуляция = ""; 
		ПереносСтроки = ""; 
		
	КонецЕсли;
	
	// Сериализация.
	Возврат jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, 
	               (НастройкаПолноеМаскированиеСимволов() = Истина), (НастройкаМаскированиеКириллицы() = Истина));
	
КонецФункции // jsonЗаписатьИнициализация()

Функция jsonЗаписать(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, Смещение, Отступ, Табуляция, ПереносСтроки, 
	                       ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	
	// Определение типа.
	Тип = ТипЗнч(Значение);
	
	// Строка.
	Если (Тип = Тип("Строка")) Тогда 
		Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	// Неопределено и примитивные типы.
	Если ВспомогательныеДанные.ПримитивныеТипы.СодержитТип(Тип) Тогда 
		
		Если (Значение = Null) Или (Значение = Неопределено) Тогда 
			Возврат "null"; 
		ИначеЕсли (Тип = Тип("Дата")) Тогда 
			Возврат """" + XMLСтрока(Значение) + "Z"""; 
		ИначеЕсли (Тип = Тип("УникальныйИдентификатор")) Тогда 
			Возврат """" + XMLСтрока(Значение) + """"; 
		Иначе 
			Возврат XMLСтрока(Значение); 
		КонецЕсли;
		
	КонецЕсли;
	
	// Структуры и строка дерева значений (структурой).
	Если ВспомогательныеДанные.Структуры.СодержитТип(Тип) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Если (Колонки = Неопределено) Тогда
				
				// Структуры.
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; 
					
					Для Каждого Элемент Из Значение Цикл
						
						Если Первый Тогда
							
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) 
							          + ":" + Отступ 
									  + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, 
									            Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
							Первый = Ложь;
							
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение 
							          + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) 
									  + ":" + Отступ 
									  + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, 
									    Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					Первый = Истина; 
					
					Для Каждого Элемент Из Значение Цикл
						
						Если Первый Тогда
							
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ 
							          + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, 
									   Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
							Первый = Ложь;
							
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ 
							          + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				
				// Строка дерева значений (структурой).
				Если МаскированиеКириллицы Тогда
					
					Первый = Истина; 
					
					Для Каждого Элемент Из Значение Цикл
						
						Если (Элемент.Ключ = "Строки") Тогда 
							Продолжить; 
						КонецЕсли;
						
						Если Первый Тогда
							
							Результат = ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) 
							         + ":" + Отступ 
									 + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, 
									    Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
							Первый = Ложь;
							
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписатьСтроку(Элемент.Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы) + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
						
					КонецЦикла;
					
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ 
						        + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, 
								Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """\u0421\u0442\u0440\u043e\u043a\u0438"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				Иначе
					
					Первый = Истина; 
					
					Для Каждого Элемент Из Значение Цикл
						
						Если (Элемент.Ключ = "Строки") Тогда 
							Продолжить; 
						КонецЕсли;
						
						Если Первый Тогда
							
							Результат = ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ 
							        + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, 
									  Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
							Первый = Ложь;
							
						Иначе
							Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """" + Элемент.Ключ + """:" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
						КонецЕсли;
						
					КонецЦикла;
					
					Если Первый Тогда
						Результат = ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, 
						     ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + """Строки"":" + Отступ 
						     + jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, 
							    Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустая структура.
			Возврат "{}";
			
		КонецЕсли;
	КонецЕсли;
	
	// Соответсвия.
	Если ВспомогательныеДанные.Соответсвия.СодержитТип(Тип) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			// Соответсвия.
			ТипДопустимыхКлючей = ВспомогательныеДанные.ТипДопустимыхКлючей;
			
			Если МаскированиеКириллицы Тогда
				
				Первый = Истина; 
				
				Для Каждого Элемент Из Значение Цикл
					
					Ключ = Элемент.Ключ; 
					
					Если ТипДопустимыхКлючей.СодержитТип(ТипЗнч(Ключ)) Тогда 
						Ключ = jsonЗаписатьСтроку(Строка(Ключ), ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					Иначе 
						ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); 
					КонецЕсли;
					
					Если Первый Тогда
						
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, 
						    ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
						Первый = Ложь;
						
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
				КонецЦикла;
				
			Иначе
				
				Первый = Истина; 
				
				Для Каждого Элемент Из Значение Цикл
					
					Ключ = Элемент.Ключ; 
					Тип = ТипЗнч(Ключ); 
					
					Если (Тип = Тип("Строка")) Тогда 
						Ключ = jsonЗаписатьСтроку(Ключ, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					ИначеЕсли ТипДопустимыхКлючей.СодержитТип(Тип) Тогда 
						Ключ = """" + Ключ + """"; 
					Иначе 
						ВызватьИсключение ИсключениеНедопустимыйТипКлюча(Неопределено, Ключ); 
					КонецЕсли;
					
					Если Первый Тогда
						
						Результат = ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, 
						    ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
						Первый = Ложь;
						
					Иначе
						Результат = Результат + "," + ПереносСтроки + СледующееСмещение + Ключ + ":" + Отступ + jsonЗаписать(Элемент.Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Возврат "{" + Результат + ПереносСтроки + Смещение + "}";
			
		Иначе
			
			// Пустое соответсвие.
			Возврат "{}";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Массивы.
	Если ВспомогательныеДанные.Массивы.СодержитТип(Тип) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Первый = Истина; 
			
			Для Каждого Элемент Из Значение Цикл
				
				Если Первый Тогда
					
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
					    СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					Первый = Ложь;
					
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Элемент, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, 
					     Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
				
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустой массив.
			Возврат "[]";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Список значений.
	Если (Тип = Тип("СписокЗначений")) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Структура = Новый Структура("Значение,Представление,Пометка");
			Первый = Истина; 
			
			Для Каждого Элемент Из Значение Цикл
				
				ЗаполнитьЗначенияСвойств(Структура, Элемент);
				
				Если Первый Тогда
					
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
					        СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					Первый = Ложь;
					
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
				
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустой список значений.
			Возврат "[]";
			
		КонецЕсли;
	КонецЕсли;
	
	// Таблица значений.
	Если (Тип = Тип("ТаблицаЗначений")) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Структура = Новый Структура; 
			НаборКолонок = Значение.Колонки; 
			
			Для Каждого Колонка Из НаборКолонок Цикл 
				Структура.Вставить(Колонка.Имя); 
			КонецЦикла;
			
			Первый = Истина; 
			
			Для Каждого Элемент Из Значение Цикл
				
				ЗаполнитьЗначенияСвойств(Структура, Элемент);
				
				Если Первый Тогда
					
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
					           СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					Первый = Ложь;
					
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
				
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустая таблица значений.
			Возврат "[]";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Коллекция строк дерева значений.
	Если (Тип = Тип("КоллекцияСтрокДереваЗначений")) Тогда
		
		Если Значение.Количество() Тогда
			
			// форматирование.
			СледующееСмещение = Смещение + Табуляция;
			
			Структура = Колонки; 
			Первый = Истина; 
			
			Для Каждого Элемент Из Значение Цикл
				
				ЗаполнитьЗначенияСвойств(Структура, Элемент); Структура.Строки = Элемент.Строки;
				
				Если Первый Тогда
					
					Результат = ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, 
					        СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
					Первый = Ложь;
					
				Иначе
					Результат = Результат + "," + ПереносСтроки + СледующееСмещение + jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Колонки, СледующееСмещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
				КонецЕсли;
				
			КонецЦикла;
			
			Возврат "[" + Результат + ПереносСтроки + Смещение + "]";
			
		Иначе
			
			// Пустая коллекция строк.
			Возврат "[]";
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Дерево значений.
	Если (Тип = Тип("ДеревоЗначений")) Тогда
		
		Структура = Новый Структура("Строки"); 
		НаборКолонок = Значение.Колонки; 
		
		Для Каждого Колонка Из НаборКолонок Цикл 
			Структура.Вставить(Колонка.Имя); 
		КонецЦикла;
		
		Возврат jsonЗаписать(Значение.Строки, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Структура, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		
	КонецЕсли;
	
	// Запрос.
	Если (Тип = Тип("Запрос")) Тогда 
		
		Попытка 
			Возврат jsonЗаписать(Значение.Выполнить().Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, 
			Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
		Исключение 
			ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); 
		КонецПопытки; 
		
	КонецЕсли;
	
	// Результат запроса.
	Если (Тип = Тип("РезультатЗапроса")) Тогда 
		Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, 
		Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	// Выборка из результата запроса.
	Если (Тип = Тип("ВыборкаИзРезультатаЗапроса")) Тогда
		
		Структура = Новый Структура; 
		НаборКолонок = Значение.Владелец().Колонки; 
		
		Для Каждого Колонка Из НаборКолонок Цикл 
			Структура.Вставить(Колонка.Имя); 
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(Структура, Значение);
		
		Возврат jsonЗаписать(Структура, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, 
		   ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		
	КонецЕсли;
	
	// Построители.
	Если ВспомогательныеДанные.Построители.СодержитТип(Тип) Тогда 
		
		Попытка 
			Значение.Выполнить(); 
		Исключение 
			ВызватьИсключение ИсключениеНевозможноВыполнитьЗапрос(ИнформацияОбОшибке().Причина.Описание); 
		КонецПопытки; 
	
		Возврат jsonЗаписать(Значение.Результат, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, 
		      ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
		
	КонецЕсли;
	
	// Хранилище значения.
	Если (Тип = Тип("ХранилищеЗначения")) Тогда 
		Возврат jsonЗаписать(Значение.Получить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, 
		   ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	
	// Двоичные данные.
	Если (Тип = Тип("ДвоичныеДанные")) Тогда
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
	КонецЕсли;
	
	// Картинка.
	Если (Тип = Тип("Картинка")) Тогда
		Возврат """" + СтрЗаменить(СтрЗаменить(СтрЗаменить(XMLСтрока(Значение.ПолучитьДвоичныеДанные()), Символы.ВК, ""), Символы.ПС, ""), "/", "\/") + """";
	КонецЕсли;
	
	// Ключ и значение.
	Если (Тип = Тип("КлючИЗначение")) Тогда 
		Возврат jsonЗаписать(Новый Структура("Ключ,Значение", Значение.Ключ, Значение.Значение), 
		            Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, Смещение, Отступ, Табуляция, 
					ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	// Клиентские типы.
	Если ВспомогательныеДанные.КлиентскиеТипы.СодержитТип(Тип) Тогда
		
		Если (Тип = Тип("ДанныеФормыДерево")) Тогда
			Возврат jsonЗаписать(ДанныеФормыВЗначение(Значение, Тип("ДеревоЗначений")), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
			    Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		Иначе
			Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
			   Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
		КонецЕсли;
		
	КонецЕсли;
	
	Если (Тип = Тип("COMSafeArray")) Тогда 
		Возврат jsonЗаписать(Значение.Выгрузить(), Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Неопределено, 
		   Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	
	// Ссылки.
	Перечисление = Перечисления.ТипВсеСсылки().СодержитТип(Тип);
	
	Если Перечисление Или
		Справочники.ТипВсеСсылки().СодержитТип(Тип) Или
		Документы.ТипВсеСсылки().СодержитТип(Тип) Или
		ПланыВидовХарактеристик.ТипВсеСсылки().СодержитТип(Тип) Или
		ПланыСчетов.ТипВсеСсылки().СодержитТип(Тип) Или
		ПланыВидовРасчета.ТипВсеСсылки().СодержитТип(Тип) Или
		Задачи.ТипВсеСсылки().СодержитТип(Тип) Или
		БизнесПроцессы.ТипВсеСсылки().СодержитТип(Тип) Или
		БизнесПроцессы.ТипВсеСсылкиТочекМаршрутаБизнесПроцессов().СодержитТип(Тип) Или
		ПланыОбмена.ТипВсеСсылки().СодержитТип(Тип) Тогда 
		Возврат jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, 
		   ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
	КонецЕсли;
	
	
	// Неподдерживаемые типы.
	Возврат jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы);
	
КонецФункции // jsonЗаписать()

Функция jsonЗаписатьСтроку(Значение, ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	
	// Маскирование служебных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Значение, 
	"\",			"\\"),			// x5c
	"/",			"\/"),			// x2f
	Символ(008),	"\b"),			// x08
	Символы.Таб,	"\t"), 			// x09
	Символы.ПС,		"\n"),			// x0a
	Символы.ПФ,		"\f"),			// x0c
	Символы.ВК,		"\r"),			// x0d
	"""",			"\""");			// x22
	
	// Маскирование специальных символов.
	Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
	Символ(00),		"\u0000"),
	Символ(01),		"\u0001"),
	Символ(02),		"\u0002"),
	Символ(03),		"\u0003"),
	Символ(04),		"\u0004"),
	Символ(05),		"\u0005"),
	Символ(06),		"\u0006"),
	Символ(07),		"\u0007"),
	Символ(11),		"\u000b"),
	Символ(14),		"\u000e"),
	Символ(15),		"\u000f"),
	Символ(16),		"\u0010"),
	Символ(17),		"\u0011"),
	Символ(18),		"\u0012"),
	Символ(19),		"\u0013"),
	Символ(20),		"\u0014"),
	Символ(21),		"\u0015"),
	Символ(22),		"\u0016"),
	Символ(23),		"\u0017"),
	Символ(24),		"\u0018"),
	Символ(25),		"\u0019"),
	Символ(26),		"\u001a"),
	Символ(27),		"\u001b"),
	Символ(28),		"\u001c"),
	Символ(29),		"\u001d"),
	Символ(30),		"\u001e"),
	Символ(31),		"\u001f");
	
	Если ПолноеМаскированиеСимволов Тогда
		
		// Маскирование сиволов обрабатываемых JavaScript-ом не правильно.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(127),	"\u007f"),
		Символ(128),	"\u0080"),
		Символ(129),	"\u0081"),
		Символ(130),	"\u0082"),
		Символ(131),	"\u0083"),
		Символ(132),	"\u0084"),
		Символ(133),	"\u0085"),
		Символ(134),	"\u0086"),
		Символ(135),	"\u0087"),
		Символ(136),	"\u0088"),
		Символ(137),	"\u0089"),
		Символ(138),	"\u008a"),
		Символ(139),	"\u008b"),
		Символ(140),	"\u008c"),
		Символ(141),	"\u008d"),
		Символ(142),	"\u008e"),
		Символ(143),	"\u008f"),
		Символ(144),	"\u0090"),
		Символ(145),	"\u0091"),
		Символ(146),	"\u0092"),
		Символ(147),	"\u0093"),
		Символ(148),	"\u0094"),
		Символ(149),	"\u0095"),
		Символ(150),	"\u0096"),
		Символ(151),	"\u0097"),
		Символ(152),	"\u0098"),
		Символ(153),	"\u0099"),
		Символ(154),	"\u009a"),
		Символ(155),	"\u009b"),
		Символ(156),	"\u009c"),
		Символ(157),	"\u009d"),
		Символ(158),	"\u009e"),
		Символ(159),	"\u009f"),
		Символ(173),	"\u00ad");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(1536),	"\u0600"),
		Символ(1537),	"\u0601"),
		Символ(1538),	"\u0602"),
		Символ(1539),	"\u0603"),
		Символ(1540),	"\u0604"),
		Символ(1807),	"\u070f"),
		Символ(6068),	"\u17b4"),
		Символ(6069),	"\u17b5"),
		Символ(8204),	"\u200c"),
		Символ(8205),	"\u200d"),
		Символ(8206),	"\u200e"),
		Символ(8207),	"\u200f"),
		Символ(8232),	"\u2028"),
		Символ(8233),	"\u2029"),
		Символ(8234),	"\u202a"),
		Символ(8235),	"\u202b"),
		Символ(8236),	"\u202c"),
		Символ(8237),	"\u202d"),
		Символ(8238),	"\u202e"),
		Символ(8239),	"\u202f"),
		Символ(8288),	"\u2060"),
		Символ(8289),	"\u2061"),
		Символ(8290),	"\u2062"),
		Символ(8291),	"\u2063"),
		Символ(8292),	"\u2064"),
		Символ(8293),	"\u2065"),
		Символ(8294),	"\u2066"),
		Символ(8295),	"\u2067");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		Символ(8296),	"\u2068"),
		Символ(8297),	"\u2069"),
		Символ(8268),	"\u206a"),
		Символ(8299),	"\u206b"),
		Символ(8300),	"\u206c"),
		Символ(8301),	"\u206d"),
		Символ(8302),	"\u206e"),
		Символ(8303),	"\u206f"),
		Символ(65279),	"\ufeff"),
		Символ(65520),	"\ufff0"),
		Символ(65521),	"\ufff1"),
		Символ(65522),	"\ufff2"),
		Символ(65523),	"\ufff3"),
		Символ(65524),	"\ufff4"),
		Символ(65525),	"\ufff5"),
		Символ(65526),	"\ufff6"),
		Символ(65527),	"\ufff7"),
		Символ(65528),	"\ufff8"),
		Символ(65529),	"\ufff9"),
		Символ(65530),	"\ufffa"),
		Символ(65531),	"\ufffb"),
		Символ(65532),	"\ufffc"),
		Символ(65533),	"\ufffd"),
		Символ(65534),	"\ufffe"),
		Символ(65535),	"\uffff");
		
	КонецЕсли;
	
	Если МаскированиеКириллицы Тогда
		
		// Маскирование кириллических символов.
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"А",            "\u0410"),
		"Б",            "\u0411"),
		"В",            "\u0412"),
		"Г",            "\u0413"),
		"Д",            "\u0414"),
		"Е",            "\u0415"),
		"Ж",            "\u0416"),
		"З",            "\u0417"),
		"И",            "\u0418"),
		"Й",            "\u0419"),
		"К",            "\u041a"),
		"Л",            "\u041b"),
		"М",            "\u041c"),
		"Н",            "\u041d"),
		"О",            "\u041e"),
		"П",            "\u041f"),
		"Р",            "\u0420"),
		"С",            "\u0421"),
		"Т",            "\u0422"),
		"У",            "\u0423"),
		"Ф",            "\u0424"),
		"Х",            "\u0425"),
		"Ц",            "\u0426"),
		"Ч",            "\u0427"),
		"Ш",            "\u0428"),
		"Щ",            "\u0429"),
		"Ъ",            "\u042a"),
		"Ы",            "\u042b"),
		"Ь",            "\u042c"),
		"Э",            "\u042d"),
		"Ю",            "\u042e"),
		"Я",            "\u042f");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"а",            "\u0430"),
		"б",            "\u0431"),
		"в",            "\u0432"),
		"г",            "\u0433"),
		"д",            "\u0434"),
		"е",            "\u0435"),
		"ж",            "\u0436"),
		"з",            "\u0437"),
		"и",            "\u0438"),
		"й",            "\u0439"),
		"к",            "\u043a"),
		"л",            "\u043b"),
		"м",            "\u043c"),
		"н",            "\u043d"),
		"о",            "\u043e"),
		"п",            "\u043f"),
		"р",            "\u0440"),
		"с",            "\u0441"),
		"т",            "\u0442"),
		"у",            "\u0443"),
		"ф",            "\u0444"),
		"х",            "\u0445"),
		"ц",            "\u0446"),
		"ч",            "\u0447"),
		"ш",            "\u0448"),
		"щ",            "\u0449"),
		"ъ",            "\u044a"),
		"ы",            "\u044b"),
		"ь",            "\u044c"),
		"э",            "\u044d"),
		"ю",            "\u044e"),
		"я",            "\u044f");
		
		Результат = СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Результат, 
		"’",            "\u2019"),
		"Ґ",            "\u0490"),
		"Ђ",            "\u0402"),
		"Ѓ",            "\u0403"),
		"Ѐ",            "\u0400"),
		"Ё",            "\u0401"),
		"Є",            "\u0404"),
		"Ѕ",            "\u0405"),
		"Ѝ",            "\u040d"),
		"І",            "\u0406"),
		"Ї",            "\u0407"),
		"Ј",            "\u0408"),
		"Љ",            "\u0409"),
		"Њ",            "\u040a"),
		"Ћ",            "\u040b"),
		"Ќ",            "\u040c"),
		"Ў",            "\u040e"),
		"Џ",            "\u040f"),
		"ґ",            "\u0491"),
		"ђ",            "\u0452"),
		"ѓ",            "\u0453"),
		"ѐ",            "\u0450"),
		"ё",            "\u0451"),
		"є",            "\u0454"),
		"ѕ",            "\u0455"),
		"ѝ",            "\u045d"),
		"і",            "\u0456"),
		"ї",            "\u0457"),
		"ј",            "\u0458"),
		"љ",            "\u0459"),
		"њ",            "\u045a"),
		"ћ",            "\u045b"),
		"ќ",            "\u045c"),
		"ў",            "\u045e"),
		"џ",            "\u045f");						
		
	КонецЕсли;
	
	// Кавычки.
	Возврат """" + Результат + """";
	
КонецФункции // jsonЗаписатьСтроку()
Функция jsonЗаписатьСсылку(Значение, Стандарт, ПредставленияСсылок, ВспомогательныеДанные, Перечисление, Смещение, Отступ, Табуляция, ПереносСтроки, 
	             ПолноеМаскированиеСимволов, МаскированиеКириллицы)
	
	// Идентификатор.
	Если Стандарт Тогда 
		
		Если Перечисление Тогда 
			
			Идентификатор = Лев(Прав(ЗначениеВСтрокуВнутр(Значение), 33), 32); 
			Идентификатор = Прав(Идентификатор, 8) + "-" + Сред(Идентификатор, 21, 4) + "-" + Сред(Идентификатор, 17, 4) + "-" + Лев(Идентификатор, 4) 
			     + "-" + Сред(Идентификатор, 5, 12); 
			
		Иначе 
			Идентификатор = XMLСтрока(Значение); 
		КонецЕсли;
	Иначе 
		
		Идентификатор = ЗначениеВСтрокуВнутр(Значение); 
		Идентификатор = "¦ref¦" + СтрЗаменить(СтрЗаменить(Сред(Идентификатор, 6, СтрДлина(Идентификатор) - 6), ":", "×"), ",", "÷") + "¦";
		
	КонецЕсли;
	
	// Включая представление ссылки.
	Если ПредставленияСсылок Тогда 
		Возврат jsonЗаписать(Новый Структура("Ссылка,Представление", Идентификатор, Строка(Значение)), Стандарт, ПредставленияСсылок, ВспомогательныеДанные,
		     Неопределено, Смещение, Отступ, Табуляция, ПереносСтроки, ПолноеМаскированиеСимволов, МаскированиеКириллицы); 
	КонецЕсли;
	
	// Ссылка.
	Возврат """" + Идентификатор + """";
	
КонецФункции // jsonЗаписатьСсылку()

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти JSON-парсер                    	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область XML-парсер               		      //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область XMLпарсер

Функция XML_ПрочитатьВСтруктуру(ОбъектXML)
	
	Структура = Новый Структура;
	
	Если ТипЗнч(ОбъектXML) = Тип("ЧтениеXML") Тогда
		
		Попытка
			
			ОбъектXML.Прочитать();
			
			Если ОбъектXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				XML_ОбработатьНовыйУзел(Структура, ОбъектXML);
			КонецЕсли;
			
		Исключение
			
			ДобавитьВЖурнал(ОписаниеОшибки(), "ПрочитатьXMLВСтруктуру");
			Структура = Неопределено;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Структура;

КонецФункции

Процедура XML_ОбработатьНовыйУзел(КорневаяСтруктура, УзелXML)
	
	УзловаяСтруктура = Новый Структура;
	ИмяУзла = УзелXML.Имя;
	КоличествоЭлементов = УзелXML.КоличествоАтрибутов();
	
	Для Итер = 1 По КоличествоЭлементов Цикл
		
		УзелXML.ПрочитатьАтрибут();
		
		Попытка
			УзловаяСтруктура.Вставить(УзелXML.Имя, УзелXML.Значение);
		Исключение
		КонецПопытки;
		
	КонецЦикла;	
	
	Пока УзелXML.Прочитать() Цикл
		
		Если УзелXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			XML_ОбработатьНовыйУзел(УзловаяСтруктура, УзелXML);
		КонецЕсли;
		
		Если УзелXML.ИмеетЗначение Тогда
			УзловаяСтруктура.Вставить("Значение", УзелXML.Значение);	
		КонецЕсли;
		
		Если УзелXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ИмяУзла = УзелXML.Имя Тогда
			
			Если НЕ КорневаяСтруктура.Свойство(ИмяУзла) Тогда
				КорневаяСтруктура.Вставить(ИмяУзла, УзловаяСтруктура);
			Иначе
				
				ЗначениеУзла = Неопределено;
				Выполнить("ЗначениеУзла = КорневаяСтруктура." + ИмяУзла);
				
				Если ТипЗнч(ЗначениеУзла) = Тип("Массив") Тогда
					Выполнить("КорневаяСтруктура." + ИмяУзла + ".Добавить(УзловаяСтруктура)");	
				Иначе
					
					ЗначениеУзла = Новый Массив;
					Выполнить("ЗначениеУзла.Добавить(КорневаяСтруктура." + ИмяУзла + ")");
					ЗначениеУзла.Добавить(УзловаяСтруктура);
					КорневаяСтруктура.Вставить(ИмяУзла, ЗначениеУзла);
					
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат;
			
		КонецЕсли;		
		
	КонецЦикла;

КонецПроцедуры

Функция XML_ПолучитьМассивИзСтруктуры(СтруктураXML)
	
	Если ТипЗнч(СтруктураXML) = Тип("Структура") Тогда
		
		МассивXML = Новый Массив;
		МассивXML.Добавить(СтруктураXML);
		
	ИначеЕсли ТипЗнч(СтруктураXML) = Тип("Массив") Тогда
		МассивXML = СтруктураXML;
	Иначе
		МассивXML = Новый Массив;
	КонецЕсли;
	
	Возврат МассивXML;
	
КонецФункции

Функция XML_ЗаменитьИнфоПоляВДокументе(ДанныеДокумента, СтруктураИнфоПолей)
	
	ЧтениеДокумента = Новый ЧтениеXML;
	ЧтениеДокумента.УстановитьСтроку(ДанныеДокумента);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеДокумента);
	ЧтениеДокумента.Закрыть();
	
	//Логика записи инфополей
	МассивДанныхИнфоПолей = СтруктураИнфоПолей.СписокЗначенийИнфоПоля;
	СписокТоваровDOM = ДокументDOM.ПолучитьЭлементыПоИмени("СведТов");
	
	Если СписокТоваровDOM.Количество() = 0 Тогда
		СписокТоваровDOM = ДокументDOM.ПолучитьЭлементыПоИмени("СвТов");
	КонецЕсли;
	
	Для Каждого ТоварDOM Из СписокТоваровDOM Цикл
		
		СписокИнфоПолей = ТоварDOM.ПолучитьЭлементыПоИмени("ИнфПолФХЖ2");
		
		Для Каждого ЭлементDOM Из СписокИнфоПолей Цикл
			ТоварDOM.УдалитьДочерний(ЭлементDOM);		
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ИнфоПоле Из МассивДанныхИнфоПолей Цикл
		
		Для Каждого ТоварDOM Из СписокТоваровDOM Цикл
			
			Если ИнфоПоле.Товар = ТоварDOM.ПолучитьАтрибут("НаимТов") Тогда
				
				ЭлементИнфоПоляDOM = ДокументDOM.СоздатьЭлемент("ИнфПолФХЖ2");
				ЭлементИнфоПоляDOM = ТоварDOM.ДобавитьДочерний(ЭлементИнфоПоляDOM);
				ЭлементИнфоПоляDOM.УстановитьАтрибут("Идентиф", ИнфоПоле.КлючИнфоПоля);
				ЭлементИнфоПоляDOM.УстановитьАтрибут("Значен", ИнфоПоле.ЗначениеИнфоПоля);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Поскольку в XML важен порядок тегов - удаляем и вставляем ДопСведТов
	Для Каждого ТоварDOM Из СписокТоваровDOM Цикл
		
		СписокИнфоПолей = ТоварDOM.ПолучитьЭлементыПоИмени("ДопСведТов");
		
		Для Каждого ЭлементDOM Из СписокИнфоПолей Цикл
			
			ТоварDOM.УдалитьДочерний(ЭлементDOM);
			ТоварDOM.ДобавитьДочерний(ЭлементDOM);
			
		КонецЦикла;
		
	КонецЦикла;
	
	//Запись изменений в XML
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	
	ЗаписьDOM = Новый ЗаписьDOM;
	ЗаписьDOM.Записать(ДокументDOM, ЗаписьXML);
	Результат = ЗаписьXML.Закрыть();
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.ДобавитьСтроку(Результат);
	ТекстовыйДокумент.Записать(ВременныйФайл,"windows-1251");
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
	УдалитьФайлы(ВременныйФайл);
	
	Результат = Base64Строка(ДвоичныеДанные);
	Возврат КНП_ОбработатьСтрокуBase64(Результат);

КонецФункции

Функция XML_ПрочитатьМассивТоваровДокумента(ДанныеДокумента)
	
	ЧтениеДокумента = Новый ЧтениеXML;
	ЧтениеДокумента.УстановитьСтроку(ДанныеДокумента);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеДокумента);
	ЧтениеДокумента.Закрыть();
	
	МассивТоваров = Новый Массив;
	СписокТоваровDOM = ДокументDOM.ПолучитьЭлементыПоИмени("СведТов");
	
	Если СписокТоваровDOM.Количество() = 0 Тогда
		СписокТоваровDOM = ДокументDOM.ПолучитьЭлементыПоИмени("СвТов");
	КонецЕсли;
	
	Для Каждого ТоварDOM Из СписокТоваровDOM Цикл
		
		Если ТоварDOM.ПолучитьАтрибут("НаимТов") <> Неопределено Тогда
			
			СписокИнфоПолей = ТоварDOM.ПолучитьЭлементыПоИмени("ИнфПолФХЖ2");
			
			Если СписокИнфоПолей.Количество() > 0 Тогда
				
				Для Каждого ЭлементDOM Из СписокИнфоПолей Цикл
					
					СтруктураЭлемента = Новый Структура("Товар,КлючИнфоПоля,ЗначениеИнфоПоля");
					СтруктураЭлемента.Товар = ТоварDOM.ПолучитьАтрибут("НаимТов");
					СтруктураЭлемента.КлючИнфоПоля = ЭлементDOM.ПолучитьАтрибут("Идентиф");
					СтруктураЭлемента.ЗначениеИнфоПоля = ЭлементDOM.ПолучитьАтрибут("Значен");
					МассивТоваров.Добавить(СтруктураЭлемента);
					
				КонецЦикла;
				
			Иначе
				
				СтруктураЭлемента = Новый Структура("Товар,КлючИнфоПоля,ЗначениеИнфоПоля");
				СтруктураЭлемента.Товар = ТоварDOM.ПолучитьАтрибут("НаимТов");
				МассивТоваров.Добавить(СтруктураЭлемента);	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивТоваров;	

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти XML-парсер                    	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область __HTTP_Коннектор                     //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область __HTTP_Коннектор

// Функция - Отправить get запрос
//
// Параметры:
//  СтрокаGetЗапроса - Строка	 - Строка, передаваемая на сервер. Строка запроса НЕ содержит имя сервера до первого /
//  ЗаголовкиЗапроса - Соответствие	- Соответствие, хранящее значения параметров запроса 
// 
// Возвращаемое значение:
// Структура  - Структура данных, содержащая Ответ и Заголовки
//
Функция ОтправитьGetЗапрос(ПолныйАдресЗапроса, ЗаголовкиЗапроса)
	
	ЗафиксироватьСобытиеКоннектора("Вход в процедуру", "ОтправитьGetЗапрос");
	СтруктураURI = СтруктураURI(ПолныйАдресЗапроса);
	
	СтрокаЗаголовка = "";
	
	Для Каждого ТипЗначения Из ЗаголовкиЗапроса Цикл
		СтрокаЗаголовка = СтрокаЗаголовка + ТипЗначения.Ключ + ": " + ТипЗначения.Значение + Символы.ПС;	
	КонецЦикла;
	
	ЗафиксироватьСобытиеКоннектора("Параметры процедуры: СтрокаGetЗапроса " + ПолныйАдресЗапроса + "; ЗаголовкиЗапроса " + СтрокаЗаголовка, "ОтправитьGetЗапрос");
	
	Попытка
		
		ОбъектСоединения = СоздатьHTTPКоннектор(СтруктураURI);
		
		Если ТипЗнч(ОбъектСоединения) = Тип("COMОбъект") Тогда
			
			///Работаем через WinHTTP
			СтрокаСоединения = СтруктураURI.Схема + "://" + СтруктураURI.ИмяСервера 
			+ ?(Лев(СтруктураURI.ПутьНаСервере, 1) = "/", "", "/") + СтруктураURI.ПутьНаСервере;
			
			ТаймаутВСекундах = 5;
			
			ОбъектСоединения.SetTimeouts(ТаймаутВСекундах * 1000, ТаймаутВСекундах * 1000, ТаймаутВСекундах * 1000, ТаймаутВСекундах * 1000);
			ОбъектСоединения.Open("GET",СтрокаСоединения,0);
			
			ЗафиксироватьСобытиеКоннектора("Открыто соединение GET по адресу " + СтрокаСоединения, "ОтправитьGetЗапрос");			
			ОбъектСоединения.SetRequestHeader("Accept-Language", "ru");
			ОбъектСоединения.SetRequestHeader("Accept-Charset","utf-8");
			ОбъектСоединения.setRequestHeader("Content-Language", "ru");
			ОбъектСоединения.setRequestHeader("Content-Charset", "utf-8");
			
			Если ЗаголовкиЗапроса.Получить("Content-type") = Неопределено Тогда
				ОбъектСоединения.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
			КонецЕсли;
			
			Для Каждого ТипПараметра Из ЗаголовкиЗапроса Цикл
				
				Если ЗначениеЗаполнено(ТипПараметра.Ключ) И ЗначениеЗаполнено(ТипПараметра.Значение) Тогда
					ОбъектСоединения.setRequestHeader(ТипПараметра.Ключ, ТипПараметра.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
			ЗафиксироватьСобытиеКоннектора("Попытка отправки GET запроса", "ОтправитьGetЗапрос");			
			ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ОтправкаЗапроса.Начало",,,ТекущаяУниверсальнаяДатаВМиллисекундах(),ПолныйАдресЗапроса);
			
			ОбъектСоединения.Send();	
			
			Возврат ОбработатьОтветОтСервера(ОбъектСоединения);		
			
		Иначе
			
			ЗаголовкиHTTPЗапроса = Новый Соответствие;
			ЗаголовкиHTTPЗапроса.Вставить("Accept-Language", "ru");
			ЗаголовкиHTTPЗапроса.Вставить("Accept-Charset","utf-8");
			ЗаголовкиHTTPЗапроса.Вставить("Content-Language", "ru");
			ЗаголовкиHTTPЗапроса.Вставить("Content-Charset", "utf-8");;
			ЗаголовкиHTTPЗапроса.Вставить("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
			
			Для Каждого ТипПараметра Из ЗаголовкиЗапроса Цикл
				ЗаголовкиHTTPЗапроса.Вставить(ТипПараметра.Ключ, ТипПараметра.Значение);	
			КонецЦикла;
			
			ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, ЗаголовкиHTTPЗапроса);
			ЗафиксироватьСобытиеКоннектора("Попытка отправки GET запроса", "ОтправитьGetЗапрос");
			ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ОтправкаЗапроса.Начало",,,ТекущаяУниверсальнаяДатаВМиллисекундах(),ПолныйАдресЗапроса);
			
			Возврат ОбработатьОтветОтСервера(ОбъектСоединения.Получить(ЗапросHTTP) );	
			
		КонецЕсли;
		
	Исключение
		
		ЗафиксироватьСобытиеКоннектора(ОписаниеОшибки(), "ОтправитьGetЗапрос");
		Возврат Новый Структура("Заголовки,Ответ,КодОтвета", ,ОписаниеОшибки(), "");
		
	КонецПопытки;		
	
	Возврат Новый Структура("Заголовки,Ответ,КодОтвета", "");

КонецФункции

// Функция - Отправить post запрос
//
// Параметры:
//  АдресЗапроса	 - Строка	 - Адресная строка запроса БЕЗ указания имени сервера
//  ЗаголовкиЗапроса - Соответствие	 - Соответствие Заголовков запроса
//	ТелоЗапроса 	 - Соответствие, Строка  - Структура ключ-значение для тела запроса ИЛИ строка
// 
// Возвращаемое значение:
// Структура  - Структура данных, содержащая Ответ и Заголовки 
//
Функция ОтправитьPostЗапрос(ПолныйАдресЗапроса, ЗаголовкиЗапроса, ТелоЗапроса)
	
	СтруктураURI = СтруктураURI(ПолныйАдресЗапроса);
	ЗафиксироватьСобытиеКоннектора("Вход в процедуру", "ОтправитьPostЗапрос");
	
	Если ТипЗнч(ЗаголовкиЗапроса) = Тип("Соответствие") Тогда
		
		СтрокаЗаголовка = "";
		
		Для Каждого ТипЗначения Из ЗаголовкиЗапроса Цикл
			СтрокаЗаголовка = СтрокаЗаголовка + ТипЗначения.Ключ + ": " + ТипЗначения.Значение + Символы.ПС;	
		КонецЦикла;
		
	Иначе
		
		ЗафиксироватьСобытиеКоннектора("Некорректный формат заголовков", "ОтправитьPostЗапрос");
		Возврат Новый Структура("Заголовки,Ответ,КодОтвета", "");
		
	КонецЕсли;
	
	СтрокаТелаЗапроса = "";
	
	Если ТипЗнч(ТелоЗапроса) = Тип("Соответствие") Тогда
		
		Для Каждого ПараметрТела Из ТелоЗапроса Цикл
			
			Если ЗначениеЗаполнено(СтрокаТелаЗапроса) Тогда
				СтрокаТелаЗапроса = СтрокаТелаЗапроса + "&" + ПараметрТела.Ключ + "=" + ПараметрТела.Значение;
			Иначе
				СтрокаТелаЗапроса = ПараметрТела.Ключ + "=" + ПараметрТела.Значение;
			КонецЕсли;
			
		КонецЦикла;	
		
	Иначе
		СтрокаТелаЗапроса = ТелоЗапроса;	
	КонецЕсли;
	
	
	Попытка
		
		ОбъектСоединения = СоздатьHTTPКоннектор(СтруктураURI);
		
		Если ТипЗнч(ТелоЗапроса) = Тип("Соответствие") Тогда
			
			Если ТелоЗапроса.Получить("password") <> Неопределено Тогда
				ЗафиксироватьСобытиеКоннектора("Параметры процедуры: АдресЗапроса " + ПолныйАдресЗапроса + "; ЗаголовкиЗапроса " + СтрокаЗаголовка + "; Тело запроса - скрыто", "ОтправитьPostЗапрос")
			Иначе
				ЗафиксироватьСобытиеКоннектора("Параметры процедуры: АдресЗапроса " + ПолныйАдресЗапроса + "; ЗаголовкиЗапроса " + СтрокаЗаголовка + "; Тело запроса " + СтрокаТелаЗапроса, "ОтправитьPostЗапрос");
			КонецЕсли;
			
		Иначе
			ЗафиксироватьСобытиеКоннектора("Параметры процедуры: АдресЗапроса " + ПолныйАдресЗапроса + "; ЗаголовкиЗапроса " + СтрокаЗаголовка + "; Тело запроса " + СтрокаТелаЗапроса, "ОтправитьPostЗапрос");
		КонецЕсли;
		
		
		Если ТипЗнч(ОбъектСоединения) = Тип("COMОбъект") Тогда
			
			///Работаем через WinHTTP
			СтрокаСоединения = СтруктураURI.Схема + "://" + СтруктураURI.ИмяСервера 
			+ ?(Лев(СтруктураURI.ПутьНаСервере, 1) = "/", "", "/") + СтруктураURI.ПутьНаСервере;
			
			ОбъектСоединения.Open("POST", СтрокаСоединения,0);
			ЗафиксироватьСобытиеКоннектора("Открыто соединение POST по адресу " + СтрокаСоединения, "ОтправитьPostЗапрос");			
			
			ОбъектСоединения.SetRequestHeader("Accept-Language", "ru");
			ОбъектСоединения.SetRequestHeader("Accept-Charset","utf-8");
			ОбъектСоединения.setRequestHeader("Content-Language", "ru");
			ОбъектСоединения.setRequestHeader("Content-Charset", "utf-8");
			
			Если ЗаголовкиЗапроса.Получить("Content-type") = Неопределено Тогда
				ОбъектСоединения.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
			КонецЕсли;
			
			ОбъектСоединения.setRequestHeader("X-Requested-With", "XMLHttpRequest");
			
			Для Каждого ТипПараметра Из ЗаголовкиЗапроса Цикл
				
				Если ЗначениеЗаполнено(ТипПараметра.Ключ) И ЗначениеЗаполнено(ТипПараметра.Значение) Тогда
					ОбъектСоединения.setRequestHeader(ТипПараметра.Ключ, ТипПараметра.Значение);
				КонецЕсли;	
				
			КонецЦикла;
			
			ЗафиксироватьСобытиеКоннектора("Попытка отправки запроса на сервер", "ОтправитьPostЗапрос");
			ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ОтправкаЗапроса.Начало",,,ТекущаяУниверсальнаяДатаВМиллисекундах(),ПолныйАдресЗапроса);
			
			ОбъектСоединения.Send(СтрокаТелаЗапроса);
			
			Возврат ОбработатьОтветОтСервера(ОбъектСоединения);
			
		Иначе
			
			ЗаголовкиHTTPЗапроса = Новый Соответствие;
			ЗаголовкиHTTPЗапроса.Вставить("Accept-Language", "ru");
			ЗаголовкиHTTPЗапроса.Вставить("Accept-Charset","utf-8");
			ЗаголовкиHTTPЗапроса.Вставить("Content-Language", "ru");
			ЗаголовкиHTTPЗапроса.Вставить("Content-Charset", "utf-8");
			
			Если ЗаголовкиHTTPЗапроса.Получить("Content-type") = Неопределено Тогда
				ЗаголовкиHTTPЗапроса.Вставить("Content-type", "application/x-www-form-urlencoded; charset=utf-8");				
			КонецЕсли;
			
			ЗаголовкиHTTPЗапроса.Вставить("X-Requested-With", "XMLHttpRequest");
			
			Для Каждого ТипПараметра Из ЗаголовкиЗапроса Цикл
				ЗаголовкиHTTPЗапроса.Вставить(ТипПараметра.Ключ, ТипПараметра.Значение);	
			КонецЦикла;
			
			ЗапросHTTP = Новый HTTPЗапрос(СтруктураURI.ПутьНаСервере, ЗаголовкиHTTPЗапроса);
			
			ЗафиксироватьСобытиеКоннектора("Формируется запрос HTTP по адресу " + ПолныйАдресЗапроса, "ОтправитьPostЗапрос");
			
			ЗапросHTTP.УстановитьТелоИзСтроки(ТелоЗапроса, "utf-8", ИспользованиеByteOrderMark.НеИспользовать);
			
			ЗафиксироватьСобытиеКоннектора("Попытка отправки запроса на сервер", "ОтправитьPostЗапрос");
			ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ОтправкаЗапроса.Начало",,, ТекущаяУниверсальнаяДатаВМиллисекундах(), ПолныйАдресЗапроса);
			
			Возврат ОбработатьОтветОтСервера(ОбъектСоединения.ВызватьHTTPМетод("POST", ЗапросHTTP) );
			
		КонецЕсли;
		
	Исключение
		
		ЗафиксироватьСобытиеКоннектора(ОписаниеОшибки(), "ОтправитьPostЗапрос");
		Возврат Новый Структура("Заголовки,Ответ,КодОтвета", "", ОписаниеОшибки() );
		
	КонецПопытки;
	
КонецФункции 

// Функция - Создать HTTPКоннектор
// 
// Возвращаемое значение:
// COM-объект  - СОМ-соединение с объектом WinHttpRequest
// HTTPСоединение - Встроенный объект для соединения по HTTP(S)
//
Функция СоздатьHTTPКоннектор(СтруктураURI)
	
	ЗафиксироватьСобытиеКоннектора("Вход в процедуру", "СоздатьHTTPКоннектор");
	HTTPСоединение = Неопределено;
	СисИнфо = Новый СистемнаяИнформация;
	
	Если Строка(Метаданные.РежимСовместимости) = "Версия8_2_16" ИЛИ
		
		Строка(Метаданные.РежимСовместимости) = "Версия8_2_13" Тогда
		РежимСовместимости82 = Ложь;
		
	Иначе
		РежимСовместимости82 = Ложь;
	КонецЕсли;
	
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.2" ИЛИ РежимСовместимости82 Тогда
		
		ЗафиксироватьСобытиеКоннектора("Попытка создать объект WinHTTP", "СоздатьHTTPКоннектор");
		HTTPСоединение = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
		HTTPСоединение.Option(2,"utf-8");	
		ЗафиксироватьСобытиеКоннектора("Объект WinHTTP создан", "СоздатьHTTPКоннектор");	
		
	Иначе
		
		ЗафиксироватьСобытиеКоннектора("Попытка создать объект HTTPСоединение", "СоздатьHTTPКоннектор");
		ЭтоSSL = ?(СтруктураURI.Схема = "https", Истина, Ложь);
		
		Если ЭтоSSL Тогда
			СоединениеSSL = Новый ЗащищенноеСоединениеOpenSSL();
		Иначе
			СоединениеSSL = Неопределено;
		КонецЕсли;					
		
		HTTPСоединение = Новый HTTPСоединение(СтруктураURI.ИмяСервера,,,,,, СоединениеSSL);
		ЗафиксироватьСобытиеКоннектора("Объект HTTPСоединение создан", "СоздатьHTTPКоннектор");
		
	КонецЕсли;
	
	Возврат HTTPСоединение;

КонецФункции

// Функция - Структура URI
//
// Параметры:
//  СтрокаURI	 - Строка	 - Строка с путем, который нужно разобрать в структуру
// 
// Возвращаемое значение:
// Структура  - 
//
Функция СтруктураURI(Знач СтрокаURI)
	
	СтрокаURI = СокрЛП(СтрокаURI);
	
	// схема
	Схема = "";
	Позиция = Найти(СтрокаURI, "://");
	
	Если Позиция > 0 Тогда
		
		Схема = НРег(Лев(СтрокаURI, Позиция - 1));
		СтрокаURI = Сред(СтрокаURI, Позиция + 3);
		
	КонецЕсли;
	
	// строка соединения и путь на сервере
	СтрокаСоединения = СтрокаURI;
	ПутьНаСервере = "";
	Позиция = Найти(СтрокаСоединения, "/");
	
	Если Позиция > 0 Тогда
		
		ПутьНаСервере = Сред(СтрокаСоединения, Позиция + 1);
		СтрокаСоединения = Лев(СтрокаСоединения, Позиция - 1);
		
	КонецЕсли;
	
	// информация пользователя и имя сервера
	СтрокаАвторизации = "";
	ИмяСервера = СтрокаСоединения;
	Позиция = Найти(СтрокаСоединения, "@");
	
	Если Позиция > 0 Тогда
		
		СтрокаАвторизации = Лев(СтрокаСоединения, Позиция - 1);
		ИмяСервера = Сред(СтрокаСоединения, Позиция + 1);
		
	КонецЕсли;
	
	// логин и пароль
	СтрокаЛогинаПользователя = СтрокаАвторизации;
	СтрокаПароляПользователя = "";
	Позиция = Найти(СтрокаАвторизации, ":");
	
	Если Позиция > 0 Тогда
		
		СтрокаЛогинаПользователя = Лев(СтрокаАвторизации, Позиция - 1);
		СтрокаПароляПользователя = Сред(СтрокаАвторизации, Позиция + 1);
		
	КонецЕсли;
	
	// хост и порт
	Хост = ИмяСервера;
	Порт = "";
	Позиция = Найти(ИмяСервера, ":");
	
	Если Позиция > 0 Тогда
		
		Хост = Лев(ИмяСервера, Позиция - 1);
		Порт = Сред(ИмяСервера, Позиция + 1);
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Схема", Схема);
	Результат.Вставить("Login", СтрокаЛогинаПользователя);
	Результат.Вставить("Password", СтрокаПароляПользователя);
	Результат.Вставить("ИмяСервера", ИмяСервера);
	Результат.Вставить("Хост", Хост);
	Результат.Вставить("Порт", ?(Порт <> "", Число(Порт), Неопределено));
	Результат.Вставить("ПутьНаСервере", ПутьНаСервере);
	
	Возврат Результат;	

КонецФункции

// Функция - Обработать ответ от сервера
//
// Параметры:
//  ОбъектСоединения - COMОбъект, HTTPОтвет	 - Объект соединения с HTTP 
// 
// Возвращаемое значение:
// Структура  - Структура с данными Ответ и Заголовки 
//
Функция ОбработатьОтветОтСервера(ОбъектСоединения)
	
	ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ОтправкаЗапроса.Конец",,, ТекущаяУниверсальнаяДатаВМиллисекундах() );
	ЗафиксироватьСобытиеКоннектора("Вход в процедуру", "ОбработатьОтветОтСервера");
	СтруктураОтвета = Новый Структура("Заголовки,КодОтвета,Ответ", "");
	
	Попытка
		
		Если ТипЗнч(ОбъектСоединения) = Тип("COMОбъект") Тогда
			
			СтрокаЗаголовковОтвета = ОбъектСоединения.getAllResponseHeaders();
			ЗафиксироватьСобытиеКоннектора("Заголовки от сервера: " + СтрокаЗаголовковОтвета, "ОбработатьОтветОтСервера");
			СоответствиеЗаголовков = Новый Соответствие;
			
			Для Индекс = 1 По СтрЧислоСтрок(СтрокаЗаголовковОтвета) Цикл
				
				СтрокаЗаголовка = СтрПолучитьСтроку(СтрокаЗаголовковОтвета, Индекс);
				Разделитель = Найти(СтрокаЗаголовка, ":");
				КлючЗаголовка = СокрЛП(Лев(СтрокаЗаголовка, Разделитель - 1) );
				ЗначениеЗаголовка = СокрЛП(Прав(СтрокаЗаголовка, СтрДлина(СтрокаЗаголовка) - Разделитель) );
				СоответствиеЗаголовков.Вставить(КлючЗаголовка, ЗначениеЗаголовка);
				
			КонецЦикла;
			
			ЗаголовокКонтента = СоответствиеЗаголовков.Получить("Content-Disposition");
			
			Если ЗаголовокКонтента <> Неопределено И Найти(ЗаголовокКонтента, "attach") Тогда //Это прикрепленный файл
				
				СтруктураОтвета.Ответ = СохранитьДвоичныйБуфер(ОбъектСоединения.ResponseBody);
				ЗафиксироватьСобытиеКоннектора("Ответ от сервера: Файл", "ОбработатьОтветОтСервера");
				
			Иначе
				
				СтруктураОтвета.Ответ = ОбъектСоединения.ResponseText();
				ЗафиксироватьСобытиеКоннектора("Ответ от сервера: " + СтруктураОтвета.Ответ, "ОбработатьОтветОтСервера");
				
			КонецЕсли;
			
			СтруктураОтвета.КодОтвета = 200;
			
		ИначеЕсли ТипЗнч(ОбъектСоединения) = Тип("HTTPОтвет") Тогда
			
			СоответствиеЗаголовков = ОбъектСоединения.Заголовки;
			СтрокаЗаголовка = "";
			
			Для Каждого ТипЗначения Из СоответствиеЗаголовков Цикл
				СтрокаЗаголовка = СтрокаЗаголовка + ТипЗначения.Ключ + ": " + ТипЗначения.Значение + Символы.ПС;	
			КонецЦикла;
			
			ЗафиксироватьСобытиеКоннектора("Заголовки от сервера: " + СтрокаЗаголовка, "ОбработатьОтветОтСервера");
			ЗаголовокКонтента = СоответствиеЗаголовков.Получить("Content-Disposition");
			
			Если ЗаголовокКонтента <> Неопределено И Найти(ЗаголовокКонтента, "attach") Тогда //Это прикрепленный файл
				
				СтруктураОтвета.Ответ = ОбъектСоединения.ПолучитьТелоКакДвоичныеДанные();
				ЗафиксироватьСобытиеКоннектора("Ответ от сервера: Файл", "ОбработатьОтветОтСервера");
				
			Иначе
				
				СтруктураОтвета.Ответ = ОбъектСоединения.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				ЗафиксироватьСобытиеКоннектора("Ответ от сервера: " + СтруктураОтвета.Ответ, "ОбработатьОтветОтСервера");
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураОтвета.Заголовки = СоответствиеЗаголовков;
		
		Если ТипЗнч(ОбъектСоединения) = Тип("COMОбъект") Тогда
			СтруктураОтвета.КодОтвета = ОбъектСоединения.Status;
		Иначе
			СтруктураОтвета.КодОтвета = ОбъектСоединения.КодСостояния;
		КонецЕсли;
		
	Исключение
		ЗафиксироватьСобытиеКоннектора(ОписаниеОшибки(), "ОбработатьОтветОтСервера");	
	КонецПопытки;
	
	Возврат СтруктураОтвета;

КонецФункции

Функция СохранитьДвоичныйБуфер(Буфер)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	Поток = Новый COMОбъект("ADODB.Stream");
	Поток.Type = 1;  //Бинарный
	Поток.Mode = 3; 
	Поток.Open();
	Поток.Write(Буфер);
	Поток.SaveToFile(ИмяФайла);
	Поток.Close();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
	УдалитьФайлы(ИмяФайла);
	
	Возврат ДвоичныеДанные;

КонецФункции

// Функция - Обмен HTTPJSON
//
// Параметры:
//  Адрес			 - Строка	 - Полный адрес отправки запроса
//  ЗаголовкиЗапроса - Соответствие	 - Соответствие заголовков запроса
//  POSTЗапрос		 - Булево	 - Признак отправки POST-запроса
//  ТелоЗапроса		 - Соответствие, Строка	 - Содержимое запроса, помещаемое в тело
// 
// Возвращаемое значение:
// Соответствие, Строка  - Возвращаемый ответ, полученный при парсинге JSON. В случае ошибки - текст ошибки
//
Функция ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, POSTЗапрос = Ложь, ТелоЗапроса = "")
	
	Результат = Неопределено;
	
	Если POSTЗапрос Тогда
		СтруктураОтвета = ОтправитьPostЗапрос(Адрес, ЗаголовкиЗапроса, ТелоЗапроса);
	Иначе
		СтруктураОтвета = ОтправитьGetЗапрос(Адрес, ЗаголовкиЗапроса);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураОтвета.Заголовки) И (СтруктураОтвета.КодОтвета <> 404 или СтруктураОтвета.КодОтвета <> 500) Тогда
		
		Попытка
			Результат = КНП_ПрочитатьJSONОтСервера(СтруктураОтвета.Ответ);	
		Исключение
			
			СообщитьОСобытииКоннектора(ИнформацияОбОшибке().Причина.Описание);
			Результат = "Не удалось разобрать ответ от сервера: " + СтруктураОтвета.Ответ;
			
		КонецПопытки;
		
	ИначеЕсли ЗначениеЗаполнено(СтруктураОтвета.Заголовки) Тогда
		
		Результат = "Ошибка " + СтруктураОтвета.КодОтвета;	
		СообщитьОСобытииКоннектора("Ошибка " + СтруктураОтвета.КодОтвета, "ОбменHTTPJSON");
		
	Иначе
		
		СообщитьОСобытииКоннектора("Не удалось подключиться к серверу " + Адрес, "ОбменHTTPJSON");
		Результат = "Не удалось подключиться к серверу";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура фиксации событий коннектора
// * Является интерфейсной прокладкой между коннектором и системой журналирования
//
// Параметры:
//  Событие		 - Строка	 - Текст события коннектора
//  ИмяМетода	 - Строка	 - Имя метода, вызвавшего событие
//
Процедура ЗафиксироватьСобытиеКоннектора(Событие, ИмяМетода = "", УровеньЖурналирования = 1)
	
	ДобавитьВЖурнал(Событие, ИмяМетода);	

КонецПроцедуры

Процедура СообщитьОСобытииКоннектора(Событие, ИмяМетода = "")
	
	ВывестиУведомлениеПользователю(Событие);

КонецПроцедуры

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти __HTTP_Коннектор                    //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область __Журналирование                     //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область __Журналирование

// Процедура - Записать в журнал
//
// Параметры:
//  Событие		 - Строка	 - Описание события
//  МестоВызова	 - Строка	 - Наименование функции, откуда она вызывалась
//
Процедура ДобавитьВЖурнал(Событие, МестоВызова = "Модуль интеграции") Экспорт
	
	ФайлЖурнала.ДобавитьСтроку(Строка(ТекущаяДата() ) + ":: " + МестоВызова + ": " + Событие);

КонецПроцедуры

Процедура ДобавитьВЖурналОтладочнуюИнформацию(Событие, МестоВызова = "Модуль интеграции") Экспорт
	
	Если Отладка Тогда
		
		ФайлЖурнала.ДобавитьСтроку("ОТЛАДКА: " + Строка(ТекущаяДата() ) + ":: " + МестоВызова + ": " + Событие);
		ЗаписатьЖурналВФайл();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьЖурналВФайл() Экспорт  
	
	Если ОтключитьЗаписьЖурнала() Тогда
		
		ФайлЖурнала.Очистить();
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		ПутьКВременномуФайлу = КаталогВременныхФайлов() + "distate_log_file_" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".txt";
		
		ЗаписьТекста = Новый ЗаписьТекста(ПутьКВременномуФайлу,,,Истина);
		
		Если ФайлЖурнала.КоличествоСтрок() > 0 Тогда
			ЗаписьТекста.ЗаписатьСтроку(ФайлЖурнала.ПолучитьТекст() );
		КонецЕсли;    
		
		ФайлЖурнала.Очистить();
		ЗаписьТекста.Закрыть();
		
	Исключение
		
		ЗаписьЖурналаРегистрации("DS_МодульИнтеграции.Журналирование", УровеньЖурналаРегистрации.Предупреждение,,,ОписаниеОшибки() );
		ЗаписьЖурналаРегистрации("DS_МодульИнтеграции.Журналирование", УровеньЖурналаРегистрации.Предупреждение,,,"ЛОГ: " + ФайлЖурнала.ПолучитьТекст() );
		
		ФайлЖурнала.Очистить();
		
	КонецПопытки; 
	
КонецПроцедуры

Функция ОтключитьЗаписьЖурнала()
	
	Возврат Константы.ЭДО_ОтключитьЗаписьЖурнала.Получить();

КонецФункции

Функция ПрочитатьЖурналИзФайла() 				Экспорт
	
	ЗаписатьЖурналВФайл();
	
	ПутьКВременномуФайлу = КаталогВременныхФайлов() + "distate_log_file_" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".txt";
	ЧтениеТекста = Новый ЧтениеТекста(ПутьКВременномуФайлу, КодировкаТекста.UTF8);
	Текст = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	Возврат Текст;

КонецФункции

Процедура ОчиститьЖурналВФайле()				Экспорт
	
	ПутьКВременномуФайлу = КаталогВременныхФайлов() + "distate_log_file_" + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".txt";
	УдалитьФайлы(ПутьКВременномуФайлу);	

КонецПроцедуры

Процедура ВывестиУведомлениеПользователю(Знач Текст) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;	
	Сообщение.Сообщить();
	ДобавитьВЖурнал(Текст, "Модуль интеграции");	

КонецПроцедуры

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти __Журналирование                    //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#Область КонфигурационноНезависимыеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область КонфигурационноНезависимыеПроцедуры

//		Числовые функции
Функция КНП_ПолучитьАбсолютнуюРазность(Знач ПервоеЧисло, Знач ВтороеЧисло)
	
	Результат = КНП_ПолучитьРазностьЧисел(ПервоеЧисло, ВтороеЧисло);
	Возврат ?(Результат < 0, -Результат, Результат);	

КонецФункции

Функция КНП_ПолучитьРазностьЧисел(Знач ПервоеЧисло, Знач ВтороеЧисло)
	
	Попытка
		
		ПервоеЧисло = Число(ПервоеЧисло);
		ВтороеЧисло = Число(ВтороеЧисло);
		Результат = ПервоеЧисло - ВтороеЧисло;
		Возврат Результат;
		
	Исключение
		Возврат 0;	
	КонецПопытки;	

КонецФункции

//		Структурные функции
Процедура КНП_БезопасноЗаписатьЗначение(Структура, Имя, Значение)
	
	Если ТипЗнч(Структура) = Тип("Структура") И Структура.Свойство(Имя) Тогда
		Выполнить("Структура." + Имя + " = Значение");
	КонецЕсли;

КонецПроцедуры

Функция КНП_БезопасноПрочитатьЗначение(Структура, Имя)
	
	Результат = Неопределено;
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		
		Если Структура.Свойство(Имя) Тогда
			Выполнить("Результат = Структура." + Имя);
		КонецЕсли;
		
	Иначе
		Результат = Структура;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция КНП_СтруктураНаОснованииКолонокТЧ(ТабличнаяЧасть)
	
	Если ТипЗнч(ТабличнаяЧасть) = Тип("ТаблицаЗначений") Тогда
		Колонки = ТабличнаяЧасть.Колонки;	
	Иначе
		Колонки = ТабличнаяЧасть.Выгрузить().Колонки;
	КонецЕсли;
	
	СтруктураКолонок = Новый Структура;
	
	Для Каждого Колонка Из Колонки Цикл
		СтруктураКолонок.Вставить(Колонка.Имя);	
	КонецЦикла;
	
	Возврат Новый ФиксированнаяСтруктура(СтруктураКолонок);

КонецФункции

Функция КНП_РазобратьНаименованиеИПНаМассив(Знач Наименование)
	
	ПозИП = Найти(ВРег(Наименование), "ИП");
	
	//Отсекаем ИП
	Если ПозИП > 0 Тогда
		
		Наименование = Сред(Наименование, ПозИП + 2);
		Наименование = СокрЛП(Наименование);
		
	КонецЕсли;
	
	МассивНаименования = Новый Массив;
	
	Наименование = СтрЗаменить(Наименование, " ", Символы.ПС);
	КоличествоСтрок = СтрЧислоСтрок(Наименование);
	
	Если КоличествоСтрок <= 3 Тогда //Попадает под структуру
		
		Для Номер = 1 По КоличествоСтрок Цикл
			МассивНаименования.Добавить(СтрПолучитьСтроку(Наименование, Номер) );	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивНаименования;

КонецФункции

Функция КНП_СкопироватьСтруктуру(ИсходнаяСтруктура)
	
	НоваяСтруктура = Новый Структура;	
	
	Для Каждого СвойствоСтруктуры Из ИсходнаяСтруктура Цикл	
		
		Если ТипЗнч(СвойствоСтруктуры.Значение) = Тип("Структура") Тогда
			НоваяСтруктура.Вставить(СвойствоСтруктуры.Ключ, КНП_СкопироватьСтруктуру(СвойствоСтруктуры.Значение));
		Иначе	
			НоваяСтруктура.Вставить(СвойствоСтруктуры.Ключ, СвойствоСтруктуры.Значение);
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат НоваяСтруктура;

КонецФункции

//		Строковые функции
Функция КНП_ФорматДат(Знач Дата, ФактВремя = Ложь)
	
	Если НЕ ФактВремя Тогда
		
		Дата = НачалоДня(Дата);
		Дата = Дата + 43200;	//Прибавляем 12 часов
		
	КонецЕсли;
	
	Возврат Формат(УниверсальноеВремя(Дата) - Дата(1970,1,1,1,0,0), "ЧГ=0")	

КонецФункции

Функция КНП_ФорматСумм(Знач Сумма, Валюта = Неопределено, ЧН = "0.00", ЧРГ = "")	
	
	Сумма = ?(Сумма < 0, -Сумма, Сумма);
	ФорматнаяСтрока = "ЧЦ=15;ЧДЦ=2;ЧРД=.;ЧН=" + ЧН + 
	?(ЗначениеЗаполнено(ЧРГ), ";ЧРГ=" + ЧРГ, "");
	РезультирующаяСтрока = СокрЛ(Формат(Сумма, ФорматнаяСтрока));
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		РезультирующаяСтрока = РезультирующаяСтрока + " " + СокрП(Валюта);
	КонецЕсли;
	
	РезультирующаяСтрока = СтрЗаменить(РезультирующаяСтрока, Символы.НПП, "");
	Возврат РезультирующаяСтрока;

КонецФункции // ФорматСумм()

Функция КНП_СформироватьСуммуПрописью(СуммаЧислом, Валюта, ВыводитьСуммуБезКопеек = Ложь)
	
	Сумма = ?(СуммаЧислом < 0, -СуммаЧислом, СуммаЧислом);
	ПараметрыПрописиНаРусском = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		
		Если КНП_ЕстьРеквизит(Валюта, "ПараметрыПрописиНаРусском") Тогда
			ПараметрыПрописиНаРусском = Валюта.ПараметрыПрописиНаРусском;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = ЧислоПрописью(Сумма, "Л=ru_RU;ДП=Ложь", ПараметрыПрописиНаРусском);
	
	Если ВыводитьСуммуБезКопеек И Цел(Сумма) = Сумма Тогда
		Результат = Лев(Результат, Найти(Результат, "0") - 1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КНП_СформироватьЧислоПрописью(Число)
	
	ПараметрыПрописиНаРусском = "";
	Результат = ЧислоПрописью(Число, "Л=ru_RU;ДП=Ложь", ПараметрыПрописиНаРусском);
	Результат = Лев(Результат, Найти(Результат, "0") - 1);
	Возврат Результат;

КонецФункции

Функция КНП_ПреобразоватьвСистему(Число10, СистСчис)
	
	Если СистСчис > 36 или СистСчис < 2 тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбранная система исчисления не поддерживается";
		Сообщение.Сообщить();
		Возврат -1;
		
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	
	Пока Число10 > 0 цикл
		
		РезДеления = Число10 / СистСчис;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - СистСчис * (ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений, остатокОтДеления + 1, 1) + СтрокаСистема;
		Число10 = ?(ЧислоСистема = 0, 0, РезДеления); 
		
	КонецЦикла;
	
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема) / 2) * 2;
	
	Если Нечётное тогда
		СтрокаСистема = "0" + СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;

КонецФункции

Функция КНП_URLEncode(Знач Значение)
	
	Стр = Строка(Значение);
	Стр = СтрЗаменить(Стр, Символы.НПП, "");
	Стр = СокрЛП(Стр);
	
	Попытка
		
		Стр = СтрЗаменить(Стр, "«", """");
		Стр = СтрЗаменить(Стр, "»", """");
		
	Исключение
	КонецПопытки;
	
	Длина = СтрДлина(Стр);
	Итог = "";
	
	Для Н = 1 По Длина Цикл
		
		Знак = Сред(Стр, Н, 1);
		Код = КодСимвола(Знак);
		
		Если ((Знак >= "a") и (Знак <= "z")) или
			((Знак >= "A") и (Знак <= "Z")) или
			((Знак >= "0") и (Знак <= "9")) тогда
			Итог = Итог + Знак;
		Иначе
			
			Если (Код >= КодСимвола("А")) И (Код <= КодСимвола("п")) Тогда
				Итог = Итог + "%" + КНП_ПреобразоватьвСистему(208, 16) + "%" + КНП_ПреобразоватьвСистему(144 + Код - КодСимвола("А"), 16);
			ИначеЕсли (Код >= КодСимвола("р")) И (Код <= КодСимвола("я")) Тогда
				Итог = Итог + "%" + КНП_ПреобразоватьвСистему(209, 16) + "%" + КНП_ПреобразоватьвСистему(128 + Код - КодСимвола("р"), 16);
			ИначеЕсли (Знак = "ё") Тогда
				Итог = Итог + "%" + КНП_ПреобразоватьвСистему(209, 16) + "%" + КНП_ПреобразоватьвСистему(145, 16);
			ИначеЕсли (Знак = "Ё") Тогда
				Итог = Итог + "%" + КНП_ПреобразоватьвСистему(208, 16) + "%" + КНП_ПреобразоватьвСистему(129, 16);
			Иначе
				Итог = Итог + "%" + КНП_ПреобразоватьвСистему(Код, 16);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Итог;

КонецФункции


Функция КНП_ЧислоВФормате(ЧислоИсточник, ЧДЦ = 2)
	
	Если ТипЗнч(ЧислоИсточник) = Тип("Число") Тогда
		Возврат Формат(ЧислоИсточник, "ЧЦ=15; ЧДЦ=" + Строка(ЧДЦ) + "; ЧРД=.; ЧРГ=; ЧН=; ЧГ=");
	КонецЕсли;
	
	Возврат ЧислоИсточник;

КонецФункции

Функция КНП_ЧислоБезГруппВВидеСтроки(Знач Значение)
	
	Результат = "";
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Попытка
			Результат = Строка(Формат(Число(Значение), "ЧРГ=; ЧГ="));
		Исключение
			ДобавитьВЖурнал("Ошибка форматирования: Значение = " + Значение + ". Ошибка: " + ОписаниеОшибки(), "ЧислоБезГруппВВидеСтроки");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция КНП_УдалениеВедущихНулей(Знач Номер)
	//Changelog
	//
	//21.03.2019 - добавлено сохранение префикса Аванса
	
	ЕстьАванс = Ложь;
	
	Если Лев(Номер, 1) = "А" Тогда
		
		ЕстьАванс = Истина;
		Номер = Сред(Номер, 2);
		
	КонецЕсли;
	
	Пока Лев(Номер, 1) = "0" Цикл
		Номер = Сред(Номер, 2);	
	КонецЦикла;
	
	Если ЕстьАванс Тогда
		Номер = "А" + Номер;
	КонецЕсли;
	
	Возврат Номер;

КонецФункции

Функция КНП_ПолучитьСтрокуИзМассива(ЗначениеОшибки, Разделитель = ", ")	
	
	СтрокаОписания = "";	
	
	Если ТипЗнч(ЗначениеОшибки) = Тип("Массив") Тогда
		
		Для Каждого ЭлементМассива Из ЗначениеОшибки Цикл
			
			Если ТипЗнч(ЭлементМассива) = Тип("Соответствие") Тогда
				СтрокаОписания = СтрокаОписания + КНП_ПолучитьСтрокуИзМассива(ЭлементМассива);
			Иначе
				СтрокаОписания = СтрокаОписания + ЭлементМассива + Разделитель;
			КонецЕсли;
			
		КонецЦикла;		
		
	ИначеЕсли ТипЗнч(ЗначениеОшибки) = Тип("Соответствие") Тогда
		
		Для Каждого Элемент Из ЗначениеОшибки Цикл
			СтрокаОписания = СтрокаОписания + Элемент.Ключ + ": " + КНП_ПолучитьСтрокуИзМассива(Элемент.Значение);
		КонецЦикла;
		
	КонецЕсли;	
	
	Возврат СтрокаОписания;	

КонецФункции

Функция КНП_ДатаВФормате(ДатаИсточник)
	Возврат Формат(ДатаИсточник, "ДФ=dd.MM.yyyy");	
КонецФункции

Функция КНП_Формат(Источник, Ключ)
	
	Если ТипЗнч(Источник) = Тип("Дата") Тогда
		Возврат КНП_ДатаВФормате(Источник);
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("Число") И Источник > 999 Тогда
		
		Если ФОД_ЭтоСтрогоЧисло(Ключ) Тогда
			Возврат Источник;
		КонецЕсли;
		
		Возврат КНП_ЧислоВФормате(Источник);
		
	КонецЕсли;
	
	Возврат Источник;

КонецФункции

//		Функции проверки
Функция КНП_ЭтоЧисло(Знач Строка, ИгнорироватьРазделители = Ложь)
	
	ДлинаСтроки = СтрДлина(Строка);
	
	Если ДлинаСтроки = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для итер = 1 По ДлинаСтроки Цикл
		
		КодСимвола = КодСимвола(Строка, итер); 
		
		Если ИгнорироватьРазделители И (Символ(КодСимвола) = "." ИЛИ Символ(КодСимвола) = ",") Тогда
			Продолжить;
		КонецЕсли;
		
		Если КодСимвола < 48 ИЛИ КодСимвола > 57 Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

Функция КНП_ЕстьРеквизит(Объект, ИмяРеквизита)
	
	Если Объект.Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция КНП_ЕстьСтандартныйРеквизит(Объект, ИмяРеквизита)
	
	Для Каждого Реквизит Из Объект.Метаданные().СтандартныеРеквизиты Цикл
		
		Если Реквизит.Имя = ИмяРеквизита Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

Функция КНП_ЕстьТабЧасть(Объект, ИмяТЧ)
	
	Если Объект.Метаданные().ТабличныеЧасти.Найти(ИмяТЧ) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция КНП_ЕстьОбъектМетаданных(ИмяМетаданных)
	
	Результат = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.Справочники.Найти(ИмяМетаданных) <> Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Метаданные.Документы.Найти(ИмяМетаданных) <> Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Метаданные.РегистрыСведений.Найти(ИмяМетаданных) <> Неопределено Тогда
		Результат = Истина;
	ИначеЕсли Метаданные.Перечисления.Найти(ИмяМетаданных) <> Неопределено Тогда
		Результат = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

Функция КНП_ВДокументеКорректныеСтавки(СсылкаНаДокумент)
	
	Результат = Истина;
	ПризнакНДСВСуммеДокумента = МОП_ДокументВключаетНДСВСумму(СсылкаНаДокумент);
	
	Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Товары") Тогда
		
		ТабЗначТоваров = СсылкаНаДокумент.Товары.Выгрузить();
		
		Если ТабЗначТоваров.Колонки.Найти("СтавкаНДС") = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого Товар Из СсылкаНаДокумент.Товары Цикл
			
			Если Товар.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Товар.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
				Продолжить;
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) <> ПризнакНДСВСуммеДокумента Тогда
				
				Результат = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Услуги") Тогда
		
		ТабЗначТоваров = СсылкаНаДокумент.Услуги.Выгрузить();
		
		Если ТабЗначТоваров.Колонки.Найти("СтавкаНДС") = Неопределено Тогда
			Возврат Результат;
		КонецЕсли;
		
		Для Каждого Товар Из СсылкаНаДокумент.Услуги Цикл
			
			Если Товар.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
				Продолжить;
			КонецЕсли;
			
			Если Товар.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
				Продолжить;
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) <> ПризнакНДСВСуммеДокумента Тогда
				
				Результат = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

//		Функции работы с метаданными
Функция КНП_ОбщийМодуль(ИмяОбщегоМодуля)
	
	Модуль = Неопределено; 
	
	Если Метаданные.ОбщиеМодули.Найти(ИмяОбщегоМодуля) <> Неопределено Тогда
		Модуль = Вычислить(ИмяОбщегоМодуля); // ВычислитьВБезопасномРежиме не требуется, т.к. проверка надежная.
	КонецЕсли;
	
	Возврат Модуль;     	

КонецФункции

Функция КНП_ИмяКонфигурации()
	
	МетаданныеИмя = Метаданные.Имя;
	
	Если Найти(МетаданныеИмя, "БухгалтерияПредприятия") > 0  ИЛИ МетаданныеИмя = "БухгалтерияПредприятияБазовая" Тогда
		
		Если Не Найти(Метаданные.Синоним, "3") = 0 Тогда
			Возврат "БП3";
		Иначе
			Возврат "БП";
		КонецЕсли;
		
	ИначеЕсли МетаданныеИмя = "УправлениеНебольшойФирмой" ИЛИ МетаданныеИмя = "УправлениеНашейФирмой" Тогда
		Возврат "УНФ";
	ИначеЕсли МетаданныеИмя = "ЗарплатаИУправлениеПерсоналом" ИЛИ МетаданныеИмя = "ЗарплатаИУправлениеПерсоналомБазовая" ИЛИ МетаданныеИмя = "ЗарплатаИУправлениеПерсоналомКОРП" Тогда
		Возврат "ЗУП";
	ИначеЕсли МетаданныеИмя = "УправлениеПроизводственнымПредприятием" Тогда
		Возврат "УПП";
	ИначеЕсли МетаданныеИмя = "КомплекснаяАвтоматизация" ИЛИ МетаданныеИмя = "УправлениеПредприятием" Тогда
		
		Если Найти(Метаданные.Версия, "2.") Тогда
			Возврат "КА24";
		Иначе
			Возврат "КА";
		КонецЕсли;
		
	ИначеЕсли МетаданныеИмя = "УправлениеТорговлей"  Тогда
		
		Если Не Найти(Метаданные.Синоним, "11") = 0 Тогда
			Возврат "УТ11";
		Иначе
			Возврат "УТ";
		КонецЕсли;  		
		
	ИначеЕсли МетаданныеИмя = "БухгалтерияБюджетногоУчреждения" ИЛИ МетаданныеИмя = "БухгалтерияБюджетногоУчрежденияБазовая" Тогда
		Возврат "ББУ";
	ИначеЕсли МетаданныеИмя = "БухгалтерияГосударственногоУчреждения" ИЛИ МетаданныеИмя = "БухгалтерияГосударственногоУчрежденияБазовая" Тогда
		Возврат "БГУ";
	ИначеЕсли МетаданныеИмя = "ЗарплатаИКадрыБюджетногоУчреждения" ИЛИ МетаданныеИмя = "БазоваяФункциональностьКадрыЗарплата" Тогда
		Возврат "ЗБУ";
	ИначеЕсли МетаданныеИмя = "БухгалтерияПредприятияКОРП" Тогда
		Возврат "БПКОРП";
	ИначеЕсли МетаданныеИмя = "БухгалтерияАвтономногоУчрежденияКОРП" Тогда
		Возврат "БАУКОРП";
	ИначеЕсли МетаданныеИмя = "БухгалтерияАвтономногоУчреждения" ИЛИ МетаданныеИмя = "БухгалтерияАвтономногоУчрежденияБазовая" Тогда
		Возврат "БАУ";
	Иначе
		Возврат МетаданныеИмя;
	КонецЕсли;
	
КонецФункции // ИДКонфигурации()

Функция КНП_ТипПлатформы()
	
	СисИнфо = Новый СистемнаяИнформация;
	Возврат Лев(СисИнфо.ВерсияПриложения, 3);

КонецФункции

Функция КНП_ПроверкаКорректностиЗаполненияРеквизитов()
	
	Результат = "";
	АдреснаяСтруктураОрганизации = КЗП_ПолучитьСтруктуруАдресаИзБазы(Организация, КНП_ИмяКонфигурации() );
	
	Если АдреснаяСтруктураОрганизации = Неопределено Тогда
		Результат = "Проверка адреса организации " + Организация + ": Отсутствуют данные об адресе в базе";
	Иначе
		
		Для Каждого Поле Из АдреснаяСтруктураОрганизации Цикл
			
			Если НЕ ЗначениеЗаполнено(Поле.Значение) Тогда
				
				Если Поле.Ключ = "Индекс" ИЛИ Поле.Ключ = "КодРегиона" Тогда
					Результат = Результат + "Поле " + Поле.Ключ + " не заполнено; ";
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Результат) Тогда
			Результат = "Проверка адреса организации " + Организация + ": " + Результат;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция КНП_ПолучитьСтруктуруИзСоответствия(ЗначВход)
	
	СтруктураВозврат=Новый Структура;
	
	Если ТипЗнч(ЗначВход) = Тип("Соответствие") Тогда
		
		ФлагОщибка = Ложь;
		
		Для Каждого р Из ЗначВход Цикл
			
			Попытка
				СтруктураВозврат.Вставить(р.Ключ,КНП_ПолучитьСтруктуруИзСоответствия(р.Значение));
			Исключение
				
				ФлагОщибка = Истина;
				Прервать;
				
			КонецПопытки;
			
		КонецЦикла;
		
		Если ФлагОщибка Тогда // пришел ключ который невозможно поместить в структуру
			
			СтруктураВозврат = Новый Массив;
			
			Для Каждого р Из ЗначВход Цикл
				
				ДопСтруктура = Новый Структура;
				ДопСтруктура.Вставить("Ключ", р.Ключ);
				ДопСтруктура.Вставить("Значение", КНП_ПолучитьСтруктуруИзСоответствия(р.Значение));
				СтруктураВозврат.Добавить(ДопСтруктура);
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат СтруктураВозврат; 
		
	ИначеЕсли ТипЗнч(ЗначВход)=Тип("Массив") Тогда
		
		НовыйМассив=Новый Массив;
		
		Для Каждого ЭлМ Из ЗначВход Цикл
			НовыйМассив.Добавить(КНП_ПолучитьСтруктуруИзСоответствия(ЭлМ));
		КонецЦикла;
		
		Возврат НовыйМассив;
		
	КонецЕсли;
	
	Возврат ЗначВход; 
	
КонецФункции

Процедура КНП_СформироватьРеквизитыВБазе() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МенеджерДопСведений = МОП_ПолучитьМенеджераДопСведений();
	ДопРеквизитИдентификаторКонтрагента 					= МенеджерДопСведений.НайтиПоНаименованию("DS_Контрагент_ID");
	
	Если ДопРеквизитИдентификаторКонтрагента.Пустая() Тогда
		
		ДопРеквизитИдентификаторКонтрагента 				= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитИдентификаторКонтрагента.Наименование 	= "DS_Контрагент_ID";
		
		Если ДопРеквизитИдентификаторКонтрагента.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитИдентификаторКонтрагента.Заголовок 	= "DS_Контрагент_ID";	
		КонецЕсли;
		
		ДопРеквизитИдентификаторКонтрагента.ТипЗначения 	= Новый ОписаниеТипов("Число");
		ДопРеквизитИдентификаторКонтрагента.ОбменДанными.Загрузка = Истина;
		ДопРеквизитИдентификаторКонтрагента.Записать();
		
	КонецЕсли;
	
	ДопРеквизитИдентификаторПодразделения 					= МенеджерДопСведений.НайтиПоНаименованию("DS_Подразделение_ID");
	
	Если ДопРеквизитИдентификаторПодразделения.Пустая() Тогда
		
		ДопРеквизитИдентификаторПодразделения 				= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитИдентификаторПодразделения.Наименование 	= "DS_Подразделение_ID";
		
		Если ДопРеквизитИдентификаторПодразделения.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитИдентификаторПодразделения.Заголовок = "DS_Подразделение_ID";	
		КонецЕсли;
		
		ДопРеквизитИдентификаторПодразделения.ТипЗначения 	= Новый ОписаниеТипов("Число");
		ДопРеквизитИдентификаторПодразделения.ОбменДанными.Загрузка = Истина;
		ДопРеквизитИдентификаторПодразделения.Записать();
		
	КонецЕсли;
	
	ДопРеквизитИдентификаторДокумента 						= МенеджерДопСведений.НайтиПоНаименованию("DS_Документ_ID");
	
	Если ДопРеквизитИдентификаторДокумента.Пустая() Тогда
		
		ДопРеквизитИдентификаторДокумента 					= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитИдентификаторДокумента.Наименование 		= "DS_Документ_ID";
		
		Если ДопРеквизитИдентификаторДокумента.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитИдентификаторДокумента.Заголовок 	= "DS_Документ_ID";	
		КонецЕсли;
		
		ДопРеквизитИдентификаторДокумента.ТипЗначения 		= Новый ОписаниеТипов("Число");
		ДопРеквизитИдентификаторДокумента.ОбменДанными.Загрузка = Истина;
		ДопРеквизитИдентификаторДокумента.Записать();
		
	КонецЕсли;
	
	ДопРеквизитДатаВремяОтправки 							= МенеджерДопСведений.НайтиПоНаименованию("DS_ДатаВремяОтправки");
	
	Если ДопРеквизитДатаВремяОтправки.Пустая() Тогда
		
		ДопРеквизитДатаВремяОтправки 						= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитДатаВремяОтправки.Наименование 			= "DS_ДатаВремяОтправки";
		
		Если ДопРеквизитДатаВремяОтправки.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитДатаВремяОтправки.Заголовок 			= "DS_ДатаВремяОтправки";	
		КонецЕсли;
		
		ДопРеквизитДатаВремяОтправки.ТипЗначения 			= Новый ОписаниеТипов("Дата");
		ДопРеквизитДатаВремяОтправки.ОбменДанными.Загрузка 	= Истина;
		ДопРеквизитДатаВремяОтправки.Записать();
		
	КонецЕсли;
	
	ДопРеквизитСтатусДокумента								= МенеджерДопСведений.НайтиПоНаименованию("DS_СтатусДокумента");
	
	Если ДопРеквизитСтатусДокумента.Пустая() Тогда
		
		ДопРеквизитСтатусДокумента 							= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитСтатусДокумента.Наименование 			= "DS_СтатусДокумента";
		
		Если ДопРеквизитСтатусДокумента.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитСтатусДокумента.Заголовок 			= "DS_СтатусДокумента";	
		КонецЕсли;
		
		ДопРеквизитСтатусДокумента.ТипЗначения 				= Новый ОписаниеТипов("Строка");
		ДопРеквизитСтатусДокумента.ОбменДанными.Загрузка 	= Истина;
		ДопРеквизитСтатусДокумента.Записать();
		
	КонецЕсли;
	
	ДопРеквизитТокен										= МенеджерДопСведений.НайтиПоНаименованию("DS_Токен");
	
	Если ДопРеквизитТокен.Пустая() Тогда
		
		ДопРеквизитТокен 									= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитТокен.Наименование 						= "DS_Токен";
		
		Если ДопРеквизитТокен.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитТокен.Заголовок 						= "DS_Токен";	
		КонецЕсли;
		
		ДопРеквизитТокен.ТипЗначения 						= Новый ОписаниеТипов("Строка");
		ДопРеквизитТокен.ОбменДанными.Загрузка 				= Истина;
		ДопРеквизитТокен.Записать();
		
	КонецЕсли;
	
	ДопРеквизитХранилищеСопоставлений						= МенеджерДопСведений.НайтиПоНаименованию("DS_СопоставлениеНоменклатур");
	
	Если ДопРеквизитХранилищеСопоставлений.Пустая() Тогда
		
		ДопРеквизитХранилищеСопоставлений 				= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитХранилищеСопоставлений.Наименование 	= "DS_СопоставлениеНоменклатур";
		
		Если ДопРеквизитХранилищеСопоставлений.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитХранилищеСопоставлений.Заголовок 	= "DS_СопоставлениеНоменклатур";	
		КонецЕсли;
		
		ДопРеквизитХранилищеСопоставлений.ТипЗначения 	= Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов" );
		ДопРеквизитХранилищеСопоставлений.ОбменДанными.Загрузка = Истина;
		ДопРеквизитХранилищеСопоставлений.Записать();
		
	КонецЕсли;
	
	ДопРеквизитХранилищеСтатьиРасходов						= МенеджерДопСведений.НайтиПоНаименованию("DS_СопоставлениеСтатейРасходов");
	
	Если ДопРеквизитХранилищеСтатьиРасходов.Пустая() Тогда
		
		ДопРеквизитХранилищеСтатьиРасходов 				= МенеджерДопСведений.СоздатьЭлемент();
		ДопРеквизитХранилищеСтатьиРасходов.Наименование 	= "DS_СопоставлениеСтатейРасходов";
		
		Если ДопРеквизитХранилищеСтатьиРасходов.Метаданные().Реквизиты.Найти("Заголовок") <> Неопределено Тогда
			ДопРеквизитХранилищеСтатьиРасходов.Заголовок 	= "DS_СопоставлениеСтатейРасходов";	
		КонецЕсли;
		
		ДопРеквизитХранилищеСтатьиРасходов.ТипЗначения 	= Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов" );
		ДопРеквизитХранилищеСтатьиРасходов.ОбменДанными.Загрузка = Истина;
		ДопРеквизитХранилищеСтатьиРасходов.Записать();
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция КНП_РазобратьСтрокуВМассивСтруктур(Знач СтрокаДанных)
	
	/////////////
	//Разделителем строк является символ ;
	//Разделителем элементов является символ ,
	//Данные должны быть записаны в формате <ключ>=<значение>
	МассивДанных = СтрЗаменить(СтрокаДанных, ";", Символы.ПС);
	МассивСтрокТаблицы = Новый Массив;
	КоличествоСтрок = СтрЧислоСтрок(МассивДанных);
	
	Для Индекс = 1 По КоличествоСтрок Цикл
		
		СтруктураЭлементов = Новый Структура;
		СтрокаМассиваДанных = СтрПолучитьСтроку(МассивДанных, Индекс);
		МассивЭлементов = СтрЗаменить(СтрокаМассиваДанных, ",", Символы.ПС);
		
		Для НомерЭлемента = 1 По СтрЧислоСтрок(МассивЭлементов) Цикл
			
			СтрокаЭлемента = СтрПолучитьСтроку(МассивЭлементов, НомерЭлемента); 
			Разделитель = Найти(СтрокаЭлемента, "=");
			СтруктураЭлементов.Вставить(Лев(СтрокаЭлемента, Разделитель - 1), Сред(СтрокаЭлемента, Разделитель + 1) );
			
		КонецЦикла;
		
		МассивСтрокТаблицы.Добавить(СтруктураЭлементов);
		
	КонецЦикла;
	
	Возврат МассивСтрокТаблицы;

КонецФункции

Функция КНП_ПрочитатьJSONОтСервера(Значение)
	
	Если КНП_ТипПлатформы() = "8.2" Тогда 
		Возврат ПрочитатьJSON82(Значение);
	Иначе 
		Возврат ПрочитатьJSON83(Значение); 
	КонецЕсли;

КонецФункции

Функция КНП_ЗаписатьJSONНаСервере(Значение)
	
	Если КНП_ТипПлатформы() = "8.2" Тогда 
		Возврат ЗаписатьJSON82(Значение);
	Иначе 
		Возврат ЗаписатьJSON83(Значение); 
	КонецЕсли;	

КонецФункции

Функция КНП_ОбновитьРеквизитыЭлементСправочника(СтруктураДанных, СсылкаНаЭлемент)
	
	ОбъектСправочника = СсылкаНаЭлемент.ПолучитьОбъект();
	
	Для Каждого Элемент Из СтруктураДанных Цикл
		
		Если КНП_ЕстьРеквизит(ОбъектСправочника, Элемент.Ключ) ИЛИ Элемент.Ключ = "Наименование" Тогда
			
			Попытка
				Выполнить("ОбъектСправочника." + Элемент.Ключ + " = Элемент.Значение");	
			Исключение		
			КонецПопытки;
			
		КонецЕсли;
		
		Если Элемент.Ключ = "ОГРН" И КНП_ЕстьРеквизит(ОбъектСправочника, "РегистрационныйНомер") Тогда
			
			Попытка
				Выполнить("ОбъектСправочника.РегистрационныйНомер = Элемент.Значение");	
			Исключение		
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		ОбъектСправочника.Записать();
		Возврат Истина;
		
	Исключение
		
		ВывестиУведомлениеПользователю(ОписаниеОшибки() );
		Возврат Ложь;
		
	КонецПопытки;

КонецФункции

Функция КНП_КонвертироватьАдресИзСоответствия(Знач СоответствиеАдреса) 
	
	СтруктураАдреса = Новый Структура("КодСтраны,Страна,Индекс,КодРегиона,Регион,Город,Улица,Дом,Корпус,Квартира");
	СтруктураАдреса.КодСтраны 	= СоответствиеАдреса.Получить("country").Получить("code");
	СтруктураАдреса.Страна 		= СоответствиеАдреса.Получить("country").Получить("title");
	СтруктураАдреса.Индекс 		= СоответствиеАдреса.Получить("postalCode");
	СтруктураАдреса.КодРегиона 	= СоответствиеАдреса.Получить("region").Получить("code");
	СтруктураАдреса.Регион 		= СоответствиеАдреса.Получить("region").Получить("title");
	СтруктураАдреса.Город 		= СоответствиеАдреса.Получить("city");
	СтруктураАдреса.Улица 		= СоответствиеАдреса.Получить("street");
	СтруктураАдреса.Дом 		= СоответствиеАдреса.Получить("house");
	СтруктураАдреса.Корпус 		= СоответствиеАдреса.Получить("building");
	СтруктураАдреса.Квартира 	= СоответствиеАдреса.Получить("room");
	
	Возврат СтруктураАдреса;

КонецФункции

Функция КНП_ПривестиКДате(Знач Строка)
	
	Если НЕ ЗначениеЗаполнено(Строка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если КНП_ЭтоЧисло(Строка) Тогда
		
		Дата = МестноеВремя(Дата(1970,1,1,0,0,0) + Число(Строка) );
		Возврат Дата;
		
	Иначе
		
		ТаймЗона = "UTC";
		КорректныйПорядок = Найти(Строка, ТаймЗона) > 0;
		
		Если НЕ КорректныйПорядок Тогда
			
			//Попытка определить по формату yyyy-mm-ddTTT
			Если Сред(Строка, 5, 1) = "-" И Сред(Строка, 8, 1) = "-" И НЕ КНП_ЭтоЧисло(Сред(Строка, 11, 1) ) 
				И НЕ КНП_ЭтоЧисло(Сред(Строка, 12, 1) ) И НЕ КНП_ЭтоЧисло(Сред(Строка, 13, 1) ) Тогда
				
				КорректныйПорядок = Истина;
				ТаймЗона = Сред(Строка, 11, 3);
				
			КонецЕсли;
			
		КонецЕсли;
		
		Строка = СтрЗаменить(Строка, ТаймЗона, " ");
		
		ПозТ = Найти(Строка, "T");
		
		Если ПозТ > 0 Тогда
			
			КорректныйПорядок = Истина;
			Строка = Лев(Строка, ПозТ - 1);
			
		КонецЕсли;
		
		Если Сред(Строка, 3,1) = "." Тогда
			Строка = Прав(Строка, 4) + Сред(Строка, 4, 2) + Лев(Строка, 2);	
		КонецЕсли;
		
		Если Сред(Строка, 5,1) = "-" Тогда
			
			Если КорректныйПорядок Тогда
				Строка = Лев(Строка, 5) + Сред(Строка, 6, 2) + Сред(Строка, 8, 3) + Сред(Строка, 11)
			Иначе
				Строка = Лев(Строка, 5) + Сред(Строка, 9, 2) + Сред(Строка, 5, 3) + Сред(Строка, 11)	
			КонецЕсли;
			
		КонецЕсли;
		
		Строка = СтрЗаменить(Строка, ":", "");
		Строка = СтрЗаменить(Строка, "-", "");
		Строка = СтрЗаменить(Строка, ".", "");
		Строка = СтрЗаменить(Строка, " ", "");
		
	КонецЕсли;
	
	Если СтрДлина(Строка) < 14 Тогда
		Строка = Лев(Строка, 8) + "000000";
	КонецЕсли;
	
	Попытка
		Результат = Дата(Строка);
	Исключение
		Результат = Дата(Лев(Строка, 4) + Сред(Строка, 7, 2) + Сред(Строка, 5, 2) + Сред(Строка, 9) );	
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

Функция КНП_ОбработатьСтрокуBase64(Знач СтрокаBase64, URLEncoded = Ложь)
	
	ОбработаннаяСтрока = СтрЗаменить(СтрокаBase64, Символы.ПС, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, Символы.НПП, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, Символы.ВК, "");
	ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, " ", "");
	
	Если URLEncoded Тогда
		ОбработаннаяСтрока = СтрЗаменить(ОбработаннаяСтрока, "+", КНП_URLEncode("+") );
	КонецЕсли;
	
	Возврат ОбработаннаяСтрока;

КонецФункции

Функция КНП_ПолучитьСортированнуюТаблицуКлючейЗначений(СтруктураДанных)
	
	ТаблицаКлючейЗначений = Новый ТаблицаЗначений;
	ТаблицаКлючейЗначений.Колонки.Добавить("Ключ");
	ТаблицаКлючейЗначений.Колонки.Добавить("Значение");
	
	Для Каждого ЭлементСтруктуры Из СтруктураДанных Цикл
		
		СтрокаТЧ = ТаблицаКлючейЗначений.Добавить();
		СтрокаТЧ.Ключ = ЭлементСтруктуры.Ключ;
		СтрокаТЧ.Значение = ЭлементСтруктуры.Значение;
		
	КонецЦикла;
	
	ТаблицаКлючейЗначений.Сортировать("Ключ ВОЗР");
	Возврат ТаблицаКлючейЗначений;

КонецФункции

Функция КНП_ПолучитьСокращениеРеквАдреса(ИмяРеквизита, ЗначениеРеквизита)
	
	Результат = "";
	
	Если ИмяРеквизита = "Улица" Тогда
		
		Если Найти(НРег(ЗначениеРеквизита), "улица ") ИЛИ Найти(НРег(ЗначениеРеквизита), "ул.") ИЛИ Найти(НРег(ЗначениеРеквизита), "ул ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), " ул") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), "проспект") ИЛИ Найти(НРег(ЗначениеРеквизита), "пр.") ИЛИ Найти(НРег(ЗначениеРеквизита), "пр ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), " пр")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "шоссе") ИЛИ Найти(НРег(ЗначениеРеквизита), "ш.") ИЛИ Найти(НРег(ЗначениеРеквизита), "ш ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), " ш") Тогда
			Результат = ЗначениеРеквизита;
		Иначе
			Результат = "ул. " + ЗначениеРеквизита;
		КонецЕсли;
		
	ИначеЕсли ИмяРеквизита = "Дом" Тогда
		
		Если Найти(НРег(ЗначениеРеквизита), "дом ") ИЛИ Найти(НРег(ЗначениеРеквизита), "д.") ИЛИ Найти(НРег(ЗначениеРеквизита), "д ") 	
			Тогда
			Результат = ЗначениеРеквизита;
		Иначе
			Результат = "д. " + ЗначениеРеквизита;
		КонецЕсли;	
		
	ИначеЕсли ИмяРеквизита = "Корпус" Тогда
		
		Если Найти(НРег(ЗначениеРеквизита), "корпус ") ИЛИ Найти(НРег(ЗначениеРеквизита), "корп.") ИЛИ Найти(НРег(ЗначениеРеквизита), "корп ") ИЛИ Найти(НРег(ЗначениеРеквизита), "к. ") ИЛИ Найти(НРег(ЗначениеРеквизита), "к ")  
			ИЛИ Найти(НРег(ЗначениеРеквизита), "литера ") ИЛИ Найти(НРег(ЗначениеРеквизита), "лит.") ИЛИ Найти(НРег(ЗначениеРеквизита), "лит ")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "здание ") ИЛИ Найти(НРег(ЗначениеРеквизита), "зд.") ИЛИ Найти(НРег(ЗначениеРеквизита), "зд ")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "этаж") ИЛИ Найти(НРег(ЗначениеРеквизита), "эт.") ИЛИ Найти(НРег(ЗначениеРеквизита), "эт ") ИЛИ Найти(НРег(ЗначениеРеквизита), " эт")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "строение ") ИЛИ Найти(НРег(ЗначениеРеквизита), "стр.") ИЛИ Найти(НРег(ЗначениеРеквизита), "стр ") ИЛИ Найти(НРег(ЗначениеРеквизита), " стр")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "дом ") ИЛИ Найти(НРег(ЗначениеРеквизита), "д.") ИЛИ Найти(НРег(ЗначениеРеквизита), "д ") ИЛИ Найти(НРег(ЗначениеРеквизита), " д")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "владение ") ИЛИ Найти(НРег(ЗначениеРеквизита), "влд.") ИЛИ Найти(НРег(ЗначениеРеквизита), "влд ") ИЛИ Найти(НРег(ЗначениеРеквизита), " влд")
			
			Тогда
			Результат = ЗначениеРеквизита;
		Иначе
			Результат = ?(Найти(ЗначениеРеквизита,","), ЗначениеРеквизита, "корп. " + ЗначениеРеквизита);
		КонецЕсли;
		
	ИначеЕсли ИмяРеквизита = "Строение" Тогда	
		
		Если Найти(НРег(ЗначениеРеквизита), "строение ") ИЛИ Найти(НРег(ЗначениеРеквизита), "стр.") ИЛИ Найти(НРег(ЗначениеРеквизита), "стр ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), " стр")
			Тогда
			Результат = ЗначениеРеквизита;
		Иначе
			Результат = "стр. " + ЗначениеРеквизита;
		КонецЕсли;
		
	ИначеЕсли ИмяРеквизита = "Квартира" Тогда
		
		Если Найти(НРег(ЗначениеРеквизита), "квартира ") ИЛИ Найти(НРег(ЗначениеРеквизита), "кв.") ИЛИ Найти(НРег(ЗначениеРеквизита), "кв ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), "помещение") ИЛИ Найти(НРег(ЗначениеРеквизита), "пом.") ИЛИ Найти(НРег(ЗначениеРеквизита), "пом ")
			
			ИЛИ Найти(НРег(ЗначениеРеквизита), "офис") ИЛИ Найти(НРег(ЗначениеРеквизита), "оф.") ИЛИ Найти(НРег(ЗначениеРеквизита), "оф ")
			ИЛИ Найти(НРег(ЗначениеРеквизита), "комната") ИЛИ Найти(НРег(ЗначениеРеквизита), "ком.") ИЛИ Найти(НРег(ЗначениеРеквизита), "ком ") 
			ИЛИ Найти(НРег(ЗначениеРеквизита), " ком") ИЛИ Найти(НРег(ЗначениеРеквизита), "комн.") 
			Тогда
			Результат = ЗначениеРеквизита;
		Иначе
			Результат = "пом. " + ЗначениеРеквизита;
		КонецЕсли;
		
	Иначе
		Результат = ЗначениеРеквизита;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура КНП_СкорректироватьАдресСервера(Знач АдресСервера)
	
	АдресСервера = СокрЛП(АдресСервера); 
	
	Если Не Прав(АдресСервера,1) = "/" Тогда
		АдресСервера = АдресСервера + "/";
	КонецЕсли;
	
	HostAddress = АдресСервера;	

КонецПроцедуры

//#КонецОбласти 
////////////////////////////////////////////////////////////////////////
//....................................................................//
//			#КонецОбласти КонфигурационноНезависимыеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#Область КонфигурационноЗависимыеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область КонфигурационноЗависимыеПроцедуры

// Процедура - Заполнить доп параметры документа по умолчанию в зависимости от конфигурации
//
// Параметры:
//  ДокОбъект		 - ДокументОбъект	 - Объект документа
//  ТекКонфигурация	 - Строка	 - Наименование конфигурации
//  ТипДокумента	 - Строка	 - Тип документа из входящих документов
//
Процедура КЗП_ЗаполнитьДопПараметрыДокумента(ДокОбъект, ТипДокумента)
	
	ТекКонфигурация = КНП_ИмяКонфигурации();
	
	Если ТекКонфигурация = "БП3" Тогда
		
		ИмяТЧ = "Товары";
		
		Если ТипДокумента = "Акт" Тогда
			ИмяТЧ = "Услуги";	
		КонецЕсли;
		
		МодульСчетаУчета = КНП_ОбщийМодуль("СчетаУчетаВДокументах");
		МодульСчетаУчета.ЗаполнитьСчетаУчетаРасчетов(ДокОбъект);
		МодульСчетаУчета.ЗаполнитьСчетаУчетаВТабличнойЧасти(ДокОбъект, ИмяТЧ);
		
	ИначеЕсли ТекКонфигурация = "БП" Тогда
		
		Попытка
			
			ДокОбъект.ЗаполнитьСчетаУчетаВТабЧасти(ДокОбъект.Товары, "Товары", Истина, Истина);
			ДокОбъект.ЗаполнитьСчетаУчетаВТабЧасти(ДокОбъект.Услуги, "Услуги", Истина, Истина);
			ДокОбъект.ЗаполнитьСчетаУчетаРасчетов();
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки() + " " + ТекКонфигурация, "ЗаполнитьДопПараметрыДокумента");
		КонецПопытки;
		
	ИначеЕсли ТекКонфигурация = "УТ11" Тогда
		
		ИмяТЧ = "Товары";
		
		Если ТипДокумента = "Акт" Тогда
			ИмяТЧ = "Услуги";	
		КонецЕсли;
		
	ИначеЕсли ТекКонфигурация = "УНФ" Тогда
		
		ИмяТЧ = "Запасы";
		
		Если ТипДокумента = "Акт" Тогда
			ИмяТЧ = "Расходы";	
		КонецЕсли;
		
	ИначеЕсли ТекКонфигурация = "БГУ" Тогда
		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонфигурация, "ЗаполнитьДопПараметрыДокумента");		
	КонецЕсли;
	
КонецПроцедуры

// Найти СФПоставщика
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  Номер		 - Строка	 - 
//  Дата		 - Дата	 - 
//  Контрагент	 - СправочникСсылка	 - 
// 
// Возвращаемое значение:
// ДокументСсылка  - 
//
Функция КЗП_НайтиОснованиеСчетФактурыПоставщика(Номер, Дата, Контрагент)
	
	Результат = Неопределено;
	ТекКонф = КНП_ИмяКонфигурации();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", Номер);
	Запрос.УстановитьПараметр("ДатаВходящегоДокумента", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Если ТекКонф = "БП3" ИЛИ ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" ИЛИ ТекКонф = "УНФ" Тогда	
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураПолученный.ДокументОснование КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.Контрагент = &Контрагент
		|	И СчетФактураПолученный.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И СчетФактураПолученный.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	ИначеЕсли ТекКонф = "БГУ" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
		|ГДЕ
		|	СчетФактураПолученныйДокументыОснования.Ссылка.НомерПервичногоДокумента = &НомерВходящегоДокумента
		|	И СчетФактураПолученныйДокументыОснования.Ссылка.ДатаПервичногоДокумента = &ДатаВходящегоДокумента";	
	ИначеЕсли ТекКонф = "УТ11" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеУслугПрочихАктивов.Ссылка
		|ИЗ
		|	Документ.ПоступлениеУслугПрочихАктивов КАК ПоступлениеУслугПрочихАктивов
		|ГДЕ
		|	ПоступлениеУслугПрочихАктивов.Контрагент = &Контрагент
		|	И ПоступлениеУслугПрочихАктивов.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ПоступлениеУслугПрочихАктивов.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	ИначеЕсли ТекКонф = "КА24" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриобретениеТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
		|ГДЕ
		|	ПриобретениеТоваровУслуг.Контрагент = &Контрагент
		|	И ПриобретениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ПриобретениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоступлениеУслугПрочихАктивов.Ссылка
		|ИЗ
		|	Документ.ПриобретениеУслугПрочихАктивов КАК ПоступлениеУслугПрочихАктивов
		|ГДЕ
		|	ПоступлениеУслугПрочихАктивов.Контрагент = &Контрагент
		|	И ПоступлениеУслугПрочихАктивов.НомерВходящегоДокумента = &НомерВходящегоДокумента
		|	И ПоступлениеУслугПрочихАктивов.ДатаВходящегоДокумента = &ДатаВходящегоДокумента";
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонф, "КЗП_НайтиСФПоставщика");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запрос.Текст) Тогда
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Получить договор контрагента с организацией
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  КонтрагентСсылка	 - СправочникСсылка.Контрагенты	 - 
//  ОрганизацияСсылка	 - СправочникСсылка.Организации	 - 
//  НомерДоговора		 - Строка	 - 
//  ДатаДоговора		 - Дата	 - 
// 
// Возвращаемое значение:
// СправочникСсылка, Неопределено  - Ссылка на договор
//
Функция КЗП_ПолучитьДоговорКонтрагентаСОрганизацией(КонтрагентСсылка, ОрганизацияСсылка, 
	НомерДоговора = Неопределено, ДатаДоговора = Неопределено)
	
	Запрос = Новый Запрос;
	ТекКонф = КНП_ИмяКонфигурации();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Номер КАК Номер,
	|	ДоговорыКонтрагентов.Дата КАК Дата
	|ИЗ
	|	Справочник.{ДоговорыКонтрагентов} КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.{ВладелецКонтрагента} = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация";
	
	Если ТекКонф = "БП3" ИЛИ ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДоговорыКонтрагентов}", "ДоговорыКонтрагентов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВладелецКонтрагента}", "Владелец");
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДоговорыКонтрагентов}", "ДоговорыКонтрагентов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВладелецКонтрагента}", "Контрагент");
		
	ИначеЕсли ТекКонф = "УНФ" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДоговорыКонтрагентов}", "ДоговорыКонтрагентов");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВладелецКонтрагента}", "Владелец");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорыКонтрагентов.Номер", "ДоговорыКонтрагентов.НомерДоговора");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорыКонтрагентов.Дата", "ДоговорыКонтрагентов.ДатаДоговора");
		
	ИначеЕсли ТекКонф = "БГУ" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ДоговорыКонтрагентов}", "Договоры");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "{ВладелецКонтрагента}", "Контрагент");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорыКонтрагентов.Номер", "ДоговорыКонтрагентов.НомерДоговора");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоговорыКонтрагентов.Дата", "ДоговорыКонтрагентов.ДатаДоговора");
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПоследнийДоговор = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ДатаДоговора) Тогда
			
			Если ЗначениеЗаполнено(НомерДоговора) Тогда
				
				Если Выборка.Номер = НомерДоговора И Выборка.Дата = ДатаДоговора Тогда
					Возврат Выборка.Ссылка;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Выборка.Дата = ДатаДоговора Тогда
				Возврат Выборка.Ссылка
			КонецЕсли;
			
		КонецЕсли;
		
		ПоследнийДоговор = Выборка.Ссылка;
		
	КонецЦикла;
	
	Возврат ПоследнийДоговор;

КонецФункции

// Получить должность физ лица
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ФизЛицо	 - СправочникСсылка	 - Ссылка на элемент справочника физлиц
// 
// Возвращаемое значение:
// СправочникСсылка  - Ссылка на должность
//
Функция КЗП_ПолучитьДолжностьФизЛица(ФизЛицо)
	
	ТекКонф = КНП_ИмяКонфигурации();
	Запрос = Новый Запрос;
	
	Если ТекКонф = "БП3" ИЛИ ТекКонф = "БП" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛица.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних КАК ОтветственныеЛица
		|ГДЕ
		|	ОтветственныеЛица.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОтветственныеЛица.СтруктурнаяЕдиница = &Организация";
	ИначеЕсли ТекКонф = "УТ" Тогда //Вся тупость в том, что отличие БП от УТ - в наличии \ отсутствии Й в конце наименования регистра
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛица.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних КАК ОтветственныеЛица  
		|ГДЕ
		|	ОтветственныеЛица.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОтветственныеЛица.СтруктурнаяЕдиница = &Организация";	
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОтветственныеЛица.Должность КАК Должность
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛица
		|ГДЕ
		|	ОтветственныеЛица.Владелец = &Организация
		|	И ОтветственныеЛица.ФизическоеЛицо = &ФизическоеЛицо
		|	И ОтветственныеЛица.ДатаНачала <= &ТекущаяДата
		|	И (ОтветственныеЛица.ДатаОкончания >= &ТекущаяДата
		|			ИЛИ ОтветственныеЛица.ДатаОкончания ЕСТЬ NULL)";
	ИначеЕсли ТекКонф = "БГУ" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ДанныеСотрудников.СрезПоследних КАК ДанныеСотрудниковСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ДанныеСотрудниковСрезПоследних.Сотрудник.Контрагент = Контрагенты.Ссылка
		|ГДЕ
		|	Контрагенты.ЮридическоеФизическоеЛицо = &ФизическоеЛицо
		|	И ДанныеСотрудниковСрезПоследних.Организация = &Организация";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата() );
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Должность;
	КонецЕсли;
	
	Возврат Неопределено;
	
	
КонецФункции

// Получить ответственное лицо по роли
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  Роль - ПеречислениеСсылка 	 - Вид ответственного лица
// 
// Возвращаемое значение:
// СправочникСсылка  - Ссылка на справочник физлиц
//
Функция КЗП_ПолучитьОтветственноеЛицо(Роль = Неопределено)
	
	ТекКонф = КНП_ИмяКонфигурации();
	Запрос = Новый Запрос;
	
	Если ТекКонф = "БП3" ИЛИ ТекКонф = "БП" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ОтветственныеЛица.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних КАК ОтветственныеЛица
		|ГДЕ
		|	ОтветственныеЛица.СтруктурнаяЕдиница = &Организация
		|	И ОтветственныеЛица.ОтветственноеЛицо = &Роль";
	ИначеЕсли ТекКонф = "УТ" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		|	ОтветственныеЛица.ФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних КАК ОтветственныеЛица
		|ГДЕ
		|	ОтветственныеЛица.СтруктурнаяЕдиница = &Организация
		|	И ОтветственныеЛица.ОтветственноеЛицо = &Роль";	
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтветственныеЛица.ФизическоеЛицо
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛица
		|ГДЕ
		|	ОтветственныеЛица.Владелец = &Организация
		|	И ОтветственныеЛица.ОтветственноеЛицо = &Роль
		|	И ОтветственныеЛица.ДатаНачала <= &ТекущаяДата
		|	И (ОтветственныеЛица.ДатаОкончания >= &ТекущаяДата
		|			ИЛИ ОтветственныеЛица.ДатаОкончания ЕСТЬ NULL)";
	ИначеЕсли ТекКонф = "БГУ" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних КАК ОтветственныеЛица
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ОтветственныеЛица.ОтветственноеЛицо = Контрагенты.Ссылка
		|			И (ТИПЗНАЧЕНИЯ(Контрагенты.ЮридическоеФизическоеЛицо) = ТИП(Справочник.ФизическиеЛица))
		|ГДЕ
		|	ОтветственныеЛица.Организация = &Организация
		|	И ОтветственныеЛица.ОтветственноеЛицо = &Роль";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата() );
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(Роль) Тогда
		Запрос.УстановитьПараметр("Роль", Роль);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ОтветственныеЛица.ОтветственноеЛицо = &Роль", ""); 	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запрос.Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФизическоеЛицо;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КЗП_ПолучитьПФАктаСверки(СсылкаНаДокумент)
	
	ТекКонф = КНП_ИмяКонфигурации();
	ТабДок = Неопределено;
	
	Если ТекКонф = "БП3" ИЛИ ТекКонф = "БГУ" Тогда
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(СсылкаНаДокумент);
		
		ИменаМакетов = Новый Массив;
		ИменаМакетов.Добавить("АктСверки");
		
		МодульПечати = КНП_ОбщийМодуль("УправлениеПечатью");
		КоллекцияПФ = МодульПечати.СформироватьПечатныеФормы("Документ.АктСверкиВзаиморасчетов", ИменаМакетов, МассивДокументов, Новый Структура).КоллекцияПечатныхФорм;
		
		Если КоллекцияПФ.Количество() > 0 Тогда
			ТабДок = КоллекцияПФ[0].ТабличныйДокумент;
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(СсылкаНаДокумент);
		
		ИменаМакетов = Новый Массив;
		ИменаМакетов.Добавить("АктСверкиВзаимныхРасчетов");
		
		МодульПечати = КНП_ОбщийМодуль("УправлениеПечатью");
		КоллекцияПФ = МодульПечати.СформироватьПечатныеФормы("Документ.СверкаВзаиморасчетов", ИменаМакетов, МассивДокументов, Новый Структура).КоллекцияПечатныхФорм;
		
		Если КоллекцияПФ.Количество() > 0 Тогда
			ТабДок = КоллекцияПФ[0].ТабличныйДокумент;
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "УТ" Тогда
		ТабДок = КЗП_Служебный_ПечатьАктаСверкиУТ103(СсылкаНаДокумент);
	ИначеЕсли ТекКонф = "УНФ" Тогда
		
		МассивДокументов = Новый Массив;
		МассивДокументов.Добавить(СсылкаНаДокумент);
		
		ИменаМакетов = "АктСДаннымиКонтрагента";
		
		МодульПечати = КНП_ОбщийМодуль("УправлениеПечатью");
		КоллекцияПФ = МодульПечати.СформироватьПечатныеФормы("Документ.СверкаВзаиморасчетов", ИменаМакетов, МассивДокументов, Новый Структура).КоллекцияПечатныхФорм;
		
		Если КоллекцияПФ.Количество() > 0 Тогда
			ТабДок = КоллекцияПФ[0].ТабличныйДокумент;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции

// Получить представление контрагента
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  Контрагент		 - СправочникСсылка.Контрагенты	 - 
//  ТипПредставления - Строка	 - Указатель какое представление нужно получить
// 
// Возвращаемое значение:
// Строка  - Представление контрагента
//
Функция КЗП_ПолучитьПредставлениеКонтрагента(Контрагент, ТипПредставления = "")
	
	Результат = "";
	ТекКонф = КНП_ИмяКонфигурации();
	
	Если ТекКонф = "БП3" Тогда
		
		МодульБухПереопределяемый = КНП_ОбщийМодуль("БухгалтерскийУчетПереопределяемый");
		МодульОбщегоНазначения = КНП_ОбщийМодуль("ОбщегоНазначенияБПВызовСервера");
		Результат = МодульОбщегоНазначения.ОписаниеОрганизации(МодульБухПереопределяемый.СведенияОЮрФизЛице(Контрагент), ТипПредставления );			
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		МодульФормированиеПечатныхФорм = КНП_ОбщийМодуль("ФормированиеПечатныхФорм");
		Результат = МодульФормированиеПечатныхФорм.ОписаниеОрганизации(МодульФормированиеПечатныхФорм.СведенияОЮрФизЛице(Контрагент, ТекущаяДата() ), ТипПредставления );
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		МодульФормированиеПечатныхФорм = КНП_ОбщийМодуль("ФормированиеПечатныхФорм");
		МодульКонтактнойИнформации = КНП_ОбщийМодуль("УправлениеКонтактнойИнформацией");
		Результат = МодульФормированиеПечатныхФорм.ОписаниеОрганизации(МодульКонтактнойИнформации.СведенияОЮрФизЛице(Контрагент, ТекущаяДата() ), ТипПредставления);	
		
	ИначеЕсли ТекКонф = "БГУ" Тогда
		
		Если ТипЗнч(Контрагент.ЮридическоеФизическоеЛицо) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
			Результат = Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное;
		Иначе
			Результат = Контрагент.Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает структуру адреса, используя методы типовой конфигурации
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Параметры:
// 	Владелец - СправочникСсылка.Организации, СправочникСсылка.Контрагенты - Ссылка на элемент справочника
// 	ТекущаяКонфигурация - Строка - Краткое название текущей конфигурации. См. ПолучитьИмяКонфигурации()
// Возвращаемое значение:
// 	Структура, Неопределено - Структура адреса или неопределено, если произошла какая-то ошибка
Функция КЗП_ПолучитьСтруктуруАдресаИзБазы(Владелец, ТекКонф, ВидКонтактнойИнформации = Неопределено)
	
	МодульУправленияКонтактнойИнформацией = Неопределено;
	АдресСтруктурой = Неопределено;
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		ВидКонтактнойИнформации = МОП_ПолучитьВидКИЮрАдреса(Владелец, ТекКонф);
	КонецЕсли;
	
	Если ВидКонтактнойИнформации = Неопределено Тогда
		Возврат АдресСтруктурой;
	КонецЕсли;
	
	Если ТекКонф = "БП3" Тогда
		
		МодульУправленияКонтактнойИнформацией = КНП_ОбщийМодуль("УправлениеКонтактнойИнформациейБП");
		АдресСтруктурой = МодульУправленияКонтактнойИнформацией.АдресСтруктурой(Владелец, ВидКонтактнойИнформации);	 
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		МодульУправленияКонтактнойИнформацией = КНП_ОбщийМодуль("УправлениеКонтактнойИнформацией");
		
		НаборЗаписейКИ = РегистрыСведений.КонтактнаяИнформация.СоздатьНаборЗаписей();
		НаборЗаписейКИ.Отбор.Объект.Установить(Владелец);
		НаборЗаписейКИ.Отбор.Вид.Установить(ВидКонтактнойИнформации);
		НаборЗаписейКИ.Прочитать();
		
		Если НаборЗаписейКИ.Количество() > 0 Тогда
			
			КИ = НаборЗаписейКИ[0]; 
			
			ПредставлениеАдреса = МодульУправленияКонтактнойИнформацией.ПолучитьПолныйАдрес(НаборЗаписейКИ[0]);
			
			Если НЕ ЗначениеЗаполнено(ПредставлениеАдреса) Тогда
				Возврат Неопределено;
			КонецЕсли;    
			
			ЧислоВхожденийЗапятойВАдрес = СтрЧислоВхождений(ПредставлениеАдреса, ","); 
			
			Если ЧислоВхожденийЗапятойВАдрес > 9 Тогда
				
				АдресСтруктурой = Новый Структура;
				АдресСтруктурой.Вставить("Страна","");
				АдресСтруктурой.Вставить("Индекс","");
				АдресСтруктурой.Вставить("Регион","");
				АдресСтруктурой.Вставить("Район","");
				АдресСтруктурой.Вставить("Город","");
				АдресСтруктурой.Вставить("НаселенныйПункт","");
				АдресСтруктурой.Вставить("Улица","");
				АдресСтруктурой.Вставить("Дом","");
				АдресСтруктурой.Вставить("Корпус","");
				АдресСтруктурой.Вставить("Квартира","");
				
				АдресСтруктурой.Индекс = КИ.Поле1;
				АдресСтруктурой.Регион = КИ.Поле2;
				АдресСтруктурой.Район  = КИ.Поле3;
				АдресСтруктурой.Город  = КИ.Поле4;
				АдресСтруктурой.НаселенныйПункт = КИ.Поле5;
				АдресСтруктурой.Улица  = КИ.Поле6;
				АдресСтруктурой.Дом    = ?(ЗначениеЗаполнено(КИ.Поле7), ПолучитьТипДляКИКратко(КИ.ТипДома), "") + КИ.Поле7;
				АдресСтруктурой.Корпус = ?(ЗначениеЗаполнено(КИ.Поле8), ПолучитьТипДляКИКратко(КИ.ТипКорпуса), "") + КИ.Поле8;
				АдресСтруктурой.Квартира = ?(ЗначениеЗаполнено(КИ.Поле9), ПолучитьТипДляКИКратко(КИ.ТипКвартиры), "") + КИ.Поле9; 
				
			Иначе
				
				АдресСтруктурой = МодульУправленияКонтактнойИнформацией.ПолучитьСтруктуруАдресаИзСтроки(ПредставлениеАдреса);
				
				Если НЕ (АдресСтруктурой.Свойство("ЗаПределамиРФ") И АдресСтруктурой.ЗаПределамиРФ) Тогда
					
					АдресСтруктурой.Дом    = ?(ЗначениеЗаполнено(АдресСтруктурой.Дом), ПолучитьТипДляКИКратко(КИ.ТипДома), "") + АдресСтруктурой.Дом;
					АдресСтруктурой.Корпус = ?(ЗначениеЗаполнено(АдресСтруктурой.Корпус), ПолучитьТипДляКИКратко(КИ.ТипКорпуса), "") + АдресСтруктурой.Корпус;
					АдресСтруктурой.Квартира = ?(ЗначениеЗаполнено(АдресСтруктурой.Квартира), ПолучитьТипДляКИКратко(КИ.ТипКвартиры), "") + АдресСтруктурой.Квартира;
					
				КонецЕсли;
				
			КонецЕсли;   
			
			АдресСтруктурой.Вставить("Представление", КИ.Представление);
			АдресСтруктурой.Вставить("ТипАдреса", "text");
			
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "УНФ" ИЛИ ТекКонф = "БГУ"
		ИЛИ ТекКонф = "БП3" И НЕ (ЗначениеЗаполнено(АдресСтруктурой.Индекс) И ЗначениеЗаполнено(АдресСтруктурой.КодРегиона) ) Тогда
		
		МодульУправленияКонтактнойИнформацией = КНП_ОбщийМодуль("УправлениеКонтактнойИнформацией");
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Владелец);
		XMLСтрока = Неопределено;
		КонтактнаяИнформацияОбъекта = МодульУправленияКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(МассивОбъектов,, ВидКонтактнойИнформации, ТекущаяДата() );
		
		Если КонтактнаяИнформацияОбъекта.Количество() > 0 Тогда
			XMLСтрока = КонтактнаяИнформацияОбъекта[0].ЗначенияПолей;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(XMLСтрока) Тогда
			Возврат МодульУправленияКонтактнойИнформацией.СведенияОбАдресе("");
		КонецЕсли;
		
		АдресСтруктурой = МодульУправленияКонтактнойИнформацией.СведенияОбАдресе(XMLСтрока);
		
		Если НЕ АдресСтруктурой.Свойство("Дом") Тогда
			АдресСтруктурой.Вставить("Дом", АдресСтруктурой.Здание.Номер);
		ИначеЕсли НЕ ЗначениеЗаполнено(АдресСтруктурой.Дом) И ЗначениеЗаполнено(АдресСтруктурой.Здание.Номер) Тогда
			АдресСтруктурой.Дом = АдресСтруктурой.Здание.Номер;	
		КонецЕсли;
		
		Если НЕ АдресСтруктурой.Свойство("Корпус") Тогда
			
			АдресСтруктурой.Вставить("Корпус", ?(АдресСтруктурой.Корпуса.Количество() > 0, АдресСтруктурой.Корпуса[0], "") );
			
			Если ТипЗнч(АдресСтруктурой.Корпус) = Тип("Структура") Тогда
				АдресСтруктурой.Корпус = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Корпус, "ТипКорпуса") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Корпус, "Номер");
			КонецЕсли;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(АдресСтруктурой.Корпус) Тогда
			
			АдресСтруктурой.Корпус = ?(АдресСтруктурой.Корпуса.Количество() > 0, АдресСтруктурой.Корпуса[0], "");
			
			Если ТипЗнч(АдресСтруктурой.Корпус) = Тип("Структура") Тогда
				АдресСтруктурой.Корпус = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Корпус, "ТипКорпуса") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Корпус, "Номер");
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ АдресСтруктурой.Свойство("Здание") Тогда
			
			АдресСтруктурой.Вставить("Здание", ?(АдресСтруктурой.Здания.Количество() > 0, АдресСтруктурой.Здания[0], "") );
			
			Если ТипЗнч(АдресСтруктурой.Здание) = Тип("Структура") Тогда
				АдресСтруктурой.Здание = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Здание, "ТипКорпуса") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Здание, "Номер");
			КонецЕсли;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(АдресСтруктурой.Здание) Тогда
			
			АдресСтруктурой.Здание = ?(АдресСтруктурой.Здания.Количество() > 0, АдресСтруктурой.Здания[0], "");
			
			Если ТипЗнч(АдресСтруктурой.Здание) = Тип("Структура") Тогда
				АдресСтруктурой.Здание = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Здание, "ТипКорпуса") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Здание, "Номер");
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ АдресСтруктурой.Свойство("Квартира") Тогда
			
			Если АдресСтруктурой.Помещения.Количество() > 0 Тогда 
				
				Если нрег(АдресСтруктурой.Помещения[0].типпомещения) = "квартира" Тогда
					
					АдресСтруктурой.Вставить("Квартира", ?(АдресСтруктурой.Помещения.Количество() > 0, АдресСтруктурой.Помещения[0], "") );
					
					Если ТипЗнч(АдресСтруктурой.Квартира) = Тип("Структура") Тогда
						АдресСтруктурой.Квартира = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Квартира, "ТипПомещения") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Квартира, "Номер");
					КонецЕсли;
					
				Иначе
					АдресСтруктурой.Вставить(АдресСтруктурой.Помещения[0].ТипПомещения,Строка(АдресСтруктурой.Помещения[0].Номер));
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(АдресСтруктурой.Квартира) Тогда
			
			АдресСтруктурой.Квартира = ?(АдресСтруктурой.Помещения.Количество() > 0, АдресСтруктурой.Помещения[0], "") ;
			
			Если ТипЗнч(АдресСтруктурой.Квартира) = Тип("Структура") Тогда
				АдресСтруктурой.Квартира = КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Квартира, "ТипПомещения") + " " + КНП_БезопасноПрочитатьЗначение(АдресСтруктурой.Квартира, "Номер");
			КонецЕсли;
			
		КонецЕсли;
		
		Если АдресСтруктурой.Помещения.Количество() > 1 Тогда
			
			Для Индекс = 1 По АдресСтруктурой.Помещения.Количество() - 1 Цикл
				
				Если НЕ АдресСтруктурой.Свойство(АдресСтруктурой.Помещения[Индекс].ТипПомещения) Тогда
					АдресСтруктурой.Вставить(АдресСтруктурой.Помещения[Индекс].ТипПомещения,Строка(АдресСтруктурой.Помещения[Индекс].Номер));
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонф, "ЗаполнитьСтруктуруАдреса");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если АдресСтруктурой = Неопределено Тогда
		Возврат АдресСтруктурой;
	КонецЕсли;
	
	
	
	Если НЕ АдресСтруктурой.Свойство("Регион") Тогда
		АдресСтруктурой.Вставить("Регион", "");
	КонецЕсли;
	
	Если НЕ АдресСтруктурой.Свойство("КодРегиона") Тогда
		
		АдресСтруктурой.Вставить("КодРегиона", "");
		
		Если ЗначениеЗаполнено(АдресСтруктурой.Регион) Тогда
			
			ИмяРегиона = АдресСтруктурой.Регион;
			
			Если Найти(ИмяРегиона, " г") > 0 Тогда
				
				Поз = Найти(ИмяРегиона, " г");
				ИмяРегиона = Лев(АдресСтруктурой.Регион, Поз - 1);
				
			КонецЕсли;
			
			Если Найти(ИмяРегиона, "Респ") > 0 И Найти(ИмяРегиона, "Республика") = 0 Тогда
				
				Поз = Найти(ИмяРегиона, "Респ");
				ИмяРегиона = Лев(ИмяРегиона, Поз - 1) + "Республика" + Сред(ИмяРегиона, Поз + 4);
				
			КонецЕсли;
			
			Если Найти(ИмяРегиона, "обл") > 0 И Найти(ИмяРегиона, "область") = 0 Тогда
				
				Поз = Найти(ИмяРегиона, "обл");
				ИмяРегиона = Лев(ИмяРегиона, Поз - 1) + "область" + Сред(ИмяРегиона, Поз + 3);
				
			КонецЕсли;
			
			Если Найти(ИмяРегиона, "АО") > 0 Тогда
				
				Поз = Найти(ИмяРегиона, "АО");
				ИмяРегиона = Лев(ИмяРегиона, Поз - 1) + Сред(ИмяРегиона, Поз + 2);	
				
			КонецЕсли;
			
			СтрокаРегиона = СправочникРегионы.Найти(ИмяРегиона, "ИмяРегиона");
			
			Если СтрокаРегиона <> Неопределено Тогда
				АдресСтруктурой.КодРегиона = СтрокаРегиона.КодРегиона;
			ИначеЕсли Найти(ИмяРегиона, "Республика") Тогда
				
				Поз = Найти(ИмяРегиона, "Республика");
				ИмяРегиона = СокрП("Республика " + Лев(ИмяРегиона, Поз - 1) );
				СтрокаРегиона = СправочникРегионы.Найти(ИмяРегиона, "ИмяРегиона");
				
				Если СтрокаРегиона <> Неопределено Тогда
					АдресСтруктурой.КодРегиона = СтрокаРегиона.КодРегиона;
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ АдресСтруктурой.Свойство("Индекс") Тогда
		АдресСтруктурой.Вставить("Индекс", "");
	КонецЕсли;
	
	Если НЕ АдресСтруктурой.Свойство("Район") Тогда
		АдресСтруктурой.Вставить("Район", "");
	КонецЕсли;
	
	Если НЕ АдресСтруктурой.Свойство("Город") Тогда
		АдресСтруктурой.Вставить("Город", "");
	КонецЕсли;
	
	Возврат АдресСтруктурой;

КонецФункции

Функция ПолучитьТипДляКИКратко(Тип)
	
	Если Тип = Перечисления.ТипыДомов.Дом Тогда
		Возврат "д."  
	ИначеЕсли Тип = Перечисления.ТипыДомов.Домовладение Тогда
		Возврат "домовладение "
	ИначеЕсли Тип = Перечисления.ТипыДомов.Здание Тогда
		Возврат "зд. " 
	ИначеЕсли Тип = Перечисления.ТипыКорпусов.Корпус Тогда
		Возврат "к."
	ИначеЕсли Тип = Перечисления.ТипыКорпусов.Литера Тогда
		Возврат "лит."
	ИначеЕсли Тип = Перечисления.ТипыКорпусов.Сооружение Тогда
		Возврат "сооружение "   
	ИначеЕсли Тип = Перечисления.ТипыКорпусов.Строение Тогда
		Возврат "стр."      
	ИначеЕсли Тип = Перечисления.ТипыКорпусов.Участок Тогда
		Возврат "участок "
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Бокс Тогда
		Возврат "бокс "
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Квартира Тогда
		Возврат "кв."   
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Комната Тогда
		Возврат "ком." 
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Офис Тогда
		Возврат "офис "          
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Помещение Тогда
		Возврат "пом."      
	ИначеЕсли Тип = Перечисления.ТипыКвартир.Этаж Тогда
		Возврат "эт."
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получить структуру ФИО из справочника физлица
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ФизЛицо	 - СправочникСсылка	 - 
// 
// Возвращаемое значение:
// Структура  - Структура с полями Фамилия, Имя, Отчество
//
Функция КЗП_ПолучитьСтруктуруФИОФизЛица(ФизЛицо)
	
	СтруктураФИО = Новый Структура("Фамилия,Имя,Отчество");
	ТекКонф = КНП_ИмяКонфигурации();
	
	Если ТекКонф = "БП3" Тогда
		ЗаполнитьЗначенияСвойств(СтруктураФИО, ФизЛицо);
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" ИЛИ ТекКонф = "БГУ" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФИОФизическихЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизическихЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизическихЛицСрезПоследних.Отчество КАК Отчество
		|ИЗ
		|	РегистрСведений.ФИОФизическихЛиц.СрезПоследних КАК ФИОФизическихЛицСрезПоследних
		|ГДЕ
		|	ФИОФизическихЛицСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
		
		Запрос.УстановитьПараметр("ФизическоеЛицо", ФизЛицо);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураФИО, Выборка);
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
		|ГДЕ
		|	ФИОФизЛицСрезПоследних.ФизЛицо = &ФизЛицо";
		
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураФИО, Выборка);
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат СтруктураФИО;
	
КонецФункции

// Получить текст запроса для получения исходящих документов
// *Поддержка БП 3.0, УТ11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ОтборПоДате			 - Булево - 
//  ОтборОтправленные	 - Булево - 
//  ОтборКомментарий	 - Булево - 
// 
// Возвращаемое значение:
// Строка  - Текст запроса
//
Функция КЗП_ПолучитьТекстЗапросаИсходящиеДокументы(ОтборПоДате = Ложь, ОтборОтправленные = Ложь, ОтборКомментарий = Ложь)
	
	ТекКонф = КНП_ИмяКонфигурации();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Торг-12"" КАК СТРОКА(50) ) КАК Тип,
	|	Реализация.Номер,
	|	Реализация.Дата,
	|	ВЫБОР КОГДА Реализация.Грузополучатель.DS_Подразделение_ID > 0 ТОГДА Реализация.Грузополучатель ИНАЧЕ Реализация.Контрагент КОНЕЦ КАК Контрагент,
	|	Реализация.СуммаДокумента,
	|	Реализация.Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК СФ
	|ПОМЕСТИТЬ ВТДокументы
	|ИЗ
	|	Документ.{КЗП_РеализацияТоваровУслуг} КАК Реализация
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|	ПО (СчетФактураВыданныйДокументыОснования.ДокументОснование = Реализация.Ссылка
	|			И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	//+Белов А. 18.02.2026 #UT10-5696
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСтатусДоставки
	|	ПО Реализация.Ссылка = СвойствоСтатусДоставки.Объект
	|		И (СвойствоСтатусДоставки.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки))
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|	ПО Реализация.Ссылка = РеализацияТоваровУслугТовары.Ссылка
	//-Белов А. 18.02.2026 #UT10-5696
	|ГДЕ
	|	Реализация.Организация = &Организация
	|	И Реализация.Проведен = ИСТИНА
	|	И (ВЫБОР КОГДА Реализация.Грузополучатель.DS_Подразделение_ID > 0 ТОГДА Реализация.Грузополучатель В (&Контрагент) ИНАЧЕ Реализация.ДоговорКонтрагента В (&Договор) КОНЕЦ)
	|	И (Реализация.Дата >= Реализация.ДоговорКонтрагента.ДатаНачалаОбменаЭДО)
	//+Сёмин Р.И. 10.06.2026 #UT10-5917
	|	И НЕ Реализация.ДоговорКонтрагента.ЛицевойСчет
	|	И НЕ Реализация.ДоговорКонтрагента.РозничнаяПродажа
	//-Сёмин Р.И. 10.06.2026 #UT10-5917
	|	{ТоварыУслугиДата}
	|	{ТоварыУслугиКомментарий}
	|   {ОтборПоСтатусуДоставкиДляСамовывоза}
	|
	|СГРУППИРОВАТЬ ПО
	|	Реализация.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	{ТЕКСТ_ЗАПРОСА_АКТА}
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Счет на оплату"" КАК СТРОКА(50) ),
	|	СчетНаОплату.Номер,
	|	СчетНаОплату.Дата,
	|	СчетНаОплату.Контрагент,
	|	СчетНаОплату.СуммаДокумента,
	|	СчетНаОплату.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.{КЗП_СчетКлиенту} КАК СчетНаОплату
	|ГДЕ
	|	СчетНаОплату.Организация = &Организация
	|	И СчетНаОплату.Проведен = ИСТИНА
	|	И СчетНаОплату.Контрагент В (&Контрагент)
	|	И СчетНаОплату.{РеквизитВалюта} = &Валюта
	|	{СчетНаОплатуДата}
	|	{СчетНаОплатуКомментарий}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}
	|
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Акт сверки"" КАК СТРОКА(50) ),
	|	АктСверки.Номер,
	|	АктСверки.Дата,
	|	АктСверки.Контрагент,
	|	0,
	|	АктСверки.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.{КЗП_АктСверки} КАК АктСверки
	|ГДЕ
	|	АктСверки.Организация = &Организация
	|	И АктСверки.Проведен = ИСТИНА
	|	И АктСверки.Контрагент В (&Контрагент)
	|	{АктСверкиДата}
	|	{АктСверкиКомментарий}

//+Макрушин Е. 07.04.2026 #UT10-5800
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	{ТЕКСТ_ЗАПРОСА_АктОРасхожденияхПослеПриемки}
//-Макрушин Е. 07.04.2026 #UT10-5800  
	//+Белов А. 17.06.2026 #UT10-5921
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	{ТЕКСТ_ЗАПРОСА_ТранспортнаяНакладная}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	{ТЕКСТ_ЗАПРОСА_ЗаказЗаявка}
	//-Белов А. 17.06.2026 #UT10-5921
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДокументы.Тип,
	|	ВТДокументы.Номер,
	|	ВТДокументы.Дата,
	|	ВТДокументы.Контрагент,
	|	ВЫБОР
	|		КОГДА ДопРеквизиты.Значение ЕСТЬ NULL
	|			ТОГДА ""Не отправлен""
	|		ИНАЧЕ ""Документ отправлен""
	|	КОНЕЦ КАК Статус,
	|	ВТДокументы.СуммаДокумента,
	|	ВТДокументы.Ссылка,
	|	ДопРеквизиты.Значение КАК Идентификатор,
	|	ВТДокументы.СФ
	|ИЗ
	|	ВТДокументы КАК ВТДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.{КЗП_РегистрДопСведений} КАК ДопРеквизиты
	|		ПО ВТДокументы.Ссылка = ДопРеквизиты.Объект
	|		и ДопРеквизиты.Свойство = &Свойство
	|	{ОтправленныеОтбор}
	|	УПОРЯДОЧИТЬ ПО
	|	ВТДокументы.Дата УБЫВ";
	
	//+Белов А. 18.02.2026 #UT10-5696
	Если Константы.ЭДО_ВыгружатьКодыМаркировки.Получить() Тогда
		
		ТекстОтбораПоСтатусуДоставки = "
		|И ВЫБОР
		|	КОГДА РеализацияТоваровУслугТовары.ЗаказПокупателя.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)
		|		ТОГДА ЕСТЬNULL(СвойствоСтатусДоставки.Значение, Неопределено)  = Значение(Перечисление.СтатусыДоставки.ТоварПередан)
		|	ИНАЧЕ ИСТИНА
		|КОНЕЦ";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ОтборПоСтатусуДоставкиДляСамовывоза}", ТекстОтбораПоСтатусуДоставки);		
		
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ОтборПоСтатусуДоставкиДляСамовывоза}", "");
	КонецЕсли; 
	//-Белов А. 18.02.2026 #UT10-5696
	
	//Конфигурационно зависимые корректировки
	Если ТекКонф = "БП3" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}",	КЗП_ПолучитьТекстЗапросаКорректировка() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РеализацияТоваровУслуг}", 	"РеализацияТоваровУслуг");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетКлиенту}", 				"СчетНаОплатуПокупателю");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеквизитВалюта}",				"ВалютаДокумента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_КорректировкаРеализации}", 	"КорректировкаРеализации");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетФактураВыданный}", 		"СчетФактураВыданный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АКТА}",			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РегистрДопСведений}",		"ДополнительныеСведения");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_АктСверки}",					"АктСверкиВзаиморасчетов");
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП"  Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}",	КЗП_ПолучитьТекстЗапросаКорректировка() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РеализацияТоваровУслуг}", 	"РеализацияТоваровУслуг");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетКлиенту}", 				"СчетНаОплатуПокупателю");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеквизитВалюта}",				"ВалютаДокумента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_КорректировкаРеализации}", 	"КорректировкаРеализации");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетФактураВыданный}", 		"СчетФактураВыданный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АКТА}",			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РегистрДопСведений}",		"ЗначенияСвойствОбъектов");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_АктСверки}",					"АктСверкиВзаиморасчетов");

		//+Макрушин Е. 07.04.2026 #UT10-5800
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АктОРасхожденияхПослеПриемки}", КЗП_УТ10_ПолучитьТекстЗапросаАктОРасхожденияхПослеПриемки());
		//-Макрушин Е. 07.04.2026 #UT10-5800 
		
		//+Белов А. 17.06.2026 #UT10-5921
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_ТранспортнаяНакладная}", КЗП_УТ10_ПолучитьТекстЗапросаТранспортнаяНакладная());
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_ЗаказЗаявка}", КЗП_УТ10_ПолучитьТекстЗапросаЗаказЗаявка());
		//-Белов А. 17.06.2026 #UT10-5921
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}",	КЗП_ПолучитьТекстЗапросаКорректировка() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РеализацияТоваровУслуг}", 	"РеализацияТоваровУслуг");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетКлиенту}", 				"СчетНаОплатуКлиенту");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеквизитВалюта}",				"Валюта");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_КорректировкаРеализации}", 	"КорректировкаРеализации");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетФактураВыданный}", 		"СчетФактураВыданный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АКТА}",			КЗП_УТ11_ПолучитьТекстЗапросаАктаИСФАванс() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РегистрДопСведений}",		"ДополнительныеСведения");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "СчетФактура.СуммаДокумента",		"0");	//TODO Написать нормальный запрос для получения суммы счет-фактуры
		ТекстЗапроса = СтрЗаменить(Текстзапроса, "{СчетФактураКомментарий}",		"");	//У СФ в УТ нет комментария	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_АктСверки}",					"СверкаВзаиморасчетов");
		
	ИначеЕсли ТекКонф = "УНФ" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}",	КЗП_ПолучитьТекстЗапросаКорректировка() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РеализацияТоваровУслуг}", 	"РасходнаяНакладная");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетКлиенту}", 				"СчетНаОплату");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеквизитВалюта}",				"ВалютаДокумента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_КорректировкаРеализации}", 	"КорректировкаРеализации");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетФактураВыданный}", 		"СчетФактура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АКТА}",			КЗП_УНФ_ПолучитьТекстЗапросаАкта() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РегистрДопСведений}",		"ДополнительныеСведения");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_АктСверки}",					"СверкаВзаиморасчетов");
		
	ИначеЕсли ТекКонф = "БГУ" Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_КОРРЕКТИРОВКА}",	"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РеализацияТоваровУслуг}", 	"НакладнаяНаРеализациюТорг12");	
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетКлиенту}", 				"СчетНаОплату");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеквизитВалюта}",				"ВалютаДокумента");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_СчетФактураВыданный}", 		"СчетФактураВыданный");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТЕКСТ_ЗАПРОСА_АКТА}",			КЗП_БГУ_ПолучитьТекстЗапросаАкта() );
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_РегистрДопСведений}",		"ДополнительныеСведения");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КЗП_АктСверки}",					"АктСверкиВзаиморасчетов");
		
	КонецЕсли;
	
	//Применение фильтров
	Если ОтборПоДате Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТоварыУслугиДата}", 		"И Реализация.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетНаОплатуДата}", 		"И СчетНаОплату.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураДата}", 		"И СчетФактура.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КорректировкаДата}", 	"И Корректировка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктДата}",				"И Акт.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктСверкиДата}",			"И АктСверки.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураАвансДата}",	"И СчетФактураАванс.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеализацияУслугДата}",	"И РеализацияУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		
		//+Макрушин Е. 07.04.2026 #UT10-5800
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктОРасхожденияхПослеПриемкиДата}", "И АктОРасхожденияхПослеПриемки.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		//-Макрушин Е. 07.04.2026 #UT10-5800          
		
		//+Белов А. 17.06.2026 #UT10-5921
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТранспортнаяНакладнаяДата}", "И ТранспортнаяНакладная.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ЗаказЗаявкаДата}", "И ЗаказЗаявка.Дата МЕЖДУ &ДатаНачала И &ДатаКонца");
		//-Белов А. 17.06.2026 #UT10-5921
		
	Иначе
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТоварыУслугиДата}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетНаОплатуДата}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураДата}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КорректировкаДата}", 	"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктДата}",				"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктСверкиДата}",			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураАвансДата}",	"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеализацияУслугДата}",	"");
		
		//+Макрушин Е. 07.04.2026 #UT10-5800
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктОРасхожденияхПослеПриемкиДата}", "");
		//-Макрушин Е. 07.04.2026 #UT10-5800         
		
		//+Белов А. 17.06.2026 #UT10-5921
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТранспортнаяНакладнаяДата}", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ЗаказЗаявкаДата}", "");
		//-Белов А. 17.06.2026 #UT10-5921
		
	КонецЕсли;
	
	Если ОтборКомментарий Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТоварыУслугиКомментарий}", 		"И Реализация.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетНаОплатуКомментарий}", 		"И СчетНаОплату.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураКомментарий}", 		"И СчетФактура.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КорректировкаКомментарий}", 		"И Корректировка.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктКомментарий}",				"И Акт.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктСверкиКомментарий}",			"И АктСверки.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураАвансКомментарий}",	"И СчетФактураАванс.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеализацияУслугКомментарий}",	"И РеализацияУслуг.Комментарий ПОДОБНО &Комментарий");
		
		//+Макрушин Е. 07.04.2026 #UT10-5800
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктОРасхожденияхПослеПриемкиКомментарий}", "И АктОРасхожденияхПослеПриемки.Комментарий ПОДОБНО &Комментарий");
		//-Макрушин Е. 07.04.2026 #UT10-5800 
		
		//+Белов А. 17.06.2026 #UT10-5921
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТранспортнаяНакладнаяКомментарий}", "И ТранспортнаяНакладная.Комментарий ПОДОБНО &Комментарий");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ЗаказЗаявкаКомментарий}", "И ЗаказЗаявка.Комментарий ПОДОБНО &Комментарий");
		//-Белов А. 17.06.2026 #UT10-5921
		
	Иначе                                                                          
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТоварыУслугиКомментарий}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетНаОплатуКомментарий}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураКомментарий}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{КорректировкаКомментарий}", 		"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктКомментарий}",				"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктСверкиКомментарий}",			"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{СчетФактураАвансКомментарий}",	"");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{РеализацияУслугКомментарий}",	"");
		
		//+Макрушин Е. 07.04.2026 #UT10-5800
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{АктОРасхожденияхПослеПриемкиКомментарий}", "");
		//-Макрушин Е. 07.04.2026 #UT10-5800
		
		//+Белов А. 17.06.2026 #UT10-5921
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ТранспортнаяНакладнаяКомментарий}", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ЗаказЗаявкаКомментарий}", "");
		//-Белов А. 17.06.2026 #UT10-5921
		
	КонецЕсли;
	
	Если ОтборОтправленные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ОтправленныеОтбор}", "ГДЕ ДопРеквизиты.Значение ЕСТЬ NULL");	
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ОтправленныеОтбор}", "");
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

// Функция - Создать новую номенклатуру
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  Товар	 - СтрокаТабличнойЧасти	 - Строка ТЧ Товаров, полученных через функцию ПрочитатьТаблицуТоваров()
// 
// Возвращаемое значение:
// СправочникСсылка.Номенклатура  - Ссылка на новый объект номенклатуры
//
// Расчет суммы НДС в строке товаров
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  СтрокаТовара	 - СтрокаТаблицыЗначений - Строка табличной части, в которой должны присутствовать следующие колонки:
//  * Сумма
//  * СуммаНДС
//  * СтавкаНДС
//  СуммаВключаетНДС - Булево				 - Признак включения НДС в сумму
Процедура КЗП_РассчитатьСуммуНДССтрокиТЧ(СтрокаТовара, СуммаВключаетНДС)
	
	ТекКонф = КНП_ИмяКонфигурации();
	
	Если ТекКонф = "БП3" Тогда
		
		МодульОбработкаТабличныхЧастейКлиентСервер = КНП_ОбщийМодуль("ОбработкаТабличныхЧастейКлиентСервер");
		МодульОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(СтрокаТовара, СуммаВключаетНДС);
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		МодульЦенообразованиеКлиентСервер = КНП_ОбщийМодуль("ЦенообразованиеКлиентСервер");
		ТекПроцентНДС = МодульЦенообразованиеКлиентСервер.ПолучитьСтавкуНДСЧислом(СтрокаТовара.СтавкаНДС, Ложь);
		СтрокаТовара.СуммаНДС = МодульЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(СтрокаТовара.Сумма, ТекПроцентНДС, СуммаВключаетНДС);
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		МодульУчетНДС = КНП_ОбщийМодуль("УчетНДС");
		СтрокаТовара.СуммаНДС = МодульУчетНДС.РассчитатьСуммуНДС(СтрокаТовара.Сумма, СуммаВключаетНДС, СуммаВключаетНДС, МодульУчетНДС.ПолучитьСтавкуНДС(СтрокаТовара.СтавкаНДС) );
		
	ИначеЕсли ТекКонф = "УНФ" Тогда
		
		МодульУНФ = КНП_ОбщийМодуль("УправлениеНебольшойФирмойПовтИсп");
		СтавкаНДС = МодульУНФ.ПолучитьЗначениеСтавкиНДС(СтрокаТовара.СтавкаНДС);
		СтрокаТовара.СуммаНДС = ?(СуммаВключаетНДС, 
		СтрокаТовара.Сумма - (СтрокаТовара.Сумма) / ((СтавкаНДС + 100) / 100),
		СтрокаТовара.Сумма * СтавкаНДС / 100);							  
		СтрокаТовара.Всего = СтрокаТовара.Сумма + ?(СуммаВключаетНДС, 0, СтрокаТовара.СуммаНДС);
		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонф, "РассчитатьСуммаНДССтрокиТЧ");	
	КонецЕсли;

КонецПроцедуры

Функция КЗП_СоздатьНовуюНоменклатуру(Товар, ИмяНоменклатуры = Неопределено)
	//Changelog
	//
	//Указание наименования новой номенклатуры явно
	
	ТекКонф = КНП_ИмяКонфигурации();
	НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
	
	Если ЗначениеЗаполнено(ИмяНоменклатуры) Тогда
		НоваяНоменклатура.Наименование = ИмяНоменклатуры;
	Иначе
		НоваяНоменклатура.Наименование = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
	КонецЕсли;
	
	НоваяНоменклатура.НаименованиеПолное = НоваяНоменклатура.Наименование;
	
	Если ТипЗнч(Товар.ЕдиницаИзмерения) = Тип("Строка") Тогда
		
		ЕдиницаИзмеренияТовара = СправочникЕдиницыИзмерения.Найти(Товар.ЕдиницаИзмерения, "Название");
		
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
			ЕдиницаИзмеренияТовара = ЕдиницаИзмеренияТовара.Ссылка;
		КонецЕсли;
		
	Иначе
		ЕдиницаИзмеренияТовара = Товар.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если ТекКонф = "БП3" Тогда
		
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда	
			НоваяНоменклатура.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.ЕдиницаИзмерения) Тогда
			НоваяНоменклатура.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
		КонецЕсли;
		
		Если ЗагрузкаНоменклатурыКакУслуга Тогда
			НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги", Истина);		
		Иначе
			НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товары", Истина);	
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "БП" ИЛИ ТекКонф = "УТ" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
		
		Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
			НоваяНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.БазоваяЕдиницаИзмерения) Тогда
			НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
		КонецЕсли;
		
		Если ТекКонф = "УТ" Тогда
			
			НоваяНоменклатура.ЕдиницаДляОтчетов = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НоваяНоменклатура.БазоваяЕдиницаИзмерения.Наименование);
			НоваяНоменклатура.ЕдиницаХраненияОстатков = НоваяНоменклатура.ЕдиницаДляОтчетов;
			
			Если ЗагрузкаНоменклатурыКакУслуга Тогда
				
				НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги", Истина);
				
				Если НоваяНоменклатура.ВидНоменклатуры.Пустая() Тогда
					НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуг");	
				КонецЕсли;
				
			Иначе	
				
				НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товары", Истина);
				
				Если НоваяНоменклатура.ВидНоменклатуры.Пустая() Тогда
					НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");	
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
			
			Если ЗагрузкаНоменклатурыКакУслуга Тогда
				
				НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги", Истина);
				
				Если НоваяНоменклатура.ВидНоменклатуры.Пустая() Тогда
					НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуг");	
				КонецЕсли;
				
			Иначе			
				
				НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товары", Истина);
				
				Если НоваяНоменклатура.ВидНоменклатуры.Пустая() Тогда
					НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товар");	
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.БазоваяЕдиницаИзмерения) Тогда
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
			КонецЕсли;
			
			НоваяНоменклатура.ЕдиницаДляОтчетов = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(НоваяНоменклатура.БазоваяЕдиницаИзмерения.Наименование);
			НоваяНоменклатура.ЕдиницаХраненияОстатков = НоваяНоменклатура.ЕдиницаДляОтчетов;
			
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "ERP" Тогда
		
		Если ЗагрузкаНоменклатурыКакУслуга Тогда
			
			НоваяНоменклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
			НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуги", Истина);
			
			Если НоваяНоменклатура.ВидНоменклатуры.Пустая() Тогда
				НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Услуг");	
			КонецЕсли;
			
		Иначе	
			
			НоваяНоменклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
			НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Товары", Истина);
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(НоваяНоменклатура, "БазоваяЕдиницаИзмерения") Тогда
			
			Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.БазоваяЕдиницаИзмерения) Тогда
				НоваяНоменклатура.БазоваяЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("шт");
			КонецЕсли;
			
		ИначеЕсли КНП_ЕстьРеквизит(НоваяНоменклатура, "ЕдиницаИзмерения") Тогда
			
			Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.ЕдиницаИзмерения) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.НайтиПоНаименованию("шт");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТекКонф = "УНФ" Тогда
		
		НоваяНоменклатура.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.НайтиПоНаименованию("Товары");
		
		Если ЗагрузкаНоменклатурыКакУслуга Тогда
			НоваяНоменклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");
		Иначе
			НоваяНоменклатура.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас");
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(НоваяНоменклатура, "ЕдиницаИзмерения") Тогда
			
			Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НоваяНоменклатура.ЕдиницаИзмерения) Тогда
				НоваяНоменклатура.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяНоменклатура.Родитель = КаталогДляНоменклатурыПоставщика;
	НоваяНоменклатура.Записать();
	
	Возврат НоваяНоменклатура.Ссылка;

КонецФункции

Функция КЗП_Служебный_ПечатьАктаСверкиУТ103(СсылкаНаДокумент)
	
	//Экспорт процедуры печати из УТ 10.3
	ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетов_АктСверки";
	Макет  = ПолучитьМакет("ПФ_АктСверки");
	
	ОбластьЗаголовок    = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьНачОстатки   = Макет.ПолучитьОбласть("НачОстатки");
	ОбластьОбороты      = Макет.ПолучитьОбласть("Обороты");
	ОбластьОборотыИтог  = Макет.ПолучитьОбласть("ОборотыИтог");
	ОбластьКонОстатки   = Макет.ПолучитьОбласть("КонОстатки");
	ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
	
	НазваниеОрганизации = ДокОбъект.Организация.НаименованиеПолное;
	
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = ДокОбъект.Организация;
	КонецЕсли;
	
	НаименованиеКонтрагента = ДокОбъект.Контрагент.НаименованиеПолное;
	
	Если ПустаяСтрока(НаименованиеКонтрагента) Тогда
		НаименованиеКонтрагента = ДокОбъект.Контрагент;
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ОбластьЗаголовок.Параметры.НаименованиеКонтрагента = НаименованиеКонтрагента;
	ИмяПредставителяОрганизации = ДокОбъект.ПредставительОрганизации;
	ИмяПредсатвителяКонтрагента = ДокОбъект.ПредставительКонтрагента;
	
	Если ЗначениеЗаполнено(ДокОбъект.ПредставительОрганизации) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизацииСрезПоследних.Должность
		|ИЗ
		|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(
		|		&КонДата,
		|		СтруктурнаяЕдиница = &Организация
		|			И ФизическоеЛицо = &ФизическоеЛицо) КАК ОтветственныеЛицаОрганизацииСрезПоследних";
		
		Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
		Запрос.УстановитьПараметр("ФизическоеЛицо", ДокОбъект.ПредставительОрганизации);
		Запрос.УстановитьПараметр("КонДата", ДокОбъект.Дата);
		
		Рез = Запрос.Выполнить();
		
		Если Рез.Пустой() тогда
			ДолжностьПредставителяОрганизации = "";
		Иначе
			
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ДолжностьПредставителяОрганизации = СокрЛП(Выборка.Должность);
			
		КонецЕсли;
		
	Иначе
		ДолжностьПредставителяОрганизации = "";
	КонецЕсли;
	
	ДолжностьПредставителяКонтрагента = ?(НЕ ЗначениеЗаполнено(ДокОбъект.ПредставительКонтрагента), "", СокрЛП(ДокОбъект.ПредставительКонтрагента.Должность));
	
	Если НЕ ЗначениеЗаполнено(ДокОбъект.ДатаНачала) Тогда
		
		Если ДокОбъект.ПоДаннымОрганизации.Количество()>0 Тогда
			ДатаНачалаПериода = ДокОбъект.ПоДаннымОрганизации[0].Дата;
		Иначе
			ДатаНачалаПериода = ДокОбъект.ДатаНачала;
		КонецЕсли;
		
	Иначе
		ДатаНачалаПериода = ДокОбъект.ДатаНачала;
	КонецЕсли;		
	
	ТекстЗаголовка = "взаимных расчетов за период с " + Формат(ДатаНачалаПериода, "ДФ=dd.MM.yyyy") + " по " + Формат(ДокОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + Символы.ПС
	+ "между " + НазваниеОрганизации + Символы.ПС + "и " + НаименованиеКонтрагента;
	
	Если ЗначениеЗаполнено(ДокОбъект.ДоговорКонтрагента) Тогда
		ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + "по договору " + СокрЛП(ДокОбъект.ДоговорКонтрагента);
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	
	ФИОПредставителя = "" + ДокОбъект.ПредставительОрганизации;	
	СтрЗаголовокТаблица = "Мы, нижеподписавшиеся, "
	+ ?(ДолжностьПредставителяОрганизации <> "", ДолжностьПредставителяОрганизации,"_______________________") + " "
	+ НазваниеОрганизации 
	+ " " + ?(ФИОПредставителя <> "", ФИОПредставителя,"__________________________________________") + ", с одной стороны, "
	+ "и " + ?(ДолжностьПредставителяКонтрагента <> "", ДолжностьПредставителяКонтрагента,"___________________________") 
	+ " " + НаименованиеКонтрагента + " " 
	+ ?(НЕ ЗначениеЗаполнено(ДокОбъект.ПредставительКонтрагента), "_____________________________________________", ДокОбъект.ПредставительКонтрагента) + ", с другой стороны, "
	+ "составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:";
	
	ОбластьЗаголовок.Параметры.СтрЗаголовокТаблица = СтрЗаголовокТаблица;
	ОбластьЗаголовок.Параметры.ВалютаДокумента = ДокОбъект.ВалютаДокумента;
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ИтСуммаОборотДт      = 0;
	ИтСуммаОборотКт      = 0;
	ИтСуммаОборотДтКонтр = 0;
	ИтСуммаОборотКтКонтр = 0;
	
	НачОстДебет  = ?(ДокОбъект.ОстатокНаНачало > 0, ДокОбъект.ОстатокНаНачало, 0);
	НачОстКредит = ?(ДокОбъект.ОстатокНаНачало < 0, -ДокОбъект.ОстатокНаНачало, 0);
	
	ОстатокНаКонец = ДокОбъект.ОстатокНаНачало + ДокОбъект.ПоДаннымОрганизации.Итог("Дебет") - ДокОбъект.ПоДаннымОрганизации.Итог("Кредит");
	
	КонОстДебет  = ?(ОстатокНаКонец > 0, ОстатокНаКонец, 0);
	КонОстКредит = ?(ОстатокНаКонец < 0, -ОстатокНаКонец, 0);
	
	ОстатокНаКонецК = -ДокОбъект.ОстатокНаНачало + ДокОбъект.ПоДаннымКонтрагента.Итог("Дебет") - ДокОбъект.ПоДаннымКонтрагента.Итог("Кредит");
	
	КонОстДебетК  = ?(ОстатокНаКонецК > 0, ОстатокНаКонецК, 0);
	КонОстКредитК = ?(ОстатокНаКонецК < 0, -ОстатокНаКонецК, 0);
	
	ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокДт = НачОстДебет;
	ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокКт = НачОстКредит;
	ТабДок.Вывести(ОбластьНачОстатки);
	
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	МаксИндекс = Макс(ДокОбъект.ПоДаннымОрганизации.Количество(), ДокОбъект.ПоДаннымКонтрагента.Количество()) - 1;
	
	Для Инд = 0 По МаксИндекс Цикл
		
		Если Инд < ДокОбъект.ПоДаннымОрганизации.Количество() Тогда
			
			СтрокаОрганизации = ДокОбъект.ПоДаннымОрганизации[Инд];
			Регистратор = 	СтрокаОрганизации.Представление;
			СуммаОборотДт = СтрокаОрганизации.Дебет;
			СуммаОборотКт = СтрокаОрганизации.Кредит;
			
			ОбластьОбороты.Параметры.СуммаОборотДт = СуммаОборотДт;
			ОбластьОбороты.Параметры.СуммаОборотКт = СуммаОборотКт;
			
			ИтСуммаОборотДт = ИтСуммаОборотДт + СуммаОборотДт;
			ИтСуммаОборотКт = ИтСуммаОборотКт + СуммаОборотКт;
			
			ОбластьОбороты.Параметры.РегистраторПредставление = СтрокаОрганизации.Представление;
			ОбластьОбороты.Параметры.Регистратор = СтрокаОрганизации.ДокументРегистратор;
			ОбластьОбороты.Параметры.ДатаДокумента = Формат(СтрокаОрганизации.Дата, "ЧЦ=21; ЧДЦ=2; ДФ=dd.MM.yy");
			
		Иначе
			
			ОбластьОбороты.Параметры.СуммаОборотДт = "";
			ОбластьОбороты.Параметры.СуммаОборотКт = "";
			ОбластьОбороты.Параметры.РегистраторПредставление = "";
			ОбластьОбороты.Параметры.Регистратор = "";
			ОбластьОбороты.Параметры.ДатаДокумента = "";
			
		КонецЕсли;
		
		Если Инд < ДокОбъект.ПоДаннымКонтрагента.Количество() Тогда
			
			СтрокаОрганизации = ДокОбъект.ПоДаннымКонтрагента[Инд];
			
			Регистратор = 	СтрокаОрганизации.Представление;
			СуммаОборотДт = СтрокаОрганизации.Дебет;
			СуммаОборотКт = СтрокаОрганизации.Кредит;
			
			ОбластьОбороты.Параметры.СуммаОборотДтКонтр = СуммаОборотДт;
			ОбластьОбороты.Параметры.СуммаОборотКтКонтр = СуммаОборотКт;
			
			ИтСуммаОборотДтКонтр = ИтСуммаОборотДтКонтр + СуммаОборотДт;
			ИтСуммаОборотКтКонтр = ИтСуммаОборотКтКонтр + СуммаОборотКт;
			
			ОбластьОбороты.Параметры.РегистраторПредставлениеКонтр = СтрокаОрганизации.Представление;
			ОбластьОбороты.Параметры.ДатаДокументаКонтр = Формат(СтрокаОрганизации.Дата, "ЧЦ=21; ЧДЦ=2; ДФ=dd.MM.yy");
			
		Иначе
			
			ОбластьОбороты.Параметры.СуммаОборотДтКонтр = "";
			ОбластьОбороты.Параметры.СуммаОборотКтКонтр = "";
			ОбластьОбороты.Параметры.РегистраторПредставлениеКонтр = "";
			ОбластьОбороты.Параметры.ДатаДокументаКонтр = "";
			
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьОбороты);
		
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ОбластьОборотыИтог.Параметры.СуммаОборотДт      = ИтСуммаОборотДт;
	ОбластьОборотыИтог.Параметры.СуммаОборотКт      = ИтСуммаОборотКт;
	
	Если ДокОбъект.СверкаСогласована тогда
		
		ОбластьОборотыИтог.Параметры.СуммаОборотДтКонтр = ИтСуммаОборотДтКонтр;
		ОбластьОборотыИтог.Параметры.СуммаОборотКтКонтр = ИтСуммаОборотКтКонтр;
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьОборотыИтог);
	
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДт = КонОстДебет;
	ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКт = КонОстКредит;
	
	Если ДокОбъект.СверкаСогласована тогда
		
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДтКонтр = КонОстДебетК;
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКтКонтр = КонОстКредитК;
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьКонОстатки);
	
	// Результаты сверки
	
	Если ДокОбъект.ПоДаннымОрганизации.Количество() = 0 и ДокОбъект.ОстатокНаНачало = 0 Тогда
		РезультатыСверки = "<сверка не проведена>";
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокОбъект.ДатаОкончания) Тогда
		РезультатыСверки = "<не указана дата сверки>";
	ИначеЕсли НЕ ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда
		РезультатыСверки = "<не указан контрагент>";
	Иначе
		
		РезультатыСверки = "на " + Формат(ДокОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + " задолженность ";
		
		Если ОстатокНаКонец > 0 Тогда
			РезультатыСверки = РезультатыСверки + "в пользу " + СокрЛП(НазваниеОрганизации) + " " + Формат(ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " + строка(ДокОбъект.ВалютаДокумента);
			
		ИначеЕсли ОстатокНаКонец < 0 Тогда
			РезультатыСверки = РезультатыСверки + "в пользу " + СокрЛП(НаименованиеКонтрагента) + " " + Формат(-ОстатокНаКонец, "ЧЦ=21; ЧДЦ=2") + " " + строка(ДокОбъект.ВалютаДокумента);
			
		Иначе
			РезультатыСверки = РезультатыСверки + "отсутствует.";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбластьПодвал.Параметры.РезультатыСверки = РезультатыСверки;
	
	Если ДокОбъект.СверкаСогласована тогда
		
		ОбластьПодвал.Параметры.ПоДаннымКонтрагента = "По данным " + СокрЛП(НаименованиеКонтрагента);
		
		Если ДокОбъект.ПоДаннымКонтрагента.Количество() = 0 и ДокОбъект.ОстатокНаНачало = 0 Тогда
			РезультатыСверки = "<сверка не проведена>";
		ИначеЕсли НЕ ЗначениеЗаполнено(ДокОбъект.ДатаОкончания) Тогда
			РезультатыСверки = "<не указана дата сверки>";
		ИначеЕсли НЕ ЗначениеЗаполнено(ДокОбъект.Контрагент) Тогда
			РезультатыСверки = "<не указан контрагент>";
		Иначе
			
			РезультатыСверки = "на " + Формат(ДокОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + " задолженность ";
			
			Если ОстатокНаКонецК < 0 Тогда
				РезультатыСверки = РезультатыСверки + "в пользу " + СокрЛП(НазваниеОрганизации) + " " + Формат(-ОстатокНаКонецК, "ЧЦ=21; ЧДЦ=2") + " " + строка(ДокОбъект.ВалютаДокумента);
				
			ИначеЕсли ОстатокНаКонецК > 0 Тогда
				РезультатыСверки = РезультатыСверки + "в пользу " + СокрЛП(НаименованиеКонтрагента) + " " + Формат(ОстатокНаКонецК, "ЧЦ=21; ЧДЦ=2") + " " + строка(ДокОбъект.ВалютаДокумента);
				
			Иначе
				РезультатыСверки = РезультатыСверки + "отсутствует.";
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьПодвал.Параметры.РезультатыСверкиК = РезультатыСверки;
		
		Если ОстатокНаКонец+ОстатокНаКонецК <> 0 Тогда
			
			ИтогСверки = "В результате сверки выявлено расхождение информации о состоянии расчетов в размере " 
			   + Формат(?(ОстатокНаКонец + ОстатокНаКонецК > 0, 1, -1) * (ОстатокНаКонец + ОстатокНаКонецК), "ЧЦ=21; ЧДЦ=2") + " " + Строка(ДокОбъект.ВалютаДокумента);
			ОбластьПодвал.Параметры.ИтогСверки = Символы.ПС + ИтогСверки + Символы.ПС + " ";
			
		КонецЕсли; 
		
	КонецЕсли;
	
	ОбластьПодвал.Параметры.НазваниеОрганизации = СокрЛП(НазваниеОрганизации);
	ОбластьПодвал.Параметры.НаименованиеКонтрагента = СокрЛП(НаименованиеКонтрагента);
	
	ОбластьПодвал.Параметры.Должность = "________________";
	ОбластьПодвал.Параметры.ДолжностьК = "________________";
	
	ОбластьПодвал.Параметры.ФИОПредставителя  = "(" + ФИОПредставителя + ")";
	ОбластьПодвал.Параметры.ФИОПредставителяК = "(" + ?(НЕ ЗначениеЗаполнено(ДокОбъект.ПредставительКонтрагента), "_______________________", ДокОбъект.ПредставительКонтрагента) + ")";
	
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДок;
	
КонецФункции

// Получить структуру ИП
//  *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  Ссылка				 - СправочникСсылка.Организации, СправочникСсылка.Контрагенты	 - 
//  ТекущаяКонфигация	 - Строка	 - Имя конфигурации 
// 
// Возвращаемое значение:
//  Структура - Структура с полями Фамилия, Имя, Отчество, Должность
//
Функция КЗП_СформироватьСтруктуруИП(Ссылка, ТекКонф = Неопределено)
	
	//Changelog
	//
	//28.08.2019 - сделан обход ситуации, когда у контрагента ФИО хранится в полном наименовании
	
	Если НЕ ЗначениеЗаполнено(ТекКонф) Тогда
		ТекКонф = КНП_ИмяКонфигурации();
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Фамилия,Имя,Отчество,Должность");
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Организации") Тогда
		
		Если ТекКонф = "БП3" Тогда
			
			СтруктураВозврата.Фамилия = Ссылка.ФамилияИП;
			СтруктураВозврата.Имя = Ссылка.ИмяИП;
			СтруктураВозврата.Отчество = Ссылка.ОтчествоИП;
			
		ИначеЕсли ТекКонф = "УТ11" ИЛИ ТекКонф = "КА24" ИЛИ ТекКонф = "БП" ИЛИ ТекКонф = "КА" ИЛИ ТекКонф = "УПП" Тогда
			ЗаполнитьЗначенияСвойств(СтруктураВозврата, КЗП_ПолучитьСтруктуруФИОФизЛица(Ссылка.ИндивидуальныйПредприниматель) );
		ИначеЕсли ТекКонф = "УТ" Тогда
			
			МассивНаименования = КНП_РазобратьНаименованиеИПНаМассив(Ссылка.НаименованиеПолное);
			
			Если МассивНаименования.Количество() > 0 Тогда
				СтруктураВозврата.Фамилия = МассивНаименования[0];
			КонецЕсли;
			
			Если МассивНаименования.Количество() > 1 Тогда
				СтруктураВозврата.Имя = МассивНаименования[1];
			КонецЕсли;
			
			Если МассивНаименования.Количество() > 2 Тогда
				СтруктураВозврата.Отчество = МассивНаименования[2];
			КонецЕсли;	
			
		Иначе
			ДобавитьВЖурнал("Неподдерживаемая конфигурация", "СформироватьСтруктуруИП");	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда

		НаименованиеПолное = Ссылка.НаименованиеПолное;
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "ИП ", "");
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "Индивидуальный предприниматель ", "");
		
		МассивНаименования = КНП_РазобратьНаименованиеИПНаМассив(НаименованиеПолное);

		Если МассивНаименования.Количество() > 0 Тогда
			СтруктураВозврата.Фамилия = МассивНаименования[0];
		КонецЕсли;
		
		Если МассивНаименования.Количество() > 1 Тогда
			СтруктураВозврата.Имя = МассивНаименования[1];
		КонецЕсли;
		
		Если МассивНаименования.Количество() > 2 Тогда
			СтруктураВозврата.Отчество = МассивНаименования[2];
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураВозврата.Должность = "Индивидуальный предприниматель";
	Возврат СтруктураВозврата;

КонецФункции

Функция КЗП_ПолучитьТекстЗапросаКорректировка()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Корректировка реализации"" КАК СТРОКА(50) ),
	|	Корректировка.Номер,
	|	Корректировка.Дата,
	|	ВЫБОР
	|		КОГДА Корректировка.Грузополучатель.DS_Подразделение_ID > 0
	|			ТОГДА Корректировка.Грузополучатель
	|		ИНАЧЕ Корректировка.Контрагент
	|	КОНЕЦ,
	|	Корректировка.СуммаДокумента,
	|	Корректировка.Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО))
	|ИЗ
	|	Документ.{КЗП_КорректировкаРеализации} КАК Корректировка
	|ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|	ПО (СчетФактураВыданныйДокументыОснования.ДокументОснование = Корректировка.Ссылка
	|			И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	|ГДЕ
	|	Корректировка.Организация = &Организация
	|	И Корректировка.Проведен = ИСТИНА
	|	И ВЫБОР
	|		КОГДА Корректировка.Грузополучатель.DS_Подразделение_ID > 0
	|			ТОГДА Корректировка.Грузополучатель В (&Контрагент)
	|		ИНАЧЕ Корректировка.ДоговорКонтрагента В (&Договор)
	|	КОНЕЦ
	|	И (Корректировка.Дата >= Корректировка.ДоговорКонтрагента.ДатаНачалаОбменаЭДО)
	|	{КорректировкаДата}
	|	{КорректировкаКомментарий}
	|
	|СГРУППИРОВАТЬ ПО
	|Корректировка.Ссылка,
	|Корректировка.Номер,
	|Корректировка.Дата,
	|Корректировка.СуммаДокумента,
	|ВЫБОР
	|	КОГДА Корректировка.Грузополучатель.DS_Подразделение_ID > 0
	|		ТОГДА Корректировка.Грузополучатель
	|	ИНАЧЕ Корректировка.Контрагент
	|КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция КЗП_УНФ_ПолучитьТекстЗапросаАкта()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Акт сдачи-приема"" КАК СТРОКА(50)),
	|	Акт.Номер,
	|	Акт.Дата,
	|	Акт.Контрагент,
	|	Акт.СуммаДокумента,
	|	Акт.Ссылка
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Акт
	|ГДЕ
	|	Акт.Организация = &Организация
	|	И Акт.Контрагент В(&Контрагент)
	|	{АктДата}
	|	{АктКомментарий}
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция КЗП_БГУ_ПолучитьТекстЗапросаАкта()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Акт сдачи-приема"" КАК СТРОКА(50)),
	|	Акт.Номер,
	|	Акт.Дата,
	|	Акт.Контрагент,
	|	Акт.СуммаДокумента,
	|	Акт.Ссылка
	|ИЗ
	|	Документ.АктОбОказанииУслуг КАК Акт
	|ГДЕ
	|	Акт.Организация = &Организация
	|	И Акт.Контрагент В(&Контрагент)
	|	{АктДата}
	|	{АктКомментарий}
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат ТекстЗапроса;	

КонецФункции

Функция КЗП_УТ11_ПолучитьТекстЗапросаАктаИСФАванс()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Акт сдачи-приема"" КАК СТРОКА(50)),
	|	Акт.Номер,
	|	Акт.Дата,
	|	Акт.Контрагент,
	|	Акт.СуммаДокумента,
	|	Акт.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК Акт
	|ГДЕ
	|	Акт.Организация = &Организация
	|	И Акт.Проведен = ИСТИНА
	|	И Акт.Контрагент В(&Контрагент)
	|	{АктДата}
	|	{АктКомментарий}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Акт сдачи-приема"" КАК СТРОКА(50)),
	|	РеализацияУслуг.Номер,
	|	РеализацияУслуг.Дата,
	|	РеализацияУслуг.Контрагент,
	|	РеализацияУслуг.СуммаДокумента,
	|	РеализацияУслуг.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов КАК РеализацияУслуг
	|ГДЕ
	|	РеализацияУслуг.Организация = &Организация
	|	И РеализацияУслуг.Проведен = ИСТИНА
	|	И РеализацияУслуг.Контрагент В(&Контрагент)
	|	{РеализацияУслугДата}
	|	{РеализацияУслугКомментарий}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Счет-фактура"" КАК СТРОКА(50)),
	|	СчетФактураАванс.Номер,
	|	СчетФактураАванс.Дата,
	|	СчетФактураАванс.Контрагент,
	|	СчетФактураАванс.Сумма,
	|	СчетФактураАванс.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.СчетФактураВыданныйАванс КАК СчетФактураАванс
	|ГДЕ
	|	СчетФактураАванс.Организация = &Организация
	|	И СчетФактураАванс.Проведен = ИСТИНА
	|	И СчетФактураАванс.Контрагент В(&Контрагент)
	|	{СчетФактураАвансДата}
	|	{СчетФактураАвансКомментарий}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция КЗП_УТ10_ПолучитьТекстЗапросаАктОРасхожденияхПослеПриемки()
	
	//+Макрушин Е. 07.04.2026 #UT10-5800
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Торг-2"" КАК СТРОКА(50)),
	|	АктОРасхожденияхПослеПриемки.Номер,
	|	АктОРасхожденияхПослеПриемки.Дата,
	|	АктОРасхожденияхПослеПриемки.Контрагент,
	|	0,
	|	АктОРасхожденияхПослеПриемки.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Организация = &Организация
	|	И АктОРасхожденияхПослеПриемки.Проведен = ИСТИНА
	|	И АктОРасхожденияхПослеПриемки.Контрагент В(&Контрагент)
	|	{АктОРасхожденияхПослеПриемкиДата}
	|	{АктОРасхожденияхПослеПриемкиКомментарий}
	|
	|";
	
	Возврат ТекстЗапроса;
	//-Макрушин Е. 07.04.2026 #UT10-5800
	
КонецФункции 

Функция КЗП_УТ10_ПолучитьТекстЗапросаТранспортнаяНакладная()
	
	//+Белов А. 17.06.2026 #UT10-5921	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Транспортная накладная"" КАК СТРОКА(50)),
	|	ТранспортнаяНакладная.Номер,
	|	ТранспортнаяНакладная.Дата,
	|	ТранспортнаяНакладная.Грузополучатель КАК Контрагент,
	|	0,
	|	ТранспортнаяНакладная.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.ТранспортнаяНакладная КАК ТранспортнаяНакладная
	|ГДЕ
	|	ТранспортнаяНакладная.Организация = &Организация
	|	И ТранспортнаяНакладная.Проведен = ИСТИНА
	|	И (ВЫБОР КОГДА ТранспортнаяНакладная.Грузополучатель.DS_Подразделение_ID > 0 ТОГДА ТранспортнаяНакладная.Грузополучатель В (&Контрагент) ИНАЧЕ ТранспортнаяНакладная.ДоговорГрузополучателя В (&Договор) КОНЕЦ)
	|	{ТранспортнаяНакладнаяДата}
	|	{ТранспортнаяНакладнаяКомментарий}
	|
	|";
	
	Возврат ТекстЗапроса;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции

Функция КЗП_УТ10_ПолучитьТекстЗапросаЗаказЗаявка()
	
	//+Белов А. 17.06.2026 #UT10-5921	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(""Заказ-заявка"" КАК СТРОКА(50)),
	|	ЗаказЗаявка.Номер,
	|	ЗаказЗаявка.Дата,
	|	ЗаказЗаявка.Контрагент,
	|	0,
	|	ЗаказЗаявка.Ссылка,
	|	Неопределено
	|ИЗ
	|	Документ.ЗаказЗаявка КАК ЗаказЗаявка
	|ГДЕ
	|	ЗаказЗаявка.Проведен = ИСТИНА
	|	И НЕ ЗаказЗаявка.ЗагруженИзСтороннейБазы
	|	И ЗаказЗаявка.ДоговорКонтрагента В (&Договор)
	|	{ЗаказЗаявкаДата}
	|	{ЗаказЗаявкаКомментарий}
	|
	|";
	
	Возврат ТекстЗапроса;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции


// У документа есть СФ
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	 - 
// 
// Возвращаемое значение:
// Булево  - 
//
Функция КЗП_УДокументаЕстьСФ(ДокументСсылка)
	
	Результат = Ложь;
	ТекКонф = КНП_ИмяКонфигурации();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	ИЛИ СчетФактураВыданныйДокументыОснования.Ссылка.ДокументОснование = &ДокументОснование";
	
	Если ТекКонф = "УНФ" Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ СчетФактураВыданныйДокументыОснования.Ссылка.ДокументОснование = &ДокументОснование", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "СчетФактураВыданный", "СчетФактура");	 
		
	КонецЕсли;
	
	Если ТекКонф = "БГУ" Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1 
		|	СчетФактураВыданный.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
	КонецЕсли;
	
	Результат = НЕ Запрос.Выполнить().Пустой();
	
	Возврат Результат;

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//			#КонецОбласти КонфигурационноЗависимыеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#Область МетаданноОриентированныеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область МетаданноОриентированныеПроцедуры

// Получить текст запроса объекта по доп.сведениям
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Возвращаемое значение:
// Строка  - Текст запроса
//
Функция МОП_ПолучитьТекстЗапросаОбъектПоДопСведениям()
	
	ТекстЗапроса = "";
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Ссылка
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство
		|	И ДополнительныеСведения.Значение = &Значение";		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Ссылка
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство
		|	И ЗначенияСвойствОбъектов.Значение = &Значение";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТекстЗапроса;

КонецФункции

// Получить текст запроса доп.сведений объекта
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Возвращаемое значение:
// Строка  - Текст запроса 
//
Функция МОП_ПолучитьТекстЗапросаДопСведенияОбъекта()
	
	ТекстЗапроса = "";
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДополнительныеСведения.Свойство КАК Свойство,
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект";		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Свойство,
		|	ЗначенияСвойствОбъектов.Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Объект = &Объект";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТекстЗапроса;	

КонецФункции

// Получить текст запроса список объектов со свойством
// 
// Возвращаемое значение:
// Строка  - Текст запроса
//
Функция МОП_ПолучитьТекстЗапросаСписокОбъектовСоСвойством()
	
	ТекстЗапроса = "";
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ДополнительныеСведения.Объект КАК Объект,
		|	ДополнительныеСведения.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Свойство = &Свойство";		
	Иначе
		ТекстЗапроса = "ВЫБРАТЬ
		|	ЗначенияСвойствОбъектов.Объект КАК Объект,
		|	ЗначенияСвойствОбъектов.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|ГДЕ
		|	ЗначенияСвойствОбъектов.Свойство = &Свойство";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТекстЗапроса;		

КонецФункции

// Получить структуру ответственного лица физического лица (метаданно-ориентированный)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Возвращаемое значение:
// Структура  - Структура с полями Фамилия, Имя, Отчество, Должность 
//
Функция МОП_СформироватьСтруктуруОтветственныеЛицаОрганизации(ФизЛицо = Неопределено)
	
	СтруктураОтвета = Новый Структура("Фамилия,Имя,Отчество,Должность,ОснованиеПолномочий", " ", " ", " ", "");
	МодульПользователей = КНП_ОбщийМодуль("ПользователиКлиентСервер");
	Пользователь = Неопределено;
	
	Если МодульПользователей <> Неопределено И ФизЛицо = Неопределено Тогда
		
		Пользователь = МодульПользователей.ТекущийПользователь();
		
		Если КНП_ЕстьРеквизит(Пользователь, "ФизическоеЛицо") Тогда
			ФизЛицо = Пользователь.ФизическоеЛицо;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(Пользователь, "ФизЛицо") Тогда
			ФизЛицо = Пользователь.ФизЛицо;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		
		ДолжностьЗначение = КЗП_ПолучитьДолжностьФизЛица(ФизЛицо);
		
		Если ЗначениеЗаполнено(ДолжностьЗначение) Тогда
			ДолжностьСтрока = Строка(ДолжностьЗначение);
		Иначе
			ДолжностьСтрока = "Ответственный за ЭДО";
		КонецЕсли;
		
		СтруктураФИО = КЗП_ПолучитьСтруктуруФИОФизЛица(ФизЛицо);
		СтруктураОтвета.Фамилия = СтруктураФИО.Фамилия;
		СтруктураОтвета.Имя = СтруктураФИО.Имя;
		СтруктураОтвета.Отчество = СтруктураФИО.Отчество;
		СтруктураОтвета.Должность = ДолжностьСтрока;
		СтруктураОтвета.ОснованиеПолномочий = "";
		
	ИначеЕсли Пользователь <> Неопределено Тогда
		
		СтруктураФИО = КНП_РазобратьНаименованиеИПНаМассив(Пользователь.Наименование);
		ДолжностьСтрока = "Ответственный за ЭДО";
		
		Если СтруктураФИО.Количество() > 0 Тогда
			СтруктураОтвета.Фамилия = СтруктураФИО[0];
		КонецЕсли;
		
		Если СтруктураФИО.Количество() > 1 Тогда
			СтруктураОтвета.Имя = СтруктураФИО[1];
		КонецЕсли;
		
		Если СтруктураФИО.Количество() > 2 Тогда
			СтруктураОтвета.Отчество = СтруктураФИО[2];
		КонецЕсли;
		
		СтруктураОтвета.Должность = ДолжностьСтрока;
		СтруктураОтвета.ОснованиеПолномочий = "";
		
	КонецЕсли;
	
	Возврат СтруктураОтвета;

КонецФункции

// Документ включает НДС в сумму (метаданно-ориентированный метод)
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка	 - 
// 
// Возвращаемое значение:
// Булево  - 
//
Функция МОП_ДокументВключаетНДСВСумму(СсылкаНаДокумент, ВозвращатьНеопределено = Ложь)
	
	Если ВозвращатьНеопределено Тогда
		СуммаВключаетНДС = Неопределено;
	Иначе
		СуммаВключаетНДС = Ложь;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "СуммаВключаетНДС") Тогда
		СуммаВключаетНДС = СсылкаНаДокумент.СуммаВключаетНДС;
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаДокумент, "ЦенаВключаетНДС") Тогда
		СуммаВключаетНДС = СсылкаНаДокумент.ЦенаВключаетНДС;
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаДокумент, "СтавкаНДС") Тогда
		Возврат МОП_НДСВСуммеПоСтавке(СсылкаНаДокумент.СтавкаНДС);
	КонецЕсли;
	
	Возврат СуммаВключаетНДС;

КонецФункции

// Универсальная процедура заполнения поля "Организация" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектJSON)
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Организация") Тогда
		ДокОбъект.Организация = Организация;
	КонецЕсли;	

КонецПроцедуры

// Универсальная процедура заполнения поля "Контрагент" и "Партнер" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектJSON)
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Контрагент") Тогда
		
		ДокОбъект.Контрагент = Подразделение;
		
		Если КНП_ЕстьРеквизит(ДокОбъект, "Партнер") И КНП_ЕстьРеквизит(ДокОбъект.Контрагент, "Партнер") Тогда
			ДокОбъект.Партнер = ДокОбъект.Контрагент.Партнер;
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры

// Универсальная процедура заполнения поля "ДоговорКонтрагента" и "Договор" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектJSON)
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДоговорКонтрагента") Тогда
		ДокОбъект.ДоговорКонтрагента = КЗП_ПолучитьДоговорКонтрагентаСОрганизацией(ДокОбъект.Контрагент, ДокОбъект.Организация);
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Договор") Тогда
		ДокОбъект.Договор = КЗП_ПолучитьДоговорКонтрагентаСОрганизацией(ДокОбъект.Контрагент, ДокОбъект.Организация);
	КонецЕсли;	

КонецПроцедуры

// Универсальная процедура заполнения поля "ВалютаДокумента", "Валюта" и "ВалютаВзаиморасчетов" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие, Структура	 - JSON-объект если Соответствие, XML-объект если Структура
//
Процедура МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных)
	
	Валюта = Неопределено;
	
	Попытка
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			Валюта = СправочникВалюты.Найти(ОбъектДанных.Получить("currency").Получить("code"), "КодISO").Ссылка;
		Иначе
			
			КодВалюты = Прав(ОбъектДанных.Валюта, 3);
			
			Если КНП_ЭтоЧисло(КодВалюты) Тогда
				Валюта = СправочникВалюты.Найти(КодВалюты, "КодISO").Ссылка;
			Иначе
				Валюта = СправочникВалюты.Найти("643", "КодISO").Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		Валюта = СправочникВалюты.Найти("643", "КодISO").Ссылка;	
	КонецПопытки;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВалютаДокумента") Тогда
		ДокОбъект.ВалютаДокумента = Валюта;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Валюта") Тогда
		ДокОбъект.Валюта = Валюта;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВалютаВзаиморасчетов") Тогда
		ДокОбъект.ВалютаВзаиморасчетов = Валюта;
	КонецЕсли;	

КонецПроцедуры

// Универсальная процедура заполнения полей основания и вида операции в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект
//  ЭтоИсправление - Булево - пока не используется
//
Процедура МОП_ЗаполнитьДокументыОснования(ДокОбъект, ОбъектДанных, ЭтоИсправление)
	
	Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
		
		ДокПоступления = КЗП_НайтиОснованиеСчетФактурыПоставщика(ОбъектДанных.Получить("number"), 
		КНП_ПривестиКДате(ОбъектДанных.Получить("date") ),
		ДокОбъект.Контрагент);
		
	Иначе
		
		ДокПоступления = КЗП_НайтиОснованиеСчетФактурыПоставщика(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "НомерОснования"),
		КНП_ПривестиКДате(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "ДатаОснования") ),
		ДокОбъект.Контрагент)
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДокументПоступления") Тогда
		ДокОбъект.ДокументПоступления = ДокПоступления;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДокументОснование") Тогда
		ДокОбъект.ДокументОснование = ДокПоступления;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВидОперации") Тогда
		
		Если ЭтоИсправление Тогда
			ДокОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки");
		Иначе
			ДокОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Универсальная процедура заполнения поля "ВидОперации" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьВидОперации(ДокОбъект, ОбъектJSON)
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВидОперации") Тогда
		
		Если Метаданные.Перечисления.Найти("ВидыОперацийПоступлениеТоваровУслуг") <> Неопределено Тогда
			
			Если КНП_ЕстьТабЧасть(ДокОбъект, "Услуги") И ДокОбъект.Услуги.Количество() > 0 Тогда
				ДокОбъект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.Услуги");
			Иначе
				ДокОбъект.ВидОперации	= ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ПокупкаКомиссия");	
			КонецЕсли;
			
		ИначеЕсли Метаданные.Перечисления.Найти("ВидыОперацийПриходнаяНакладная") <> Неопределено Тогда
			ДокОбъект.ВидОперации	= ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика");
		КонецЕсли;
		
	КонецЕсли;	

КонецПроцедуры  

// Универсальная процедура заполнения основных полей в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму
//
Процедура МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, СуммаВключаетНДС, ВидДокумента)
	//Changelog
	//
	//10.06.2019 - скорректировано заполнение реквизитов входящего документа
	//11.06.2019 - добавлено заполнение суммы документа
	//17.01.2020 - добавлено заполнение автора документа
	
	ДокОбъект.Дата 									= ТекущаяДата();
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "НомерВходящегоДокумента") Тогда
		ДокОбъект.НомерВходящегоДокумента			= КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Номер");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "НомерПервичногоДокумента") Тогда			
		ДокОбъект.НомерПервичногоДокумента			= КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Номер");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "НомерПоДаннымПоставщика") Тогда			
		ДокОбъект.НомерПоДаннымПоставщика			= КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Номер");
	КонецЕсли;
	
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДатаВходящегоДокумента") Тогда
		ДокОбъект.ДатаВходящегоДокумента			= КНП_ПривестиКДате(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Дата") );	
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДатаПервичногоДокумента") Тогда
		ДокОбъект.ДатаПервичногоДокумента			= КНП_ПривестиКДате(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Дата") );	
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ДатаПоДаннымПоставщика") Тогда
		ДокОбъект.ДатаПоДаннымПоставщика			= КНП_ПривестиКДате(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Дата") );	
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Комментарий") Тогда
		ДокОбъект.Комментарий						= "Документ загружен из системы DiState";
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Ответственный") Тогда
		
		Попытка
			
			МодульПользователиКлиентСервер = КНП_ОбщийМодуль("ПользователиКлиентСервер");
			ДокОбъект.Ответственный 				= МодульПользователиКлиентСервер.ТекущийПользователь();
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Автор") Тогда
		
		Попытка
			
			МодульПользователиКлиентСервер = КНП_ОбщийМодуль("ПользователиКлиентСервер");
			ДокОбъект.Автор 				= МодульПользователиКлиентСервер.ТекущийПользователь();
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;	
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СуммаДокумента") Тогда
		
		ДокОбъект.СуммаДокумента = 0;
		
		Если КНП_ЕстьТабЧасть(ДокОбъект, "Товары") Тогда
			ДокОбъект.СуммаДокумента = ДокОбъект.СуммаДокумента + ДокОбъект.Товары.Итог("Сумма");
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ДокОбъект, "Услуги") Тогда
			ДокОбъект.СуммаДокумента = ДокОбъект.СуммаДокумента + ДокОбъект.Услуги.Итог("Сумма");
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ДокОбъект, "Расходы") Тогда
			ДокОбъект.СуммаДокумента = ДокОбъект.СуммаДокумента + ДокОбъект.Расходы.Итог("Сумма");
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "НалогообложениеНДС") Тогда
		
		Если Метаданные.Перечисления.Найти("ТипыНалогообложенияНДС") <> Неопределено Тогда
			
			Если ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС") <> Неопределено Тогда
				ДокОбъект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДС");
			ИначеЕсли ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС") <> Неопределено Тогда
				ДокОбъект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Склад") Тогда
		ДокОбъект.Склад = СкладПоУмолчанию;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СтруктурнаяЕдиница") И НЕ КНП_ЕстьРеквизит(ДокОбъект, "Склад") Тогда
		ДокОбъект.СтруктурнаяЕдиница = СкладПоУмолчанию;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ЦенаВключаетНДС") Тогда
		ДокОбъект.ЦенаВключаетНДС = СуммаВключаетНДС;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СуммаВключаетНДС") Тогда
		ДокОбъект.СуммаВключаетНДС = СуммаВключаетНДС;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Курс") Тогда
		ДокОбъект.Курс = 1;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Кратность") Тогда
		ДокОбъект.Кратность = 1;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ПредъявленСчетФактура") Тогда
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			
			Если ОбъектДанных.Получить("purpose") <> Неопределено Тогда
				
				Если Найти(ОбъектДанных.Получить("purpose"), "СЧФ") Тогда
					
					ДокОбъект.ПредъявленСчетФактура = Истина;
					ДокОбъект.НомерВходящегоСчетаФактуры = ОбъектДанных.Получить("number");
					ДокОбъект.ДатаВходящегоСчетаФактуры = КНП_ПривестиКДате(ОбъектДанных.Получить("date") );
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если ОбъектДанных.Свойство("ТипУПД") Тогда
				
				Если Найти(ОбъектДанных.ТипУПД, "СЧФ") Тогда
					
					ДокОбъект.ПредъявленСчетФактура = Истина;
					ДокОбъект.НомерВходящегоСчетаФактуры = КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Номер");
					ДокОбъект.ДатаВходящегоСчетаФактуры = КНП_ПривестиКДате(КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "Дата"));	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "КодВидаОперации") Тогда
		ДокОбъект.КодВидаОперации = "01";
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СуммаДокумента") И ДокОбъект.СуммаДокумента = 0 И ОбъектДанных.Свойство("СуммаИтого") Тогда
		ДокОбъект.СуммаДокумента = ОбъектДанных.СуммаИтого;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВидПервичногоДокумента") Тогда
		ДокОбъект.ВидПервичногоДокумента = ВидДокумента;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СпособЗачетаАванса") И КНП_ЕстьОбъектМетаданных("СпособыЗачетаАвансов") Тогда
		ДокОбъект.СпособЗачетаАванса = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ПричинаНалогообложения") И КНП_ЕстьОбъектМетаданных("ПричиныНалогообложенияНДС")  Тогда
		ДокОбъект.ПричинаНалогообложения = ПредопределенноеЗначение("Перечисление.ПричиныНалогообложенияНДС.Покупка");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ХозяйственнаяОперация") Тогда
		ДокОбъект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СпособДоставки") Тогда
		ДокОбъект.СпособДоставки = ПредопределенноеЗначение("Перечисление.СпособыДоставки.СиламиПоставщикаДоНашегоСклада");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВариантПриемкиТоваров") Тогда
		ДокОбъект.ВариантПриемкиТоваров = ПредопределенноеЗначение("Перечисление.ВариантыПриемкиТоваров.ПоДоговорамПослеЗаказовИлиНакладных");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ПорядокОплаты") Тогда
		ДокОбъект.ПорядокОплаты = ПредопределенноеЗначение("Перечисление.ПорядокОплатыПоСоглашениям.РасчетыВРубляхОплатаВРублях");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ЗакупкаПодДеятельность") Тогда
		ДокОбъект.ЗакупкаПодДеятельность = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Статус") И ВидДокумента = "Счет на оплату" Тогда
		ДокОбъект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЗаказовПоставщикам.Подтвержден");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "Приоритет") И КНП_ЕстьОбъектМетаданных("Приоритеты") Тогда
		ДокОбъект.Приоритет = Справочники.Приоритеты.НайтиПоНаименованию("Средний");	
	КонецЕсли;
	
	ДокОбъект.УстановитьНовыйНомер();	

КонецПроцедуры

// Универсальная процедура заполнения поля "СпособЗачетаАвансов" в документе
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьСпособЗачетаАвансов(ДокОбъект, ОбъектJSON)
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "СпособЗачетаАвансов") Тогда
		ДокОбъект.СпособЗачетаАвансов 	= ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.Автоматически");
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ПорядокРасчетов") Тогда
		ДокОбъект.ПорядокРасчетов 		= ПредопределенноеЗначение("Перечисление.ПорядокРасчетов.ПоНакладным");
	КонецЕсли;

КонецПроцедуры

// Универсальная процедура заполнения банковских счетов
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка	 - 
//  ОбъектJSON	 - Соответствие	 - JSON-объект 
//
Процедура МОП_ЗаполнитьБанковскиеСчета(ДокОбъект, ОбъектДанных)
	
	СтруктураПродавца = Неопределено;
	
	Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
		
		Если ОбъектДанных.Получить("seller") <> Неопределено Тогда
			СтруктураПродавца = ОбъектДанных.Получить("seller");
		ИначеЕсли ОбъектДанных.Получить("provider") <> Неопределено Тогда
			СтруктураПродавца = ОбъектДанных.Получить("provider");
		КонецЕсли;
		
	Иначе
		
		СтруктураПродавца = Новый Соответствие;
		СтруктураПродавца.Вставить("accountNumber", "");
		
		Если ОбъектДанных.Свойство("СчетПолучателя") Тогда
			СтруктураПродавца.Вставить("accountNumber", ОбъектДанных.СчетПолучателя);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "БанковскийСчетКонтрагента") Тогда
		
		Если КНП_ЕстьОбъектМетаданных("БанковскиеСчета") Тогда
			
			Если СтруктураПродавца <> Неопределено Тогда
				ДокОбъект.БанковскийСчетКонтрагента 	= Справочники.БанковскиеСчета.НайтиПоРеквизиту("НомерСчета", СтруктураПродавца.Получить("accountNumber") );
			КонецЕсли;
			
			Если ДокОбъект.БанковскийСчетКонтрагента.Пустая() Тогда
				ДокОбъект.БанковскийСчетКонтрагента 	= МОП_ПолучитьБанковскийСчетКонтрагента(ДокОбъект.Контрагент);	
			КонецЕсли;
			
		ИначеЕсли КНП_ЕстьОбъектМетаданных("БанковскиеСчетаКонтрагентов") Тогда
			
			Если СтруктураПродавца <> Неопределено Тогда
				ДокОбъект.БанковскийСчетКонтрагента 	= Справочники.БанковскиеСчетаКонтрагентов.НайтиПоРеквизиту("НомерСчета",  СтруктураПродавца.Получить("accountNumber") );
			КонецЕсли;
			
			Если ДокОбъект.БанковскийСчетКонтрагента.Пустая() Тогда
				ДокОбъект.БанковскийСчетКонтрагента 	= МОП_ПолучитьБанковскийСчетКонтрагента(ДокОбъект.Контрагент);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
//		Методы чтения данных
Функция МОП_ПолучитьМенеджераДопСведений()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		МенеджерДопСведений = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения;	
	Иначе
		МенеджерДопСведений = ПланыВидовХарактеристик.СвойстваОбъектов;
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат МенеджерДопСведений;

КонецФункции

// Получение набора записей доп.сведений для дальнейшей манипуляции
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Возвращаемое значение:
// РегистрыСведенийНаборЗаписей  - набор записей
//
Функция МОП_ПолучитьНовыйНаборЗаписейДопСведений()
	
	НаборЗаписейЗначенияСвойств = Неопределено; 
	УстановитьПривилегированныйРежим(Истина);
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		Выполнить("НаборЗаписейЗначенияСвойств = РегистрыСведений.ДополнительныеСведения.СоздатьНаборЗаписей();	");
	Иначе
		Выполнить("НаборЗаписейЗначенияСвойств = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей(); ");	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат НаборЗаписейЗначенияСвойств;

КонецФункции

// Функция - Получить реквизит
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ИмяРеквизита - Строка	 - Название доп.реквизита DiState. Варианты:
//	*DS_Контрагент_ID
//	*DS_Подразделение_ID
//	*DS_Документ_ID
//	*DS_ДатаВремяОтправки
//  *DS_ПинКод
// 
// Возвращаемое значение:
// ПланыВидовХарактеристикСсылка  - Ссылка на свойство доп.реквизита
//
Функция МОП_ПолучитьРеквизит(ИмяРеквизита)
	
	УстановитьПривилегированныйРежим(Истина);
	ВозвращаемоеЗначение = Неопределено;
	
	Если Метаданные.ПланыВидовХарактеристик.Найти("ДополнительныеРеквизитыИСведения") <> Неопределено Тогда
		ВозвращаемоеЗначение = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяРеквизита);	
	Иначе
		ВозвращаемоеЗначение = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию(ИмяРеквизита);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ВозвращаемоеЗначение;

КонецФункции

Функция МОП_ПолучитьСсылкуНаКорректировку(ДокументСсылка)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		
		Если КНП_ЕстьРеквизит(ДокументСсылка, "ДокументРеализации") И ЗначениеЗаполнено(ДокументСсылка.ДокументРеализации) Тогда
			Возврат ДокументСсылка.ДокументРеализации;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ДокументСсылка, "ДокументОснование") И ЗначениеЗаполнено(ДокументСсылка.ДокументОснование) Тогда
			Возврат ДокументСсылка.ДокументОснование;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

// Получить валюту документа (метаданно-ориентированный метод)
//
// Параметры:
//  ДокОбъект	 - ДокументСсылка, ДокументОбъект	 - Ссылка или сам объект документа
// 
// Возвращаемое значение:
// СправочникСсылка, Неопределено  - Валюта документа 
//
Функция МОП_ПолучитьВалютуДокумента(ДокОбъект)
	
	Валюта = Неопределено;
	
	Если КНП_ЕстьРеквизит(ДокОбъект, "ВалютаДокумента") Тогда
		Валюта = ДокОбъект.ВалютаДокумента;
	ИначеЕсли КНП_ЕстьРеквизит(ДокОбъект, "Валюта") Тогда
		Валюта = ДокОбъект.Валюта;
	ИначеЕсли КНП_ЕстьРеквизит(ДокОбъект, "ВалютаВзаиморасчетов") Тогда
		Валюта = ДокОбъект.ВалютаВзаиморасчетов;
	КонецЕсли;
	
	Если Валюта = Неопределено И НЕ МОП_ЭтоДоговор(ДокОбъект) Тогда
		
		ДокОснование = МОП_ПолучитьОснованиеДокумента(ДокОбъект);
		
		Если ЗначениеЗаполнено(ДокОснование) И ДокОснование <> ДокОбъект Тогда
			Валюта = МОП_ПолучитьВалютуДокумента(ДокОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Валюта;	

КонецФункции

Функция МОП_ПолучитьВалютуДоговораДокумента(ДокОбъект)
	
	Валюта = Неопределено;
	Договор = МОП_ПолучитьДоговорПоДокументу(ДокОбъект);
	
	Если ЗначениеЗаполнено(Договор) Тогда
		
		ОплатаВВалюте = МОП_ПолучитьПризнакОплатаВВалютеПоДоговору(Договор);
		
		Если НЕ ОплатаВВалюте Тогда
			
			Валюта = МОП_ПолучитьВалютуПоКоду("643");
			Возврат Валюта;
			
		КонецЕсли;
		
		Валюта = МОП_ПолучитьВалютуДокумента(Договор);
		
		Если НЕ ЗначениеЗаполнено(Валюта) Тогда
			
			Если КНП_ЕстьРеквизит(ДокОбъект, "ВалютаДокумента") Тогда
				Валюта = ДокОбъект.ВалютаДокумента;
			ИначеЕсли КНП_ЕстьРеквизит(ДокОбъект, "Валюта") Тогда
				Валюта = ДокОбъект.Валюта;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли КНП_ЕстьРеквизит(ДокОбъект, "ВалютаДокумента") Тогда
		Валюта = ДокОбъект.ВалютаДокумента;
	ИначеЕсли КНП_ЕстьРеквизит(ДокОбъект, "Валюта") Тогда
		Валюта = ДокОбъект.Валюта;
	КонецЕсли;
	
	Возврат Валюта;

КонецФункции

// Получить структуру ответственного лица гл.буха. Если его нет - то ответственного за ЭДО
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
// 
// Возвращаемое значение:
// Структура  - Структура с полями Фамилия, Имя, Отчество, Должность 
//
Функция МОП_ПолучитьСтруктуруОтветственногоЛицаГлБуха()
	
	ТекКонф = КНП_ИмяКонфигурации();
	ФизЛицо = Неопределено;
	ГлавБух = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер");
	
	Если НЕ ЗначениеЗаполнено(ГлавБух) Тогда
		ГлавБух = ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизации.ГлавныйБухгалтер");
	КонецЕсли;
	
	ФизЛицо = КЗП_ПолучитьОтветственноеЛицо(ГлавБух);
	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		Возврат МОП_СформироватьСтруктуруОтветственныеЛицаОрганизации(ФизЛицо);
	КонецЕсли;
	
	Возврат МОП_СформироватьСтруктуруОтветственныеЛицаОрганизации();

КонецФункции

// Получить идентификатор гос контракта
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  СсылкаНаРеализацию	 - ДокументСсылка	 - Ссылка на документ основания счет-фактуры
// 
// Возвращаемое значение:
// Строка  - Значение идентификатора гос.контракта. Если такого поля нет в СФ - то пустая строка
//
Функция МОП_ПолучитьИдентификаторГосКонтракта(СсылкаНаРеализацию)
	
	Запрос = Новый Запрос;
	ТекКонф = КНП_ИмяКонфигурации();
	Запрос.УстановитьПараметр("ДокументОснование", СсылкаНаРеализацию);
	
	Если КНП_ЕстьОбъектМетаданных("СчетФактураВыданный") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ                                                                                                                                   
		|	СчетФактураВыданный.ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.ДокументОснование = &ДокументОснование";
		
		Если НЕ КНП_ЕстьРеквизит(Документы.СчетФактураВыданный.ПустаяСсылка(), "ИдентификаторГосКонтракта") Тогда
			Возврат "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьОбъектМетаданных("СчетФактура") Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СчетФактураДокументыОснования.Ссылка.ИдентификаторГосКонтракта КАК ИдентификаторГосКонтракта
		|ИЗ
		|	Документ.СчетФактура.ДокументыОснования КАК СчетФактураДокументыОснования
		|ГДЕ
		|	СчетФактураДокументыОснования.ДокументОснование = &ДокументОснование";
		
		Если НЕ КНП_ЕстьРеквизит(Документы.СчетФактура.ПустаяСсылка(), "ИдентификаторГосКонтракта") Тогда
			Возврат "";
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ИдентификаторГосКонтракта;
		КонецЕсли;                                
		
	Исключение
		ДобавитьВЖурнал(ОписаниеОшибки(), "ПолучитьИдентификаторГосКонтракта");
	КонецПопытки;                                       
	
	Возврат "";

КонецФункции

Функция МОП_ПолучитьВидКИЮрАдреса(Владелец, ТекКонф)
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации;	
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Попытка
			Возврат Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		Исключение КонецПопытки;
		
		Попытка
			Возврат Справочники.ВидыКонтактнойИнформации.ЮридическийАдресКонтрагенты;
		Исключение КонецПопытки;
		
		Возврат Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
		
	КонецЕсли;
	
	ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонф, "МОП_ПолучитьВидКИЮрАдреса");
	Возврат Неопределено;		

КонецФункции

Функция МОП_ПолучитьВидКИФактАдреса(Владелец, ТекКонф)
	
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Организации") Тогда
		Возврат Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;	
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Попытка 
			Возврат Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		Исключение КонецПопытки;
		
		Попытка
			Возврат Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагенты;
		Исключение КонецПопытки;
		
		Возврат Справочники.ВидыКонтактнойИнформации.ПустаяСсылка();
		
	КонецЕсли;
	
	ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекКонф, "МОП_ПолучитьВидКИФактАдреса");
	Возврат Неопределено;

КонецФункции

// Получить банк по БИКу (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  БИКБанка - Строка	 - Строка БИК банка. Обычно это код справочника
// 
// Возвращаемое значение:
// СправочникСсылка, Неопределено  - Ссылка на банк
//
Функция МОП_ПолучитьБанкПоБИКу(БИКБанка)
	
	МенеджерСправочника = Неопределено;
	СсылкаНаЭлементСправочника = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Банки") Тогда	
		МенеджерСправочника = Справочники.Банки;	
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторБанковРФ") Тогда	
		МенеджерСправочника = Справочники.КлассификаторБанковРФ;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторБанков") Тогда
		МенеджерСправочника = Справочники.КлассификаторБанков;
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + КНП_ИмяКонфигурации(), "МОП_ПолучитьБанкПоБИКу");
	КонецЕсли;
	
	Попытка
		
		СсылкаНаЭлементСправочника = МенеджерСправочника.НайтиПоКоду(БИКБанка);
		
		Если СсылкаНаЭлементСправочника.Пустая() И КНП_ЕстьОбъектМетаданных("КлассификаторБанковРФ") Тогда
			СсылкаНаЭлементСправочника = Справочники.КлассификаторБанковРФ.НайтиПоКоду(БИКБанка);
		КонецЕсли;
		
		Если СсылкаНаЭлементСправочника.Пустая() И КНП_ЕстьОбъектМетаданных("КлассификаторБанков") Тогда
			СсылкаНаЭлементСправочника = Справочники.КлассификаторБанков.НайтиПоКоду(БИКБанка);
		КонецЕсли;
		
	Исключение
		
		СсылкаНаЭлементСправочника = Неопределено;
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_ПолучитьБанкПоБИКу");
		
	КонецПопытки;
	
	Возврат СсылкаНаЭлементСправочника;
	
КонецФункции

// Получить страну по коду (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  КодСтраны	 - Строка	 - Код страны
// 
// Возвращаемое значение:
// СправочникСсылка  - элемент справочника 
//
Функция МОП_ПолучитьСтрануПоКоду(КодСтраны)
	
	ТекущаяКонфигурация = КНП_ИмяКонфигурации();
	МенеджерСправочника = Неопределено;
	СсылкаНаЭлементСправочника = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("СтраныМира") Тогда	
		МенеджерСправочника = Справочники.СтраныМира;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторСтранМира") Тогда
		МенеджерСправочника = Справочники.КлассификаторСтранМира;
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекущаяКонфигурация, "МОП_ПолучитьСтрануПоКоду");
	КонецЕсли;
	
	Попытка
		СсылкаНаЭлементСправочника = МенеджерСправочника.НайтиПоКоду(КодСтраны);	
	Исключение
		
		СсылкаНаЭлементСправочника = Неопределено;
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_ПолучитьСтрануПоКоду");
		
	КонецПопытки;
	
	Возврат СсылкаНаЭлементСправочника;	

КонецФункции

// Получить страну по коду (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  КодОКЕИ	 - Строка	 - Код классификатора единиц измерения (код справочника)
// 
// Возвращаемое значение:
// СправочникСсылка  - элемент справочника 
//
Функция МОП_ПолучитьЕдиницуИзмененияПоОКЕИ(КодОКЕИ)
	
	ТекущаяКонфигурация = КНП_ИмяКонфигурации();
	МенеджерСправочника = Неопределено;
	СсылкаНаЭлементСправочника = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("КлассификаторЕдиницИзмерения") Тогда	
		МенеджерСправочника = Справочники.КлассификаторЕдиницИзмерения;	
	ИначеЕсли КНП_ЕстьОбъектМетаданных("УпаковкиЕдиницыИзмерения") Тогда	
		МенеджерСправочника = Справочники.УпаковкиЕдиницыИзмерения;		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекущаяКонфигурация, "МОП_ПолучитьЕдиницуИзмененияПоОКЕИ");
	КонецЕсли;
	
	Попытка
		СсылкаНаЭлементСправочника = МенеджерСправочника.НайтиПоКоду(КодОКЕИ);	
	Исключение
		
		СсылкаНаЭлементСправочника = Неопределено;
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_ПолучитьЕдиницуИзмененияПоОКЕИ");
		
	КонецПопытки;
	
	Возврат СсылкаНаЭлементСправочника;	

КонецФункции

// Получить валюту по коду (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  Код	 - Строка	 - Код валюты
// 
// Возвращаемое значение:
// СправочникСсылка  - элемент справочника 
//
Функция МОП_ПолучитьВалютуПоКоду(Код)
	
	ТекущаяКонфигурация = КНП_ИмяКонфигурации();
	МенеджерСправочника = Неопределено;
	СсылкаНаЭлементСправочника = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Валюты") Тогда	
		МенеджерСправочника = Справочники.Валюты;		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация " + ТекущаяКонфигурация, "МОП_ПолучитьВалютуПоКоду");
	КонецЕсли;
	
	Попытка
		СсылкаНаЭлементСправочника = МенеджерСправочника.НайтиПоКоду(Код);	
	Исключение
		
		СсылкаНаЭлементСправочника = Неопределено;
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_ПолучитьВалютуПоКоду");
		
	КонецПопытки;
	
	Возврат СсылкаНаЭлементСправочника;

КонецФункции

// Получить грузополучателя (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка	 - Анализируемый документ
// 
// Возвращаемое значение:
// Булево  - 
//
Функция МОП_ПолучитьГрузополучателя(СсылкаНаДокумент)
	
	Результат = Неопределено;
	
	ЕстьРеквизитКонтрагента = КНП_ЕстьРеквизит(СсылкаНаДокумент, "Контрагент");
	
	Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "Грузополучатель") Тогда
		
		Если ЗначениеЗаполнено(СсылкаНаДокумент.Грузополучатель) Тогда
			Результат = СсылкаНаДокумент.Грузополучатель;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) И ЕстьРеквизитКонтрагента Тогда

		Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "ДокументОснование") Тогда
			
			Если КНП_ЕстьРеквизит(СсылкаНаДокумент.ДокументОснование, "Грузополучатель") Тогда
				
				Если ЗначениеЗаполнено(СсылкаНаДокумент.ДокументОснование.Грузополучатель) Тогда
					Результат = СсылкаНаДокумент.ДокументОснование.Грузополучатель;		
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = СсылкаНаДокумент.Контрагент;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_ПолучитьПокупателя(СсылкаНаДокумент)
	Результат = Неопределено;
	
	ЕстьРеквизитКонтрагента = КНП_ЕстьРеквизит(СсылкаНаДокумент, "Контрагент");
	
	Если ЕстьРеквизитКонтрагента и ЗначениеЗаполнено(СсылкаНаДокумент.Контрагент) Тогда
		Результат = СсылкаНаДокумент.Контрагент;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Получить грузоотправителя (метаданно-ориентированный метод)
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка	 - Анализируемый документ
// 
// Возвращаемое значение:
// Булево  - 
//
Функция МОП_ПолучитьГрузоотправителя(СсылкаНаДокумент)
	
	Результат = Неопределено;	
	
	ЕстьРеквизитОрганизации = КНП_ЕстьРеквизит(СсылкаНаДокумент, "Организация");
	
	Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "Грузоотправитель") Тогда
		
		Если ЗначениеЗаполнено(СсылкаНаДокумент.Грузоотправитель) Тогда
			Результат = СсылкаНаДокумент.Грузоотправитель;		
		КонецЕсли;
		
	КонецЕсли;
	
	//+Макрушин Е. 07.04.2026 #UT10-5800
	Если НЕ ЗначениеЗаполнено(Результат) И ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Результат = СсылкаНаДокумент.Контрагент;
	КонецЕсли;		
	//-Макрушин Е. 07.04.2026 #UT10-5800
	
	
	Если НЕ ЗначениеЗаполнено(Результат) И ЕстьРеквизитОрганизации Тогда
		
		//+Белов А. 01.09.2026 #UT10-6033
		Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказЗаявка") И ТипЗнч(СсылкаНаДокумент.Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
			Результат = Константы.ОсновнаяОрганизация.Получить();
		//-Белов А. 01.09.2026 #UT10-6033
		Иначе
			Результат = СсылкаНаДокумент.Организация;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ПолучитьГрузоперевозчика(СсылкаНаДокумент)
	
	Результат = Неопределено;	
	
	ЕстьРеквизитОрганизации = КНП_ЕстьРеквизит(СсылкаНаДокумент, "Организация");
	
	Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "Перевозчик") Тогда
		
		Если ЗначениеЗаполнено(СсылкаНаДокумент.Перевозчик) Тогда
			Результат = СсылкаНаДокумент.Перевозчик;		
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) И ЕстьРеквизитОрганизации Тогда
		Результат = СсылкаНаДокумент.Организация;
	КонецЕсли;
	
	Возврат Результат;		

КонецФункции

// Получить структуру платежного документа (метаданно-ориентированный метод)
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка	 - 
// 
// Возвращаемое значение:
// Структура  - Структура с полями number и date
//
Функция МОП_ПолучитьСтруктуруПлатежногоДокумента(СсылкаНаДокумент)
	
	СтруктураДанных = Новый Структура("Номер,Дата");
	ТекущаяКонфигурация = КНП_ИмяКонфигурации();
	
	Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "ДатаПлатежноРасчетногоДокумента") И КНП_ЕстьРеквизит(СсылкаНаДокумент, "НомерПлатежноРасчетногоДокумента") И
		ЗначениеЗаполнено(СсылкаНаДокумент.ДатаПлатежноРасчетногоДокумента) И ЗначениеЗаполнено(СсылкаНаДокумент.НомерПлатежноРасчетногоДокумента) 
		Тогда
		
		СтруктураДанных.Номер = СсылкаНаДокумент.НомерПлатежноРасчетногоДокумента;
		СтруктураДанных.Дата = КНП_ДатаВФормате(СсылкаНаДокумент.ДатаПлатежноРасчетногоДокумента);
		
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаДокумент, "ДатаДокументаОплаты") И КНП_ЕстьРеквизит(СсылкаНаДокумент, "НомерДокументаОплаты") И
		ЗначениеЗаполнено(СсылкаНаДокумент.ДатаДокументаОплаты) И ЗначениеЗаполнено(СсылкаНаДокумент.НомерДокументаОплаты)	
		Тогда
		
		СтруктураДанных.Номер = СсылкаНаДокумент.НомерДокументаОплаты;
		СтруктураДанных.Дата = КНП_ДатаВФормате(СсылкаНаДокумент.ДатаДокументаОплаты);
		
	ИначеЕсли КНП_ЕстьТабЧасть(СсылкаНаДокумент, "ПлатежноРасчетныеДокументы") Тогда
		
		Если СсылкаНаДокумент.ПлатежноРасчетныеДокументы.Количество() > 0 Тогда
			
			ПлатежныйДокумент = СсылкаНаДокумент.ПлатежноРасчетныеДокументы[0];
			СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(СсылкаНаДокумент.ПлатежноРасчетныеДокументы);
			
			Если СтруктураКолонок.Свойство("НомерПлатежноРасчетногоДокумента") Тогда
				СтруктураДанных.Номер = ПлатежныйДокумент.НомерПлатежноРасчетногоДокумента;
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("НомерДокумента") Тогда
				СтруктураДанных.Номер = ПлатежныйДокумент.НомерДокумента;
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("ДатаПлатежноРасчетногоДокумента") Тогда
				СтруктураДанных.Дата = КНП_ДатаВФормате(ПлатежныйДокумент.ДатаПлатежноРасчетногоДокумента);
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("ДатаДокумента") Тогда
				СтруктураДанных.Дата = КНП_ДатаВФормате(ПлатежныйДокумент.ДатаДокумента);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(СтруктураДанных.Номер) ИЛИ ЗначениеЗаполнено(СтруктураДанных.Дата) ) Тогда
		СтруктураДанных = Неопределено;
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции

Функция МОП_ПолучитьТранспортнуюНакладную(СсылкаНаДокумент)
	
	СтруктураТН = Новый Структура("ИмяДокумента,Номер,Дата", "", "", "");	
	Возврат СтруктураТН;

КонецФункции

Функция МОП_ПолучитьБанковскийСчетИзДокумента(ДокументСсылка)
	
	Если КНП_ЕстьРеквизит(ДокументСсылка, "СтруктурнаяЕдиница") Тогда
		СсылкаНаБанк = ДокументСсылка.СтруктурнаяЕдиница.Банк;
	ИначеЕсли КНП_ЕстьРеквизит(ДокументСсылка, "БанковскийСчетОрганизации") Тогда
		СсылкаНаБанк = ДокументСсылка.БанковскийСчетОрганизации.Банк;
	ИначеЕсли КНП_ЕстьРеквизит(ДокументСсылка, "БанковскийСчет") Тогда
		СсылкаНаБанк = ДокументСсылка.БанковскийСчет.Банк;
	КонецЕсли;	

КонецФункции

Функция МОП_ПолучитьБанковскийСчетОрганизации(СсылкаНаОрганизацию)
	
	Результат = Неопределено;	
	
	Если КНП_ЕстьРеквизит(СсылкаНаОрганизацию, "ОсновнойБанковскийСчет") Тогда
		Результат = СсылкаНаОрганизацию.ОсновнойБанковскийСчет;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("БанковскиеСчетаОрганизаций") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчетаОрганизаций.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
		|ГДЕ
		|	БанковскиеСчетаОрганизаций.Владелец = &Владелец
		|	И БанковскиеСчетаОрганизаций.Закрыт = ЛОЖЬ
		|	И БанковскиеСчетаОрганизаций.ПометкаУдаления = ЛОЖЬ"; 
		
		Запрос.УстановитьПараметр("Владелец", СсылкаНаОрганизацию);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;	
		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация", "МОП_ПолучитьБанковскийСчетОрганизации");
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ПолучитьБанковскийСчетКонтрагента(СсылкаНаКонтрагента, СсылкаНаДокумент = Неопределено)
	
	Результат = Неопределено;	
	
	Если КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "ОсновнойБанковскийСчет") Тогда
		Результат = СсылкаНаКонтрагента.ОсновнойБанковскийСчет;
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "БанковскийСчетПоУмолчанию") Тогда
		Результат = СсылкаНаКонтрагента.БанковскийСчетПоУмолчанию;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("БанковскиеСчетаКонтрагентов") Тогда
		
		Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
			
			Если КНП_ЕстьРеквизит(СсылкаНаДокумент, "БанковскийСчетКонтрагента") Тогда
				Результат = СсылкаНаДокумент.БанковскийСчетКонтрагента;	
			ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаДокумент, "ДокументОснование") И ЗначениеЗаполнено(СсылкаНаДокумент.ДокументОснование) Тогда
				
				Если КНП_ЕстьРеквизит(СсылкаНаДокумент.ДокументОснование, "БанковскийСчетКонтрагента") Тогда
					Результат = СсылкаНаДокумент.ДокументОснование.БанковскийСчетКонтрагента;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	БанковскиеСчетаКонтрагентов.Ссылка
			|ИЗ
			|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
			|ГДЕ
			|	БанковскиеСчетаКонтрагентов.Владелец = &Владелец
			|	И БанковскиеСчетаКонтрагентов.Закрыт = ЛОЖЬ
			|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ"; 
			
			Запрос.УстановитьПараметр("Владелец", СсылкаНаКонтрагента);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
			
			Если Результат = Неопределено Тогда
				Результат = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли КНП_ЕстьОбъектМетаданных("БанковскиеИКазначейскиеСчета") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчетаКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеИКазначейскиеСчета КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Владелец = &Владелец
		|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.ТипЛицевогоСчета = ЗНАЧЕНИЕ(Перечисление.ТипыЛицевыхСчетов.Банковский)"; 
		
		Запрос.УстановитьПараметр("Владелец", СсылкаНаКонтрагента);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
		Если Результат = Неопределено Тогда
			Результат = Справочники.БанковскиеИКазначейскиеСчета.ПустаяСсылка();
		КонецЕсли;
		
	Иначе
		ДобавитьВЖурнал("Неподдерживаемая конфигурация", "МОП_ПолучитьБанковскийСчетКонтрагента");
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ПолучитьБанковскийСчетПоБикуНомеруСчета(БИК, НомерСчета)
	
	Результат = Неопределено;	
	Банк = МОП_ПолучитьБанкПоБИКу(БИК);
	Запрос = Новый Запрос;
	
	Если КНП_ЕстьОбъектМетаданных("БанковскиеСчетаКонтрагентов") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчетаКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчетаКонтрагентов КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Банк = &Банк
		|	И БанковскиеСчетаКонтрагентов.Закрыт = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.НомерСчета = &НомерСчета"; 
	ИначеЕсли КНП_ЕстьОбъектМетаданных("БанковскиеСчета") Тогда
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БанковскиеСчетаКонтрагентов.Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчетаКонтрагентов
		|ГДЕ
		|	БанковскиеСчетаКонтрагентов.Банк = &Банк
		|	И БанковскиеСчетаКонтрагентов.ПометкаУдаления = ЛОЖЬ
		|	И БанковскиеСчетаКонтрагентов.НомерСчета = &НомерСчета";
	Иначе
		
		ДобавитьВЖурнал("Неподдерживаемая конфигурация", "КЗП_ПолучитьБанковскийСчетПоБикуНомеруСчета");
		Возврат Результат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Банк", Банк);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МОП_ПолучитьДоговорПоДокументу(ДокументСсылка)
	
	Если КНП_ЕстьРеквизит(ДокументСсылка, "Договор") И ЗначениеЗаполнено(ДокументСсылка.Договор) Тогда
		Возврат ДокументСсылка.Договор;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокументСсылка, "Соглашение") И ЗначениеЗаполнено(ДокументСсылка.Соглашение) Тогда
		Возврат ДокументСсылка.Соглашение;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ДокументСсылка, "ДоговорКонтрагента") И ЗначениеЗаполнено(ДокументСсылка.ДоговорКонтрагента) Тогда
		Возврат ДокументСсылка.ДоговорКонтрагента;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получить контрагента
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ИНН	 - Строка	 - 
//  КПП	 - Строка	 - 
//  ОГРН - Строка	 - 
// 
// Возвращаемое значение:
// СправочникСсылка.Контрагент  - 
//
Функция МОП_ПолучитьКонтрагента(ИНН, КПП = Неопределено, ОГРН = Неопределено) 
	
	Результат = Неопределено;
	УстановитьПривилегированныйРежим(Истина);
	ТекКонф = КНП_ИмяКонфигурации();
	Результат = Справочники.Контрагенты.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(ИНН) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	ТекстЗапроса = "ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН
	|	И НЕ Контрагенты.ПометкаУдаления";
	
	Если ЗначениеЗаполнено(КПП) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "	И Контрагенты.КПП = &КПП";
		Запрос.УстановитьПараметр("КПП", КПП);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОГРН) И КНП_ЕстьРеквизит(Справочники.Контрагенты.ПустаяСсылка(), "РегистрационныйНомер") Тогда
		
		ТекстЗапроса = ТекстЗапроса  + "	И Контрагенты.РегистрационныйНомер = &ОГРН";
		Запрос.УстановитьПараметр("ОГРН", ОГРН);
		
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Попытка
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();		
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Результат = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "МОП_ПолучитьКонтрагента");	
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "И НЕ Контрагенты.ПометкаУдаления", "");
		
		Попытка
			
			ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();		
			
			Если ВыборкаДетальныеЗаписи.Следующий() Тогда
				Результат = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "МОП_ПолучитьКонтрагента");	
		КонецПопытки;
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;

КонецФункции

// Получить организацию
// *Поддержка БП 3.0, УТ 11, КА 2.4, БП 2.0, УТ 10.3, КА 1.1, УПП 1.3
//
// Параметры:
//  ИНН	 - Строка	 - 
//  ОГРН - Строка	 - 
// 
// Возвращаемое значение:
// СправочникСсылка.Организации, Неопределено  - Результат поиска организации
//
Функция МОП_ПолучитьОрганизацию(ИНН, ОГРН, КПП = Неопределено, ВернутьМассив = Ложь)
	
	Результат = Неопределено;
	
	Результат = Справочники.Организации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Организации.Ссылка
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ";
	
	ТекстЗапроса = ТекстЗапроса + " (Организации.ИНН = &ИНН И Организации.ОГРН = &ОГРН)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("ОГРН", ОГРН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 1 И НЕ ВернутьМассив Тогда
			ДобавитьВЖурнал("Внимание! В системе имеется несколько организаций с одинаковым ИНН и ОГРН", "МОП_ПолучитьОрганизацию");
		КонецЕсли;
		
		Если ВернутьМассив Тогда
			
			МассивОрганизаций = Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				МассивОрганизаций.Добавить(Выборка.Ссылка);
			КонецЦикла;
			
			Возврат МассивОрганизаций;
			
		Иначе
			
			Если Выборка.Следующий() Тогда
				Результат = Выборка.Ссылка;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "МОП_ПолучитьОрганизацию");	
	КонецПопытки;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ПолучитьСтруктуруТаблицыКорректировкиТоваров(ДокументСсылка)
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("Содержание");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("КоличествоДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("ЦенаДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("СуммаДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДСДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры"); //
	
	Если КНП_ЕстьТабЧасть(ДокументСсылка, "Товары") Тогда
		
		Для Каждого СтрокаТЧ Из ДокументСсылка.Товары Цикл 
			
			Если СтрокаТЧ.СуммаДоКорректировки = СтрокаТЧ.Сумма Тогда
				Продолжить;				
			КонецЕсли;
			
			СтрокаТТ = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТТ, СтрокаТЧ); 
			
			Если КНП_ЕстьТабЧасть(ДокументСсылка, "Расхождения") Тогда //Разница в отдельной таблице
				
				СтрокаРасхождений = ДокументСсылка.Расхождения.Найти(СтрокаТТ.Номенклатура, "Номенклатура");
				
				Если СтрокаРасхождений <> Неопределено Тогда
					
					СтрокаТТ.КоличествоДоИзменения = СтрокаТТ.Количество - СтрокаРасхождений.Количество;
					СтрокаТТ.СуммаДоИзменения = СтрокаТТ.Сумма - СтрокаРасхождений.Сумма;
					
					Если СтрокаТТ.КоличествоДоИзменения = 0 Тогда
						СтрокаТТ.ЦенаДоИзменения = СтрокаТТ.СуммаДоИзменения;	
					Иначе
						СтрокаТТ.ЦенаДоИзменения = СтрокаТТ.СуммаДоИзменения / СтрокаТТ.КоличествоДоИзменения;
					КонецЕсли;
					
					СтрокаТТ.СтавкаНДСДоИзменения = СтрокаРасхождений.СтавкаНДС;
					СтрокаТТ.СуммаНДСДоИзменения = СтрокаТТ.СуммаНДС - СтрокаРасхождений.СуммаНДС;
					
				Иначе
					
					СтрокаТТ.КоличествоДоИзменения = СтрокаТТ.Количество;
					СтрокаТТ.ЦенаДоИзменения = СтрокаТТ.Цена;
					СтрокаТТ.СуммаДоИзменения = СтрокаТТ.Сумма;
					СтрокаТТ.СтавкаНДСДоИзменения = СтрокаТТ.СтавкаНДС;
					СтрокаТТ.СуммаНДСДоИзменения = СтрокаТТ.СуммаНДС;
					
				КонецЕсли;
				
			Иначе //Разница в одной таблице	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокументСсылка, "Услуги") Тогда
		
		Для Каждого СтрокаТЧ Из ДокументСсылка.Услуги Цикл
			
			СтрокаТТ = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТТ, СтрокаТЧ); 
			
			Если КНП_ЕстьТабЧасть(ДокументСсылка, "Расхождения") Тогда //Разница в отдельной таблице
				
				СтрокаРасхождений = ДокументСсылка.Расхождения.Найти(СтрокаТТ.Номенклатура, "Номенклатура");
				
				Если СтрокаРасхождений <> Неопределено Тогда
					
					СтрокаТТ.КоличествоДоИзменения = СтрокаТТ.Количество + СтрокаРасхождений.Количество;
					СтрокаТТ.СуммаДоИзменения = СтрокаТТ.Сумма + СтрокаРасхождений.Сумма;
					СтрокаТТ.ЦенаДоИзменения = СтрокаТТ.СуммаДоИзменения / СтрокаТТ.КоличествоДоИзменения;	
					СтрокаТТ.СтавкаНДСДоИзменения = СтрокаРасхождений.СтавкаНДС;
					СтрокаТТ.СуммаНДСДоИзменения = СтрокаТТ.СуммаНДС + СтрокаРасхождений.СуммаНДС;
					
				Иначе
					
					СтрокаТТ.КоличествоДоИзменения = СтрокаТТ.Количество;
					СтрокаТТ.ЦенаДоИзменения = СтрокаТТ.Цена;
					СтрокаТТ.СуммаДоИзменения = СтрокаТТ.Сумма;
					СтрокаТТ.СтавкаНДСДоИзменения = СтрокаТТ.СтавкаНДС;
					СтрокаТТ.СуммаНДСДоИзменения = СтрокаТТ.СуммаНДС;
					
				КонецЕсли;
				
			Иначе //Разница в одной таблице	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаТоваров;

КонецФункции

Функция МОП_ПолучитьСчетФактуруДокумента(ДокументСсылка)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	(СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование
	|	ИЛИ СчетФактураВыданныйДокументыОснования.Ссылка.ДокументОснование = &ДокументОснование)
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен"; //Белов Добавил условие на проведенную сф 	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции

Функция МОП_ПолучитьСтруктуруДанныхКонтрагента(СсылкаНаКонтрагента)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Наименование", СсылкаНаКонтрагента.Наименование);
	
	Если ТипЗнч(СсылкаНаКонтрагента) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		СтруктураДанных.Вставить("ИНН", СсылкаНаКонтрагента.ИНН);
		СтруктураДанных.Вставить("КПП", СсылкаНаКонтрагента.КПП);
		СтруктураДанных.Вставить("ОГРН", МОП_ПолучитьОГРНКонтрагента(СсылкаНаКонтрагента) );
		БанковскийСчет = МОП_ПолучитьБанковскийСчетКонтрагента(СсылкаНаКонтрагента);
		
		Если БанковскийСчет <> Неопределено Тогда
			
			СтруктураДанных.Вставить("БИК", МОП_ПолучитьБИКБанкаПоСчету(БанковскийСчет) );
			СтруктураДанных.Вставить("НомерСчета", МОП_ПолучитьНомерБанковскогоСчета(БанковскийСчет) );
			
		Иначе
			
			СтруктураДанных.Вставить("БИК", "");
			СтруктураДанных.Вставить("НомерСчета");
			
		КонецЕсли;
		
	Иначе     
		
		СтруктураДанных.Вставить("ИНН", "");
		СтруктураДанных.Вставить("КПП", "");
		СтруктураДанных.Вставить("ОГРН", "");
		СтруктураДанных.Вставить("БИК", "");
		СтруктураДанных.Вставить("НомерСчета");
		
	КонецЕсли;
	
	Возврат СтруктураДанных;

КонецФункции

Функция МОП_ПолучитьОГРНКонтрагента(СсылкаНаКонтрагента)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаКонтрагента) Тогда
		Возврат "";
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "ОГРН") Тогда
		Возврат СсылкаНаКонтрагента.ОГРН;
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "РегистрационныйНомер") Тогда
		Возврат СсылкаНаКонтрагента.РегистрационныйНомер;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "ЮридическоеФизическоеЛицо") Тогда
		
		Если СсылкаНаКонтрагента.Метаданные().Реквизиты.ЮридическоеФизическоеЛицо.Тип.СодержитТип(Тип("СправочникСсылка.ЮридическиеЛица") ) Тогда //спец. для БГУ
			Возврат МОП_ПолучитьОГРНКонтрагента(СсылкаНаКонтрагента.ЮридическоеФизическоеЛицо);	
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения)
	
	ОснованиеОбъектаЗаполнения = Неопределено;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "ДокументыОснования") И ОбъектЗаполнения.ДокументыОснования.Количество() > 0 Тогда
		ОснованиеОбъектаЗаполнения = ОбъектЗаполнения.ДокументыОснования[0].ДокументОснование;
	ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения, "ДокументОснование") И ЗначениеЗаполнено(ОбъектЗаполнения.ДокументОснование) Тогда
		ОснованиеОбъектаЗаполнения = ОбъектЗаполнения.ДокументОснование;
	КонецЕсли;
	
	Возврат ОснованиеОбъектаЗаполнения;

КонецФункции

Функция МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения)
	
	СтруктураПараметров = Новый Структура("Курс, Кратность", 1, 1);
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "КурсВзаиморасчетов") Тогда
		СтруктураПараметров.Курс = ОбъектЗаполнения.КурсВзаиморасчетов;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "КратностьВзаиморасчетов") Тогда
		СтруктураПараметров.Кратность = ОбъектЗаполнения.КратностьВзаиморасчетов;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Курс") Тогда
		СтруктураПараметров.Курс = ОбъектЗаполнения.Курс;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Кратность") Тогда
		СтруктураПараметров.Кратность = ОбъектЗаполнения.Кратность;
	КонецЕсли;
	
	Возврат СтруктураПараметров;

КонецФункции

Функция МОП_ПолучитьПредставлениеСтавкиНДС(СтавкаНДС)		
	
	Если Не ЗначениеЗаполнено(СтавкаНДС) Тогда
		Возврат "0";
	КонецЕсли;	
	
	ПредставлениеСтавкиНДС = "0";
	
	Если Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено Тогда
		
		Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
			ПредставлениеСтавкиНДС = "-1";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
			ПредставлениеСтавкиНДС = "0";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
			ПредставлениеСтавкиНДС = "10";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
			ПредставлениеСтавкиНДС = "18";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") Тогда
			ПредставлениеСтавкиНДС = "110";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118") Тогда
			ПредставлениеСтавкиНДС = "118";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") Тогда
			ПредставлениеСтавкиНДС = "120";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
			ПредставлениеСтавкиНДС = "20";
		//+Гавриленков В. 11.12.2025 #UT10-5574
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122") Тогда
			ПредставлениеСтавкиНДС = "122";
		ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22") Тогда
			ПредставлениеСтавкиНДС = "22";
		//-Гавриленков В. 11.12.2025 #UT10-5574
		КонецЕсли;	
		
	ИначеЕсли Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда
		ПредставлениеСтавкиНДС = ?(СтавкаНДС.Расчетная, "1", "") + Строка(СтавкаНДС.Ставка);
	КонецЕсли;
	
	Возврат ПредставлениеСтавкиНДС;		

КонецФункции

Функция МОП_ПолучитьПризнакОплатаВВалютеПоДоговору(Договор)
	
	ОплатаВВалюте = Ложь;
	
	Если КНП_ЕстьРеквизит(Договор, "ОплатаВВалюте") Тогда
		ОплатаВВалюте = Договор.ОплатаВВалюте;
	КонецЕсли;
	
	Возврат ОплатаВВалюте;

КонецФункции

Функция МОП_ПолучитьСтавкуНДСИзСтроки(Знач СтавкаНДССтрокой)
	
	СтавкаНДССтрокой = СтрЗаменить(СтавкаНДССтрокой, "%", "");
	
	Если Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено Тогда
		
		СтавкаНДССтрокой = Строка(СтавкаНДССтрокой);
		
		Если 
			СтавкаНДССтрокой = "0" 
			Или 
			СтавкаНДССтрокой = "0.00000" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "10" 
			Или
			СтавкаНДССтрокой = "10.00000" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "18" 
			Или
			СтавкаНДССтрокой = "18.00000" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "10/110" 
			ИЛИ
			СтавкаНДССтрокой = "110" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "18/118"
			ИЛИ
			СтавкаНДССтрокой = "118" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "20" 
			Или
			СтавкаНДССтрокой = "20.00000" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "20/120"
			ИЛИ
			СтавкаНДССтрокой = "120" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120");
			
		//+Гавриленков В. 11.12.2025 #UT10-5574
		ИначеЕсли 
			СтавкаНДССтрокой = "22" 
			Или
			СтавкаНДССтрокой = "22.00000" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "22/122"
			ИЛИ
			СтавкаНДССтрокой = "122" 
			Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122");
		//-Гавриленков В. 11.12.2025 #UT10-5574
			
		Иначе
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");		
		КонецЕсли;
		
		
	ИначеЕсли Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда
		
		СтавкаНДССтрокой = Строка(СтавкаНДССтрокой);
		
		Если 
			СтавкаНДССтрокой = "0" 
			Или 
			СтавкаНДССтрокой = "0.00000" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("0%", Истина);
			
		ИначеЕсли 
			СтавкаНДССтрокой = "10" 
			Или
			СтавкаНДССтрокой = "10.00000" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("10%", Истина);
			
		ИначеЕсли 
			СтавкаНДССтрокой = "18" 
			Или
			СтавкаНДССтрокой = "18.00000" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("18%", Истина);
			
		ИначеЕсли 
			СтавкаНДССтрокой = "10/110" 
			ИЛИ
			СтавкаНДССтрокой = "110" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("10% / 110%");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "18/118"
			ИЛИ
			СтавкаНДССтрокой = "118" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("18% / 118%");
			
		ИначеЕсли 
			СтавкаНДССтрокой = "20" 
			Или
			СтавкаНДССтрокой = "20.00000" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("20%", Истина);
			
		ИначеЕсли 
			СтавкаНДССтрокой = "20/120"
			ИЛИ
			СтавкаНДССтрокой = "120" 
			Тогда
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("20% / 120%");
			
		Иначе
			Возврат Справочники.СтавкиНДС.НайтиПоНаименованию("Без НДС");		
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция МОП_ПолучитьСписокКонтрагентов()
	
	ТаблицаКонтрагентов = Новый ТаблицаЗначений;
	ТаблицаКонтрагентов.Колонки.Добавить("Контрагент");
	ТаблицаКонтрагентов.Колонки.Добавить("ИНН");
	ТаблицаКонтрагентов.Колонки.Добавить("КПП");
	
	Если КНП_ЕстьОбъектМетаданных("Контрагенты") Тогда
		МенеджерСправочника = Справочники.Контрагенты;	
	КонецЕсли;
	
	Если МенеджерСправочника <> Неопределено Тогда
		
		Выборка = МенеджерСправочника.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаТаблицы = ТаблицаКонтрагентов.Добавить();
			СтрокаТаблицы.Контрагент = Выборка.Ссылка;
			
			Если КНП_ЕстьРеквизит(Выборка.Ссылка, "ИНН") Тогда	
				СтрокаТаблицы.ИНН = Выборка.ИНН;
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(Выборка.Ссылка, "КПП") Тогда	
				СтрокаТаблицы.КПП = Выборка.КПП;
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат ТаблицаКонтрагентов;

КонецФункции

Функция МОП_ПолучитьБИКБанкаПоСчету(БанковскийСчет)
	
	Если КНП_ЕстьРеквизит(БанковскийСчет, "Банк") И ЗначениеЗаполнено(БанковскийСчет.Банк) Тогда
		Возврат БанковскийСчет.Банк.Код;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(БанковскийСчет, "КассовыйОрган") И ЗначениеЗаполнено(БанковскийСчет.КассовыйОрган) Тогда
		Возврат БанковскийСчет.КассовыйОрган.Код;
	КонецЕсли;

КонецФункции

Функция МОП_ПолучитьНомерБанковскогоСчета(БанковскийСчет)
	
	Если КНП_ЕстьРеквизит(БанковскийСчет, "НомерСчета") Тогда
		Возврат БанковскийСчет.НомерСчета;
	КонецЕсли;
	
	Возврат БанковскийСчет.Код;	

КонецФункции

Функция МОП_ПолучитьНаименованиеБанкаПоСчету(БанковскийСчет)
	
	Если КНП_ЕстьРеквизит(БанковскийСчет, "Банк") И ЗначениеЗаполнено(БанковскийСчет.Банк) Тогда
		Возврат БанковскийСчет.Банк.Наименование;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(БанковскийСчет, "КассовыйОрган") И ЗначениеЗаполнено(БанковскийСчет.КассовыйОрган) Тогда
		Возврат БанковскийСчет.КассовыйОрган.Наименование;
	КонецЕсли;

КонецФункции

Функция МОП_ЭтоРеализацияТоваров(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "РеализацияТоваровУслуг" Тогда
		
		Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Услуги") Тогда
			
			//+Гавриленков В. 15.11.2024 #UT10-4901 И -> ИЛИ
			Если СсылкаНаДокумент.Товары.Количество() > 0 ИЛИ СсылкаНаДокумент.Услуги.Количество() = 0 Тогда
				Результат = Истина;
			КонецЕсли;
			
		Иначе
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "РасходнаяНакладная" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "НакладнаяНаРеализациюТорг12" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_ЭтоАктВыполненныхРабот(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "РеализацияТоваровУслуг" Тогда
		
		Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Услуги") И КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Товары") Тогда
			
			Если СсылкаНаДокумент.Товары.Количество() = 0 И СсылкаНаДокумент.Услуги.Количество() > 0 Тогда
				Результат = Истина;
			КонецЕсли;
			
		Иначе
			Результат = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "АктВыполненныхРабот" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "РеализацияУслугПрочихАктивов" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "АктОбОказанииУслуг" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МОП_ЭтоСчетНаОплату(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетНаОплатуПокупателю" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетНаОплатуКлиенту" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетНаОплату" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция МОП_ЭтоСчетФактура(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетФактураВыданный" ИЛИ СсылкаНаДокумент.Метаданные().Имя = "СчетФактураВыданныйАванс" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетФактура" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ЭтоСчетФактураПоставщика(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_ЭтоКорректировкаРеализации(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		
		Если СсылкаНаДокумент.Метаданные().Имя = "КорректировкаРеализации" Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;		

КонецФункции

Функция МОП_НДСВСуммеПоСтавке(СтавкаНДС)
	
	Если Метаданные.Справочники.Найти("СтавкиНДС") <> Неопределено Тогда
		
		Если КНП_ЕстьРеквизит(СтавкаНДС, "Расчетная") Тогда
			Возврат СтавкаНДС.Расчетная;	
		КонецЕсли;
		
	ИначеЕсли Метаданные.Перечисления.Найти("СтавкиНДС") <> Неопределено Тогда
		
		Если 
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110") 
			ИЛИ
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18_118")
			ИЛИ
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120") 
			ИЛИ
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20")
			//+Гавриленков В. 11.12.2025 #UT10-5574
			ИЛИ
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22")
			ИЛИ 
			СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС22_122")
			//-Гавриленков В. 11.12.2025 #UT10-5574
			Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция МОП_ЭтоНеформализованныйДокумент(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если МОП_ЭтоАктСверки(СсылкаНаДокумент) Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_ЭтоАктСверки(СсылкаНаДокумент) 
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "АктСверкиВзаиморасчетов" Тогда
		Результат = Истина;
	ИначеЕсли СсылкаНаДокумент.Метаданные().Имя = "СверкаВзаиморасчетов" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_ЭтоАктОРасхожденияхПослеПриемки(СсылкаНаДокумент)
	
	//+Макрушин Е. 07.04.2026 #UT10-5800
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "АктОРасхожденияхПослеПриемки" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 07.04.2026 #UT10-5800
	
КонецФункции  

Функция МОП_ЭтоТранспортнаяНакладная(СсылкаНаДокумент)
	
	//+Белов А. 17.06.2026 #UT10-5921
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "ТранспортнаяНакладная" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции


Функция МОП_ЭтоЗаказЗаявка(СсылкаНаДокумент)
	
	//+Белов А. 17.06.2026 #UT10-5921
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "ЗаказЗаявка" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции


Функция МОП_ЭтоПлатежка(СсылкаНаДокумент)
	
	Если 
		СсылкаНаДокумент.Метаданные().Имя = "ПоступлениеБезналичныхДенежныхСредств" 
		ИЛИ
		СсылкаНаДокумент.Метаданные().Имя = "ПоступлениеНаРасчетныйСчет"
		Тогда
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция МОП_ЭтоСчетФактураНаАванс(СсылкаНаДокумент)
	
	Результат = Ложь;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетФактураВыданный" ИЛИ СсылкаНаДокумент.Метаданные().Имя = "СчетФактураВыданныйАванс" Тогда
		
		Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Авансы") И СсылкаНаДокумент.Авансы.Количество() > 0 Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если СсылкаНаДокумент.Метаданные().Имя = "СчетФактура" Тогда
		
		Если КНП_ЕстьТабЧасть(СсылкаНаДокумент, "Авансы") И СсылкаНаДокумент.Авансы.Количество() > 0 Тогда
			Результат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция МОП_ЭтоУслуга(СсылкаНаНоменклатуру)
	
	Результат = Ложь;
	
	Если КНП_ЕстьРеквизит(СсылкаНаНоменклатуру, "Услуга") И ТипЗнч(СсылкаНаНоменклатуру.Услуга) = Тип("Булево") Тогда
		Результат = СсылкаНаНоменклатуру.Услуга;
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаНоменклатуру, "ВидНоменклатуры") И ЗначениеЗаполнено(СсылкаНаНоменклатуру.ВидНоменклатуры) Тогда
		
		Если КНП_ЕстьРеквизит(СсылкаНаНоменклатуру.ВидНоменклатуры, "Услуга") И ТипЗнч(СсылкаНаНоменклатуру.ВидНоменклатуры.Услуга) = Тип("Булево") Тогда
			Результат = СсылкаНаНоменклатуру.ВидНоменклатуры.Услуга;
		ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаНоменклатуру.ВидНоменклатуры, "ТипНоменклатуры") И ЗначениеЗаполнено(СсылкаНаНоменклатуру.ТипНоменклатуры) Тогда
			
			Если Метаданные.Перечисления.Найти("ТипНоменклатуры") <> Неопределено Тогда
				
				Попытка
					
					Если 
						СсылкаНаНоменклатуру.ВидНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") 
						ИЛИ
						СсылкаНаНоменклатуру.ВидНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
						Тогда
						Результат = Истина;
					КонецЕсли;
					
				Исключение 
				КонецПопытки;	
				
			КонецЕсли;
			
		КонецЕсли; 
		
	ИначеЕсли КНП_ЕстьРеквизит(СсылкаНаНоменклатуру, "ТипНоменклатуры") Тогда
		
		Если Метаданные.Перечисления.Найти("ТипНоменклатуры") <> Неопределено Тогда
			
			Попытка
				
				Если 
					СсылкаНаНоменклатуру.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") 
					ИЛИ
					СсылкаНаНоменклатуру.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Работа")
					Тогда
					Результат = Истина;
				КонецЕсли;
				
			Исключение 
			КонецПопытки;	
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;	

КонецФункции

Функция МОП_ЭтоДоговор(ОбъектМетаданных)
	
	Результат = Ложь;
	
	Если ОбъектМетаданных.Метаданные().Имя = "Договоры" Тогда
		Результат = Истина;
	ИначеЕсли ОбъектМетаданных.Метаданные().Имя = "ДоговорыКонтрагентов" Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция МОП_СоздатьБанк(БИК, ПолноеНаименование, СокрНаименование, КоррСчет = Неопределено)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Банки") Тогда
		СправочникМенеджер = Справочники.Банки;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторБанков") Тогда
		СправочникМенеджер = Справочники.КлассификаторБанков;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторБанковРФ") Тогда
		СправочникМенеджер = Справочники.КлассификаторБанковРФ;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементБанка = СправочникМенеджер.СоздатьЭлемент();
		ЭлементБанка.Код = БИК;
		ЭлементБанка.Наименование = ПолноеНаименование;
		
		Если НЕ ЗначениеЗаполнено(ЭлементБанка.Наименование) Тогда
			ЭлементБанка.Наименование = СокрЛП(СокрНаименование);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КоррСчет) И КНП_ЕстьРеквизит(ЭлементБанка, "КоррСчет") Тогда
			ЭлементБанка.КоррСчет = КоррСчет;
		КонецЕсли;
		
		ЭлементБанка.Записать();
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьБанк");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементБанка.Ссылка;
	
КонецФункции

Функция МОП_СоздатьЕдиницуИзмерения(КодОКЕИ, Название, СокрНазвание)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("КлассификаторЕдиницИзмерения") Тогда
		СправочникМенеджер = Справочники.КлассификаторЕдиницИзмерения;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("УпаковкиЕдиницыИзмерения") Тогда
		СправочникМенеджер = Справочники.УпаковкиЕдиницыИзмерения;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СокрНазвание) Тогда
		Возврат СправочникМенеджер.ПустаяСсылка();
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Код = КодОКЕИ;
		ЭлементСправочника.Наименование = СокрНазвание;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "НаименованиеПолное") Тогда
			ЭлементСправочника.НаименованиеПолное = Название;
		Иначе
			ЭлементСправочника.Наименование = Название;
		КонецЕсли;                                      
		
		ЭлементСправочника.Записать();
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьЕдиницуИзмерения");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

Функция МОП_СоздатьСтрану(КодСтраны, Название, СокрНазвание)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("СтраныМира") Тогда
		СправочникМенеджер = Справочники.СтраныМира;
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КлассификаторСтранМира") Тогда
		СправочникМенеджер = Справочники.КлассификаторСтранМира;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Код = КодСтраны;
		ЭлементСправочника.Наименование = СокрНазвание;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "НаименованиеПолное") Тогда
			ЭлементСправочника.НаименованиеПолное = Название;
		Иначе
			ЭлементСправочника.Наименование = Название;
		КонецЕсли;
		
		ЭлементСправочника.Записать();
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьСтрану");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

Функция МОП_СоздатьВалюту(КодВалюты, Название, СокрНазвание)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Валюты") Тогда
		СправочникМенеджер = Справочники.Валюты;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Код = КодВалюты;
		ЭлементСправочника.Наименование = СокрНазвание;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "НаименованиеПолное") Тогда
			ЭлементСправочника.НаименованиеПолное = Название;
		Иначе
			ЭлементСправочника.Наименование = Название;
		КонецЕсли;
		
		ЭлементСправочника.Записать();
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьВалюту");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

Функция МОП_СоздатьКонтрагента(СтруктураДанных)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Контрагенты") Тогда
		СправочникМенеджер = Справочники.Контрагенты;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = СтруктураДанных.Наименование;
		
		Если СтруктураДанных.Свойство("ИНН") Тогда 
			ЭлементСправочника.ИНН = СтруктураДанных.ИНН 
		КонецЕсли;    
		
		Если СтруктураДанных.Свойство("КПП") Тогда 
			ЭлементСправочника.КПП = СтруктураДанных.КПП 
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("ОГРН") Тогда
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ОГРН") Тогда
				ЭлементСправочника.ОГРН = СтруктураДанных.ОГРН;
			ИначеЕсли КНП_ЕстьРеквизит(ЭлементСправочника, "РегистрационныйНомер") Тогда
				ЭлементСправочника.РегистрационныйНомер = СтруктураДанных.ОГРН;
			КонецЕсли;
			
		КонецЕсли;
		
		//Юрфизлицо
		Если СтрДлина(СтруктураДанных.ИНН) > 10 Тогда
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ЮридическоеФизическоеЛицо") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ЮридическоеФизическоеЛицо") Тогда
					ЭлементСправочника.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо");
				ИначеЕсли ЭлементСправочника.Метаданные().Реквизиты.ЮридическоеФизическоеЛицо.Тип.СодержитТип(Тип("СправочникСсылка.ФизическиеЛица") ) Тогда //спец. для БГУ
					ЭлементСправочника.ЮридическоеФизическоеЛицо = МОП_СоздатьФизическоеЛицо(СтруктураДанных);	
				КонецЕсли;
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ЮрФизЛицо") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ЮрФизЛицо") Тогда
					ЭлементСправочника.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель");
				КонецЕсли;
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ВидКонтрагента") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ВидыКонтрагентов") Тогда
					ЭлементСправочника.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель");
				ИначеЕсли КНП_ЕстьОбъектМетаданных("ЮрФизЛицо") Тогда
					ЭлементСправочника.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ФизЛицо");
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ЮридическоеФизическоеЛицо") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ЮридическоеФизическоеЛицо") Тогда
					ЭлементСправочника.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо");
				ИначеЕсли ЭлементСправочника.Метаданные().Реквизиты.ЮридическоеФизическоеЛицо.Тип.СодержитТип(Тип("СправочникСсылка.ЮридическиеЛица") ) Тогда //спец. для БГУ 
					ЭлементСправочника.ЮридическоеФизическоеЛицо = МОП_СоздатьЮридическоеЛицо(СтруктураДанных);		
				КонецЕсли;
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ЮрФизЛицо") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ЮрФизЛицо") Тогда
					ЭлементСправочника.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
				КонецЕсли;
				
			КонецЕсли;	
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ВидКонтрагента") Тогда
				
				Если КНП_ЕстьОбъектМетаданных("ВидыКонтрагентов") Тогда
					ЭлементСправочника.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЮридическоеЛицо");
				ИначеЕсли КНП_ЕстьОбъектМетаданных("ЮрФизЛицо") Тогда
					ЭлементСправочника.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "СтранаРегистрации") Тогда
			ЭлементСправочника.СтранаРегистрации = Справочники.СтраныМира.НайтиПоКоду("643");
		КонецЕсли;
		
		//Счета учета
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "СчетУчетаАвансовПокупателя") Тогда
			
			Если Метаданные.ПланыСчетов.Найти("Управленческий") <> Неопределено Тогда
				
				ЭлементСправочника.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
				ЭлементСправочника.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
				ЭлементСправочника.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
				ЭлементСправочника.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Партнер
		Если КНП_ЕстьОбъектМетаданных("Партнеры") Тогда
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "Партнер") Тогда
				ЭлементСправочника.Партнер = МОП_СоздатьПартнера(ЭлементСправочника);
			КонецЕсли;
			
		КонецЕсли;
		
		ЭлементСправочника.Записать();
		
		Если СтруктураДанных.Свойство("БИК") И СтруктураДанных.Свойство("НомерСчета") Тогда
			
			БанковскийСчет = МОП_СоздатьБанковскийСчетКонтрагента(СтруктураДанных.БИК, СтруктураДанных.НомерСчета, ЭлементСправочника.Ссылка);
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ОсновнойБанковскийСчет") Тогда
				
				ЭлементСправочника.ОсновнойБанковскийСчет = БанковскийСчет;
				ЭлементСправочника.Записать();
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "БанковскийСчетПоУмолчанию") Тогда
				
				ЭлементСправочника.БанковскийСчетПоУмолчанию = БанковскийСчет;
				ЭлементСправочника.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьКонтрагента");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

Функция МОП_СоздатьЮридическоеЛицо(СтруктураДанных)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("ЮридическиеЛица") Тогда
		СправочникМенеджер = Справочники.ЮридическиеЛица;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = СтруктураДанных.Наименование;
		
		Если СтруктураДанных.Свойство("ИНН") Тогда 
			ЭлементСправочника.ИНН = СтруктураДанных.ИНН 
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("КПП") Тогда 
			ЭлементСправочника.КПП = СтруктураДанных.КПП 
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("ОГРН") Тогда
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "ОГРН") Тогда
				ЭлементСправочника.ОГРН = СтруктураДанных.ОГРН;
			ИначеЕсли КНП_ЕстьРеквизит(ЭлементСправочника, "РегистрационныйНомер") Тогда
				ЭлементСправочника.РегистрационныйНомер = СтруктураДанных.ОГРН;
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "СтранаРегистрации") Тогда
			ЭлементСправочника.СтранаРегистрации = Справочники.СтраныМира.НайтиПоКоду("643");
		КонецЕсли;
		
		//Счета учета
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "СчетУчетаАвансовПокупателя") Тогда
			
			Если Метаданные.ПланыСчетов.Найти("Управленческий") <> Неопределено Тогда
				
				ЭлементСправочника.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
				ЭлементСправочника.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
				ЭлементСправочника.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
				ЭлементСправочника.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
				
			КонецЕсли;
			
		КонецЕсли;
		
		//Партнер
		Если КНП_ЕстьОбъектМетаданных("Партнеры") Тогда
			
			Если КНП_ЕстьРеквизит(ЭлементСправочника, "Партнер") Тогда
				ЭлементСправочника.Партнер = МОП_СоздатьПартнера(ЭлементСправочника);
			КонецЕсли;
			
		КонецЕсли;
		
		ЭлементСправочника.Записать();
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьЮридическоеЛицо");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;	

КонецФункции

Функция МОП_СоздатьФизическоеЛицо(СтруктураДанных)
	
КонецФункции

Функция МОП_СоздатьПартнера(СсылкаНаКонтрагента)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("Партнеры") Тогда
		СправочникМенеджер = Справочники.Партнеры;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = СсылкаНаКонтрагента.Наименование;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "НаименованиеПолное") И КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "НаименованиеПолное") Тогда
			ЭлементСправочника.НаименованиеПолное = СсылкаНаКонтрагента.НаименованиеПолное;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "ЮрФизЛицо") И КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "ЮрФизЛицо") Тогда
			ЭлементСправочника.ЮрФизЛицо = СсылкаНаКонтрагента.ЮрФизЛицо;
		КонецЕсли;
		
		ЭлементСправочника.Записать();	
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьПартнера");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;	
	
КонецФункции

Функция МОП_СоздатьБанковскийСчетКонтрагента(БИК, НомерСчета, Владелец)
	
	СправочникМенеджер = Неопределено;
	
	Если КНП_ЕстьОбъектМетаданных("БанковскиеСчета") Тогда
		СправочникМенеджер = Справочники.БанковскиеСчета;
	КонецЕсли;
	
	Если КНП_ЕстьОбъектМетаданных("БанковскиеСчетаКонтрагентов") Тогда
		СправочникМенеджер = Справочники.БанковскиеСчетаКонтрагентов;
	КонецЕсли;
	
	Если КНП_ЕстьОбъектМетаданных("БанковскиеИКазначейскиеСчета") Тогда
		СправочникМенеджер = Справочники.БанковскиеИКазначейскиеСчета;
	КонецЕсли;
	
	Если СправочникМенеджер = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка	
		
		ЭлементСправочника = СправочникМенеджер.СоздатьЭлемент();
		ЭлементСправочника.Наименование = НомерСчета;
		ЭлементСправочника.Владелец = Владелец;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "НомерСчета") Тогда
			ЭлементСправочника.НомерСчета = НомерСчета;
		ИначеЕсли КНП_ЕстьСтандартныйРеквизит(ЭлементСправочника, "Код") Тогда
			ЭлементСправочника.Код = НомерСчета;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "Банк") Тогда
			
			ЭлементСправочника.Банк = МОП_ПолучитьБанкПоБИКу(БИК);
			ЭлементСправочника.Наименование = ЭлементСправочника.Наименование + " (" + Строка(ЭлементСправочника.Банк) + ")";
			
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "КассовыйОрган") Тогда
			
			ЭлементСправочника.КассовыйОрган = МОП_ПолучитьБанкПоБИКу(БИК);
			ЭлементСправочника.Наименование = ЭлементСправочника.Наименование + " (" + Строка(ЭлементСправочника.БанкДляРасчетов) + ")";
			
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "ВалютаДенежныхСредств") Тогда
			ЭлементСправочника.ВалютаДенежныхСредств = Справочники.Валюты.НайтиПоНаименованию("руб");
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ЭлементСправочника, "ТипЛицевогоСчета") Тогда
			
			Если КНП_ЕстьОбъектМетаданных("ТипыЛицевыхСчетов") Тогда
				ЭлементСправочника.ТипЛицевогоСчета = ПредопределенноеЗначение("Перечисление.ТипыЛицевыхСчетов.Банковский");	
			КонецЕсли;
			
		КонецЕсли;
		
		ЭлементСправочника.Записать();
		
	Исключение
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "МОП_СоздатьБанковскийСчетКонтрагента");
		Возврат СправочникМенеджер.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат ЭлементСправочника.Ссылка;
	
КонецФункции

Функция МОП_СоздатьВходящийСчетНаОплату()
	
	Если КНП_ЕстьОбъектМетаданных("СчетНаОплатуПоставщика") Тогда
		Возврат Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("СчетНаОплатуОтПоставщика") Тогда
		Возврат Документы.СчетНаОплатуОтПоставщика.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ЗаказПоставщику") Тогда
		Возврат Документы.ЗаказПоставщику.СоздатьДокумент();
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция МОП_СоздатьВходящийАкт()
	
	Если КНП_ЕстьОбъектМетаданных("ПоступлениеУслугПрочихАктивов") Тогда
		ДокОбъект = Документы.ПоступлениеУслугПрочихАктивов.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПриобретениеУслугПрочихАктивов") Тогда
		ДокОбъект = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПриходнаяНакладная") Тогда
		ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПоступлениеТоваровУслуг") Тогда
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПоступлениеУслугРабот") Тогда
		ДокОбъект = Документы.ПоступлениеУслугРабот.СоздатьДокумент();
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат ДокОбъект;

КонецФункции

Функция МОП_СоздатьВходящийНакладная()
	
	Если КНП_ЕстьОбъектМетаданных("ПоступлениеТоваровУслуг") Тогда
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПриобретениеТоваровУслуг") Тогда
		ДокОбъект = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПриходнаяНакладная") Тогда
		ДокОбъект = Документы.ПриходнаяНакладная.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("ПоступлениеМЗ") Тогда
		ДокОбъект = Документы.ПоступлениеМЗ.СоздатьДокумент();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДокОбъект;

КонецФункции

Функция МОП_СоздатьВходящийКорректировка()
	
	ТекКонф = КНП_ИмяКонфигурации();
	
	Если КНП_ЕстьОбъектМетаданных("КорректировкаПоступления") Тогда
		ДокОбъект = Документы.КорректировкаПоступления.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КорректировкаПриобретения") Тогда
		ДокОбъект = Документы.КорректировкаПриобретения.СоздатьДокумент();
	ИначеЕсли КНП_ЕстьОбъектМетаданных("КорректировочныйСчетФактураПолученный") Тогда
		ДокОбъект = Документы.КорректировочныйСчетФактураПолученный.СоздатьДокумент();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДокОбъект;

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//			#КонецОбласти МетаданноОриентированныеПроцедуры  		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////






////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область ИнтеграцияAPI 				 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ИнтеграцияAPI

Процедура API_ПолучитьВерсиюАПИ()
	
	ВерсияAPI = "v1.2";
	ВерсияDiFlow = "6.2";
	Адрес = HostAddress + "/api/info/";
	
	ЗаголовкиЗапроса = Новый Соответствие;
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		Если ТекстJSON.Получить("current_version") <> Неопределено Тогда
			ВерсияAPI = ТекстJSON.Получить("current_version");
		КонецЕсли;
		
		Если ТекстJSON.Получить("diflow_version") <> Неопределено Тогда
			ВерсияDiFlow = ТекстJSON.Получить("diflow_version");	
		КонецЕсли;
		
	Иначе
		ДобавитьВЖурнал("Не удалось прочитать версию API. Используется минимально возможная версия", "API_ПолучитьВерсиюАПИ");	
	КонецЕсли;

КонецПроцедуры

Функция СформироватьЗаголовкиДляАПИ()	
	
	Заголовки = Новый Соответствие;
	
	Заголовки.Вставить("Api-Version", ВерсияAPI);
	
	Если ЗначениеЗаполнено(ТокенАвторизации) Тогда
		Заголовки.Вставить("Api-Token", ТокенАвторизации);	
	КонецЕсли;
	
	Заголовки.Вставить("Content-type", "application/json");
	
	Возврат Заголовки;	

КонецФункции

Функция API_ПолучитьСписокДоступныхСертификатов(СписокСертификатов)
	
	API_ПолучитьВерсиюАПИ();
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	
	СтруктураЗапроса = Новый Структура("thumbprints", СписокСертификатов);
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(СтруктураЗапроса);
	
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "api/security/certificate/status";	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);
	Возврат ТекстJSON;		

КонецФункции

Функция API_АвторизацияПоСертификату(ДанныеАвторизации)
	
	API_ПолучитьВерсиюАПИ();
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(ДанныеАвторизации);
	Адрес = HostAddress + "/api/security/token";	
	
	ПараметрыВозврата = ЭДО_ПолучитьСтруктуруВозвратаАвторизацииССервером();
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		УспехАвторизации = ТекстJSON.Получить("success");
		
		Если УспехАвторизации = Неопределено ИЛИ УспехАвторизации = Ложь Тогда
			
			Если УспехАвторизации = Ложь Тогда
				СообщениеОшибки = ТекстJSON.Получить("codeDescription") + ". Код ошибки: " + ТекстJSON.Получить("code");
			Иначе
				СообщениеОшибки = "Некорректный ответ от сервера!";
			КонецЕсли;
			
			ПараметрыВозврата.ОшибкаАвторизации = Истина;
			ПараметрыВозврата.ТекстОшибки = "Авторизация не удалась: " + СообщениеОшибки;
			Возврат ПараметрыВозврата;
			
		Иначе
			
			ПараметрыВозврата.Вставить("ЗашифрованныйТокен", ТекстJSON.Получить("token").Получить("value") );	
			ВремяПоследнейАвторизации = МестноеВремя(КНП_ПривестиКДате(ТекстJSON.Получить("token").Получить("expireAt") ) ) - 600;
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = ТекстJSON;
		Возврат ПараметрыВозврата;	
		
	КонецЕсли;
	
	ПараметрыВозврата.Login = СокрЛП("");
	ПараметрыВозврата.Password = СокрЛП("");
	ПараметрыВозврата.Cookie = "";
	ПараметрыВозврата.ВремяПоследнейАвторизации = ВремяПоследнейАвторизации;
	
	Возврат ПараметрыВозврата;

КонецФункции

Функция API_АвторизацияПоПаролю(ДанныеАвторизации)
	
	API_ПолучитьВерсиюАПИ();
	ПараметрыВозврата = ЭДО_ПолучитьСтруктуруВозвратаАвторизацииССервером();
	СтрокаLoginа = "";
	СтрокаПароля = "";
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	
	ТелоЗапроса = "";		
	
	Если ДанныеАвторизации.Свойство("Login") И ДанныеАвторизации.Свойство("Password") Тогда
		
		СтрокаLoginа = ДанныеАвторизации.Login;
		СтрокаПароля = ДанныеАвторизации.Password;
		Адрес = HostAddress + "/api/security/token";
		СтруктураТела = Новый Структура("email,password", СтрокаLoginа, СтрокаПароля);
		ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(СтруктураТела);	
		
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		УспехАвторизации = ТекстJSON.Получить("success");
		
		Если УспехАвторизации = Неопределено ИЛИ УспехАвторизации = Ложь Тогда
			
			Если УспехАвторизации = Ложь Тогда
				СообщениеОшибки = ТекстJSON.Получить("codeDescription") + ". Код ошибки: " + ТекстJSON.Получить("code");
			Иначе
				СообщениеОшибки = "Некорректный ответ от сервера!";
			КонецЕсли;
			
			ПараметрыВозврата.ОшибкаАвторизации = Истина;
			ПараметрыВозврата.ТекстОшибки = "Авторизация не удалась: " + СообщениеОшибки;
			Возврат ПараметрыВозврата;
			
		Иначе
			
			ТокенАвторизации = ТекстJSON.Получить("token").Получить("value");	
			ВремяПоследнейАвторизации = МестноеВремя(КНП_ПривестиКДате(ТекстJSON.Получить("token").Получить("expireAt") ) ) - 600;
			
		КонецЕсли;
		
	Иначе
		
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = ТекстJSON;
		Возврат ПараметрыВозврата;
		
	КонецЕсли;
	
	ПараметрыВозврата.Login = СокрЛП(СтрокаLoginа);
	ПараметрыВозврата.Password = СокрЛП(СтрокаПароля);
	ПараметрыВозврата.Cookie = Cookie;
	ПараметрыВозврата.ВремяПоследнейАвторизации = ВремяПоследнейАвторизации;
	
	Возврат ПараметрыВозврата;

КонецФункции

Процедура API_ЗакончитьАвторизацию(ПараметрыВозврата)
	//Changelog
	//
	//18.10.2019 - отключена проверка активности компании в случаях, когда версия ДиФлоу старше 6.2
	API_ПолучитьВерсиюАПИ();
	
	
	ДанныеПользователя = API_ПолучитьТекущегоПользователя();
	
	Если ТипЗнч(ДанныеПользователя) <> Тип("Соответствие") Тогда
		
		ДобавитьВЖурнал("Не удалось авторизоваться. Не удалось получить текущего пользователя", "ОсуществитьСоединениеССервером");
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = "Не удалось авторизоваться";
		Возврат;		
		
	КонецЕсли;
	
	Если ДанныеПользователя.Получить("success") <> Неопределено Тогда
		
		СообщениеОшибки = ДанныеПользователя.Получить("codeDescription") + ". Код ошибки: " + ДанныеПользователя.Получить("code");
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = "Авторизация не удалась: " + СообщениеОшибки;
		Возврат;
		
	КонецЕсли;
	
	Попытка
		
		Если ДанныеПользователя.Получить("certificate") <> Неопределено Тогда
			СертификатПользователя 	= ДанныеПользователя.Получить("certificate")	.Получить("thumbprint");
		КонецЕсли;
		
		ДолжностьПодписанта 	= ДанныеПользователя.Получить("employee")		.Получить("position");
		
		Если НЕ ЗначениеЗаполнено(ДолжностьПодписанта) Тогда
			ДолжностьПодписанта = "";
		КонецЕсли;
		
		ФамилияПодписанта 		= ДанныеПользователя.Получить("person")			.Получить("surname");
		
		Если НЕ ЗначениеЗаполнено(ФамилияПодписанта) Тогда
			ФамилияПодписанта = "";
		КонецЕсли;
		
		ИмяПодписанта 			= ДанныеПользователя.Получить("person")			.Получить("name");
		
		Если НЕ ЗначениеЗаполнено(ИмяПодписанта) Тогда
			ИмяПодписанта = "";
		КонецЕсли;
		
		ОтчествоПодписанта 		= ДанныеПользователя.Получить("person")			.Получить("patronymic");
		
		Если НЕ ЗначениеЗаполнено(ОтчествоПодписанта) Тогда
			ОтчествоПодписанта = "";
		КонецЕсли;
		
		ОГРНИП = "";
		
		Если ДанныеПользователя.Получить("company").Получить("type").Получить("systemName") = "IP" Тогда
			ОГРНИП 					= ДанныеПользователя.Получить("company")	.Получить("ogrn");
		КонецЕсли;
		
		ТипПодписанта 			= ДанныеПользователя.Получить("company")		.Получить("type").Получить("systemName") + "-signor";
		ДанныеПодписанта 		= ДолжностьПодписанта 	+ Символы.ПС 
		+ ФамилияПодписанта 	+ Символы.ПС
		+ ИмяПодписанта 		+ Символы.ПС 
		+ ОтчествоПодписанта 	+ Символы.ПС
		+ ТипПодписанта 		+ Символы.ПС
		+ "3"					+ Символы.ПС
		+ ОГРНИП;
		
	Исключение
		СертификатПользователя = "";	
	КонецПопытки;
	
	
	Если ДанныеПользователя.Получить("company") <> Неопределено Тогда
		ТекстJSON = ДанныеПользователя.Получить("company");
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТекстJSON) Тогда
		ТекстJSON =  API_ПолучитьТекущуюОрганизацию();
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) <> Тип("Соответствие") Тогда
		
		ДобавитьВЖурнал("Не удалось авторизоваться. Не удалось получить текущую организацию", "ОсуществитьСоединениеССервером");
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = "Не удалось авторизоваться";
		Возврат;
		
	КонецЕсли;
	
	Если ТекстJSON.Получить("success") <> Неопределено Тогда
		
		СообщениеОшибки = ТекстJSON.Получить("codeDescription") + ". Код ошибки: " + ТекстJSON.Получить("code");
		ПараметрыВозврата.ОшибкаАвторизации = Истина;
		ПараметрыВозврата.ТекстОшибки = "Авторизация не удалась: " + СообщениеОшибки;
		Возврат;
		
	КонецЕсли;
	
	КомпанияАктивирована = ТекстJSON.Получить("infsoobBeenSent");
	
	Если ВерсияDiFlow <> "6.2" Тогда
		КомпанияАктивирована = Истина;
	КонецЕсли;
	
	ИмяОрганизации = ТекстJSON.Получить("name");
	ИНН = ТекстJSON.Получить("inn");
	КПП = ТекстJSON.Получить("division").Получить("kpp");
	ОГРН  = ТекстJSON.Получить("ogrn");
	Организация = МОП_ПолучитьОрганизацию(ИНН, ОГРН, КПП);	
	ИдентификаторКомпании = ТекстJSON.Получить("division").Получить("id");
	
	Если ДанныеПользователя.Получить("employee") <> Неопределено И ДанныеПользователя.Получить("employee").Получить("defaultDivision") <> Неопределено Тогда
		ИдентификаторПодразделения = ДанныеПользователя.Получить("employee").Получить("defaultDivision").Получить("id");	
	Иначе
		ИдентификаторПодразделения = ИдентификаторКомпании;
	КонецЕсли;
	
	ПараметрыВозврата.ИмяОрганизации = ИмяОрганизации;
	ПараметрыВозврата.ИНН = ИНН;
	ПараметрыВозврата.ОГРН = ОГРН;
	ПараметрыВозврата.КПП = КПП;
	ПараметрыВозврата.HostAddress = HostAddress;
	ПараметрыВозврата.ИдентификаторКомпании = ИдентификаторКомпании;
	ПараметрыВозврата.ТекстJSON = ТекстJSON; 
	ПараметрыВозврата.ИдентификаторПодразделения = ИдентификаторПодразделения;
	ПараметрыВозврата.ТокенАвторизации = ТокенАвторизации;
	ПараметрыВозврата.ВерсияAPI = ВерсияAPI;
	ПараметрыВозврата.ОтпечатокСертификата = СертификатПользователя;
	ПараметрыВозврата.ДанныеПодписанта = ДанныеПодписанта;
	ПараметрыВозврата.КомпанияАктивирована = КомпанияАктивирована
	
КонецПроцедуры

Функция API_ПолучитьТекущуюОрганизацию()
	
	ДобавитьВЖурнал("Получение информации о текущей организации", "ОсуществитьАвторизациюНаСервере");
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "api/current/company";	
	КонецЕсли; 
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	Возврат ТекстJSON;	

КонецФункции

Функция API_ПолучитьТекущегоПользователя()
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "api/current/user";	
	КонецЕсли;	
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	Возврат ТекстJSON;		

КонецФункции

Функция API_ПолучитьСписокБанков(БИКБанка = Неопределено)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	МассивЭлементов = Новый Массив;
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда                                                                                        
		Адрес = HostAddress + "/api/dictionary/bank/" + ?(ЗначениеЗаполнено(БИКБанка), "?bik=" + БИКБанка, "");	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
		ДобавитьВЖурнал("Не удалось получить список банков: " + ТекстJSON, "API_ПолучитьСписокБанков");
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		РезультатЗапроса = ТекстJSON.Получить("success") ;
		
		Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
			ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Массив") Тогда
		МассивЭлементов = ТекстJSON;
	КонецЕсли;
	
	Возврат МассивЭлементов;

КонецФункции

Функция API_ПолучитьСписокКонтрагентов(ПолнаяЗагрузка = Ложь)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	МассивЭлементов = Новый Массив;
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/?limit=1000&offset=";	
	КонецЕсли;	
	
	НачалоОтбора = 0;
	ВыполнятьСбор = Истина;
	
	Пока ВыполнятьСбор Цикл
		
		ТекстJSON = ОбменHTTPJSON(Адрес + КНП_ЧислоВФормате(НачалоОтбора, 0), ЗаголовкиЗапроса);
		
		Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
			
			ДобавитьВЖурнал("Не удалось получить список контрагентов: " + ТекстJSON, "API_ПолучитьСписокКонтрагентов");
			Прервать;
			
		КонецЕсли;
		
		Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
			
			РезультатЗапроса = ТекстJSON.Получить("success") ;
			
			Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
				
				ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;
		
		МассивКонтрагентов = ТекстJSON.Получить("rows");
		
		Если ТипЗнч(МассивКонтрагентов) = Тип("Массив") Тогда
			
			Если МассивКонтрагентов.Количество() = 0 Тогда
				ВыполнятьСбор = Ложь;
			Иначе
				
				Для Каждого ЭлементМассива ИЗ МассивКонтрагентов Цикл
					МассивЭлементов.Добавить(ЭлементМассива);
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			ВыполнятьСбор = Ложь;
		КонецЕсли;
		
		НачалоОтбора = НачалоОтбора + 1000;	
		
	КонецЦикла;
	
	Возврат МассивЭлементов;

КонецФункции

Функция API_ПолучитьСписокЕдиницИзмерения()
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	МассивЭлементов = Новый Массив;
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/dictionary/measurement/";	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
		ДобавитьВЖурнал("Не удалось получить список единиц измерения: " + ТекстJSON, "API_ПолучитьСписокЕдиницИзмерения");
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		РезультатЗапроса = ТекстJSON.Получить("success") ;
		
		Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
			ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Массив") Тогда
		МассивЭлементов = ТекстJSON;
	КонецЕсли;
	
	Возврат МассивЭлементов;

КонецФункции

Функция API_ПолучитьСписокВалют()
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	ТаблицаДанных = СправочникВалюты.Выгрузить();
	ТаблицаДанных.Очистить();
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/dictionary/currency/";	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
		
		ДобавитьВЖурнал("Не удалось получить список валют: " + ТекстJSON, "API_ПолучитьСписокВалют");
		Возврат ТаблицаДанных;	
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		РезультатЗапроса = ТекстJSON.Получить("success") ;
		
		Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
			
			ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
			Возврат ТекстJSON.Получить("codeDescription");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Массив") Тогда
		МассивЭлементов = ТекстJSON;
	Иначе
		МассивЭлементов = Новый Массив;
	КонецЕсли;
	
	КоличествоЭлементов = МассивЭлементов.Количество();
	
	Для ИндексМассива = 0 По КоличествоЭлементов - 1 Цикл
		
		Попытка
			
			ЭлементМассива = МассивЭлементов[ИндексМассива];
			Код 						= ЭлементМассива.Получить("digitalCode");
			КраткоеИмя 					= ЭлементМассива.Получить("letterCode");
			Имя 						= ЭлементМассива.Получить("title");
			ИД 							= ЭлементМассива.Получить("code");
			
			НоваяСтрока 				= ТаблицаДанных.Добавить();
			НоваяСтрока.КодISO 			= Код;
			НоваяСтрока.СокрНазвание 	= КраткоеИмя;
			НоваяСтрока.Название 		= Имя;
			НоваяСтрока.Идентификатор 	= КНП_ЧислоБезГруппВВидеСтроки(ИД);
			НоваяСтрока.Ссылка 			= МОП_ПолучитьВалютуПоКоду(НоваяСтрока.КодISO);	
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ссылка) И СоздаватьСправочникиПоДаннымЭДО Тогда
				НоваяСтрока.Ссылка 		= МОП_СоздатьВалюту(НоваяСтрока.КодISO, НоваяСтрока.Название, НоваяСтрока.СокрНазвание);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "API_ПолучитьСписокВалют");
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;	
	
КонецФункции

Функция API_ПолучитьСписокСтран()
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	ТаблицаДанных = СправочникСтраны.Выгрузить();
	ТаблицаДанных.Очистить();
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/dictionary/country/";	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
		
		ДобавитьВЖурнал("Не удалось получить список стран: " + ТекстJSON, "API_ПолучитьСписокСтран");
		Возврат ТаблицаДанных;	
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда
		
		РезультатЗапроса = ТекстJSON.Получить("success") ;
		
		Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
			
			ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
			Возврат ТекстJSON.Получить("codeDescription");
			
		КонецЕсли;
		
	КонецЕсли;
	
	МассивЭлементов = ТекстJSON;
	КоличествоЭлементов = ТекстJSON.Количество();
	
	Для ИндексМассива = 0 По КоличествоЭлементов - 1 Цикл
		
		Попытка
			
			ЭлементМассива 				= МассивЭлементов[ИндексМассива];
			ИмяСтраны 					= ЭлементМассива.Получить("title");
			ПолноеИмя 					= ЭлементМассива.Получить("fullTitle");
			КодСтраны 					= ЭлементМассива.Получить("code");
			ИДСтраны 					= ЭлементМассива.Получить("id");
			
			НоваяСтрока 				= ТаблицаДанных.Добавить();
			НоваяСтрока.Название 		= ИмяСтраны;
			НоваяСтрока.ПолноеНазвание 	= ПолноеИмя;
			НоваяСтрока.КодСтраны 		= КодСтраны;
			НоваяСтрока.Идентификатор 	= КНП_ЧислоБезГруппВВидеСтроки(ИДСтраны);
			НоваяСтрока.Ссылка 			= МОП_ПолучитьСтрануПоКоду(КодСтраны);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ссылка) И СоздаватьСправочникиПоДаннымЭДО Тогда
				НоваяСтрока.Ссылка 		= МОП_СоздатьСтрану(КодСтраны, НоваяСтрока.ПолноеНазвание, НоваяСтрока.Название);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "API_ПолучитьСписокСтран");
		КонецПопытки;
		
	КонецЦикла;	
	
	Возврат ТаблицаДанных;		

КонецФункции

Функция API_ПолучитьСписокРегионов(БезАвторизации = Ложь)
	
	Если БезАвторизации Тогда
		API_ПолучитьВерсиюАПИ();
	КонецЕсли;
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	ТаблицаДанных = СправочникРегионы.Выгрузить();
	ТаблицаДанных.Очистить();
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/dictionary/region/";	
	КонецЕсли;
	
	ТекстJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ТекстJSON) = Тип("Строка") Тогда
		
		ДобавитьВЖурнал("Не удалось получить список регионов: " + ТекстJSON, "API_ПолучитьСписокРегионов");
		Возврат ТаблицаДанных;	
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Соответствие") Тогда	
		
		РезультатЗапроса = ТекстJSON.Получить("success") ;
		
		Если РезультатЗапроса <> Неопределено И РезультатЗапроса = Ложь Тогда
			
			ВывестиУведомлениеПользователю(ТекстJSON.Получить("codeDescription") + ": " + Адрес);
			Возврат ТекстJSON.Получить("codeDescription");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ТекстJSON) = Тип("Массив") Тогда
		МассивЭлементов = ТекстJSON;
	Иначе
		МассивЭлементов = Новый Массив;
	КонецЕсли;
	
	КоличествоЭлементов = МассивЭлементов.Количество();
	
	Для ИндексМассива = 0 По КоличествоЭлементов - 1 Цикл
		
		Попытка
			
			ЭлементМассива 				= МассивЭлементов[ИндексМассива];
			ИмяРегиона 					= ЭлементМассива.Получить("title");		
			КодРегиона 					= ЭлементМассива.Получить("code");
			ИДРегиона 					= ЭлементМассива.Получить("id");
			
			НомерСимволыСкобки = Найти(ИмяРегиона, "("); 
			
			Если НомерСимволыСкобки > 0 Тогда
				ИмяРегиона = СокрЛП(Лев(ИмяРегиона, НомерСимволыСкобки - 1));	
			КонецЕсли;          
			
			НоваяСтрока 				= ТаблицаДанных.Добавить();
			НоваяСтрока.ИмяРегиона 		= ИмяРегиона;		
			НоваяСтрока.КодРегиона 		= КодРегиона;
			НоваяСтрока.Идентификатор 	= КНП_ЧислоБезГруппВВидеСтроки(ИДРегиона);
			
		Исключение
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "API_ПолучитьСписокРегионов");
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;	

КонецФункции

Функция API_ПолучитьАрхивПакета(ИдентификаторПакета)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = "/api/archive/" + СтрЗаменить(Строка(ИдентификаторПакета), Символы.НПП, "");		
	КонецЕсли;
	
	СтруктураОтвета = ОтправитьGetЗапрос(HostAddress + Адрес, ЗаголовкиЗапроса);	
	
	Попытка
		Возврат СтруктураОтвета.Ответ;
	Исключение
		ВывестиУведомлениеПользователю(ИнформацияОбОшибке().Причина.Описание);	
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

Функция API_СоздатьXMLДокумента(СсылкаНаДокумент, СтруктураЗапроса, УниверсальныйФормат = Ложь)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		
		Если МОП_ЭтоРеализацияТоваров(СсылкаНаДокумент) И НЕ УниверсальныйФормат Тогда
			Адрес = "/api/service/document/create/waybill551";	
		КонецЕсли;
		
		Если (МОП_ЭтоРеализацияТоваров(СсылкаНаДокумент) ИЛИ МОП_ЭтоАктВыполненныхРабот(СсылкаНаДокумент) )
			И УниверсальныйФормат Тогда
			Адрес = "/api/service/document/create/universal_transfer_document_invoice_and_waybill"; // universal_transfer_document_waybill";	
		КонецЕсли;
		
		Если МОП_ЭтоСчетФактура(СсылкаНаДокумент) И УниверсальныйФормат Тогда
			
			Если МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) ) Тогда
				Адрес = "/api/service/document/create/universal_correction_document_invoice_and_waybill";	
			Иначе
				Адрес = "/api/service/document/create/universal_transfer_document_invoice_and_waybill";
			КонецЕсли;
			
		КонецЕсли;
		
		Если МОП_ЭтоСчетФактура(СсылкаНаДокумент) И НЕ УниверсальныйФормат Тогда
			
			Если МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) ) Тогда
				Адрес = "/api/service/document/create/invoice_correction_ucd";		
			Иначе
				Адрес = "/api/service/document/create/invoice_utd";	
			КонецЕсли;
			
		КонецЕсли;
		
		Если МОП_ЭтоСчетНаОплату(СсылкаНаДокумент) Тогда
			Адрес = "/api/service/document/create/bill";
		КонецЕсли;
		
		Если МОП_ЭтоАктВыполненныхРабот(СсылкаНаДокумент) И НЕ УниверсальныйФормат Тогда
			Адрес = "/api/service/document/create/act552";	
		КонецЕсли;
		
		Если МОП_ЭтоКорректировкаРеализации(СсылкаНаДокумент) Тогда
			Адрес = "/api/service/document/create/universal_correction_document_invoice_and_waybill"; //Белов universal_correction_document_waybill";
		КонецЕсли;
		
		//+Макрушин Е. 07.04.2026 #UT10-5800
		Если МОП_ЭтоАктОРасхожденияхПослеПриемки(СсылкаНаДокумент) Тогда
			Адрес = "/api/service/document/create/torg2"; 
		КонецЕсли;		
		//-Макрушин Е. 07.04.2026 #UT10-5800  
		
		//+Белов А. 17.06.2026 #UT10-5921
		Если МОП_ЭтоТранспортнаяНакладная(СсылкаНаДокумент) Тогда
			Адрес = "/api/service/document/create/tn"; 
		КонецЕсли;	
		
		Если МОП_ЭтоЗаказЗаявка(СсылкаНаДокумент) Тогда
			Адрес = "/api/service/document/create/or"; 
		КонецЕсли;	
		//-Белов А. 17.06.2026 #UT10-5921
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(HostAddress + Адрес, ЗаголовкиЗапроса, Истина, СтруктураЗапроса.ТелоЗапроса);	

КонецФункции

Функция API_ОтправитьДокументСПодписью(ТипДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/send/" + ЭДО_ОпределитьТипДокументаДляЭДО(ТипДокумента);
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции

Функция API_ПолучитьСписокПакетов(СтруктураДопПараметров = Неопределено, ЛимитДокументовПриОбновленииСтатусовДокументов = 500)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		
		Адрес = HostAddress + "/api/package/?limit=" + Формат(ЛимитДокументовПриОбновленииСтатусовДокументов, "ЧГ=0");
		
		Если ЗначениеЗаполнено(СтруктураДопПараметров) Тогда
			
			Для Каждого Элемент Из СтруктураДопПараметров Цикл
				
				Адрес = Адрес + "&";
				Адрес = Адрес + Элемент.Ключ + "=" + Элемент.Значение;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);	
	
КонецФункции

Функция API_ПолучитьСписокДокументовКПодписанию()	
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/document/for_signing";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);	

КонецФункции

Функция API_ПолучитьДанныеПакета(ИдентификаторПакета)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/package/" + Формат(ИдентификаторПакета,"ЧГ=") + "/content";	
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);		

КонецФункции

Функция API_ПодписатьСлужебныйДокумент(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/signing/" + Формат(ИдентификаторДокумента,"ЧГ=");
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);	

КонецФункции

Функция API_ПолучитьДанныеДокумента(ИдентификаторДокумента)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/document/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/content";	
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Контент,Подпись");
	ДанныеJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ДанныеJSON) = Тип("Соответствие") Тогда
		
		Если ДанныеJSON.Получить("success") <> Неопределено И ДанныеJSON.Получить("success") Тогда
			
			СтруктураВозврата.Контент = ДанныеJSON.Получить("content");
			СтруктураВозврата.Подпись = ДанныеJSON.Получить("signature");
			
		Иначе
			Возврат СтруктураВозврата;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;		

КонецФункции

Функция API_ПолучитьДанныеДокументаJSON(ИдентификаторДокумента)
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/document/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/json";	
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Контент");
	ДанныеJSON = ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);
	
	Если ТипЗнч(ДанныеJSON) = Тип("Соответствие") Тогда
		
		Если ДанныеJSON.Получить("success") <> Неопределено И ДанныеJSON.Получить("success") Тогда
			СтруктураВозврата.Контент = ДанныеJSON;
		Иначе
			Возврат СтруктураВозврата;
		КонецЕсли;
		
	КонецЕсли;

	Возврат СтруктураВозврата;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

Функция API_СоздатьКвитанциюОПриеме(ИдентификаторДокумента, ТелоЗапроса, ТипДокумента = "")
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		
		Если ВерсияDiFlow = "6.0" ИЛИ НЕ Найти(ТипДокумента, "передаточ") Тогда
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/accept";
		Иначе
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/accept820";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);

КонецФункции

Функция API_СоздатьКвитанциюОбОтклонении(ИдентификаторДокумента, Тип, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" Тогда
		
		Если Найти(Тип, "УПД") ИЛИ Найти(Тип, "УКД") ИЛИ Найти(Тип, "СЧФ") ИЛИ Найти(НРег(Тип), "счет-фактура") Тогда
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/uvutoch";	
		Иначе
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/decline";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВерсияAPI = "v1.3" Тогда
		
		Если Найти(Тип, "передаточ") ИЛИ Найти(Тип, "корректиров") ИЛИ Найти(Тип, "СЧФ") ИЛИ Найти(НРег(Тип), "счет-фактура") ИЛИ Найти(НРег(Тип), "акт") 
			ИЛИ Найти(НРег(Тип), "накладная") Тогда
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/uvutoch";	
		Иначе
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/decline";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);	

КонецФункции

Функция API_ПринятьДокумент(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/accept";
	КонецЕсли;
	
	Возврат	ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);

КонецФункции

Функция API_ОтклонитьДокумент(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.2" ИЛИ ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/decline";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции

// Методы_API_V_1_3

Функция API_МассовыйПоискПоИНН(МассивИНН)
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		
		Адрес = HostAddress + "/api/contractor/find?limit=5000";
		Итератор = 0;
		
		Для Каждого ИНН Из МассивИНН Цикл
			
			Адрес = Адрес + "&innOneOf[" + Итератор + "]=" + ИНН;
			Итератор = Итератор + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);	

КонецФункции

Функция API_Регистрация(ТелоЗапроса)
	
	API_ПолучитьВерсиюАПИ();
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/registration/certificate";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);

КонецФункции

Функция API_ПолучитьИнфоСообщение()
	//Changelog
	//
	//18.10.2019 - добавлен обход запроса с учетом версии дифлоу > 6.2
	
	API_ПолучитьВерсиюАПИ();
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/information_message/";
	КонецЕсли;
	
	Если ВерсияDiFlow <> "6.2" Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);

КонецФункции

Функция API_МассовоеСозданиеДокументов(ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/bulk/send";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);

КонецФункции

Функция API_МассовоеПодписаниеДокументов(ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/bulk/signing";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);	

КонецФункции

Функция API_ПоискКонтрагентаПоИНН(ИННКонтрагента)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/find?innOneOf[0]=" + ИННКонтрагента;
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);	

КонецФункции

Функция API_ПолучитьКонтрагентаПоИД(ИДКонтрагента) 
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/division/" + ИДКонтрагента;
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса);	

КонецФункции

Функция API_АктивироватьКонтрагента(ИдентификаторКонтрагента)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/relation/" + КНП_ЧислоБезГруппВВидеСтроки(ИдентификаторКонтрагента) + "/activate";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина);		

КонецФункции

Функция API_ДеактивироватьКонтрагента(ИдентификаторКонтрагента)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/relation/" + КНП_ЧислоБезГруппВВидеСтроки(ИдентификаторКонтрагента) + "/deactivate";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина);	

КонецФункции

Функция API_СоздатьЗапросНаОбменСКонтрагентом(ИдентификаторКонтрагента)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/contractor/relation/create/" + КНП_ЧислоБезГруппВВидеСтроки(ИдентификаторКонтрагента);
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина);	

КонецФункции

Функция API_ОтправитьНеформализованныйДокумент(ТелоЗапроса, Двухсторонний = Ложь)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/send/" + ?(Двухсторонний, "unformalized_bilateral", "unformalized_unilateral");
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции


Функция API_СоздатьАннулированиеДокумента(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		
		Если ВерсияDiFlow = "6.0" Тогда
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/annul";
		Иначе 
			Адрес = HostAddress + "/api/service/receipt/create/" + Формат(ИдентификаторДокумента,"ЧГ=") + "/dp_prannul";
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);

КонецФункции

Функция API_АннулироватьДокумент(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/annul/" + КНП_ЧислоВФормате(ИдентификаторДокумента, 0);
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции

Функция API_ПринятьАннулирование(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/annul/" + КНП_ЧислоВФормате(ИдентификаторДокумента, 0) + "/accept";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции

Функция API_ОтклонитьАннулирование(ИдентификаторДокумента, ТелоЗапроса)
	
	ЗаголовкиЗапроса = СформироватьЗаголовкиДляАПИ();
	Адрес = "";
	
	Если ВерсияAPI = "v1.3" Тогда
		Адрес = HostAddress + "/api/flow/annul/" + КНП_ЧислоВФормате(ИдентификаторДокумента, 0) + "/decline";
	КонецЕсли;
	
	Возврат ОбменHTTPJSON(Адрес, ЗаголовкиЗапроса, Истина, ТелоЗапроса);		

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти ИнтеграцияAPI 				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////






////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#Область ФорматыОписанияДанных 				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ФорматыОписанияДанных

// Функция - Прочитать формат описания документа
//
// Параметры:
//  ИмяФОД	 - Строка	 - Имя макета с форматом описания документа
// 
// Возвращаемое значение:
// Структура  - Структура, полученная при использовании ФОД
//
Функция ФОД_ПрочитатьФорматОписанияДокумента(ИмяФОД)
	
	Макет = ПолучитьМакет(ИмяФОД);
	СтрокаJSON = Макет.ПолучитьТекст();
	ОбъектФОД = КНП_ПрочитатьJSONОтСервера(СтрокаJSON);
	
	Если ТипЗнч(ОбъектФОД) = Тип("Соответствие") Тогда
		ОбъектФОД = КНП_ПолучитьСтруктуруИзСоответствия(ОбъектФОД);
	КонецЕсли;
	
	Возврат ОбъектФОД;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_ТоварнаяНакладная()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_ТоварнаяНакладная_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_СчетНаОплату()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_СчетНаОплату_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Акт()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Акт_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УПДДОП()
	
	Если ВерсияСервера = 6 Тогда
		
		Если ВерсияDiFlow = "6.2" Тогда
			Возврат "ФОД_УПДДОП_60";	
		Иначе
			Возврат "ФОД_УПДДОП_63";
		КонецЕсли;
		
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УПД()
	
	Если ВерсияСервера = 6 Тогда
		
		Если ВерсияDiFlow = "6.2" Тогда
			Возврат "ФОД_УПД_60";	
		Иначе
			Возврат "ФОД_УПД_63";
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УПДСЧФ()
	
	Если ВерсияСервера = 6 Тогда
		
		Если ВерсияDiFlow = "6.2" Тогда
			Возврат "ФОД_УПДСЧФ_60";	
		Иначе
			Возврат "ФОД_УПДСЧФ_63";
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УКД()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_УКД_611";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УКДДИС()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_УКДДИС_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_УКДСЧФ()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_УКДСЧФ_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Принять_УПД()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Принять_УПД_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Принять_УКД()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Принять_УКД_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Принять_ТоварнаяНакладная()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Принять_ТоварнаяНакладная_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Принять_Акт()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Принять_Акт_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Отклонить_ТоварнаяНакладная()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Отклонить_Накладная_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Отклонить_Акт()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Отклонить_Акт_60";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Отклонить_УПД()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Отклонить_УПД_60";
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Отклонить_УКД()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Отклонить_УКД_60";
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Регистрация()
	
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Регистрация_60";
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Аннулирование()
	
	Если ВерсияСервера = 6 Тогда
		
		Если ВерсияDiFlow = "6.0" Тогда
			Возврат "ФОД_Аннулирование";
		Иначе
			Возврат "ФОД_Аннулирование_63";
		КонецЕсли;
		
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Принять_УПД820() 
	
	Если ВерсияDiFlow <> "6.0" Тогда
		Возврат "ФОД_Принять_УПД_63";
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьИмяМакета_Торг2()
	
	//+Макрушин Е. 07.04.2026 #UT10-5800
	Если ВерсияСервера = 6 Тогда
		Возврат "ФОД_Торг2";
	КонецЕсли;
	//-Макрушин Е. 07.04.2026 #UT10-5800
	
КонецФункции 

Функция ФОД_ПолучитьИмяМакета_ТранспортнаяНакладная()
	
	//+Белов А. 17.06.2026 #UT10-5921
	Если ВерсияСервера = 6 Тогда
		Возврат "ТранспортнаяНакладная";
	КонецЕсли;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции

Функция ФОД_ПолучитьИмяМакета_ЗаказЗаявка()
	
	//+Белов А. 17.06.2026 #UT10-5921
	Если ВерсияСервера = 6 Тогда
		Возврат "ЗаказЗаявка";
	КонецЕсли;
	//-Белов А. 17.06.2026 #UT10-5921
	
КонецФункции

Функция ФОД_ПолучитьНомерСтрокиТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат КНП_ЧислоВФормате(ОбъектЗаполнения.НомерСтроки, 0);
	
КонецФункции

Функция ФОД_ПолучитьНомерСтрокиТовараИзУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	НомерСтрокиВУПД = КНП_ЧислоВФормате(ОбъектЗаполнения.НомерСтроки, 0);
	
	Возврат НомерСтрокиВУПД;
	
КонецФункции

Функция ФОД_ПолучитьКорректируемыеДокументы(Знач ОбъектЗаполнения)
	
	МассивСтруктур = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		
		ДобавитьВЖурнал("Не определен объект заполнения!", "ФОД_ПолучитьКорректируемыеДокументы");
		Возврат МассивСтруктур;
		
	КонецЕсли;
	
	ДокументКоррекции = ФОД_ПолучитьКорректируемыйДокумент(ОбъектЗаполнения);
	
	Если ДокументКоррекции = Неопределено Тогда
		Возврат Новый Структура("Номер,Дата", "", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументКоррекции.Номер) И ЗначениеЗаполнено(ДокументКоррекции.Дата) Тогда
		МассивСтруктур.Добавить(ДокументКоррекции);
	КонецЕсли;
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ФОД_ПолучитьПредставлениеДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Представление = "";
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Наименование") Тогда
			Представление = ОбъектЗаполнения.Наименование;
		КонецЕсли;
		
	Иначе //Это объект
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Наименование") Тогда
			Представление = ОбъектЗаполнения.Наименование;
		Иначе
			Представление = Строка(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ФОД_ПолучитьКорректируемыеСЧФ(Знач ОбъектЗаполнения)
	
	МассивСтруктур = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		
		ДобавитьВЖурнал("Не определен объект заполнения!", "ФОД_ПолучитьКорректируемыеСЧФ");
		Возврат МассивСтруктур;
		
	КонецЕсли;
	
	ДокументСЧФ = ФОД_ПолучитьКорректируемуюСчетФактуру(ОбъектЗаполнения);
	
	Если ДокументСЧФ = Неопределено Тогда
		Возврат Новый Структура("Номер,Дата", "", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Константы.УказыватьПервичныйСчетФактуруВОснованииКоррСчФ.Получить()) 
		И ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный")
		И ОбъектЗаполнения.ДокументыОснования.Количество() > 0
		И ЗначениеЗаполнено(ОбъектЗаполнения.ДокументыОснования[0].НомерИсходногоДокумента) Тогда
		МассивСтруктур.Добавить(Новый Структура("Номер,Дата", ОбъектЗаполнения.ДокументыОснования[0].НомерИсходногоДокумента, 
		           ОбъектЗаполнения.ДокументыОснования[0].ДатаИсходногоДокумента));	
	Иначе

		Если ЗначениеЗаполнено(ДокументСЧФ.Номер) И ЗначениеЗаполнено(ДокументСЧФ.Дата) Тогда
			МассивСтруктур.Добавить(ДокументСЧФ);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ФОД_ПолучитьПродавцаДокумента(Знач ОбъектЗаполнения)
	
	ЕстьРеквизитОрганизации = КНП_ЕстьРеквизит(ОбъектЗаполнения, "Организация");
	
	Если ЕстьРеквизитОрганизации Тогда
		Результат = ОбъектЗаполнения.Организация;
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции

Функция ФОД_ПолучитьОснованиеПолномочий(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если Строка(ФОД_ПолучитьСтатусПодписанта(ВерсияЗаполнения, ОбъектЗаполнения) ) = "4" Тогда
		Возврат "Индивидуальный предприниматель";
	Иначе
		Возврат "Должностные обязанности сотрудника";
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСуммуТовараПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле < ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСуммуТовараРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

// Процедура осуществляет анализ формата описания документа и выполняет заполнение процедуры с помощью обработчиков
//
// Параметры:
//  СтруктураДанных	 - Структура	 - Заполняемая структура данных
//  ВерсияЗаполнения - Строка	 - Версия формата документа
//  ОбъектЗаполнения - ЛюбаяСсылка	 - Ссылка на справочник, документ или другой тип метаданных, который будет использоваться для получения значений
//
Функция ФОД_ЗаполнитьСтруктуру(СтруктураДанных, ВерсияЗаполнения, Знач ОбъектЗаполнения, Знач Обязательный = Ложь, Документ = Неопределено)
	
	ПризнакОтсутствияДанных = Истина;
	Обязательный = СтруктураДанных.Свойство("__required");
	
	Если СтруктураДанных.Свойство("__object") И ЗначениеЗаполнено(СтруктураДанных.__object) Тогда
		
		Если Найти(СтруктураДанных.__object, "()") Тогда
			
			Попытка
				
				ДобавитьВЖурнал("Вызов функции " + СтруктураДанных.__object + ". ОбъектЗаполнения = " + Строка(ОбъектЗаполнения), "ФОД_ЗаполнитьСтруктуру");

				Если СтруктураДанных.__object = "ФОД_ПолучитьАдресКомпании()" ИЛИ СтруктураДанных.__object = "ФОД_ПолучитьАдресПокупателя()"  Тогда
					Выполнить("ОбъектЗаполнения = " + СтрЗаменить(СтруктураДанных.__object, "()", "(ОбъектЗаполнения, Документ)") );
					
				//+Макрушин Е. 07.04.2026 #UT10-5800
				ИначеЕсли СтруктураДанных.__object = "ФОД_ПолучитьАдресСклада()" Тогда
					Выполнить("ОбъектЗаполнения = " + СтрЗаменить(СтруктураДанных.__object, "()", "(ОбъектЗаполнения, Документ)") );
				//-Макрушин Е. 07.04.2026 #UT10-5800
	
				Иначе
					Выполнить("ОбъектЗаполнения = " + СтрЗаменить(СтруктураДанных.__object, "()", "(ОбъектЗаполнения)") );
				КонецЕсли;
				
				ДобавитьВЖурнал("Завершена работа функции " + СтруктураДанных.__object + ". Результат = " + ОбъектЗаполнения, "ФОД_ЗаполнитьСтруктуру");
				
			Исключение
				
				ДобавитьВЖурнал(ОписаниеОшибки(), "ФОД_ЗаполнитьСтруктуру: " + СтруктураДанных.__object + "()");
				ВывестиУведомлениеПользователю("Ошибка при работе метода " + СтруктураДанных.__object);
				Возврат НЕ ПризнакОтсутствияДанных;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектЗаполнения = Неопределено И Обязательный Тогда
		ВывестиУведомлениеПользователю("Некорректная реализация метода " + СтруктураДанных.__object);
	ИначеЕсли ОбъектЗаполнения = Неопределено И НЕ Обязательный Тогда
		Возврат Ложь;	
	Иначе
		
		ТаблицаКлючейЗначений = КНП_ПолучитьСортированнуюТаблицуКлючейЗначений(СтруктураДанных);
		
		Для Каждого ЭлементСтруктуры Из ТаблицаКлючейЗначений Цикл
			
			Если Найти(ЭлементСтруктуры.Ключ, "__") Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Структура") Тогда
				
				Если НЕ ФОД_ЗаполнитьСтруктуру(ЭлементСтруктуры.Значение, ВерсияЗаполнения, ОбъектЗаполнения, Обязательный, Документ) Тогда
					СтруктураДанных.Удалить(ЭлементСтруктуры.Ключ);	
				КонецЕсли;
				
			КонецЕсли;
			
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Массив") Тогда
				ФОД_ЗаполнитьМассив(ЭлементСтруктуры.Значение, ВерсияЗаполнения, ОбъектЗаполнения);	
			КонецЕсли;
			
			Если ТипЗнч(ЭлементСтруктуры.Значение) = Тип("Строка") Тогда
				
				Если Найти(ЭлементСтруктуры.Значение, "()") Тогда
					
					Попытка
						
						ДобавитьВЖурнал("Вызов функции " + ЭлементСтруктуры.Значение + ". ОбъектЗаполнения = " + Строка(ОбъектЗаполнения), "ФОД_ЗаполнитьСтруктуру");
						
						Если ЭлементСтруктуры.Значение = "ФОД_ПолучитьКППКомпании()" ИЛИ ЭлементСтруктуры.Значение = "ФОД_ПолучитьТелефонКомпанииПеревозчика()" Тогда
							Выполнить("СтруктураДанных." + ЭлементСтруктуры.Ключ + " = КНП_Формат(" + СтрЗаменить(ЭлементСтруктуры.Значение, "()", "(ВерсияЗаполнения, ОбъектЗаполнения, Документ)") + ", ЭлементСтруктуры.Ключ)" );
						Иначе
							Выполнить("СтруктураДанных." + ЭлементСтруктуры.Ключ + " = КНП_Формат(" + СтрЗаменить(ЭлементСтруктуры.Значение, "()", "(ВерсияЗаполнения, ОбъектЗаполнения)") + ", ЭлементСтруктуры.Ключ)" );
						КонецЕсли;
						
						ДобавитьВЖурнал("Завершена работа функции " + ЭлементСтруктуры.Значение, "ФОД_ЗаполнитьСтруктуру");
						
					Исключение
						ВывестиУведомлениеПользователю("Ошибка при работе метода " + ЭлементСтруктуры.Значение);
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("__object") Тогда
		СтруктураДанных.Удалить("__object");
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("__version") Тогда
		СтруктураДанных.Удалить("__version");
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("__required") Тогда
		СтруктураДанных.Удалить("__required");
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из СтруктураДанных Цикл
		
		Если ЗначениеЗаполнено(ЭлементСтруктуры.Значение) ИЛИ Обязательный Тогда
			
			ПризнакОтсутствияДанных = Ложь;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ФОД_ПреобразоватьВсеВСтроку(СтруктураДанных);
	Возврат НЕ ПризнакОтсутствияДанных;

КонецФункции

// Процедура - Заполнить массив
//
// Параметры:
//  Массив			 - Массив	 - Массив элементов
//  ВерсияЗаполнения - Строка	 - Версия формата документа
//  ОбъектЗаполнения - ЛюбаяСсылка	 - Ссылка на справочник, документ или другой тип метаданных, который будет использоваться для получения значений
//
Процедура ФОД_ЗаполнитьМассив(Массив, ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	СтруктураТипаДанных = Неопределено;
	
	Если Массив.Количество() > 0 Тогда
		СтруктураТипаДанных = КНП_СкопироватьСтруктуру(Массив[0]);		
	КонецЕсли;
	
	Если СтруктураТипаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураТипаДанных.Свойство("__object") Тогда 
		
		Попытка
			
			ДобавитьВЖурнал("Вызов функции " + СтруктураТипаДанных.__object + ". ОбъектЗаполнения = " + Строка(ОбъектЗаполнения), "ФОД_ЗаполнитьМассив");
			Выполнить("ОбъектЗаполнения = " + СтрЗаменить(СтруктураТипаДанных.__object, "()", "(ОбъектЗаполнения)") );
			ДобавитьВЖурнал("Завершена работа функции " + СтруктураТипаДанных.__object + ". Результат = " + ОбъектЗаполнения, "ФОД_ЗаполнитьМассив");
			
			Если ОбъектЗаполнения = Неопределено Тогда
				
				ВывестиУведомлениеПользователю("Некорректная реализация метода " + СтруктураТипаДанных.__object);
				Возврат;
				
			КонецЕсли;
			
		Исключение
			
			ДобавитьВЖурнал(ОписаниеОшибки(), "ФОД_ЗаполнитьМассив: " + СтруктураТипаДанных.__object);
			ВывестиУведомлениеПользователю("Ошибка при работе метода " + СтруктураТипаДанных.__object);
			Возврат;
			
		КонецПопытки;
		
	Иначе

		Если НЕ СтруктураТипаДанных.Свойство("measurementCode") И НЕ СтруктураТипаДанных.Свойство("trackings") Тогда
			ВывестиУведомлениеПользователю("Не определен тип объекта в массиве! Ошибка формата данных");
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	Массив.Очистить();
	
	Если ОбъектЗаполнения.Количество() = 0 Тогда
		ДобавитьВЖурнал("Не удалось заполнить массив в методе " + СтруктураТипаДанных.__object, "ФОД_ЗаполнитьМассив");
	КонецЕсли;
	
	//Для ОбъектЗаполнения должен быть доступен обход коллекции. Это может быть ТабличнаяЧасть, Массив объектов
	//+Гавриленков В. 25.02.2026 #UT10-5710
	//Для Каждого ЭлементДанных Из ОбъектЗаполнения Цикл
	//	
	//	СтруктураЭлементаМассива = КНП_СкопироватьСтруктуру(СтруктураТипаДанных);
	//	СтруктураЭлементаМассива.Удалить("__object");
	//	ФОД_ЗаполнитьСтруктуру(СтруктураЭлементаМассива, ВерсияЗаполнения, ЭлементДанных);
	//	ФОД_ПреобразоватьВсеВСтроку(СтруктураЭлементаМассива);
	//	Массив.Добавить(СтруктураЭлементаМассива);
	//	
	//КонецЦикла;
	сч = 0;
	МассивinfoFieldsБаза = Неопределено;
	Для Каждого ЭлементДанных Из ОбъектЗаполнения Цикл
		
		Если СтруктураТипаДанных.Свойство("infoFields") 
			//+Макрушин Е. 09.04.2026 #UT10-5800
			И ЗначениеЗаполнено(СтруктураТипаДанных.infoFields) Тогда
			//-Макрушин Е. 09.04.2026 #UT10-5800 
			 
			Если сч = 0 Тогда
				МассивinfoFieldsБаза = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(СтруктураТипаДанных.infoFields);
			Иначе
				СтруктураТипаДанных.infoFields = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(МассивinfoFieldsБаза);
			КонецЕсли;
			
		КонецЕсли;
		сч = сч + 1;
		
		СтруктураЭлементаМассива = КНП_СкопироватьСтруктуру(СтруктураТипаДанных);
		СтруктураЭлементаМассива.Удалить("__object");
		ФОД_ЗаполнитьСтруктуру(СтруктураЭлементаМассива, ВерсияЗаполнения, ЭлементДанных);
		ФОД_ПреобразоватьВсеВСтроку(СтруктураЭлементаМассива);
		Массив.Добавить(СтруктураЭлементаМассива);
		
	КонецЦикла;
	//-Гавриленков В. 25.02.2026 #UT10-5710

КонецПроцедуры

Процедура ФОД_ПреобразоватьВсеВСтроку(СтруктураДанных)  
	
	Для Каждого ЭлементДанных Из СтруктураДанных Цикл
		
		Если ТипЗнч(ЭлементДанных.Значение) = Тип("Строка") И Найти(ЭлементДанных.Значение, "()") Тогда
			Выполнить("СтруктураДанных." + ЭлементДанных.Ключ + " = """"");
		ИначеЕсли НЕ ФОД_ЭтоСтрогоЧисло(ЭлементДанных.Ключ) И ТипЗнч(ЭлементДанных.Значение) = Тип("Число") Тогда
			
			Если ФОД_ЭтоКонвертацияБезНулей(ЭлементДанных.Ключ) Тогда
				Выполнить("СтруктураДанных." + ЭлементДанных.Ключ + " = Строка(ЭлементДанных.Значение)");	
			Иначе
				Выполнить("СтруктураДанных." + ЭлементДанных.Ключ + " = КНП_ФорматСумм(ЭлементДанных.Значение)");
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;

КонецПроцедуры

Функция ФОД_ЭтоСтрогоЧисло(ИмяКлюча)
	
	Если 
		ИмяКлюча = "sender"
		ИЛИ
		ИмяКлюча = "seller"
		ИЛИ
		ИмяКлюча = "receiver"
		ИЛИ
		ИмяКлюча = "buyer"
		ИЛИ
		ИмяКлюча = "status"
		ИЛИ
		ИмяКлюча = "duty"
		ИЛИ
		ИмяКлюча = "executor"
		ИЛИ
		ИмяКлюча = "customer"
		ИЛИ
		ИмяКлюча = "from"
		ИЛИ
		ИмяКлюча = "to"  
		//+Белов А. 22.06.2026 #UT10-5921
		ИЛИ
		ИмяКлюча = "carrier"
		ИЛИ
		ИмяКлюча = "timeZone" 
		ИЛИ
		ИмяКлюча = "id"
		//-Белов А. 22.06.2026 #UT10-5921
		Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ФОД_ЭтоКонвертацияБезНулей(ИмяКлюча)
	
	Если 
		ИмяКлюча = "regionCode"  
		//+Белов А. 22.06.2026 #UT10-5921
		ИЛИ
		ИмяКлюча = "placesCount"
		ИЛИ
		ИмяКлюча = "pointNumber"
		ИЛИ ИмяКлюча = "placesNumber"
		//-Белов А. 22.06.2026 #UT10-5921
		Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;	

КонецФункции


////////////////////////////////////////////////////////////////////////////////////////
//		Область хранит реализацию всех обработчиков, описанных в формате ФОД

Функция ФОД_ПолучитьВалютуДокумента(Знач ОбъектЗаполнения)
	
	//Changelog
	//
	//12.12.2019 - определяется что нужно рассчитывать в валюте.
	Если КонвертацияВалютПоКурсуДокумента Тогда
		Валюта = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения);	
	Иначе
		Валюта = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения);
	КонецЕсли;
	
	Возврат Валюта;

КонецФункции

Функция ФОД_ПолучитьЕдиницуИзмеренияТовара(Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Упаковка") И ЗначениеЗаполнено(ОбъектЗаполнения.Упаковка) Тогда
		Возврат ОбъектЗаполнения.Упаковка;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ОбъектЗаполнения.ЕдиницаИзмерения) Тогда
		Возврат ОбъектЗаполнения.ЕдиницаИзмерения;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура) Тогда
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "ЕдиницаИзмерения") Тогда
			Возврат ОбъектЗаполнения.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "БазоваяЕдиницаИзмерения") Тогда
			Возврат ОбъектЗаполнения.Номенклатура.БазоваяЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Код,Наименование,Ссылка",Неопределено, Неопределено, ОбъектЗаполнения.Ссылка);

КонецФункции

Функция ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.Товары;	
	
КонецФункции

Функция ФОД_ПолучитьНаименованиеСтраныПроисхождения(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если НомерГТДЗаполнен(ОбъектЗаполнения) Тогда
		Возврат ОбъектЗаполнения.СерияНоменклатуры.СтранаПроисхождения.Наименование;	
	КонецЕсли;
	
	Возврат "-";
	
КонецФункции


Функция ФОД_ПолучитьКодСтраныПроисхождения(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если НомерГТДЗаполнен(ОбъектЗаполнения) Тогда
		Возврат СокрЛП(ОбъектЗаполнения.СерияНоменклатуры.СтранаПроисхождения.Код);	
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ФОД_ПолучитьНомерГТД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если НомерГТДЗаполнен(ОбъектЗаполнения) Тогда
		Возврат Лев(СокрЛП(ОбъектЗаполнения.СерияНоменклатуры.НомерГТД.Код), 29);	
	КонецЕсли;
	
	Возврат "";
	
КонецФункции   

Функция НомерГТДЗаполнен(ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СерияНоменклатуры") 
		И ЗначениеЗаполнено(ОбъектЗаполнения.СерияНоменклатуры.НомерГТД) 
		И СтрДлина(Лев(СокрЛП(ОбъектЗаполнения.СерияНоменклатуры.НомерГТД.Код), 29)) >= 10
		И ЗначениеЗаполнено(ОбъектЗаполнения.СерияНоменклатуры.СтранаПроисхождения)
		И СтрДлина(СокрЛП(ОбъектЗаполнения.СерияНоменклатуры.СтранаПроисхождения.Код)) >= 3
		И Найти(ОбъектЗаполнения.СерияНоменклатуры.СтранаПроисхождения.Код, "-") = 0 Тогда
		Возврат Истина;	
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции

Функция ФОД_ПолучитьСтрокуАналитикиДокументаОснования(Номенклатура,		ВидыЗапасов)
	
	СтрокаАналитики = Неопределено;
	
	Для каждого стр из ВидыЗапасов Цикл
		
		Если Стр. АналитикаУчетаНоменклатуры.Номенклатура = Номенклатура Тогда
			
			СтрокаАналитики = Стр;
			Прервать;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	Возврат СтрокаАналитики;

КонецФункции


Функция ФОД_ПолучитьНомерГТДИзУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	НомерГТДВУПД = "";
	
	Если ЗначениеЗаполнено(ОбъектЗаполнения.Ссылка.ДокументОснование) Тогда
		
		СтрокаДокументаОснования = ФОД_ПолучитьСтрокуАналитикиДокументаОснования (ОбъектЗаполнения.Номенклатура,ОбъектЗаполнения.Ссылка.ДокументОснование.ВидыЗапасов); 
		
		Если СтрокаДокументаОснования <> Неопределено И ЗначениеЗаполнено(СтрокаДокументаОснования.НомерГТД)  Тогда
			НомерГТДВУПД = Лев(СокрЛП(СтрокаДокументаОснования.НомерГТД.Код), 29);	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НомерГТДВУПД;

КонецФункции


Функция ФОД_ПолучитьТовар(Знач ОбъектЗаполнения, Знач Вложенный = Ложь)
	
	МассивСтруктур = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		
		ДобавитьВЖурнал("Не определен объект заполнения!", "ПолучитьТовар");
		Возврат МассивСтруктур;
		
	КонецЕсли;
	
	Если МОП_ЭтоРеализацияТоваров(ОбъектЗаполнения) ИЛИ МОП_ЭтоСчетНаОплату(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Товары") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Товары""", "ПолучитьТовар");
			
			ТабЧасть = ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения);
			
			//+Белов А. 17.02.2026 #UT10-5696			
			Если Константы.ЭДО_ВыгружатьКодыМаркировки.Получить() 
				И ОбъектЗаполнения.Метаданные().Имя = "РеализацияТоваровУслуг"
				//+Белов А. 03.03.2026 #UT10-5730
				И Перечисления.УсловияРаботыСЧЗ.УсловиеВыгрузкиЧЗВЭДО(ОбъектЗаполнения.ДоговорКонтрагента.УсловияРаботыСЧЗ) Тогда  
				//-Белов А. 03.03.2026 #UT10-5730
				БуферКодовМаркировкиТоваров = Справочники.ШтрихкодыНоменклатуры.ПолучитьКодыМаркировкиПоДокументу(ОбъектЗаполнения);
			Иначе
				БуферКодовМаркировкиТоваров.Очистить();
			КонецЕсли; 
			//-Белов А. 17.02.2026 #UT10-5696
			
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ТабЧасть);
			
			//+Белов А. 17.02.2026 #UT10-5706                            
			МассивКолонокИсключения = Новый Массив; 
			МассивКолонокИсключения.Добавить("НомерСтроки");
			МассивКолонокИсключения.Добавить("Назначение");
			МассивКолонокИсключения.Добавить("КлючСтроки");
			МассивКолонокИсключения.Добавить("КлючСвязи");       
			МассивКолонокИсключения.Добавить("Комментарий");       
			
			МассивКолонокСуммирования = Новый Массив;
			МассивКолонокСуммирования.Добавить("Количество");
			МассивКолонокСуммирования.Добавить("КоличествоМест");
			МассивКолонокСуммирования.Добавить("Сумма");
			МассивКолонокСуммирования.Добавить("СуммаНДС");
			
			ТабЧастьСвернутая = ТабЧасть.Выгрузить();
			СтруктураКолонок = КолонкиВСтроку(ТабЧастьСвернутая, МассивКолонокИсключения, МассивКолонокСуммирования);
			ТабЧастьСвернутая.Свернуть(СтруктураКолонок.КолонкиГруппировки, СтруктураКолонок.КолонкиСуммирования);
			//-Белов А. 17.02.2026 #UT10-5706
			
			Для Каждого Товар Из ТабЧастьСвернутая Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;   
		
		//+Гавриленков В. 15.11.2024 #UT10-4901
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Услуги""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Услуги);
			
			Для Каждого Услуга Из ОбъектЗаполнения.Услуги Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		//-Гавриленков В. 15.11.2024 #UT10-4901
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Запасы") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Запасы""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Запасы);
			
			Для Каждого Товар Из ОбъектЗаполнения.Запасы Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Номенклатура") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Номенклатура""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Номенклатура);
			
			Для Каждого Товар Из ОбъектЗаполнения.Номенклатура Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Материалы") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Материалы""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Материалы);
			
			Для Каждого Товар Из ОбъектЗаполнения.Материалы Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МОП_ЭтоСчетНаОплату(ОбъектЗаполнения) Тогда
		
		//+Гавриленков В. 15.11.2024 #UT10-4901  Перенесено в блок условий выше
		//Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") Тогда
		//	
		//	ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Услуги""", "ПолучитьТовар");
		//	ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Услуги);
		//	
		//	Для Каждого Услуга Из ОбъектЗаполнения.Услуги Цикл
		//		
		//		СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
		//		ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
		//		СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
		//		МассивСтруктур.Добавить(СтруктураДанных);
		//		
		//	КонецЦикла;		
		//	
		//КонецЕсли;
		//+Гавриленков В. 15.11.2024 #UT10-4901
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "ОсновныеСредства") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""ОсновныеСредства""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.ОсновныеСредства);
			
			Для Каждого Товар Из ОбъектЗаполнения.ОсновныеСредства Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если МОП_ЭтоАктВыполненныхРабот(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Услуги""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Услуги);
			
			Для Каждого Услуга Из ОбъектЗаполнения.Услуги Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "УслугиОказанные") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""УслугиОказанные""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.УслугиОказанные);
			
			Для Каждого Услуга Из ОбъектЗаполнения.УслугиОказанные Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "РаботыИУслуги") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""РаботыИУслуги""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.РаботыИУслуги);
			
			Для Каждого Услуга Из ОбъектЗаполнения.РаботыИУслуги Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Доходы") Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Доходы""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Доходы);
			
			Для Каждого Услуга Из ОбъектЗаполнения.Доходы Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Услуга);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) ИЛИ МОП_ЭтоСчетНаОплату(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") И ОбъектЗаполнения.Авансы.Количество() > 0 Тогда
			
			ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Авансы""", "ПолучитьТовар");
			ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Авансы);
			
			Для Каждого Товар Из ОбъектЗаполнения.Авансы Цикл
				
				СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
				ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
				СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
				МассивСтруктур.Добавить(СтруктураДанных);
				
			КонецЦикла;		
			
		Иначе
			
			ОснованиеОбъектаЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
			
			Если ЗначениеЗаполнено(ОснованиеОбъектаЗаполнения) 
				И 
				(
				МОП_ЭтоРеализацияТоваров(ОснованиеОбъектаЗаполнения) 
				ИЛИ 
				МОП_ЭтоАктВыполненныхРабот(ОснованиеОбъектаЗаполнения)
				) 
				Тогда
				МассивСтруктур = ФОД_ПолучитьТовар(ОснованиеОбъектаЗаполнения, Истина);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если МассивСтруктур.Количество() = 0 Тогда
		
		//Последний удар - ищем хоть по какой-нибудь табличной части, где есть хоть намек на ставку НДС
		Для Каждого ТабЧасть Из ОбъектЗаполнения.Метаданные().ТабличныеЧасти Цикл
			
			Если ТабЧасть.Реквизиты.Найти("СтавкаНДС") <> Неопределено Тогда
				
				ТабЧастьОбъектаЗаполнения = Неопределено;
				Выполнить("ТабЧастьОбъектаЗаполнения = ОбъектЗаполнения." + ТабЧасть.Имя);
				
				Если ТабЧастьОбъектаЗаполнения <> Неопределено Тогда
					
					ДобавитьВЖурнал("Обработка табличной части " + ТабЧасть.Имя + " объекта " + Строка(ОбъектЗаполнения), "ПолучитьТовар");
					
					Попытка
						
						Для Каждого СтрокаТЧ Из ТабЧастьОбъектаЗаполнения Цикл
							
							СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
							ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТЧ);
							СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
							МассивСтруктур.Добавить(СтруктураДанных);	
							
						КонецЦикла;
						
						Прервать;
						
					Исключение
						ДобавитьВЖурнал(ОписаниеОшибки(), "ПолучитьТовар");
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента И НЕ Вложенный Тогда
		
		Для Каждого ОбъектЗаполнения Из МассивСтруктур Цикл
			
			ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
			ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
			
			Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
				
				СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
				Курс = СтруктураПараметров.Курс;
				Кратность = СтруктураПараметров.Кратность;
				
				Если ОбъектЗаполнения.Свойство("Цена") Тогда
					ОбъектЗаполнения.Цена = Окр(ОбъектЗаполнения.Цена * Курс / Кратность, 2); //Конвертация из валюты в рубли
				КонецЕсли;
				
				Если ОбъектЗаполнения.Свойство("СуммаБезНДС") Тогда
					ОбъектЗаполнения.СуммаБезНДС = Окр(ОбъектЗаполнения.СуммаБезНДС * Курс / Кратность, 2); //Конвертация из валюты в рубли
				КонецЕсли;
				
				Если ОбъектЗаполнения.Свойство("Сумма") Тогда
					ОбъектЗаполнения.Сумма = Окр(ОбъектЗаполнения.Сумма * Курс / Кратность, 2); //Конвертация из валюты в рубли
				КонецЕсли;
				
				Если ОбъектЗаполнения.Свойство("НДС") Тогда
					ОбъектЗаполнения.НДС = Окр(ОбъектЗаполнения.НДС * Курс / Кратность, 2); //Конвертация из валюты в рубли
				КонецЕсли;
				
				Если ОбъектЗаполнения.Свойство("СуммаНДС") Тогда
					ОбъектЗаполнения.СуммаНДС = Окр(ОбъектЗаполнения.СуммаНДС * Курс / Кратность, 0); //Конвертация из валюты в рубли
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивСтруктур;

КонецФункции

Функция ФОД_ПолучитьСтрокуРезультатаПриемки(Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 07.04.2026 #UT10-5800	
	МассивСтруктур = Новый Массив;
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		ДобавитьВЖурнал("Не определен объект заполнения!", "ПолучитьСтрокуРезультатаПриемки");
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Если МОП_ЭтоАктОРасхожденияхПослеПриемки(ОбъектЗаполнения) Тогда
		
		ДобавитьВЖурнал("Отладка: Сбор данных по табчасти ""Товары""", "ПолучитьСтрокуРезультатаПриемки");
		
		РеквизитыАкта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектЗаполнения, "ДокументОснование, СуммаВключаетНДС, Товары, РасхожденияКМ");
		
		// Товары
		ТабЧасть = РеквизитыАкта.Товары.Выгрузить();
		ТабЧасть.Свернуть("Номенклатура, ЕдиницаИзмерения, Цена, СтавкаНДС, Брак", 
			"Количество, КоличествоПоДокументу, СуммаНДС, СуммаНДСПоДокументу, Сумма, СуммаПоДокументу");
		
		
		
		ТабЧасть.Колонки.Добавить("КоличествоНедостача", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ТабЧасть.Колонки.Добавить("КоличествоИзлишек", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		ТабЧасть.Колонки.Добавить("КоличествоБрак", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		
		ТабЧасть.Колонки.Добавить("ЦенаСНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15,4));
		
		ТабЧасть.Колонки.Добавить("СуммаСНДС", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТабЧасть.Колонки.Добавить("СуммаСНДСПоДокументу", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		
		ТабЧасть.Колонки.Добавить("СуммаСНДСНедостача", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТабЧасть.Колонки.Добавить("СуммаСНДСИзлишек", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТабЧасть.Колонки.Добавить("СуммаСНДСБрак", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		
		ТабЧасть.Колонки.Добавить("СуммаНДСНедостача", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТабЧасть.Колонки.Добавить("СуммаНДСИзлишек", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		ТабЧасть.Колонки.Добавить("СуммаНДСБрак", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
		
		Для Каждого СтрокаТовары Из ТабЧасть Цикл
			
			Если РеквизитыАкта.СуммаВключаетНДС Тогда
				
				СтрокаТовары.СуммаСНДС = СтрокаТовары.Сумма;
				СтрокаТовары.СуммаСНДСПоДокументу = СтрокаТовары.СуммаПоДокументу;
				
			Иначе
				
				СтрокаТовары.СуммаСНДС = СтрокаТовары.Сумма + СтрокаТовары.СуммаНДС;
				СтрокаТовары.СуммаСНДСПоДокументу = СтрокаТовары.СуммаПоДокументу + СтрокаТовары.СуммаНДС;
				
			КонецЕсли;
			
			Если СтрокаТовары.Брак Тогда
				
				// брак
				НайденныеСтрокиНеБрак = ТабЧасть.НайтиСтроки(Новый Структура("Номенклатура, Брак", СтрокаТовары.Номенклатура, Ложь));
				
				Если НайденныеСтрокиНеБрак.Количество() > 0 Тогда
					
					СтрокаТовары.Цена = НайденныеСтрокиНеБрак[0].Цена;
					СтрокаТовары.СтавкаНДС = НайденныеСтрокиНеБрак[0].СтавкаНДС;
					                            
					СтрокаТовары.СуммаСНДС =  0; // общий пересчет сумм чуть позже
					СтрокаТовары.СуммаНДС =  0;
					
				КонецЕсли;
				
				СтрокаТовары.КоличествоБрак = СтрокаТовары.Количество;
				СтрокаТовары.КоличествоНедостача = -СтрокаТовары.Количество; // это не недостача, а брак
				
			Иначе	
				
				Если СтрокаТовары.КоличествоПоДокументу > СтрокаТовары.Количество Тогда
					СтрокаТовары.КоличествоНедостача = СтрокаТовары.КоличествоПоДокументу - СтрокаТовары.Количество;
				ИначеЕсли СтрокаТовары.КоличествоПоДокументу < СтрокаТовары.Количество Тогда
					СтрокаТовары.КоличествоИзлишек = СтрокаТовары.Количество - СтрокаТовары.КоличествоПоДокументу;
					СтрокаТовары.Количество = СтрокаТовары.Количество - СтрокаТовары.КоличествоИзлишек;	// излишек исключаем из фактически
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ТабЧасть.Свернуть("Номенклатура, ЕдиницаИзмерения, Цена, ЦенаСНДС, СтавкаНДС", 
			"Количество, КоличествоПоДокументу, КоличествоНедостача, КоличествоИзлишек, КоличествоБрак, "+ 
			"СуммаСНДС, СуммаСНДСПоДокументу, СуммаСНДСНедостача, СуммаСНДСИзлишек, СуммаСНДСБрак," +
			"СуммаНДС, СуммаНДСПоДокументу, СуммаНДСНедостача, СуммаНДСИзлишек, СуммаНДСБрак");
		
		ТабЧасть.Сортировать("Номенклатура, Цена");
		
		ТабЧасть.Колонки.Добавить("мКодыМаркировкиПоДокументу");
		ТабЧасть.Колонки.Добавить("мКодыМаркировкиФактически");
		ТабЧасть.Колонки.Добавить("мКодыМаркировкиНедостача");
		ТабЧасть.Колонки.Добавить("мКодыМаркировкиИзлишек");
		ТабЧасть.Колонки.Добавить("мКодыМаркировкиБрак");		

		// Коды маркировки
		Запрос = Новый Запрос;          
		Запрос.УстановитьПараметр("ПТУ", РеквизитыАкта.ДокументОснование);
		Запрос.УстановитьПараметр("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
		//Запрос.УстановитьПараметр("ТаблицаРасхожденияКМ", РеквизитыАкта.РасхожденияКМ.Выгрузить());
		Запрос.УстановитьПараметр("ТаблицаИзлишковИзАкта", РеквизитыАкта.РасхожденияКМ.Выгрузить().Скопировать(Новый Структура("Излишек", Истина),"КодМаркировки"));
		
		Запрос.Текст = Документы.АктОРасхожденияхПослеПриемки.ПолучитьТекстЗапросаПоКодамМаркировки();
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		тзКодыМаркировкиПолная = РезультатЗапроса[2].Выгрузить();
		
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка);
		
		ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ТабЧасть);
		
	    Для Каждого СтрокаТовары Из ТабЧасть Цикл
			
			// распределение по кодам маркировки происходит в любом случае по всем строкам
			мКодыМаркировкиПоДокументу = Новый Массив;
			мКодыМаркировкиФактически = Новый Массив;
			мКодыМаркировкиНедостача = Новый Массив;
			мКодыМаркировкиИзлишек = Новый Массив;
			мКодыМаркировкиБрак = Новый Массив;
			
			//Принято
			ТребуетсяКоличествоКодовПринято = Мин(СтрокаТовары.Количество, СтрокаТовары.КоличествоПоДокументу);
			НайденныеСтрокиКодыМаркировкиПринято = тзКодыМаркировкиПолная.НайтиСтроки(Новый Структура("Номенклатура, Принято", СтрокаТовары.Номенклатура, Истина));
			
			Для Каждого СтрокаКодов Из НайденныеСтрокиКодыМаркировкиПринято Цикл
				
				Если ТребуетсяКоличествоКодовПринято = 0 Тогда
					Прервать;
				КонецЕсли;
					
				мКодыМаркировкиПоДокументу.Добавить(СтрокаКодов.КодМаркировки);
				мКодыМаркировкиФактически.Добавить(СтрокаКодов.КодМаркировки);
				
				ТребуетсяКоличествоКодовПринято = ТребуетсяКоличествоКодовПринято - 1;
				
				тзКодыМаркировкиПолная.Удалить(СтрокаКодов);
				
			КонецЦикла;

			// в результате запоминаем только те строки где есть отклонения
			Если СтрокаТовары.КоличествоНедостача = 0 И СтрокаТовары.КоличествоИзлишек = 0 И СтрокаТовары.КоличествоБрак = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			// подбиваем цены, суммы НДС, суммы с НДС
			НДСНаЕдиницуТовара = 0;
			
			Если СтрокаТовары.КоличествоПоДокументу > 0 Тогда
				
				СтрокаТовары.ЦенаСНДС = Окр(СтрокаТовары.СуммаСНДСПоДокументу / СтрокаТовары.КоличествоПоДокументу, 4);
				СтрокаТовары.СуммаСНДС = Окр(СтрокаТовары.Количество * СтрокаТовары.СуммаСНДСПоДокументу / СтрокаТовары.КоличествоПоДокументу, 2);
				
				НДСНаЕдиницуТовара = СтрокаТовары.СуммаНДСПоДокументу / СтрокаТовары.КоличествоПоДокументу;
				СтрокаТовары.СуммаНДС = Окр(СтрокаТовары.Количество * НДСНаЕдиницуТовара, 2);

				
			ИначеЕсли СтрокаТовары.Количество + СтрокаТовары.КоличествоИзлишек > 0 Тогда
				
				СтрокаТовары.ЦенаСНДС = Окр(СтрокаТовары.СуммаСНДС / (СтрокаТовары.Количество + СтрокаТовары.КоличествоИзлишек), 4);
				СтрокаТовары.СуммаСНДСПоДокументу = СтрокаТовары.ЦенаСНДС * СтрокаТовары.КоличествоПоДокументу;
				СтрокаТовары.СуммаСНДС = СтрокаТовары.ЦенаСНДС * СтрокаТовары.Количество;
				
				НДСНаЕдиницуТовара = СтрокаТовары.СуммаНДС / (СтрокаТовары.Количество + СтрокаТовары.КоличествоИзлишек);
				СтрокаТовары.СуммаНДС = Окр(СтрокаТовары.Количество * НДСНаЕдиницуТовара, 2);
				
			КонецЕсли;
			
			СтрокаТовары.СуммаСНДСНедостача = СтрокаТовары.ЦенаСНДС * СтрокаТовары.КоличествоНедостача;
			СтрокаТовары.СуммаСНДСИзлишек = СтрокаТовары.ЦенаСНДС * СтрокаТовары.КоличествоИзлишек;
			СтрокаТовары.СуммаСНДСБрак = СтрокаТовары.ЦенаСНДС * СтрокаТовары.КоличествоБрак;
			
			СтрокаТовары.СуммаНДСНедостача = Окр(СтрокаТовары.КоличествоНедостача * НДСНаЕдиницуТовара, 2);
			СтрокаТовары.СуммаНДСИзлишек = Окр(СтрокаТовары.КоличествоИзлишек * НДСНаЕдиницуТовара, 2);
			СтрокаТовары.СуммаНДСБрак = Окр(СтрокаТовары.КоличествоБрак * НДСНаЕдиницуТовара, 2);
				
		
			СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТовары);
			СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
			
			// брак и недостача встают в раздел КМ по документу, а излишки в раздел по факту
			
			Если СтрокаТовары.КоличествоБрак > 0 Тогда
				
				// брак
			    ТребуетсяКоличествоКодовБрак = СтрокаТовары.КоличествоБрак;
				
				// КМ по браку должны быть с отметкой Недостача, т.к. ситуация брака у нас проходит двумя строчками 1.недостача -, 2.брак +
				НайденныеСтрокиКодыМаркировкиБрак = тзКодыМаркировкиПолная.НайтиСтроки(Новый Структура("Номенклатура, Недостача", СтрокаТовары.Номенклатура, Истина));
				
				Для Каждого СтрокаКодов Из НайденныеСтрокиКодыМаркировкиБрак Цикл
					
					Если ТребуетсяКоличествоКодовБрак = 0 Тогда
						Прервать;
					КонецЕсли;
					
					мКодыМаркировкиБрак.Добавить(СтрокаКодов.КодМаркировки);
					
					Если СтрокаКодов.Передано И мКодыМаркировкиПоДокументу.Найти(СтрокаКодов.КодМаркировки) = Неопределено Тогда
						мКодыМаркировкиПоДокументу.Добавить(СтрокаКодов.КодМаркировки);
					КонецЕсли;
					
					Если мКодыМаркировкиФактически.Найти(СтрокаКодов.КодМаркировки) = Неопределено Тогда
						мКодыМаркировкиФактически.Добавить(СтрокаКодов.КодМаркировки);
					КонецЕсли;
					
					ТребуетсяКоличествоКодовБрак = ТребуетсяКоличествоКодовБрак - 1;
					
					тзКодыМаркировкиПолная.Удалить(СтрокаКодов);
					
				КонецЦикла;	
				
			КонецЕсли;
			
			Если СтрокаТовары.КоличествоНедостача > 0 Тогда 
				
				// недостача
			    ТребуетсяКоличествоКодовНедостача = СтрокаТовары.КоличествоНедостача;
				НайденныеСтрокиКодыМаркировкиНедостача = тзКодыМаркировкиПолная.НайтиСтроки(Новый Структура("Номенклатура, Недостача", СтрокаТовары.Номенклатура, Истина));
				
				Для Каждого СтрокаКодов Из НайденныеСтрокиКодыМаркировкиНедостача Цикл
					
					Если ТребуетсяКоличествоКодовНедостача = 0 Тогда
						Прервать;
					КонецЕсли;
					
					мКодыМаркировкиНедостача.Добавить(СтрокаКодов.КодМаркировки);
					
					Если СтрокаКодов.Передано И мКодыМаркировкиПоДокументу.Найти(СтрокаКодов.КодМаркировки) = Неопределено Тогда
						мКодыМаркировкиПоДокументу.Добавить(СтрокаКодов.КодМаркировки);
					КонецЕсли;
					
					ТребуетсяКоличествоКодовНедостача = ТребуетсяКоличествоКодовНедостача - 1;
					
					тзКодыМаркировкиПолная.Удалить(СтрокаКодов);
					
				КонецЦикла;
				
			КонецЕсли;
				
			Если СтрокаТовары.КоличествоИзлишек > 0 Тогда
				
				// излишек
			    ТребуетсяКоличествоКодовИзлишек = СтрокаТовары.КоличествоИзлишек;
		        НайденныеСтрокиКодыМаркировкиИзлишек = тзКодыМаркировкиПолная.НайтиСтроки(Новый Структура("Номенклатура, Излишек", СтрокаТовары.Номенклатура, Истина));
				
				Для Каждого СтрокаКодов Из НайденныеСтрокиКодыМаркировкиИзлишек Цикл
					
					Если ТребуетсяКоличествоКодовИзлишек = 0 Тогда
						Прервать;
					КонецЕсли;
					
					мКодыМаркировкиИзлишек.Добавить(СтрокаКодов.КодМаркировки);
					
					Если мКодыМаркировкиФактически.Найти(СтрокаКодов.КодМаркировки) = Неопределено Тогда
						мКодыМаркировкиФактически.Добавить(СтрокаКодов.КодМаркировки);
					КонецЕсли;
					
					ТребуетсяКоличествоКодовИзлишек = ТребуетсяКоличествоКодовИзлишек - 1;
					
					тзКодыМаркировкиПолная.Удалить(СтрокаКодов);
					
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураДанных.Вставить("мКодыМаркировкиПоДокументу", мКодыМаркировкиПоДокументу);
			СтруктураДанных.Вставить("мКодыМаркировкиФактически", мКодыМаркировкиФактически);
			СтруктураДанных.Вставить("мКодыМаркировкиНедостача", мКодыМаркировкиНедостача);
			СтруктураДанных.Вставить("мКодыМаркировкиИзлишек", мКодыМаркировкиИзлишек);
			СтруктураДанных.Вставить("мКодыМаркировкиБрак", мКодыМаркировкиБрак);
			
			МассивСтруктур.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента Тогда
		
		//Конвертация из валюты в рубли
		СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
		Курс = СтруктураПараметров.Курс;
		Кратность = СтруктураПараметров.Кратность;
				
		Для Каждого ОбъектЗаполнения Из МассивСтруктур Цикл
			
			ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
			ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
			
			Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
				
				ОбъектЗаполнения.ЦенаСНДС = Окр(ОбъектЗаполнения.ЦенаСНДС * Курс / Кратность, 4); 
				
				ОбъектЗаполнения.СуммаСНДС = Окр(ОбъектЗаполнения.СуммаСНДС * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаСНДСПоДокументу = Окр(ОбъектЗаполнения.СуммаСНДСПоДокументу * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаСНДСНедостача = Окр(ОбъектЗаполнения.СуммаСНДСНедостача * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаСНДСИзлишек = Окр(ОбъектЗаполнения.СуммаСНДСИзлишек * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаСНДСБрак = Окр(ОбъектЗаполнения.СуммаСНДСБрак * Курс / Кратность, 2);
				
				ОбъектЗаполнения.СуммаНДС = Окр(ОбъектЗаполнения.СуммаНДС * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаНДСПоДокументу = Окр(ОбъектЗаполнения.СуммаНДСПоДокументу * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаНДСНедостача = Окр(ОбъектЗаполнения.СуммаНДСНедостача * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаНДСИзлишек = Окр(ОбъектЗаполнения.СуммаНДСИзлишек * Курс / Кратность, 2); 
				ОбъектЗаполнения.СуммаНДСБрак = Окр(ОбъектЗаполнения.СуммаНДСБрак * Курс / Кратность, 2);
				
				
			КонецЕсли;
					
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивСтруктур;
	//-Макрушин Е. 07.04.2026 #UT10-5800

КонецФункции

Функция ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, Знач ОбъектЗаполнения, НаименованиеСвойства = Неопределено, ПустоеЗначениеПоУмолчанию = Неопределено)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ПустоеЗначениеПоУмолчанию;

	Если ЗначениеЗаполнено(НаименованиеСвойства) И ОбъектЗаполнения.Свойство(НаименованиеСвойства) И ЗначениеЗаполнено(ОбъектЗаполнения[НаименованиеСвойства]) Тогда
		Результат = ОбъектЗаполнения[НаименованиеСвойства];
	КонецЕсли;

	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоПоДокументу(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "КоличествоПоДокументу", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоФактически(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "Количество", 0);

	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоНедостачи(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "КоличествоНедостача", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоИзлишков(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "КоличествоИзлишек", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоБрака(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "КоличествоБрак", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьЦенуСНДСПоДокументу(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "ЦенаСНДС", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуСНДСПоДокументу(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаСНДСПоДокументу", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуСНДСФактически(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаСНДС", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуСНДСНедостачи(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаСНДСНедостача", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуСНДСИзлишков(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаСНДСИзлишек", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуСНДСБрака(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаСНДСБрак", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуНДСПоДокументу(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаНДСПоДокументу", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуНДСФактически(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаНДС", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции


Функция ФОД_ПолучитьСуммуНДСНедостачи(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаНДСНедостача", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуНДСИзлишков(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаНДСИзлишек", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьСуммуНДСБрака(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = ФОД_ПолучитьЗначениеПоНаименованиюСвойства(ВерсияЗаполнения, ОбъектЗаполнения, "СуммаНДСБрак", 0);
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьНаименованиеЕдиницыИзмеренияПоСтрокеТовара(ВерсияЗаполнения, 	Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = "";
	
	ЕдиницаИзмерения = ФОД_ПолучитьЕдиницуИзмеренияТовара(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		Результат = ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, ЕдиницаИзмерения.ЕдиницаПоКлассификатору);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)Тогда
		Результат = "-";
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКодЕдиницыИзмеренияПоСтрокеТовара(ВерсияЗаполнения, 	Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = "";
	
	ЕдиницаИзмерения = ФОД_ПолучитьЕдиницуИзмеренияТовара(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
    	Результат = ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, ЕдиницаИзмерения.ЕдиницаПоКлассификатору);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)Тогда
		Результат = "-";
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция КолонкиВСтроку(Таблица, МассивИсключений, МассивСуммирования)
	
	СтрокаВозврата = "";
	СтрокаВозвратаСуммирования = "";
	
	Для каждого Колонка Из Таблица.Колонки Цикл
		
		Если МассивИсключений.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли; 
		
		Если МассивСуммирования.Найти(Колонка.Имя) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		СтрокаВозврата = СтрокаВозврата + ?(ЗначениеЗаполнено(СтрокаВозврата), ",", "") + Колонка.Имя;
			
	КонецЦикла; 
	
	Для каждого Суммирование Из МассивСуммирования Цикл		
		СтрокаВозвратаСуммирования = СтрокаВозвратаСуммирования + ?(ЗначениеЗаполнено(СтрокаВозвратаСуммирования), ",", "") + Суммирование;			
	КонецЦикла; 
	
	Возврат Новый Структура("КолонкиГруппировки, КолонкиСуммирования", СтрокаВозврата, СтрокаВозвратаСуммирования);	
		
КонецФункции  

Функция ФОД_ПолучитьДопРеквизит(Знач ОбъектЗаполнения)
	
	//+Белов А. 03.03.2026 #UT10-5730
	ВыгружатьКодыМаркировки = Константы.ЭДО_ВыгружатьКодыМаркировки.Получить();
	//-Белов А. 03.03.2026 #UT10-5730
	
	МассивСтруктур = Новый Массив;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") 
		И ТипЗнч(ОбъектЗаполнения.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Реализация = ОбъектЗаполнения.ДокументОснование;
		
		//+Белов А. 03.03.2026 #UT10-5730
		Если ВыгружатьКодыМаркировки
			И Реализация.КодыМаркировки.Количество() > 0 Тогда
			
			Если Реализация.ДоговорКонтрагента.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ПокупкаДляСобственныхНужд Тогда
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", "СвВыбытияМАРК"), "1"));
			//+Белов А. 07.05.2026 #UT10-5843
			ИначеЕсли Реализация.ДоговорКонтрагента.УсловияРаботыСЧЗ = Перечисления.УсловияРаботыСЧЗ.ТорговляСНовымиРегионами Тогда   
				
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", "СвВыбытияМАРК"), "1"));
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", "action"), "OTHER"));
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", "withdrawal_type_other"), "Отгрузка в ДНР / Отгрузка в ЛНР / Отгрузка в Херсонскую обл. / Отгрузка в Запорожскую обл."));
				
			КонецЕсли;
			//-Белов А. 07.05.2026 #UT10-5843	
						
		КонецЕсли;
		//-Белов А. 03.03.2026 #UT10-5730
		
		ФилиалКонтрагент = Реализация.Грузополучатель;
		
		Если ЗначениеЗаполнено(ФилиалКонтрагент) Тогда   
			
			Для каждого Стр Из ФилиалКонтрагент.ДополнительныеПараметрыВыгрузкиВЭДО Цикл
				
				Если Не ЗначениеЗаполнено(Стр.ИмяПараметра) ИЛИ Не ЗначениеЗаполнено(Стр.ЗначениеПараметра) Тогда
					Продолжить;	
				КонецЕсли;
				
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", Стр.ИмяПараметра), Стр.ЗначениеПараметра));	
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") 
		И ТипЗнч(ОбъектЗаполнения.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		КорректировкаРеализации = ОбъектЗаполнения.ДокументОснование;
		
		Для каждого Стр Из КорректировкаРеализации.ДополнительныеПараметрыВыгрузкиВЭДО Цикл
			
			Если Не ЗначениеЗаполнено(Стр.ИмяПараметра) ИЛИ Не ЗначениеЗаполнено(Стр.ЗначениеПараметра) Тогда
				Продолжить;	
			КонецЕсли;
			
			МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование", Стр.ИмяПараметра), Стр.ЗначениеПараметра));	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ ЗагружатьДопРеквизитыИз1С Тогда
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "ДополнительныеРеквизиты") Тогда
		
		ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.ДополнительныеРеквизиты);
		
		Для Каждого ДопРеквизит Из ОбъектЗаполнения.ДополнительныеРеквизиты Цикл
			
			СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ДопРеквизит);
			МассивСтруктур.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивСтруктур;

КонецФункции

Функция ФОД_ПолучитьДопРеквизитТовара(Знач ОбъектЗаполнения)
	
	МассивСтруктур = Новый Массив;
	
	КодСтраныВУПД          = "";
	НаименованиеСтраныВУПД = "";
	НомерГТДВУПД           = "";
	
	Если ТипЗнч(ОбъектЗаполнения.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		//+Гавриленков В. 25.02.2026 #UT10-5710
		//СтрокаТовара = ОбъектЗаполнения.Ссылка.Товары.Найти(ОбъектЗаполнения.Номенклатура, "Номенклатура");
		СтруктураПоиска = Новый Структура("Номенклатура", ОбъектЗаполнения.Номенклатура);
		МассивНайденных = ОбъектЗаполнения.Ссылка.Товары.НайтиСтроки(СтруктураПоиска);
		
		СтрокаТовара = Неопределено;
		
		Если МассивНайденных.Количество() = 1 Тогда
			СтрокаТовара = МассивНайденных[0];
		ИначеЕсли МассивНайденных.Количество() > 1 Тогда   
			
			Для Каждого НайденнаяСтрока Из МассивНайденных Цикл 
				
				Если НайденнаяСтрока.НомерСтроки = ОбъектЗаполнения.НомерСтроки Тогда
					
					СтрокаТовара = НайденнаяСтрока;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		//-Гавриленков В. 25.02.2026 #UT10-5710
		
		Если СтрокаТовара <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры.НомерГТД) И ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры.СтранаПроисхождения)
				И ЗначениеЗаполнено(СтрокаТовара.СерияНоменклатуры.СтранаПроисхождения.Код) Тогда 
				
				КодСтраныВУПД          =  СтрокаТовара.СерияНоменклатуры.СтранаПроисхождения.Код;
				НаименованиеСтраныВУПД =   СтрокаТовара.СерияНоменклатуры.СтранаПроисхождения.Наименование;
				НомерГТДВУПД = Лев(СокрЛП(СтрокаТовара.СерияНоменклатуры.НомерГТД.Код), 29);	
				
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование","цифровой код страны происхождения" ), КодСтраныВУПД));
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование","краткое наименование страны происхождения"), НаименованиеСтраныВУПД));
				МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование","регистрационный номер декларации на товары"), НомерГТДВУПД));
				
			КонецЕсли;
			
		КонецЕсли;   
		
	//+Белов А. 15.06.2026 #
	ИначеЕсли ТипЗнч(ОбъектЗаполнения.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		МассивСтруктур.Добавить(Новый Структура("Свойство, Значение", Новый Структура("Наименование","Бренд" ), Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбъектЗаполнения.Номенклатура, "Родитель"))));
		
	//-Белов А. 15.06.2026 #
	КонецЕсли;
	
	Если НЕ ЗагружатьДопРеквизитыИз1С Тогда
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Номенклатура") Тогда
		
		Номенклатура = ОбъектЗаполнения.Номенклатура;
		МассивСтруктур = ФОД_ПолучитьДопРеквизит(Номенклатура);
		
	КонецЕсли;
	
	Возврат МассивСтруктур;

КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения, ТребуетсяКоличествоКодов = Неопределено, Корректировка = Ложь,	
//+Макрушин Е. 08.04.2026 #UT10-5800
	мКодыМаркировкиДляОбработки = Неопределено)
//-Макрушин Е. 08.04.2026 #UT10-5800

	//+Белов А. 17.02.2026 #UT10-5696
	Результат = Неопределено;

	//+Макрушин Е. 08.04.2026 #UT10-5800
	Если мКодыМаркировкиДляОбработки = Неопределено Тогда
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
		мКодыМаркировкиПоНоменклатуре = Новый Массив;
		
		Если ОбъектЗаполнения.Свойство("Номенклатура") 
			И БуферКодовМаркировкиТоваров.Колонки.Найти("Номенклатура") <> Неопределено
			И БуферКодовМаркировкиТоваров.Количество() > 0 Тогда
			
			Если ТребуетсяКоличествоКодов = Неопределено Тогда
				ТребуетсяКоличествоКодов = ОбъектЗаполнения.Количество;	
			КонецЕсли;		
			
			тзКодыМаркировки = БуферКодовМаркировкиТоваров.НайтиСтроки(Новый Структура("Номенклатура", ОбъектЗаполнения.Номенклатура));
			
			Для Каждого СтрокаКодов Из тзКодыМаркировки Цикл
				
				Если ТребуетсяКоличествоКодов = 0 Тогда
					Прервать;
				КонецЕсли;
					
				мКодыМаркировкиПоНоменклатуре.Добавить(СтрокаКодов.КодМаркировки);
				
				ТребуетсяКоличествоКодов = ТребуетсяКоличествоКодов - 1;
				
				БуферКодовМаркировкиТоваров.Удалить(СтрокаКодов);
				
			КонецЦикла;
			
		КонецЕсли;
		
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Иначе
		
		// коды маркировки уже подготовлены ранее, осталось вывести
		мКодыМаркировкиПоНоменклатуре = Новый Массив;
		
		Для Каждого СтрокаКодов Из мКодыМаркировкиДляОбработки Цикл
			мКодыМаркировкиПоНоменклатуре.Добавить(СтрокаКодов.КодМаркировки);
		КонецЦикла;
		
	КонецЕсли;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
	Если мКодыМаркировкиПоНоменклатуре.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли; 
	
	Если Корректировка Тогда
		
		РезультатЭлемент = Новый Структура;
		РезультатЭлемент.Вставить("identificationNumbers", мКодыМаркировкиПоНоменклатуре);
		
		Результат = Новый Массив;
		Результат.Добавить(РезультатЭлемент);
	
	Иначе 
		
		СтруктураПоКодамМаркировкиПоНоменклатуре = Новый Структура();
		СтруктураПоКодамМаркировкиПоНоменклатуре.Вставить("collection", мКодыМаркировкиПоНоменклатуре); 
		
		СтруктураПоКодамМаркировкиПоНоменклатуре.Вставить("type", "1");
		
		РезультатЭлемент = Новый Структура;
		РезультатЭлемент.Вставить("numbers", СтруктураПоКодамМаркировкиПоНоменклатуре);
		РезультатЭлемент.Вставить("packNumber", "");
		
		Результат = Новый Массив;
		Результат.Добавить(РезультатЭлемент);
		
	КонецЕсли;
		
	Возврат Результат;
	//-Белов А. 17.02.2026 #UT10-5696
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиТовараПоДокументу(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("мКодыМаркировкиПоДокументу") Тогда
		Результат = ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения,,, ОбъектЗаполнения.мКодыМаркировкиПоДокументу);
	КонецЕсли;	
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиТовараФактически(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("мКодыМаркировкиФактически") Тогда
		Результат = ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения,,, ОбъектЗаполнения.мКодыМаркировкиФактически);
	КонецЕсли;	
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиНедостачи(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("мКодыМаркировкиНедостача") Тогда
		Результат = ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения,,, ОбъектЗаполнения.мКодыМаркировкиНедостача);
	КонецЕсли;	
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиИзлишков(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("мКодыМаркировкиИзлишек") Тогда
		Результат = ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения,,, ОбъектЗаполнения.мКодыМаркировкиИзлишек);
	КонецЕсли;	
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиБрака(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 08.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("мКодыМаркировкиБрак") Тогда
		Результат = ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения,,, ОбъектЗаполнения.мКодыМаркировкиБрак);
	КонецЕсли;	
	
	Возврат Результат;
	//-Макрушин Е. 08.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьМассивКодовМаркировкиТовараПосле(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Количество > ОбъектЗаполнения.КоличествоДоИзменения Тогда
		Возврат ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения, ОбъектЗаполнения.Количество - ОбъектЗаполнения.КоличествоДоИзменения, Истина);		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ФОД_ПолучитьМассивКодовМаркировкиТовараДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Количество < ОбъектЗаполнения.КоличествоДоИзменения Тогда
		Возврат ФОД_ПолучитьМассивКодовМаркировкиТовара(ВерсияЗаполнения, ОбъектЗаполнения, ОбъектЗаполнения.КоличествоДоИзменения - ОбъектЗаполнения.Количество, Истина);	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ФОД_ПолучитьГрузополучателяДокумента(Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		АнализируемыйДокумент = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
	Иначе
		АнализируемыйДокумент = ОбъектЗаполнения;
	КонецЕсли;
	
	Если МОП_ЭтоАктВыполненныхРабот(АнализируемыйДокумент) Тогда
		Возврат Неопределено;
	ИначеЕсли МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		Возврат Неопределено;
	Иначе
		Возврат МОП_ПолучитьГрузополучателя(ОбъектЗаполнения);
	КонецЕсли;

КонецФункции 

Функция ФОД_ПолучитьПеревозчикаДокумента(Знач ОбъектЗаполнения)
	//+Белов А. 17.06.2026 #UT10-5921
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаказЗаявка) Тогда
			Возврат ОбъектЗаполнения.ЗаказЗаявка.Контрагент;	
		Иначе
			Возврат ОбъектЗаполнения.Организация;	
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда
		Возврат ОбъектЗаполнения.Контрагент;
	КонецЕсли;	
	
	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции    

Функция ФОД_ПолучитьИдентификаторПеревозчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//+Белов А. 17.06.2026 #UT10-5921
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда     	
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаказЗаявка) Тогда
			Возврат ФОД_ПолучитьИдентификаторПеревозчика(Неопределено, ОбъектЗаполнения.ЗаказЗаявка);				
		Иначе
			
			Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Организация") И ЗначениеЗаполнено(ОбъектЗаполнения.Организация.ИдентификаторОрганизации) Тогда
				Возврат ОбъектЗаполнения.Организация.ИдентификаторОрганизации; 
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат Цел(ИдентификаторПодразделения); 
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда     	
		
		Контрагент = ПолучитьКонтрагентаПоОбъектуЗаполнения(ОбъектЗаполнения); 
		
		Попытка
			
			ИдентификаторыКонтрагента = РС_ПолучитьИдентификаторыКонтрагента(Контрагент);
			
			Если ЗначениеЗаполнено(ИдентификаторыКонтрагента) И ИдентификаторыКонтрагента.Свойство("ИдентификаторПодразделения") Тогда
				Возврат Цел(ИдентификаторыКонтрагента.ИдентификаторПодразделения);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "ФОД_ПолучитьИдентификаторПеревозчика");	
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Цел(ИдентификаторПодразделения);

	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьДатуЗаказЗаявки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.ЗаказЗаявка), Формат(ОбъектЗаполнения.ЗаказЗаявка.Дата, "ДФ=дд.ММ.гггг"), Формат(ОбъектЗаполнения.Дата, "ДФ=дд.ММ.гггг"));

КонецФункции

Функция ФОД_ПолучитьНомерЗаказЗаявки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.ЗаказЗаявка), ОбщегоНазначения.ПолучитьНомерНаПечать(ОбъектЗаполнения.ЗаказЗаявка), "Без номера");

КонецФункции

Функция ФОД_ПолучитьГруз(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	СтруктураГруза = Новый Структура("КоличествоГрузомест, ВесБрутто, СтоимостьГруза, ОбъемГрузомест", 1, 10, 0, 1);  
	
	МассивВозврата = Новый Массив;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		
		МассивДокументов = ОбъектЗаполнения.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
				
		СтруктураГруза.КоличествоГрузомест = ПолучитьКоличествоМестПоДокументамОснованияИзЗаданияНаДоставку(МассивДокументов, ОбъектЗаполнения.ЗаданиеНаДоставку);			
		СтруктураГруза.СтоимостьГруза = ПолучитьСтоимостьГрузаПоДокументамОснования(МассивДокументов);	
		СтруктураГруза.ВесБрутто = ПолучитьВесПоДокументамОснования(МассивДокументов); 
				
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаданиеНаДоставку) Тогда
			
			МассивДокументов = Документы.ЗаданиеНаДоставку.ПолучитьМассивРеализацийДляОтправкиВЭДО(ОбъектЗаполнения.ЗаданиеНаДоставку);
			
			СтруктураГруза.КоличествоГрузомест = ПолучитьКоличествоМестПоДокументамОснованияИзЗаданияНаДоставку(МассивДокументов, ОбъектЗаполнения.ЗаданиеНаДоставку);				
			СтруктураГруза.ВесБрутто = ПолучитьВесПоДокументамОснования(МассивДокументов); 
			СтруктураГруза.ОбъемГрузомест = ПолучитьОбъемПоДокументамОснования(МассивДокументов);      
			
		Иначе
			//+Белов А. 02.09.2026 #UT10-6021
			
			СтруктураГруза.КоличествоГрузомест = ОбъектЗаполнения.КоличествоГрузомест;				
			СтруктураГруза.ВесБрутто = ОбъектЗаполнения.ВесГруза; 
			СтруктураГруза.ОбъемГрузомест = ОбъектЗаполнения.ОбъемГруза;    
			
			//-Белов А. 02.09.2026 #UT10-6021
		КонецЕсли;   
		
		СтруктураГруза.Вставить("Длина", 1); 
		СтруктураГруза.Вставить("Ширина", 1);
		СтруктураГруза.Вставить("Высота", 1); 		
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураГруза.ОбъемГрузомест) Тогда
		СтруктураГруза.ОбъемГрузомест = 1;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(СтруктураГруза.ВесБрутто) Тогда
		СтруктураГруза.ВесБрутто = 10;
	КонецЕсли;

	МассивВозврата.Добавить(СтруктураГруза);
	
	Возврат МассивВозврата;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   


Функция ПолучитьВесПоДокументамОснования(МассивДокументов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Вес * РеализацияТоваровУслугТовары.Количество) КАК Вес
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);  
	
	Выборка = Запрос.Выполнить().Выбрать();    
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Вес <> NULL Тогда
			Возврат Окр(Выборка.Вес, 2, 1);	
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат 10;
		
КонецФункции 

Функция ПолучитьСтоимостьГрузаПоДокументамОснования(МассивДокументов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РеализацияТоваровУслуг.СуммаДокумента) КАК СуммаДокумента
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);  
	
	Выборка = Запрос.Выполнить().Выбрать();    
	
	Если Выборка.Следующий() Тогда
		Если Выборка.СуммаДокумента <> NULL Тогда
			Возврат Выборка.СуммаДокумента; 
		КонецЕсли;
	КонецЕсли; 
	
	Возврат 1;
		
КонецФункции

Функция ПолучитьОбъемПоДокументамОснования(МассивДокументов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Объем * РеализацияТоваровУслугТовары.Количество) КАК Объем
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка В(&МассивДокументов)";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);  
	
	Выборка = Запрос.Выполнить().Выбрать();    
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Объем <> NULL Тогда
			Возврат Окр(Выборка.Объем, 2, 1);
		КонецЕсли;
	КонецЕсли; 
	
	Возврат 1;
		
КонецФункции


Функция ПолучитьКоличествоМестПоДокументамОснованияИзЗаданияНаДоставку(МассивДокументов, ЗаданиеНаДоставку)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|ПОМЕСТИТЬ ВТ_СборкиРеализаций
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|ГДЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка В(&МассивДокументов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
	|			(ВЫБРАТЬ
	|				ВТ_СборкиРеализаций.ДокументСборки
	|			ИЗ
	|				ВТ_СборкиРеализаций)
	|	И ЗаданиеНаДоставкуДоставка.Ссылка = &ЗаданиеНаДоставку";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов); 
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ЗаданиеНаДоставку);
	
	Выборка = Запрос.Выполнить().Выбрать();                 
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Количество <> NULL Тогда	
			Возврат Выборка.Количество;	  
		КонецЕсли;
	КонецЕсли; 
	
	Возврат 1;	
	
КонецФункции

Функция ФОД_ПолучитьКоличествоГрузомест(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.КоличествоГрузомест;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьВысотуГруза(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.Высота;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьШиринуГруза(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.Ширина;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  


Функция ФОД_ПолучитьДлинуГруза(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.Длина;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции                      

Функция ФОД_ПолучитьВесБрутто(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.ВесБрутто;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьОбщийВесБрутто(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	МассивДокументов = ОбъектЗаполнения.Документ.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
	Возврат ПолучитьВесПоДокументамОснования(МассивДокументов);	
		
КонецФункции

Функция ФОД_ПолучитьОбщееКоличествоГрузомест(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	МассивДокументов = ОбъектЗаполнения.Документ.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");

	Возврат ПолучитьКоличествоМестПоДокументамОснованияИзЗаданияНаДоставку(МассивДокументов, ОбъектЗаполнения.ЗаданиеНаДоставку);	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьОбъявленнуюСтоимостьГруза(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.СтоимостьГруза;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьОбъемГрузомест(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат ОбъектЗаполнения.ОбъемГрузомест;	
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьТелефонКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ПолучитьТелефонПоОбъекту(ОбъектЗаполнения);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьТелефонКомпанииПеревозчика(ВерсияЗаполнения, Знач ОбъектЗаполнения, Документ = Неопределено)
	//+Белов А. 17.06.2026 #UT10-5921
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда   
		
		Если ЗначениеЗаполнено(Документ.ЗаказЗаявка) Тогда
			
			ТелефонКонтрагента = ПолучитьТелефонПоОбъекту(Документ.ЗаказЗаявка.Контрагент); 
			
			Если ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
				Возврат ТелефонКонтрагента;
			Иначе
				Возврат ПолучитьТелефонПоОбъекту(Документ.ЗаданиеНаДоставку.Водитель);	
			КонецЕсли;  
			
		Иначе
			Возврат ПолучитьТелефонПоОбъекту(Документ.ЗаданиеНаДоставку.Водитель);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда  
		
		Если ЗначениеЗаполнено(Документ.ЗаданиеНаДоставку) Тогда
			
			ТелефонКонтрагента = ПолучитьТелефонПоОбъекту(Документ.Контрагент); 
			
			Если ЗначениеЗаполнено(ТелефонКонтрагента) Тогда
				Возврат ТелефонКонтрагента;
			Иначе
				Возврат ПолучитьТелефонПоОбъекту(Документ.ЗаданиеНаДоставку.Водитель);	
			КонецЕсли;
			
		//+Белов А. 02.09.2026 #UT10-6021
		Иначе
			Возврат Документ.ТелефонКонтрагента;
		КонецЕсли;
		//-Белов А. 02.09.2026 #UT10-6021
		
	КонецЕсли;	
	
	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ПолучитьТелефонПоОбъекту(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Объект = &Объект";    	
	
	Запрос.УстановитьПараметр("Объект", Объект); 
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон); 
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;              
	
	Возврат "";
		
КонецФункции 

Функция ФОД_ПолучитьВодителей(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	Водитель = ОбъектЗаполнения.ЗаданиеНаДоставку.Водитель;
	
	ФИОМассив = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Водитель.Наименование, " ");
	
	СтруктураВодителя = Новый Структура();      
	
	Если ФИОМассив.Количество() > 0 Тогда
		
		СтруктураВодителя.Вставить("Фамилия", ФИОМассив[0]);    
		СтруктураВодителя.Вставить("Имя", ФИОМассив[1]);  
		
		Если ФИОМассив.Количество() > 2 Тогда
			СтруктураВодителя.Вставить("Отчество", ФИОМассив[2]);	
		КонецЕсли;
		
	КонецЕсли;
		   
	СтруктураВодителя.Вставить("Телефон", ПолучитьТелефонПоОбъекту(Водитель));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи
	|ИЗ
	|	РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних КАК ПаспортныеДанныеФизЛицСрезПоследних
	|ГДЕ
	|	ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо = &ФизЛицо
	|	И ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид = &ДокументВид";
	
	Запрос.УстановитьПараметр("ДокументВид", Справочники.ДокументыУдостоверяющиеЛичность.ВодительскоеУдостоверение);  
	Запрос.УстановитьПараметр("ФизЛицо", Водитель);  
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		
		СтруктураВодителя.Вставить("СерияВУ", Выборка.ДокументСерия); 
		СтруктураВодителя.Вставить("НомерВУ", Выборка.ДокументНомер); 
		СтруктураВодителя.Вставить("ДатаВУ", Выборка.ДокументДатаВыдачи);
		
	КонецЕсли;    	
	
	Если ЗначениеЗаполнено(Водитель.ИНН) Тогда
		СтруктураВодителя.Вставить("ИНН", Водитель.ИНН);
	ИначеЕсли ЗначениеЗаполнено(ОбъектЗаполнения.ЗаказЗаявка) Тогда
		СтруктураВодителя.Вставить("ИНН", ОбъектЗаполнения.ЗаказЗаявка.Контрагент.ИНН);
	КонецЕсли;    

	МассивВозврата = Новый Массив;
	МассивВозврата.Добавить(СтруктураВодителя);
	
	Возврат МассивВозврата;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьСериюВУ(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СерияВУ") Тогда
		Возврат ОбъектЗаполнения.СерияВУ;	
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции  


Функция ФОД_ПолучитьНомерВУ(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Если ОбъектЗаполнения.Свойство("НомерВУ") Тогда
		Возврат ОбъектЗаполнения.НомерВУ;	
	КонецЕсли;
	
	Возврат Неопределено;
		 
КонецФункции  


Функция ФОД_ПолучитьДатуВУ(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Если ОбъектЗаполнения.Свойство("ДатаВУ") Тогда
		Возврат Формат(ОбъектЗаполнения.ДатаВУ, "ДФ=dd.MM.yyyy");	
	КонецЕсли;
	
	Возврат Неопределено;
		
КонецФункции 

Функция ФОД_ПолучитьФамилиюВодителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Фамилия;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьИмяВодителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Имя;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьОтчествоВодителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Отчество;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьТелефонВодителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Телефон;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьИннВодителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ИНН;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции     

Функция ФОД_ПолучитьСопроводительныеДокументы(Знач ОбъектЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданныйДокументыОснования.Ссылка КАК Ссылка,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Организация.ИНН КАК ИННОтправителя,
	|	ТранспортнаяНакладнаяДокументыОснования.ДокументОснование.Контрагент.ИНН КАК ИННПолучателя,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер
	|ИЗ
	|	Документ.ТранспортнаяНакладная.ДокументыОснования КАК ТранспортнаяНакладнаяДокументыОснования
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|		ПО ТранспортнаяНакладнаяДокументыОснования.ДокументОснование = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|			И (СчетФактураВыданныйДокументыОснования.Ссылка.Проведен)
	|ГДЕ
	|	ТранспортнаяНакладнаяДокументыОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектЗаполнения);  
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из Рез Цикл
		Стр.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(Стр.Ссылка);
	КонецЦикла;
		
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Рез);
		
КонецФункции   

Функция ФОД_ПолучитьНомерУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат СокрЛП(ОбъектЗаполнения.Номер);
	
КонецФункции 

Функция ФОД_ПолучитьДатуУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат Формат(ОбъектЗаполнения.Дата, "ДФ=dd.MM.yyyy");
	
КонецФункции 

Функция ФОД_ИННОтправителяИзУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.ИННОтправителя;
	
КонецФункции 

Функция ФОД_ИННПолучателяИзУПД(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.ИННПолучателя;
	
КонецФункции 

Функция ФОД_ПолучитьИнструкцииГрузоотправителя(Знач ОбъектЗаполнения)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Грузоотправитель", ФОД_ПолучитьГрузоотправителяДокумента(ОбъектЗаполнения));
	СтруктураВозврата.Вставить("ЗаданиеНаДоставку", ОбъектЗаполнения.ЗаданиеНаДоставку);
	
	Возврат СтруктураВозврата;
		
КонецФункции  

Функция ФОД_ПолучитьТелефонКомпанииДляИнструкции(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ФОД_ПолучитьТелефонКомпании(Неопределено, ОбъектЗаполнения.Грузоотправитель);
	
КонецФункции 

Функция ФОД_ПолучитьДатуДоставкиДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЧасовойПояс = ПолучитьТаймЗону();              
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(КонецДня(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс);
	
КонецФункции 

Функция ФОД_ПолучитьТранспортноеСредство(Знач ОбъектЗаполнения)
	//+Белов А. 17.06.2026 #UT10-5921
	
	Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаданиеНаДоставку) Тогда
		Возврат ОбъектЗаполнения.ЗаданиеНаДоставку.Автомобиль;
	Иначе  
		//+Белов А. 02.09.2026 #UT10-6021
		Возврат Новый Структура("Грузоподъемность, Вместимость", ОбъектЗаполнения.Грузоподъемность, ОбъектЗаполнения.Вместимость);	
		//-Белов А. 02.09.2026 #UT10-6021
	КонецЕсли;
	
	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьГосНомерТС(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.РегистрационныйНомер;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции    

Функция ФОД_ПолучитьМаркуТС(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Наименование;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции    

Функция ФОД_ПолучитьГрузоподьемность(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Грузоподъемность;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьВместимость(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Вместимость;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  



Функция ФОД_ПолучитьДанныеПогрузки(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	Возврат Новый Структура("Документ, ЗаданиеНаДоставку", ОбъектЗаполнения, ОбъектЗаполнения.ЗаданиеНаДоставку);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьПлановуюДатуПогрузки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//+Белов А. 17.06.2026 #UT10-5921
	
	ЧасовойПояс = ПолучитьТаймЗону();              
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс);
	
	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьФактическуюДатуПогрузки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	ЧасовойПояс = ПолучитьТаймЗону();              
	
	ИсходнаяДата = ОбъектЗаполнения.ЗаданиеНаДоставку.Дата;
	ДатаПогрузки = Дата(Год(ИсходнаяДата), Месяц(ИсходнаяДата), День(ИсходнаяДата), Час(ИсходнаяДата), 0, 0);
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ДатаПогрузки, ЧасовойПояс);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции         

Функция ФОД_ПолучитьДатуУбытия(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 		
	ЧасовойПояс = ПолучитьТаймЗону();              
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ПогрузкаВАвто.Дата) КАК Дата
	|ИЗ
	|	Документ.ПогрузкаВАвто КАК ПогрузкаВАвто
	|ГДЕ
	|	ПогрузкаВАвто.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И ПогрузкаВАвто.Проведен";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ОбъектЗаполнения.ЗаданиеНаДоставку);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() И Выборка.Дата <> NULL Тогда
		ИсходнаяДата = Выборка.Дата;
	Иначе
		ИсходнаяДата = ОбъектЗаполнения.ЗаданиеНаДоставку.Дата;
	КонецЕсли;
	
	ДатаПогрузки = Дата(Год(ИсходнаяДата), Месяц(ИсходнаяДата), День(ИсходнаяДата), Час(ИсходнаяДата), 0, 0);
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ДатаПогрузки, ЧасовойПояс);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ПолучитьТаймЗону() Экспорт
	
	СоответствиеЗоныКоду = Новый Соответствие;
	СоответствиеЗоныКоду.Вставить("+1", 1);
	СоответствиеЗоныКоду.Вставить("+2", 2);
	СоответствиеЗоныКоду.Вставить("+3", 3);
	СоответствиеЗоныКоду.Вставить("+4", 4);
	СоответствиеЗоныКоду.Вставить("+5", 5);
	СоответствиеЗоныКоду.Вставить("+6", 6);
	СоответствиеЗоныКоду.Вставить("+7", 7);
	СоответствиеЗоныКоду.Вставить("+8", 8);
	СоответствиеЗоныКоду.Вставить("+9", 9);
	СоответствиеЗоныКоду.Вставить("+10", 10);
	СоответствиеЗоныКоду.Вставить("+11", 11);
	СоответствиеЗоныКоду.Вставить("+12", 12);
		
	ЧасовойПоясПредсталение = "+3";
	
	ЧасовойПоясФилиала = Константы.ЧасовойПоясФилиала.Получить();
	
	Если ЗначениеЗаполнено(ЧасовойПоясФилиала) Тогда
		ЧасовойПоясПредсталение = Строка(ЧасовойПоясФилиала);	
	КонецЕсли;
		
	Возврат СоответствиеЗоныКоду.Получить(ЧасовойПоясПредсталение);
	
КонецФункции

Функция ФОД_ПолучитьАдресПогрузки(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ФОД_ПолучитьАдресКомпании(ОбъектЗаполнения.Документ.Организация);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьПогрузчика(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПогрузкаВАвто.Ответственный
	|ИЗ
	|	Документ.ПогрузкаВАвто КАК ПогрузкаВАвто
	|ГДЕ
	|	ПогрузкаВАвто.ЗаданиеНаДоставку = &ЗаданиеНаДоставку
	|	И ПогрузкаВАвто.Проведен";
	
	Запрос.УстановитьПараметр("ЗаданиеНаДоставку", ОбъектЗаполнения.ЗаданиеНаДоставку);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Погрузчик = Выборка.Ответственный;
	Иначе
		Погрузчик = ОбъектЗаполнения.ЗаданиеНаДоставку.Водитель;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ФизЛицо = &ФизЛицо
	|	И НЕ Пользователи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ФизЛицо", Погрузчик);  
	
	Пользователь = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Пользователь = Выборка.Ссылка;
	КонецЕсли;	
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
	СтруктураФИОМассив = КНП_РазобратьНаименованиеИПНаМассив(Погрузчик.Наименование);
	
	Если СтруктураФИОМассив.Количество() > 0 Тогда
		СтруктураФИО.Фамилия = СтруктураФИОМассив[0];
	КонецЕсли;
	
	Если СтруктураФИОМассив.Количество() > 1 Тогда
		СтруктураФИО.Имя = СтруктураФИОМассив[1];
	КонецЕсли;
	
	Если СтруктураФИОМассив.Количество() > 2 Тогда
		СтруктураФИО.Отчество = СтруктураФИОМассив[2];
	КонецЕсли;
	
	Возврат Новый Структура("Погрузчик, Пользователь, ФИО", Погрузчик, Пользователь, СтруктураФИО);
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьИмяПогрузчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	Возврат ОбъектЗаполнения.ФИО.Имя;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьФамилиюПогрузчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ФИО.Фамилия;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьОтчествоПогрузчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ФИО.Отчество;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции     

Функция ФОД_ПолучитьДолжностьПогрузчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.Пользователь) И ЗначениеЗаполнено(ОбъектЗаполнения.Пользователь.Должность), ОбъектЗаполнения.Пользователь.Должность, "Грузчик");
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьПриказПогрузчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.Пользователь) И ЗначениеЗаполнено(ОбъектЗаполнения.Пользователь.Приказ), ОбъектЗаполнения.Пользователь.Приказ, "Должностные обязанности");
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьМаршрутПеревозки(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
	
	ЧасовойПояс = ПолучитьТаймЗону();

	СтруктураМаршрута = Новый Структура("ЧасовойПояс, ДатаПогрузки, ВремяПогрузки, Документ");
	СтруктураМаршрута.ЧасовойПояс = ЧасовойПояс;          
	
	Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаданиеНаДоставку) Тогда             
		
		СтруктураМаршрута.ДатаПогрузки = ПолучитьДатуВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс); 
		СтруктураМаршрута.ВремяПогрузки = ПолучитьВремяВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс);  
		
	//+Белов А. 02.09.2026 #UT10-6021
	Иначе
		
		СтруктураМаршрута.ДатаПогрузки = ПолучитьДатуВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ДатаПогрузки), ЧасовойПояс); 
		СтруктураМаршрута.ВремяПогрузки = ПолучитьВремяВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ДатаПогрузки), ЧасовойПояс);  
	//-Белов А. 02.09.2026 #UT10-6021
	КонецЕсли;
	
	СтруктураМаршрута.Документ = ОбъектЗаполнения;
	
	Возврат СтруктураМаршрута;

	
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ПолучитьНачалоЧасаПоДате(ИсходнаяДата)
	
	Возврат Дата(Год(ИсходнаяДата), Месяц(ИсходнаяДата), День(ИсходнаяДата), Час(ИсходнаяДата), 0, 0);     
	
КонецФункции

Функция ФОД_ПолучитьЧасовойПояс(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ЧасовойПояс;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьДатуПогрузки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ДатаПогрузки;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции   

Функция ФОД_ПолучитьАдресДоставки(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда 
		Возврат ФОД_ПолучитьАдресКомпании(ОбъектЗаполнения,,Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Иначе
		
		Документ = ОбъектЗаполнения.Документ;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда
			Возврат ФОД_ПолучитьАдресКомпании(Документ.Организация,,МОП_ПолучитьВидКИФактАдреса(Документ.Организация, КНП_ИмяКонфигурации()));		
		Иначе
			Возврат ФОД_ПолучитьАдресКомпании(Документ.Контрагент,, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);		
		КонецЕсли;
		
	КонецЕсли;
			
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьЮрАдресГрузополучателя(Знач ОбъектЗаполнения)
	
	Об = ОбъектЗаполнения;  
	
	Если ЗначениеЗаполнено(Об.ГоловнойКонтрагент) И Об.ГоловнойКонтрагент <> Об Тогда
		Об = Об.ГоловнойКонтрагент;
	КонецЕсли;
	
	Возврат ФОД_ПолучитьЮрАдресКомпании(Об,, МОП_ПолучитьВидКИЮрАдреса(Об, КНП_ИмяКонфигурации()));

КонецФункции
		
Функция ФОД_ПолучитьКППКомпанииПеревозчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.КПП;
		
КонецФункции  

Функция ФОД_ПолучитьЮрАдресКомпанииПеревозчика(Знач ОбъектЗаполнения)
	
	Возврат ФОД_ПолучитьЮрАдресКомпании(ОбъектЗаполнения,, МОП_ПолучитьВидКИЮрАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()));

КонецФункции    

Функция ФОД_ПолучитьЮрАдресКомпанииГрузоотправителя(Знач ОбъектЗаполнения)
	
	Возврат ФОД_ПолучитьЮрАдресКомпании(ОбъектЗаполнения,, МОП_ПолучитьВидКИЮрАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()));

КонецФункции


//Новые
Функция ПолучитьДатуВВидеСтрокиДляЛогистики(Дата, ЧасовойПояс)
	
	Возврат Формат(Дата, "ДФ=dd.MM.yyyyTHH:mm:ss") + ?(ЧасовойПояс >= 0, "+", "-") + Формат(ЧасовойПояс, "ЧЦ=2; ЧВН=; ЧГ=0") + ":00";
		
КонецФункции 

Функция ПолучитьВремяВВидеСтрокиДляЛогистики(Дата, ЧасовойПояс)
	
	Возврат Формат(Дата, "ДФ=HH:mm:ss") + ?(ЧасовойПояс >= 0, "+", "-") + Формат(ЧасовойПояс, "ЧЦ=2; ЧВН=; ЧГ=0") + ":00";
		
КонецФункции

Функция ФОД_ПолучитьВремяПогрузки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.ВремяПогрузки;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьТочкиМаршрута(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921

	ЧасовойПояс = ПолучитьТаймЗону();
	МассивВозврата = Новый Массив; 
	
	СтруктураТочки = Новый Структура("Вид, Номер, Дата, Время, Адрес, Документ", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, ОбъектЗаполнения);	
	СтруктураТочки.Номер = 1; 
	СтруктураТочки.Вид = "Погрузка";
	     
	Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаданиеНаДоставку) Тогда
		
		СтруктураТочки.Дата = ПолучитьДатуВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс);
		СтруктураТочки.Время = ПолучитьВремяВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата), ЧасовойПояс);
		
	Иначе 
	//+Белов А. 02.09.2026 #UT10-6021
		
		СтруктураТочки.Дата = ПолучитьДатуВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ДатаПогрузки), ЧасовойПояс);
		СтруктураТочки.Время = ПолучитьВремяВВидеСтрокиДляЛогистики(ПолучитьНачалоЧасаПоДате(ОбъектЗаполнения.ДатаПогрузки), ЧасовойПояс);
		
	//-Белов А. 02.09.2026 #UT10-6021
	КонецЕсли;
	
	СтруктураТочки.Адрес = ФОД_ПолучитьАдресДоставки(Новый Структура("Документ", ОбъектЗаполнения));
	
	МассивВозврата.Добавить(СтруктураТочки);	
	
	Инд = 1; 
	
	Если ЗначениеЗаполнено(ОбъектЗаполнения.ЗаданиеНаДоставку) Тогда
		
		ТаблицаМаршрута = Документы.ЗаданиеНаДоставку.ПолучитьТаблицуМаршрутаДляОтправкиВЭДО(ОбъектЗаполнения.ЗаданиеНаДоставку);
		
		Для каждого Стр Из ТаблицаМаршрута Цикл
			
			Инд = Инд + 1;
			
			СтруктураТочки = Новый Структура("Вид, Номер, Дата, Время, Адрес, Документ", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, ОбъектЗаполнения);	
			СтруктураТочки.Номер = Инд; 
			СтруктураТочки.Вид = "Выгрузка";
			СтруктураТочки.Дата = ПолучитьДатуВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата, ЧасовойПояс);
			СтруктураТочки.Время = ПолучитьВремяВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ЗаданиеНаДоставку.Дата, ЧасовойПояс);
			СтруктураТочки.Адрес = ФОД_ПолучитьАдресДоставки(Стр.Контрагент); 
			
			МассивВозврата.Добавить(СтруктураТочки);
			
		КонецЦикла;	
		
	Иначе  
		//+Белов А. 02.09.2026 #UT10-6021
		
		Для каждого Стр Из ОбъектЗаполнения.Грузополучатели Цикл
			
			Инд = Инд + 1;
			
			СтруктураТочки = Новый Структура("Вид, Номер, Дата, Время, Адрес, Документ", Неопределено, Неопределено, Неопределено, Неопределено, Неопределено, ОбъектЗаполнения);	
			СтруктураТочки.Номер = Инд; 
			СтруктураТочки.Вид = "Выгрузка";
			СтруктураТочки.Дата = ПолучитьДатуВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ДатаПогрузки, ЧасовойПояс);
			СтруктураТочки.Время = ПолучитьВремяВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ДатаПогрузки, ЧасовойПояс);
			СтруктураТочки.Адрес = ФОД_ПолучитьАдресДоставки(Стр.Контрагент); 
			
			МассивВозврата.Добавить(СтруктураТочки);
			
		КонецЦикла;	             
		
		//-Белов А. 02.09.2026 #UT10-6021
	КонецЕсли;
		
	Возврат МассивВозврата;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьВидТочки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Вид;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции  

Функция ФОД_ПолучитьНомерТочки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Номер;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьДатуТочки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Дата;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьВремяТочки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Время;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 

Функция ФОД_ПолучитьАдресТочки(Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Возврат ОбъектЗаполнения.Адрес;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьИмяВладельцаИнфраструктуры(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//+Белов А. 17.06.2026 #UT10-5921
	
	Если ОбъектЗаполнения.Вид = "Погрузка" Тогда
		
		//+Белов А. 01.09.2026 #UT10-6033
		Если ТипЗнч(ОбъектЗаполнения.Документ.Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
			Возврат ОбъектЗаполнения.Документ.Организация.ГоловнойКонтрагент.НаименованиеПолное; 
		//-Белов А. 01.09.2026 #UT10-6033
		Иначе
			Возврат ОбъектЗаполнения.Документ.Организация.НаименованиеПолное;
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	//-Белов А. 17.06.2026 #UT10-5921
КонецФункции

Функция ФОД_ПолучитьИННВладельцаИнфраструктуры(ВерсияЗаполнения, Знач ОбъектЗаполнения)
//+Белов А. 17.06.2026 #UT10-5921
 	
	Если ОбъектЗаполнения.Вид = "Погрузка" Тогда
		
		//+Белов А. 01.09.2026 #UT10-6033
		Если ТипЗнч(ОбъектЗаполнения.Документ.Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
			Возврат ОбъектЗаполнения.Документ.Организация.ГоловнойКонтрагент.ИНН;   
		//-Белов А. 01.09.2026 #UT10-6033
		Иначе
			Возврат ОбъектЗаполнения.Документ.Организация.ИНН;
		КонецЕсли;

	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
//-Белов А. 17.06.2026 #UT10-5921
КонецФункции 


Функция ФОД_ПолучитьДанныеДляТитула3(Знач ОбъектЗаполнения)
	
	СтруктураТитула3 = Новый Структура;
	СтруктураТитула3.Вставить("ДанныеДокумента", ОбъектЗаполнения);
	
	Возврат СтруктураТитула3;
	
КонецФункции  

Функция ФОД_ПолучитьДатуПрибытияТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЧасовойПояс = ПолучитьТаймЗону();
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ДанныеДокумента.ФактическаяДатаИВремяПрибытия, ЧасовойПояс);
	
КонецФункции  

Функция ФОД_ПолучитьДатуОтправленияТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЧасовойПояс = ПолучитьТаймЗону();
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ДанныеДокумента.ФактическаяДатаИВремяУбытия, ЧасовойПояс);
	
КонецФункции

Функция ФОД_ПолучитьПлановуюДатуПрибытияТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЧасовойПояс = ПолучитьТаймЗону();
	
	Возврат ПолучитьДатуВВидеСтрокиДляЛогистики(ОбъектЗаполнения.ДанныеДокумента.ПлановаяДатаИВремяПрибытия, ЧасовойПояс);
	
КонецФункции

Функция ФОД_ПолучитьКоличествоМестТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.ДанныеДокумента.КоличествоМест;	
	
КонецФункции

Функция ФОД_ПолучитьСведенияОСостоянииГрузаТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.ДанныеДокумента.СостояниеГруза;	
	
КонецФункции

Функция ФОД_ПолучитьВесТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.ДанныеДокумента.Вес;
	
КонецФункции

Функция ФОД_ПолучитьАдресРазгрузкиТитул3(Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.ДанныеДокумента.АдресДоставки;		
	
КонецФункции

Функция ФОД_ПолучитьАдресВВидеСтрокиТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Строка") Тогда
		Возврат ОбъектЗаполнения;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции 

Функция ФОД_ПолучитьИндексТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Индекс") Тогда
		Возврат ОбъектЗаполнения.Индекс;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьКодРегионаТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("КодРегион") Тогда
		Возврат ОбъектЗаполнения.КодРегион;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьРайонТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения) 
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Район") Тогда
		Возврат ОбъектЗаполнения.Район;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьГородТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Город") Тогда
		Возврат ОбъектЗаполнения.Город;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьНаселенныйПунктТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения) 
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("НаселПункт") Тогда
		Возврат ОбъектЗаполнения.НаселПункт;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьУлицуТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения) 
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Улица") Тогда
		Возврат ОбъектЗаполнения.Улица;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции

Функция ФОД_ПолучитьДомТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Дом") Тогда
		Возврат ОбъектЗаполнения.Дом;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции 

Функция ФОД_ПолучитьСтроениеТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Корпус") Тогда
		Возврат ОбъектЗаполнения.Корпус;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции


Функция ФОД_ПолучитьПомещениеТитул3(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("Кварт") Тогда
		Возврат ОбъектЗаполнения.Кварт;	
	КонецЕсли;    
	
	Возврат "";	
	
КонецФункции



Функция ФОД_ПолучитьНазваниеЭкономическогоСубъекта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.Организация.Наименование;
		
КонецФункции  

Функция ФОД_ПолучитьНазваниеДоговораПеревозки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.ДоговорКонтрагента.Наименование;
		
КонецФункции   

Функция ФОД_ПолучитьНомерДоговораПеревозки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.ДоговорКонтрагента.Номер;
		
КонецФункции          

Функция ФОД_ПолучитьДатуДоговораПеревозки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат Формат(ОбъектЗаполнения.ДоговорКонтрагента.Дата, "ДФ=dd.MM.yyyy");
		
КонецФункции          

Функция ФОД_ПолучитьИННПеревозчика(ВерсияЗаполнения, Знач ОбъектЗаполнения)
 	
	Возврат ОбъектЗаполнения.Контрагент.ИНН;
		
КонецФункции 




//Новые2 конец


Функция ФОД_ПолучитьПокупателяДокумента(Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		АнализируемыйДокумент = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
	Иначе
		АнализируемыйДокумент = ОбъектЗаполнения;
	КонецЕсли;
	
	Если МОП_ЭтоАктВыполненныхРабот(АнализируемыйДокумент) Тогда
		Возврат Неопределено;
	ИначеЕсли МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		Возврат Неопределено;
	Иначе
		Возврат МОП_ПолучитьПокупателя(ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьГрузоотправителяДокумента(Знач ОбъектЗаполнения)
	//Changelog
	//
	//23.10.2019 - отключаем грузоотправителя, если он идентичен Организации
	
	Результат = Неопределено;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		АнализируемыйДокумент = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
	Иначе
		АнализируемыйДокумент = ОбъектЗаполнения;
	КонецЕсли;
	
	Если МОП_ЭтоАктВыполненныхРабот(АнализируемыйДокумент) Тогда
		Результат = Неопределено;
	ИначеЕсли МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		Результат = Неопределено;
	Иначе
		Результат = МОП_ПолучитьГрузоотправителя(ОбъектЗаполнения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ФОД_ПолучитьГрузоперевозчикаДокумента(Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		АнализируемыйДокумент = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
	Иначе
		АнализируемыйДокумент = ОбъектЗаполнения;
	КонецЕсли;
	
	Если МОП_ЭтоАктВыполненныхРабот(АнализируемыйДокумент) Тогда
		Возврат Неопределено;
	ИначеЕсли МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		Возврат Неопределено;
	Иначе
		Возврат МОП_ПолучитьГрузоперевозчика(ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьАдресКомпании(Знач ОбъектЗаполнения, Документ = Неопределено, ВидКонтактнойИнформации = Неопределено)
	//Changelog
	//
	//22.03.2019 - добавлено логирование незаполненности структуры адреса в базе 1С
	//18.04.2019 - заполнение фактическим адресом
	
	ЗагрузитьДанныеИзЭДО = Ложь;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Филиал = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;	
			ИначеЕсли ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;
			КонецЕсли;
			
		КонецЕсли; 

		Если ЗначениеЗаполнено(Филиал) И УФилиалаЗаполненАдресОП(Филиал) И (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда
			
			ОбъектЗаполнения = Филиал; 
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОбособленногоПодразделения; 

		ИначеЕсли ЗначениеЗаполнено(Филиал) 
			И УФилиалаЗаполненАдрес(Филиал) И (НЕ ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда 
			
			ОбъектЗаполнения = Филиал; 
			ВидКонтактнойИнформации = МОП_ПолучитьВидКИФактАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()); 
			
		Иначе            
			
			Если Документ <> Неопределено Тогда
				ОбъектЗаполнения = Документ.ДокументОснование.Контрагент;
			КонецЕсли;
			 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		ВидКонтактнойИнформации = МОП_ПолучитьВидКИФактАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации());
	Иначе
		
		Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
			ВидКонтактнойИнформации = МОП_ПолучитьВидКИЮрАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()); 	
		КонецЕсли;   	
		
	КонецЕсли;
	
	СтруктураАдреса = КЗП_ПолучитьСтруктуруАдресаИзБазы(ОбъектЗаполнения, КНП_ИмяКонфигурации(), ВидКонтактнойИнформации );
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.КодРегиона) Тогда
		
		ДобавитьВЖурнал("Не заполнен код региона в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли;     
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.Индекс) Тогда
		
		ДобавитьВЖурнал("Не заполнен индекс в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли;            
	
	Если ЗагрузитьДанныеИзЭДО Тогда
		
		ДанныеКонтрагента = ПолучитьДанныеКонтрагентаПоИНН(ОбъектЗаполнения.ИНН);
		
		Если ТипЗнч(ДанныеКонтрагента) = Тип("Соответствие") Тогда
			
			СоответствиеАдреса = ДанныеКонтрагента.Получить("address");
			СтруктураАдреса = КНП_КонвертироватьАдресИзСоответствия(СоответствиеАдреса);
			
		КонецЕсли;
		
	КонецЕсли;    
	
	Возврат СтруктураАдреса;

КонецФункции

Функция ФОД_ПолучитьЮрАдресКомпании(Знач ОбъектЗаполнения, Документ = Неопределено, ВидКонтактнойИнформации = Неопределено)
	
	ЗагрузитьДанныеИзЭДО = Ложь;
		
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Филиал = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;	
			ИначеЕсли ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;
			КонецЕсли;
			
		КонецЕсли; 

		Если ЗначениеЗаполнено(Филиал) И УФилиалаЗаполненАдресОП(Филиал) И (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации")) Тогда
			ОбъектЗаполнения = Филиал; 
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОбособленногоПодразделения;
		ИначеЕсли ЗначениеЗаполнено(Филиал) 
			И УФилиалаЗаполненАдрес(Филиал) Тогда 
				
			ОбъектЗаполнения = Филиал; 
			ВидКонтактнойИнформации = МОП_ПолучитьВидКИФактАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()); 
				
		Иначе
			
			Если Документ <> Неопределено Тогда
				ОбъектЗаполнения = Документ.ДокументОснование.Контрагент; 
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		ВидКонтактнойИнформации = МОП_ПолучитьВидКИЮрАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации());
	Иначе
		
		Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда
			ВидКонтактнойИнформации = МОП_ПолучитьВидКИФактАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации()); 	
		КонецЕсли;   	
		
	КонецЕсли;
	
	СтруктураАдреса = КЗП_ПолучитьСтруктуруАдресаИзБазы(ОбъектЗаполнения, КНП_ИмяКонфигурации(), ВидКонтактнойИнформации);
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.КодРегиона) Тогда
		
		ДобавитьВЖурнал("Не заполнен код региона в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли;     
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.Индекс) Тогда
		
		ДобавитьВЖурнал("Не заполнен индекс в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли;            
	
	Если ЗагрузитьДанныеИзЭДО Тогда
		
		ДанныеКонтрагента = ПолучитьДанныеКонтрагентаПоИНН(ОбъектЗаполнения.ИНН);
		
		Если ТипЗнч(ДанныеКонтрагента) = Тип("Соответствие") Тогда
			
			СоответствиеАдреса = ДанныеКонтрагента.Получить("address");
			СтруктураАдреса = КНП_КонвертироватьАдресИзСоответствия(СоответствиеАдреса);
			
		КонецЕсли;
		
	КонецЕсли;    
	
	Возврат СтруктураАдреса;

КонецФункции

Функция ФОД_ПолучитьАдресПокупателя (Знач ОбъектЗаполнения, Документ = Неопределено)
	//Changelog
	//
	//22.03.2019 - добавлено логирование незаполненности структуры адреса в базе 1С
	//18.04.2019 - заполнение фактическим адресом
	
	ЗагрузитьДанныеИзЭДО = Ложь;
	
	ВидКонтактнойИнформации = Неопределено;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Филиал = Неопределено;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			
			Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;	
			ИначеЕсли ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				Филиал = Документ.ДокументОснование.Грузополучатель;
			КонецЕсли;
			
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Филиал) И УФилиалаЗаполненАдресОП(Филиал) И (ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") 
			И ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")) Тогда
			
			ОбъектЗаполнения = Филиал; 
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ЮрАдресОбособленногоПодразделения;
			
		Иначе
			ОбъектЗаполнения = Документ.ДокументОснование.Контрагент; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		ВидКонтактнойИнформации = МОП_ПолучитьВидКИФактАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации());
	Иначе
		
		Если Не ЗначениеЗаполнено(ВидКонтактнойИнформации) Тогда			
			ВидКонтактнойИнформации = МОП_ПолучитьВидКИЮрАдреса(ОбъектЗаполнения, КНП_ИмяКонфигурации());
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураАдреса = КЗП_ПолучитьСтруктуруАдресаИзБазы(ОбъектЗаполнения, КНП_ИмяКонфигурации(), ВидКонтактнойИнформации );
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.КодРегиона) Тогда
		
		ДобавитьВЖурнал("Не заполнен код региона в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли; 
	
	Если СтруктураАдреса.ТипАдреса <> "text" И НЕ ЗначениеЗаполнено(СтруктураАдреса.Индекс) Тогда
		
		ДобавитьВЖурнал("Не заполнен индекс в адресе компании " + ОбъектЗаполнения, "ПолучитьАдресКомпании");
		ЗагрузитьДанныеИзЭДО = Истина;
		
	КонецЕсли;  
	
	Если ЗагрузитьДанныеИзЭДО Тогда
		
		ДанныеКонтрагента = ПолучитьДанныеКонтрагентаПоИНН(ОбъектЗаполнения.ИНН);
		
		Если ТипЗнч(ДанныеКонтрагента) = Тип("Соответствие") Тогда
			
			СоответствиеАдреса = ДанныеКонтрагента.Получить("address");
			СтруктураАдреса = КНП_КонвертироватьАдресИзСоответствия(СоответствиеАдреса);
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат СтруктураАдреса;

КонецФункции

Функция УФилиалаЗаполненАдрес(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид
	|	И НЕ КонтактнаяИнформация.Представление ПОДОБНО """"";
	
	Запрос.УстановитьПараметр("Объект", Филиал);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;		
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции 

Функция УФилиалаЗаполненАдресОП(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид
	|	И НЕ КонтактнаяИнформация.Представление ПОДОБНО """"";
	
	Запрос.УстановитьПараметр("Объект", Филиал);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.ЮрАдресОбособленногоПодразделения); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;		
	КонецЕсли;         
	
	Возврат Ложь;

КонецФункции

Функция ФОД_ПолучитьСведенияОПередачеТоваров(Знач ОбъектЗаполнения)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Договор", ФОД_ПолучитьДоговорПоНакладной(ОбъектЗаполнения));
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("СодержаниеОперации", "");	
	Возврат СтруктураДанных;

КонецФункции

Функция ФОД_ПолучитьДоговорПоНакладной(Знач ОбъектЗаполнения)
	//Changelog
	//
	//18.10.2019 - добавлена пустышка договора
	//12.12.2019 - часть функции вынесена в отдельную функцию
	
	Если ВеткаРазработки = "ТЭК-Торг" Тогда
		Возврат Новый Структура("Наименование,Дата,Номер", "Без документа-основания", Дата(2000,1,1), "-");	
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Договор") Тогда
			Возврат ОбъектЗаполнения.Договор;	
		КонецЕсли;
		
	Иначе
		
		Договор = МОП_ПолучитьДоговорПоДокументу(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(Договор) Тогда
			Возврат Договор;
		КонецЕсли;
		
		Если МОП_ЭтоПлатежка(ОбъектЗаполнения) Тогда
			
			ВходящаяДата = ?(КНП_ЕстьРеквизит(ОбъектЗаполнения, "ДатаВходящегоДокумента"), ОбъектЗаполнения.ДатаВходящегоДокумента, ОбъектЗаполнения.Дата);
			ВходящийНомер = ?(КНП_ЕстьРеквизит(ОбъектЗаполнения, "НомерВходящегоДокумента"), ОбъектЗаполнения.НомерВходящегоДокумента, ОбъектЗаполнения.Номер);
			Возврат Новый Структура("Наименование,Дата,Номер", "Платежный документ", ВходящаяДата, ВходящийНомер);	
			
		КонецЕсли;
		
		Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
			
			ОснованиеОбъектаЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
			
			Если ЗначениеЗаполнено(ОснованиеОбъектаЗаполнения) Тогда
				Возврат ФОД_ПолучитьДоговорПоНакладной(ОснованиеОбъектаЗаполнения);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Структура("Наименование,Дата,Номер", "Без договора", Дата(2000,1,1), "-");

КонецФункции

Функция ФОД_ПолучитьИнвойсДокумент(Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 09.04.2026 #UT10-5800
	Результат = Документы.ПоступлениеТоваровУслуг.ПустаяСсылка();
	
	Если МОП_ЭтоАктОРасхожденияхПослеПриемки(ОбъектЗаполнения) Тогда
		Результат = ОбъектЗаполнения.ДокументОснование;
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьНомерИнвойсДокумент(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 09.04.2026 #UT10-5800
	НомерВходящегоДокумента = "";
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("НомерВходящегоДокумента") Тогда
			НомерВходящегоДокумента = СокрЛП(ОбъектЗаполнения.НомерВходящегоДокумента);
		КонецЕсли;
		
	Иначе
		НомерВходящегоДокумента = СокрЛП(ОбъектЗаполнения.НомерВходящегоДокумента);
	КонецЕсли;
	
	Возврат НомерВходящегоДокумента;	
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьДатаИнвойсДокумент(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 09.04.2026 #UT10-5800
	ДатаВходящегоДокумента = "";
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("ДатаВходящегоДокумента") Тогда
			ДатаВходящегоДокумента = Формат(ОбъектЗаполнения.ДатаВходящегоДокумента, "ДФ=дд.ММ.гггг");
		КонецЕсли;
		
	Иначе
		ДатаВходящегоДокумента = Формат(ОбъектЗаполнения.ДатаВходящегоДокумента, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	Возврат ДатаВходящегоДокумента;	
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьФизЛицоОтправителя(Знач ОбъектЗаполнения)
	//Changelog
	//
	//08.04.2019 - смена заполнения данных отправителя по данным DiFlow
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Должность", 			СтрПолучитьСтроку(ДанныеПодписанта, 1) );	
	СтруктураДанных.Вставить("Фамилия", 			СтрПолучитьСтроку(ДанныеПодписанта, 2) );
	СтруктураДанных.Вставить("Имя", 				СтрПолучитьСтроку(ДанныеПодписанта, 3) );
	СтруктураДанных.Вставить("Отчество", 			СтрПолучитьСтроку(ДанныеПодписанта, 4) );
	СтруктураДанных.Вставить("ТипПодписанта", 		СтрПолучитьСтроку(ДанныеПодписанта, 5) );
	СтруктураДанных.Вставить("ОснованиеПолномочий", Неопределено );
	Возврат СтруктураДанных;
	
КонецФункции

Функция ФОД_ПолучитьТранспортнуюНакладную(Знач ОбъектЗаполнения)
	
	Возврат МОП_ПолучитьТранспортнуюНакладную(ОбъектЗаполнения);	

КонецФункции

Функция ФОД_ПолучитьПодписантаДокумента(Знач ОбъектЗаполнения)
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ДолжностьПодписанта", 		СтрПолучитьСтроку(ДанныеПодписанта, 1) );	
	СтруктураДанных.Вставить("ФамилияПодписанта", 			СтрПолучитьСтроку(ДанныеПодписанта, 2) );
	СтруктураДанных.Вставить("ИмяПодписанта", 				СтрПолучитьСтроку(ДанныеПодписанта, 3) );
	СтруктураДанных.Вставить("ОтчествоПодписанта", 			СтрПолучитьСтроку(ДанныеПодписанта, 4) );
	СтруктураДанных.Вставить("ТипПодписанта", 				СтрПолучитьСтроку(ДанныеПодписанта, 5) );
	СтруктураДанных.Вставить("ОбластьПолномочийПодписанта", Число(СтрПолучитьСтроку(ДанныеПодписанта, 6) ) );
	СтруктураДанных.Вставить("ОГРНИП", 						СтрПолучитьСтроку(ДанныеПодписанта, 7) );
	СтруктураДанных.Вставить("СтатусПодписанта", ?(Найти(СтруктураДанных.ТипПодписанта, "IP"), 4, 1) );
	Возврат СтруктураДанных;

КонецФункции

Функция ФОД_ПолучитьПлатежныйДокумент(Знач ОбъектЗаполнения) 
	
	СтруктураДанных = Новый  Структура;
	СтруктураПД = МОП_ПолучитьСтруктуруПлатежногоДокумента(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(СтруктураПД) Тогда
		
		СтруктураДанных.Вставить("Номер", СтруктураПД.Номер);
		СтруктураДанных.Вставить("Дата", СтруктураПД.Дата);
	Иначе
		
		СтруктураДанных.Вставить("Номер", "");
		СтруктураДанных.Вставить("Дата", "");
		
	КонецЕсли;
	
	
	Возврат СтруктураДанных;

КонецФункции

Функция ФОД_ПолучитьКорректируемыйДокумент(Знач ОбъектЗаполнения)
	
	Возврат МОП_ПолучитьСсылкуНаКорректировку(ОбъектЗаполнения);		

КонецФункции

Функция ФОД_ПолучитьКорректируемуюСчетФактуру(Знач ОбъектЗаполнения)
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ИсправляемыйСчетФактура") Тогда
		Возврат ОбъектЗаполнения.ИсправляемыйСчетФактура;
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "СчетФактураОснование") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.СчетФактураОснование) Тогда
			Возврат ОбъектЗаполнения.СчетФактураОснование;
		Иначе

			Для каждого Стр ИЗ ОбъектЗаполнения.ДокументыОснования Цикл
				
				Если ЗначениеЗаполнено(Стр.ИсходныйДокумент) И ТипЗнч(Стр.ИсходныйДокумент) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
					Возврат Стр.ИсходныйДокумент;
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьКорректируемыйТовар(Знач ОбъектЗаполнения)
	
	МассивСтруктур = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		Возврат МассивСтруктур;
	КонецЕсли;
	
	Если МОП_ЭтоКорректировкаРеализации(ОбъектЗаполнения) Тогда
		
		//+Доработка: загрузка кодов маркировки для УКД
		Если Константы.ЭДО_ВыгружатьКодыМаркировки.Получить() 
			И Перечисления.УсловияРаботыСЧЗ.УсловиеВыгрузкиЧЗВЭДО(ОбъектЗаполнения.ДоговорКонтрагента.УсловияРаботыСЧЗ) Тогда
			БуферКодовМаркировкиТоваров = Справочники.ШтрихкодыНоменклатуры.ПолучитьКодыМаркировкиПоДокументу(ОбъектЗаполнения);
		Иначе
			БуферКодовМаркировкиТоваров.Очистить();
		КонецЕсли;
		//-Доработка: загрузка кодов маркировки для УКД
		
		ТаблицаТоваров = МОП_ПолучитьСтруктуруТаблицыКорректировкиТоваров(ОбъектЗаполнения);
		ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ТаблицаТоваров);
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
			ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
			СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
			МассивСтруктур.Добавить(СтруктураДанных);
			
		КонецЦикла;		
		
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) ИЛИ МОП_ЭтоСчетНаОплату(ОбъектЗаполнения) Тогда
		
		ОснованиеОбъектаЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(ОснованиеОбъектаЗаполнения) 
			И МОП_ЭтоКорректировкаРеализации(ОснованиеОбъектаЗаполнения) Тогда
			МассивСтруктур = ФОД_ПолучитьКорректируемыйТовар(ОснованиеОбъектаЗаполнения);
			
		Иначе //Предположительно это авансовая СФ
			
			Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") Тогда
				
				ФиксированнаяСтруктураДанных = КНП_СтруктураНаОснованииКолонокТЧ(ОбъектЗаполнения.Авансы);
				
				Для Каждого Товар Из ОбъектЗаполнения.Авансы Цикл
					
					СтруктураДанных = Новый Структура(ФиксированнаяСтруктураДанных);
					ЗаполнитьЗначенияСвойств(СтруктураДанных, Товар);
					СтруктураДанных.Вставить("Ссылка", ОбъектЗаполнения);
					МассивСтруктур.Добавить(СтруктураДанных);
					
				КонецЦикла;		
				
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Возврат МассивСтруктур;	

КонецФункции

Функция ФОД_ПолучитьНаименованиеДопРеквизита(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Свойство") И ЗначениеЗаполнено(ОбъектЗаполнения.Свойство) Тогда
			Возврат ОбъектЗаполнения.Свойство.Наименование;	
		КонецЕсли;
		
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьЗначениеДопРеквизита(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Значение") И ЗначениеЗаполнено(ОбъектЗаполнения.Значение) Тогда
			Возврат Строка(ОбъектЗаполнения.Значение);	
		КонецЕсли;	
		
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьТипПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ТипПодписанта") Тогда
		Возврат ОбъектЗаполнения.ТипПодписанта;
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьДокументДоставки(Знач ОбъектЗаполнения)
	
	МассивВозврата = Новый Массив;
	МассивВозврата.Добавить(ОбъектЗаполнения);
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ФОД_ПолучитьЗаголовокДокументаДоставки(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//+Марков И. 09.04.2025 #UT10-5182
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ТЧ = ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения);
		
		Возврат "Универсальный передаточный документ";
				
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ТЧ = ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения.ДокументОснование);
		
		Возврат "Универсальный передаточный документ";
		
	КонецЕсли;
	
	//Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
	//	
	//	ТЧ = ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения);
	//	
	//	Если ОбъектЗаполнения.Дата >= Дата("01.10.2024 00:00:00") Тогда
	//		Возврат "Универсальный передаточный документ";
	//	Иначе
	//		
	//		Если ТЧ.Количество() > 0 Тогда
	//			Возврат "Реализация, УПД N п/п 1-" + Формат(ТЧ.Количество(), "ЧГ=0")
	//		КонецЕсли; 
	//		
	//	КонецЕсли;
	//	
	//ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
	//	
	//	ТЧ = ФОД_ПолучитьТабличнуюЧастьТоваровПоРеализации(ОбъектЗаполнения.ДокументОснование);
	//	
	//	Если ОбъектЗаполнения.Дата >= Дата("01.10.2024 00:00:00") Тогда
	//		Возврат "Универсальный передаточный документ";
	//	Иначе
	//		
	//		Если ТЧ.Количество() > 0 Тогда
	//			Возврат "Реализация, УПД N п/п 1-" + Формат(ТЧ.Количество(), "ЧГ=0")
	//		КонецЕсли; 
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	//-Марков И. 09.04.2025 #UT10-5182
	
	Возврат "";
	
КонецФункции

Функция ФОД_ПолучитьДолжностьПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ДолжностьПодписанта") Тогда
		Возврат ОбъектЗаполнения.ДолжностьПодписанта;
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьИмяКомпанииПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Организация.Наименование;

КонецФункции

Функция ФОД_ПолучитьИННКомпанииПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Организация.ИНН;

КонецФункции

Функция ФОД_ПолучитьФамилиюПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ФамилияПодписанта") И ЗначениеЗаполнено(ОбъектЗаполнения.ФамилияПодписанта) Тогда
		Возврат ОбъектЗаполнения.ФамилияПодписанта;
	КонецЕсли;
	
	Возврат " ";

КонецФункции

Функция ФОД_ПолучитьИмяПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ИмяПодписанта") И ЗначениеЗаполнено(ОбъектЗаполнения.ИмяПодписанта) Тогда
		Возврат ОбъектЗаполнения.ИмяПодписанта;
	КонецЕсли;
	
	Возврат " ";

КонецФункции

Функция ФОД_ПолучитьОтчествоПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ОтчествоПодписанта") И ЗначениеЗаполнено(ОбъектЗаполнения.ОтчествоПодписанта) Тогда
		Возврат ОбъектЗаполнения.ОтчествоПодписанта;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьОбластьПолномочий(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ОбластьПолномочийПодписанта") Тогда
		Возврат ОбъектЗаполнения.ОбластьПолномочийПодписанта;
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьСтатусПодписанта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СтатусПодписанта") Тогда
		Возврат ОбъектЗаполнения.СтатусПодписанта;
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьФамилиюФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Фамилия") И ЗначениеЗаполнено(ОбъектЗаполнения.Фамилия) Тогда
		Возврат ОбъектЗаполнения.Фамилия;
	КонецЕсли;
	
	Возврат Неопределено
КонецФункции

Функция ФОД_ПолучитьИмяФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Имя") И ЗначениеЗаполнено(ОбъектЗаполнения.Имя) Тогда
		Возврат ОбъектЗаполнения.Имя;
	КонецЕсли;
	
	Возврат " ";

КонецФункции

Функция ФОД_ПолучитьДолжностьФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ОбъектЗаполнения.Должность) Тогда
		Возврат ОбъектЗаполнения.Должность;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Функция ФОД_ПолучитьОтчествоФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Отчество") И ЗначениеЗаполнено(ОбъектЗаполнения.Отчество) Тогда
		Возврат ОбъектЗаполнения.Отчество;
	КонецЕсли;
	
	Возврат Неопределено	

КонецФункции

Функция ФОД_ПолучитьОснованиеПолномочийФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ОснованиеПолномочий") И ЗначениеЗаполнено(ОбъектЗаполнения.ОснованиеПолномочий) Тогда
		Возврат ОбъектЗаполнения.ОснованиеПолномочий;
	КонецЕсли;
	
	Если ВерсияЗаполнения = "6.3" Тогда
		Возврат "Нет данных";
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ФОД_ЭтоИП(Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("ОГРНИП") И ЗначениеЗаполнено(ОбъектЗаполнения.ОГРНИП) Тогда
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ИНН") И ЗначениеЗаполнено(ОбъектЗаполнения.ИНН) Тогда
			Возврат СтрДлина(ОбъектЗаполнения.ИНН) > 10;  
		ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения, "ГоловнойКонтрагент") И ЗначениеЗаполнено(ОбъектЗаполнения.ГоловнойКонтрагент) Тогда
			Возврат СтрДлина(ОбъектЗаполнения.ГоловнойКонтрагент.ИНН) > 10;
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ФОД_ПолучитьТипКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ?(ФОД_ЭтоИП(ОбъектЗаполнения), "IP", "UL");  
	
КонецФункции

Функция ФОД_ПолучитьИмяКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		
		//СтруктураНаименования = КЗП_СформироватьСтруктуруИП(ОбъектЗаполнения);   
		НаименованиеПолное = ОбъектЗаполнения.НаименованиеПолное;
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "ИП ", "");
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, " ИП", "");
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "Индивидуальный предприниматель ", ""); 
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, " Индивидуальный предприниматель", ""); 
		
		Возврат НаименованиеПолное;   
		
	Иначе
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "НаименованиеПолное") И ЗначениеЗаполнено(ОбъектЗаполнения.НаименованиеПолное) Тогда
			Возврат ОбъектЗаполнения.НаименованиеПолное;
		КонецЕсли;  
		
		Возврат ОбъектЗаполнения.Наименование; 
		
	КонецЕсли;
	
КонецФункции

Функция ФОД_ПолучитьИмяКомпанииГрузоотправитель(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		
		//СтруктураНаименования = КЗП_СформироватьСтруктуруИП(ОбъектЗаполнения);   
		НаименованиеПолное = ОбъектЗаполнения.НаименованиеПолное;
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "ИП ", "");
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, " ИП", "");
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, "Индивидуальный предприниматель ", ""); 
		НаименованиеПолное = СтрЗаменить(НаименованиеПолное, " Индивидуальный предприниматель", ""); 
		
		Возврат НаименованиеПолное;   
		
	Иначе
		
		//+Белов А. 11.03.2024 #UT10-4321
		Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") 
			И ЗначениеЗаполнено(ОбъектЗаполнения.НаименованиеПодразделения) Тогда
			Возврат ОбъектЗаполнения.НаименованиеПодразделения;	
		КонецЕсли;				
		//-Белов А. 11.03.2024 #UT10-4321
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "НаименованиеПолное") И ЗначениеЗаполнено(ОбъектЗаполнения.НаименованиеПолное) Тогда
			Возврат ОбъектЗаполнения.НаименованиеПолное;
		КонецЕсли;  
		
		Возврат ОбъектЗаполнения.Наименование; 
		
	КонецЕсли;
	
КонецФункции

Функция ФОД_ПолучитьФамилиюИП(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		//СтруктураНаименования = КЗП_СформироватьСтруктуруИП(ОбъектЗаполнения);
		Возврат "ИП";
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьИмяИП(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 09.04.2026 #UT10-5800
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		
		СтруктураНаименования = КЗП_СформироватьСтруктуруИП(ОбъектЗаполнения);
		Возврат СтруктураНаименования.Имя;
		
	КонецЕсли;
	
	Возврат "";
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьОтчествоИП(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		//СтруктураНаименования = КЗП_СформироватьСтруктуруИП(ОбъектЗаполнения);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат "";	

КонецФункции

Функция ФОД_ПолучитьОГРНКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//+Макрушин Е. 09.04.2026 #UT10-5800
	Результат = Неопределено;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("ОГРНИП") Тогда
		Результат = ОбъектЗаполнения.ОГРНИП;	
	ИначеЕсли 
		ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации")
		ИЛИ
		ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты")
	Тогда
		Результат = МОП_ПолучитьОГРНКонтрагента(ОбъектЗаполнения);
	КонецЕсли;

	Возврат Результат;
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьОГРНИП(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//23.10.2019 - добавлена установка в null огрнип при его отсутствии для ИП в случае версии 6.3
	
	Результат = "";	
	Если ФОД_ЭтоИП(ОбъектЗаполнения) Тогда
		
		Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") И ОбъектЗаполнения.Свойство("ОГРНИП") Тогда
			Результат = ОбъектЗаполнения.ОГРНИП;	
		ИначеЕсли 
			ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации")
			ИЛИ
			ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты")
			Тогда
			Результат = МОП_ПолучитьОГРНКонтрагента(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВерсияЗаполнения = "6.3" И НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция ФОД_ПолучитьИННКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ИНН")  И ЗначениеЗаполнено(ОбъектЗаполнения.ИНН) Тогда
		Возврат ОбъектЗаполнения.ИНН;  
	ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения, "ГоловнойКонтрагент") И ЗначениеЗаполнено(ОбъектЗаполнения.ГоловнойКонтрагент) Тогда
		Возврат ОбъектЗаполнения.ГоловнойКонтрагент.ИНН;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьКППКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения, Документ = Неопределено)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") ИЛИ ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "КПП") Тогда
			
			Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Документ) Тогда
				
				Партнер = Неопределено;
				
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
					
					Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
						Партнер = Документ.ДокументОснование.Грузополучатель;	
					ИначеЕсли ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
						Партнер = Документ.ДокументОснование.Грузополучатель;
					КонецЕсли;   
					
				ИначеЕсли КНП_ЕстьРеквизит(Документ, "Грузополучатель") Тогда
					Партнер = Документ.Грузополучатель;					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Партнер) И ЗначениеЗаполнено(Партнер.Кпп) Тогда
					Возврат Партнер.Кпп;
				Иначе   
					
					Если ЗначениеЗаполнено(ОбъектЗаполнения.КПП) Тогда
						Возврат ОбъектЗаполнения.КПП;
					//+Белов А. 17.08.2026 #UT10-6007	
					ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
						
						Если ЗначениеЗаполнено(ОбъектЗаполнения.ГоловнойКонтрагент) И ОбъектЗаполнения <> ОбъектЗаполнения.ГоловнойКонтрагент Тогда
							Возврат ОбъектЗаполнения.ГоловнойКонтрагент.Кпп; 
						КонецЕсли;
						
					//-Белов А. 17.08.2026 #UT10-6007
					Иначе
						Возврат ?(ЗначениеЗаполнено(Документ.ДокументОснование.Контрагент.КПП), Документ.ДокументОснование.Контрагент.КПП, Неопределено);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.КПП), ОбъектЗаполнения.КПП, Неопределено);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("КПП") Тогда
			Возврат ?(ЗначениеЗаполнено(ОбъектЗаполнения.КПП), ОбъектЗаполнения.КПП, Неопределено);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ФОД_ПолучитьОКПОКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации")
		ИЛИ
		ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") 
		Тогда
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ОКПО") И ЗначениеЗаполнено(ОбъектЗаполнения.ОКПО) Тогда
			Возврат ОбъектЗаполнения.ОКПО;
		ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения, "КодПоОКПО") И ЗначениеЗаполнено(ОбъектЗаполнения.КодПоОКПО) Тогда
			Возврат ОбъектЗаполнения.КодПоОКПО;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("ОКПО") Тогда
			Возврат ОбъектЗаполнения.ОКПО;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьИмяПодразделенияКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	СтрокаКонтрагента = СправочникКонтрагенты.Найти(ОбъектЗаполнения, "НазваниеПодразделения");
	
	Если СтрокаКонтрагента <> Неопределено Тогда
		Возврат СтрокаКонтрагента.НазваниеПодразделения;
	КонецЕсли;
	
	Возврат "Основной офис";

КонецФункции

Функция ФОД_ПолучитьНомерСчета(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетОрганизации(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат СокрЛП(МОП_ПолучитьНомерБанковскогоСчета(БанковскийСчет) );
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетКонтрагента(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат СокрЛП(МОП_ПолучитьНомерБанковскогоСчета(БанковскийСчет) );
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("НомерСчета") И ЗначениеЗаполнено(ОбъектЗаполнения.НомерСчета) Тогда
			Возврат ОбъектЗаполнения.НомерСчета;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат " ";
КонецФункции

Функция ФОД_ПолучитьИмяБанка(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетОрганизации(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат МОП_ПолучитьНаименованиеБанкаПоСчету(БанковскийСчет);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетКонтрагента(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат МОП_ПолучитьНаименованиеБанкаПоСчету(БанковскийСчет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция ФОД_ПолучитьБИКБанка(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетОрганизации(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат МОП_ПолучитьБИКБанкаПоСчету(БанковскийСчет);
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		БанковскийСчет = МОП_ПолучитьБанковскийСчетКонтрагента(ОбъектЗаполнения);
		
		Если ЗначениеЗаполнено(БанковскийСчет) Тогда
			Возврат МОП_ПолучитьБИКБанкаПоСчету(БанковскийСчет);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("БИК") И ЗначениеЗаполнено(ОбъектЗаполнения.БИК) Тогда
			Возврат ОбъектЗаполнения.БИК;
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат " ";

КонецФункции

Функция ФОД_ПолучитьРегионАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("КодРегиона") И ЗначениеЗаполнено(ОбъектЗаполнения.КодРегиона) Тогда
		Возврат ОбъектЗаполнения.КодРегиона;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции    

Функция ФОД_ПолучитьТипАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("ТипАдреса") И ЗначениеЗаполнено(ОбъектЗаполнения.ТипАдреса) Тогда
		Возврат ОбъектЗаполнения.ТипАдреса;
	КонецЕсли;
	
	Возврат "russian";

КонецФункции      

Функция ФОД_ПолучитьАдресВСвободномФормате(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Представление") И ЗначениеЗаполнено(ОбъектЗаполнения.Представление) Тогда
		Возврат ОбъектЗаполнения.Представление;
	КонецЕсли;
	
	Возврат "";

КонецФункции   

Функция ФОД_ПолучитьИндексАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Индекс") И ЗначениеЗаполнено(ОбъектЗаполнения.Индекс) Тогда
		Возврат ОбъектЗаполнения.Индекс;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьРайонАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Район") И ЗначениеЗаполнено(ОбъектЗаполнения.Район) Тогда
		Возврат ОбъектЗаполнения.Район;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьГородАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Город") И ЗначениеЗаполнено(ОбъектЗаполнения.Город) Тогда
		Возврат ОбъектЗаполнения.Город;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Регион") И ЗначениеЗаполнено(ОбъектЗаполнения.Регион) Тогда
		Возврат ОбъектЗаполнения.Регион;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьПоселениеАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("НаселенныйПункт") И ЗначениеЗаполнено(ОбъектЗаполнения.НаселенныйПункт) Тогда
		Возврат ОбъектЗаполнения.НаселенныйПункт;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьУлицуАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Улица") И ЗначениеЗаполнено(ОбъектЗаполнения.Улица) Тогда
		
		Если ОбъектЗаполнения.Свойство("УлицаСокращение") И ЗначениеЗаполнено(ОбъектЗаполнения.УлицаСокращение) Тогда
			Возврат ОбъектЗаполнения.Улица + " " + ОбъектЗаполнения.УлицаСокращение;
		Иначе
			Возврат ОбъектЗаполнения.Улица;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьДомАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Здание") И ЗначениеЗаполнено(ОбъектЗаполнения.Здание) Тогда
		
		Если ТипЗнч(ОбъектЗаполнения.Здание) = Тип("Структура") Тогда
			
			ВидДома = КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения.Здание, "ТипЗдания");
			
			Если Сокрлп(нрег(ВидДома)) = "дом" Тогда
				Возврат Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Дом") И ЗначениеЗаполнено(ОбъектЗаполнения.Дом) Тогда
		Возврат ОбъектЗаполнения.Дом;
	КонецЕсли;
	
	Возврат Неопределено;	

КонецФункции

Функция ФОД_ПолучитьЗданиеАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = "";
	
	Если ОбъектЗаполнения.Свойство("Здание") И ЗначениеЗаполнено(ОбъектЗаполнения.Здание) Тогда
		
		Если ТипЗнч(ОбъектЗаполнения.Здание) = Тип("Структура") Тогда
			
			ВидДома = КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения.Здание, "ТипЗдания");
			Результат = нрег(КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения.Здание, "ТипЗдания"))+" "+КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения.Здание, "Номер");
			
		Иначе
			Возврат нрег(Строка(ОбъектЗаполнения.Здание));
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Корпус") 
		Тогда
		
		Если ТипЗнч(ОбъектЗаполнения.Корпус) = Тип("Структура") Тогда
			
			Результат =  КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения.Корпус, "Номер");
			
			Если НЕ ЗначениеЗаполнено(Результат) Тогда
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			Этаж = Неопределено;
			
			Если ОбъектЗаполнения.Свойство("этаж") И ЗначениеЗаполнено(ОбъектЗаполнения.Этаж) Тогда
				
				Если ЗначениеЗаполнено(ОбъектЗаполнения.Корпус) Тогда
					Этаж = ", эт" + ОбъектЗаполнения.Этаж;
				Иначе
					Этаж = "эт" + ОбъектЗаполнения.Этаж;
				Конецесли;
				
			КонецЕсли;
			
			Помещение = Неопределено;
			
			Если ОбъектЗаполнения.Свойство("Помещение") И ЗначениеЗаполнено(ОбъектЗаполнения.Помещение) Тогда
				Помещение =  "пом." + (Строка(ОбъектЗаполнения.Помещение));
			КонецЕсли;
			
			КорпусЭтаж = ?(Этаж = Неопределено, нрег(Строка(ОбъектЗаполнения.Корпус)), нрег(Строка(ОбъектЗаполнения.Корпус)) + Этаж);
			
			ЭтажПомещение = ?(КорпусЭтаж = "", КорпусЭтаж + Помещение,КорпусЭтаж + ?(Помещение = Неопределено, "", ", " + Помещение));
			
			ИтоговаяСтрока = ?(СтрДлина(ЭтажПомещение) > 20, СтрЗаменить(ЭтажПомещение, "корпус", "к"), ЭтажПомещение);
			
			ИтоговаяСтрока = ?(ИтоговаяСтрока = "", Результат, ?(ЗначениеЗаполнено(Результат), Результат + ?(Лев(ИтоговаяСтрока, 1) = ",", ИтоговаяСтрока, ", " + ИтоговаяСтрока), ИтоговаяСтрока));
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "строение ", "стр"), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "домовладение", "двлд"), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "владение", "влд"), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "дом", "д"), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, " ", ""), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "стр", "с"), ИтоговаяСтрока);
			
			ИтоговаяСтрока = ?(СтрДлина(ИтоговаяСтрока) > 20, СтрЗаменить(ИтоговаяСтрока, "пом.", "п"), ИтоговаяСтрока);
			
			Если Не ЗначениеЗаполнено(ИтоговаяСтрока) Тогда
				ИтоговаяСтрока = Неопределено;
			КонецЕсли;
			
			Возврат ИтоговаяСтрока;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	

КонецФункции

Функция ФОД_ПолучитьКомнатуАдреса(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Квартира") И ЗначениеЗаполнено(ОбъектЗаполнения.Квартира) Тогда
		Возврат нрег(Строка(ОбъектЗаполнения.Квартира));
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Комната") И ЗначениеЗаполнено(ОбъектЗаполнения.Комната) Тогда
		Возврат "ком. " + нрег(Строка(ОбъектЗаполнения.Комната));
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Офис") И ЗначениеЗаполнено(ОбъектЗаполнения.Офис) Тогда
		Возврат "оф. " + нрег(Строка(ОбъектЗаполнения.Офис));
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ФОД_ПолучитьВесНеттоТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Количество") Тогда
		Возврат КНП_ЧислоВФормате(ОбъектЗаполнения.Количество);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьНаименованиеТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)	
	
	//Наименование товара игнорирует акты выполненных работ
	Если ОбъектЗаполнения.Свойство("Ссылка") И ЗначениеЗаполнено(ОбъектЗаполнения.Ссылка) Тогда
		
		Если МОП_ЭтоАктВыполненныхРабот(ОбъектЗаполнения.Ссылка) Тогда
			
			Если ОбъектЗаполнения.Свойство("Содержание") И ЗначениеЗаполнено(ОбъектЗаполнения.Содержание) Тогда
				Возврат ОбъектЗаполнения.Содержание;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе  
		
		Если ОбъектЗаполнения.Свойство("Содержание") И ЗначениеЗаполнено(ОбъектЗаполнения.Содержание) Тогда
			Возврат ОбъектЗаполнения.Содержание;
		КонецЕсли; 
		
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура) Тогда
		
		СтрокаБренда = "";
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура.Родитель) Тогда
			СтрокаБренда = " (" + Строка(ОбъектЗаполнения.Номенклатура.Родитель) + ")"	
		КонецЕсли;
		
		//+Гавриленков В. 04.02.2026 #UT10-5679
		//Возврат СтрЗаменить(ОбъектЗаполнения.Номенклатура.Наименование, "()", "") + СтрокаБренда;
		Возврат СтрЗаменить(ОбъектЗаполнения.Номенклатура.НаименованиеПолное, "()", "") + СтрокаБренда;
		//-Гавриленков В. 04.02.2026 #UT10-5679
		
	КонецЕсли; 
	
	Если ОбъектЗаполнения.Свойство("Ссылка") И ЗначениеЗаполнено(ОбъектЗаполнения.Ссылка) Тогда
		
		Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
			Возврат "Предварительная оплата";
		КонецЕсли; 
		
	КонецЕсли;  
	
	Возврат ""; 
	
КонецФункции

Функция ФОД_ПолучитьОписаниеТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Содержание") И ЗначениеЗаполнено(ОбъектЗаполнения.Содержание) Тогда
		Возврат ОбъектЗаполнения.Содержание;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура) Тогда
		
		Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "НаименованиеПолное") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура.НаименованиеПолное) Тогда
			Возврат ОбъектЗаполнения.Номенклатура.НаименованиеПолное;
		Иначе
			Возврат ОбъектЗаполнения.Номенклатура.Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Ссылка") И ЗначениеЗаполнено(ОбъектЗаполнения.Ссылка) Тогда
		
		Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
			Возврат "Предварительная оплата";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";	

КонецФункции

Функция ФОД_ПолучитьКодЕдиницыИзмеренияТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = "0000";
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("ЕдиницаИзмерения") И ЗначениеЗаполнено(ОбъектЗаполнения.ЕдиницаИзмерения) Тогда
			Результат = ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, ОбъектЗаполнения.ЕдиницаИзмерения.ЕдиницаПоКлассификатору);
		КонецЕсли;
		
		Если ОбъектЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура) Тогда
			
			Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "ЕдиницаИзмерения") Тогда
				Результат = ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, ОбъектЗаполнения.Номенклатура.ЕдиницаИзмерения);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли КНП_ЕстьСтандартныйРеквизит(ОбъектЗаполнения, "Код") Тогда
		Результат = СокрЛП(ОбъектЗаполнения.Код);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = "0000";
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьЦенуТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("Ссылка") Тогда
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка);
	Иначе
		НДСВСумме = Ложь;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Цена") Тогда
		
		Если НЕ НДСВСумме Тогда
			Результат = ОбъектЗаполнения.Цена;
		Иначе
			
			КоличествоТовара = ФОД_ПолучитьКоличествоТовара(ВерсияЗаполнения, ОбъектЗаполнения);
			
			Если КоличествоТовара <> Неопределено  Тогда
				Результат = ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения) / ?(КоличествоТовара > 0, КоличествоТовара, 1);
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	КоличествоТовара = ФОД_ПолучитьКоличествоТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(КоличествоТовара)  Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьЦенуТовараСНулем(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = Неопределено;
	
	Если ОбъектЗаполнения.Свойство("Ссылка") Тогда
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка);
	Иначе
		НДСВСумме = Ложь;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Цена") Тогда
		
		Если НЕ НДСВСумме Тогда
			Результат = ОбъектЗаполнения.Цена;
		Иначе
			
			КоличествоТовара = ФОД_ПолучитьКоличествоТовараСНулем(ВерсияЗаполнения, ОбъектЗаполнения);
			
			Если КоличествоТовара <> Неопределено  Тогда
				Результат = ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения) / ?(КоличествоТовара > 0, КоличествоТовара, 1);
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	КоличествоТовара = ФОД_ПолучитьКоличествоТовараСНулем(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(КоличествоТовара) Тогда
		
		Если ОбъектЗаполнения.Свойство("Ссылка") И НЕ МОП_ЭтоСчетНаОплату(ОбъектЗаполнения.Ссылка)  Тогда
			Результат = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьСтавкуНДСТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СтавкаНДС") Тогда
		Возврат МОП_ПолучитьПредставлениеСтавкиНДС(ОбъектЗаполнения.СтавкаНДС);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСтавкуНДСТовараДоработанная(ВерсияЗаполнения, Знач ОбъектЗаполнения)		
	
	//+Макрушин Е. 07.04.2026 #UT10-5800
	Если ОбъектЗаполнения.Свойство("СтавкаНДС") Тогда
		
		ПредставлениеСтавкиНДС = МОП_ПолучитьПредставлениеСтавкиНДС(ОбъектЗаполнения.СтавкаНДС);
		
		Если ПредставлениеСтавкиНДС = "-1" Тогда
			ПредставлениеСтавкиНДС = "без НДС"
		КонецЕсли;
		
		Возврат ПредставлениеСтавкиНДС;
	КонецЕсли;
	//-Макрушин Е. 07.04.2026 #UT10-5800
	
КонецФункции

Функция ФОД_ПолучитьКоличествоТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = 1;
	
	Если ОбъектЗаполнения.Свойство("Количество") Тогда
		
		Результат = ОбъектЗаполнения.Количество;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьКоличествоТовараСНулем(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = 1;
	
	Если ОбъектЗаполнения.Свойство("Количество") Тогда
		
		Результат = ОбъектЗаполнения.Количество;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//22.03.2019 - для счетов-фактур на аванс принудительно НДС в сумме
	//05.04.2019 - исключение расчета НДС в сумме для счетов на оплату
	
	НДСВСумме = Ложь;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Ссылка") И МОП_ЭтоСчетНаОплату(ОбъектЗаполнения.Ссылка) Тогда
			НДСВСумме = Ложь;	
		ИначеЕсли ОбъектЗаполнения.Свойство("Ссылка") И МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
			Возврат Неопределено;	
		ИначеЕсли ОбъектЗаполнения.Свойство("Ссылка") И НЕ МОП_ЭтоСчетФактура(ОбъектЗаполнения.Ссылка) Тогда
			
			НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка, Истина);
			
			Если НДСВСумме = Неопределено Тогда
				НДСВСумме = МОП_НДСВСуммеПоСтавке(ОбъектЗаполнения.СтавкаНДС);
			КонецЕсли;
			
		Иначе
			НДСВСумме = МОП_НДСВСуммеПоСтавке(ОбъектЗаполнения.СтавкаНДС);
		КонецЕсли;
		
		Если НДСВСумме Тогда
			
			Если ОбъектЗаполнения.Свойство("СуммаБезНДС") Тогда
				Возврат ОбъектЗаполнения.СуммаБезНДС - ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
			ИначеЕсли ОбъектЗаполнения.Свойство("Сумма") Тогда
				Возврат ОбъектЗаполнения.Сумма - ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
			КонецЕсли;
			
		Иначе
			
			Если ОбъектЗаполнения.Свойство("СуммаБезНДС") Тогда
				Возврат ОбъектЗаполнения.СуммаБезНДС;
			ИначеЕсли ОбъектЗаполнения.Свойство("Сумма") Тогда
				Возврат ОбъектЗаполнения.Сумма;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Функция ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("НДС") Тогда
			Возврат ОбъектЗаполнения.НДС;
		ИначеЕсли ОбъектЗаполнения.Свойство("СуммаНДС") Тогда
			Возврат ОбъектЗаполнения.СуммаНДС;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//05.04.2019 - исключение для счетов на оплату
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
		
		Если ОбъектЗаполнения.Свойство("СуммаБезНДС") Тогда
			Возврат ОбъектЗаполнения.СуммаБезНДС;
		ИначеЕсли ОбъектЗаполнения.Свойство("Сумма") Тогда
			Возврат ОбъектЗаполнения.Сумма;
		КонецЕсли;		
		
	ИначеЕсли МОП_ЭтоСчетНаОплату(ОбъектЗаполнения.Ссылка) Тогда
		
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка, Истина);
		
		Если НДСВСумме Тогда
			Возврат ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения);
		Иначе
			Возврат ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения) + ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
		КонецЕсли;
		
	Иначе
		Возврат ФОД_ПолучитьСуммуТовара(ВерсияЗаполнения, ОбъектЗаполнения) + ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьАкцизТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Неопределено;	

КонецФункции

Функция ФОД_ПолучитьАкцизДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Неопределено;	

КонецФункции

Функция ФОД_ПолучитьКоличествоДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("КоличествоДоИзменения") Тогда
		
		Результат = ОбъектЗаполнения.КоличествоДоИзменения;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = Неопределено;
		КонецЕсли;
		
	Иначе
		Возврат 1;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьЦенуДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = 0;
	
	Если ОбъектЗаполнения.Свойство("Ссылка") Тогда
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка);
	Иначе
		НДСВСумме = Ложь;
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("ЦенаДоИзменения") Тогда
		
		Если НЕ НДСВСумме Тогда
			Результат = ОбъектЗаполнения.ЦенаДоИзменения;
		Иначе
			
			КоличествоТовара = ФОД_ПолучитьКоличествоДо(ВерсияЗаполнения, ОбъектЗаполнения);
			
			Если КоличествоТовара <> Неопределено  Тогда
				Результат = ФОД_ПолучитьСуммуДо(ВерсияЗаполнения, ОбъектЗаполнения) / ?(КоличествоТовара > 0, КоличествоТовара, 1);
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	КоличествоТовара = ФОД_ПолучитьКоличествоДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(КоличествоТовара) Тогда
		
		Если ОбъектЗаполнения.Свойство("Ссылка") И НЕ МОП_ЭтоСчетНаОплату(ОбъектЗаполнения.Ссылка)  Тогда
			Результат = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьСтавкуДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СтавкаНДСДоИзменения") Тогда
		Возврат МОП_ПолучитьПредставлениеСтавкиНДС(ОбъектЗаполнения.СтавкаНДСДоИзменения);
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьСуммуНДСДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("СуммаНДСДоИзменения") Тогда
		Возврат ОбъектЗаполнения.СуммаНДСДоИзменения;
	КонецЕсли;
	
	Возврат 0;	

КонецФункции

Функция ФОД_ПолучитьСуммуДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	НДСВСумме = Ложь;
	
	Если ОбъектЗаполнения.Свойство("Ссылка") И НЕ МОП_ЭтоСчетФактура(ОбъектЗаполнения.Ссылка) Тогда
		
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения.Ссылка, Истина);
		
		Если НДСВСумме = Неопределено Тогда
			НДСВСумме = МОП_НДСВСуммеПоСтавке(ОбъектЗаполнения.СтавкаНДС);
		КонецЕсли;
		
	Иначе
		НДСВСумме = МОП_НДСВСуммеПоСтавке(ОбъектЗаполнения.СтавкаНДС);
	КонецЕсли;
	
	Если НДСВСумме Тогда
		
		Если ОбъектЗаполнения.Свойство("СуммаДоИзменения") Тогда
			Возврат ОбъектЗаполнения.СуммаДоИзменения - ФОД_ПолучитьСуммуНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);
		КонецЕсли;		
		
	Иначе
		
		Если ОбъектЗаполнения.Свойство("СуммаДоИзменения") Тогда
			Возврат ОбъектЗаполнения.СуммаДоИзменения;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат 0;	

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ФОД_ПолучитьСуммуДо(ВерсияЗаполнения, ОбъектЗаполнения) + ФОД_ПолучитьСуммуНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);	

КонецФункции

Функция ФОД_ПолучитьАкцизРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьАкцизТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьАкцизДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Попытка
		
		Если ЗначениеПосле >= ЗначениеДо Тогда
			Возврат ЗначениеПосле - ЗначениеДо;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция ФОД_ПолучитьАкцизПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьАкцизТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьАкцизДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Попытка
		
		Если ЗначениеПосле < ЗначениеДо Тогда
			Возврат ЗначениеДо - ЗначениеПосле;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция ФОД_ПолучитьСуммуНДСРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьСуммуНДСПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле < ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуСНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуСНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуСНДСТовара(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуСНДСДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле < ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьКодТовара(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Ссылка") И ЗначениеЗаполнено(ОбъектЗаполнения.Ссылка) Тогда
		
		Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения.Ссылка) Тогда
			Возврат "-";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("Номенклатура") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура) Тогда
		
		Если МОП_ЭтоУслуга(ОбъектЗаполнения.Номенклатура) Тогда
			
			Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "КодОКВЭД2") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура.КодОКВЭД2) Тогда
				Возврат ОбъектЗаполнения.Номенклатура.КодОКВЭД2.Код;
			ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "КодОКВЭД") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура.КодОКВЭД) Тогда
				Возврат ОбъектЗаполнения.Номенклатура.КодОКВЭД.Код;
			Иначе
				Возврат ОбъектЗаполнения.Номенклатура.Код;
			КонецЕсли;
			
		Иначе
			
			Если КНП_ЕстьРеквизит(ОбъектЗаполнения.Номенклатура, "КодПроизводителя") И ЗначениеЗаполнено(ОбъектЗаполнения.Номенклатура.КодПроизводителя) Тогда
				Возврат ОбъектЗаполнения.Номенклатура.КодПроизводителя;
			Иначе
				Возврат ОбъектЗаполнения.Номенклатура.Код;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "-";		

КонецФункции

Функция ФОД_ПолучитьИдентификаторОтправителя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Организация") И ТипЗнч(ОбъектЗаполнения.Организация) = Тип("СправочникСсылка.Организации") И ЗначениеЗаполнено(ОбъектЗаполнения.Организация.ИдентификаторОрганизации) Тогда
		Возврат ОбъектЗаполнения.Организация.ИдентификаторОрганизации; 
	КонецЕсли;
	
	Возврат Цел(ИдентификаторПодразделения);
	
КонецФункции

Функция ФОД_ПолучитьИдентификаторПолучателя(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = 0;
	
	//+Белов А. 22.07.2026 #UT10-5921 добавил  ИЛИ ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная")
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Контрагент") ИЛИ ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		
		Контрагент = ПолучитьКонтрагентаПоОбъектуЗаполнения(ОбъектЗаполнения); 
		
		Попытка
			
			ИдентификаторыКонтрагента = РС_ПолучитьИдентификаторыКонтрагента(Контрагент);
			
			Если ЗначениеЗаполнено(ИдентификаторыКонтрагента) И ИдентификаторыКонтрагента.Свойство("ИдентификаторПодразделения") Тогда
				Результат = Цел(ИдентификаторыКонтрагента.ИдентификаторПодразделения);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "ФОД_ПолучитьИдентификаторПолучателя");	
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ПолучитьКонтрагентаПоОбъектуЗаполнения(Знач ОбъектЗаполнения) Экспорт
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДокументОснование = ОбъектЗаполнения.ДокументОснование; 
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если ЗначениеЗаполнено(ДокументОснование.Грузополучатель.DS_Подразделение_ID) Тогда
				Возврат ДокументОснование.Грузополучатель;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			Если ЗначениеЗаполнено(ДокументОснование.Грузополучатель.DS_Подразделение_ID) Тогда
				Возврат ДокументОснование.Грузополучатель;
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ДокументОснование.ДоговорКонтрагента;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.Грузополучатель.DS_Подразделение_ID) Тогда
			Возврат ОбъектЗаполнения.Грузополучатель;
		Иначе
			Возврат ОбъектЗаполнения.ДоговорКонтрагента;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.Грузополучатель.DS_Подразделение_ID) Тогда
			Возврат ОбъектЗаполнения.Грузополучатель;
		Иначе
			Возврат ОбъектЗаполнения.ДоговорКонтрагента;
		КонецЕсли;      
		
	//+Белов А. 22.06.2026 #UT10-5921
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.Грузополучатель.DS_Подразделение_ID) Тогда
			Возврат ОбъектЗаполнения.Грузополучатель;
		Иначе
			Возврат ОбъектЗаполнения.ДоговорГрузополучателя;
		КонецЕсли;      
		
	ИначеЕсли ТипЗнч(ОбъектЗаполнения) = Тип("ДокументСсылка.ЗаказЗаявка") Тогда
		
		Если ЗначениеЗаполнено(ОбъектЗаполнения.Контрагент.DS_Подразделение_ID) Тогда
			Возврат ОбъектЗаполнения.Контрагент;
		Иначе
			Возврат ОбъектЗаполнения.ДоговорКонтрагента;
		КонецЕсли;  
		
	//-Белов А. 22.06.2026 #UT10-5921
	Иначе
		
		Возврат ОбъектЗаполнения.ДоговорКонтрагента; 
		
	КонецЕсли;
	
	Возврат Справочники.Контрагенты.ПустаяСсылка();
	
КонецФункции

Функция ФОД_ПолучитьНомерДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	НомерДокумента = "";
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Номер") Тогда
			НомерДокумента = ОбъектЗаполнения.Номер;
		КонецЕсли; 
		
		Если ОбрезатьПрефиксыНомеров Тогда
			
			Если Найти(НомерДокумента, "-") Тогда //Это префиксация по форме БП 3.0 
				
				Поз = Найти(НомерДокумента, "-");
				НомерДокумента = Сред(НомерДокумента, Поз + 1);
				
			ИначеЕсли КНП_ЕстьРеквизит(Организация, "Префикс") И ЗначениеЗаполнено(Организация.Префикс) Тогда
				НомерДокумента = СтрЗаменить(НомерДокумента, Организация.Префикс, "");
			КонецЕсли;
			
			НомерДокумента = КНП_УдалениеВедущихНулей(НомерДокумента);
			
		КонецЕсли;
		
	Иначе
		НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(ОбъектЗаполнения);
	КонецЕсли;
	
	Возврат НомерДокумента; 
	
КонецФункции 

Функция ФОД_ПолучитьНомерДокументаСПрефиксом(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Организация = Неопределено;     
	УдалятьВедущиеНули = Истина;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Организация", ОбъектЗаполнения.Метаданные()) Тогда
		Организация = ОбъектЗаполнения.Организация;
	КонецЕсли;
	
	МассивПрефиксовДляОбхода = ОбщегоНазначения.СформироватьМассивПрефиксовПоОрганизации(Организация);
	
	Номер = СокрЛП(ОбъектЗаполнения.Номер);
	Префикс = "";
	
	Для каждого ПрефиксМассива Из МассивПрефиксовДляОбхода Цикл
		
		Если Найти(Номер, ПрефиксМассива) = 1 Тогда 
			
			Номер = Сред(Номер, СтрДлина(ПрефиксМассива) + 1);
			Префикс = Префикс + ПрефиксМассива;
			
		КонецЕсли;
		
	КонецЦикла;  
	
	// удаление ведущих нулей
	Если УдалятьВедущиеНули Тогда 
		
		Пока Лев(Номер, 1) = "0" Цикл
			Номер = Сред(Номер, 2);
		КонецЦикла;
		
	КонецЕсли;
	
	Номер = Префикс + Номер;
	
	Возврат Номер; 
	
КонецФункции


Функция ФОД_ПолучитьДатуДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Дата") И ЗначениеЗаполнено(ОбъектЗаполнения.Дата) Тогда
			Возврат Формат(ОбъектЗаполнения.Дата, "ДФ=дд.ММ.гггг");
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ОбъектЗаполнения.Дата) Тогда
		Возврат Формат(ОбъектЗаполнения.Дата, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьСуммуДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//22.03.2019 - добавлен обработчик ТЧ Авансы для счетов-фактур
	//18.10.2019 - добавлен учет что объект заполнения - структура
	//12.12.2019 - добавлена конвертация валют
	
	НДСВСумме = Неопределено;
	СуммаДокумента = 0;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		Возврат СуммаДокумента;
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") И ОбъектЗаполнения.Авансы.Количество() > 0 Тогда
			Возврат 0;
		Иначе
			ОбъектЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Товары") И ОбъектЗаполнения.Товары.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Номенклатура") И ОбъектЗаполнения.Номенклатура.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Номенклатура.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Запасы") И ОбъектЗаполнения.Запасы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Запасы.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") И ОбъектЗаполнения.Услуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Услуги.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "УслугиОказанные") И ОбъектЗаполнения.УслугиОказанные.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.УслугиОказанные.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "РаботыИУслуги") И ОбъектЗаполнения.РаботыИУслуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.РаботыИУслуги.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Доходы") И ОбъектЗаполнения.Доходы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Доходы.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("Сумма");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НДСВСумме = Неопределено Тогда
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения);
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента Тогда
		
		ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
		ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
		
		Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
			
			СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
			Курс = СтруктураПараметров.Курс;
			Кратность = СтруктураПараметров.Кратность;
			СуммаДокумента = СуммаДокумента * Курс / Кратность;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НДСВСумме Тогда
		СуммаДокумента = СуммаДокумента - ФОД_ПолучитьСуммуНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);	
	КонецЕсли;
	
	Возврат СуммаДокумента;

КонецФункции

Функция ФОД_ПолучитьСуммуНДСДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//22.03.2019 - добавлен обработчик ТЧ Авансы для счетов-фактур
	
	СуммаДокумента = 0;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") И ОбъектЗаполнения.Авансы.Количество() > 0 Тогда
			
			Если ОбъектЗаполнения.Авансы.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
				СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("НДС");	
			Иначе
				СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаНДС");	
			КонецЕсли;
			
		Иначе
			ОбъектЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Товары") И ОбъектЗаполнения.Товары.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Запасы") И ОбъектЗаполнения.Запасы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Запасы.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Номенклатура") И ОбъектЗаполнения.Номенклатура.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Номенклатура.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") И ОбъектЗаполнения.Услуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Услуги.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "УслугиОказанные") И ОбъектЗаполнения.УслугиОказанные.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.УслугиОказанные.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "РаботыИУслуги") И ОбъектЗаполнения.РаботыИУслуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.РаботыИУслуги.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Доходы") И ОбъектЗаполнения.Доходы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Доходы.Выгрузить().Колонки.Найти("НДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("НДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("СуммаНДС");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента Тогда
		
		ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
		ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
		
		Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
			
			СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
			Курс = СтруктураПараметров.Курс;
			Кратность = СтруктураПараметров.Кратность;
			СуммаДокумента = Окр(СуммаДокумента * Курс / Кратность, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаДокумента;

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		
		СуммаДокумента = 0;
		
		Если ОбъектЗаполнения.Авансы.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаБезНДС");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("Сумма");	
		КонецЕсли;
		
		Возврат СуммаДокумента;
		
	Иначе
		Возврат ФОД_ПолучитьСуммуДокумента(ВерсияЗаполнения, ОбъектЗаполнения) + ФОД_ПолучитьСуммуНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьОснованиеСчета(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ДоговорКонтрагента") Тогда
		Возврат Строка(ОбъектЗаполнения.ДоговорКонтрагента);		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Договор") Тогда
		Возврат Строка(ОбъектЗаполнения.Договор);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьТекстДополненияСчета(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ДополнительныеУсловия") И ЗначениеЗаполнено(ОбъектЗаполнения.ДополнительныеУсловия) Тогда
		
		Если ТипЗнч(ОбъектЗаполнения.ДополнительныеУсловия) = Тип("СправочникСсылка.ДополнительныеУсловия") Тогда
			
			Если КНП_ЕстьРеквизит(ОбъектЗаполнения.ДополнительныеУсловия, "ТекстУсловий") Тогда
				Возврат ОбъектЗаполнения.ДополнительныеУсловия.ТекстУсловий;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьИдентификаторГосКонтракта(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ГосКонтракт = МОП_ПолучитьИдентификаторГосКонтракта(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(ГосКонтракт) Тогда
		Возврат ГосКонтракт;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_ПолучитьКоличествоЛистовНакладной(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат 1;	

КонецФункции

Функция ФОД_ПолучитьСодержаниеОперации(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("СодержаниеОперации") И ЗначениеЗаполнено(ОбъектЗаполнения.СодержаниеОперации) Тогда
			Возврат ОбъектЗаполнения.СодержаниеОперации;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если
		(
		МОП_ЭтоСчетФактура(ОбъектЗаполнения) 
		И 
		МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(ОбъектЗаполнения) )
		)
		ИЛИ 
		МОП_ЭтоКорректировкаРеализации(ОбъектЗаполнения)
		Тогда
		Возврат "Корректировка реализации товаров (услуг)";
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьИмяДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("ИмяДокумента") Тогда
			Возврат ОбъектЗаполнения.ИмяДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ""; 

КонецФункции

Функция ФОД_ПолучитьНаименованиеТранспортнойНакладной(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = Неопределено;
	ТН = ФОД_ПолучитьТранспортнуюНакладную(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(ТН) Тогда
		Результат = ФОД_ПолучитьИмяДокумента(ВерсияЗаполнения, ТН);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Возврат Результат;	
	Иначе
		Возврат ФОД_ПолучитьНаименованиеДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьТекущуюДату(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");	

КонецФункции

Функция ФОД_ПолучитьНаименованиеДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Строка(ОбъектЗаполнения);	

КонецФункции

Функция ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат СокрЛП(ОбъектЗаполнения.Код);	

КонецФункции

Функция ФОД_ПолучитьКодЕдиницыИзмерения(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Результат = ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если НЕ ЗначениеЗаполнено(Результат) ИЛИ НЕ КНП_ЭтоЧисло(Результат) Тогда
		Результат = "0000";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ФОД_ПолучитьНаименованиеЕдиницыИзмерения(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ВерсияЗаполнения = "6.3" Тогда	
		
		ЕдиницаИзмерения = ФОД_ПолучитьЕдиницуИзмеренияТовара(ОбъектЗаполнения);
		Результат = ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, ЕдиницаИзмерения);	
		
	Иначе		
		Результат = ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, ОбъектЗаполнения);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)Тогда
		Результат = "-";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат СокрЛП(ОбъектЗаполнения.Наименование);	

КонецФункции

Функция ФОД_ПолучитьПолноеНаименование(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("НаименованиеПолное") И ЗначениеЗаполнено(ОбъектЗаполнения.НаименованиеПолное) Тогда
			Возврат ОбъектЗаполнения.НаименованиеПолное;
		КонецЕсли;
		
	ИначеЕсли КНП_ЕстьРеквизит(ОбъектЗаполнения, "НаименованиеПолное") И ЗначениеЗаполнено(ОбъектЗаполнения.НаименованиеПолное) Тогда
		Возврат ОбъектЗаполнения.НаименованиеПолное;		
	КонецЕсли;
	
	Возврат ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, ОбъектЗаполнения);

КонецФункции

Функция ФОД_ПолучитьНомерДоговора(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	//==Специфичный блок кода
	Если ВеткаРазработки = "ТЭК-Торг" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	//==Специфичный блок кода
	//+Марков И. 26.03.2025 #UT10-5160
	//Возврат Неопределено; //Белов
	//-Марков И. 26.03.2025 #UT10-5160
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		Возврат СокрЛП(КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения, "Номер") );
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "НомерДоговора") И ЗначениеЗаполнено(ОбъектЗаполнения.НомерДоговора) Тогда
		Возврат СокрЛП(ОбъектЗаполнения.НомерДоговора);
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Номер") И ЗначениеЗаполнено(ОбъектЗаполнения.Номер) Тогда
		Возврат СокрЛП(ОбъектЗаполнения.Номер);
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции

Функция ФОД_НаименованиеДоговора(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат ОбъектЗаполнения.Наименование; 
	
КонецФункции

Функция ФОД_ПолучитьДатуДоговора(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//2019.09.10 - добавлена проверка на заполненность объекта заполнения
	
	//==Специфичный блок кода
	Если ВеткаРазработки = "ТЭК-Торг" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	//==Специфичный блок кода
	
	Если ОбъектЗаполнения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Результат = КНП_БезопасноПрочитатьЗначение(ОбъектЗаполнения, "Дата");
		
		Если Результат <> Неопределено Тогда
			Возврат Формат(Результат, "ДФ=дд.ММ.гггг");
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "ДатаДоговора") И ЗначениеЗаполнено(ОбъектЗаполнения.ДатаДоговора) Тогда
		Возврат Формат(ОбъектЗаполнения.ДатаДоговора, "ДФ=дд.ММ.гггг");	
	КонецЕсли;
	
	Если КНП_ЕстьРеквизит(ОбъектЗаполнения, "Дата") И ЗначениеЗаполнено(ОбъектЗаполнения.Дата) Тогда
		Возврат Формат(ОбъектЗаполнения.Дата, "ДФ=дд.ММ.гггг");
	КонецЕсли;
	
	Возврат Формат(Дата(2019,1,1), "ДФ=дд.ММ.гггг");

КонецФункции

Функция ФОД_ПолучитьКомпаниюДляРегистрации(Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Компания") Тогда
			Возврат ОбъектЗаполнения.Компания;
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьАдресКомпанииДляРегистрации(Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("АдресКомпании") Тогда
			Возврат ОбъектЗаполнения.АдресКомпании;
		КонецЕсли;
		
	КонецЕсли;	

КонецФункции

Функция ФОД_ПолучитьДанныеСотрудникаДляРегистрации(Знач ОбъектЗаполнения)
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		
		Если ОбъектЗаполнения.Свойство("Сотрудник") Тогда
			Возврат ОбъектЗаполнения.Сотрудник;
		КонецЕсли;
		
	КонецЕсли;		

КонецФункции

Функция ФОД_ПолучитьПочтуФизЛица(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если ОбъектЗаполнения.Свойство("Почта") И ЗначениеЗаполнено(ОбъектЗаполнения.Почта) Тогда
		Возврат ОбъектЗаполнения.Почта;
	КонецЕсли;
	
	Возврат Неопределено;	

КонецФункции

Функция ФОД_ПолучитьИФНСКомпании(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	КПП = ФОД_ПолучитьКППКомпании(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(КПП) И ТипЗнч(КПП) = Тип("Строка") Тогда
		Возврат Лев(КПП, 4);
	КонецЕсли;
	
	Если ОбъектЗаполнения.Свойство("НомерИФНС") И ЗначениеЗаполнено(ОбъектЗаполнения.НомерИФНС) Тогда
		Возврат ОбъектЗаполнения.НомерИФНС;
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ФОД_ПолучитьПлатежныеДокументы(Знач ОбъектЗаполнения)
	
	МассивСтруктур = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ОбъектЗаполнения) Тогда
		
		ДобавитьВЖурнал("Не определен объект заполнения!", "ПолучитьТовар");
		Возврат МассивСтруктур;
		
	КонецЕсли;
	
	ПлатежныйДокумент = ФОД_ПолучитьПлатежныйДокумент(ОбъектЗаполнения);
	
	Если ЗначениеЗаполнено(ПлатежныйДокумент.Номер) И ЗначениеЗаполнено(ПлатежныйДокумент.Дата) Тогда
		МассивСтруктур.Добавить(ПлатежныйДокумент);
	КонецЕсли;
	
	Возврат МассивСтруктур;
	
КонецФункции

Функция ФОД_ПолучитьДоговорыНакладной(Знач ОбъектЗаполнения)
	
	МассивДоговоров = Новый Массив;
	МассивДоговоров.Добавить(ФОД_ПолучитьДоговорПоНакладной(ОбъектЗаполнения) );
	Возврат МассивДоговоров;

КонецФункции


Функция ФОД_ПолучитьИмяСоставителяСФ(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Возврат Организация.Наименование;		

КонецФункции

Функция ФОД_ПолучитьКодВалютыДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ВалютаДокумента = ФОД_ПолучитьВалютуДокумента(ОбъектЗаполнения);
	Возврат ФОД_ПолучитьКодЭлемента(ВерсияЗаполнения, ВалютаДокумента);

КонецФункции

Функция ФОД_ПолучитьНаименованиеВалютыДокумента(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ВалютаДокумента = ФОД_ПолучитьВалютуДокумента(ОбъектЗаполнения);
	
	Если КНП_ЕстьРеквизит(ВалютаДокумента, "НаименованиеПолное") Тогда
		Возврат ВалютаДокумента.НаименованиеПолное;
	КонецЕсли;
	
	Возврат ФОД_ПолучитьНаименованиеЭлемента(ВерсияЗаполнения, ВалютаДокумента);

КонецФункции

Функция ФОД_ПолучитьДанныеИсправленияСФ(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	СтруктураДанных = Новый Структура("Номер, Дата");
	Возврат СтруктураДанных;

КонецФункции

Функция ФОД_ОтправительТотЖе(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Грузоотправитель = ФОД_ПолучитьГрузоотправителяДокумента(ОбъектЗаполнения);
	//Если Организация = Грузоотправитель ИЛИ	Грузоотправитель = Неопределено Тогда
	//	Возврат Истина;
	//Иначе
	Возврат Ложь;
	//КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСуммуДокументаДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	НДСВСумме = Неопределено;
	СуммаДокумента = 0;
	
	Если ТипЗнч(ОбъектЗаполнения) = Тип("Структура") Тогда
		Возврат СуммаДокумента;
	КонецЕсли;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") И ОбъектЗаполнения.Авансы.Количество() > 0 Тогда
			//НДСВСумме = Истина;
			//Если ОбъектЗаполнения.Авансы.Выгрузить().Колонки.Найти("СуммаБезНДС") <> Неопределено Тогда
			//	СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаБезНДС");	
			//Иначе
			//	СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("Сумма");	
			//КонецЕсли;
			Возврат 0;
		Иначе
			ОбъектЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Товары") И ОбъектЗаполнения.Товары.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаБезНДСДоИзменения");	
		ИначеЕсли ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("СуммаДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Расхождения") И ОбъектЗаполнения.Расхождения.Количество() > 0 Тогда
		СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("Сумма") + ОбъектЗаполнения.Расхождения.Итог("Сумма");	
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Номенклатура") И ОбъектЗаполнения.Номенклатура.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Номенклатура.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Запасы") И ОбъектЗаполнения.Запасы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Запасы.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") И ОбъектЗаполнения.Услуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Услуги.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "УслугиОказанные") И ОбъектЗаполнения.УслугиОказанные.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.УслугиОказанные.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "РаботыИУслуги") И ОбъектЗаполнения.РаботыИУслуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.РаботыИУслуги.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Доходы") И ОбъектЗаполнения.Доходы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Доходы.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НДСВСумме = Неопределено Тогда
		НДСВСумме = МОП_ДокументВключаетНДСВСумму(ОбъектЗаполнения);
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента Тогда
		
		ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
		ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
		
		Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
			
			СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
			Курс = СтруктураПараметров.Курс;
			Кратность = СтруктураПараметров.Кратность;
			СуммаДокумента = СуммаДокумента * Курс / Кратность;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НДСВСумме Тогда
		СуммаДокумента = СуммаДокумента - ФОД_ПолучитьСуммуНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);	
	КонецЕсли;
	
	Возврат СуммаДокумента;

КонецФункции

Функция ФОД_ПолучитьСуммуНДСДокументаДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	//Changelog
	//
	//22.03.2019 - добавлен обработчик ТЧ Авансы для счетов-фактур
	
	СуммаДокумента = 0;
	
	Если МОП_ЭтоСчетФактура(ОбъектЗаполнения) Тогда
		
		Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Авансы") И ОбъектЗаполнения.Авансы.Количество() > 0 Тогда
			
			Если ОбъектЗаполнения.Авансы.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
				СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("НДСДоИзменения");	
			Иначе
				СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаНДСДоИзменения");	
			КонецЕсли;
			
		Иначе
			ОбъектЗаполнения = МОП_ПолучитьОснованиеДокумента(ОбъектЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Товары") И ОбъектЗаполнения.Товары.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("НДСДоИзменения");	
		ИначеЕсли ОбъектЗаполнения.Товары.Выгрузить().Колонки.Найти("СуммаНДСДоИзменения") <> Неопределено Тогда 
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Расхождения") И ОбъектЗаполнения.Расхождения.Количество() > 0 Тогда
		СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Товары.Итог("СуммаНДС") + ОбъектЗаполнения.Расхождения.Итог("СуммаНДС");	
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Запасы") И ОбъектЗаполнения.Запасы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Запасы.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Запасы.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Номенклатура") И ОбъектЗаполнения.Номенклатура.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Номенклатура.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Номенклатура.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Услуги") И ОбъектЗаполнения.Услуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Услуги.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Услуги.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "УслугиОказанные") И ОбъектЗаполнения.УслугиОказанные.Количество() > 0 Тогда
		Если ОбъектЗаполнения.УслугиОказанные.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.УслугиОказанные.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "РаботыИУслуги") И ОбъектЗаполнения.РаботыИУслуги.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.РаботыИУслуги.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.РаботыИУслуги.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ОбъектЗаполнения, "Доходы") И ОбъектЗаполнения.Доходы.Количество() > 0 Тогда
		
		Если ОбъектЗаполнения.Доходы.Выгрузить().Колонки.Найти("НДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("НДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Доходы.Итог("СуммаНДСДоИзменения");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если КонвертацияВалютПоКурсуДокумента Тогда
		
		ВалютаДокумента = МОП_ПолучитьВалютуДокумента(ОбъектЗаполнения.Ссылка);
		ВалютаДоговора = МОП_ПолучитьВалютуДоговораДокумента(ОбъектЗаполнения.Ссылка);
		
		Если ВалютаДоговора <> ВалютаДокумента Тогда //Требуется перерасчет
			
			СтруктураПараметров = МОП_ПолучитьПараметрыВалютДокумента(ОбъектЗаполнения.Ссылка);
			Курс = СтруктураПараметров.Курс;
			Кратность = СтруктураПараметров.Кратность;
			СуммаДокумента = Окр(СуммаДокумента * Курс / Кратность, 0);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СуммаДокумента;

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСДокументаДо(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	Если МОП_ЭтоСчетФактураНаАванс(ОбъектЗаполнения) Тогда
		
		СуммаДокумента = 0;
		
		Если ОбъектЗаполнения.Авансы.Выгрузить().Колонки.Найти("СуммаБезНДСДоИзменения") <> Неопределено Тогда
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаБезНДСДоИзменения");	
		Иначе
			СуммаДокумента = СуммаДокумента + ОбъектЗаполнения.Авансы.Итог("СуммаДоИзменения");	
		КонецЕсли;
		
		Возврат СуммаДокумента;
		
	Иначе
		Возврат ФОД_ПолучитьСуммуДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения) + ФОД_ПолучитьСуммуНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	КонецЕсли;

КонецФункции

Функция ФОД_ПолучитьСуммуДокументаРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;			

КонецФункции

Функция ФОД_ПолучитьСуммуНДСДокументаРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;			

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСДокументаРост(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуСНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуСНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле >= ЗначениеДо Тогда
		Возврат ЗначениеПосле - ЗначениеДо;
	Иначе
		Возврат Неопределено;
	КонецЕсли;			

КонецФункции

Функция ФОД_ПолучитьСуммуДокументаПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле <= ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;			

КонецФункции

Функция ФОД_ПолучитьСуммуНДСДокументаПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле <= ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;				

КонецФункции

Функция ФОД_ПолучитьСуммуСНДСДокументаПадение(ВерсияЗаполнения, Знач ОбъектЗаполнения)
	
	ЗначениеПосле 	= ФОД_ПолучитьСуммуСНДСДокумента(ВерсияЗаполнения, ОбъектЗаполнения);
	ЗначениеДо 		= ФОД_ПолучитьСуммуСНДСДокументаДо(ВерсияЗаполнения, ОбъектЗаполнения);
	
	Если ЗначениеПосле <= ЗначениеДо Тогда
		Возврат ЗначениеДо - ЗначениеПосле;
	Иначе
		Возврат Неопределено;
	КонецЕсли;				

КонецФункции

//#КонецОбласти 
////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#КонецОбласти ФорматыОписанияДанных				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#Область ФормированиеПечатныхФорм 				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ФормированиеПечатныхФорм

Функция ПФ_СформироватьПечатнуюФормуXML(ДанныеXML, ТипФормы, Подписан = Ложь)
	
	Результат = Неопределено;
	
	Попытка
		
		Если НЕ ЗначениеЗаполнено(ДанныеXML) Тогда
			Возврат Результат;
		КонецЕсли;
		
		ОбъектXML = Новый ЧтениеXML;
		
		Если Найти(ДанныеXML, "<?xml") Тогда
			ОбъектXML.УстановитьСтроку(ДанныеXML);
		Иначе
			Возврат Результат;
		КонецЕсли;
		
	Исключение	
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "СформироватьПечатнуюФормуXML");
		Возврат Результат;
		
	КонецПопытки;
	
	Если Найти(ТипФормы, "Счет на оплату") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуСчетаНаОплатуXML(ОбъектXML, Подписан);
	ИначеЕсли ТипФормы = "Счет-фактура" Тогда
		Результат = ПФ_СформироватьПечатнуюФормуСчетФактураXML(ОбъектXML, Подписан);	
	ИначеЕсли Найти(НРег(ТипФормы), "накладная") ИЛИ Найти(ВРег(ТипФормы), "ТОРГ") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуТорг12XML(ОбъектXML, Подписан);
	ИначеЕсли Найти(НРег(ТипФормы), "акт") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуАктаXML(ОбъектXML, Подписан);
	ИначеЕсли Найти(ТипФормы, "передат") ИЛИ ТипФормы = "УПД" Тогда  //УПД
		Результат = ПФ_СформироватьПечатнуюФормуУПДXML(ОбъектXML, Подписан);
	ИначеЕсли Найти(НРег(ТипФормы), "корректир") ИЛИ ТипФормы = "УКД" Тогда //УКД
		Результат = ПФ_СформироватьПечатнуюФормуУКДXML(ОбъектXML, Подписан);
	ИначеЕсли Найти(НРег(ТипФормы), "подтверждение") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуСлужебногоСообщенияXML(ОбъектXML, Подписан, ТипФормы);	
	ИначеЕсли Найти(НРег(ТипФормы), "извещение") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуСлужебногоСообщенияXML(ОбъектXML, Подписан, ТипФормы);
	ИначеЕсли Найти(НРег(ТипФормы), "упд фнс 820") Тогда
		Результат = ПФ_СформироватьПечатнуюФормуУПДXML(ОбъектXML, Подписан);
	КонецЕсли;
	
	Возврат Результат;	

КонецФункции

Функция ПФ_ПолучитьСтруктуруДанныхИзXML(ОбъектXML, Знач СтруктураДокумента)
	
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	Возврат СтруктураДокумента;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуСчетаНаОплатуXML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФСчетНаОплатуПокупателю();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФСчетНаОплатуПокупателю(СтруктураДокумента);
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуТорг12XML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФНакладнойПродавца();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФНакладнойПродавца(СтруктураДокумента);
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуАктаXML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФАктаИсполнителя();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФАктаИсполнителя(СтруктураДокумента);
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуСчетФактураXML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУПДПродавца();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФСчетФактуры(СтруктураДокумента);
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуУПДXML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУПДПродавца();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФУПДПродавца(СтруктураДокумента);
	
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуУКДXML(ОбъектXML, Подписан = Ложь)
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУКДПродавца();
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДокумента);
	ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML);
	
	Если СтруктураДокумента = Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Если Подписан Тогда 
		СтруктураДокумента.Вставить("ВидПодписи", "Электронная подпись") 
	КонецЕсли;
	
	ТабДок = ПФ_СформироватьПФУКДПродавца(СтруктураДокумента);
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПечатнуюФормуСлужебногоСообщенияXML(ОбъектXML, Подписан = Ложь, ИмяДокумента = "")
	
	СтруктураДанных = XML_ПрочитатьВСтруктуру(ОбъектXML);
	
	Если СтруктураДанных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураДокумента = ПФ_ПолучитьСтруктуруСлужебногоСообщения(); 
	ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДанных);
	
	//Переменные
	ТипДокумента = ИмяДокумента;
	ИдентификаторЭД = "";
	ОператорЭДО = "ДиСтэйт";
	ВерсияФормата = "1.0";
	Содержание = "";
	ПредставлениеОтправителя = "";
	ПредставлениеПолучателя = "";
	ИдентификаторОтправителя = "";
	ИдентификаторПолучателя = "";
	КНД = "";
	СтатусПодписиОтправителя = "Не подписан";
	СтатусПодписиПолучателя = ?(Подписан, "Подписан", "Не подписан");
	
	
	/////////////////////////////////////////////////////////
	//			Парсинг
	СтруктураДанных = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "Файл");
	
	Если ЗначениеЗаполнено(СтруктураДанных) Тогда
		
		ВерсияФормата = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "ВерсФорм");
		ИдентификаторЭД = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "ИдФайл");
		
		ДанныеДокумента = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "Документ");
		
		Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
			
			КНД = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "КНД");
			
			Если ДанныеДокумента.Свойство("ОперЭДО") Тогда
				ОператорЭДО = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ОперЭДО, "НаимОрг")
				+ " " + КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ОперЭДО, "ИННЮЛ");
			КонецЕсли;
			
			Если ДанныеДокумента.Свойство("ОтпрДок") Тогда
				
				ИдентификаторОтправителя = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ОтпрДок, "ИдУчастЭДО");
				ДанныеЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ОтпрДок, "ЮЛ");
				
				Если ЗначениеЗаполнено(ДанныеЮЛ) Тогда
					ПредставлениеОтправителя = ДанныеЮЛ.НаимОрг + ", ИНН " + ДанныеЮЛ.ИННЮЛ + " \ КПП " + ДанныеЮЛ.КПП;	
				КонецЕсли;
				
				ОперЭДО = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ОтпрДок, "ОперЭДО");
				
				Если ЗначениеЗаполнено(ОперЭДО) Тогда
					ПредставлениеОтправителя = КНП_БезопасноПрочитатьЗначение(ОперЭДО, "НаимОрг")
					+ " " + КНП_БезопасноПрочитатьЗначение(ОперЭДО, "ИННЮЛ");	
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеДокумента.Свойство("СвОтпрДок") Тогда
				
				ИдентификаторОтправителя = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвОтпрДок, "ИдУчастЭДО");
				ДанныеЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвОтпрДок, "ОтпрЮЛ");
				
				Если ЗначениеЗаполнено(ДанныеЮЛ) Тогда
					ПредставлениеОтправителя = ДанныеЮЛ.НаимОрг + ", ИНН " + ДанныеЮЛ.ИННЮЛ + " \ КПП " + ДанныеЮЛ.КПП;	
				КонецЕсли;
				
				ОперЭДО = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвОтпрДок, "ОперЭДО");
				
				Если ЗначениеЗаполнено(ОперЭДО) Тогда
					ОператорЭДО = КНП_БезопасноПрочитатьЗначение(ОперЭДО, "НаимОрг")
					+ " " + КНП_БезопасноПрочитатьЗначение(ОперЭДО, "ИННЮЛ");	
				КонецЕсли;	
				
			КонецЕсли;
			
			Если ДанныеДокумента.Свойство("ПолДок") Тогда
				
				ИдентификаторПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ПолДок, "ИдУчастЭДО");
				ДанныеЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.ПолДок, "ЮЛ");
				
				Если ЗначениеЗаполнено(ДанныеЮЛ) Тогда
					ПредставлениеПолучателя = ДанныеЮЛ.НаимОрг + ", ИНН " + ДанныеЮЛ.ИННЮЛ + " \ КПП " + ДанныеЮЛ.КПП;	
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеДокумента.Свойство("СвПолДок") Тогда
				
				ИдентификаторПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвПолДок, "ИдУчастЭДО");
				ДанныеЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвПолДок, "ОтпрЮЛ");
				
				Если ЗначениеЗаполнено(ДанныеЮЛ) Тогда
					ПредставлениеПолучателя = ДанныеЮЛ.НаимОрг + ", ИНН " + ДанныеЮЛ.ИННЮЛ + " \ КПП " + ДанныеЮЛ.КПП;	
				КонецЕсли;
				
			КонецЕсли;
			
			Если ДанныеДокумента.Свойство("УчастЭДО") Тогда
				
				ИдентификаторПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.УчастЭДО, "ИдУчастЭДО");
				ДанныеЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.УчастЭДО, "ЮЛ");
				
				Если ЗначениеЗаполнено(ДанныеЮЛ) Тогда
					ПредставлениеПолучателя = ДанныеЮЛ.НаимОрг + ", ИНН " + ДанныеЮЛ.ИННЮЛ + " \ КПП " + ДанныеЮЛ.КПП;	
				КонецЕсли;
				
			КонецЕсли;
			
			
			//Сведения о подтверждении
			Если ДанныеДокумента.Свойство("СведПодтв") Тогда
				
				СведенияДокумента = ДанныеДокумента.СведПодтв;
				
				Если СведенияДокумента.Свойство("ДатаОтпр") Тогда
					
					Содержание = ?(ЗначениеЗаполнено(Содержание), Содержание + Символы.ПС, "") + "Дата отправки: " + СведенияДокумента.ДатаОтпр;
					
					Если СведенияДокумента.Свойство("ВремяОтпр") Тогда
						Содержание = Содержание + " " + СведенияДокумента.ВремяОтпр;
					КонецЕсли;
					
				КонецЕсли;
				
				СведОтпрФайл = КНП_БезопасноПрочитатьЗначение(СведенияДокумента, "СведОтпрФайл");
				
				Если ЗначениеЗаполнено(СведОтпрФайл) Тогда
					
					Содержание = ?(ЗначениеЗаполнено(Содержание), Содержание + Символы.ПС, "") + "подтверждение файла " 
					+ КНП_БезопасноПрочитатьЗначение(СведОтпрФайл, "ИмяПостФайла") ;
					СведенияЭЦП = КНП_БезопасноПрочитатьЗначение(СведОтпрФайл, "ЭЦППолФайл");
					
					Если ЗначениеЗаполнено(СведенияЭЦП) И ЗначениеЗаполнено(КНП_БезопасноПрочитатьЗначение(СведенияЭЦП, "Значение") ) Тогда
						СтатусПодписиОтправителя = "Подписан";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Извещение о получении
			Если ДанныеДокумента.Свойство("СвИзвПолуч") Тогда
				
				СведенияДокумента = ДанныеДокумента.СвИзвПолуч;
				
				Если СведенияДокумента.Свойство("ДатаПол") Тогда
					
					Содержание = ?(ЗначениеЗаполнено(Содержание), Содержание + Символы.ПС, "") + "Дата отправки: " + СведенияДокумента.ДатаПол;
					
					Если СведенияДокумента.Свойство("ВремяПол") Тогда
						Содержание = Содержание + " " + СведенияДокумента.ВремяПол;
					КонецЕсли;
					
				КонецЕсли;
				
				СведПолФайл = КНП_БезопасноПрочитатьЗначение(СведенияДокумента, "СведПолФайл");
				ИмяПостФайла = КНП_БезопасноПрочитатьЗначение(СведПолФайл, "ИмяПостФайла");
				
				Если ЗначениеЗаполнено(СведПолФайл) Тогда
					
					Содержание = ?(ЗначениеЗаполнено(Содержание), Содержание + Символы.ПС, "") + "Получен файл " 
					+ ИмяПостФайла ;
					СведенияЭЦП = КНП_БезопасноПрочитатьЗначение(СведПолФайл, "ЭЦППолФайл");
					
					Если ЗначениеЗаполнено(СведенияЭЦП) И ЗначениеЗаполнено(КНП_БезопасноПрочитатьЗначение(СведенияЭЦП, "Значение") ) Тогда
						СтатусПодписиОтправителя = "Подписан";
					КонецЕсли;
					
				КонецЕсли;	
				
				Если Лев(ИмяПостФайла, 2) = "ON" Тогда
					
					Врем = ИдентификаторОтправителя;
					ИдентификаторОтправителя = ИдентификаторПолучателя;
					ИдентификаторПолучателя = Врем;
					Врем = ПредставлениеОтправителя;
					ПредставлениеОтправителя = ПредставлениеПолучателя;
					ПредставлениеПолучателя = Врем;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ТипДокумента", ТипДокумента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторЭД", ИдентификаторЭД);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеОператора", ОператорЭДО);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ВерсияФормата", ВерсияФормата);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КНД", КНД);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СодержаниеДокумента", Содержание);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеОтправителя", ПредставлениеОтправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеПолучателя", ПредставлениеПолучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторОтправителя", ИдентификаторОтправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторПолучателя", ИдентификаторПолучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СтатусПодписиОтправителя", СтатусПодписиОтправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СтатусПодписиПолучателя", СтатусПодписиПолучателя);
	Возврат ПФ_СформироватьПФСлужебногоСообщения(СтруктураДокумента);
	
	
КонецФункции

Процедура ПФ_ДополнитьСтруктуруСведениямиОбЭД(СтруктураДанных)
	
	СтруктураДанных.Вставить("ПредставлениеОператора");
	СтруктураДанных.Вставить("ИдентификаторЭД");
	СтруктураДанных.Вставить("ИдентификаторОтправителя");
	СтруктураДанных.Вставить("ИдентификаторПолучателя");

КонецПроцедуры

Функция ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(Структура)
	
	СтрокаПредставления = "";
	ИмяПодразделения = КНП_БезопасноПрочитатьЗначение(Структура, "СтруктПодр");
	СвОрг = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвОрг"); 
	СвИп = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвИП");
	
	Если ЗначениеЗаполнено(СвОрг) Тогда
		
		СвЮЛ = КНП_БезопасноПрочитатьЗначение(СвОрг, "СвЮЛ");
		
		Если ЗначениеЗаполнено(СвЮЛ) Тогда
			
			Если СвЮЛ.Свойство("НаимОрг") Тогда
				СтрокаПредставления = СвЮЛ.НаимОрг;
			КонецЕсли;
			
		КонецЕсли;  
		
	ИначеЕсли ЗначениеЗаполнено(СвИп) Тогда
		
		СвФИО = КНП_БезопасноПрочитатьЗначение(СвИп, "ФИО");
		
		Если ЗначениеЗаполнено(СвФИО) Тогда
			
			Если СвФИО.Свойство("Фамилия") Тогда
				СтрокаПредставления = СвФИО.Фамилия + " ";
			КонецЕсли; 
			
			Если СвФИО.Свойство("Имя") Тогда
				СтрокаПредставления = СтрокаПредставления + СвФИО.Имя;
			КонецЕсли;
			
		КонецЕсли; 
		
	Иначе
		
		СвЮЛУч = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвЮЛУч");
		
		Если ЗначениеЗаполнено(СвЮЛУч) Тогда
			
			Если СвЮЛУч.Свойство("НаимОрг") Тогда
				СтрокаПредставления = СвЮЛУч.НаимОрг;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяПодразделения) И ИмяПодразделения <> "Основной офис" Тогда
		СтрокаПредставления = СтрокаПредставления + " (" + ИмяПодразделения + ")";
	КонецЕсли;
	
	Возврат СтрокаПредставления;

КонецФункции

Функция ПФ_РазобратьИзСтруктурыАдресОрганизации(Структура)
	
	СтрокаАдреса = "";
	
	Если Структура.Свойство("Адрес") Тогда
		
		АдрРФ = КНП_БезопасноПрочитатьЗначение(Структура.Адрес, "АдрРФ");
		АдрИнф = КНП_БезопасноПрочитатьЗначение(Структура.Адрес, "АдрИнф");
		
		Если ЗначениеЗаполнено(АдрРФ) Тогда
			
			Если АдрРФ.Свойство("Индекс") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + АдрРФ.Индекс;
			КонецЕсли;
			
			Если АдрРФ.Свойство("КодРегион") Тогда
				
				Регион = СправочникРегионы.Найти(Число(АдрРФ.КодРегион), "КодРегиона");
				
				Если ЗначениеЗаполнено(Регион) Тогда
					СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + Регион.ИмяРегиона;
				КонецЕсли;
				
			КонецЕсли;
			
			Если АдрРФ.Свойство("Город") Тогда
				
				Если Найти(АдрРФ.Город, "Москва") ИЛИ Найти(АдрРФ.Город, "Санкт") Тогда
					
				Иначе
					СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + АдрРФ.Город;
				КонецЕсли;
				
			КонецЕсли;
			
			Если АдрРФ.Свойство("Район") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Район", АдрРФ.Район);
			КонецЕсли;
			
			Если АдрРФ.Свойство("НаселПункт") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("НаселПункт", АдрРФ.НаселПункт);
			КонецЕсли;
			
			Если АдрРФ.Свойство("Улица") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Улица", АдрРФ.Улица);
			КонецЕсли;
			
			Если АдрРФ.Свойство("Дом") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Дом", АдрРФ.Дом);
			КонецЕсли;
			
			Если АдрРФ.Свойство("Корпус") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + ?(Найти(нрег(СтрокаАдреса),"Строение") > 0, 
				           КНП_ПолучитьСокращениеРеквАдреса("Строение", АдрРФ.Корпус),КНП_ПолучитьСокращениеРеквАдреса("Корпус", АдрРФ.Корпус));
			КонецЕсли;
			
			Если АдрРФ.Свойство("Кварт") Тогда
				СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Квартира", АдрРФ.Кварт);
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(АдрИнф) Тогда
			
			Возврат АдрИнф.АдрТекст;	
			
		КонецЕсли;
		
	ИначеЕсли Структура.Свойство("region") Тогда
		
		//Это счет на оплату - свой формат
		Если Структура.Свойство("postalCode") И ЗначениеЗаполнено(Структура.postalCode) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + Структура.postalCode;	
		КонецЕсли;
		
		Если Структура.Свойство("country") И ЗначениеЗаполнено(Структура.country) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + Структура.country;	
		КонецЕсли;
		
		Если Структура.Свойство("region") И ЗначениеЗаполнено(Структура.region) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + Структура.region;	
		КонецЕсли;
		
		Если Структура.Свойство("city") И ЗначениеЗаполнено(Структура.city) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + Структура.city;	
		КонецЕсли;
		
		Если Структура.Свойство("street") И ЗначениеЗаполнено(Структура.street) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Улица", Структура.street);	
		КонецЕсли;
		
		Если Структура.Свойство("house") И ЗначениеЗаполнено(Структура.house) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Дом", Структура.house);	
		КонецЕсли;
		
		Если Структура.Свойство("building") И ЗначениеЗаполнено(Структура.building) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Корпус", Структура.building);	
		КонецЕсли;
		
		Если Структура.Свойство("room") И ЗначениеЗаполнено(Структура.room) Тогда
			СтрокаАдреса = ?(СтрокаАдреса = "", "", СтрокаАдреса + ", ") + КНП_ПолучитьСокращениеРеквАдреса("Квартира", Структура.room);	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтрокаАдреса;

КонецФункции

Функция ПФ_РазобратьИзСтруктурыБИКБанка(Структура)
	
	Если Структура.Свойство("БанкРекв") Тогда
		
		СвБанк = КНП_БезопасноПрочитатьЗначение(Структура.БанкРекв, "СвБанк");
		Возврат КНП_БезопасноПрочитатьЗначение(СвБанк, "БИК");
		
	КонецЕсли;

КонецФункции

Функция ПФ_РазобратьИзСтруктурыНаименованиеБанка(Структура)
	
	Если Структура.Свойство("БанкРекв") Тогда
		
		СвБанк = КНП_БезопасноПрочитатьЗначение(Структура.БанкРекв, "СвБанк");
		НаимБанк = КНП_БезопасноПрочитатьЗначение(СвБанк, "НаимБанк");
		
		Если НаимБанк = Неопределено Тогда
			
			БИК = КНП_БезопасноПрочитатьЗначение(СвБанк, "БИК");
			
			Если ЗначениеЗаполнено(БИК) Тогда
				
				Банк = МОП_ПолучитьБанкПоБИКу(БИК);
				
				Если ЗначениеЗаполнено(Банк) Тогда
					Возврат Банк.Наименование;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ПФ_РазобратьИзСтруктурыСчетОрганизации(Структура)
	
	Если Структура.Свойство("БанкРекв") Тогда
		Возврат КНП_БезопасноПрочитатьЗначение(Структура.БанкРекв, "НомерСчета");
	КонецЕсли;

КонецФункции

Функция ПФ_РазобратьИзСтруктурыИННОрганизации(Структура)
	
	ИННПредставление = "";
	СвОрг = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвОрг"); 
	СвИп = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвИП");
	
	Если ЗначениеЗаполнено(СвОрг) Тогда
		
		СвЮЛ = КНП_БезопасноПрочитатьЗначение(СвОрг, "СвЮЛ");
		
		Если ЗначениеЗаполнено(СвЮЛ) Тогда
			
			Если СвЮЛ.Свойство("ИННЮЛ") Тогда
				ИННПредставление = СвЮЛ.ИННЮЛ;
			КонецЕсли;
			
		КонецЕсли;    
		
	ИначеЕсли ЗначениеЗаполнено(СвИп) Тогда 
		
		Если СвИп.Свойство("ИННФЛ") Тогда
			ИННПредставление = СвИп.ИННФЛ;	
		КонецЕсли;
		
	Иначе
		
		СвЮЛУч = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвЮЛУч");
		
		Если ЗначениеЗаполнено(СвЮЛУч) Тогда
			
			Если СвЮЛУч.Свойство("ИННЮЛ") Тогда
				ИННПредставление = СвЮЛУч.ИННЮЛ;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИННПредставление;

КонецФункции

Функция ПФ_РазобратьИзСтруктурыКППОрганизации(Структура)
	
	КПППредставление = "";
	СвОрг = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвОрг");
	
	Если ЗначениеЗаполнено(СвОрг) Тогда
		
		СвЮЛ = КНП_БезопасноПрочитатьЗначение(СвОрг, "СвЮЛ");
		
		Если ЗначениеЗаполнено(СвЮЛ) Тогда
			
			Если СвЮЛ.Свойство("КПП") Тогда
				КПППредставление = СвЮЛ.КПП;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		СвЮЛУч = КНП_БезопасноПрочитатьЗначение(Структура.ИдСв, "СвЮЛУч");
		
		Если ЗначениеЗаполнено(СвЮЛУч) Тогда
			
			Если СвЮЛУч.Свойство("КПП") Тогда
				КПППредставление = СвЮЛУч.КПП;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат КПППредставление;	

КонецФункции

Функция ПФ_РазобратьИзСтруктурыИнфоПоля(Структура)
	
	Результат = "";
	
	Если ТипЗнч(Структура) = Тип("Структура") Тогда
		
		МассивСтруктурИнфоПолей = Новый Массив;
		МассивСтруктурИнфоПолей.Добавить(Структура);
		
	ИначеЕсли ТипЗнч(Структура) = Тип("Массив") Тогда
		МассивСтруктурИнфоПолей = Структура;
	КонецЕсли;
	
	Для Каждого ИнфоПоле Из МассивСтруктурИнфоПолей Цикл
		
		Если ИнфоПоле.Свойство("Идентиф") ИЛИ ИнфоПоле.Свойство("Значен") Тогда
			
			Если ЗначениеЗаполнено(Результат) Тогда 
				Результат = Результат + ", " 
			КонецЕсли;
			
			Если КНП_БезопасноПрочитатьЗначение(ИнфоПоле, "Идентиф") = "additional_information" Тогда
				Результат = Результат + КНП_БезопасноПрочитатьЗначение(ИнфоПоле, "Значен"); 	
			Иначе
				Результат = Результат + КНП_БезопасноПрочитатьЗначение(ИнфоПоле, "Идентиф")
				+ ": "	 + КНП_БезопасноПрочитатьЗначение(ИнфоПоле, "Значен");
			КонецЕсли;
			
		Иначе
			
			Для Каждого КлючИнфоПоля Из ИнфоПоле Цикл
				
				Если ТипЗнч(КлючИнфоПоля.Значение) = Тип("Структура") Тогда
					
					Если ЗначениеЗаполнено(Результат) Тогда 
						Результат = Результат + ", " 
					КонецЕсли;
					
					Результат 	= Результат + КНП_БезопасноПрочитатьЗначение(КлючИнфоПоля.Значение, "Идентиф")
					+ ": "		+ КНП_БезопасноПрочитатьЗначение(КлючИнфоПоля.Значение, "Значен");
					
				ИначеЕсли ТипЗнч(КлючИнфоПоля.Значение) = Тип("Массив") Тогда
					
					Для Каждого ЭлементКлюча Из КлючИнфоПоля.Значение Цикл
						
						Если ЗначениеЗаполнено(Результат) Тогда 
							Результат = Результат + ", " 
						КонецЕсли;
						
						Если КНП_БезопасноПрочитатьЗначение(ИнфоПоле, "Идентиф") = "additional_information" Тогда
							Результат = Результат + КНП_БезопасноПрочитатьЗначение(ЭлементКлюча, "Значен"); 	
						Иначе
							Результат = Результат + КНП_БезопасноПрочитатьЗначение(ЭлементКлюча, "Идентиф")
							+ ": "	 + КНП_БезопасноПрочитатьЗначение(ЭлементКлюча, "Значен");
						КонецЕсли;	
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Возврат Результат;	

КонецФункции

Процедура ПФ_РазобратьXMLДляПечатнойФормы(СтруктураДокумента, ОбъектXML)
	
	СтруктураДанных = XML_ПрочитатьВСтруктуру(ОбъектXML);
	
	Если СтруктураДанных = Неопределено Тогда
		
		СтруктураДокумента = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	
	ИмяОрганизации = "";
	ИННОрганизации = "";
	КППОрганизации = "";
	АдресОрганизации = "";
	БанкОрганизации = "";
	БИКБанкаОрганизации = "";
	КоррСчетБанкаОрганизации = "";
	СчетОрганизации = "";
	
	ИмяКонтрагента = "";
	ИННКонтрагента = "";
	КППКонтрагента = "";
	АдресКонтрагента = "";
	БанкКонтрагента = "";
	БИКБанкаКонтрагента = "";
	КоррСчетБанкаКонтрагента = "";
	СчетКонтрагента = "";
	
	ИмяГрузоотправителя = "";
	ИННГрузоотправителя = "";
	КППГрузоотправителя = "";
	АдресГрузоотправителя = "";
	БанкГрузоотправителя = "";
	БИКБанкаГрузоотправителя = "";
	КоррСчетБанкаГрузоотправителя = "";
	СчетГрузоотправителя = "";
	
	ИмяГрузополучателя = "";
	ИННГрузополучателя = "";
	КППГрузополучателя = "";
	АдресГрузополучателя = "";
	БанкГрузополучателя = "";
	БИКБанкаГрузополучателя = "";
	КоррСчетБанкаГрузополучателя = "";
	СчетГрузополучателя = "";
	
	
	СтавкаНДС = "";
	СуммаИтого = 0;
	СуммаСНДСИтого = 0;
	СуммаНДС = 0;
	КоличествоСтрок = 0;
	МассаБруттоИтого = 0;
	КоличествоИтого = 0;
	КоличествоМестИтого = 0;
	ДолжностьПодписанта = "";
	ФИОПодписанта = "";
	ТипУПД = "";
	ИдентификаторГосКонтракта = "--";
	НомерДокумента = "";
	ДатаДокумента = "";
	НомерОснованияКорректировки = "";
	ДатаОснованияКорректировки = "";
	РазницаУвеличение = 0;
	РазницаУменьшение = 0;
	РазницаНДСУвеличение = 0;
	РазницаНДСУменьшение = 0;
	РазницаСНДСУвеличение = 0;
	РазницаСНДСУменьшение = 0;
	РазницаАкцизУвеличение = 0;
	РазницаАкцизУменьшение = 0;
	ДанныеКорректировки = Неопределено;
	ТабличнаяЧастьКорректировки = Неопределено;
	Валюта = Неопределено;
	ПредставлениеОператора = "";
	ИдентификаторЭД = "";
	ИдентификаторОтправителя = "";
	ИдентификаторПолучателя = "";
	ДоговорОснование = "";
	ЭтоУПД = Ложь;
	ЭтоСчет = Ложь;
	ЭтоКорректировка = Ложь;
	КоличествоЗаписей = 1;
	ИнфоПоля = "";
	ПлатежноРасчетныйДокумент = "";
	ДатаОтпускаГруза = "";
	ФИООтпустившегоГруз = "";
	ДолжностьОтпустившегоГруз = "";
	ДатаОтгрузкиПередачи = "";
	ОнЖе = Ложь;
	ДокументыОбОтгрузке = "";
	
	
	/////////////////////////////////////////////////////////////////////
	//		Разбор XML-структуры
	
	Если СтруктураДанных.Свойство("Файл") Тогда
		СтруктураДанных = СтруктураДанных.Файл;
	КонецЕсли;
	
	Если СтруктураДанных.Свойство("File") Тогда
		
		СтруктураДанных = СтруктураДанных.File;
		ЭтоСчет = Истина;
		
	КонецЕсли;
	
	ИдентификаторЭД = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, ?(ЭтоСчет, "name", "ИдФайл") );
	ДанныеОбУчастникахДО = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "СвУчДокОбор");
	
	Если ЗначениеЗаполнено(ДанныеОбУчастникахДО) Тогда
		
		ИдентификаторОтправителя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО, "ИдОтпр");
		ИдентификаторПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО, "ИдПол");
		ДанныеОбОператоре = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО, "СвОЭДОтпр");
		
		Если ЗначениеЗаполнено(ДанныеОбОператоре) Тогда
			ПредставлениеОператора = КНП_БезопасноПрочитатьЗначение(ДанныеОбОператоре, "НаимОрг") 
			+ " / " 
			+ КНП_БезопасноПрочитатьЗначение(ДанныеОбОператоре, "ИННЮЛ");	
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДанныеОбУчастникахДО) И ЭтоСчет Тогда
		
		ДанныеОбУчастникахДО = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "Parties");
		
		Если ЗначениеЗаполнено(ДанныеОбУчастникахДО) Тогда
			
			ИдентификаторОтправителя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО.Sender, "diServerId");
			ИдентификаторПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО.Receiver, "diServerId");
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеДокумента = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "Документ");
	
	Если НЕ ЗначениеЗаполнено(ДанныеДокумента) И ЭтоСчет Тогда
		ДанныеДокумента = СтруктураДанных;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДокумента) Тогда
		
		/////////////////////////////////////////////////////////////////
		//		Обработка данных документа
		
		ТипУПД = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "Функция");
		ДанныеТоваров = Неопределено;
		ДанныеУслуг = Неопределено;
		ДанныеШапки = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "СвДокПТПрКроме");
		
		Если ЗначениеЗаполнено(ДанныеШапки) И ДанныеШапки.Свойство("СвДокПТПр") Тогда
			
			ДанныеТоваров = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "СодФХЖ2");
			ДанныеШапки = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "СвДокПТПр");	
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеШапки) Тогда
			ДанныеШапки = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "СвДокПРУ");	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеШапки) Тогда
			
			ДанныеШапки = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "СвСчФакт");
			ДанныеТоваров = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "ТаблСчФакт");
			
			Если ЗначениеЗаполнено(ДанныеШапки) Тогда
				ЭтоУПД = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеШапки) Тогда
			
			ДанныеШапки = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "СвКСчФ");
			ДанныеТоваров = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "ТаблКСчФ");
			
			Если ЗначениеЗаполнено(ДанныеШапки) Тогда
				
				ЭтоКорректировка = Истина;
				ЭтоУПД = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДанныеШапки) И ЭтоСчет Тогда
			
			ДанныеШапки = ДанныеДокумента;
			ДанныеТоваров = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "Goods");
			
		КонецЕсли;
		
		
		Если ЗначениеЗаполнено(ДанныеШапки) Тогда
			
			Если ЭтоСчет Тогда
				
				НомерДокумента = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "number");
				ДатаДокумента = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "date");
				ДанныеШапкиПлатежа = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "PaymentDetails");
				
				Если ЗначениеЗаполнено(ДанныеШапкиПлатежа) Тогда
					
					ДанныеБанка = КНП_БезопасноПрочитатьЗначение(ДанныеШапкиПлатежа, "Bank");
					
					Если ЗначениеЗаполнено(ДанныеБанка) Тогда
						
						КоррСчетБанкаОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеБанка, "account");
						БанкОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеБанка, "name");
						БИКБанкаОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеБанка, "bik");
						
					КонецЕсли;
					
					СчетОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеШапкиПлатежа, "account");
					ИННОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеШапкиПлатежа, "inn");
					КППОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеШапкиПлатежа, "kpp");
					ИмяОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеШапкиПлатежа, "name");
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторОтправителя) Тогда
					
					ДанныеОтправителя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО.Sender, "Company");
					
					Если ЗначениеЗаполнено(ДанныеОтправителя) Тогда
						
						ИННОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеОтправителя, "inn");
						КППОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеОтправителя, "kpp");
						ИмяОрганизации = КНП_БезопасноПрочитатьЗначение(ДанныеОтправителя, "name");
						СтруктураАдреса = КНП_БезопасноПрочитатьЗначение(ДанныеОтправителя, "Address");
						
						Если ЗначениеЗаполнено(СтруктураАдреса) Тогда
							АдресОрганизации = ПФ_РазобратьИзСтруктурыАдресОрганизации(СтруктураАдреса);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ИдентификаторПолучателя) Тогда
					
					ДанныеПолучателя = КНП_БезопасноПрочитатьЗначение(ДанныеОбУчастникахДО.Receiver, "Company");
					
					Если ЗначениеЗаполнено(ДанныеПолучателя) Тогда
						
						ИННКонтрагента = КНП_БезопасноПрочитатьЗначение(ДанныеПолучателя, "inn");
						КППКонтрагента = КНП_БезопасноПрочитатьЗначение(ДанныеПолучателя, "kpp");
						ИмяКонтрагента = КНП_БезопасноПрочитатьЗначение(ДанныеПолучателя, "name");
						СтруктураАдреса = КНП_БезопасноПрочитатьЗначение(ДанныеПолучателя, "Address");
						
						Если ЗначениеЗаполнено(СтруктураАдреса) Тогда
							АдресКонтрагента = ПФ_РазобратьИзСтруктурыАдресОрганизации(СтруктураАдреса);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				////////////////////////////////////////////////////////////////////////////////////
				//	Утвержденный XML РФ
				СвПРД = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "СвПРД");
				
				Если ЗначениеЗаполнено(СвПРД) Тогда
					
					НомерПРД = Строка(КНП_БезопасноПрочитатьЗначение(СвПРД, "НомерПРД") );
					ДатаПРД = Строка(КНП_БезопасноПрочитатьЗначение(СвПРД, "ДатаПРД") );
					
					Если ЗначениеЗаполнено(НомерПРД) И ТипЗнч(НомерПРД) = Тип("Строка") Тогда
						
						ПлатежноРасчетныйДокумент = НомерПРД;
						
						Если ЗначениеЗаполнено(ДатаПРД) И ТипЗнч(ДатаПРД) = Тип("Строка") Тогда
							ПлатежноРасчетныйДокумент = ПлатежноРасчетныйДокумент + " от " + ДатаПРД;
						КонецЕсли;
						
					КонецЕсли;		
					
				КонецЕсли;
				
				//С 1 июля 2021 года новый формат УПД \ УКД
				ДокПодтвОтгр = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "ДокПодтвОтгр");
				
				Если ЗначениеЗаполнено(ДокПодтвОтгр) Тогда
					ДокументыОбОтгрузке = КНП_БезопасноПрочитатьЗначение(ДокПодтвОтгр, "НаимДокОтгр") + " № " + КНП_БезопасноПрочитатьЗначение(ДокПодтвОтгр, "НомДокОтгр") + " от " + КНП_БезопасноПрочитатьЗначение(ДокПодтвОтгр, "ДатаДокОтгр");
				КонецЕсли;
				
				Если НЕ ЭтоУПД Тогда
					
					ЕдиницаВалюты = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "ДенИзм");
					
					Если ЗначениеЗаполнено(ЕдиницаВалюты) Тогда
						
						Валюта = СправочникВалюты.Найти(ЕдиницаВалюты.КодОКВ, "КодISO");
						
						Если ЗначениеЗаполнено(Валюта) Тогда
							Валюта = Валюта.Ссылка;
						Иначе
							
							Попытка
								Валюта = Справочники.Валюты.НайтиПоКоду("643");
							Исключение 
							КонецПопытки;
							
						КонецЕсли;
						
					КонецЕсли;
					
					ИдентДок = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "ИдентДок");
					
					Если ЗначениеЗаполнено(ИдентДок) Тогда
						
						НомерДокумента 				= КНП_БезопасноПрочитатьЗначение(ИдентДок, "НомДокПТ");
						
						Если НЕ ЗначениеЗаполнено(НомерДокумента) Тогда
							НомерДокумента 			= КНП_БезопасноПрочитатьЗначение(ИдентДок, "НомДокПРУ");
						КонецЕсли;
						
						ДатаДокумента 				= КНП_БезопасноПрочитатьЗначение(ИдентДок, "ДатаДокПТ");
						
						Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
							ДатаДокумента 			= КНП_БезопасноПрочитатьЗначение(ИдентДок, "ДатаДокПРУ");
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе	
					
					НомерДокумента = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, ?(ЭтоКорректировка, "НомерКСчФ", "НомерСчФ") );
					ДатаДокумента = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, ?(ЭтоКорректировка, "ДатаКСчФ", "ДатаСчФ") );
					
					//+Марков И. 26.03.2025 #UT10-5160
					ЕдиницаВалюты = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "КодОКВ");
					
					Если Не ЗначениеЗаполнено(ЕдиницаВалюты) Тогда
						ЕдиницаВалюты = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "ДенИзм");
						
						Если ЗначениеЗаполнено(ЕдиницаВалюты) Тогда
							
							Валюта = СправочникВалюты.Найти(ЕдиницаВалюты.КодОКВ, "КодISO");
							
							Если ЗначениеЗаполнено(Валюта) Тогда
								Валюта = Валюта.Ссылка;
							Иначе
								
								Попытка
									Валюта = Справочники.Валюты.НайтиПоКоду("643");
								Исключение 
								КонецПопытки;
								
							КонецЕсли;
							
						КонецЕсли;
						
					Иначе
						Валюта = СправочникВалюты.Найти(ЕдиницаВалюты, "КодISO");
					КонецЕсли;
					//-Марков И. 26.03.2025 #UT10-5160
					
					Если ДанныеШапки.Свойство("ДопСвФХЖ1") Тогда
						
						ИдентификаторГосКонтракта = КНП_БезопасноПрочитатьЗначение(ДанныеШапки.ДопСвФХЖ1, "ИдГосКон");
						
						Если ИдентификаторГосКонтракта = Неопределено Тогда
							ИдентификаторГосКонтракта = "--";
						КонецЕсли;
						
					КонецЕсли;
					
					Если ДанныеДокумента.Свойство("СвПродПер") И ДанныеДокумента.СвПродПер.Свойство("СвПер") Тогда
						
						ДанныеПодвала = ДанныеДокумента.СвПродПер.СвПер;
						
						Если ДанныеПодвала.Свойство("ОснПер") Тогда
							
							ДоговорОснование = КНП_БезопасноПрочитатьЗначение(ДанныеПодвала.ОснПер, "НаимОсн");
							НомерОснования = СтрЗаменить(КНП_БезопасноПрочитатьЗначение(ДанныеПодвала.ОснПер, "НомОсн"), "0.00", "");
							ДатаОснования = КНП_БезопасноПрочитатьЗначение(ДанныеПодвала.ОснПер, "ДатаОсн");
							
							Если ЗначениеЗаполнено(НомерОснования) И НомерОснования <> "-" Тогда
								
								Если НЕ Найти(ДоговорОснование, НомерОснования) Тогда 
									ДоговорОснование = ДоговорОснование + " № " + НомерОснования;
								КонецЕсли;
								
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ДатаОснования) Тогда
								
								Попытка
									
									Если КНП_ПривестиКДате(ДатаОснования) > Дата(2000,1,1) Тогда
										
										Если НЕ Найти(ДоговорОснование, "от " + ДатаОснования) Тогда
											ДоговорОснование = ДоговорОснование + " от " + ДатаОснования;
										КонецЕсли;
										
									КонецЕсли;
									
								Исключение
									ДобавитьВЖурнал(ОписаниеОшибки() + ". Доп.данные: ДатаОснования=""" + ДатаОснования + """", "ПФ_РазобратьXMLДляПечатнойФормы");
								КонецПопытки;
								
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Валюта) Тогда
						Валюта 					= Валюта.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
				Если НЕ ЭтоУПД И НЕ ЭтоКорректировка Тогда
					СодФХЖ1 = КНП_БезопасноПрочитатьЗначение(ДанныеШапки, "СодФХЖ1");
				Иначе
					СодФХЖ1 = ДанныеШапки;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СодФХЖ1) Тогда
					
					СтруктураИнфоПолей = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "ИнфПолФХЖ1");
					
					Если ЗначениеЗаполнено(СтруктураИнфоПолей) Тогда
						ИнфоПоля = ПФ_РазобратьИзСтруктурыИнфоПоля(СтруктураИнфоПолей);
					КонецЕсли;
					
					ГрузОтпр = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "ГрузОтпр");
					
					Если СодФХЖ1.Свойство("ГрузОт") Тогда
						
						Если СодФХЖ1.ГрузОт.Свойство("ГрузОтпр") Тогда
							ГрузОтпр = СодФХЖ1.ГрузОт.ГрузОтпр;
						ИначеЕсли СодФХЖ1.ГрузОт.Свойство("ОнЖе") Тогда
							
							ИмяГрузоотправителя = "Он же";
							АдресГрузоотправителя = "";
							ОнЖе = Истина;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ГрузОтпр) Тогда
						
						ИмяГрузоотправителя 	= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(ГрузОтпр);
						АдресГрузоотправителя 	= ", " + ПФ_РазобратьИзСтруктурыАдресОрганизации(ГрузОтпр);
						БИКБанкаГрузоотправителя= ПФ_РазобратьИзСтруктурыБИКБанка(ГрузОтпр);
						БанкГрузоотправителя 	= ПФ_РазобратьИзСтруктурыНаименованиеБанка(ГрузОтпр);
						СчетГрузоотправителя 	= ПФ_РазобратьИзСтруктурыСчетОрганизации(ГрузОтпр);
						
					ИначеЕсли НЕ ОнЖе Тогда
						
						ИмяГрузоотправителя = "-";
						АдресГрузоотправителя = "-";
						
					КонецЕсли;
					
					ГрузПолуч = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "ГрузПолуч");
					
					Если ЗначениеЗаполнено(ГрузПолуч) Тогда
						
						ИмяГрузополучателя 		= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(ГрузПолуч);
						АдресГрузополучателя 	= ", " + ПФ_РазобратьИзСтруктурыАдресОрганизации(ГрузПолуч);
						БИКБанкаГрузополучателя = ПФ_РазобратьИзСтруктурыБИКБанка(ГрузПолуч);
						БанкГрузополучателя 	= ПФ_РазобратьИзСтруктурыНаименованиеБанка(ГрузПолуч);
						СчетГрузополучателя 	= ПФ_РазобратьИзСтруктурыСчетОрганизации(ГрузПолуч);	
						
					Иначе
						
						ИмяГрузополучателя = "-";
						АдресГрузополучателя = "-";
						
					КонецЕсли;
					
					Продавец = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "Продавец");
					
					Если ЗначениеЗаполнено(Продавец) Тогда
						
						ИмяОрганизации 			= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(Продавец);
						АдресОрганизации 		= ПФ_РазобратьИзСтруктурыАдресОрганизации(Продавец);
						БИКБанкаОрганизации 	= ПФ_РазобратьИзСтруктурыБИКБанка(Продавец);
						БанкОрганизации 		= ПФ_РазобратьИзСтруктурыНаименованиеБанка(Продавец);
						СчетОрганизации 		= ПФ_РазобратьИзСтруктурыСчетОрганизации(Продавец);	
						
					КонецЕсли;
					
					Покупатель = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "Покупатель");
					
					Если ЗначениеЗаполнено(Покупатель) Тогда
						
						ИмяКонтрагента 			= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(Покупатель);
						АдресКонтрагента 		= ПФ_РазобратьИзСтруктурыАдресОрганизации(Покупатель);
						БИКБанкаКонтрагента 	= ПФ_РазобратьИзСтруктурыБИКБанка(Покупатель);
						БанкКонтрагента 		= ПФ_РазобратьИзСтруктурыНаименованиеБанка(Покупатель);
						СчетКонтрагента 		= ПФ_РазобратьИзСтруктурыСчетОрганизации(Покупатель);	
						
					КонецЕсли;
					
					Исполнитель = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "Исполнитель");
					
					Если СодФХЖ1.Свойство("СвПрод") Тогда
						Исполнитель = СодФХЖ1.СвПрод;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Исполнитель) Тогда
						
						ИмяОрганизации 			= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(Исполнитель);
						АдресОрганизации 		= ПФ_РазобратьИзСтруктурыАдресОрганизации(Исполнитель);
						БИКБанкаОрганизации 	= ПФ_РазобратьИзСтруктурыБИКБанка(Исполнитель);
						БанкОрганизации 		= ПФ_РазобратьИзСтруктурыНаименованиеБанка(Исполнитель);
						СчетОрганизации 		= ПФ_РазобратьИзСтруктурыСчетОрганизации(Исполнитель);
						ИННОрганизации 			= ПФ_РазобратьИзСтруктурыИННОрганизации(Исполнитель);
						КППОрганизации			= ПФ_РазобратьИзСтруктурыКППОрганизации(Исполнитель);
						
					КонецЕсли;
					
					Заказчик = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "Заказчик");
					
					Если СодФХЖ1.Свойство("СвПокуп") Тогда
						Заказчик = СодФХЖ1.СвПокуп;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Заказчик) Тогда
						
						ИмяКонтрагента 			= ПФ_РазобратьИзСтруктурыПредставлениеОрганизации(Заказчик);
						АдресКонтрагента 		= ПФ_РазобратьИзСтруктурыАдресОрганизации(Заказчик);
						БИКБанкаКонтрагента 	= ПФ_РазобратьИзСтруктурыБИКБанка(Заказчик);
						БанкКонтрагента 		= ПФ_РазобратьИзСтруктурыНаименованиеБанка(Заказчик);
						СчетКонтрагента 		= ПФ_РазобратьИзСтруктурыСчетОрганизации(Заказчик);
						ИННКонтрагента 			= ПФ_РазобратьИзСтруктурыИННОрганизации(Заказчик);
						КППКонтрагента			= ПФ_РазобратьИзСтруктурыКППОрганизации(Заказчик);
						
						Если ЗначениеЗаполнено(ГрузПолуч) Тогда
							
							Если ГрузПолуч.ИдСв.Свойство("СвЮЛУч") И ЗначениеЗаполнено(ГрузПолуч.ИдСв.СвЮЛУч.КПП) Тогда
								КППКонтрагента = ГрузПолуч.ИдСв.СвЮЛУч.КПП;
							КонецЕсли;	
							
						КонецЕсли;	
						
					КонецЕсли;
					
					Если ЭтоКорректировка Тогда
						
						ДанныеПоСФ = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "СчФ");
						
						Если ЗначениеЗаполнено(ДанныеПоСФ) Тогда
							
							НомерОснованияКорректировки = КНП_БезопасноПрочитатьЗначение(ДанныеПоСФ, "НомерСчФ");
							ДатаОснованияКорректировки = КНП_БезопасноПрочитатьЗначение(ДанныеПоСФ, "ДатаСчФ");
							
						КонецЕсли;
						
					КонецЕсли;
					
					Основание = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "Основание");
					
					Если ЗначениеЗаполнено(Основание) Тогда
						ДоговорОснование 		= КНП_БезопасноПрочитатьЗначение(Основание, "НаимОсн");	
					КонецЕсли;
					
					ДанныеУслуг = КНП_БезопасноПрочитатьЗначение(СодФХЖ1, "ОписРабот");
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СодФХЖ3 = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента, "СодФХЖ3");
		
		Если ЗначениеЗаполнено(СодФХЖ3) Тогда
			
			ОснованиеКорректировки = КНП_БезопасноПрочитатьЗначение(СодФХЖ3, "ОснКор");
			
			Если ЗначениеЗаполнено(ОснованиеКорректировки) Тогда
				ДоговорОснование = КНП_БезопасноПрочитатьЗначение(ОснованиеКорректировки, "НаимОсн");
			КонецЕсли;
			
			КоличествоЗаписей = КНП_БезопасноПрочитатьЗначение(СодФХЖ3, "КолПрил");
			
			Если КоличествоЗаписей <> Неопределено И КНП_ЭтоЧисло(КоличествоЗаписей) Тогда
				КоличествоЗаписей = Число(КоличествоЗаписей);
			Иначе
				КоличествоЗаписей = 1;
			КонецЕсли;
			
			ДатаОтпускаГруза = КНП_БезопасноПрочитатьЗначение(СодФХЖ3, "ДатаОтпуск");
			СвЛицОтпГруз = КНП_БезопасноПрочитатьЗначение(СодФХЖ3, "СвЛицОтпГруз");
			
			Если ЗначениеЗаполнено(СвЛицОтпГруз) Тогда
				
				РабОргПрод = КНП_БезопасноПрочитатьЗначение(СвЛицОтпГруз, "РабОргПрод");
				
				Если ЗначениеЗаполнено(РабОргПрод) Тогда
					
					ДолжностьОтпустившегоГруз = КНП_БезопасноПрочитатьЗначение(РабОргПрод, "Должность");
					
					Если НЕ ЗначениеЗаполнено(ДолжностьОтпустившегоГруз) И ЗначениеЗаполнено(ДолжностьПодписанта) Тогда
						ДолжностьОтпустившегоГруз = ДолжностьПодписанта;
					КонецЕсли;
					
					ПодписантФИО = КНП_БезопасноПрочитатьЗначение(РабОргПрод, "ФИО");
					
					Если ЗначениеЗаполнено(ПодписантФИО) Тогда
						
						ФИООтпустившегоГруз = "";
						
						Если ПодписантФИО.Свойство("Фамилия") Тогда
							ФИООтпустившегоГруз = ПодписантФИО.Фамилия + " ";
						КонецЕсли;
						
						Если ПодписантФИО.Свойство("Имя") Тогда
							ФИООтпустившегоГруз = ФИОПодписанта + ПодписантФИО.Имя + " ";
						КонецЕсли;
						
						Если ПодписантФИО.Свойство("Отчество") Тогда
							ФИООтпустившегоГруз = ФИОПодписанта + ПодписантФИО.Отчество;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ДанныеДокумента.Свойство("СвПродПер") Тогда
			
			СвПер = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.СвПродПер, "СвПер");
			
			Если ЗначениеЗаполнено(СвПер) Тогда
				
				ДатаОтгрузкиПередачи = КНП_БезопасноПрочитатьЗначение(СвПер, "ДатаПер");
				
				Если ДатаОтгрузкиПередачи = Неопределено И ДокПодтвОтгр <> Неопределено Тогда
					ДатаОтгрузкиПередачи = КНП_БезопасноПрочитатьЗначение(ДокПодтвОтгр, "ДатаДокОтгр");	
				КонецЕсли;      
				
				СвЛицПер = КНП_БезопасноПрочитатьЗначение(СвПер, "СвЛицПер");
				
				Если ЗначениеЗаполнено(СвЛицПер) Тогда
					
					РабОргПрод = КНП_БезопасноПрочитатьЗначение(СвЛицПер, "РабОргПрод");
					
					Если ЗначениеЗаполнено(РабОргПрод) Тогда
						
						ДолжностьОтпустившегоГруз = КНП_БезопасноПрочитатьЗначение(РабОргПрод, "Должность");
						
						Если НЕ ЗначениеЗаполнено(ДолжностьОтпустившегоГруз) И ЗначениеЗаполнено(ДолжностьПодписанта) Тогда
							ДолжностьОтпустившегоГруз = ДолжностьПодписанта;
						КонецЕсли;
						
						ПодписантФИО = КНП_БезопасноПрочитатьЗначение(РабОргПрод, "ФИО");
						
						Если ЗначениеЗаполнено(ПодписантФИО) Тогда
							
							ФИООтпустившегоГруз = "";
							
							Если ПодписантФИО.Свойство("Фамилия") Тогда
								ФИООтпустившегоГруз = ПодписантФИО.Фамилия + " ";
							КонецЕсли;
							
							Если ПодписантФИО.Свойство("Имя") Тогда
								ФИООтпустившегоГруз = ФИООтпустившегоГруз + ПодписантФИО.Имя + " ";
							КонецЕсли;
							
							Если ПодписантФИО.Свойство("Отчество") Тогда
								ФИООтпустившегоГруз = ФИООтпустившегоГруз + ПодписантФИО.Отчество;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;	
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НомерСтроки = 1;
		
		Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
			
			///////////////////////////////////////////////////////////////////
			//////////////////////	ТЧ Товары	///////////////////////////////
			СвТов = КНП_БезопасноПрочитатьЗначение(ДанныеТоваров, "СвТов");
			
			Если НЕ ЗначениеЗаполнено(СвТов) Тогда
				СвТов = КНП_БезопасноПрочитатьЗначение(ДанныеТоваров, "СведТов");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СвТов) Тогда
				СвТов = КНП_БезопасноПрочитатьЗначение(ДанныеТоваров, "Good");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СвТов) Тогда
				
				Товары = XML_ПолучитьМассивИзСтруктуры(СвТов);
				МетаданныеТЧ = СтруктураДокумента.ТабличнаяЧасть.Колонки;
				
				Для Каждого Товар Из Товары Цикл
					
					СтрТабЧасти = СтруктураДокумента.ТабличнаяЧасть.Добавить();
					СтрТабЧасти.НомерСтроки = ?(ТипЗнч(СвТов)=Тип("Массив"), НомерСтроки,СвТов.НомСтр);
					НомерСтроки = НомерСтроки + 1;
					СтрТабЧасти.Товар 						= КНП_БезопасноПрочитатьЗначение(Товар, ?(ЭтоСчет, "name", "НаимТов") );
					СтрТабЧасти.ЕдиницаИзмерения 			= КНП_БезопасноПрочитатьЗначение(Товар, "НаимЕдИзм");
					
					Если Товар.Свойство("ДопСведТов") И Товар.ДопСведТов.Свойство("НаимЕдИзм") Тогда
						СтрТабЧасти.ЕдиницаИзмерения 		= Товар.ДопСведТов.НаимЕдИзм;
					КонецЕсли;
					
					Если Товар.Свойство("ДопСведТов") И ТипЗнч(Товар.ДопСведТов) = Тип("Структура") И Товар.ДопСведТов.Свойство("КодТов") Тогда
						СтрТабЧасти.ТоварКод = Товар.ДопСведТов.КодТов;	
						
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(СтрТабЧасти.ЕдиницаИзмерения) И ЭтоСчет Тогда
						
						СтрЕИ = СправочникЕдиницыИзмерения.Найти(КНП_БезопасноПрочитатьЗначение(Товар, "measurement"), "КодОКЕИ");
						
						Если ЗначениеЗаполнено(СтрЕИ) Тогда
							СтрТабЧасти.ЕдиницаИзмерения 	= СтрЕИ.СокрНазвание;
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("ЕдиницаИзмеренияКод") <> Неопределено Тогда
						
						СтрТабЧасти.ЕдиницаИзмеренияКод = КНП_БезопасноПрочитатьЗначение(Товар,"ОКЕИ_Тов");
						
						//Специально для ТЭК-ТОРГ
						Если СтрТабЧасти.ЕдиницаИзмеренияКод = "0000" Тогда
							
							СтрТабЧасти.ЕдиницаИзмеренияКод = "--";
							СтрТабЧасти.ЕдиницаИзмерения = "--";
							
						КонецЕсли;
						
						//Специально для ТЭК-ТОРГ
						Если СтрТабЧасти.Товар = "Предварительная оплата" Тогда   //Специально для СФ на аванс
							
							СтрТабЧасти.ЕдиницаИзмеренияКод = "--";
							СтрТабЧасти.ЕдиницаИзмерения = "--";
							
						КонецЕсли; 
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("КодВидаТовара") <> Неопределено Тогда
						СтрТабЧасти.КодВидаТовара = "--";	
					КонецЕсли;
					
					Если ЭтоКорректировка Тогда
						
						СтрТабЧасти.ЕдиницаИзмеренияКод 	= КНП_БезопасноПрочитатьЗначение(Товар, "ОКЕИ_ТовПосле");
						СтрЕИ = СправочникЕдиницыИзмерения.Найти(СтрТабЧасти.ЕдиницаИзмеренияКод, "КодОКЕИ");
						
						Если СтрЕИ <> Неопределено Тогда
							СтрТабЧасти.ЕдиницаИзмерения 	= СтрЕИ.СокрНазвание;
						КонецЕсли;
						
						СтрТабЧасти.ЕдиницаИзмеренияКодДо	= КНП_БезопасноПрочитатьЗначение(Товар, "ОКЕИ_ТовДо");
						
						Если МетаданныеТЧ.Найти("ЕдиницаИзмеренияДо") <> Неопределено Тогда
							
							СтрЕИ = СправочникЕдиницыИзмерения.Найти(СтрТабЧасти.ЕдиницаИзмеренияКодДо, "КодОКЕИ");
							
							Если СтрЕИ <> Неопределено Тогда
								СтрТабЧасти.ЕдиницаИзмеренияДо = СтрЕИ.СокрНазвание;
							КонецЕсли;
							
							//Специально для ТЭК-ТОРГ
							Если СтрТабЧасти.ЕдиницаИзмеренияКодДо = "0000" Тогда
								
								СтрТабЧасти.ЕдиницаИзмеренияКодДо = "--";
								СтрТабЧасти.ЕдиницаИзмеренияДо = "--";
								
							КонецЕсли;
							//Специально для ТЭК-ТОРГ
							
						КонецЕсли;
						
						СтрТабЧасти.Количество 		 		= КНП_БезопасноПрочитатьЗначение(Товар, "КолТовПосле");
						СтрТабЧасти.КоличествоДоИзменения	= КНП_БезопасноПрочитатьЗначение(Товар, "КолТовДо");
						СтрТабЧасти.Цена 					= КНП_БезопасноПрочитатьЗначение(Товар, "ЦенаТовПосле");
						СтрТабЧасти.ЦенаДоИзменения 		= КНП_БезопасноПрочитатьЗначение(Товар, "ЦенаТовДо");
						
						Если СтрТабЧасти.Количество <> Неопределено И СтрТабЧасти.Цена <> Неопределено Тогда
							СтрТабЧасти.Сумма 					= КНП_ФорматСумм(Число(СтрТабЧасти.Количество * СтрТабЧасти.Цена) );
						ИначеЕсли Товар.Свойство("СтТовБезНДС") Тогда
							СтрТабЧасти.Сумма = Товар.СтТовБезНДС.СтоимПослеИзм;
						КонецЕсли;
						
						Если СтрТабЧасти.КоличествоДоИзменения <> Неопределено И СтрТабЧасти.ЦенаДоИзменения <> Неопределено Тогда
							СтрТабЧасти.СуммаДоИзменения 		= КНП_ФорматСумм(Число(СтрТабЧасти.КоличествоДоИзменения * СтрТабЧасти.ЦенаДоИзменения) );
						ИначеЕсли Товар.Свойство("СтТовБезНДС") Тогда
							СтрТабЧасти.СуммаДоИзменения = Товар.СтТовБезНДС.СтоимДоИзм;
						КонецЕсли;
						
						СтрТабЧасти.НДС			 			= КНП_ФорматСумм(Число(Товар.СумНалПосле.СумНДС.Значение) );
						СтрТабЧасти.НДСДоИзменения			= КНП_ФорматСумм(Число(Товар.СумНалДо.СумНДС.Значение) );
						СтрТабЧасти.СуммаСНДС 				= КНП_ФорматСумм(Число(Товар.СтТовУчНал.СтоимПослеИзм) );
						СтрТабЧасти.СуммаСНДСДоИзменения	= КНП_ФорматСумм(Число(Товар.СтТовУчНал.СтоимДоИзм) );
						РазностьВСумме 				= КНП_ПолучитьРазностьЧисел(СтрТабЧасти.Сумма, СтрТабЧасти.СуммаДоИзменения);
						РазностьВСуммеНДС 			= КНП_ПолучитьРазностьЧисел(СтрТабЧасти.НДС, СтрТабЧасти.НДСДоИзменения);
						РазностьВСуммеСНДС 			= КНП_ПолучитьРазностьЧисел(СтрТабЧасти.СуммаСНДС, СтрТабЧасти.СуммаСНДСДоИзменения);
						СтрТабЧасти.РазницаУвеличение 		= ?(РазностьВСумме > 0, РазностьВСумме, 0); 
						СтрТабЧасти.РазницаУменьшение 		= ?(РазностьВСумме < 0, -РазностьВСумме, 0);
						СтрТабЧасти.РазницаНДСУвеличение 	= ?(РазностьВСуммеНДС > 0, РазностьВСуммеНДС, 0);
						СтрТабЧасти.РазницаНДСУменьшение 	= ?(РазностьВСуммеНДС < 0, -РазностьВСуммеНДС, 0);
						СтрТабЧасти.РазницаСНДСУвеличение 	= ?(РазностьВСуммеСНДС > 0, РазностьВСуммеСНДС, 0);
						СтрТабЧасти.РазницаСНДСУменьшение 	= ?(РазностьВСуммеСНДС < 0, -РазностьВСуммеСНДС, 0);
						СтрТабЧасти.СтавкаНДСДоИзменения 	= КНП_БезопасноПрочитатьЗначение(Товар, "НалСтДо");
						СтрТабЧасти.СтавкаНДС				= КНП_БезопасноПрочитатьЗначение(Товар, "НалСтПосле");
						
						СтрТабЧасти.Количество 				= ?(СтрТабЧасти.Количество = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество), "--", СтрТабЧасти.Количество);
						СтрТабЧасти.КоличествоДоИзменения 	= ?(СтрТабЧасти.КоличествоДоИзменения = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.КоличествоДоИзменения), "--", СтрТабЧасти.КоличествоДоИзменения);
						СтрТабЧасти.Цена 					= ?(СтрТабЧасти.Цена = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Цена), "--", СтрТабЧасти.Цена);
						СтрТабЧасти.ЦенаДоИзменения 		= ?(СтрТабЧасти.ЦенаДоИзменения = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.ЦенаДоИзменения), "--", СтрТабЧасти.ЦенаДоИзменения);
						
						
						
						Если МетаданныеТЧ.Найти("Акциз") <> Неопределено Тогда
							
							СтрТабЧасти.Акциз 				= КНП_БезопасноПрочитатьЗначение(Товар, "АкцизПосле");	
							
							Если ТипЗнч(СтрТабЧасти.Акциз) = Тип("Структура") Тогда
								
								Если Товар.АкцизПосле.Свойство("СумАкциз") Тогда
									СтрТабЧасти.Акциз 		= Товар.АкцизПосле.СумАкциз.Значение;
								ИначеЕсли Товар.АкцизПосле.Свойство("БезАкциз") Тогда
									СтрТабЧасти.Акциз		= "без акциза";
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("АкцизДоИзменения") <> Неопределено Тогда
							
							СтрТабЧасти.АкцизДоИзменения 			= КНП_БезопасноПрочитатьЗначение(Товар, "АкцизДо");	
							
							Если ТипЗнч(СтрТабЧасти.АкцизДоИзменения) = Тип("Структура") Тогда
								
								Если Товар.АкцизДо.Свойство("СумАкциз") Тогда
									СтрТабЧасти.АкцизДоИзменения 	= Товар.АкцизДо.СумАкциз.Значение;
								ИначеЕсли Товар.АкцизДо.Свойство("БезАкциз") Тогда
									СтрТабЧасти.АкцизДоИзменения 	= "без акциза";
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						РазностьВАкцизе				= КНП_ПолучитьРазностьЧисел(СтрТабЧасти.Акциз, СтрТабЧасти.АкцизДоИзменения);
						СтрТабЧасти.РазницаАкцизУвеличение = ?(РазностьВАкцизе > 0, РазностьВАкцизе, 0);
						СтрТабЧасти.РазницаАкцизУменьшение = ?(РазностьВАкцизе < 0, -РазностьВАкцизе, 0);
						
						РазницаУвеличение 		= РазницаУвеличение 		+ СтрТабЧасти.РазницаУвеличение;
						РазницаУменьшение 		= РазницаУменьшение 		+ СтрТабЧасти.РазницаУменьшение;
						РазницаНДСУвеличение 	= РазницаНДСУвеличение 		+ СтрТабЧасти.РазницаНДСУвеличение;
						РазницаНДСУменьшение 	= РазницаНДСУменьшение 		+ СтрТабЧасти.РазницаНДСУменьшение;
						РазницаСНДСУвеличение 	= РазницаСНДСУвеличение 	+ СтрТабЧасти.РазницаСНДСУвеличение;
						РазницаСНДСУменьшение 	= РазницаСНДСУменьшение 	+ СтрТабЧасти.РазницаСНДСУменьшение;
						РазницаАкцизУвеличение 	= РазницаАкцизУвеличение 	+ СтрТабЧасти.РазницаАкцизУвеличение;
						РазницаАкцизУменьшение 	= РазницаАкцизУменьшение 	+ СтрТабЧасти.РазницаАкцизУменьшение;
						
					Иначе
						
						СтрТабЧасти.Количество 				= КНП_БезопасноПрочитатьЗначение(Товар, "НеттоПередано");
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество) Тогда
							СтрТабЧасти.Количество 			= КНП_БезопасноПрочитатьЗначение(Товар, "Количество");
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество) Тогда
							СтрТабЧасти.Количество 			= КНП_БезопасноПрочитатьЗначение(Товар, "КолТов");
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество) Тогда
							СтрТабЧасти.Количество 			= КНП_БезопасноПрочитатьЗначение(Товар, "count");
						КонецЕсли;
						
						СтрТабЧасти.Количество 				= ?(СтрТабЧасти.Количество = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество), "--", СтрТабЧасти.Количество);
						
						Если МетаданныеТЧ.Найти("МассаБрутто") <> Неопределено Тогда
							
							СтрТабЧасти.МассаБрутто 		= КНП_БезопасноПрочитатьЗначение(Товар, "Брутто");
							
							Если НЕ ЗначениеЗаполнено(СтрТабЧасти.МассаБрутто) Тогда
								СтрТабЧасти.МассаБрутто = 0;
							КонецЕсли;
							
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("Упаковка") <> Неопределено Тогда
							СтрТабЧасти.Упаковка = КНП_БезопасноПрочитатьЗначение(Товар, "ВидУпак");
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("КоличествоВМесте") <> Неопределено Тогда
							
							СтрТабЧасти.КоличествоВМесте = КНП_БезопасноПрочитатьЗначение(Товар, "Место");
							
							Если НЕ ЗначениеЗаполнено(СтрТабЧасти.КоличествоВМесте) Тогда
								СтрТабЧасти.КоличествоВМесте = 0;
							КонецЕсли;
							
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("КоличествоМест") <> Неопределено Тогда
							
							СтрТабЧасти.КоличествоМест = КНП_БезопасноПрочитатьЗначение(Товар, "КолМест");
							
							Если НЕ ЗначениеЗаполнено(СтрТабЧасти.КоличествоМест) Тогда
								СтрТабЧасти.КоличествоМест = 0;
							КонецЕсли;
							
						КонецЕсли;
						
						СтрТабЧасти.Цена 					= КНП_БезопасноПрочитатьЗначение(Товар, "Цена");
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Цена) Тогда
							СтрТабЧасти.Цена				= КНП_БезопасноПрочитатьЗначение(Товар, "ЦенаТов");
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Цена) Тогда
							СтрТабЧасти.Цена 				= КНП_БезопасноПрочитатьЗначение(Товар, "price");
						КонецЕсли;
						
						СтрТабЧасти.Цена 					= ?(СтрТабЧасти.Цена = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Цена), "--", СтрТабЧасти.Цена);
						
						СтрТабЧасти.Сумма 					= КНП_БезопасноПрочитатьЗначение(Товар, "СтБезНДС");
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Сумма) Тогда
							СтрТабЧасти.Сумма				= КНП_БезопасноПрочитатьЗначение(Товар, "СтТовБезНДС");
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Сумма) Тогда
							
							СтрТабЧасти.Сумма				= КНП_БезопасноПрочитатьЗначение(Товар, "costBeforeTax");
							СуммаИтого = СуммаИтого + ?(ЗначениеЗаполнено(СтрТабЧасти.Сумма), СтрТабЧасти.Сумма, 0);
							
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("НДС") <> Неопределено Тогда
							
							СтрТабЧасти.НДС 				= КНП_БезопасноПрочитатьЗначение(Товар, "СумНДС");
							
							Если Товар.Свойство("СумНал") Тогда
								
								Если Товар.СумНал.СумНал.Свойство("Значение") Тогда 
									СтрТабЧасти.НДС = Товар.СумНал.СумНал.Значение;
								ИначеЕсли Товар.СумНал.Свойство("БезНДС") Тогда
									СтрТабЧасти.НДС = 0;
								КонецЕсли;
								
							КонецЕсли;
							
						КонецЕсли;
						
						Если Товар.Свойство("amountOfTax") И ЗначениеЗаполнено(Товар.amountOfTax) Тогда
							СуммаНДС = СуммаНДС + Число(Товар.amountOfTax);
						КонецЕсли;
						
						Если Товар.Свойство("costAfterTax") И ЗначениеЗаполнено(Товар.costAfterTax) Тогда
							
							СуммаСНДСИтого = СуммаСНДСИтого + Число(Товар.costAfterTax);
							
							Если ЗначениеЗаполнено(СтрТабЧасти.Количество) Тогда
								
								Попытка
									СтрТабЧасти.Сумма = Число(СтрТабЧасти.Количество) * Число(СтрТабЧасти.Цена);
								Исключение
									СтрТабЧасти.Сумма = СтрТабЧасти.Цена;
								КонецПопытки;
								
							Иначе
								СтрТабЧасти.Сумма = СтрТабЧасти.Цена;	
							КонецЕсли;
							
						КонецЕсли;
						
						
						Если МетаданныеТЧ.Найти("СуммаСНДС") <> Неопределено Тогда
							
							СтрТабЧасти.СуммаСНДС 			= КНП_БезопасноПрочитатьЗначение(Товар, "СтУчНДС");
							
							Если НЕ ЗначениеЗаполнено(СтрТабЧасти.СуммаСНДС) Тогда
								СтрТабЧасти.СуммаСНДС		= КНП_БезопасноПрочитатьЗначение(Товар, "СтТовУчНал");
							КонецЕсли;
							
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("СтавкаНДС") <> Неопределено Тогда
							СтрТабЧасти.СтавкаНДС 			= КНП_БезопасноПрочитатьЗначение(Товар, "НалСт");
						КонецЕсли;
						
						Если МетаданныеТЧ.Найти("Акциз") <> Неопределено Тогда
							
							СтрТабЧасти.Акциз 				= КНП_БезопасноПрочитатьЗначение(Товар, "Акциз");	
							
							Если ТипЗнч(СтрТабЧасти.Акциз) = Тип("Структура") Тогда
								
								Если Товар.Акциз.Свойство("СумАкциз") Тогда
									СтрТабЧасти.Акциз 			= Товар.Акциз.СумАкциз.Значение;
								ИначеЕсли Товар.Акциз.Свойство("БезАкциз") Тогда
									СтрТабЧасти.Акциз		= "без акциза";
								КонецЕсли;
								
							КонецЕсли;
							
							Если СтрТабЧасти.Сумма = Неопределено Тогда   //Специально для СФ на аванс
								
								СтрТабЧасти.Акциз = "--";
								СтрТабЧасти.Сумма = "--";
								
							КонецЕсли;
							
						КонецЕсли;
						
						СтавкаНДС 							= КНП_БезопасноПрочитатьЗначение(Товар, "НалСт");
						
						Если НЕ ЗначениеЗаполнено(СтавкаНДС) Тогда
							СтавкаНДС						= МОП_ПолучитьСтавкуНДСИзСтроки(КНП_БезопасноПрочитатьЗначение(Товар, "taxRate") );
						КонецЕсли; 
						
						//Доп поля
						ДопСведТов = КНП_БезопасноПрочитатьЗначение(Товар, "ДопСведТов");
						
						Если ЗначениеЗаполнено(ДопСведТов) Тогда
							
							Если МетаданныеТЧ.Найти("ПредставлениеСтраны") <> Неопределено Тогда
								СтрТабЧасти.ПредставлениеСтраны = КНП_БезопасноПрочитатьЗначение(ДопСведТов, "КрНаимСтрПр");	
							КонецЕсли;
							
							Если МетаданныеТЧ.Найти("ТоварКод") <> Неопределено Тогда
								СтрТабЧасти.ТоварКод = КНП_БезопасноПрочитатьЗначение(ДопСведТов, "КодТов");	
							КонецЕсли;
							
						КонецЕсли;
						
						СвТД = КНП_БезопасноПрочитатьЗначение(Товар, "СвТД");
						
						Если ЗначениеЗаполнено(ДопСведТов) Тогда
							
							Если МетаданныеТЧ.Найти("СтранаПроисхожденияКод") <> Неопределено Тогда
								СтрТабЧасти.СтранаПроисхожденияКод = КНП_БезопасноПрочитатьЗначение(СвТД, "КодПроисх");	
							КонецЕсли;
							
							Если МетаданныеТЧ.Найти("ПредставлениеГТД") <> Неопределено Тогда
								СтрТабЧасти.ПредставлениеГТД = КНП_БезопасноПрочитатьЗначение(СвТД, "НомерТД");	
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					
					
					Если МетаданныеТЧ.Найти("Товар") <> Неопределено Тогда
						СтрТабЧасти.Наименование = СтрТабЧасти.Товар;
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("Описание") <> Неопределено Тогда
						
						СтрТабЧасти.Содержание = СтрТабЧасти.Описание;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.Описание) Тогда 
							СтрТабЧасти.Описание = "-" 
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СуммаНДС") <> Неопределено Тогда
						СтрТабЧасти.СуммаНДС = СтрТабЧасти.НДС;
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СуммаНДСДоИзменения") <> Неопределено Тогда
						СтрТабЧасти.СуммаНДСДоИзменения = СтрТабЧасти.НДСДоИзменения;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрТабЧасти.Количество) Тогда
						
						Если НЕ СтрТабЧасти.Количество = "-" И НЕ СтрТабЧасти.Количество = "--" Тогда
							КоличествоИтого = КоличествоИтого + Число(СтрТабЧасти.Количество);
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("МассаБрутто") <> Неопределено Тогда
						МассаБруттоИтого = МассаБруттоИтого + Число(СтрТабЧасти.МассаБрутто);
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("КоличествоМест") <> Неопределено Тогда
						КоличествоМестИтого = КоличествоМестИтого + Число(СтрТабЧасти.КоличествоМест);
					КонецЕсли;
					
					СтруктураИнфоПолей = КНП_БезопасноПрочитатьЗначение(Товар, "ИнфПолФХЖ2");
					
					Если ЗначениеЗаполнено(СтруктураИнфоПолей) Тогда
						
						ИнфоПоляТовара = ПФ_РазобратьИзСтруктурыИнфоПоля(СтруктураИнфоПолей);							
						
						Если МетаданныеТЧ.Найти("ИнфоПоля") <> Неопределено Тогда
							СтрТабЧасти.ИнфоПоля = ИнфоПоляТовара;
						КонецЕсли;
						
					КонецЕсли;
					
					
					//Финальная замена
					Если СтрТабЧасти.Сумма = 0 ИЛИ СтрТабЧасти.Сумма = "0.00" Тогда
						СтрТабЧасти.Сумма = "--";
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("НДС") <> Неопределено Тогда
						
						Если СтрТабЧасти.НДС = 0 ИЛИ СтрТабЧасти.НДС = "0.00" Тогда
							
							Если НРег(СтрТабЧасти.СтавкаНДС) = "без ндс" Тогда
								СтрТабЧасти.НДС = СтрТабЧасти.СтавкаНДС;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("НДСДоИзменения") <> Неопределено Тогда
						
						Если СтрТабЧасти.НДСДоИзменения = 0 ИЛИ СтрТабЧасти.НДСДоИзменения = "0.00" Тогда
							
							Если НРег(СтрТабЧасти.СтавкаНДСДоИзменения) = "без ндс" Тогда
								СтрТабЧасти.НДСДоИзменения = СтрТабЧасти.СтавкаНДСДоИзменения;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СтранаПроисхожденияКод") <> Неопределено Тогда
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.СтранаПроисхожденияКод) Тогда
							СтрТабЧасти.СтранаПроисхожденияКод = "--";
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.ПредставлениеСтраны) Тогда
							СтрТабЧасти.ПредставлениеСтраны = "--";
						КонецЕсли;
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.ПредставлениеГТД) Тогда
							СтрТабЧасти.ПредставлениеГТД = "--";
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Всего = КНП_БезопасноПрочитатьЗначение(ДанныеТоваров, "Всего");
			
			Если ЗначениеЗаполнено(Всего) Тогда
				
				СуммаИтого 		= КНП_БезопасноПрочитатьЗначение(Всего, "СтБезНДСВс"); 
				СуммаНДС 		= КНП_БезопасноПрочитатьЗначение(Всего, "СумНДСВс");
				СуммаСНДСИтого 	= КНП_БезопасноПрочитатьЗначение(Всего, "СтУчНДСВс");
				
			ИначеЕсли ДанныеТоваров.Свойство("ВсегоОпл") Тогда
				
				Всего = ДанныеТоваров.ВсегоОпл;
				СуммаИтого 		= КНП_БезопасноПрочитатьЗначение(Всего, "СтТовБезНДСВсего"); 
				ДанныеПоНДС		= КНП_БезопасноПрочитатьЗначение(Всего, "СумНалВсего");
				
				Если ЗначениеЗаполнено(ДанныеПоНДС) Тогда
					
					СуммаНДССтруктура 	= КНП_БезопасноПрочитатьЗначение(ДанныеПоНДС, "СумНал");
					
					Если ЗначениеЗаполнено(СуммаНДССтруктура) Тогда
						СуммаНДС = КНП_БезопасноПрочитатьЗначение(СуммаНДССтруктура, "Значение");
					КонецЕсли;
					
				КонецЕсли;
				
				СуммаСНДСИтого 	= КНП_БезопасноПрочитатьЗначение(Всего, "СтТовУчНалВсего");	
				
			КонецЕсли;
			
			
			//////////////////////	ТЧ Товары	///////////////////////////////
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеУслуг) Тогда
			
			////////////////////////		ТЧ услуг	//////////////////////////////////
			Работа = КНП_БезопасноПрочитатьЗначение(ДанныеУслуг, "Работа");
			
			Если ЗначениеЗаполнено(Работа) Тогда
				
				Услуги = XML_ПолучитьМассивИзСтруктуры(Работа);
				МетаданныеТЧ = СтруктураДокумента.ТабличнаяЧасть.Колонки;
				
				Для Каждого Услуга Из Услуги Цикл
					
					СтрТабЧасти = СтруктураДокумента.ТабличнаяЧасть.Добавить();
					СтрТабЧасти.НомерСтроки = НомерСтроки;
					НомерСтроки = НомерСтроки + 1;
					СтрТабЧасти.Товар 					= КНП_БезопасноПрочитатьЗначение(Услуга, "НаимРабот");
					
					Если МетаданныеТЧ.Найти("Описание") <> Неопределено Тогда
						
						СтрТабЧасти.Описание 			= КНП_БезопасноПрочитатьЗначение(Услуга, "Описание");	
						
						Если ТипЗнч(СтрТабЧасти.Описание) = Тип("Структура") Тогда
							СтрТабЧасти.Описание		= КНП_БезопасноПрочитатьЗначение(Услуга.Описание, "Значение");
						КонецЕсли;
						
					КонецЕсли;
					
					СтрТабЧасти.ЕдиницаИзмерения 		= КНП_БезопасноПрочитатьЗначение(Услуга, "НаимЕдИзм");
					
					//Специально для ТЭК-ТОРГ
					Если СтрТабЧасти.ЕдиницаИзмерения = "0000" Тогда
						СтрТабЧасти.ЕдиницаИзмерения = "--";
					КонецЕсли;
					
					//Специально для ТЭК-ТОРГ
					СтрТабЧасти.Количество 				= КНП_БезопасноПрочитатьЗначение(Услуга, "Количество");
					СтрТабЧасти.Количество 				= ?(СтрТабЧасти.Количество = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Количество), "--", СтрТабЧасти.Количество);
					СтрТабЧасти.Цена 					= КНП_БезопасноПрочитатьЗначение(Услуга, "Цена");
					СтрТабЧасти.Цена 					= ?(СтрТабЧасти.Цена = "0.00" ИЛИ НЕ ЗначениеЗаполнено(СтрТабЧасти.Цена), "--", СтрТабЧасти.Цена);
					СтрТабЧасти.Сумма 					= КНП_БезопасноПрочитатьЗначение(Услуга, "СтоимБезНДС");
					
					Если МетаданныеТЧ.Найти("НДС") <> Неопределено Тогда
						
						СтрТабЧасти.НДС 				= КНП_БезопасноПрочитатьЗначение(Услуга, "СумНДС");
						
						Если НЕ ЗначениеЗаполнено(СтрТабЧасти.НДС) Тогда
							
							Если НРег(СтрТабЧасти.СтавкаНДС) = "без ндс" Тогда
								СтрТабЧасти.НДС = СтрТабЧасти.СтавкаНДС;
							Иначе
								СтрТабЧасти.НДС = "0.00";
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СуммаСНДС") <> Неопределено Тогда
						СтрТабЧасти.СуммаСНДС 			= КНП_БезопасноПрочитатьЗначение(Услуга, "СтоимУчНДС");	
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СтавкаНДС") <> Неопределено Тогда
						СтрТабЧасти.СтавкаНДС 			= КНП_БезопасноПрочитатьЗначение(Услуга, "НалСт");
					КонецЕсли;	
					
					СтавкаНДС 							= КНП_БезопасноПрочитатьЗначение(Услуга, "НалСт");
					
					Если МетаданныеТЧ.Найти("Товар") <> Неопределено Тогда
						СтрТабЧасти.Наименование 		= СтрТабЧасти.Товар;
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("Содержание") <> Неопределено И МетаданныеТЧ.Найти("Описание") <> Неопределено  Тогда
						СтрТабЧасти.Содержание 			= СтрТабЧасти.Описание;
					КонецЕсли;
					
					Если МетаданныеТЧ.Найти("СуммаНДС") <> Неопределено Тогда
						СтрТабЧасти.СуммаНДС 			= СтрТабЧасти.НДС;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			СуммаИтого 		= КНП_БезопасноПрочитатьЗначение(ДанныеУслуг, "СтБезНДСИт"); 
			СуммаНДС 		= КНП_БезопасноПрочитатьЗначение(ДанныеУслуг, "СумНДСИт");
			СуммаСНДСИтого 	= КНП_БезопасноПрочитатьЗначение(ДанныеУслуг, "СтУчНДСИт");
			
			////////////////////////		ТЧ услуг	//////////////////////////////////
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////
		//			Подписанты
		Если ДанныеДокумента.Свойство("Подписант") Тогда
			
			ПодписантЮЛ = КНП_БезопасноПрочитатьЗначение(ДанныеДокумента.Подписант, "ЮЛ");
			
			Если ЗначениеЗаполнено(ПодписантЮЛ) Тогда
				
				ДолжностьПодписанта = КНП_БезопасноПрочитатьЗначение(ПодписантЮЛ, "Должн");
				ПодписантФИО = КНП_БезопасноПрочитатьЗначение(ПодписантЮЛ, "ФИО");
				
				Если ЗначениеЗаполнено(ПодписантФИО) Тогда
					
					ФИОПодписанта = "";
					
					Если ПодписантФИО.Свойство("Фамилия") Тогда
						ФИОПодписанта = ПодписантФИО.Фамилия + " ";
					КонецЕсли;
					
					Если ПодписантФИО.Свойство("Имя") Тогда
						ФИОПодписанта = ФИОПодписанта + ПодписантФИО.Имя + " ";
					КонецЕсли;
					
					Если ПодписантФИО.Свойство("Отчество") Тогда
						ФИОПодписанта = ФИОПодписанта + ПодписантФИО.Отчество;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		КоличествоСтрок = НомерСтроки - 1;
		
		/////////////////////////////////////////////////////////////////
		//		Обработка данных документа	(Конец)
	КонецЕсли;
	
	ИнфПок = КНП_БезопасноПрочитатьЗначение(СтруктураДанных, "ИнфПок");
	
	Если ЗначениеЗаполнено(ИнфПок) Тогда
		ИмяКонтрагента = КНП_БезопасноПрочитатьЗначение(ИнфПок, "НаимЭконСубСост");	
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(СуммаИтого) Тогда
		СуммаИтого = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СуммаНДС) Тогда
		СуммаНДС = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СуммаСНДСИтого) Тогда
		СуммаСНДСИтого = 0;
	КонецЕсли;
	
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДоговорОснование",				ДоговорОснование);	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеОператора", 		ПредставлениеОператора);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторЭД",				ИдентификаторЭД);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторОтправителя",		ИдентификаторОтправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторПолучателя", 		ИдентификаторПолучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "Номер", 							НомерДокумента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "Дата", 							ДатаДокумента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "НомерОснования", 				НомерОснованияКорректировки);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДатаОснования", 					ДатаОснованияКорректировки);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КоррСчетБанка", 					КоррСчетБанкаОрганизации);
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеОрганизации", 		ИмяОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИННОрганизации", 				ИННОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КППОрганизации", 				КППОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "АдресОрганизации", 				АдресОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "Банк", 							БанкОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БИК", 							БИКБанкаОрганизации);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СчетПолучателя", 				СчетОрганизации);
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеКонтрагента", 		ИмяКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИННКонтрагента", 				ИННКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КППКонтрагента", 				КППКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "АдресКонтрагента", 				АдресКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БанкКонтрагента", 				БанкКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БИККонтрагента", 				БИКБанкаКонтрагента);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СчетКонтрагента", 				СчетКонтрагента);
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеГрузоотправителя", 	ИмяГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИННГрузоотправителя", 			ИННГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КППГрузоотправителя", 			КППГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "АдресГрузоотправителя", 			АдресГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БанкГрузоотправителя", 			БанкГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БИКГрузоотправителя", 			БИКБанкаГрузоотправителя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СчетГрузоотправителя", 			СчетГрузоотправителя);
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПредставлениеГрузополучателя", 	ИмяГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИННГрузополучателя", 			ИННГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КППГрузополучателя", 			КППГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "АдресГрузополучателя", 			АдресГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БанкГрузополучателя", 			БанкГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "БИКГрузополучателя", 			БИКБанкаГрузополучателя);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СчетГрузополучателя", 			СчетГрузополучателя);
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СуммаНДС", 						?(СуммаНДС = "0.00", "--", СуммаНДС));
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "НДСИтого", 						?(СуммаНДС = "0.00", "0.00", СуммаНДС));
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СуммаИтого", 					?(СуммаИтого = "0.00", "--", СуммаИтого) );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СуммаСНДСИтого", 				СуммаСНДСИтого);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "МассаБруттоИтого", 				?(ЗначениеЗаполнено(МассаБруттоИтого), КНП_ФорматСумм(МассаБруттоИтого), "") );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КоличествоИтого", 				?(ЗначениеЗаполнено(КоличествоИтого), КНП_ФорматСумм(КоличествоИтого), "") );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КоличествоМестИтого",			?(ЗначениеЗаполнено(КоличествоМестИтого), КНП_ФорматСумм(КоличествоМестИтого), "") );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СтавкаНДС", 						СтавкаНДС);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КоличествоСтрок", 				КНП_СформироватьЧислоПрописью(КоличествоСтрок) );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "КоличествоЗаписей",				КНП_СформироватьЧислоПрописью(КоличествоЗаписей) );
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ПлатежноРасчетныйДокумент",		ПлатежноРасчетныйДокумент);
	
	Если СтруктураДокумента.Свойство("СуммаСНДСИтого") И ЗначениеЗаполнено(Валюта) Тогда
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "СуммаПрописью", 				КНП_СформироватьСуммуПрописью(Число(СтруктураДокумента.СуммаСНДСИтого), Валюта));
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("НДСИтого") И ЗначениеЗаполнено(Валюта) И КНП_ЭтоЧисло(СтруктураДокумента.НДСИтого, Истина) Тогда
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "НДСПрописью", 				КНП_СформироватьСуммуПрописью(Число(СтруктураДокумента.НДСИтого), Валюта));
	КонецЕсли;
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДолжностьПодписанта", 			ДолжностьПодписанта);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ФИОПодписанта", 					ФИОПодписанта);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ТипУПД", 						ТипУПД);
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "Валюта", 					Валюта.НаименованиеПолное + ", " + Валюта.Код);
	КонецЕсли;
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИдентификаторГосКонтракта", 		ИдентификаторГосКонтракта);
	
	Если ЭтоКорректировка Тогда
		
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаУвеличение", 			КНП_ФорматСумм(Число(РазницаУвеличение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаНДСУвеличение", 		КНП_ФорматСумм(Число(РазницаНДСУвеличение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаСНДСУвеличение", 		КНП_ФорматСумм(Число(РазницаСНДСУвеличение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаУменьшение", 			КНП_ФорматСумм(Число(РазницаУменьшение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаНДСУменьшение", 		КНП_ФорматСумм(Число(РазницаНДСУменьшение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаСНДСУменьшение", 		КНП_ФорматСумм(Число(РазницаСНДСУменьшение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаАкцизУвеличение", 	КНП_ФорматСумм(Число(РазницаАкцизУвеличение) ) );
		КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "РазницаАкцизУменьшение", 	КНП_ФорматСумм(Число(РазницаАкцизУменьшение) ) );
		
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("КоличествоИтогоПрописью") И СтруктураДокумента.Свойство("КоличествоИтого") И ЗначениеЗаполнено(СтруктураДокумента.КоличествоИтого) Тогда
		СтруктураДокумента.КоличествоИтогоПрописью = 								КНП_СформироватьЧислоПрописью(СтруктураДокумента.КоличествоИтого);
	КонецЕсли;
	
	Если СтруктураДокумента.Свойство("МассаБруттоИтогоПрописью") И СтруктураДокумента.Свойство("МассаБруттоИтого") И ЗначениеЗаполнено(СтруктураДокумента.МассаБруттоИтого) Тогда
		СтруктураДокумента.МассаБруттоИтогоПрописью = 								КНП_СформироватьЧислоПрописью(СтруктураДокумента.МассаБруттоИтого);
	КонецЕсли;
	
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ИнфоПоля", ИнфоПоля);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДатаОтпуска", 					ДатаОтпускаГруза);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДолжностьОтпуска",				ДолжностьОтпустившегоГруз);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ФИООтпуска",						ФИООтпустившегоГруз);
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДатаОтгрузкиПередачи",			ДатаОтгрузкиПередачи);
	
	//Изменения с 01.07.2021 - прослеживаемость и документы об отгрузке
	КНП_БезопасноЗаписатьЗначение(СтруктураДокумента, "ДокументыОбОтгрузке",			ДокументыОбОтгрузке);
	
КонецПроцедуры

Функция ПФ_ПолучитьСтруктуруСлужебногоСообщения()
	
	СтруктураДанных = Новый Структура;
	
	СтруктураДанных.Вставить("ПредставлениеОтправителя");
	СтруктураДанных.Вставить("ПредставлениеПолучателя");
	СтруктураДанных.Вставить("ВерсияФормата");
	СтруктураДанных.Вставить("КНД");
	СтруктураДанных.Вставить("СтатусПодписиОтправителя");
	СтруктураДанных.Вставить("СтатусПодписиПолучателя");
	СтруктураДанных.Вставить("ТипДокумента");
	СтруктураДанных.Вставить("СодержаниеДокумента");
	
	Возврат СтруктураДанных;	

КонецФункции

Функция ПФ_СформироватьПФСлужебногоСообщения(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_СлужебноеСообщение");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ОбластьСлужебная 	= Макет.ПолучитьОбласть("ОбластьСлужебныеПараметры");
	ОбластьКонтент 		= Макет.ПолучитьОбласть("ОбластьКонтент");
	ОбластьУчастники 	= Макет.ПолучитьОбласть("ОбластьУчастники");
	
	ЗаполнитьЗначенияСвойств(ОбластьЗаголовок.Параметры, 	СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьСлужебная.Параметры, 	СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьКонтент.Параметры, 		СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьУчастники.Параметры, 	СтруктураДокумента);
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьСлужебная);
	ТабДок.Вывести(ОбластьКонтент);
	ТабДок.Вывести(ОбластьУчастники);
	Возврат ТабДок;
	
КонецФункции


Функция ПФ_ПолучитьСтруктуруПФСчетНаОплатуПокупателю()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Банк", "");
	СтруктураДанных.Вставить("БИК", "");
	СтруктураДанных.Вставить("КоррСчетБанка", "");
	СтруктураДанных.Вставить("СчетПолучателя", "");
	СтруктураДанных.Вставить("Номер", "");
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("ПредставлениеОрганизации", "");
	СтруктураДанных.Вставить("АдресОрганизации", "");
	СтруктураДанных.Вставить("ИННОрганизации", "");
	СтруктураДанных.Вставить("КППОрганизации", "");
	СтруктураДанных.Вставить("ПредставлениеКонтрагента", "");
	СтруктураДанных.Вставить("АдресКонтрагента", "");
	СтруктураДанных.Вставить("ИННКонтрагента", "");
	СтруктураДанных.Вставить("КППКонтрагента", "");
	СтруктураДанных.Вставить("СуммаИтого", "");
	СтруктураДанных.Вставить("СтавкаНДС", "");
	СтруктураДанных.Вставить("СуммаНДС", "");
	СтруктураДанных.Вставить("СуммаСНДСИтого", "");
	СтруктураДанных.Вставить("КоличествоСтрок", "");
	СтруктураДанных.Вставить("СуммаПрописью", "");
	СтруктураДанных.Вставить("Валюта", "");
	СтруктураДанных.Вставить("ТабличнаяЧасть", ПФ_ПолучитьТаблицуСчетНаОплатуПокупателю() );
	
	Возврат СтруктураДанных;

КонецФункции

Функция ПФ_ПолучитьТаблицуСчетНаОплатуПокупателю()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки");
	ТаблицаДанных.Колонки.Добавить("Товар");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаДанных.Колонки.Добавить("Цена");
	ТаблицаДанных.Колонки.Добавить("Сумма");
	ТаблицаДанных.Колонки.Добавить("НДС");
	ТаблицаДанных.Колонки.Добавить("Наименование");
	ТаблицаДанных.Колонки.Добавить("Содержание");
	ТаблицаДанных.Колонки.Добавить("СуммаНДС");
	ТаблицаДанных.Колонки.Добавить("СтавкаНДС");
	Возврат ТаблицаДанных;	

КонецФункции

Функция ПФ_СформироватьПФСчетНаОплатуПокупателю(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_СчетПокупателю");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьИтог				= Макет.ПолучитьОбласть("ОбластьИтог");
	ОбластьИтогНДС			= Макет.ПолучитьОбласть("ОбластьИтогНДС");
	ОбластьПодвал			= Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);	
	ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьИтогНДС.Параметры, СтруктураДокумента);
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьИтог);
	
	Если ЗначениеЗаполнено(СтруктураДокумента.СуммаНДС) Тогда
		ОбластьИтогНДС.Параметры.СтрокаНДС = "В том числе НДС";
	Иначе
		
		ОбластьИтогНДС.Параметры.СтрокаНДС = "";
		ОбластьИтогНДС.Параметры.СуммаНДС = "Без НДС";
		
	КонецЕсли;
	
	ТабДок.Вывести(ОбластьИтогНДС);
	ТабДок.Вывести(ОбластьПодвал);
	
	Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
		
		ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
		ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
		ТабДок.Вывести(ОбластьСведенияЭД);
		
	КонецЕсли;
	
	Возврат ТабДок;

КонецФункции


Функция ПФ_ПолучитьСтруктуруПФНакладнойПродавца()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Банк", "");
	СтруктураДанных.Вставить("БИК", "");
	СтруктураДанных.Вставить("СчетПолучателя", "");
	СтруктураДанных.Вставить("БанкКонтрагента", "");
	СтруктураДанных.Вставить("БИККонтрагента", "");
	СтруктураДанных.Вставить("СчетКонтрагента", "");
	
	СтруктураДанных.Вставить("ДоговорОснование", "");
	СтруктураДанных.Вставить("Номер", "");
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("ПредставлениеОрганизации", "");
	СтруктураДанных.Вставить("АдресОрганизации", "");
	СтруктураДанных.Вставить("ИННОрганизации", "");
	СтруктураДанных.Вставить("КППОрганизации", "");
	СтруктураДанных.Вставить("ПредставлениеКонтрагента", "");
	СтруктураДанных.Вставить("АдресКонтрагента", "");
	СтруктураДанных.Вставить("ИННКонтрагента", "");
	СтруктураДанных.Вставить("КППКонтрагента", "");
	
	СтруктураДанных.Вставить("ПредставлениеГрузоотправителя", "");
	СтруктураДанных.Вставить("АдресГрузоотправителя", "");
	СтруктураДанных.Вставить("ИННГрузоотправителя", "");
	СтруктураДанных.Вставить("КППГрузоотправителя", "");
	СтруктураДанных.Вставить("БанкГрузоотправителя", "");
	СтруктураДанных.Вставить("БИКГрузоотправителя", "");
	СтруктураДанных.Вставить("СчетГрузоотправителя", "");
	
	СтруктураДанных.Вставить("ПредставлениеГрузополучателя", "");
	СтруктураДанных.Вставить("АдресГрузополучателя", "");
	СтруктураДанных.Вставить("ИННГрузополучателя", "");
	СтруктураДанных.Вставить("КППГрузополучателя", "");
	СтруктураДанных.Вставить("БанкГрузополучателя", "");
	СтруктураДанных.Вставить("БИКГрузополучателя", "");
	СтруктураДанных.Вставить("СчетГрузополучателя", "");
	
	СтруктураДанных.Вставить("СуммаИтого", "");
	СтруктураДанных.Вставить("НДСИтого", "");
	СтруктураДанных.Вставить("СуммаСНДСИтого", "");
	СтруктураДанных.Вставить("МассаБруттоИтого", "");
	СтруктураДанных.Вставить("КоличествоИтого", "");
	СтруктураДанных.Вставить("КоличествоМестИтого", "");
	СтруктураДанных.Вставить("СуммаПрописью", "");
	СтруктураДанных.Вставить("КоличествоИтогоПрописью", "");
	СтруктураДанных.Вставить("МассаБруттоИтогоПрописью", "");
	СтруктураДанных.Вставить("КоличествоМестИтогоПрописью", "");
	СтруктураДанных.Вставить("НДСПрописью", "");
	СтруктураДанных.Вставить("ДолжностьПодписанта", "");
	СтруктураДанных.Вставить("ФИОПодписанта", "");
	СтруктураДанных.Вставить("КоличествоСтрок");
	СтруктураДанных.Вставить("Валюта", "");
	СтруктураДанных.Вставить("КоличествоЗаписей");
	СтруктураДанных.Вставить("ДатаОтпуска", "");
	СтруктураДанных.Вставить("ДатаОтгрузкиПередачи", "");
	СтруктураДанных.Вставить("ТабличнаяЧасть", ПФ_ПолучитьТаблицуНакладнойПродавца() );
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПФ_ПолучитьТаблицуНакладнойПродавца()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки");
	ТаблицаДанных.Колонки.Добавить("Товар");
	ТаблицаДанных.Колонки.Добавить("ТоварКод");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаДанных.Колонки.Добавить("Упаковка");
	ТаблицаДанных.Колонки.Добавить("КоличествоВМесте");
	ТаблицаДанных.Колонки.Добавить("КоличествоМест");
	ТаблицаДанных.Колонки.Добавить("МассаБрутто");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("Цена");
	ТаблицаДанных.Колонки.Добавить("Сумма"); 
	ТаблицаДанных.Колонки.Добавить("СтавкаНДС");
	ТаблицаДанных.Колонки.Добавить("НДС");
	ТаблицаДанных.Колонки.Добавить("СуммаСНДС");
	ТаблицаДанных.Колонки.Добавить("Наименование");
	ТаблицаДанных.Колонки.Добавить("Содержание");
	ТаблицаДанных.Колонки.Добавить("СуммаНДС");
	ТаблицаДанных.Колонки.Добавить("ИнфоПоля");
	Возврат ТаблицаДанных;	

КонецФункции

Функция ПФ_СформироватьПФНакладнойПродавца(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_ТоварнаяНакладная");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал			= Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);	
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);	
	
	Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
		
		ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
		ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
		ТабДок.Вывести(ОбластьСведенияЭД);
		
	КонецЕсли;
	
	Возврат ТабДок;	

КонецФункции


Функция ПФ_ПолучитьСтруктуруПФАктаИсполнителя()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Банк", "");
	СтруктураДанных.Вставить("БИК", "");
	СтруктураДанных.Вставить("СчетПолучателя", "");
	СтруктураДанных.Вставить("Номер", "");
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("ПредставлениеОрганизации", "");
	СтруктураДанных.Вставить("АдресОрганизации", "");
	СтруктураДанных.Вставить("ИННОрганизации", "");
	СтруктураДанных.Вставить("КППОрганизации", "");
	СтруктураДанных.Вставить("ПредставлениеКонтрагента", "");
	СтруктураДанных.Вставить("АдресКонтрагента", "");
	СтруктураДанных.Вставить("ИННКонтрагента", "");
	СтруктураДанных.Вставить("КППКонтрагента", "");
	СтруктураДанных.Вставить("СуммаИтого", "");
	СтруктураДанных.Вставить("НДСИтого", "");
	СтруктураДанных.Вставить("СуммаСНДСИтого", "");
	СтруктураДанных.Вставить("СуммаПрописью", "");
	СтруктураДанных.Вставить("НДСПрописью", "");
	СтруктураДанных.Вставить("ДолжностьПодписанта", "");
	СтруктураДанных.Вставить("ФИОПодписанта", "");
	СтруктураДанных.Вставить("Валюта", "");
	СтруктураДанных.Вставить("ТабличнаяЧасть", ПФ_ПолучитьТаблицуАктаИсполнителя() );
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПФ_ПолучитьТаблицуАктаИсполнителя()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки");
	ТаблицаДанных.Колонки.Добавить("Товар");
	ТаблицаДанных.Колонки.Добавить("Описание");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаДанных.Колонки.Добавить("Цена");
	ТаблицаДанных.Колонки.Добавить("Сумма"); 
	ТаблицаДанных.Колонки.Добавить("НДС");
	ТаблицаДанных.Колонки.Добавить("СуммаСНДС");
	ТаблицаДанных.Колонки.Добавить("Наименование");
	ТаблицаДанных.Колонки.Добавить("Содержание");
	ТаблицаДанных.Колонки.Добавить("СуммаНДС");
	ТаблицаДанных.Колонки.Добавить("СтавкаНДС");
	Возврат ТаблицаДанных;	

КонецФункции

Функция ПФ_СформироватьПФАктаИсполнителя(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	ЕстьОписания = Ложь;
	
	Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
		
		Если СтрокаТЧ.Товар <> СтрокаТЧ.Описание Тогда
			
			ЕстьОписания = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Макет = ПолучитьМакет("ПФ_АктИсполнителя");
	ОбластьШапка 			= Макет.ПолучитьОбласть(?(ЕстьОписания, "ОбластьШапка", "ОбластьШапкаБезОписания") );
	ОбластьСтрока			= Макет.ПолучитьОбласть(?(ЕстьОписания, "ОбластьСтрока", "ОбластьСтрокаБезОписания"));
	ОбластьПодвал			= Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);	
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
		
		ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
		ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
		ТабДок.Вывести(ОбластьСведенияЭД);
		
	КонецЕсли;
	
	Возврат ТабДок;	

КонецФункции


Функция ПФ_ПолучитьСтруктуруПФУПДПродавца()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ТипУПД", "");
	СтруктураДанных.Вставить("Банк", "");
	СтруктураДанных.Вставить("БИК", "");
	СтруктураДанных.Вставить("СчетПолучателя", "");
	СтруктураДанных.Вставить("Номер", "");
	СтруктураДанных.Вставить("Дата", "");
	СтруктураДанных.Вставить("ПредставлениеГрузоотправителя", "");
	СтруктураДанных.Вставить("АдресГрузоотправителя", "");
	СтруктураДанных.Вставить("ПредставлениеГрузополучателя", "");
	СтруктураДанных.Вставить("АдресГрузополучателя", "");
	СтруктураДанных.Вставить("ДокументыОбОтгрузке", "");
	
	СтруктураДанных.Вставить("ПредставлениеОрганизации", "");
	СтруктураДанных.Вставить("АдресОрганизации", "");
	СтруктураДанных.Вставить("ИННОрганизации", "");
	СтруктураДанных.Вставить("КППОрганизации", "");
	
	СтруктураДанных.Вставить("ПредставлениеКонтрагента", "");
	СтруктураДанных.Вставить("АдресКонтрагента", "");
	СтруктураДанных.Вставить("ИННКонтрагента", "");
	СтруктураДанных.Вставить("КППКонтрагента", "");
	
	СтруктураДанных.Вставить("СуммаИтого", "");
	СтруктураДанных.Вставить("НДСИтого", "");
	СтруктураДанных.Вставить("СуммаСНДСИтого", "");
	СтруктураДанных.Вставить("СуммаПрописью", "");
	СтруктураДанных.Вставить("НДСПрописью", "");
	СтруктураДанных.Вставить("ДолжностьПодписанта", "");
	СтруктураДанных.Вставить("ФИОПодписанта", "");
	СтруктураДанных.Вставить("ДолжностьОтпуска", "");
	СтруктураДанных.Вставить("ФИООтпуска", "");
	СтруктураДанных.Вставить("Валюта", "");
	СтруктураДанных.Вставить("ИдентификаторГосКонтракта", "");
	СтруктураДанных.Вставить("ДоговорОснование", "");
	СтруктураДанных.Вставить("ИнфоПоля", "");
	СтруктураДанных.Вставить("ТабличнаяЧасть", ПФ_ПолучитьТаблицуТоваровПродавца() );
	СтруктураДанных.Вставить("ПлатежноРасчетныйДокумент", "");
	СтруктураДанных.Вставить("ДатаОтгрузкиПередачи", "");
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПФ_ПолучитьТаблицуТоваровПродавца()
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("НомерСтроки");
	ТаблицаДанных.Колонки.Добавить("Товар");
	ТаблицаДанных.Колонки.Добавить("ТоварКод");
	ТаблицаДанных.Колонки.Добавить("Описание");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("КодВидаТовара");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаДанных.Колонки.Добавить("Цена");
	ТаблицаДанных.Колонки.Добавить("Сумма"); 
	ТаблицаДанных.Колонки.Добавить("НДС");
	ТаблицаДанных.Колонки.Добавить("СтавкаНДС");
	ТаблицаДанных.Колонки.Добавить("СуммаСНДС");
	ТаблицаДанных.Колонки.Добавить("Акциз");
	ТаблицаДанных.Колонки.Добавить("Наименование");
	ТаблицаДанных.Колонки.Добавить("Содержание");
	ТаблицаДанных.Колонки.Добавить("СуммаНДС");
	ТаблицаДанных.Колонки.Добавить("ИнфоПоля");
	ТаблицаДанных.Колонки.Добавить("СтранаПроисхожденияКод");
	ТаблицаДанных.Колонки.Добавить("ПредставлениеСтраны");
	ТаблицаДанных.Колонки.Добавить("ПредставлениеГТД");
	Возврат ТаблицаДанных;	

КонецФункции

Функция ПФ_СформироватьПФУПДПродавца(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	
	//Марков И. 26.03.2025 #UT10-5160 изменено на ДатаОтгрузкиПередачи
	Если КНП_ПривестиКДате(СтруктураДокумента.ДатаОтгрузкиПередачи) >= Дата(2021,7,1) Тогда
		
		Макет = ПолучитьМакет("ПФ_УПД_534_Поставщик");
		Шапка 						= Макет.ПолучитьОбласть("Шапка");
		ЗаголовокТаблицы			= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		Строка						= Макет.ПолучитьОбласть("Строка");
		СтрокаДоп					= Макет.ПолучитьОбласть("СтрокаДоп");
		Итого 						= Макет.ПолучитьОбласть("Итого");
		Подвал 						= Макет.ПолучитьОбласть("Подвал");
		ПодвалНакладная				= Макет.ПолучитьОбласть("ПодвалНакладной");
		
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(Итого.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(Подвал.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ПодвалНакладная.Параметры, СтруктураДокумента);
		
		Если СтруктураДокумента.ТипУПД = "ДОП" Тогда
			Шапка.Параметры.СтатусУПД = 2;
		Иначе
			Шапка.Параметры.СтатусУПД = 1;
		КонецЕсли;
		
		ТабДок.Вывести(Шапка);
		ТабДок.Вывести(ЗаголовокТаблицы);
		
		Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
			
			ЗаполнитьЗначенияСвойств(Строка.Параметры, СтрокаТЧ);	
			ЗаполнитьЗначенияСвойств(СтрокаДоп.Параметры, СтрокаТЧ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ИнфоПоля) Тогда
				ТабДок.Вывести(СтрокаДоп);
			Иначе
				ТабДок.Вывести(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.Вывести(Итого);	
		ТабДок.Вывести(Подвал);	
		
		Если СтруктураДокумента.ТипУПД <> "СЧФ" Тогда
			ТабДок.Вывести(ПодвалНакладная);	
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
			
			ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
			ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
			ТабДок.Вывести(ОбластьСведенияЭД);
			
		КонецЕсли;
		
		
	Иначе //Старый макет УПД
		
		Макет = ПолучитьМакет("ПФ_УПДПоставщика");
		ОбластьШапка 				= Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьСтрока				= Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрокаДоп			= Макет.ПолучитьОбласть("ОбластьСтрокаДоп");
		ОбластьПодвал				= Макет.ПолучитьОбласть("ОбластьПодвал");
		ОбластьНакладная			= Макет.ПолучитьОбласть("ОбластьНакладная");
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ОбластьНакладная.Параметры, СтруктураДокумента);
		
		Если СтруктураДокумента.ТипУПД = "ДОП" Тогда
			ОбластьШапка.Параметры.СтатусУПД = 2;
		Иначе
			ОбластьШапка.Параметры.СтатусУПД = 1;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапка);
		
		Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);	
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаДоп.Параметры, СтрокаТЧ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ИнфоПоля) Тогда
				ТабДок.Вывести(ОбластьСтрокаДоп);
			Иначе
				ТабДок.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПодвал);	
		
		Если СтруктураДокумента.ТипУПД <> "СЧФ" Тогда
			ТабДок.Вывести(ОбластьНакладная);	
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
			
			ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
			ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
			ТабДок.Вывести(ОбластьСведенияЭД);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТабДок;	
	
КонецФункции


Функция ПФ_ПолучитьСтруктуруПФУКДПродавца() 
	
	СтруктураДанных = ПФ_ПолучитьСтруктуруПФУПДПродавца();
	СтруктураДанных.Вставить("НомерОснования", "");
	СтруктураДанных.Вставить("ДатаОснования", "");
	СтруктураДанных.Вставить("НомерИсправления", "");
	СтруктураДанных.Вставить("ДатаИсправления", "");
	СтруктураДанных.Вставить("НомерИсправленияОснования", "");
	СтруктураДанных.Вставить("ДатаИсправленияОснования", "");
	СтруктураДанных.Вставить("РазницаУвеличение", "");
	СтруктураДанных.Вставить("РазницаУменьшение", "");
	СтруктураДанных.Вставить("РазницаНДСУвеличение", "");
	СтруктураДанных.Вставить("РазницаНДСУменьшение", "");
	СтруктураДанных.Вставить("РазницаСНДСУвеличение", "");
	СтруктураДанных.Вставить("РазницаСНДСУменьшение", "");
	СтруктураДанных.Вставить("РазницаАкцизУвеличение");
	СтруктураДанных.Вставить("РазницаАкцизУменьшение");
	СтруктураДанных.Вставить("ДоговорОснование");
	ПФ_ПолучитьТаблицуКорректировкиПродавца(СтруктураДанных.ТабличнаяЧасть);
	Возврат СтруктураДанных;

КонецФункции

Процедура ПФ_ПолучитьТаблицуКорректировкиПродавца(ТаблицаДанных)
	
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмеренияКодДо");
	ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмеренияДо");
	ТаблицаДанных.Колонки.Добавить("КоличествоДоИзменения");
	ТаблицаДанных.Колонки.Добавить("ЦенаДоИзменения");
	ТаблицаДанных.Колонки.Добавить("СуммаДоИзменения");
	ТаблицаДанных.Колонки.Добавить("СтавкаНДСДоИзменения");
	ТаблицаДанных.Колонки.Добавить("НДСДоИзменения");
	ТаблицаДанных.Колонки.Добавить("СуммаСНДСДоИзменения");
	ТаблицаДанных.Колонки.Добавить("СуммаНДСДоИзменения");
	ТаблицаДанных.Колонки.Добавить("АкцизДоИзменения");
	ТаблицаДанных.Колонки.Добавить("РазницаУвеличение");
	ТаблицаДанных.Колонки.Добавить("РазницаУменьшение");
	ТаблицаДанных.Колонки.Добавить("РазницаНДСУвеличение");
	ТаблицаДанных.Колонки.Добавить("РазницаНДСУменьшение");
	ТаблицаДанных.Колонки.Добавить("РазницаСНДСУвеличение");
	ТаблицаДанных.Колонки.Добавить("РазницаСНДСУменьшение");
	ТаблицаДанных.Колонки.Добавить("РазницаАкцизУвеличение");
	ТаблицаДанных.Колонки.Добавить("РазницаАкцизУменьшение");

КонецПроцедуры

Функция ПФ_СформироватьПФУКДПродавца(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если КНП_ПривестиКДате(СтруктураДокумента.Дата) >= Дата(2021,7,1) Тогда
		
		Макет = ПолучитьМакет("ПФ_УКД_534_Поставщик");
		ЗаголовокДокумента 			= Макет.ПолучитьОбласть("ЗаголовокДокумента");
		ОбластьОснования 			= Макет.ПолучитьОбласть("ОбластьОснования");
		Шапка 						= Макет.ПолучитьОбласть("Шапка");
		ИдентификаторГосКонтракта 	= Макет.ПолучитьОбласть("ИдентификаторГосКонтракта");
		ЗаголовокТаблицы			= Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		Строка						= Макет.ПолучитьОбласть("ОбластьСтрока");
		СтрокаДоп					= Макет.ПолучитьОбласть("ОбластьСтрокаДоп");
		Итого 						= Макет.ПолучитьОбласть("Итого");
		Подвал 						= Макет.ПолучитьОбласть("Подвал");
		ПодвалНакладная				= Макет.ПолучитьОбласть("ПодвалНакладной");
		
		ЗаполнитьЗначенияСвойств(ЗаголовокДокумента.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ОбластьОснования.Параметры, СтруктураДокумента);	
		ЗаполнитьЗначенияСвойств(Шапка.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ИдентификаторГосКонтракта.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(Итого.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(Подвал.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ПодвалНакладная.Параметры, СтруктураДокумента);
		
		Если СтруктураДокумента.ТипУПД = "ДИС" Тогда
			Шапка.Параметры.СтатусУКД = 2;
		Иначе
			Шапка.Параметры.СтатусУКД = 1;
		КонецЕсли;
		
		ТабДок.Вывести(ЗаголовокДокумента);
		ТабДок.Вывести(ОбластьОснования);
		ТабДок.Вывести(Шапка);
		ТабДок.Вывести(ИдентификаторГосКонтракта);
		ТабДок.Вывести(ЗаголовокТаблицы);
		
		Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
			
			ЗаполнитьЗначенияСвойств(Строка.Параметры, СтрокаТЧ);	
			ЗаполнитьЗначенияСвойств(СтрокаДоп.Параметры, СтрокаТЧ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ИнфоПоля) Тогда
				ТабДок.Вывести(СтрокаДоп);
			Иначе
				ТабДок.Вывести(Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.Вывести(Итого);	
		ТабДок.Вывести(Подвал);	
		
		Если СтруктураДокумента.ТипУПД <> "СЧФ" Тогда
			ТабДок.Вывести(ПодвалНакладная);	
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
			
			ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
			ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
			ТабДок.Вывести(ОбластьСведенияЭД);
			
		КонецЕсли;
		
		
	Иначе //Старый макет УКД
		
		Макет = ПолучитьМакет("ПФ_УКДПоставщика");
		ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");
		ОбластьСтрока			= Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрокаДоп		= Макет.ПолучитьОбласть("ОбластьСтрокаДоп");
		ОбластьПодвал			= Макет.ПолучитьОбласть("ОбластьПодвал");
		ОбластьНакладная		= Макет.ПолучитьОбласть("ОбластьНакладная");
		
		ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);
		ЗаполнитьЗначенияСвойств(ОбластьНакладная.Параметры, СтруктураДокумента);
		
		Если СтруктураДокумента.ТипУПД = "ДИС" Тогда
			ОбластьШапка.Параметры.СтатусУПД = 2;
		Иначе
			ОбластьШапка.Параметры.СтатусУПД = 1;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьШапка);
		
		Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);	
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаДоп.Параметры, СтрокаТЧ);
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ИнфоПоля) Тогда
				ТабДок.Вывести(ОбластьСтрокаДоп);
			Иначе
				ТабДок.Вывести(ОбластьСтрока);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьПодвал);	
		
		Если СтруктураДокумента.ТипУПД <> "СЧФ" Тогда
			ТабДок.Вывести(ОбластьНакладная);	
		КонецЕсли;
		
		Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
			ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
			ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
			ТабДок.Вывести(ОбластьСведенияЭД);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТабДок;	

КонецФункции

Функция ПФ_СформироватьПФСчетФактуры(СтруктураДокумента)
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_СчетФактура");
	ОбластьШапка 			= Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрока			= Макет.ПолучитьОбласть("ОбластьСтрока");
	ОбластьПодвал			= Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, СтруктураДокумента);
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, СтруктураДокумента);
	
	ТабДок.Вывести(ОбластьШапка);
	
	Для Каждого СтрокаТЧ Из СтруктураДокумента.ТабличнаяЧасть Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЧ);
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодвал);	
	
	Если СтруктураДокумента.Свойство("ИдентификаторЭД") Тогда
		
		ОбластьСведенияЭД = Макет.ПолучитьОбласть("ОбластьСведенияОбЭД");
		ЗаполнитьЗначенияСвойств(ОбластьСведенияЭД.Параметры, СтруктураДокумента);
		ТабДок.Вывести(ОбластьСведенияЭД);
		
	КонецЕсли;	
	
	Возврат ТабДок;	
	
КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//			#КонецОбласти ФормированиеПечатныхФорм				 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////






////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#Область Лицензирование 					 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область Лицензирование

Процедура ЛИЦ_СохранитьТокенВСистеме(Токен, ОрганизацияРегистрации)
	
	Попытка
		
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Токен");
		НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
		НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(ОрганизацияРегистрации);
		НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
		НаборЗаписейЗначенияСвойств.Прочитать();
		
		Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
		Иначе
			Запись = НаборЗаписейЗначенияСвойств[0];
		КонецЕсли; 
		
		Запись.Объект = ОрганизацияРегистрации;
		Запись.Свойство = ПараметрИдентификатора;
		Запись.Значение = Токен;
		НаборЗаписейЗначенияСвойств.Записать();
		ДобавитьВЖурнал("ПинКод привязан к организации " + Строка(ОрганизацияРегистрации), "СохранитьПинКодВСистеме");
		
	Исключение
		ДобавитьВЖурнал("Возникла ошибка " + ОписаниеОшибки(), "СохранитьПинКодВСистеме");
	КонецПопытки;

КонецПроцедуры

Функция ЛИЦ_ПрочитатьТокенВСистеме()
	
	Результат = "";
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Токен");
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() > 0 Тогда
		
		Запись = НаборЗаписейЗначенияСвойств[0];
		Результат = Запись.Значение;
		
	КонецЕсли;	
	
	Возврат Результат;

КонецФункции

Функция ЛИЦ_ПолучитьТокенЛицензии(ПинКод, ОрганизацияРегистрации)
	
	Заголовки = Новый Соответствие;
	СтруктураЗапроса = Новый Структура("pin,inn,ogrn,ibname");
	СтруктураЗапроса.pin = ПинКод;
	СтруктураЗапроса.inn = ОрганизацияРегистрации.ИНН;
	СтруктураЗапроса.ogrn = МОП_ПолучитьОГРНКонтрагента(ОрганизацияРегистрации); 
	СтруктураЗапроса.ibname = Метаданные.Синоним;
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(СтруктураЗапроса);
	
	СтруктураВозврата = Новый Структура("Токен,ДатаДействия,ПричинаОшибки");
	Результат = ОбменHTTPJSON(АдресСервисаПоддержки + "lic/reg", Заголовки, Истина, ТелоЗапроса);
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если Результат <> Неопределено И Результат.Получить("success") = Истина Тогда
		
		ЛИЦ_СохранитьТокенВСистеме(Результат.Получить("token"), ОрганизацияРегистрации );
		СтруктураВозврата.Токен = Результат.Получить("token");
		СтруктураВозврата.ДатаДействия = КНП_ПривестиКДате(Результат.Получить("expiredAt") );
		
	ИначеЕсли Результат <> Неопределено И Результат.Получить("success") = Ложь Тогда
		СтруктураВозврата.ПричинаОшибки = Результат.Получить("reason");
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ЛИЦ_ПроверитьТокенЛицензии() 
	
	СтруктураВозврата = Новый Структура("Токен,ДатаДействия");
	
	Если НЕ ИспользоватьЛицензирование Тогда
		
		СтруктураВозврата.Токен = "Некий токен";
		СтруктураВозврата.ДатаДействия = ТекущаяДата() + 86400 * 7; 
		
	Иначе
		
		СтруктураВозврата.Токен = ЛИЦ_ПрочитатьТокенВСистеме();
		СтруктураВозврата.ДатаДействия = ТекущаяДата() + 86400;
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("token", СтруктураВозврата.Токен);
		Результат = ОбменHTTPJSON(АдресСервисаПоддержки + "lic/check", Заголовки, Истина, "");
		
		Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
			СтруктураВозврата.ДатаДействия = КНП_ПривестиКДате(Результат.Получить("expiredAt") );
		ИначеЕсли Результат <> Неопределено Тогда
			СтруктураВозврата.Токен = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ЛИЦ_ПолучитьСписокДоступныхМодулей()
	//Changelog
	//
	//27.08.2019 - отключен запрос при отключенной системе лицензирования
	
	ТаблицаВозврата = ЛИЦ_ПолучитьТаблицуВозвратаСпискаМодулей();
	
	Если НЕ ИспользоватьЛицензирование Тогда
		Возврат ТаблицаВозврата;
	КонецЕсли;
	
	Заголовки = Новый Соответствие;
	Токен = ЛИЦ_ПрочитатьТокенВСистеме();
	Заголовки.Вставить("token", Токен);
	Результат = ОбменHTTPJSON(АдресСервисаПоддержки + "techsupp/modules/list?branchName=" + ВеткаРазработки + "&releaseDate=" + ДатаРелиза, Заголовки);
	
	Если ТипЗнч(Результат) = Тип("Соответствие") И Результат.Получить("success") = Истина Тогда
		
		МассивРезультатов = Результат.Получить("releases");
		
		Если ТипЗнч(МассивРезультатов) = Тип("Массив") Тогда
			
			Для Каждого ЭлементМассива Из МассивРезультатов Цикл
				
				СтрТаблицы = ТаблицаВозврата.Добавить();
				СтрТаблицы.ИмяВерсии = ЭлементМассива.Получить("releaseName");
				СтрТаблицы.ДатаРелиза = КНП_ПривестиКДате(ЭлементМассива.Получить("releaseDate") );
				СтрТаблицы.ХешСумма = ЭлементМассива.Получить("releaseHash");
				
			КонецЦикла;
			
		Иначе
			ДобавитьВЖурнал("Не определен ответ с сервера лицензирования", "ПолучитьСписокДоступныхМодулей()");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Соответствие") И  Результат.Получить("success") = Ложь Тогда
		ДобавитьВЖурнал(Результат.Получить("reason"), "ПолучитьСписокДоступныхМодулей()"); 	
	Иначе
	КонецЕсли;
	
	Возврат ТаблицаВозврата;	

КонецФункции

Функция ЛИЦ_ПолучитьНовуюВерсиюМодуля(ХешЗначение) 
	
	Заголовки = Новый Соответствие;
	Токен = ЛИЦ_ПрочитатьТокенВСистеме();
	Заголовки.Вставить("token", Токен);
	Результат = ОбменHTTPJSON(АдресСервисаПоддержки + "techsupp/modules/get?hash=" + ХешЗначение, Заголовки);
	
	ДанныеВозврата = Неопределено;
	
	Если ТипЗнч(Результат) = Тип("Соответствие") И Результат.Получить("success") = Истина Тогда
		
		ДанныеВBase64 = Результат.Получить("data");
		
		Попытка
			ДанныеВозврата = Base64Значение(ДанныеВBase64);
		Исключение
		КонецПопытки;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Соответствие") И  Результат.Получить("success") = Ложь Тогда
		ДобавитьВЖурнал(Результат.Получить("reason"), "ПолучитьНовуюВерсиюМодуля()"); 	
	Иначе
	КонецЕсли;
	
	Возврат ДанныеВозврата;	

КонецФункции

Функция ЛИЦ_ПолучитьТаблицуВозвратаСпискаМодулей()
	
	ТаблицаВозврата = Новый ТаблицаЗначений;
	ТаблицаВозврата.Колонки.Добавить("ИмяВерсии");
	ТаблицаВозврата.Колонки.Добавить("ДатаРелиза");
	ТаблицаВозврата.Колонки.Добавить("ХешСумма");
	Возврат ТаблицаВозврата;

КонецФункции

Функция ЛИЦ_ПолучитьДатуРелиза()
	
	Возврат ДатаРелиза;	

КонецФункции

Функция ЛИЦ_ЛицензияДействительна()
	
	Если НЕ ИспользоватьЛицензирование Тогда
		Возврат Истина;
	КонецЕсли;
	
	СтруктураДанных = ЛИЦ_ПроверитьТокенЛицензии();
	
	Если ЗначениеЗаполнено(СтруктураДанных.Токен) И СтруктураДанных.ДатаДействия > ТекущаяДата() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#КонецОбласти Лицензирование				 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//				#Область ТехническаяПоддержка 					 	  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область ТехническаяПоддержка

Функция ТП_ОтправитьПисьмоВТехПоддержку(ИмяПользователя, ПочтовыйАдрес, ТекстПисьма)
	
	Заголовки = Новый Соответствие;
	СтруктураВозврата = Новый Структура("Заголовок,Текст");
	Токен = ПрочитатьТокенВСистеме();
	
	СтруктураЗапроса = Новый Структура("token,sender,senderName,message");
	СтруктураЗапроса.token = Токен;
	СтруктураЗапроса.sender = ПочтовыйАдрес;
	СтруктураЗапроса.senderName = ИмяПользователя; 
	СтруктураЗапроса.message = ТекстПисьма;
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(СтруктураЗапроса);
	Результат = ОбменHTTPJSON(АдресСервисаПоддержки + "support/message", Заголовки, Истина, ТелоЗапроса);
	
	Если Результат <> Неопределено И Результат.Получить("success") = Истина Тогда
		
		СтруктураВозврата.Заголовок = "Отправка письма";
		СтруктураВозврата.Текст = "Письмо успешно отправлено!";
		
	ИначеЕсли Результат <> Неопределено И Результат.Получить("success") = Ложь Тогда
		
		СтруктураВозврата.Заголовок = "Ошибка отправки сообщения";
		СтруктураВозврата.Текст = Результат.Получить("reason");
		
	Иначе
		
		СтруктураВозврата.Заголовок = "Ошибка отправки сообщения";
		СтруктураВозврата.Текст = Результат;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//			#КонецОбласти ТехническаяПоддержка				 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////





////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область РаботаС1С 					 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область РаботаС1С

Функция РС_ПолучитьВсехКонтрагентов(ОтборБезИдентификатора = Ложь)
	
	ТаблицаДанных = МОП_ПолучитьСписокКонтрагентов();
	ТаблицаДанных.Колонки.Добавить("НаличиеВЭДО");
	ТаблицаДанных.Колонки.Добавить("Пригласить");
	ТаблицаДанных.Колонки.Добавить("ИдентификаторКонтрагента");
	
	МассивКУдалению = Новый Массив;
	МассивИННДляПоиска = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		Если ОтборБезИдентификатора Тогда
			
			Идентификатор = РС_ПолучитьИдентификаторыКонтрагента(СтрокаТаблицы.Контрагент);
			
			Если ЗначениеЗаполнено(Идентификатор.ИдентификаторКонтрагента) Тогда
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		ИНН = СтрокаТаблицы.ИНН;
		
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивИННДляПоиска.Добавить(ИНН);
		
	КонецЦикла;
	
	СписокКонтрагентовВСистеме = ЭДО_ПолучитьСписокКонтрагентовВСистеме(МассивИННДляПоиска);
	
	ИтоговаяТаблица = ТаблицаДанных.Скопировать();
	ИтоговаяТаблица.Очистить();
	
	Для Каждого ЭлементСписка Из СписокКонтрагентовВСистеме Цикл 			
		
		СтрокаТаблицы = ИтоговаяТаблица.Добавить();
		СтрокаИсходнойТаблицы = ТаблицаДанных.Найти(ЭлементСписка.ИНН, "ИНН");
		
		Если СтрокаИсходнойТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаИсходнойТаблицы);
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЭлементСписка);
		СтрокаТаблицы.НаличиеВЭДО = Истина;
		
	КонецЦикла;
	
	Возврат ИтоговаяТаблица;

КонецФункции

Функция РС_ЕстьРасхождения(СтрокаТоваров)
	
	Если СтрокаТоваров.Количество <> СтрокаТоваров.КоличествоДоИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаТоваров.Цена <> СтрокаТоваров.ЦенаДоИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаТоваров.Сумма <> СтрокаТоваров.СуммаДоИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаТоваров.СуммаНДС <> СтрокаТоваров.СуммаНДСДоИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СтрокаТоваров.СтавкаНДС <> СтрокаТоваров.СтавкаНДСДоИзменения Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция РС_ПрочитатьТаблицуТоваров(ОбъектJSON, УКД = Ложь)
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Наименование");
	ТаблицаТоваров.Колонки.Добавить("Содержание");
	ТаблицаТоваров.Колонки.Добавить("Количество");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	ТаблицаТоваров.Колонки.Добавить("Сумма");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДС");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДС");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("КоличествоДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("ЦенаДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("СуммаДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("СуммаНДСДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("СтавкаНДСДоИзменения");
	ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок");
	ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковокДоИзменения");
	
	Для Каждого СтрокаОбъекта Из ОбъектJSON Цикл
		
		СуммаБезНДС = СтрокаОбъекта.Получить("costBeforeTax");
		
		Если УКД Тогда
			
			СуммаБезНДС = Число(СтрокаОбъекта.Получить("costBeforeTax").Получить("after") );
			СуммаБезНДСДо = Число(СтрокаОбъекта.Получить("costBeforeTax").Получить("before") );
			
		КонецЕсли;
		
		СуммаНДС = СтрокаОбъекта.Получить("amountOfTax");
		
		Если УКД Тогда
			
			СуммаНДС = Число(СтрокаОбъекта.Получить("amountOfTax").Получить("after") );
			СуммаНДСДо = Число(СтрокаОбъекта.Получить("amountOfTax").Получить("before") );
			
		КонецЕсли;
		
		СуммаОбщая = СтрокаОбъекта.Получить("costAfterTax");
		
		Если УКД Тогда
			
			СуммаОбщая = Число(СтрокаОбъекта.Получить("costAfterTax").Получить("after") );
			СуммаОбщаяДо = Число(СтрокаОбъекта.Получить("costAfterTax").Получить("before") );
			
		КонецЕсли;
		
		СтрокаТЧ = ТаблицаТоваров.Добавить();
		СтрокаТЧ.Наименование = СтрокаОбъекта.Получить("title");
		СтрокаТЧ.Содержание = СтрокаОбъекта.Получить("declaration");
		СтрокаТЧ.Количество = СтрокаОбъекта.Получить("count");
		
		Если УКД Тогда
			
			СтрокаТЧ.Количество = Число(СтрокаОбъекта.Получить("count").Получить("after") );
			СтрокаТЧ.КоличествоДоИзменения = Число(СтрокаОбъекта.Получить("count").Получить("before") );
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			
			Если СтрокаОбъекта.Получить("net") <> Неопределено Тогда
				СтрокаТЧ.Количество = Число(СтрокаОбъекта.Получить("net") );
			КонецЕсли;
			
		КонецЕсли;
		
		Если СтрокаОбъекта.Получить("placeCount") <> Неопределено Тогда
			СтрокаТЧ.КоличествоУпаковок = Число(СтрокаОбъекта.Получить("placeCount") );
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.КоличествоУпаковок) Тогда
			СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.Количество;
		КонецЕсли;
		
		СтрокаТЧ.Цена = СтрокаОбъекта.Получить("price");
		
		Если УКД Тогда
			
			СтрокаТЧ.Цена = Число(СтрокаОбъекта.Получить("price").Получить("after") );
			СтрокаТЧ.ЦенаДоИзменения = Число(СтрокаОбъекта.Получить("price").Получить("before") );
			
		КонецЕсли;
		
		СтрокаТЧ.СтавкаНДС = МОП_ПолучитьСтавкуНДСИзСтроки(СтрокаОбъекта.Получить("taxRate") );
		
		Если УКД Тогда
			
			СтрокаТЧ.СтавкаНДС = МОП_ПолучитьСтавкуНДСИзСтроки(СтрокаОбъекта.Получить("taxRate").Получить("after") );
			СтрокаТЧ.СтавкаНДСДоИзменения = МОП_ПолучитьСтавкуНДСИзСтроки(СтрокаОбъекта.Получить("taxRate").Получить("before") );
			
		КонецЕсли;
		
		
		СтрокаТЧ.Сумма = ?(МОП_НДСВСуммеПоСтавке(СтрокаТЧ.СтавкаНДС), СуммаОбщая, СуммаБезНДС);
		
		Если УКД Тогда
			СтрокаТЧ.СуммаДоИзменения = ?(МОП_НДСВСуммеПоСтавке(СтрокаТЧ.СтавкаНДС), СуммаОбщаяДо, СуммаБезНДСДо);	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
			СтрокаТЧ.Количество = СтрокаТЧ.Сумма / СтрокаТЧ.Цена; 	
		КонецЕсли;
		
		Если УКД И НЕ ЗначениеЗаполнено(СтрокаТЧ.КоличествоДоИзменения) Тогда
			СтрокаТЧ.КоличествоДоИзменения = СтрокаТЧ.СуммаДоИзменения / СтрокаТЧ.ЦенаДоИзменения; 	
		КонецЕсли;
		
		СтрокаТЧ.СуммаНДС = ?(ЗначениеЗаполнено(СуммаНДС), СуммаНДС, 0);
		
		Если УКД Тогда
			СтрокаТЧ.СуммаНДСДоИзменения = ?(ЗначениеЗаполнено(СуммаНДСДо), СуммаНДСДо, 0);
		КонецЕсли;
		
		ЕдиницаИзмерения = СтрокаОбъекта.Получить("measurement");
		
		Если ТипЗнч(ЕдиницаИзмерения) = Тип("Соответствие") Тогда
			ЕдиницаИзмерения = ЕдиницаИзмерения.Получить("id");
		КонецЕсли;
		
		СтрокаТЧ.ЕдиницаИзмерения = РС_ПолучитьЕдиницуИзмеренияПоИдентификатору(ЕдиницаИзмерения);
		
		Если УКД Тогда
			
			ЕдиницаИзмерения = СтрокаОбъекта.Получить("measurement").Получить("after");
			
			Если ТипЗнч(ЕдиницаИзмерения) = Тип("Соответствие") Тогда
				ЕдиницаИзмерения = ЕдиницаИзмерения.Получить("code");
			КонецЕсли;
			
			СтрокаТЧ.ЕдиницаИзмерения = РС_ПолучитьЕдиницуИзмеренияПоКоду(ЕдиницаИзмерения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаТоваров;

КонецФункции

Функция РС_СформироватьОбъектСчетНаОплату(ОбъектДанных, Подразделение)
	//Changelog
	//
	//17.01.2020 - добавлен фильтр опции "Не загружать счета на оплату"
	//19.02.2020 - реализовано создание одиночной номенклатуры "Услуги от поставщиков" при включенной опции "Загрузка номенклатуры как услуга"
	//			   Блок работы со статьями затрат перенесен в общий модуль
	
	МассивОбъектов = Новый Массив;
	ДокОбъект = МОП_СоздатьВходящийСчетНаОплату();
	
	Если ДокОбъект = Неопределено ИЛИ НеЗагружатьСчетаНаОплату Тогда
		Возврат МассивОбъектов;
	КонецЕсли;
	
	МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
	МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектДанных);    
	МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьБанковскиеСчета(ДокОбъект, ОбъектДанных);
	
	СуммаВключаетНДС = Ложь;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Товары") Тогда
		
		ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		СтруктураТЧ = ДокОбъект.Товары.Выгрузить();
		
		ПодразделениеСЗатратами = ПодразделениеЗатрат;
		
		//==Специфический блок кода
		Если ВеткаРазработки = "РосМарк" Тогда
			
			ЗаданиеНаПеревозку = РосМарк_ПоискЗаданияНаПеревозку(ОбъектДанных.Номер);
			
			Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
				
				Ответственный = ЗаданиеНаПеревозку.Ответственный;
				ДокОбъект.Менеджер = Ответственный;
				ПодразделениеСЗатратами = Ответственный.Подразделение;
				
			КонецЕсли;
			
		КонецЕсли;
		//==Специфический блок кода
		
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Товары.Добавить();
			
			Если СтруктураТЧ.Колонки.Найти("Содержание") <> Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(НовыйТовар, Товар,,"Содержание");
				НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
				НовыйТовар.Содержание = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
				
			Иначе
				
				ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
				НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
				
				Если НовыйТовар.Номенклатура.Пустая() Тогда
					
					Если ЗагрузкаНоменклатурыКакУслуга Тогда
						
						НовыйТовар.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Услуги от поставщиков", Истина);
						
						Если НовыйТовар.Номенклатура.Пустая() Тогда
							НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар, "Услуги от поставщиков");
						КонецЕсли;
						
					Иначе
						НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтруктураТЧ.Колонки.Найти("КоличествоУпаковок") <> Неопределено Тогда
				НовыйТовар.КоличествоУпаковок = Товар.Количество;
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Товар.СтавкаНДС) И СтруктураТЧ.Колонки.Найти("СтавкаНДС") <> Неопределено  Тогда
				НовыйТовар.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
			КонецЕсли;
			
			Если СтруктураТЧ.Колонки.Найти("СуммаСНДС") <> Неопределено Тогда
				НовыйТовар.СуммаСНДС = Товар.Сумма + ?(ЗначениеЗаполнено(Товар.СуммаНДС), Товар.СуммаНДС, 0);
			КонецЕсли;
			
			Если МОП_ЭтоУслуга(НовыйТовар.Номенклатура)
				И ЗначениеЗаполнено(ПодразделениеСЗатратами) 
				И СтруктураТЧ.Колонки.Найти("Подразделение") <> Неопределено
				И СтруктураТЧ.Колонки.Найти("СписатьНаРасходы") <> Неопределено
				Тогда
				
				НовыйТовар.Подразделение = ПодразделениеСЗатратами;
				НовыйТовар.СписатьНаРасходы = Истина;
				НовыйТовар.СтатьяРасходов = РС_ПолучитьСтатьюРасходов(Подразделение, НовыйТовар.Номенклатура);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Запасы") Тогда
		
		ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар,,"Содержание");
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			НовыйТовар.Содержание = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, СуммаВключаетНДС, "Счет на оплату");	
	
	МассивОбъектов.Добавить(ДокОбъект);	
	
	Возврат МассивОбъектов;

КонецФункции

Функция РС_СформироватьОбъектАктВыполненныхРабот(ОбъектДанных, Подразделение, УПД = Ложь, ИскатьНакладнуюАкт = Ложь)
	//Changelog
	//
	//17.01.2020 - добавлены специфичный блоки РосМарк
	//19.02.2020 - выведены в общую редакцию работа со статьями расходов
	
	МассивОбъектов = Новый Массив;
	
	Если ИскатьНакладнуюАкт Тогда
		ДокОбъект = КЗП_НайтиОснованиеСчетФактурыПоставщика(ОбъектДанных.Номер, КНП_ПривестиКДате(ОбъектДанных.Дата), Подразделение);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокОбъект) Тогда
		ДокОбъект = МОП_СоздатьВходящийАкт();
	КонецЕсли;
	
	Если ДокОбъект = Неопределено Тогда
		Возврат МассивОбъектов;
	КонецЕсли;
	
	МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
	МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных);	
	МОП_ЗаполнитьСпособЗачетаАвансов(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьБанковскиеСчета(ДокОбъект, ОбъектДанных);
	
	СуммаВключаетНДС = Ложь;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Услуги") Тогда
		
		ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Услуги.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар,,"Содержание");
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			НовыйТовар.Содержание = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Расходы") Тогда
		
		СтруктураТЧ = ДокОбъект.Расходы.Выгрузить();
		
		ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		ПодразделениеСЗатратами = ПодразделениеЗатрат;
		
		//==Специфический блок кода
		Если ВеткаРазработки = "РосМарк" Тогда
			
			ЗаказПоставщику = РосМарк_ПоискЗаказаПоставщику(ОбъектДанных.Номер);
			
			Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
				
				Если ЗаказПоставщику.СуммаДокумента <> ТаблицаТоваров.Итог("СуммаСНДС") Тогда
					Возврат "Ошибка создания приходной накладной: несоответствие суммы в документе и в заказе №" + ЗаказПоставщику.Номер;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаданиеНаПеревозку = РосМарк_ПоискЗаданияНаПеревозку(ОбъектДанных.Номер);
			
			Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
				
				Ответственный = ЗаданиеНаПеревозку.Ответственный;
				ДокОбъект.Менеджер = Ответственный;
				ПодразделениеСЗатратами = Ответственный.Подразделение;
				
			КонецЕсли;
			
		КонецЕсли;
		//==Специфический блок кода
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Расходы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар,,"Содержание");
			НовыйТовар.Содержание = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
			
			Если ЗначениеЗаполнено(ПодразделениеСЗатратами) 
				И СтруктураТЧ.Колонки.Найти("Подразделение") <> Неопределено
				И СтруктураТЧ.Колонки.Найти("СтатьяРасходов") <> Неопределено
				Тогда
				
				НовыйТовар.Подразделение = ПодразделениеСЗатратами;
				НовыйТовар.СтатьяРасходов = РС_ПолучитьСтатьюРасходов(Подразделение, НовыйТовар.Содержание);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "УслугиИРаботы") Тогда
		
		ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.УслугиИРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар,, "Содержание");
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			НовыйТовар.Содержание = ?(ЗначениеЗаполнено(Товар.Содержание), Товар.Содержание, Товар.Наименование);
			
		КонецЦикла;
		
	КонецЕсли;
	
	МОП_ЗаполнитьВидОперации(ДокОбъект, ОбъектДанных);
	КЗП_ЗаполнитьДопПараметрыДокумента(ДокОбъект, "Акт");
	МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, СуммаВключаетНДС, "Акт сдачи \ приема");	
	
	МассивОбъектов.Добавить(ДокОбъект);
	
	Если УПД Тогда
		
		ДокОбъект.Записать();
		
		Попытка
			
			ДокСФ =РС_СформироватьСФПолученную(ДокОбъект.Ссылка);
			
			Если ДокСФ <> Неопределено Тогда
				МассивОбъектов.Добавить(ДокСФ);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "РС_СформироватьОбъектАктВыполненныхРабот");	
		КонецПопытки
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция РС_СформироватьОбъектНакладная(ОбъектДанных, Подразделение, УПД = Ложь, ИскатьНакладнуюАкт = Ложь)
	//Changelog
	//
	//17.01.2020 - добавлены специфичный блоки кода РосМарк
	//19.02.2020 - выведены в общую редакцию заполнение статей расходов
	
	МассивОбъектов = Новый Массив;
	ДокОбъект = Неопределено;
	
	Если ИскатьНакладнуюАкт Тогда
		ДокОбъект = КЗП_НайтиОснованиеСчетФактурыПоставщика(ОбъектДанных.Номер, КНП_ПривестиКДате(ОбъектДанных.Дата), Подразделение);	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокОбъект) Тогда
		ДокОбъект = МОП_СоздатьВходящийНакладная();
	КонецЕсли;
	
	Если ДокОбъект = Неопределено Тогда
		Возврат МассивОбъектов;
	КонецЕсли;
	
	МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
	МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных);	
	МОП_ЗаполнитьСпособЗачетаАвансов(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьБанковскиеСчета(ДокОбъект, ОбъектДанных);
	
	СуммаВключаетНДС = Ложь;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Товары") Тогда
		
		СтруктураТЧ = ДокОбъект.Товары.Выгрузить();
		
		СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(ДокОбъект.Товары);
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("goods") );
		Иначе
			ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		КонецЕсли;
		
		ПодразделениеСЗатратами = ПодразделениеЗатрат;
		
		//==Специфический блок кода
		Если ВеткаРазработки = "РосМарк" Тогда
			
			ЗаказПоставщику = РосМарк_ПоискЗаказаПоставщику(ОбъектДанных.Номер);
			
			Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
				
				Если ЗаказПоставщику.СуммаДокумента <> ТаблицаТоваров.Итог("СуммаСНДС") Тогда
					Возврат "Ошибка создания приходной накладной: несоответствие суммы в документе и в заказе №" + ЗаказПоставщику.Номер;
				КонецЕсли;
				
			КонецЕсли;
			
			ЗаданиеНаПеревозку = РосМарк_ПоискЗаданияНаПеревозку(ОбъектДанных.Номер);
			
			Если ЗначениеЗаполнено(ЗаданиеНаПеревозку) Тогда
				
				Ответственный = ЗаданиеНаПеревозку.Ответственный;
				ДокОбъект.Менеджер = Ответственный;
				ПодразделениеСЗатратами = Ответственный.Подразделение;
				
			КонецЕсли;
			
		КонецЕсли;
		//==Специфический блок кода
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			
			Если НовыйТовар.Количество = 0 Тогда
				НовыйТовар.Количество = 1;
			КонецЕсли;
			
			Если НовыйТовар.Номенклатура.Пустая() Тогда
				НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("КоличествоУпаковок") Тогда
				НовыйТовар.КоличествоУпаковок = НовыйТовар.Количество;
			КонецЕсли;
			
			Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
				
				Если НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
					НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
				КонецЕсли;
				
			КонецЕсли;
			
			Если МОП_ЭтоУслуга(НовыйТовар.Номенклатура)
				И ЗначениеЗаполнено(ПодразделениеСЗатратами) 
				И СтруктураТЧ.Колонки.Найти("Подразделение") <> Неопределено
				И СтруктураТЧ.Колонки.Найти("СписатьНаРасходы") <> Неопределено
				Тогда
				
				НовыйТовар.Подразделение = ПодразделениеСЗатратами;
				НовыйТовар.СписатьНаРасходы = Истина;
				НовыйТовар.СтатьяРасходов = РС_ПолучитьСтатьюРасходов(Подразделение, НовыйТовар.Номенклатура);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Материалы") Тогда
		
		СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(ДокОбъект.Материалы);
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("goods") );
		Иначе
			ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		КонецЕсли;
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Материалы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			НовыйТовар.КоличествоМест = Товар.Количество;
			
			Если НовыйТовар.Количество = 0 Тогда
				НовыйТовар.Количество = 1;
			КонецЕсли;
			
			Если НовыйТовар.КоличествоМест = 0 Тогда
				НовыйТовар.КоличествоМест = 1;
			КонецЕсли; 
			
			Если НовыйТовар.Номенклатура.Пустая() Тогда
				НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("КоличествоУпаковок") Тогда
				НовыйТовар.КоличествоУпаковок = НовыйТовар.Количество;
			КонецЕсли;
			
			Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
				
				Если НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
					НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
				КонецЕсли;
				
			КонецЕсли;
			
			Если НовыйТовар.ЦенаОприходования = 0 Тогда
				НовыйТовар.ЦенаОприходования = Товар.Цена;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Запасы") Тогда
		
		СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(ДокОбъект.Запасы);
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("goods") );
		Иначе
			ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
		КонецЕсли;
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			
			Если НовыйТовар.Количество = 0 Тогда
				НовыйТовар.Количество = 1;
			КонецЕсли;
			
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			
			Если НовыйТовар.Номенклатура.Пустая() Тогда
				НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
			Если СтруктураКолонок.Свойство("КоличествоУпаковок") Тогда
				НовыйТовар.КоличествоУпаковок = НовыйТовар.Количество;
			КонецЕсли;
			
			Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
				
				Если НовыйТовар.ЕдиницаИзмерения = Неопределено ИЛИ НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
					
					Если ТипЗнч(Товар.ЕдиницаИзмерения) = Тип("Строка") Тогда
						НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения);	
					Иначе
						НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	МОП_ЗаполнитьВидОперации(ДокОбъект, ОбъектДанных);
	КЗП_ЗаполнитьДопПараметрыДокумента(ДокОбъект, "Накладная");
	МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, СуммаВключаетНДС, "Накладная");
	
	МассивОбъектов.Добавить(ДокОбъект);
	
	Если УПД Тогда
		
		ДокОбъект.Записать();
		
		Попытка
			
			ДокСФ =РС_СформироватьСФПолученную(ДокОбъект.Ссылка);
			
			Если ДокСФ <> Неопределено Тогда
				МассивОбъектов.Добавить(ДокСФ);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "СформироватьОбъектКорректировка");	
		КонецПопытки
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция РС_СформироватьСФПолученную(ДокументСсылка)
	
	Если КНП_ЕстьРеквизит(ДокументСсылка, "ПредъявленСчетФактура") Тогда
		
		Если ДокументСсылка.ПредъявленСчетФактура Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = Неопределено;
	
	Попытка 
		Результат = Документы.СчетФактураПолученный.СоздатьДокументНаОсновании(ДокументСсылка, ДокументСсылка.НомерВходящегоДокумента, ДокументСсылка.ДатаВходящегоДокумента);
	Исключение 
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат = Неопределено Тогда
		
		Попытка
			
			СчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
			ЗаполнитьЗначенияСвойств(СчетФактура, ДокументСсылка);
			
			Если КНП_ЕстьТабЧасть(СчетФактура, "ДокументыОснования") Тогда
				
				Основание = СчетФактура.ДокументыОснования.Добавить();
				Основание.ДокументОснование = ДокументСсылка;
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(СчетФактура, "ДокументОснование") Тогда
				СчетФактура.ДокументОснование = ДокументСсылка;
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ДокументСсылка, "ДатаВходящегоДокумента") Тогда
				
				Если ЗначениеЗаполнено(ДокументСсылка.ДатаВходящегоДокумента) Тогда
					
					СчетФактура.Дата = ДокументСсылка.ДатаВходящегоДокумента;
					
					Если КНП_ЕстьРеквизит(СчетФактура, "ДатаСоставления") Тогда
						СчетФактура.ДатаСоставления = ДокументСсылка.ДатаВходящегоДокумента;
					КонецЕсли;
					
				Иначе
					
					СчетФактура.Дата = ДокументСсылка.Дата;
					
					Если КНП_ЕстьРеквизит(СчетФактура, "ДатаСоставления") Тогда
						СчетФактура.ДатаСоставления = ДокументСсылка.Дата;	
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли КНП_ЕстьРеквизит(ДокументСсылка, "ДатаПервичногоДокумента") Тогда
				
				Если ЗначениеЗаполнено(ДокументСсылка.ДатаПервичногоДокумента) Тогда
					
					СчетФактура.Дата = ДокументСсылка.ДатаПервичногоДокумента;
					
					Если КНП_ЕстьРеквизит(СчетФактура, "ДатаСоставления") Тогда
						СчетФактура.ДатаСоставления = ДокументСсылка.ДатаПервичногоДокумента;
					КонецЕсли;
					
				Иначе
					
					СчетФактура.Дата = ДокументСсылка.Дата;
					
					Если КНП_ЕстьРеквизит(СчетФактура, "ДатаСоставления") Тогда
						СчетФактура.ДатаСоставления = ДокументСсылка.Дата;	
					КонецЕсли;
					
				КонецЕсли;	
				
			Иначе
				
				СчетФактура.Дата = ДокументСсылка.Дата;
				
				Если КНП_ЕстьРеквизит(СчетФактура, "ДатаСоставления") Тогда
					СчетФактура.ДатаСоставления = ДокументСсылка.Дата;	
				КонецЕсли;
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(ДокументСсылка, "НомерВходящегоДокумента") Тогда
				
				Если ЗначениеЗаполнено(ДокументСсылка.НомерВходящегоДокумента) Тогда
					СчетФактура.Номер = ДокументСсылка.НомерВходящегоДокумента;	
				Иначе
					СчетФактура.Номер = ДокументСсылка.Номер;
				КонецЕсли;
				
			ИначеЕсли КНП_ЕстьРеквизит(ДокументСсылка, "НомерПервичногоДокумента") Тогда
				
				Если ЗначениеЗаполнено(ДокументСсылка.НомерПервичногоДокумента) Тогда
					СчетФактура.Номер = ДокументСсылка.НомерПервичногоДокумента;	
				Иначе
					СчетФактура.Номер = ДокументСсылка.Номер;
				КонецЕсли;
				
			Иначе
				СчетФактура.Номер = ДокументСсылка.Номер;
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(СчетФактура, "НомерВходящегоДокумента") Тогда
				
				СчетФактура.НомерВходящегоДокумента = СчетФактура.Номер;
				СчетФактура.УстановитьНовыйНомер(СчетФактура.Организация.Префикс);
				
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(СчетФактура, "НомерПервичногоДокумента") Тогда
				
				СчетФактура.НомерПервичногоДокумента = СчетФактура.Номер;
				СчетФактура.УстановитьНовыйНомер(СчетФактура.Организация.Префикс);
				
			КонецЕсли;
			
			СчетФактура.Записать(РежимЗаписиДокумента.Запись);
			Результат = СчетФактура;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "КЗП_СформироватьСФПолученную");
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция РС_СформироватьСФПолученнуюБезНакладной(ОбъектДанных, Подразделение)
	
	МассивОбъектов = Новый Массив;
	
	Попытка
		
		ДокОбъект = Документы.СчетФактураПолученный.СоздатьДокумент();
		МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
		МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
		МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектДанных);
		МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных);	
		МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, Ложь, "Счет фактура");
		
		Если КНП_ЕстьТабЧасть(ДокОбъект, "СоставНФА") Тогда
			
			СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(ДокОбъект.СоставНФА);
			
			Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
				ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("goods") );
			Иначе
				ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
			КонецЕсли;
			
			Для Каждого Товар Из ТаблицаТоваров Цикл
				
				НовыйТовар = ДокОбъект.СоставНФА.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
				НовыйТовар.НФА = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
				
				Если НовыйТовар.Количество = 0 Тогда
					НовыйТовар.Количество = 1;
				КонецЕсли;
				
				Если НовыйТовар.НФА.Пустая() Тогда
					НовыйТовар.НФА = КЗП_СоздатьНовуюНоменклатуру(Товар);
				КонецЕсли;
				
				Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
					СуммаВключаетНДС = Истина;
				КонецЕсли;
				
				Если СтруктураКолонок.Свойство("КоличествоУпаковок") Тогда
					НовыйТовар.КоличествоУпаковок = НовыйТовар.Количество;
				КонецЕсли;
				
				Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
					
					Если НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
						НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		МассивОбъектов.Добавить(ДокОбъект);
		
	Исключение
		ДобавитьВЖурнал(ОписаниеОшибки(), "РС_СформироватьСФПолученнуюБезНакладной");
	КонецПопытки;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция РС_СформироватьКСФПолученную(ОбъектДанных, Подразделение)
	
	МассивОбъектов = Новый Массив;
	
	Попытка
		
		ДокОбъект = Документы.КорректировочныйСчетФактураПолученный.СоздатьДокумент();
		МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
		МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
		МОП_ЗаполнитьДоговор(ДокОбъект, ОбъектДанных);
		МОП_ЗаполнитьВалюту(ДокОбъект, ОбъектДанных);	
		МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ОбъектДанных, Ложь, "Счет фактура");
		
		Если КНП_ЕстьТабЧасть(ДокОбъект, "СоставНФА") Тогда
			
			СтруктураКолонок = КНП_СтруктураНаОснованииКолонокТЧ(ДокОбъект.СоставНФА);
			
			Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
				ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("goods") );
			Иначе
				ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
			КонецЕсли;
			
			Для Каждого Товар Из ТаблицаТоваров Цикл
				
				НовыйТовар = ДокОбъект.СоставНФА.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
				НовыйТовар.НФА = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
				
				Если НовыйТовар.Количество = 0 Тогда
					НовыйТовар.Количество = 1;
				КонецЕсли;
				
				Если НовыйТовар.НФА.Пустая() Тогда
					НовыйТовар.НФА = КЗП_СоздатьНовуюНоменклатуру(Товар);
				КонецЕсли;
				
				Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
					СуммаВключаетНДС = Истина;
				КонецЕсли;
				
				Если СтруктураКолонок.Свойство("КоличествоУпаковок") Тогда
					НовыйТовар.КоличествоУпаковок = НовыйТовар.Количество;
				КонецЕсли;
				
				Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
					
					Если НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
						НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		МассивОбъектов.Добавить(ДокОбъект);
		
	Исключение
		ДобавитьВЖурнал(ОписаниеОшибки(), "РС_СформироватьКСФПолученную");
	КонецПопытки;
	
	Возврат МассивОбъектов;	

КонецФункции

Функция РС_СформироватьОбъектКорректировка(ОбъектДанных, Подразделение, УПД = Ложь)
	
	МассивОбъектов = Новый Массив;
	
	Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
		
		ДанныеДокумента = ОбъектДанных.Получить("invoiceCorrection");
		ДанныеИсправляемогоДокумента = ДанныеДокумента.Получить("invoice");
		
	Иначе
		
		ДанныеДокумента = ОбъектДанных;
		ДанныеИсправляемогоДокумента = ОбъектДанных;
		
	КонецЕсли;
	
	ДокОбъект = МОП_СоздатьВходящийКорректировка();
	
	Если ДокОбъект = Неопределено Тогда
		Возврат МассивОбъектов;
	КонецЕсли;
	
	ЭтоИсправление = Ложь; 
	МОП_ЗаполнитьОрганизацию(ДокОбъект, ОбъектДанных);
	МОП_ЗаполнитьКонтрагентаПартнера(ДокОбъект, Подразделение, ОбъектДанных);
	МОП_ЗаполнитьДоговор(ДокОбъект, ДанныеДокумента);
	МОП_ЗаполнитьВалюту(ДокОбъект, ДанныеДокумента);	
	МОП_ЗаполнитьДокументыОснования(ДокОбъект, ДанныеИсправляемогоДокумента, ЭтоИсправление);	
	СуммаВключаетНДС = Ложь;	
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Товары") Тогда
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("table") );
		Иначе
			ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть, ОбъектДанных);	
		КонецЕсли;
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			НовыйТовар = ДокОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			
			Если НовыйТовар.Номенклатура.Пустая() Тогда
				НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
			КонецЕсли;
			
			Если МОП_НДСВСуммеПоСтавке(Товар.СтавкаНДС) Тогда
				СуммаВключаетНДС = Истина;
			КонецЕсли;
			
			Если КНП_ЕстьОбъектМетаданных("ЕдиницыИзмерения") Тогда
				
				Если НовыйТовар.ЕдиницаИзмерения.Пустая() Тогда
					НовыйТовар.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоНаименованию(Товар.ЕдиницаИзмерения.Наименование);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если КНП_ЕстьТабЧасть(ДокОбъект, "Расхождения") Тогда
		
		Если ТипЗнч(ОбъектДанных) = Тип("Соответствие") Тогда
			ТаблицаТоваров = РС_ПрочитатьТаблицуТоваров(ОбъектДанных.Получить("table") );
		Иначе
			ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть, ОбъектДанных);	
		КонецЕсли;
		
		Для Каждого Товар Из ТаблицаТоваров Цикл
			
			Если НЕ РС_ЕстьРасхождения(Товар) Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйТовар = ДокОбъект.Расхождения.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйТовар, Товар);
			НовыйТовар.Номенклатура = РС_НайтиНоменклатуру(Товар.Наименование, Подразделение);
			
			Если НовыйТовар.Номенклатура.Пустая() Тогда
				НовыйТовар.Номенклатура = КЗП_СоздатьНовуюНоменклатуру(Товар);
			КонецЕсли;
			
			НовыйТовар.Количество = Товар.КоличествоДоИзменения;
			НовыйТовар.Цена = Товар.ЦенаДоИзменения;
			НовыйТовар.Сумма = Товар.СуммаДоИзменения;
			НовыйТовар.СуммаНДС = Товар.СуммаНДСДоИзменения;
			НовыйТовар.СтавкаНДС = Товар.СтавкаНДСДоИзменения;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КЗП_ЗаполнитьДопПараметрыДокумента(ДокОбъект, "Корректировка");
	МОП_ЗаполнитьРеквизитыДокумента(ДокОбъект, ДанныеДокумента, СуммаВключаетНДС, "Корректировка накладной");
	
	МассивОбъектов.Добавить(ДокОбъект);	
	
	Если УПД Тогда
		
		ДокОбъект.Записать();
		
		Попытка
			
			ДокСФ = РС_СформироватьСФПолученную(ДокОбъект.Ссылка);
			
			Если ДокСФ <> Неопределено Тогда
				МассивОбъектов.Добавить(ДокСФ);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал(ОписаниеОшибки(), "СформироватьОбъектКорректировка");	
		КонецПопытки
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции

Функция РС_ОбработатьТЧСтруктурыПФ(Знач ТабличнаяЧасть, СсылкаНаДок = Неопределено)
	
	Для Каждого СтрокаТЧ Из ТабличнаяЧасть Цикл
		
		Если ТабличнаяЧасть.Колонки.Найти("ЕдиницаИзмерения") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.ЕдиницаИзмерения) = Тип("Строка") Тогда
				
				ЕдиницаИзмеренияТовара = СправочникЕдиницыИзмерения.Найти(СтрокаТЧ.ЕдиницаИзмерения, "Название");
				
				Если ЗначениеЗаполнено(ЕдиницаИзмеренияТовара) Тогда
					СтрокаТЧ.ЕдиницаИзмерения = ЕдиницаИзмеренияТовара.Ссылка;
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("ЕдиницаИзмеренияКодДо") <> Неопределено Тогда
			
			Если СтрокаТЧ.ЕдиницаИзмеренияКод <> СтрокаТЧ.ЕдиницаИзмеренияКодДо Тогда
				ВывестиУведомлениеПользователю("Внимание! В корректировочном документе " + СсылкаНаДок.Номер +
				" от " + СсылкаНаДок.Дата + " отличаются единицы измерения до и после. 
				| После создания документа необходима ручная проверка");
			КонецЕсли;
			
		КонецЕсли;
		
		
		Если ТабличнаяЧасть.Колонки.Найти("СтавкаНДС") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.СтавкаНДС) = Тип("Строка") Тогда
				СтрокаТЧ.СтавкаНДС = МОП_ПолучитьСтавкуНДСИзСтроки(СтрокаТЧ.СтавкаНДС);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("Сумма") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.Сумма) = Тип("Строка") И КНП_ЭтоЧисло(СтрокаТЧ.Сумма, Истина) Тогда
				СтрокаТЧ.Сумма = Число(СтрокаТЧ.Сумма);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("СуммаНДС") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.СуммаНДС) = Тип("Строка") И КНП_ЭтоЧисло(СтрокаТЧ.СуммаНДС, Истина) Тогда
				СтрокаТЧ.СуммаНДС = Число(СтрокаТЧ.СуммаНДС);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("СуммаСНДС") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.СуммаСНДС) = Тип("Строка") И КНП_ЭтоЧисло(СтрокаТЧ.СуммаСНДС, Истина) Тогда
				СтрокаТЧ.СуммаСНДС = Число(СтрокаТЧ.СуммаСНДС);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("СтавкаНДСДоИзменения") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.СтавкаНДСДоИзменения) = Тип("Строка") Тогда
				СтрокаТЧ.СтавкаНДСДоИзменения = МОП_ПолучитьСтавкуНДСИзСтроки(СтрокаТЧ.СтавкаНДСДоИзменения);	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("Описание") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.Описание) = Тип("Структура") Тогда
				СтрокаТЧ.Описание = КНП_БезопасноПрочитатьЗначение(СтрокаТЧ.Описание, "Значение");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ТабличнаяЧасть.Колонки.Найти("Содержание") <> Неопределено Тогда
			
			Если ТипЗнч(СтрокаТЧ.Содержание) = Тип("Структура") Тогда
				СтрокаТЧ.Содержание = КНП_БезопасноПрочитатьЗначение(СтрокаТЧ.Содержание, "Значение");
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабличнаяЧасть;

КонецФункции

Функция ПолучитьПартнеровИКонтрагентовДляОтправкиИсходящихСообщений()
	
	Запрос = Новый Запрос;    
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВТ_Контрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.DS_Подразделение_ID > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ ВТ_ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.DS_Подразделение_ID > 0";
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	СтруктураВозврата = Новый Структура("СписокКонтрагентов, СписокДоговоров", Неопределено, Неопределено);
	
	СтруктураВозврата.СписокКонтрагентов = Пакет[0].Выгрузить().ВыгрузитьКолонку("Контрагент");
	СтруктураВозврата.СписокДоговоров = Пакет[1].Выгрузить().ВыгрузитьКолонку("Договор");
	
	Возврат СтруктураВозврата;
	
КонецФУнкции

// Функция - Получить документы
//
// Параметры:
//  ОтборПоВиду			 - Строка	 - Отбор по виду документа. Разрешенные значения:
//										*Счет на оплату
//										*Торг-12
//										*Счет-фактура
//										*Акт сдачи-приема
//  ОтборПоКонтрагенту	 - СправочникСсылка.Контрагенты	 - Ссылка на контрагента, по которому осуществить отбор 
//  ДатаНачала			 - Дата	 - Дата начала отбора. Отбор по дате документа
//  ДатаКонца			 - Дата	 - Дата конца отбора. Отбор по дате документа
//  ОтборОтправленные	 - Булево	 - Если Истина - то выгружаются документы с заполненным идентификатором
//  Комментарий			 - Строка	 - Отбор по комментарию документа через ПОДОБНО.
// 
// Возвращаемое значение:
// ТаблицаЗначений  - Заполненная таблица значений по структуре "Исходящие данные"
//
Функция РС_ПолучитьДокументы(ОтборПоВиду = "", 
	ОтборПоКонтрагенту = Неопределено, 
	ДатаНачала = Неопределено, 
	ДатаКонца = Неопределено, 
	ОтборОтправленные = Ложь, 
	Комментарий = "", 
	УПД = Ложь)
	
	ТаблицаДанных = ИсходящиеДокументы.Выгрузить();
	ТаблицаДанных.Очистить();
	
	ВалютаРубли = МОП_ПолучитьВалютуПоКоду("643"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = КЗП_ПолучитьТекстЗапросаИсходящиеДокументы(ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаКонца), 
	ОтборОтправленные, 
	ЗначениеЗаполнено(Комментарий));
	
	Запрос.УстановитьПараметр("Свойство", МОП_ПолучитьРеквизит("DS_Документ_ID") );
	
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ДатаКонца) Тогда
		Запрос.УстановитьПараметр("ДатаКонца", КонецДня(ДатаКонца) );
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Комментарий", "%" + Комментарий + "%");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Валюта", ВалютаРубли);  
	
	СписокДоговоров = Новый Массив;
	СписокКонтрагентов = Новый Массив;
	
	//РС_УстановитьОтборПоКонтрагентам(СписокКонтрагентов);
	
	Если ЗначениеЗаполнено(ОтборПоКонтрагенту) Тогда
		
		Если ТипЗнч(ОтборПоКонтрагенту) = Тип("Массив") Тогда
			
			Для каждого ЭлементОтбора Из ОтборПоКонтрагенту Цикл
				
				Если ТипЗнч(ЭлементОтбора) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
					СписокДоговоров.Добавить(ЭлементОтбора);
				ИначеЕсли ТипЗнч(ЭлементОтбора) = Тип("СправочникСсылка.Контрагенты") Тогда
					
					СписокКонтрагентов.Добавить(ЭлементОтбора);	
					
					ВыборкаДоговоров = Справочники.ДоговорыКонтрагентов.Выбрать(,ЭлементОтбора);  
					
					Пока ВыборкаДоговоров.Следующий() Цикл
						
						Если ВыборкаДоговоров.DS_Подразделение_ID > 0 Тогда
							СписокДоговоров.Добавить(ВыборкаДоговоров.Ссылка);	
						КонецЕсли;							
						
					КонецЦикла;
					
				КонецЕсли;	
				
			КонецЦикла;	
			
		Иначе
			
			Если ТипЗнч(ОтборПоКонтрагенту) = Тип("СправочникСсылка.Контрагенты") Тогда
				
				СписокКонтрагентов.Добавить(ОтборПоКонтрагенту);  
				
				ВыборкаДоговоров = Справочники.ДоговорыКонтрагентов.Выбрать(,ОтборПоКонтрагенту);  
				
				Пока ВыборкаДоговоров.Следующий() Цикл
					Если ВыборкаДоговоров.DS_Подразделение_ID > 0 Тогда
						
						СписокДоговоров.Добавить(ВыборкаДоговоров.Ссылка);	
					КонецЕсли;							
					
				КонецЦикла;
				
			Иначе
				СписокДоговоров.Добавить(ОтборПоКонтрагенту);	
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Рез = ПолучитьПартнеровИКонтрагентовДляОтправкиИсходящихСообщений();
		
		СписокКонтрагентов = Рез.СписокКонтрагентов; 
		СписокДоговоров = Рез.СписокДоговоров;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Контрагент", СписокКонтрагентов);
	Запрос.УстановитьПараметр("Договор", СписокДоговоров);
	
	Попытка
		
		ТаблицаСведений = Запрос.Выполнить().Выгрузить();
		
		Для Каждого СтрокаТС Из ТаблицаСведений Цикл
			
			//Корректировка "на лету"
			Если КНП_ЕстьТабЧасть(СтрокаТС.Ссылка,"Услуги")	И СтрокаТС.Тип <> "Корректировка реализации" Тогда
				
				Если КНП_ЕстьТабЧасть(СтрокаТС.Ссылка, "Товары") И КНП_ЕстьТабЧасть(СтрокаТС.Ссылка, "Услуги") Тогда
					
					Если СтрокаТС.Ссылка.Услуги.Количество() > 0 И СтрокаТС.Ссылка.Товары.Количество() = 0 Тогда
						СтрокаТС.Тип = "Акт сдачи-приема";
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЭтоАванс = Ложь;
			ДокументУПД = Ложь;
			
			//Отбор по признаку УПД \ не УПД
			Если УПД Тогда
				
				Если СтрокаТС.Тип = "Торг-12" ИЛИ СтрокаТС.Тип = "Акт сдачи-приема" ИЛИ Найти(СтрокаТС.Тип, "Корректир") Тогда
					
					Если Не ЗначениеЗаполнено(СтрокаТС.СФ) Тогда
						Продолжить;
					КонецЕсли;
					
					Если СтрокаТС.Тип = "Торг-12" ИЛИ СтрокаТС.Тип = "Акт сдачи-приема" Тогда
						
						СтрокаТС.Тип = "Универсальный передаточный документ";
						ДокументУПД = Истина;
						
					ИначеЕсли СтрокаТС.Тип = "Корректировка реализации" Тогда
						
						СтрокаТС.Тип = "Универсальный корректировочный документ";
						ДокументУПД = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаТС.Тип = "Счет-фактура" Тогда
					
					Если МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СтрокаТС.Ссылка) ) Тогда
						
						СтрокаТС.Тип = "Универсальный корректировочный документ";
						ДокументУПД = Истина;
						
					Иначе
						
						СтрокаТС.Тип = "Универсальный передаточный документ";
						ДокументУПД = Истина;
						
					КонецЕсли;
					
					Если МОП_ЭтоСчетФактураНаАванс(СтрокаТС.Ссылка) Тогда
						
						ЭтоАванс = Истина;
						ДокументУПД = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если СтрокаТС.Тип = "Счет-фактура" И МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СтрокаТС.Ссылка) ) Тогда
					
					СтрокаТС.Тип = "Корректировочная Счет-фактура";
					ДокументУПД = Истина;
					
				ИначеЕсли СтрокаТС.Тип = "Счет-фактура" И МОП_ЭтоСчетФактураНаАванс(СтрокаТС.Ссылка) Тогда
					
					ЭтоАванс = Истина; 
					ДокументУПД = Истина;
					
				КонецЕсли;
				
			КонецЕсли;
			
			//Отбор по виду значения
			Если ЗначениеЗаполнено(ОтборПоВиду) Тогда
				
				Если ОтборПоВиду <> СокрЛП(СтрокаТС.Тип) Тогда
					
					Если Найти(ОтборПоВиду, "УПД / СЧФ (") И ДокументУПД Тогда
						
						Если ЭтоАванс И НЕ Найти(ОтборПоВиду, "аванс") Тогда
							Продолжить;
						ИначеЕсли НЕ ЭтоАванс И НЕ Найти(ОтборПоВиду, "оплат") Тогда
							Продолжить;
						КонецЕсли;
						
					Иначе 
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			
			НоваяСтрокаТД = ТаблицаДанных.Добавить();
			НоваяСтрокаТД.ОписаниеОшибки = "";
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТД, СтрокаТС);
			НоваяСтрокаТД.УПД = УПД;
			
			Если НЕ КНП_ВДокументеКорректныеСтавки(НоваяСтрокаТД.Ссылка) Тогда
				НоваяСтрокаТД.ОписаниеОшибки = НоваяСтрокаТД.ОписаниеОшибки 
				+ "Внимание! В документе признак НДС в сумме не соответствует указанным ставкам НДС! 
				|Пожалуйста, проверьте корректность указания ставок и признака включения НДС в сумму документа" + Символы.ПС;
			КонецЕсли;
			
			НоваяСтрокаТД.Валюта = "руб.";
			
			Если КНП_ЕстьРеквизит(НоваяСтрокаТД.Ссылка, "Валюта") Тогда
				НоваяСтрокаТД.Валюта = НоваяСтрокаТД.Ссылка.Валюта.Наименование;
			КонецЕсли;
			
			Если КНП_ЕстьРеквизит(НоваяСтрокаТД.Ссылка, "ВалютаДокумента") Тогда
				НоваяСтрокаТД.Валюта = НоваяСтрокаТД.Ссылка.ВалютаДокумента.Наименование;
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		ДобавитьВЖурнал("Ошибка при выполнении запроса. " + ОписаниеОшибки(), "ПолучитьДокументы");	
		Возврат ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат ТаблицаДанных;

КонецФункции

Функция РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(ИдПодр, ИдКонтр = Неопределено)
	
	Если ИдПодр = ИдентификаторПодразделения Тогда
		Возврат Организация;
	КонецЕсли;
	
	Подразделение = РС_ПолучитьПодразделениеПоИдентификатору(ИдПодр);
	
	Если НЕ ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(ИдКонтр) Тогда
		Подразделение = РС_ПолучитьКонтрагентаПоИдентификатору(ИдКонтр);
	КонецЕсли;
	
	Возврат Подразделение;

КонецФункции

// Функция - Получить подразделение по идентификатору
//
// Параметры:
//  Идентификатор	 - Число	 - Идентификатор подразделения в системе DiState
// 
// Возвращаемое значение:
// СправочникСсылка.Контрагенты  - Ссылка на элемент справочника "Контрагенты"
//
Функция РС_ПолучитьПодразделениеПоИдентификатору(Идентификатор)
	
	Результат = Справочники.Контрагенты.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", МОП_ПолучитьРеквизит("DS_Подразделение_ID") );
	Запрос.УстановитьПараметр("Значение", Идентификатор);
	Запрос.Текст = МОП_ПолучитьТекстЗапросаОбъектПоДопСведениям();
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "ПолучитьПодразделениеПоИдентификатору");	
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Функция - Получить контрагента по идентификатору
//
// Параметры:
//  Идентификатор	 - Число	 - Идентификатор контрагента в системе DiState
// 
// Возвращаемое значение:
// СправочникСсылка.Контрагенты  - Ссылка на элемент справочника контрагенты
//
Функция РС_ПолучитьКонтрагентаПоИдентификатору(Идентификатор)
	
	Результат = Справочники.Контрагенты.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", МОП_ПолучитьРеквизит("DS_Контрагент_ID") );
	Запрос.УстановитьПараметр("Значение", Идентификатор);
	Запрос.Текст = МОП_ПолучитьТекстЗапросаОбъектПоДопСведениям();
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "ПолучитьПодразделениеПоИдентификатору");	
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция РС_ПолучитьОрганизациюКонтрагентаПоИдентификаторуИзДоговора(ИдПодр, ИдКонтр = Неопределено, ДоговорСПоставщиком = Ложь)

	//+Макрушин Е. 24.03.2026 #UT10-5658
	Если ИдПодр = ИдентификаторПодразделения Тогда
		Возврат Организация;
	КонецЕсли;
	
	Подразделение = РС_ПолучитьПодразделениеПоИдентификаторуИзДоговора(ИдПодр, ДоговорСПоставщиком);

	Возврат Подразделение;
    //-Макрушин Е. 24.03.2026 #UT10-5658
	
КонецФункции

// Функция - Получить контрагента по идентификатору из реквизита контрагента
//
// Параметры:
//  Идентификатор	 - Число	 - Идентификатор контрагента в системе DiState
// 
// Возвращаемое значение:
// СправочникСсылка.Контрагенты  - Ссылка на элемент справочника контрагенты
//
Функция РС_ПолучитьПодразделениеПоИдентификаторуИзДоговора(Идентификатор, ДоговорСПоставщиком = Ложь)

	//+Макрушин Е. 24.03.2026 #UT10-5658
	Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Значение", Идентификатор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.DS_Подразделение_ID = &Значение
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", ?(ДоговорСПоставщиком, Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком, Перечисления.ВидыДоговоровКонтрагентов.СПокупателем));
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "ПолучитьПодразделениеПоИдентификатору");	
	КонецПопытки;

	Возврат Результат;
	//-Макрушин Е. 24.03.2026 #UT10-5658
	
КонецФункции

// Функция - Получить документ по идентификатору
//
// Параметры:
//  Идентификатор	 - Число	 - Идентификатор документа 
// 
// Возвращаемое значение:
// ДокументСсылка  - Ссылка на документ с таким идентификатором
//
Функция РС_ПолучитьДокументПоИдентификатору(Идентификатор)
	
	Результат = Справочники.Контрагенты.ПустаяСсылка(); 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Свойство", МОП_ПолучитьРеквизит("DS_Документ_ID") );
	Запрос.УстановитьПараметр("Значение", Идентификатор);
	Запрос.Текст = МОП_ПолучитьТекстЗапросаОбъектПоДопСведениям();
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Ссылка;
		КонецЕсли;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "ПолучитьДокументПоИдентификатору");	
	КонецПопытки;
	
	ЗаписатьЖурналВФайл();
	
	Возврат Результат;	

КонецФункции

// Функция - Получить единицу измерения по идентификатору
//
// Параметры:
//  Идентификатор	 - Число	 - Идентификатор справочника 
// 
// Возвращаемое значение:
// СправочникСсылка  - Ссылка на справочник с таким идентификатором
//
Функция РС_ПолучитьЕдиницуИзмеренияПоИдентификатору(Идентификатор)
	
	НайденнаяСтрока = СправочникЕдиницыИзмерения.Найти(Идентификатор, "Идентификатор");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		Возврат НайденнаяСтрока.Ссылка;
	КонецЕсли;

КонецФункции

// Функция - Получить единицу измерения по коду
//
// Параметры:
//  КодОКЕИ	 - Строка	 - код ОКЕИ 
// 
// Возвращаемое значение:
// СправочникСсылка  - Ссылка на справочник с таким кодом
//
Функция РС_ПолучитьЕдиницуИзмеренияПоКоду(КодОКЕИ)
	
	НайденнаяСтрока = СправочникЕдиницыИзмерения.Найти(КодОКЕИ, "КодОКЕИ");
	
	Если НайденнаяСтрока <> Неопределено Тогда
		Возврат НайденнаяСтрока.Ссылка;
	КонецЕсли;

КонецФункции

// Функция - Получить метаданные документа
//
// Параметры:
//  СсылкаНаДокумент - ДокументСсылка	 - Ссылка на документ, чьи доп.сведения нужно вытащить из ИБ
// 
// Возвращаемое значение:
// Структура  - Структура данных со следующими полями:
//	*Идентификатор - Число
//	*ДатаВремяОтправки - Дата
//
Функция РС_ПолучитьМетаданныеДокумента(СсылкаНаДокумент)
	
	Результат = Новый Структура("Идентификатор,ДатаВремяОтправки");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", СсылкаНаДокумент);
	Запрос.Текст = МОП_ПолучитьТекстЗапросаДопСведенияОбъекта();
	
	Попытка
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Свойство = МОП_ПолучитьРеквизит("DS_Документ_ID") Тогда
				Результат.Идентификатор = Выборка.Значение;	
			КонецЕсли;
			
			Если Выборка.Свойство = МОП_ПолучитьРеквизит("DS_ДатаВремяОтправки") Тогда
				Результат.ДатаВремяОтправки = Выборка.Значение;	
			КонецЕсли;		
			
		КонецЦикла;
		
	Исключение
		ДобавитьВЖурнал("Не удалось выполнить запрос. " + ОписаниеОшибки(), "ПолучитьМетаданныеДокумента");		
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Функция - Получить идентификаторы контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты	 - Ссылка на контрагента, чьи доп.сведения нужно вытащить из ИБ
// 
// Возвращаемое значение:
// Структура  - Структура данных со следующими полями:
//	*ИдентификаторКонтрагента - Число
//	*ИдентификаторПодразделения - Число
//
Функция РС_ПолучитьИдентификаторыКонтрагента(Контрагент)
	
	Результат = Новый Структура("ИдентификаторКонтрагента,ИдентификаторПодразделения");
	
	Результат.ИдентификаторКонтрагента = Контрагент.DS_Подразделение_ID;
	Результат.ИдентификаторПодразделения = Контрагент.DS_Подразделение_ID;
	Возврат Результат;

КонецФункции

Функция РС_ОбновитьРеквизитыКонтрагента(СтруктураДанных, СсылкаНаКонтрагента)
	
	Если СтруктураДанных.Свойство("БИК") И СтруктураДанных.Свойство("НомерСчета") Тогда
		
		СчетКонтрагента = МОП_ПолучитьБанковскийСчетПоБикуНомеруСчета(СтруктураДанных.БИК, СтруктураДанных.НомерСчета);
		
		Если НЕ ЗначениеЗаполнено(СчетКонтрагента) Тогда
			СчетКонтрагента = МОП_СоздатьБанковскийСчетКонтрагента(СтруктураДанных.БИК, СтруктураДанных.НомерСчета, СсылкаНаКонтрагента);
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(СчетКонтрагента, "Банк") И НЕ ЗначениеЗаполнено(СчетКонтрагента.Банк) Тогда
			
			ОбъектСчета = СчетКонтрагента.ПолучитьОбъект();
			ОбъектСчета.Банк = МОП_ПолучитьБанкПоБИКу(СтруктураДанных.БИК);
			ОбъектСчета.Записать();
			СчетКонтрагента = ОбъектСчета.Ссылка;
			
		КонецЕсли;
		
		СтруктураДанных.Удалить("БИК");
		СтруктураДанных.Удалить("НомерСчета");
		
		Если КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "ОсновнойБанковскийСчет") Тогда
			СтруктураДанных.Вставить("ОсновнойБанковскийСчет", СчетКонтрагента);
		КонецЕсли;
		
		Если КНП_ЕстьРеквизит(СсылкаНаКонтрагента, "БанковскийСчетПоУмолчанию") Тогда
			СтруктураДанных.Вставить("БанковскийСчетПоУмолчанию", СчетКонтрагента);
		КонецЕсли;
		
	КонецЕсли;
	
	
	Результат = КНП_ОбновитьРеквизитыЭлементСправочника(СтруктураДанных, СсылкаНаКонтрагента);
	ЗаписатьЖурналВФайл();
	
	Возврат Результат;
	
КонецФункции

// Процедура - Привязать объект 1С к объекту ЭД
//
// Параметры:
//  Объект				 - ЛюбаяСсылка	 - Ссылка на объект метаданных 1С
//  Идентификатор		 - Строка		 - Идентификатор объекта в ЭДО. Если пустой - то будет удалено сопоставление
//  Переписывать 		 - Булево		 - Признак того, что необходимо переписать сопоставление в 1С
//
Процедура РС_ПривязатьИдентификаторКОбъекту1С(Объект,Идентификатор = Неопределено, Знач Переписывать = Ложь, Знач СвязанныеДокументы = Ложь)
	
	ДобавитьВЖурналОтладочнуюИнформацию("Вход в процедуру", "РС_ПривязатьИдентификаторКОбъекту1С");
	ПараметрИдентификатора = Неопределено;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Контрагент_ID");
	Иначе //Используется идентификатор документа
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Документ_ID");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПараметрИдентификатора) Тогда
		Возврат;
	КонецЕсли;
	
	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	ДобавитьВЖурналОтладочнуюИнформацию("Получен набор записей", "РС_ПривязатьИдентификаторКОбъекту1С");
	
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если Идентификатор = Неопределено Тогда
		
		НаборЗаписейЗначенияСвойств.Очистить();
		НаборЗаписейЗначенияСвойств.Записать();
		Возврат;
		
	КонецЕсли;
	
	Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
		
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		Переписывать = Истина;
		
	Иначе
		Запись = НаборЗаписейЗначенияСвойств[0];
	КонецЕсли; 
	
	Если Переписывать Тогда
		
		Запись.Объект = Объект;
		Запись.Свойство = ПараметрИдентификатора;
		Запись.Значение = Идентификатор;
		
		УстановитьПривилегированныйРежим(Истина);
		ДобавитьВЖурналОтладочнуюИнформацию("Начинаем запись идентификатора", "РС_ПривязатьИдентификаторКОбъекту1С");
		НаборЗаписейЗначенияСвойств.Записать();
		ДобавитьВЖурналОтладочнуюИнформацию("Запись идентификатора осуществлена", "РС_ПривязатьИдентификаторКОбъекту1С");
		УстановитьПривилегированныйРежим(Ложь);
		
		ДобавитьВЖурнал("Привязка " + Строка(Объект) + " с идентификатором " + Идентификатор, "ПривязатьИдентификаторКОбъекту1С");
		
		//Если счет-фактура - то нужно сделать привязку и для первичного документа
		Если (МОП_ЭтоСчетФактура(Объект) ИЛИ МОП_ЭтоСчетФактураПоставщика(Объект) ) И СвязанныеДокументы Тогда
			
			ДокОснование = МОП_ПолучитьОснованиеДокумента(Объект);
			
			Если ЗначениеЗаполнено(ДокОснование) Тогда
				РС_ПривязатьИдентификаторКОбъекту1С(ДокОснование, Идентификатор, Переписывать);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//==Специфичный блок кода
	Если ВеткаРазработки = "ТЭК-Торг" Тогда
		РС_УстановитьИдентификаторДиадок(Объект, Идентификатор, Переписывать, СвязанныеДокументы);	
	КонецЕсли;
	//==Специфичный блок кода

КонецПроцедуры

Процедура РС_УстановитьДатуВремяОтправкиВЭДО(Объект)
	
	ДобавитьВЖурнал("Вход в процедуру", "УстановитьДатуВремяОтправкиВЭДО");
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_ДатаВремяОтправки");
	
	Если НЕ ЗначениеЗаполнено(ПараметрИдентификатора) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
	Иначе
		Запись = НаборЗаписейЗначенияСвойств[0];
	КонецЕсли; 
	
	Запись.Объект = Объект;
	Запись.Свойство = ПараметрИдентификатора;
	Запись.Значение = ТекущаяДата();
	НаборЗаписейЗначенияСвойств.Записать();
	
КонецПроцедуры

Процедура РС_ОбновитьСтатусДокументаЭДО(Объект, Статус)
	
	ДобавитьВЖурнал("Вход в процедуру", "ОбновитьСтатусДокументаЭДО");
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_СтатусДокумента");
	
	Если НЕ ЗначениеЗаполнено(ПараметрИдентификатора) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
	Иначе
		Запись = НаборЗаписейЗначенияСвойств[0];
	КонецЕсли; 
	
	Запись.Объект = Объект;
	Запись.Свойство = ПараметрИдентификатора;
	Запись.Значение = Статус;
	НаборЗаписейЗначенияСвойств.Записать();	

КонецПроцедуры

Процедура РС_ПривязатьИдентификаторПодразделенияВ1С(Объект, Идентификатор, Знач Переписывать = Ложь)
	
	СвойствоИдентификатора = МОП_ПолучитьРеквизит("DS_Подразделение_ID");	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(СвойствоИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда		
		
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		Переписывать = Истина;
		
	ИначеЕсли НаборЗаписейЗначенияСвойств.Количество() > 0 Тогда
		Запись = НаборЗаписейЗначенияСвойств[0];
	КонецЕсли;
	
	Если Переписывать Тогда
		
		Запись.Объект = Объект;
		Запись.Свойство = СвойствоИдентификатора;
		Запись.Значение = Идентификатор;
		
		УстановитьПривилегированныйРежим(Истина);
		НаборЗаписейЗначенияСвойств.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		ДобавитьВЖурнал("Привязка " + Строка(Объект) + " с идентификатором " + Идентификатор, "ПривязатьИдентификаторПодразделенияВ1С");	
		
	КонецЕсли;
	

КонецПроцедуры

Процедура РС_ОчиститьВсеИдентификаторыКонтрагентов()
	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	
	СвойствоИдентификатора = МОП_ПолучитьРеквизит("DS_Подразделение_ID");	
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(СвойствоИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	НаборЗаписейЗначенияСвойств.Очистить();
	НаборЗаписейЗначенияСвойств.Записать();
	
	СвойствоИдентификатора = МОП_ПолучитьРеквизит("DS_Контрагент_ID");	
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(СвойствоИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	НаборЗаписейЗначенияСвойств.Очистить();
	НаборЗаписейЗначенияСвойств.Записать();
	
КонецПроцедуры

Процедура РС_УстановитьОтборПоКонтрагентам(СписокКонтрагентов)
	
	Для Каждого СтрокаКонтрагента Из СправочникКонтрагенты Цикл
		
		Если ЗначениеЗаполнено(СтрокаКонтрагента.Ссылка) Тогда
			СписокКонтрагентов.Добавить(СтрокаКонтрагента.Ссылка);	
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

Функция РС_ПолучитьСписокОбъектовСИдентификаторами(ТипОбъектов = "Контрагент")
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = МОП_ПолучитьТекстЗапросаСписокОбъектовСоСвойством(); 
	ПараметрИдентификатора = Неопределено;
	
	Если ТипОбъектов = "Контрагент" Тогда
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Контрагент_ID");
	КонецЕсли;	
	
	Если ТипОбъектов = "Подразделение" Тогда
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_Подразделение_ID");
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Свойство", ПараметрИдентификатора);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

Функция РС_ПодготовитьВложениеКНеформализованномуДокументу(ТабДок)
	
	Результат = "";
	
	Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент") Тогда
		
		СисИнфо = Новый СистемнаяИнформация;
		
		Если Строка(Метаданные.РежимСовместимости) = "Версия8_2_16" ИЛИ
			
			Строка(Метаданные.РежимСовместимости) = "Версия8_2_13" Тогда
			РежимСовместимости82 = Истина;
			
		Иначе
			РежимСовместимости82 = Ложь;
		КонецЕсли;
		
		Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.2" ИЛИ РежимСовместимости82 Тогда
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			УдалитьФайлы(ИмяВременногоФайла);
			Результат = КНП_ОбработатьСтрокуBase64(Base64Строка(ДвоичныеДанные) );
			
		Иначе
			
			ПотокДанных = Неопределено;
			Выполнить("ПотокДанных = Новый ПотокВПамяти;");
			ТабДок.Записать(ПотокДанных, ТипФайлаТабличногоДокумента.PDF);
			ДвоичныеДанные = ПотокДанных.ЗакрытьИПолучитьДвоичныеДанные();
			Результат = КНП_ОбработатьСтрокуBase64(Base64Строка(ДвоичныеДанные) );
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура РС_СоздатьДокумент(СтрокаТЧ) 	
	
	ЭтоУПД = Ложь;
	
	Если ЗначениеЗаполнено(СтрокаТЧ.Ссылка) Тогда
		
		ОбъектТЧ = СтрокаТЧ.Ссылка.ПолучитьОбъект();
		ОбъектТЧ.ПометкаУдаления = Истина;
		РС_ПривязатьИдентификаторКОбъекту1С(СтрокаТЧ.Ссылка);
		
		Попытка
			ОбъектТЧ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			ОбъектТЧ.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		СтрокаТЧ.Ссылка = Неопределено;
		
	КонецЕсли;
	
	ОбъектДанных = РС_ПрочитатьОбъектДанныхИзXML(СтрокаТЧ, ЭтоУПД);
	
	Если ОбъектДанных = Неопределено Тогда
		
		СтрокаТЧ.ОписаниеОшибки = "Не удалось создать документ - не удалось прочитать XML";
		ДобавитьВЖурнал("Текст XML-файла: " + СтрокаТЧ.ДанныеДокумента, "СоздатьДокументВ1С");
		Возврат;
		
	КонецЕсли;
	
	ТипДокумента = КНП_БезопасноПрочитатьЗначение(ОбъектДанных, "ТипУПД");
	
	Если ТипДокумента = Неопределено Тогда
		ТипДокумента = "ДОП";
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если СтрокаТЧ.Тип = "Счет на оплату" Тогда
		РезультатСоздания = РС_СформироватьОбъектСчетНаОплату(ОбъектДанных, СтрокаТЧ.Контрагент);	
	ИначеЕсли СтрокаТЧ.Тип = "Акт" Тогда
		РезультатСоздания = РС_СформироватьОбъектАктВыполненныхРабот(ОбъектДанных, СтрокаТЧ.Контрагент);
	ИначеЕсли СтрокаТЧ.Тип = "Накладная" Тогда
		РезультатСоздания = РС_СформироватьОбъектНакладная(ОбъектДанных, СтрокаТЧ.Контрагент);
	ИначеЕсли Найти(СтрокаТЧ.Тип, "Универсальный передаточный документ") ИЛИ Найти(СтрокаТЧ.Тип, "УПД") Тогда
		
		Если ЗагрузкаНоменклатурыКакУслуга Тогда
			РезультатСоздания = РС_СформироватьОбъектАктВыполненныхРабот(ОбъектДанных, СтрокаТЧ.Контрагент, ?(ТипДокумента = "ДОП", Ложь, Истина));	
		Иначе
			РезультатСоздания = РС_СформироватьОбъектНакладная(ОбъектДанных, СтрокаТЧ.Контрагент, ?(ТипДокумента = "ДОП", Ложь, Истина) );
		КонецЕсли;
		
	ИначеЕсли Найти(СтрокаТЧ.Тип, "Универсальный корректировочный документ") Тогда
		РезультатСоздания = РС_СформироватьОбъектКорректировка(ОбъектДанных, СтрокаТЧ.Контрагент, Истина);
	ИначеЕсли Найти(СтрокаТЧ.Тип, "Счет-фактура") Тогда
		
		Если Найти(НРег(СтрокаТЧ.Тип), "корректир") И КНП_ЕстьОбъектМетаданных("КорректировочныйСчетФактураПолученный") Тогда
			РезультатСоздания = РС_СформироватьКСФПолученную(ОбъектДанных, СтрокаТЧ.Контрагент);	
		Иначе
			
			Если СоздаватьПоступлениеПоСчетФактуре Тогда
				
				Если ЗагрузкаНоменклатурыКакУслуга Тогда
					РезультатСоздания = РС_СформироватьОбъектАктВыполненныхРабот(ОбъектДанных, СтрокаТЧ.Контрагент, Истина, Истина);
				Иначе
					РезультатСоздания = РС_СформироватьОбъектНакладная(ОбъектДанных, СтрокаТЧ.Контрагент, Истина, Истина);
				КонецЕсли;
				
			Иначе
				РезультатСоздания = РС_СформироватьСФПолученнуюБезНакладной(ОбъектДанных, СтрокаТЧ.Контрагент);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если РезультатСоздания <> Неопределено Тогда
		
		Если ТипЗнч(РезультатСоздания) = Тип("Строка") Тогда
			СтрокаТЧ.ОписаниеОшибки = РезультатСоздания;	
		ИначеЕсли ТипЗнч(РезультатСоздания) = Тип("Массив") Тогда
			
			Для Каждого ДокОбъект Из РезультатСоздания Цикл
				
				Попытка
					
					Если НЕ ЗначениеЗаполнено(ДокОбъект.Ссылка) Тогда
						ДокОбъект.Записать();
					КонецЕсли;
					
					Если СтрокаТЧ.Ссылка = Неопределено Тогда
						
						Если СоздаватьПоступлениеПоСчетФактуре Тогда
							
							Если (ТипДокумента = "СЧФ" ИЛИ ТипДокумента = "КСЧФ") И МОП_ЭтоСчетФактураПоставщика(ДокОбъект.Ссылка) Тогда
								Продолжить;
							КонецЕсли;
							
						КонецЕсли;
						
						СтрокаТЧ.Ссылка = ДокОбъект.Ссылка;
						РС_ПривязатьИдентификаторКОбъекту1С(СтрокаТЧ.Ссылка, СтрокаТЧ.ИдентификаторДокумента,,ЭтоУПД);
						
					КонецЕсли;
					
				Исключение
					
					ДобавитьВЖурнал(ОписаниеОшибки(), "СоздатьДокументВ1С");	
					СтрокаТЧ.ОписаниеОшибки = ОписаниеОшибки();
					
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь)

КонецПроцедуры

Функция РС_ПрочитатьОбъектДанныхИзXML(СтрокаТЧ, ЭтоУПД = Ложь)
	
	Попытка
		
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ДанныеДокумента) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ОбъектXML = Новый ЧтениеXML;
		
		Если Найти(СтрокаТЧ.ДанныеДокумента, "<?xml") Тогда
			ОбъектXML.УстановитьСтроку(СтрокаТЧ.ДанныеДокумента);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	Исключение	
		
		ДобавитьВЖурнал(ОписаниеОшибки(), "СоздатьДокументВ1С");
		Возврат Неопределено;
		
	КонецПопытки;
	
	Если Найти(СтрокаТЧ.Тип, "Счет на оплату") Тогда
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФСчетНаОплатуПокупателю()
	ИначеЕсли СтрокаТЧ.Тип = "Счет-фактура" Тогда
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУПДПродавца();
	ИначеЕсли Найти(НРег(СтрокаТЧ.Тип), "накладная") ИЛИ Найти(ВРег(СтрокаТЧ.Тип), "ТОРГ") Тогда
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФНакладнойПродавца();
	ИначеЕсли Найти(НРег(СтрокаТЧ.Тип), "акт") Тогда
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФАктаИсполнителя();
	ИначеЕсли Найти(СтрокаТЧ.Тип, "передат") ИЛИ СтрокаТЧ.Тип = "УПД" ИЛИ Найти(СтрокаТЧ.Тип, "УПД ФНС 820") Тогда  //УПД
		
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУПДПродавца();
		ЭтоУПД = Истина;
		
	ИначеЕсли Найти(НРег(СтрокаТЧ.Тип), "корректир") Тогда //УКД
		
		СтруктураДокумента = ПФ_ПолучитьСтруктуруПФУКДПродавца();
		ЭтоУПД = Истина;
		
	Иначе
		СтруктураДокумента = Новый Структура;
	КонецЕсли;
	
	Возврат ПФ_ПолучитьСтруктуруДанныхИзXML(ОбъектXML, СтруктураДокумента);
	
КонецФункции

//Обновление версии 2.3.3. Сопоставление номенклатур

Функция РС_НайтиНесопоставленнуюНоменклатуру(СтрокаТЧ)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивСтруктурДанных = Новый Массив;	
	ОбъектДанных = РС_ПрочитатьОбъектДанныхИзXML(СтрокаТЧ);
	
	Если ОбъектДанных = Неопределено Тогда
		
		СтрокаТЧ.ОписаниеОшибки = "Не удалось создать документ - не удалось прочитать XML";
		ДобавитьВЖурнал("Текст XML-файла: " + СтрокаТЧ.ДанныеДокумента, "СоздатьДокументВ1С");
		УстановитьПривилегированныйРежим(Ложь);
		Возврат МассивСтруктурДанных;
		
	КонецЕсли;
	
	Если ОбъектДанных.Свойство("ТабличнаяЧасть") Тогда
		
		ТаблицаСопоставления = РС_ПолучитьТаблицуСопоставленийНоменклатур();
		
		Для Каждого СтрокаТД Из ОбъектДанных.ТабличнаяЧасть Цикл
			
			СтруктураДанных = Новый Структура("Поставщик,ВнешняяНоменклатура", СтрокаТЧ.Контрагент, СтрокаТД.Товар);
			СтрокиТС = ТаблицаСопоставления.НайтиСтроки(СтруктураДанных);
			
			Если СтрокиТС.Количество() = 0 Тогда
				МассивСтруктурДанных.Добавить(СтруктураДанных);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивСтруктурДанных;

КонецФункции

Функция РС_НайтиНоменклатуру(ИмяВнешнейНоменклатуры, Поставщик)
	
	ТаблицаСопоставлений = РС_ПолучитьТаблицуСопоставленийНоменклатур();
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВнешняяНоменклатура", ИмяВнешнейНоменклатуры);
	СтруктураПоиска.Вставить("Поставщик", Поставщик);
	СтрокиТЧ = ТаблицаСопоставлений.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокиТЧ.Количество() > 0 Тогда
		Возврат СтрокиТЧ[0].Номенклатура;
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.НайтиПоНаименованию(ИмяВнешнейНоменклатуры);

КонецФункции

Функция РС_ПолучитьТаблицуСопоставленийНоменклатур()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура") );
	Результат.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.Контрагенты") );
	Результат.Колонки.Добавить("ВнешняяНоменклатура", Новый ОписаниеТипов("Строка") );
	
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_СопоставлениеНоменклатур");
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Организация);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() > 0 Тогда
		
		Запись = НаборЗаписейЗначенияСвойств[0];
		СтрокаДанных = Запись.Значение.ПолноеНаименование;
		
		Если ЗначениеЗаполнено(СтрокаДанных) Тогда
			
			МассивСтрокДанных = КНП_РазобратьСтрокуВМассивСтруктур(СтрокаДанных);
			
			Для Каждого СтрокаМассива Из МассивСтрокДанных Цикл
				
				СтрокаТаблицы = Результат.Добавить();
				УИДНоменклатура = Неопределено;
				УИДПоставщик = Неопределено;
				
				Если СтрокаМассива.Свойство("Номенклатура", УИДНоменклатура) Тогда
					
					Попытка
						СтрокаМассива.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДНоменклатура) );
					Исключение
						
						ЗаписьЖурналаРегистрации("Ошибка в распознавании номенклатуры", УровеньЖурналаРегистрации.Ошибка, , "УИД " + УИДНоменклатура);	
						СтрокаМассива.Номенклатура = Неопределено;
						
					КонецПопытки;
					
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("Поставщик", УИДПоставщик) Тогда
					
					Попытка
						СтрокаМассива.Поставщик = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДПоставщик) );
					Исключение
						
						ЗаписьЖурналаРегистрации("Ошибка в распознавании номенклатуры", УровеньЖурналаРегистрации.Ошибка, , "УИД " + УИДПоставщик);	
						СтрокаМассива.Поставщик = Неопределено;
						
					КонецПопытки;
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаМассива);
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция РС_ЗаписатьТаблицуСопоставленийНоменклатур(ТаблицаДанных)
	
	Результат = Ложь;
	СтрокаДанных = "";
	
	Для Каждого СтрокаТЧ Из ТаблицаДанных Цикл
		
		Если СтрокаДанных <> "" Тогда
			СтрокаДанных = СтрокаДанных + ";";
		КонецЕсли;
		
		СтрокаДанных = СтрокаДанных + "Номенклатура=" + Строка(СтрокаТЧ.Номенклатура.УникальныйИдентификатор() );
		СтрокаДанных = СтрокаДанных + ",ВнешняяНоменклатура=" + СтрокаТЧ.ВнешняяНоменклатура + "";
		СтрокаДанных = СтрокаДанных + ",Поставщик=" + Строка(СтрокаТЧ.Поставщик.УникальныйИдентификатор() ); 
		
	КонецЦикла;
	
	Попытка
		
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_СопоставлениеНоменклатур");
		НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
		НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
		НаборЗаписейЗначенияСвойств.Прочитать();
		ЗначениеСвойства = Неопределено;
		
		Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
			
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			ЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			ЗначениеСвойства.Наименование = "ХранилищеСопоставления";
			ЗначениеСвойства.ПолноеНаименование = "";
			ЗначениеСвойства.Владелец = ПараметрИдентификатора; 
			
		Иначе
			
			Запись = НаборЗаписейЗначенияСвойств[0];
			ЗначениеСвойства = Запись.Значение.ПолучитьОбъект();
			
		КонецЕсли; 
		
		ЗначениеСвойства.ПолноеНаименование = СтрокаДанных;
		ЗначениеСвойства.Записать();
		Запись.Объект 	= Организация;
		Запись.Свойство = ПараметрИдентификатора;
		Запись.Значение = ЗначениеСвойства.Ссылка;
		НаборЗаписейЗначенияСвойств.Записать();
		Результат = Истина;
		
	Исключение
		ДобавитьВЖурнал("Возникла ошибка " + ОписаниеОшибки(), "РС_ЗаписатьТаблицуСопоставленийНоменклатур");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции


//Обновление версии 2.3.4. Сопоставление статей расходов

Функция РС_НайтиНесопоставленныеСтатьиРасходов(СтрокаТЧ)
	
	УстановитьПривилегированныйРежим(Истина);
	МассивСтруктурДанных = Новый Массив;	
	ОбъектДанных = РС_ПрочитатьОбъектДанныхИзXML(СтрокаТЧ);
	
	Если ОбъектДанных = Неопределено Тогда
		
		СтрокаТЧ.ОписаниеОшибки = "Не удалось создать документ - не удалось прочитать XML";
		ДобавитьВЖурнал("Текст XML-файла: " + СтрокаТЧ.ДанныеДокумента, "СоздатьДокументВ1С");
		УстановитьПривилегированныйРежим(Ложь);
		Возврат МассивСтруктурДанных;
		
	КонецЕсли;
	
	Если ОбъектДанных.Свойство("ТабличнаяЧасть") Тогда
		
		Для Каждого СтрокаТД Из ОбъектДанных.ТабличнаяЧасть Цикл
			
			СтатьяРасходов = РС_ПолучитьСтатьюРасходов(СтрокаТЧ.Контрагент, СтрокаТД.Товар);
			
			Если СтатьяРасходов = Неопределено Тогда
				
				СтруктураДанных = Новый Структура("Поставщик,ВнешняяНоменклатура,СтатьяРасходов", СтрокаТЧ.Контрагент, СтрокаТД.Товар, Неопределено);
				МассивСтруктурДанных.Добавить(СтруктураДанных);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат МассивСтруктурДанных;	

КонецФункции

Функция РС_ПолучитьТаблицуСопоставленийСтатейРасходов()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Поставщик", Новый ОписаниеТипов("СправочникСсылка.Контрагенты") );
	Результат.Колонки.Добавить("СтрокаПоиска", Новый ОписаниеТипов("Строка") );
	Результат.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов") );
	
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_СопоставлениеСтатейРасходов");
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Организация);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() > 0 Тогда
		
		Запись = НаборЗаписейЗначенияСвойств[0];
		СтрокаДанных = Запись.Значение.ПолноеНаименование;
		
		Если ЗначениеЗаполнено(СтрокаДанных) Тогда
			
			МассивСтрокДанных = КНП_РазобратьСтрокуВМассивСтруктур(СтрокаДанных);
			
			Для Каждого СтрокаМассива Из МассивСтрокДанных Цикл
				
				СтрокаТаблицы = Результат.Добавить();
				УИДПоставщик = Неопределено;
				УИДСтатьяРасходов = Неопределено;
				
				Если СтрокаМассива.Свойство("Поставщик", УИДПоставщик) Тогда
					
					Попытка
						СтрокаМассива.Поставщик = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДПоставщик) );
					Исключение
						
						ЗаписьЖурналаРегистрации("Ошибка в распознавании контрагента", УровеньЖурналаРегистрации.Ошибка, , "УИД " + УИДПоставщик);	
						СтрокаМассива.Номенклатура = Неопределено;
						
					КонецПопытки;
					
				КонецЕсли;
				
				Если СтрокаМассива.Свойство("СтатьяРасходов", УИДСтатьяРасходов) Тогда
					
					Попытка
						СтрокаМассива.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.ПолучитьСсылку(Новый УникальныйИдентификатор(УИДСтатьяРасходов) );
					Исключение
						
						ЗаписьЖурналаРегистрации("Ошибка в распознавании подразделения", УровеньЖурналаРегистрации.Ошибка, , "УИД " + УИДСтатьяРасходов);	
						СтрокаМассива.СтатьяРасходов = Неопределено;
						
					КонецПопытки;
					
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтрокаМассива);			
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция РС_ЗаписатьТаблицуСопоставленийСтатейРасходов(ТаблицаДанных)
	
	Результат = Ложь;
	СтрокаДанных = "";
	
	Для Каждого СтрокаТЧ Из ТаблицаДанных Цикл
		
		Если СтрокаДанных <> "" Тогда
			СтрокаДанных = СтрокаДанных + ";";
		КонецЕсли;
		
		СтрокаДанных = СтрокаДанных + "Поставщик=" + Строка(СтрокаТЧ.Поставщик.УникальныйИдентификатор() );
		СтрокаДанных = СтрокаДанных + ",СтрокаПоиска=" + СтрокаТЧ.СтрокаПоиска + "";
		СтрокаДанных = СтрокаДанных + ",СтатьяРасходов=" + Строка(СтрокаТЧ.СтатьяРасходов.УникальныйИдентификатор() ); 
		
	КонецЦикла;
	
	Попытка
		
		ПараметрИдентификатора = МОП_ПолучитьРеквизит("DS_СопоставлениеСтатейРасходов");
		НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
		НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
		НаборЗаписейЗначенияСвойств.Прочитать();
		ЗначениеСвойства = Неопределено;
		
		Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
			
			Запись = НаборЗаписейЗначенияСвойств.Добавить();
			ЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			ЗначениеСвойства.Наименование = "ХранилищеСопоставления";
			ЗначениеСвойства.ПолноеНаименование = "";
			ЗначениеСвойства.Владелец = ПараметрИдентификатора; 
			
		Иначе
			
			Запись = НаборЗаписейЗначенияСвойств[0];
			ЗначениеСвойства = Запись.Значение.ПолучитьОбъект();
			
		КонецЕсли; 
		
		ЗначениеСвойства.ПолноеНаименование = СтрокаДанных;
		ЗначениеСвойства.Записать();
		Запись.Объект 	= Организация;
		Запись.Свойство = ПараметрИдентификатора;
		Запись.Значение = ЗначениеСвойства.Ссылка;
		НаборЗаписейЗначенияСвойств.Записать();
		Результат = Истина;
		
	Исключение
		ДобавитьВЖурнал("Возникла ошибка " + ОписаниеОшибки(), "РС_ЗаписатьТаблицуСопоставленийСтатейРасходов");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция РС_ПолучитьСтатьюРасходов(Поставщик, НоменклатураСтрока)
	
	ТаблицаСопоставлений = РС_ПолучитьТаблицуСопоставленийСтатейРасходов();
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Поставщик", Поставщик);
	СтрокиТЧ = ТаблицаСопоставлений.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТЧ Из СтрокиТЧ Цикл
		
		Если Найти(НоменклатураСтрока, СтрокаТЧ.СтрокаПоиска) Тогда
			Возврат СтрокаТЧ.СтатьяРасходов;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;	

КонецФункции



//==Специфичная область

Процедура РС_УстановитьИдентификаторДиадок(Объект,Идентификатор = Неопределено, Знач Переписывать = Ложь, Знач СвязанныеДокументы = Ложь)
	
	//ДобавитьВЖурнал("Вход в процедуру", "РС_УстановитьИдентификаторДиадок");
	ПараметрИдентификатора = МОП_ПолучитьРеквизит("ИдентификаторДокументаВДиадок");
	
	Если НЕ ЗначениеЗаполнено(ПараметрИдентификатора) Тогда
		Возврат;
	КонецЕсли;  
	
	НаборЗаписейЗначенияСвойств = МОП_ПолучитьНовыйНаборЗаписейДопСведений();
	НаборЗаписейЗначенияСвойств.Отбор.Объект.Установить(Объект.Ссылка);
	НаборЗаписейЗначенияСвойств.Отбор.Свойство.Установить(ПараметрИдентификатора);
	НаборЗаписейЗначенияСвойств.Прочитать();
	
	Если НаборЗаписейЗначенияСвойств.Количество() = 0 Тогда
		
		Запись = НаборЗаписейЗначенияСвойств.Добавить();
		Переписывать = Истина;
		
	Иначе
		Запись = НаборЗаписейЗначенияСвойств[0];
	КонецЕсли; 
	
	Если Переписывать Тогда
		
		Запись.Объект = Объект;
		Запись.Свойство = ПараметрИдентификатора;
		Запись.Значение = Идентификатор;
		НаборЗаписейЗначенияСвойств.Записать();
		
		//ДобавитьВЖурнал("Привязка " + Строка(Объект) + " с идентификатором " + Идентификатор, "УстановитьИдентификаторДиадок");
		//Если счет-фактура - то нужно сделать привязку и для первичного документа
		Если (МОП_ЭтоСчетФактура(Объект) ИЛИ МОП_ЭтоСчетФактураПоставщика(Объект) ) И СвязанныеДокументы Тогда
			
			ДокОснование = МОП_ПолучитьОснованиеДокумента(Объект);
			
			Если ЗначениеЗаполнено(ДокОснование) Тогда
				РС_УстановитьИдентификаторДиадок(ДокОснование, Идентификатор, Переписывать);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		

КонецПроцедуры

//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти РаботаС1С					 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////






////////////////////////////////////////////////////////////////////////
//....................................................................//
//						#Область РаботаСЭДО					 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////

//#Область РаботаСЭДО

Функция ЭДО_СинхронизацияКонтрагентов(ПолнаяЗагрузка = Ложь);
	
	ТаблицаДанных = СправочникКонтрагенты.Выгрузить();
	ТаблицаДанных.Очистить();
	
	ДанныеЭДО = API_ПолучитьСписокКонтрагентов(ПолнаяЗагрузка);
	ЗаписатьЖурналВФайл();
	ТаблицаКонтрагентов = РС_ПолучитьСписокОбъектовСИдентификаторами("Контрагент");
	ТаблицаКонтрагентов.Очистить();  
	ТаблицаПодразделений = РС_ПолучитьСписокОбъектовСИдентификаторами("Подразделение");
	ТаблицаПодразделений.Очистить(); 
	ЗаписатьЖурналВФайл();
	
	Итер = 0;
	
	Для Каждого ЭлементМассива Из ДанныеЭДО Цикл
		
		Итер = Итер + 1;
		ДобавитьВЖурналОтладочнуюИнформацию("Анализ элемента №" + Итер, "ЭДО_СинхронизацияКонтрагентов");
		
		Попытка
			
			ИД 				= ЭлементМассива.Получить("divisionId");
			Наименование	= ЭлементМассива.Получить("name");
			ИНН				= ЭлементМассива.Получить("inn");
			ОГРН			= ЭлементМассива.Получить("ogrn");
			КПП				= ЭлементМассива.Получить("kpp");
			ИДПодразделения = ЭлементМассива.Получить("divisionId");
			НазваниеПодразд = ЭлементМассива.Получить("title");
			Статус			= ЭлементМассива.Получить("relation");
			
			Если Статус <> Неопределено Тогда
				Статус = Статус.Получить("statusName");	
			КонецЕсли;
			
			ДобавитьВЖурналОтладочнуюИнформацию("Анализ элемента №" + Итер + ": получены значения", "ЭДО_СинхронизацияКонтрагентов");
			
			
			МассивПодразделений = ЭлементМассива.Получить("divisions");
			
			Если МассивПодразделений = Неопределено Тогда
				
				ДобавитьВЖурналОтладочнуюИнформацию("Добавление элемента №" + Итер + " в список", "ЭДО_СинхронизацияКонтрагентов");
				
				НоваяСтрока = ТаблицаДанных.Добавить();
				НоваяСтрока.ИНН = ИНН;
				НоваяСтрока.КПП = КПП;
				НоваяСтрока.ОГРН = ОГРН;
				НоваяСтрока.Название = Наименование + " (" + НазваниеПодразд + ")";
				НоваяСтрока.ИдентификаторКомпании = КНП_ЧислоБезГруппВВидеСтроки(ИД);
				НоваяСтрока.ИдентификаторПодразделения = КНП_ЧислоБезГруппВВидеСтроки(ИДПодразделения);
				
				ДобавитьВЖурналОтладочнуюИнформацию("Поиск элемента №" + Итер + " по идентификатору", "ЭДО_СинхронизацияКонтрагентов");
				
				СтрокаТаблицыКонтрагентов = ТаблицаКонтрагентов.Найти(НоваяСтрока.ИдентификаторКомпании, "Значение");
				
				Если СтрокаТаблицыКонтрагентов = Неопределено Тогда
					
					ДобавитьВЖурналОтладочнуюИнформацию("Поиск элемента №" + Итер + ": не нашли по идентификатору", "ЭДО_СинхронизацияКонтрагентов");
					НоваяСтрока.Ссылка = ПолучитьКонтагентаПартнераПоИдентификатору(НоваяСтрока.ИдентификаторКомпании, НоваяСтрока.ИдентификаторПодразделения); 

					Если НоваяСтрока.Ссылка = Неопределено ИЛИ НоваяСтрока.Ссылка.Пустая() Тогда
						Продолжить;
					КонецЕсли;
					
				Иначе
					НоваяСтрока.Ссылка = СтрокаТаблицыКонтрагентов.Объект;
				КонецЕсли;
				
				НоваяСтрока.НазваниеПодразделения = НазваниеПодразд;
				
				Если ВерсияAPI = "v1.3" Тогда
					НоваяСтрока.СтатусВзаимодействия = Статус;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НоваяСтрока.ИдентификаторПодразделения) Тогда
					
					СтрокаТаблицыПодразделений = ТаблицаПодразделений.Найти(НоваяСтрока.ИдентификаторПодразделения, "Значение");
					
					Если СтрокаТаблицыПодразделений = Неопределено Тогда
						РС_ПривязатьИдентификаторПодразделенияВ1С(НоваяСтрока.Ссылка, НоваяСтрока.ИдентификаторПодразделения);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				ДобавитьВЖурналОтладочнуюИнформацию("Найдены подразделения у элемента №" + Итер, "ЭДО_СинхронизацияКонтрагентов");
				
				Для Каждого Подразделение Из МассивПодразделений Цикл
					
					ДобавитьВЖурналОтладочнуюИнформацию("Добавление подразделения элемента №" + Итер + " в список", "ЭДО_СинхронизацияКонтрагентов");
					
					НоваяСтрока = ТаблицаДанных.Добавить();
					НоваяСтрока.ИНН = ИНН;
					НоваяСтрока.КПП = Подразделение.Получить("kpp");
					НоваяСтрока.ОГРН = ОГРН;
					
					Если Подразделение.Получить("title") <> Неопределено Тогда
						НоваяСтрока.Название = Наименование + " (" + Подразделение.Получить("title") + ")";
					Иначе
						
						ДобавитьВЖурнал("Не заполнено название подразделения у организации с ID = " + ИД, "API_ПолучитьСписокКонтрагентов");	
						
						Попытка
							НоваяСтрока.Название = Наименование + " (Ошибка! Не заполнен титул подразделения!)";
						Исключение
						КонецПопытки;
						
					КонецЕсли;
					
					НоваяСтрока.ИдентификаторКомпании = КНП_ЧислоБезГруппВВидеСтроки(ИД);
					НоваяСтрока.ИдентификаторПодразделения = КНП_ЧислоБезГруппВВидеСтроки(Подразделение.Получить("id"));
					НоваяСтрока.НазваниеПодразделения = Подразделение.Получить("title");
					
					Если ВерсияAPI = "v1.3" Тогда
						НоваяСтрока.СтатусВзаимодействия = Статус;	
					КонецЕсли;
					
					ДобавитьВЖурналОтладочнуюИнформацию("Поиск элемента №" + Итер + " по идентификатору", "ЭДО_СинхронизацияКонтрагентов");
					СтрокаТаблицыКонтрагентов = ТаблицаКонтрагентов.Найти(НоваяСтрока.ИдентификаторКомпании, "Значение");
					
					Если СтрокаТаблицыКонтрагентов = Неопределено Тогда
						
						ДобавитьВЖурналОтладочнуюИнформацию("Поиск подразделения элемента №" + Итер + ": не нашли по идентификатору", "ЭДО_СинхронизацияКонтрагентов");
						НоваяСтрока.Ссылка = ПолучитьКонтагентаПартнераПоИдентификатору(НоваяСтрока.ИдентификаторКомпании, НоваяСтрока.ИдентификаторПодразделения);

						Если НоваяСтрока.Ссылка = Неопределено ИЛИ НоваяСтрока.Ссылка.Пустая() Тогда
							Продолжить;
						КонецЕсли;

					Иначе
						НоваяСтрока.Ссылка = СтрокаТаблицыКонтрагентов.Объект;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(НоваяСтрока.ИдентификаторПодразделения) Тогда
						
						ДобавитьВЖурналОтладочнуюИнформацию("Поиск подразделения элемента №" + Итер + " по идентификатору", "ЭДО_СинхронизацияКонтрагентов");
						СтрокаТаблицыПодразделений = ТаблицаПодразделений.Найти(НоваяСтрока.ИдентификаторПодразделения, "Значение");
						
					КонецЕсли;	
					
				КонецЦикла;
				
			КонецЕсли;
			
		Исключение
			
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "ЭДО_СинхронизацияКонтрагентов");
			ДобавитьВЖурналОтладочнуюИнформацию("Фиксация ошибки для отладки", "ЭДО_СинхронизацияКонтрагентов");
			
		КонецПопытки;
		
	КонецЦикла;
	
	ДобавитьВЖурналОтладочнуюИнформацию("Выход из процедуры", "ЭДО_СинхронизацияКонтрагентов");	
	Возврат ТаблицаДанных;	

КонецФункции

Функция ПолучитьКонтагентаПартнераПоИдентификатору(Идентификатор, ИдентификаторПодразделения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.DS_Подразделение_ID = &DS_Подразделение_ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.DS_Подразделение_ID = &DS_Подразделение_ID";
	
	Запрос.УстановитьПараметр("DS_Подразделение_ID", ИдентификаторПодразделения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 1 Тогда
		
		Сообщить("В системе присутствует: " + Выборка.Количество() + " с идентификатором: " + Идентификатор + ". Сопоставление невозможно");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ЭДО_СинхронизацияБанков(БИКБанка = Неопределено)
	
	ТаблицаДанных = СправочникБанки.Выгрузить();
	ТаблицаДанных.Очистить();
	МассивЭлементов = API_ПолучитьСписокБанков(БИКБанка);
	
	Для Каждого ЭлементМассива Из МассивЭлементов Цикл
		
		Попытка
			
			Название 					= ЭлементМассива.Получить("shortTitle");
			СокрНазвание 				= ЭлементМассива.Получить("fullTitle");
			БИК 						= ЭлементМассива.Получить("bik");
			КоррСчет					= ЭлементМассива.Получить("correspondentAccount");
			
			НоваяСтрока 				= ТаблицаДанных.Добавить();
			НоваяСтрока.Название 		= Название;
			НоваяСтрока.СокрНазвание 	= СокрНазвание;
			НоваяСтрока.БИК 			= БИК;
			НоваяСтрока.Ссылка 			= МОП_ПолучитьБанкПоБИКу(БИК);
			НоваяСтрока.КоррСчетБанка 	= КоррСчет;
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ссылка) И СоздаватьСправочникиПоДаннымЭДО Тогда
				НоваяСтрока.Ссылка 		= МОП_СоздатьБанк(БИК, НоваяСтрока.Название, НоваяСтрока.СокрНазвание, НоваяСтрока.КоррСчетБанка);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "ЭДО_СинхронизацияБанков");
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;

КонецФункции

Функция ЭДО_СинхронизацияЕдиницИзмерения()
	
	ТаблицаДанных = СправочникЕдиницыИзмерения.Выгрузить();
	ТаблицаДанных.Очистить();
	МассивЭлементов = API_ПолучитьСписокЕдиницИзмерения();
	
	Для Каждого ЭлементМассива Из МассивЭлементов Цикл
		
		Попытка
			
			Название 					= ЭлементМассива.Получить("title");
			СокращенноеНаименование 	= ЭлементМассива.Получить("localDesignation");
			КодЕдиницы 					= ЭлементМассива.Получить("code");
			
			НоваяСтрока 				= ТаблицаДанных.Добавить();
			НоваяСтрока.Название 		= Название;
			НоваяСтрока.СокрНазвание 	= СокращенноеНаименование;
			НоваяСтрока.КодОКЕИ 		= КодЕдиницы;
			НоваяСтрока.Ссылка 			= МОП_ПолучитьЕдиницуИзмененияПоОКЕИ(КодЕдиницы);
			
			Если НЕ ЗначениеЗаполнено(НоваяСтрока.Ссылка) И СоздаватьСправочникиПоДаннымЭДО Тогда
				НоваяСтрока.Ссылка 		= МОП_СоздатьЕдиницуИзмерения(КодЕдиницы, НоваяСтрока.Название, НоваяСтрока.СокрНазвание);
			КонецЕсли;
			
		Исключение
			ДобавитьВЖурнал("Ошибка обработки: " + ОписаниеОшибки(), "API_ПолучитьСписокЕдиницИзмерения");
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;	

КонецФункции



Функция ЭДО_СформироватьЗапросНаРегистрацию(СтруктураДанных) 
	
	ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Регистрация() );
	ФОД_ЗаполнитьСтруктуру(ФорматДанных, ФорматДанных.__version, СтруктураДанных);
	Возврат ФорматДанных;		

КонецФункции

Функция ЭДО_СформироватьСтруктуруДляРегистрации()
	
	СтруктураРегистрации = Новый Структура;
	СтруктураКомпании 		= Новый Структура("КПП,ОКПО,НомерСчета,БИК,НомерИФНС");
	СтруктураАдреса 		= Новый Структура("КодРегиона,Регион,Индекс,Город,НаселенныйПункт,Район,Улица,Дом,Квартира");
	СтруктураСотрудника 	= Новый Структура("Должность,Почта");
	СтруктураРегистрации.Вставить("Компания", 		СтруктураКомпании);
	СтруктураРегистрации.Вставить("АдресКомпании", 	СтруктураАдреса);
	СтруктураРегистрации.Вставить("Сотрудник", 		СтруктураСотрудника);
	Возврат СтруктураРегистрации;

КонецФункции

Функция ЭДО_ОпределитьТипДокументаДляЭДО(ТипДокумента)
	
	Результат = ТипДокумента;
	
	Если Найти(ТипДокумента, "Торг-12") Тогда
		Результат = "waybill551";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Счет на оплату") Тогда
		Результат = "bill";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "УПД") Тогда
		Результат = "universal_transfer_document_invoice_and_waybill"; //Белов "universal_transfer_document_waybill";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "УКД") Тогда
		Результат = "universal_correction_document_invoice_and_waybill";  //Белов "universal_correction_document_waybill"
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Универсальный передаточный документ") Тогда //На основании СФ
		Результат = "universal_transfer_document_invoice_and_waybill";	
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Акт") Тогда
		Результат = "act552";	
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Счет-фактура") Тогда
		Результат = "invoice_utd";	
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Корректировочная Счет-фактура") Тогда
		Результат = "invoice_correction_ucd";	
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Корректировка") Тогда
		Результат = "universal_correction_document_waybill";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Универсальный корректи") Тогда
		Результат = "universal_correction_document_invoice_and_waybill";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Акт сверки") Тогда
		Результат = "unformalized_bilateral";
	КонецЕсли;

	//+Макрушин Е. 09.04.2026 #UT10-5800
	Если Найти(ТипДокумента, "Торг-2") Тогда
		Результат = "torg2";
	КонецЕсли;
	//-Макрушин Е. 09.04.2026 #UT10-5800
	
	//+Белов А. 17.06.2026 #UT10-5921
	Если Найти(ТипДокумента, "Транспортная накладная") Тогда
		Результат = "electronic_waybill";
	КонецЕсли;
	
	Если Найти(ТипДокумента, "Заказ-заявка") Тогда
		Результат = "transportation_order";
	КонецЕсли;
	//-Белов А. 17.06.2026 #UT10-5921
	
	Возврат Результат;
	
КонецФункции

Функция ЭДО_ОпределелитьТипНеформализованного(СсылкаНаДокумент)
	
	Результат = "";
	
	Если МОП_ЭтоАктСверки(СсылкаНаДокумент) Тогда
		Результат = "Акт сверки";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_ДвухстороннийОбмен(ТипДокумента)
	
	Если ТипДокумента = "Акт сверки" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;

КонецФункции

Функция ЭДО_ПолучитьСтруктуруВозвратаАвторизацииССервером()
	
	Параметры = Новый Структура();
	Параметры.Вставить("ОшибкаАвторизации", 		Ложь);	
	Параметры.Вставить("Login", 					"");
	Параметры.Вставить("Password", 					"");
	Параметры.Вставить("Cookie", 					"");
	Параметры.Вставить("ИмяОрганизации", 			"");
	Параметры.Вставить("ИНН", 						"");
	Параметры.Вставить("КПП", 						"");
	Параметры.Вставить("ОГРН", 						"");
	Параметры.Вставить("HostAddress", 				"");
	Параметры.Вставить("ИдентификаторКомпании", 	"");
	Параметры.Вставить("Организация", 				"");
	Параметры.Вставить("ТекстJSON",					"");
	Параметры.Вставить("ВремяПоследнейАвторизации",	ТекущаяДата() );
	Параметры.Вставить("ТекстОшибки",				"");
	Параметры.Вставить("ИдентификаторПодразделения","");
	//Version 6.0
	Параметры.Вставить("ТокенАвторизации", "");
	Параметры.Вставить("ВерсияAPI", "");
	Параметры.Вставить("ОтпечатокСертификата", "");
	Параметры.Вставить("ДанныеПодписанта", "");
	Параметры.Вставить("КомпанияАктивирована", Ложь);
	Параметры.Вставить("ВерсияDiFlow", ВерсияDiFlow);
	
	Возврат Параметры;	

КонецФункции

Процедура ЭДО_ОбработатьЭД(МассивЭД, ТаблицаДанных)
	
	Для Каждого ЭД Из МассивЭД Цикл
		
		СтрокаТЧ 											= ТаблицаДанных.Добавить();
		
		Если ВерсияСервера >= 6 Тогда
			
			СтрокаТЧ.Тип 										= ЭДО_РазобратьТипДокумента(ЭД.Получить("documentTypeSystemName"), ЭД.Получить("packageFlowSystemName") );
			СтрокаТЧ.Номер										= ЭД.Получить("documentNumber");
			СтрокаТЧ.Дата										= КНП_ПривестиКДате(ЭД.Получить("documentDate") );
			СтрокаТЧ.Отправитель								= ЭД.Получить("fromCompanyName");
			СтрокаТЧ.ИдентификаторКонтрагента 					= ЭД.Получить("fromCompanyId");
			СтрокаТЧ.ИдентификаторПодразделения 				= ЭД.Получить("fromDivisionId");
			СтрокаТЧ.ИдентификаторДокумента 					= ЭД.Получить("documentId"); 
			СтрокаТЧ.ИдентификаторПакета 						= ЭД.Получить("packageId");
			//Работа с контейнерами
			СтрокаТЧ.ИДКонтейнера 								= ЭД.Получить("containerUid");
			
			Если ЗначениеЗаполнено(СтрокаТЧ.ИДКонтейнера) Тогда
				СтрокаТЧ.СвязныйКонтейнер 						= (ЭД.Получить("containerType") <> "decoupled");
			КонецЕсли;
			
		Иначе
			
			СтрокаТЧ.Тип 										= ЭД.Получить("document_type_title");
			СтрокаТЧ.Номер 										= ЭД.Получить("document_number");
			СтрокаТЧ.Дата 										= Дата(ЭД.Получить("created_at") );
			СтрокаТЧ.Отправитель 								= ЭД.Получить("from_company_name");
			СтрокаТЧ.ИдентификаторКонтрагента 					= ЭД.Получить("from_company_id");
			СтрокаТЧ.ИдентификаторПодразделения 				= ЭД.Получить("from_division_id");
			СтрокаТЧ.ИдентификаторДокумента 					= ЭД.Получить("document_id"); 
			СтрокаТЧ.ИдентификаторПакета 						= ЭД.Получить("package_id");  	
			
		КонецЕсли;
		
		СтрокаТЧ.ДанныеДокумента 							= ЭДО_ПолучитьДанныеДокумента(СтрокаТЧ.ИдентификаторДокумента).Контент;
		СтрокаТЧ.Ссылка 									= РС_ПолучитьДокументПоИдентификатору(СтрокаТЧ.ИдентификаторДокумента);
		СтрокаТЧ.Контрагент = РС_ПолучитьПодразделениеПоИдентификатору(СтрокаТЧ.ИдентификаторПодразделения);	
		СтрокаТЧ.СуммаДокумента = 0;
		
	КонецЦикла;

КонецПроцедуры

Функция ЭДО_РазобратьТипДокумента(Знач ИмяТипа, Знач ГруппаПроцессинга, Знач АльтернативноеИмя = Неопределено)
	
	Результат = ИмяТипа;
	НайденТип = Ложь;
	
	Если ИмяТипа = "on_nschfdoppr" ИЛИ ИмяТипа = "on_schfdoppr" Тогда
		
		НайденТип = Истина;
		Результат = "Универсальный передаточный документ";
		
		Если ГруппаПроцессинга = "universal_waybill"
			ИЛИ
			Найти(ГруппаПроцессинга, "universal_transfer_document_waybill")
			Тогда
			Результат = "Универсальный передаточный документ (ДОП)";	
		КонецЕсли;	
		
		Если ГруппаПроцессинга = "universal_invoice"
			ИЛИ
			(Найти(ГруппаПроцессинга, "universal_transfer_document_invoice")
			И НЕ Найти(ГруппаПроцессинга, "waybill") )
			Тогда
			Результат = "Универсальный передаточный документ (СЧФ)";	
		КонецЕсли;
		
		Если ГруппаПроцессинга = "invoice_utd" Тогда
			Результат = "Счет-фактура";	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяТипа = "on_korschfdoppr" Тогда         
		
		НайденТип = Истина;
		Результат = "Универсальный корректировочный документ";
		
		Если Найти(ГруппаПроцессинга, "universal_correction_document_waybill") Тогда
			Результат = "Универсальный корректировочный документ (ДИС)";	
		КонецЕсли;
		
		Если Найти(ГруппаПроцессинга, "universal_correction_document_invoice") И НЕ Найти(ГруппаПроцессинга, "waybill") Тогда
			Результат = "Универсальный корректировочный документ (КСЧФ)";
		КонецЕсли;
		
		Если ГруппаПроцессинга = "invoice_correction_ucd" Тогда
			Результат = "Корректировочная Счет-фактура";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяТипа = "dp_tovtorgpr" Тогда
		
		НайденТип = Истина;
		Результат = "Товарная накладная";
		
	КонецЕсли;
	
	Если ИмяТипа = "universal" Тогда
		
		НайденТип = Истина;
		Результат = "Неформализованный документ";
		
	КонецЕсли;
	
	Если ИмяТипа = "bill" Тогда
		
		НайденТип = Истина;
		Результат = "Счет на оплату";
		
	КонецЕсли;
	
	Если ИмяТипа = "dp_rezruisp" Тогда
		
		НайденТип = Истина;
		Результат = "Акт выполненных работ";
		
	КонецЕсли;			
	
	Если НЕ НайденТип И АльтернативноеИмя <> Неопределено Тогда
		Результат = АльтернативноеИмя;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_РазобратьОжидаемоеДействие(Знач СтрокаДействия, Знач ГруппаПроцессинга, Знач Направление)
	//Changelog
	//
	//28.08.2019 Поправлены названия статусов
	//30.08.2019 - еще одна правка статусов
	//22.10.2019 - исправление статуса для Акт 552
	
	Результат = СтрокаДействия;
	
	Если ГруппаПроцессинга = "informationMessage" Тогда
		
	КонецЕсли;
	
	Если СтрокаДействия = "waiting_of_receiving_confirmation" Тогда 
		Результат = "Ожидается подтверждение о получении" 
	КонецЕсли;
	
	Если ГруппаПроцессинга = "bill" Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда 
			Результат = "Требуется подписать извещение о получении" 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "universal_invoice_and_waybill"
		ИЛИ
		Найти(ГруппаПроцессинга, "universal_transfer_document_invoice_and_waybill")	
		Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" Тогда Результат = "Требуется подписать извещение от оператора" КонецЕсли;
		Если СтрокаДействия = "accepted" Тогда Результат = "Документ принят покупателем" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_signing_pdpol_notification" И Направление = "OUT" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" И Направление = "OUT" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "universal_waybill" 
		ИЛИ
		Найти(ГруппаПроцессинга, "universal_transfer_document_waybill")	
		Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" Тогда Результат = "Требуется подписать извещение от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "universal_invoice"
		ИЛИ
		Найти(ГруппаПроцессинга, "universal_invoice")	
		Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении документа" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "accepted" Тогда Результат = "Документ принят покупателем" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		Если СтрокаДействия = "utd_signing_pdpol_notification" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "invoice_utd" 
		ИЛИ
		Найти(ГруппаПроцессинга, "universal_transfer_document_invoice")	
		Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении документа" КонецЕсли;
		Если СтрокаДействия = "accepted" Тогда Результат = "Документ принят покупателем" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_signing_pdpol_notification" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "utd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" И Направление = "IN" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от продавца" КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ГруппаПроцессинга, "unilateral") ИЛИ Найти(ГруппаПроцессинга, "bilateral") Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ" КонецЕсли;
		Если СтрокаДействия = "unilateral_has_been_received" И Направление = "IN" Тогда Результат = "Требуется подписать подтверждение о получении" КонецЕсли; 
		Если СтрокаДействия = "waiting_of_signing" И Направление = "OUT" Тогда Результат = "Ожидается подписание документа получателем" КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ГруппаПроцессинга, "universal_correction_document_invoice_and_waybill") Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении документа" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;	
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ГруппаПроцессинга, "universal_correction_document_waybill") Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;	
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" И Направление = "OUT" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ГруппаПроцессинга, "universal_correction_document_invoice") Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении документа" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_pdpol" И Направление = "OUT" Тогда Результат = "Ожидается подтверждение об отправлении от оператора" КонецЕсли;	
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" И Направление = "OUT" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		
	КонецЕсли;
	
	Если Найти(ГруппаПроцессинга, "invoice_correction_ucd") Тогда
		
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении документа" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется подписать извещение о получении подтверждения" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "ucd_waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "ucd_waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "OUT" Тогда Результат = "Ожидается ответ от получателя"; КонецЕсли;	
		Если СтрокаДействия = "waiting_of_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подтверждение получения извещения от оператора" КонецЕсли;
		Если СтрокаДействия = "waiting_for_buyer" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_uvutoch_izvpol" Тогда Результат = "Ожидается извещение о получении уведомления от уточнении от контрагента" КонецЕсли;
		Если СтрокаДействия = "signing_pdpol_notification" И Направление = "OUT" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "waybill_551" Тогда
		
		Если СтрокаДействия = "waiting_of_dp_tovtorgpok" Тогда Результат = "Ожидается титул покупателя"; КонецЕсли;	
		Если СтрокаДействия = "received" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ" КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; Возврат Результат КонецЕсли;
		
	КонецЕсли;
	
	Если ГруппаПроцессинга = "act_552" Тогда
		
		Если СтрокаДействия = "waiting_of_dp_rezruzak" Тогда Результат = "Ожидается ответ от заказчика"; КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется принять или отклонить документ"; Возврат Результат КонецЕсли;
		Если СтрокаДействия = "waiting_of_signing" И Направление = "OUT" Тогда Результат = "Ожидается титул заказчика"; Возврат Результат КонецЕсли;
		
	КонецЕсли;
	
	Если СтрокаДействия = "annulment_has_been_requested" Тогда Результат = "Требуется принять или отклонить запрос на аннулирование" КонецЕсли;
	Если СтрокаДействия = "complete" Тогда Результат = "Документооборот завершен"; КонецЕсли;
	Если СтрокаДействия = "declined" Тогда Результат = "Документ отклонен" КонецЕсли;
	Если СтрокаДействия = "accepted" Тогда Результат = "Документ принят покупателем" КонецЕсли;
	Если СтрокаДействия = "interrupted" Тогда Результат = "Прерван. Обратитесь к администратору" КонецЕсли;
	Если СтрокаДействия = "dp_rezruisp_has_been_declined" Тогда Результат = "Документ отклонен" КонецЕсли;
	Если СтрокаДействия = "created" Тогда Результат = "Черновик" КонецЕсли;
	
	Если СтрокаДействия = "waiting_of_receiving_notification" Тогда Результат = "Ожидание извещения о получении" КонецЕсли;
	Если СтрокаДействия = "waiting_of_signing" И Направление = "OUT" Тогда Результат = "Ожидается подписание контрагентом" КонецЕсли;
	Если СтрокаДействия = "waiting_of_signing" И Направление = "IN" Тогда Результат = "Требуется подписать документ" КонецЕсли;
	Если СтрокаДействия = "waiting_of_annulment" Тогда Результат = "На аннулировании" КонецЕсли;		
	Если СтрокаДействия = "waiting_of_signing_izvpol_pdotpr_seller_title_izvpol" Тогда Результат = "Ожидается подписание извещения на подтверждение оператора о дате отправки извещения" КонецЕсли;
	Если СтрокаДействия = "waiting_of_receiver_title_signing" Тогда Результат = "Ожидание подписания ответного титула" КонецЕсли;
	Если СтрокаДействия = "waiting_of_clarification_signing" Тогда Результат = "Ожидание подписания уведомления об уточнении" КонецЕсли;
	Если СтрокаДействия = "waiting_of_seller_title_izvpol" Тогда Результат = "Ожидание от покупателя извещения о получении" КонецЕсли; 
	Если СтрокаДействия = "signing_pdpol_notification" Тогда Результат = "Требуется подписать извещение о получении подтверждения от оператора" КонецЕсли;
	
	Если СтрокаДействия = "roaming_waiting_of_notification_delivered" Тогда Результат = "Ожидание подтверждения о принятии извещения" КонецЕсли;
	Если СтрокаДействия = "roaming_waiting_of_signing_delivered" Тогда Результат = "Ожидание подтверждения о принятии подписи получателя" КонецЕсли;
	Если СтрокаДействия = "roaming_waiting_of_clarification_delivered" Тогда Результат = "Ожидание подтверждения о принятии уведомления об уточнении" КонецЕсли;
	Если СтрокаДействия = "waiting_of_annulment_delivered" Тогда Результат = "Ожидание подтверждения аннулирования" КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_СформироватьКвитанциюОбАннулировании(ПричинаАннулирования, СсылкаНаДокумент = Неопределено)
	
	Результат = Неопределено;
	ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Аннулирование() );
	
	Если ФорматДанных <> Неопределено Тогда
		
		ФОД_ЗаполнитьСтруктуру(ФорматДанных, ФорматДанных.__version, СсылкаНаДокумент);
		
		Если ФорматДанных.Свойство("reason") Тогда
			ФорматДанных.reason = ПричинаАннулирования;
		ИначеЕсли ФорматДанных.Свойство("document") И ФорматДанных.document.Свойство("reason") Тогда
			ФорматДанных.document.reason = ПричинаАннулирования;
		КонецЕсли;
		
		Результат = Новый Структура("Адрес,ТелоЗапроса", "", КНП_ЗаписатьJSONНаСервере(ФорматДанных) );	
		
	Иначе
		Результат = Новый Структура("Адрес,ТелоЗапроса", "", "" );	
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_СформироватьКвитанциюОПриеме(ИмяТипаДокумента, СсылкаНаДокумент)
	//Changelog
	//
	//12.12.2019 - отключена обратная совместимость квитанций по 150 приказу
	//25.02.2020 - исправление ошибки анализа типа квитанции
	
	Результат = Неопределено;
	ФорматДанных = Неопределено;
	
	Если Найти(ИмяТипаДокумента, "УПД") ИЛИ Найти(ИмяТипаДокумента, "ДОП") ИЛИ Найти(ИмяТипаДокумента, "передаточ") Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Принять_УПД820() );
	КонецЕсли;
	
	//+Белов А. 16.09.2026 #UT10-6070 добавил:  И ИмяТипаДокумента <> "Транспортная накладная"
	Если (Найти(НРег(ИмяТипаДокумента), "наклад") ИЛИ Найти(ИмяТипаДокумента, "ТОРГ")) И ИмяТипаДокумента <> "Транспортная накладная" Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Принять_ТоварнаяНакладная() );
	КонецЕсли;
	
	Если Найти(НРег(ИмяТипаДокумента), "акт") Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Принять_Акт() );
	КонецЕсли;
	
	Если Найти(НРег(ИмяТипаДокумента), "укд") ИЛИ Найти(ИмяТипаДокумента, "ДИС") ИЛИ ИмяТипаДокумента = "Универсальный корректировочный документ"  Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Принять_УКД() );
	КонецЕсли; 
	
	//+Белов А. 28.09.2026 #UT10-6070
	Если ИмяТипаДокумента = "Транспортная накладная" Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента("ТранспортнаяНакладнаяТитул3");
	КонецЕсли;
	//-Белов А. 28.09.2026 #UT10-6070
	
	Если ФорматДанных <> Неопределено Тогда
		
		ФОД_ЗаполнитьСтруктуру(ФорматДанных, ФорматДанных.__version, СсылкаНаДокумент);
		Результат = Новый Структура("Адрес,ТелоЗапроса,ТипДокумента", "", КНП_ЗаписатьJSONНаСервере(ФорматДанных), ИмяТипаДокумента );	
		
	Иначе
		Результат = Новый Структура("Адрес,ТелоЗапроса,ТипДокумента", "", "", ИмяТипаДокумента );		
	КонецЕсли;
	
	Возврат Результат;			

КонецФункции

Функция ЭДО_СформироватьКвитанциюОтУточнении(ИмяТипаДокумента, СсылкаНаДокумент, ПричинаОтклонения)
	//Changelog
	//
	//27.08.2019 - добавлены форматы описания уведомления об уточнении для товарной накладной и акта
	
	Результат = Неопределено;
	ФорматДанных = Неопределено;
	
	Если Найти(ИмяТипаДокумента, "передаточ") ИЛИ Найти(ИмяТипаДокумента, "(СЧФ)") 
		ИЛИ 
		(
		Найти(НРег(ИмяТипаДокумента), "счет-фактура") 
		И 
		НЕ Найти(НРег(ИмяТипаДокумента), "коррект") 
		) 
		Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Отклонить_УПД() );
	КонецЕсли;
	
	Если Найти(ИмяТипаДокумента, "УКД") ИЛИ Найти(НРег(ИмяТипаДокумента), "коррект") ИЛИ Найти(ИмяТипаДокумента, "(КСЧФ)") Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Отклонить_УКД() );
	КонецЕсли;
	
	Если Найти(НРег(ИмяТипаДокумента), "накладная") Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Отклонить_ТоварнаяНакладная() );
	КонецЕсли;
	
	Если Найти(НРег(ИмяТипаДокумента), "акт") Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Отклонить_Акт() );
	КонецЕсли;
	
	Если ФорматДанных <> Неопределено Тогда
		
		ФОД_ЗаполнитьСтруктуру(ФорматДанных, ФорматДанных.__version, СсылкаНаДокумент);
		ФорматДанных.clarification = ПричинаОтклонения;
		Результат = Новый Структура("Адрес,ТелоЗапроса", "", КНП_ЗаписатьJSONНаСервере(ФорматДанных) );	
		
	Иначе
		Результат = Новый Структура("Адрес,ТелоЗапроса", "", "" );	
	КонецЕсли;
	
	Возврат Результат;		

КонецФункции

Функция ЭДО_СформироватьЭД(СсылкаНаДокумент, УниверсальныйФормат = Истина) 
	
	Результат = Неопределено;
	
	Если МОП_ЭтоРеализацияТоваров(СсылкаНаДокумент) Тогда
		
		Если УниверсальныйФормат Тогда
			ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УПДДОП() );
		Иначе
			ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_ТоварнаяНакладная() );
		КонецЕсли;
		
	ИначеЕсли МОП_ЭтоАктВыполненныхРабот(СсылкаНаДокумент) Тогда
		
		Если УниверсальныйФормат Тогда
			ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УПДДОП() );
		Иначе
			ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Акт() ); 	
		КонецЕсли;
		
	ИначеЕсли МОП_ЭтоСчетНаОплату(СсылкаНаДокумент) Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_СчетНаОплату() );
		
	ИначеЕсли МОП_ЭтоСчетФактура(СсылкаНаДокумент) Тогда
		
		Если УниверсальныйФормат Тогда
			
			Если МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) ) Тогда
				ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УКД() );
			Иначе
				ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УПД() );
			КонецЕсли;
			
		Иначе
			
			Если МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) ) Тогда
				ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УКДСЧФ() );	
			Иначе
				ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УПДСЧФ() );
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли МОП_ЭтоКорректировкаРеализации(СсылкаНаДокумент) Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_УКДДИС() );
		
	//+Макрушин Е. 18.02.2026 #UT11-5806
	ИначеЕсли МОП_ЭтоАктОРасхожденияхПослеПриемки(СсылкаНаДокумент) Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_Торг2());
	
	//-Макрушин Е. 18.02.2026 #UT11-5806 
	//+Белов А. 17.06.2026 #UT10-5921
	ИначеЕсли МОП_ЭтоТранспортнаяНакладная(СсылкаНаДокумент) Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_ТранспортнаяНакладная());
	ИначеЕсли МОП_ЭтоЗаказЗаявка(СсылкаНаДокумент) Тогда
		ФорматДанных = ФОД_ПрочитатьФорматОписанияДокумента(ФОД_ПолучитьИмяМакета_ЗаказЗаявка());
	//-Белов А. 17.06.2026 #UT10-5921
	
	КонецЕсли;
	
	ФОД_ЗаполнитьСтруктуру(ФорматДанных, ФорматДанных.__version, СсылкаНаДокумент,, СсылкаНаДокумент);
	Результат = Новый Структура("Адрес,ТелоЗапроса", "", КНП_ЗаписатьJSONНаСервере(ФорматДанных) );	
	Возврат Результат;		

КонецФункции

Функция ЭДО_ОтправитьПодписанныйДокумент(Контрагент, ТипДокумента, Контент, Подпись, СсылкаНаДокумент = Неопределено)
	
	Результат = Неопределено;
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("from", ИдентификаторПодразделения);
	ИдентификаторыКонтрагента = РС_ПолучитьИдентификаторыКонтрагента(Контрагент);
	
	Если ЗначениеЗаполнено(ИдентификаторыКонтрагента) И ИдентификаторыКонтрагента.Свойство("ИдентификаторПодразделения") Тогда
		СтруктураТелаЗапроса.Вставить("to", ИдентификаторыКонтрагента.ИдентификаторПодразделения);	
	КонецЕсли;       
	
	//+Белов А. 26.06.2026 #
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		СтруктураТелаЗапроса.Вставить("carrier", ФОД_ПолучитьИдентификаторПеревозчика(Неопределено, СсылкаНаДокумент));	
	КонецЕсли;
	//-Белов А. 26.06.2026 #
	
	СтруктураТелаЗапроса.Вставить("content", Контент);
	СтруктураТелаЗапроса.Вставить("signature", КНП_ОбработатьСтрокуBase64(Подпись) );
	
	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		
		Если МОП_ЭтоНеформализованныйДокумент(СсылкаНаДокумент) Тогда
			
			СтруктураНеформализованного = ПолучитьДанныеНеформализованногоДокумента(СсылкаНаДокумент);
			
			Для Каждого ЭлементСтруктуры Из СтруктураНеформализованного Цикл
				
				Если НЕ СтруктураТелаЗапроса.Свойство(ЭлементСтруктуры.Ключ) Тогда
					СтруктураТелаЗапроса.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
				КонецЕсли;
				
			КонецЦикла;
			
			Результат = API_ОтправитьНеформализованныйДокумент(КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса), ЭДО_ДвухстороннийОбмен(ТипДокумента) ); 
			
		Иначе
			
			КорректируемыйДокумент = Неопределено;
			
			Если МОП_ЭтоКорректировкаРеализации(СсылкаНаДокумент) Тогда
				КорректируемыйДокумент = МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент);
			ИначеЕсли МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) ) Тогда
				КорректируемыйДокумент = МОП_ПолучитьСсылкуНаКорректировку(МОП_ПолучитьСсылкуНаКорректировку(СсылкаНаДокумент) );	
			КонецЕсли;
			
			Результат = API_ОтправитьДокументСПодписью(ТипДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );
			
		КонецЕсли;
		
	Иначе
		Результат = API_ОтправитьДокументСПодписью(ТипДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );	
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Соответствие") Тогда
		
		Если Результат.Получить("success") = Истина Тогда
			
			Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
				
				ЭтоУПД = (ТипДокумента = "УПД") ИЛИ Найти(ТипДокумента, "Универсальный");
				РС_ПривязатьИдентификаторКОбъекту1С(СсылкаНаДокумент, Результат.Получить("documentId"), Истина, ЭтоУПД );
				РС_ОбновитьСтатусДокументаЭДО(СсылкаНаДокумент, Результат.Получить("message") );	
				
			КонецЕсли;
			
		Иначе
			ВывестиУведомлениеПользователю(Результат.Получить("codeDescription") );
		КонецЕсли;
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, Контент, Подпись, Команда)
	
	Результат = Неопределено;
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("content", Контент);
	//СтруктураТелаЗапроса.Вставить("signature", КНП_ОбработатьСтрокуBase64(Подпись) );
	
	Если Команда = "Принять" Тогда
		Результат = API_ПринятьДокумент(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );	
	ИначеЕсли Команда = "Аннулировать" Тогда
		Результат = API_АннулироватьДокумент(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );	
	ИначеЕсли Команда = "ПринятьАннулирование" Тогда
		Результат = API_ПринятьАннулирование(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );	
	ИначеЕсли Команда = "ОтклонитьАннулирование" Тогда
		Результат = API_ОтклонитьАннулирование(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );
	ИначеЕсли Команда = "ОтказПодписи" Тогда
		
		СтруктураТелаЗапроса.Удалить("content");
		СтруктураТелаЗапроса.Вставить("reason", Контент);
		Результат = API_ОтклонитьДокумент(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );
		
	Иначе	
		Результат = API_ОтклонитьДокумент(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );	
	КонецЕсли;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_ЗагрузитьМассивВходящихЭД(ДатаНачала, ДатаКонца)
	
	ДобавитьВЖурнал("Вход в процедуру", "ЗагрузитьМассивВходящихЭД");
	СтруктураВозврата = Новый Структура("МассивПакетов,ОписаниеОшибки");
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("packageTypes[0]", "IN");
	СтруктураПараметров.Вставить("packageStates[0]", "complete");
	
	Если ВерсияAPI = "v1.2" Тогда
		СтруктураПараметров.Вставить("packageStates[1]", "accepted");
	КонецЕсли;
	
	ДанныеПакетов = API_ПолучитьСписокПакетов(СтруктураПараметров);
	
	Если ТипЗнч(ДанныеПакетов) <> Тип("Соответствие") Тогда
		
		СтруктураВозврата.ОписаниеОшибки = ДанныеПакетов;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Если ДанныеПакетов.Получить("success") <> Неопределено И ДанныеПакетов.Получить("success") Тогда
		
		МассивПакетов = ДанныеПакетов.Получить("rows");
		НовыйМассив = Новый Массив; 
		
		Если НЕ ЗначениеЗаполнено(МассивПакетов) Тогда
			
			СтруктураВозврата.МассивПакетов = НовыйМассив;
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
		Для Каждого Пакет Из МассивПакетов Цикл
			
			СистемноеИмяВидаДокументооборота = Пакет.Получить("packageFlowSystemName"); 
			
			Если СистемноеИмяВидаДокументооборота = "information_message" Тогда
				Продолжить;
			КонецЕсли;	
			
			ДатаИзменения = КНП_ПривестиКДате(Пакет.Получить("documentDate") );
			
			Если ДатаИзменения >= ДатаНачала И ДатаИзменения <= КонецДня(ДатаКонца) Тогда
				НовыйМассив.Добавить(Пакет);
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураВозврата.МассивПакетов = НовыйМассив;
		
	Иначе
		ВывестиУведомлениеПользователю(ДанныеПакетов.Получить("codeDescription") );	
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ЭДО_ПолучитьДанныеДокумента(ИдентификаторДокумента)
	
	ДобавитьВЖурнал("Вход в процедуру", "ПолучитьДанныеДокумента");
	Результат = API_ПолучитьДанныеДокумента(ИдентификаторДокумента);
	Возврат Результат;		

КонецФункции

Функция ЭДО_ПолучитьДанныеДокументаJSON(ИдентификаторДокумента) Экспорт
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	ДобавитьВЖурнал("Вход в процедуру", "ПолучитьДанныеДокументаJSON");
	Результат = API_ПолучитьДанныеДокументаJSON(ИдентификаторДокумента);
	
	Возврат Результат;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

Функция ЭДО_ПолучитьДанныеПакетаДокументов(ИдентификаторПакета)
	
	Результат = Новый Массив;
	
	ДанныеПакета = API_ПолучитьДанныеПакета(ИдентификаторПакета);
	
	Если ТипЗнч(ДанныеПакета) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат Результат;
		
	КонецЕсли;
	
	Если ДанныеПакета.Получить("success") <> Неопределено И ДанныеПакета.Получить("success") Тогда
		
		МассивДокументов = ДанныеПакета.Получить("documents");
		
		Для Каждого Документ Из МассивДокументов Цикл
			
			СтруктураДок = Новый Структура("ИдентификаторДокумента,Тип,Контент,Подпись,ИмяФайла,СистемноеИмя");
			СтруктураДок.ИдентификаторДокумента = Документ.Получить("id");
			СистемноеИмяДокумента = Документ.Получить("typeSystemName");
			ГруппаПроцессинга = Документ.Получить("packageFlowSystemName");
			СтруктураДок.Тип = ЭДО_РазобратьТипДокумента(СистемноеИмяДокумента, ГруппаПроцессинга, Документ.Получить("typeName") );
			СтруктураДок.Контент = Документ.Получить("content");
			СтруктураДок.ИмяФайла = Документ.Получить("clientFileName");
			СтруктураДок.Подпись = Документ.Получить("signature");
			СтруктураДок.СистемноеИмя = СистемноеИмяДокумента;
			Результат.Добавить(СтруктураДок);
			
		КонецЦикла;
		
	Иначе
		ДобавитьВЖурнал("Сообщение от сервера: " + ДанныеПакета.Получить("codeDescription"), "ПолучитьДанныеПакетаДокументов" );
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_ПолучитьДанныеАрхива(МассивДокументов)
	
	ДобавитьВЖурнал("Вход в процедуру", "ЭДО_ПолучитьДанныеАрхива");
	
	МассивДанныхПакета = Новый СписокЗначений;
	
	Для Каждого Пакет Из МассивДокументов Цикл
		
		ДанныеПакета = API_ПолучитьАрхивПакета(Формат(Пакет, "ЧГ=") );
		МассивДанныхПакета.Добавить(ДанныеПакета, Пакет);
		
	КонецЦикла;
	
	Возврат МассивДанныхПакета;

КонецФункции

Функция ЭДО_ПолучитьДанныеКонтрагентаПоИНН(ИННКонтрагента)
	
	ДанныеКонтрагента = API_ПоискКонтрагентаПоИНН(ИННКонтрагента);
	Результат = Неопределено;
	
	Если ТипЗнч(ДанныеКонтрагента) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ДанныеКонтрагента;
		
	КонецЕсли;
	
	Если ДанныеКонтрагента.Получить("success") <> Неопределено Тогда
		
		Если ДанныеКонтрагента.Получить("success") = Истина Тогда
			
			Если ДанныеКонтрагента.Получить("recordsTotal") = 0 Тогда
				Результат = "В системе ЭДО отсутствует контрагент с ИНН " + ИННКонтрагента;
			Иначе
				Результат = ДанныеКонтрагента.Получить("rows")[0];
			КонецЕсли;
			
		Иначе
			
			ТекстОшибки = ДанныеКонтрагента.Получить("codeDescription");
			Результат = ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭДО_ПолучитьДанныеКонтрагентаПоИД(ИДКонтрагента)
	
	ДанныеКонтрагента = API_ПолучитьКонтрагентаПоИД(ИДКонтрагента);
	Результат = Неопределено;
	
	Если ТипЗнч(ДанныеКонтрагента) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ДанныеКонтрагента;
		
	КонецЕсли;
	
	Результат = ДанныеКонтрагента;
	Возврат Результат;	

КонецФункции

Функция ЭДО_МассовоСоздатьДокументы(МассивСтруктур)
	
	Если ТипЗнч(МассивСтруктур) <> Тип("Массив") Тогда
		
		ДобавитьВЖурнал("Некорректный тип параметра ""МассивСтруктур""", "ЭДО_МассовоСоздатьДокументы");
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТаблицаМассивУИД = Новый ТаблицаЗначений;
	ТаблицаМассивУИД.Колонки.Добавить("Ссылка");
	ТаблицаМассивУИД.Колонки.Добавить("ТипДокумента");
	ТаблицаМассивУИД.Колонки.Добавить("УИД");
	
	ТелоЗапросаСтруктура = Новый Структура("requests", Новый Массив);
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		
		СтруктураЗапроса = Новый Структура("request,documentType,trackingNumber");
		
		СтруктураТелаЗапроса = Новый Структура;
		СтруктураТелаЗапроса.Вставить("from", ИдентификаторПодразделения);
		ИдентификаторыКонтрагента = РС_ПолучитьИдентификаторыКонтрагента(ЭлементМассива.Контрагент);
		
		Если ЗначениеЗаполнено(ИдентификаторыКонтрагента) И ИдентификаторыКонтрагента.Свойство("ИдентификаторПодразделения") Тогда
			СтруктураТелаЗапроса.Вставить("to", ИдентификаторыКонтрагента.ИдентификаторПодразделения);	
		КонецЕсли;   
		
		//+Белов А. 14.07.2026 #UT10-5954
		Если ЭлементМассива.ТипДокумента = "Транспортная накладная" Тогда
			СтруктураТелаЗапроса.Вставить("carrier", ФОД_ПолучитьИдентификаторПеревозчика("", ЭлементМассива.СсылкаНаДокумент));	
		КонецЕсли;
		//-Белов А. 14.07.2026 #UT10-5954
		
		Если ЗначениеЗаполнено(ЭлементМассива.СсылкаНаДокумент) Тогда
			
			Если МОП_ЭтоНеформализованныйДокумент(ЭлементМассива.СсылкаНаДокумент) Тогда
				
				СтруктураНеформализованного = ПолучитьДанныеНеформализованногоДокумента(ЭлементМассива.СсылкаНаДокумент);
				
				Для Каждого ЭлементСтруктуры Из СтруктураНеформализованного Цикл
					
					Если НЕ СтруктураТелаЗапроса.Свойство(ЭлементСтруктуры.Ключ) Тогда
						СтруктураТелаЗапроса.Вставить(ЭлементСтруктуры.Ключ, ЭлементСтруктуры.Значение);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				
				КорректируемыйДокумент = Неопределено;
				
				Если МОП_ЭтоКорректировкаРеализации(ЭлементМассива.СсылкаНаДокумент) Тогда
					КорректируемыйДокумент = МОП_ПолучитьСсылкуНаКорректировку(ЭлементМассива.СсылкаНаДокумент);
				ИначеЕсли МОП_ЭтоКорректировкаРеализации(МОП_ПолучитьСсылкуНаКорректировку(ЭлементМассива.СсылкаНаДокумент) ) Тогда
					КорректируемыйДокумент = МОП_ПолучитьСсылкуНаКорректировку(МОП_ПолучитьСсылкуНаКорректировку(ЭлементМассива.СсылкаНаДокумент) );					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураТелаЗапроса.Вставить("content", ЭлементМассива.Контент);
		
		СтруктураЗапроса.request = СтруктураТелаЗапроса;
		СтруктураЗапроса.documentType = ЭДО_ОпределитьТипДокументаДляЭДО(ЭлементМассива.ТипДокумента);
		СтруктураЗапроса.trackingNumber = Строка(ЭлементМассива.СсылкаНаДокумент.УникальныйИдентификатор() );
		
		СтрокаТаблицыСоответствий = ТаблицаМассивУИД.Добавить();
		СтрокаТаблицыСоответствий.Ссылка = ЭлементМассива.СсылкаНаДокумент;
		СтрокаТаблицыСоответствий.УИД = СтруктураЗапроса.trackingNumber;
		СтрокаТаблицыСоответствий.ТипДокумента = ЭлементМассива.ТипДокумента;
		ТелоЗапросаСтруктура.requests.Добавить(СтруктураЗапроса);
		
	КонецЦикла;
	
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(ТелоЗапросаСтруктура);
	Результат = API_МассовоеСозданиеДокументов(ТелоЗапроса);
	МассивДокументов = Новый Массив;
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат МассивДокументов;
	КонецЕсли;
	
	МассивЭлементовОтвета = Результат.Получить("requests");
	
	Для Каждого ЭлементОтвета Из МассивЭлементовОтвета Цикл
		
		УИДДокумента = ЭлементОтвета.Получить("trackingNumber");
		СтрокаСоответствия = ТаблицаМассивУИД.Найти(УИДДокумента, "УИД");
		
		Если СтрокаСоответствия = Неопределено Тогда
			
			ДобавитьВЖурнал("Не удалось определить ссылку по уид-у " + УИДДокумента, "МассовоСоздатьДокументыВЭДО");
			Продолжить;
			
		КонецЕсли;
		
		Если ЭлементОтвета.Получить("success") = Истина Тогда
			
			ЭтоУПД = (СтрокаСоответствия.ТипДокумента = "УПД") ИЛИ Найти(СтрокаСоответствия.ТипДокумента, "Универсальный");
			РС_ПривязатьИдентификаторКОбъекту1С(СтрокаСоответствия.Ссылка, ЭлементОтвета.Получить("documentId"), Истина, ЭтоУПД);
			
		КонецЕсли;
		
		СтруктураДанныхОбъекта = Новый Структура("Ссылка,Результат", СтрокаСоответствия.Ссылка, ЭлементОтвета);
		МассивДокументов.Добавить(СтруктураДанныхОбъекта);
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

Функция ЭДО_МассовоОтправитьПодписанныеДокументы(МассивСтруктур)	
	
	Если ТипЗнч(МассивСтруктур) <> Тип("Массив") Тогда
		
		ДобавитьВЖурнал("Некорректный тип параметра ""МассивСтруктур""", "МассовоОтправитьПодписанныеДокументы");  
		Возврат Неопределено;
		
	КонецЕсли;
	
	ТелоЗапросаСтруктура = Новый Структура("requests", Новый Массив);
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл
		
		СтруктураЗапроса = Новый Структура("documentId,request,trackingNumber");
		
		СтруктураТелаЗапроса = Новый Структура;
		СтруктураТелаЗапроса.Вставить("content", ЭлементМассива.Контент);
		СтруктураТелаЗапроса.Вставить("signature", КНП_ОбработатьСтрокуBase64(ЭлементМассива.Подпись) );
		
		СтруктураЗапроса.request = СтруктураТелаЗапроса;
		СтруктураЗапроса.documentId = ЭлементМассива.ИдентификаторДокумента;
		СтруктураЗапроса.trackingNumber = Строка(ЭлементМассива.ИдентификаторДокумента);
		ТелоЗапросаСтруктура.requests.Добавить(СтруктураЗапроса);
		
	КонецЦикла;
	
	ТелоЗапроса = КНП_ЗаписатьJSONНаСервере(ТелоЗапросаСтруктура);
	Результат = API_МассовоеПодписаниеДокументов(ТелоЗапроса);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		
		ВывестиУведомлениеПользователю(Результат);
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции


Функция ЭДО_ПолучитьСписокКонтрагентовВСистеме(МассивИНН)
	
	ДанныеСписка = API_МассовыйПоискПоИНН(МассивИНН);
	Результат = Новый Массив;
	
	Если ТипЗнч(ДанныеСписка) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат Результат;
		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеСписка) = Тип("Соответствие") И ДанныеСписка.Получить("success") = Истина И ТипЗнч(ДанныеСписка.Получить("rows") ) = Тип("Массив") Тогда
		
		МассивДанных = ДанныеСписка.Получить("rows");
		
		Для Каждого ЭлементСписка Из МассивДанных Цикл
			
			СтруктураДанных = Новый Структура("ИНН,ИдентификаторКонтрагента,Пригласить");
			СтруктураДанных.ИНН = ЭлементСписка.Получить("inn");
			СтруктураДанных.ИдентификаторКонтрагента = ЭлементСписка.Получить("id");
			СтруктураДанных.Пригласить = ЭлементСписка.Получить("relation") = Неопределено;
			Результат.Добавить(СтруктураДанных);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписатьЖурналВФайл();
	Возврат Результат;

КонецФункции

Функция ЭДО_ПолучитьСписокДоступныхСертификатов(АдресСервера, СписокОтпечатков)
	
	КНП_СкорректироватьАдресСервера(АдресСервера);	
	МассивДоступныхОтпечатков = Новый Массив;
	
	Если ТипЗнч(СписокОтпечатков) <> Тип("Массив") Тогда
		Возврат МассивДоступныхОтпечатков;
	КонецЕсли;
	
	Результат = API_ПолучитьСписокДоступныхСертификатов(СписокОтпечатков);
	
	Если ТипЗнч(Результат) = Тип("Соответствие") И Результат.Получить("success") = Истина Тогда
		
		Для Каждого Отпечаток Из Результат.Получить("thumbprints") Цикл  
			МассивДоступныхОтпечатков.Добавить(Отпечаток.Получить("thumbprint") );
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
		
		СтрокаТелаЗапроса = "front/certificate/diff?";
		
		Для Каждого Отпечаток Из СписокОтпечатков Цикл
			СтрокаТелаЗапроса = СтрокаТелаЗапроса + "thumbprints" + КНП_URLEncode("[]") + "=" + Отпечаток + "&";
		КонецЦикла;
		
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Cookie", "PHPSESSID=4nu3vk6u0o9n8d7vqd48b5v081");
		
		СтрокаТелаЗапроса = Лев(СтрокаТелаЗапроса, СтрДлина(СтрокаТелаЗапроса) - 1);
		СтруктураОтвета = ОтправитьGetЗапрос(HostAddress + СтрокаТелаЗапроса, ЗаголовкиЗапроса);
		
		Если СтруктураОтвета.КодОтвета = 404 Тогда
			
			СтрокаТелаЗапроса = СтрЗаменить(СтрокаТелаЗапроса, "front/", "auth/");
			СтруктураОтвета = ОтправитьGetЗапрос(HostAddress + СтрокаТелаЗапроса, ЗаголовкиЗапроса);
			
		КонецЕсли;
		
		ТекстОтвета = СтруктураОтвета.Ответ;
		
		Если НЕ ЗначениеЗаполнено(СтруктураОтвета.Заголовки) Тогда
			
			ВывестиУведомлениеПользователю(СтруктураОтвета.Ответ);
			Возврат Неопределено;
			
		Иначе
			
			Попытка
				
				ТекстJSON = КНП_ПрочитатьJSONОтСервера(ТекстОтвета);
				МассивОтпечатков = ТекстJSON.Получить("thumbprints");
				
				Если ТипЗнч(МассивОтпечатков) = Тип("Массив") Тогда
					
					Для Каждого ЭлементОтпечатка Из МассивОтпечатков Цикл
						МассивДоступныхОтпечатков.Добавить(ЭлементОтпечатка.Получить("thumbprint") );
					КонецЦикла;
					
				КонецЕсли;		
				
			Исключение
				
				ДобавитьВЖурнал("Не удалось получить перечень сертификатов: " + ИнформацияОбОшибке().Причина.Описание, "ПолучитьСписокДоступныхСертификатов");
				
				Если СтруктураОтвета.КодОтвета = 502 ИЛИ СтруктураОтвета.КодОтвета = 500 ИЛИ СтруктураОтвета.КодОтвета = 503 Тогда
					ВывестиУведомлениеПользователю("На сервере произошла непредвиденная ошибка. Повторите ваш запрос позже");
				ИначеЕсли СтруктураОтвета.КодОтвета = 404 Тогда
					ВывестиУведомлениеПользователю("Отправлен запрос на несуществующий метод. Обратитесь к разработчику!");
				ИначеЕсли СтруктураОтвета.КодОтвета <> 200 Тогда
					ВывестиУведомлениеПользователю("Ответ от сервера не соответствует ожидаемому. Для получения подробностей обратитесь к журналу регистрации обработки");
				Иначе
					ВывестиУведомлениеПользователю(ИнформацияОбОшибке().Причина.Описание);
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЕсли;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат МассивДоступныхОтпечатков;

КонецФункции

Функция ЭДО_ПолучитьСписокДокументовВОбработке(ДатаНачала = Неопределено, ДатаКонца = Неопределено)
	
	ТаблицаДанных = ДокументыВОбработке.Выгрузить();
	ТаблицаДанных.Очистить();
	
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("packageGroupStates[0]", "processing");
	ДанныеДокументов = API_ПолучитьСписокПакетов(СтруктураПараметров);
	
	Если ТипЗнч(ДанныеДокументов) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ТаблицаДанных;
		
	КонецЕсли;
	
	Если ДанныеДокументов.Получить("success") <> Неопределено И ДанныеДокументов.Получить("success") Тогда
		
		СписокДокументов = ДанныеДокументов.Получить("rows");
		
		Если СписокДокументов <> Неопределено И СписокДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументВОбработке Из СписокДокументов Цикл
				
				СистемноеИмяДокумента = ДокументВОбработке.Получить("documentTypeSystemName");
				СтатусПакета = ДокументВОбработке.Получить("packageStateSystemName");
				
				Если ДокументВОбработке.Получить("subFlowStateSystemName") <> Неопределено  Тогда
					СтатусПакета = ДокументВОбработке.Получить("subFlowStateSystemName");
				КонецЕсли;
				
				Если ДокументВОбработке.Получить("documentStatusSystemName") = "draft" Тогда 
					Продолжить 
				КонецЕсли;
				
				Если СтатусПакета = "complete" ИЛИ Найти(СтатусПакета, "declined") ИЛИ СтатусПакета = "accepted" ИЛИ СтатусПакета = "interrupted" Тогда
					Продолжить;
				КонецЕсли;
				
				ДатаДокумента = КНП_ПривестиКДате(ДокументВОбработке.Получить("documentDate") );
				
				Если ТипЗнч(ДатаДокумента) <> Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(ДатаНачала) = Тип("Дата") Тогда
					
					Если ДатаДокумента < ДатаНачала Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипЗнч(ДатаКонца) = Тип("Дата") Тогда
					
					Если ДатаДокумента > ДатаКонца Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				Если ДокументВОбработке.Получить("packageType") = "OUT" Тогда
					СтрокаТаблицы.Исходящий = Истина;
				КонецЕсли;
				
				СтрокаТаблицы.Номер = ДокументВОбработке.Получить("documentNumber");
				СтрокаТаблицы.Дата = ДатаДокумента; 
				СтрокаТаблицы.ИдентификаторОтправителя = ДокументВОбработке.Получить("fromDivisionId");					
				СтрокаТаблицы.ИдентификаторПолучателя = ДокументВОбработке.Получить("toDivisionId");
				ИдОтправителя = ДокументВОбработке.Получить("fromCompanyId");
				ИдПолучателя = ДокументВОбработке.Получить("toCompanyId");
				СтрокаТаблицы.Отправитель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторОтправителя, ИдОтправителя);
				СтрокаТаблицы.Получатель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторПолучателя, ИдПолучателя);
				СтрокаТаблицы.ИдентификаторДокумента = ДокументВОбработке.Получить("documentId");
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowSystemName");
				СтрокаТаблицы.ОжидаемыеДействия = ЭДО_РазобратьОжидаемоеДействие(СтатусПакета, 
				СтрокаТаблицы.ГруппаПроцессинга, 
				ДокументВОбработке.Получить("packageType") );
				СтрокаТаблицы.Тип = ЭДО_РазобратьТипДокумента(СистемноеИмяДокумента, СтрокаТаблицы.ГруппаПроцессинга);
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowGroup") + "_" + СтрокаТаблицы.ГруппаПроцессинга;
				СтрокаТаблицы.СистемноеИмя = СистемноеИмяДокумента;
				//Работа с контейнерами
				СтрокаТаблицы.ИДКонтейнера = ДокументВОбработке.Получить("containerUid");
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИДКонтейнера) Тогда
					СтрокаТаблицы.СвязныйКонтейнер = (ДокументВОбработке.Получить("containerType") <> "decoupled");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ТаблицаДанных.Сортировать("ИдентификаторДокумента Убыв");
	Возврат ТаблицаДанных;

КонецФункции

Функция ЭДО_ПолучитьСписокДокументовНаПодпись()
	
	МассивСтруктур = Новый Массив;
	ДанныеДокументов = API_ПолучитьСписокДокументовКПодписанию();
	
	Если ТипЗнч(ДанныеДокументов) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат МассивСтруктур;
		
	КонецЕсли;
	
	Если ДанныеДокументов.Получить("success") <> Неопределено И ДанныеДокументов.Получить("success") Тогда
		
		СписокДокументов = ДанныеДокументов.Получить("documents");
		
		Если СписокДокументов <> Неопределено И СписокДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументВОбработке Из СписокДокументов Цикл
				
				ИДДокумента = ДокументВОбработке.Получить("id");
				Контент = ДокументВОбработке.Получить("content");
				
				Если Контент = Неопределено Тогда
					Контент = API_ПолучитьДанныеДокумента(ИДДокумента).Контент;
				КонецЕсли;	
				
				СтрТаблицыДанных = Новый Структура("ИдентификаторДокумента,Контент");
				СтрТаблицыДанных.ИдентификаторДокумента = ИДДокумента;
				СтрТаблицыДанных.Контент = Контент;					
				МассивСтруктур.Добавить(СтрТаблицыДанных);
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат МассивСтруктур;

КонецФункции

Функция ЭДО_ПолучитьСписокДокументовЗавершенных(ДатаНачала = Неопределено, ДатаКонца = Неопределено, ЛимитДокументовПриОбновленииСтатусовДокументов = 500)
	
	ТаблицаДанных = ДокументыВОбработке.Выгрузить();
	ТаблицаДанных.Очистить();
	
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("packageGroupStates[0]", "completed");
	СтруктураПараметров.Вставить("packageTypes[0]", "OUT");
	
	ДанныеДокументов = API_ПолучитьСписокПакетов(СтруктураПараметров, ЛимитДокументовПриОбновленииСтатусовДокументов);
	
	Если ТипЗнч(ДанныеДокументов) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ТаблицаДанных;
		
	КонецЕсли;
	
	Если ДанныеДокументов.Получить("success") <> Неопределено И ДанныеДокументов.Получить("success") Тогда
		
		СписокДокументов = ДанныеДокументов.Получить("rows");
		
		Если СписокДокументов <> Неопределено И СписокДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументВОбработке Из СписокДокументов Цикл
				
				СистемноеИмяДокумента = ДокументВОбработке.Получить("documentTypeSystemName");
				СтатусПакета = ДокументВОбработке.Получить("packageStateSystemName");
				
				Если ДокументВОбработке.Получить("subFlowStateSystemName") <> Неопределено  Тогда
					СтатусПакета = ДокументВОбработке.Получить("subFlowStateSystemName");
				КонецЕсли;
				
				ДатаДокумента = КНП_ПривестиКДате(ДокументВОбработке.Получить("documentDate") );
				
				Если ТипЗнч(ДатаДокумента) <> Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(ДатаНачала) = Тип("Дата") Тогда
					
					Если ДатаДокумента < ДатаНачала Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипЗнч(ДатаКонца) = Тип("Дата") Тогда
					
					Если ДатаДокумента > ДатаКонца Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				Если ДокументВОбработке.Получить("packageType") = "OUT" Тогда
					СтрокаТаблицы.Исходящий = Истина;
				КонецЕсли;
				
				СтрокаТаблицы.Номер = ДокументВОбработке.Получить("documentNumber");
				СтрокаТаблицы.Дата = ДатаДокумента; 
				СтрокаТаблицы.ИдентификаторОтправителя = ДокументВОбработке.Получить("fromDivisionId");					
				СтрокаТаблицы.ИдентификаторПолучателя = ДокументВОбработке.Получить("toDivisionId");
				ИдОтправителя = ДокументВОбработке.Получить("fromCompanyId");
				ИдПолучателя = ДокументВОбработке.Получить("toCompanyId");
				СтрокаТаблицы.Отправитель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторОтправителя, ИдОтправителя);
				СтрокаТаблицы.Получатель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторПолучателя, ИдПолучателя);
				СтрокаТаблицы.ИдентификаторДокумента = ДокументВОбработке.Получить("documentId");
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowSystemName");
				СтрокаТаблицы.ОжидаемыеДействия = ЭДО_РазобратьОжидаемоеДействие(СтатусПакета, 
				СтрокаТаблицы.ГруппаПроцессинга, 
				ДокументВОбработке.Получить("packageType") );
				СтрокаТаблицы.Тип = ЭДО_РазобратьТипДокумента(СистемноеИмяДокумента, СтрокаТаблицы.ГруппаПроцессинга);
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowGroup") + "_" + СтрокаТаблицы.ГруппаПроцессинга;
				СтрокаТаблицы.СистемноеИмя = СистемноеИмяДокумента;
				//Работа с контейнерами
				СтрокаТаблицы.ИДКонтейнера = ДокументВОбработке.Получить("containerUid");
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИДКонтейнера) Тогда
					СтрокаТаблицы.СвязныйКонтейнер = (ДокументВОбработке.Получить("containerType") <> "decoupled");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ТаблицаДанных.Сортировать("ИдентификаторДокумента Убыв");
	Возврат ТаблицаДанных;

КонецФункции

Функция ПолучитьДокументыЗавершенные(ДатаНачала, ДатаКонца, ЛимитДокументовПриОбновленииСтатусовДокументов = 500) Экспорт
	
	ТаблицаДанных = ЭДО_ПолучитьСписокДокументовЗавершенных(ДатаНачала, ДатаКонца, ЛимитДокументовПриОбновленииСтатусовДокументов);
	ЗаписатьЖурналВФайл();
	Возврат ТаблицаДанных;

КонецФункции

Функция ЭДО_ПолучитьСписокДокументовОжидающихПодписи(ДатаНачала = Неопределено, ДатаКонца = Неопределено, ЛимитДокументовПриОбновленииСтатусовДокументов = 500)
	
	ТаблицаДанных = ДокументыВОбработке.Выгрузить();
	ТаблицаДанных.Очистить();
	
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("packageStates[0]", "waiting_for_decision");
	СтруктураПараметров.Вставить("packageTypes[0]", "OUT");
	
	ДанныеДокументов = API_ПолучитьСписокПакетов(СтруктураПараметров, ЛимитДокументовПриОбновленииСтатусовДокументов);
	
	Если ТипЗнч(ДанныеДокументов) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ТаблицаДанных;
		
	КонецЕсли;
	
	Если ДанныеДокументов.Получить("success") <> Неопределено И ДанныеДокументов.Получить("success") Тогда
		
		СписокДокументов = ДанныеДокументов.Получить("rows");
		
		Если СписокДокументов <> Неопределено И СписокДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументВОбработке Из СписокДокументов Цикл
				
				СистемноеИмяДокумента = ДокументВОбработке.Получить("documentTypeSystemName");
				СтатусПакета = ДокументВОбработке.Получить("packageStateSystemName");
				
				Если ДокументВОбработке.Получить("subFlowStateSystemName") <> Неопределено  Тогда
					СтатусПакета = ДокументВОбработке.Получить("subFlowStateSystemName");
				КонецЕсли;
				
				ДатаДокумента = КНП_ПривестиКДате(ДокументВОбработке.Получить("documentDate") );
				
				Если ТипЗнч(ДатаДокумента) <> Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(ДатаНачала) = Тип("Дата") Тогда
					
					Если ДатаДокумента < ДатаНачала Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				
				Если ТипЗнч(ДатаКонца) = Тип("Дата") Тогда
					
					Если ДатаДокумента > ДатаКонца Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				Если ДокументВОбработке.Получить("packageType") = "OUT" Тогда
					СтрокаТаблицы.Исходящий = Истина;
				КонецЕсли;
				
				СтрокаТаблицы.Номер = ДокументВОбработке.Получить("documentNumber");
				СтрокаТаблицы.Дата = ДатаДокумента; 
				СтрокаТаблицы.ИдентификаторОтправителя = ДокументВОбработке.Получить("fromDivisionId");					
				СтрокаТаблицы.ИдентификаторПолучателя = ДокументВОбработке.Получить("toDivisionId");
				ИдОтправителя = ДокументВОбработке.Получить("fromCompanyId");
				ИдПолучателя = ДокументВОбработке.Получить("toCompanyId");
				СтрокаТаблицы.Отправитель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторОтправителя, ИдОтправителя);
				СтрокаТаблицы.Получатель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификатору(СтрокаТаблицы.ИдентификаторПолучателя, ИдПолучателя);
				СтрокаТаблицы.ИдентификаторДокумента = ДокументВОбработке.Получить("documentId");
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowSystemName");
				СтрокаТаблицы.ОжидаемыеДействия = ЭДО_РазобратьОжидаемоеДействие(СтатусПакета, 
				СтрокаТаблицы.ГруппаПроцессинга, 
				ДокументВОбработке.Получить("packageType") );
				СтрокаТаблицы.Тип = ЭДО_РазобратьТипДокумента(СистемноеИмяДокумента, СтрокаТаблицы.ГруппаПроцессинга);
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowGroup") + "_" + СтрокаТаблицы.ГруппаПроцессинга;
				СтрокаТаблицы.СистемноеИмя = СистемноеИмяДокумента;
				//Работа с контейнерами
				СтрокаТаблицы.ИДКонтейнера = ДокументВОбработке.Получить("containerUid");
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИДКонтейнера) Тогда
					СтрокаТаблицы.СвязныйКонтейнер = (ДокументВОбработке.Получить("containerType") <> "decoupled");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	ТаблицаДанных.Сортировать("ИдентификаторДокумента Убыв");
	Возврат ТаблицаДанных;

КонецФункции

Функция ЭДО_ПолучитьСписокДокументовВходящиеОжидающихПодписи(ДатаНачала = Неопределено, ДатаКонца = Неопределено, ГруппаДокументов = "", Лимит = 1000, Префикс = "")
	
	//+Макрушин Е. 18.03.2026 #UT10-5658
	ТаблицаДанных = ДокументыВОбработке.Выгрузить();
	ТаблицаДанных.Очистить();
	
	СтруктураПараметров = Новый Соответствие;
	СтруктураПараметров.Вставить("packageStates[0]", "waiting_for_decision" + Префикс);
	СтруктураПараметров.Вставить("packageTypes[0]", "IN");   
	
	Если ЗначениеЗаполнено(ГруппаДокументов) Тогда
		СтруктураПараметров.Вставить("documentFlows[0]", ГруппаДокументов);	
	КонецЕсли;  
	
	ДанныеДокументов = API_ПолучитьСписокПакетов(СтруктураПараметров, Лимит);
	
	Если ТипЗнч(ДанныеДокументов) <> Тип("Соответствие") Тогда
		
		ЗаписатьЖурналВФайл();
		Возврат ТаблицаДанных;
		
	КонецЕсли;
	
	Если ДанныеДокументов.Получить("success") <> Неопределено И ДанныеДокументов.Получить("success") Тогда
		
		СписокДокументов = ДанныеДокументов.Получить("rows");
		
		Если СписокДокументов <> Неопределено И СписокДокументов.Количество() > 0 Тогда
			
			Для Каждого ДокументВОбработке Из СписокДокументов Цикл
				
				СистемноеИмяДокумента = ДокументВОбработке.Получить("documentTypeSystemName");
				СтатусПакета = ДокументВОбработке.Получить("packageStateSystemName");
				
				Если ДокументВОбработке.Получить("subFlowStateSystemName") <> Неопределено  Тогда
					СтатусПакета = ДокументВОбработке.Получить("subFlowStateSystemName");
				КонецЕсли;
				//Если ДокументВОбработке.Получить("documentStatusSystemName") = "draft" Тогда Продолжить КонецЕсли;
				//Если СтатусПакета = "complete" ИЛИ Найти(СтатусПакета, "declined") ИЛИ СтатусПакета = "accepted" ИЛИ СтатусПакета = "interrupted" Тогда
				//	Продолжить;
				//КонецЕсли;
				
				ДатаДокумента = КНП_ПривестиКДате(ДокументВОбработке.Получить("documentDate") );
				
				Если ТипЗнч(ДатаДокумента) <> Тип("Дата") Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(ДатаНачала) = Тип("Дата") Тогда
					
					Если ДатаДокумента < ДатаНачала Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				Если ТипЗнч(ДатаКонца) = Тип("Дата") Тогда
					
					Если ДатаДокумента > ДатаКонца Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрокаТаблицы = ТаблицаДанных.Добавить();
				
				Если ДокументВОбработке.Получить("packageType") = "OUT" Тогда
					СтрокаТаблицы.Исходящий = Истина;
				КонецЕсли;
				
				СтрокаТаблицы.Номер = ДокументВОбработке.Получить("documentNumber");
				СтрокаТаблицы.Дата = ДатаДокумента; 
				СтрокаТаблицы.ИдентификаторОтправителя = ДокументВОбработке.Получить("fromDivisionId");					
				СтрокаТаблицы.ИдентификаторПолучателя = ДокументВОбработке.Получить("toDivisionId");
				ИдОтправителя = ДокументВОбработке.Получить("fromCompanyId");
				ИдПолучателя = ДокументВОбработке.Получить("toCompanyId");
				СтрокаТаблицы.Отправитель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификаторуИзДоговора(СтрокаТаблицы.ИдентификаторОтправителя, ИдОтправителя, Истина);
				СтрокаТаблицы.Получатель = РС_ПолучитьОрганизациюКонтрагентаПоИдентификаторуИзДоговора(СтрокаТаблицы.ИдентификаторПолучателя, ИдПолучателя);
				СтрокаТаблицы.ИдентификаторДокумента = ДокументВОбработке.Получить("documentId");
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowSystemName");
				СтрокаТаблицы.ОжидаемыеДействия = ЭДО_РазобратьОжидаемоеДействие(СтатусПакета, 
																					СтрокаТаблицы.ГруппаПроцессинга, 
																					ДокументВОбработке.Получить("packageType") );
				СтрокаТаблицы.Тип = ЭДО_РазобратьТипДокумента(СистемноеИмяДокумента, СтрокаТаблицы.ГруппаПроцессинга);
				СтрокаТаблицы.ГруппаПроцессинга = ДокументВОбработке.Получить("packageFlowGroup") + "_" + СтрокаТаблицы.ГруппаПроцессинга;
				СтрокаТаблицы.СистемноеИмя = СистемноеИмяДокумента;
				//Работа с контейнерами
				СтрокаТаблицы.ИДКонтейнера = ДокументВОбработке.Получить("containerUid");
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.ИДКонтейнера) Тогда
					СтрокаТаблицы.СвязныйКонтейнер = (ДокументВОбработке.Получить("containerType") <> "decoupled");
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаДанных.Сортировать("ИдентификаторДокумента Убыв");
	Возврат ТаблицаДанных;
    //-Макрушин Е. 18.03.2026 #UT10-5658
	
КонецФункции

Функция ПолучитьДокументыОжидающиеПодписи(ДатаНачала, ДатаКонца, ЛимитДокументовПриОбновленииСтатусовДокументов = 500) Экспорт
	
	ТаблицаДанных = ЭДО_ПолучитьСписокДокументовОжидающихПодписи(ДатаНачала, ДатаКонца, ЛимитДокументовПриОбновленииСтатусовДокументов);
	ЗаписатьЖурналВФайл();
	Возврат ТаблицаДанных;

КонецФункции

Функция ПолучитьДокументыВходящиеОжидающиеПодписи(ДатаНачала, ДатаКонца, ГруппаДокументов = "", Лимит = 1000, Префикс = "") Экспорт
	
	//+Макрушин Е. 18.03.2026 #UT10-5658
	ТаблицаДанных = ЭДО_ПолучитьСписокДокументовВходящиеОжидающихПодписи(ДатаНачала, ДатаКонца, ГруппаДокументов, Лимит, Префикс);
	ЗаписатьЖурналВФайл();
	
	Возврат ТаблицаДанных;
	//-Макрушин Е. 18.03.2026 #UT10-5658
	
КонецФункции

Функция ЭДО_ПодписатьСлужебныйДокумент(ИдентификаторДокумента, Контент, Подпись)
	
	Результат = Неопределено;
	ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ПодписатьДокумент.Начало",,,ТекущаяУниверсальнаяДатаВМиллисекундах() );
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("content", Контент);
	СтруктураТелаЗапроса.Вставить("signature", КНП_ОбработатьСтрокуBase64(Подпись) );
	Результат = API_ПодписатьСлужебныйДокумент(ИдентификаторДокумента, КНП_ЗаписатьJSONНаСервере(СтруктураТелаЗапроса) );
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Результат = Неопределено;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("DS_ЗамерВремени.ПодписатьДокумент.Конец",,,ТекущаяУниверсальнаяДатаВМиллисекундах() );
	Возврат Результат;

КонецФункции


//////////////////////////////////////////////////////////////////////////
//Дополнительные обработчики
//////////////////////////////////////////////////////////////////////////
Функция РосМарк_ПоискЗаданияНаПеревозку(НомерНакладной)
	
	//==Специфичный блок кода
	Если ВеткаРазработки = "РосМарк" Тогда
		
		ЗаданиеНаПеревозку = Документы.ЗаданиеНаПеревозку.ПустаяСсылка();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаданиеНаПеревозку.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		|ГДЕ
		|	ЗаданиеНаПеревозку._НомераНакладных ПОДОБНО &НомерНакладной";
		
		Запрос.УстановитьПараметр("НомерНакладной", НомерНакладной);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаданиеНаПеревозку = Выборка.Ссылка;
		КонецЕсли;
		
		Возврат ЗаданиеНаПеревозку;
		
	КонецЕсли;
	//==Специфичный блок кода
	
	Возврат Неопределено;

КонецФункции

Функция РосМарк_ПоискЗаказаПоставщику(НомерНакладной)
	
	//==Специфичный блок кода
	Если ВеткаРазработки = "РосМарк" Тогда
		
		ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.НомерПоДаннымПоставщика ПОДОБНО &НомерНакладной
		|	И ЗаказПоставщику.ПометкаУдаления = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("НомерНакладной", НомерНакладной);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЗаказПоставщику = Выборка.Ссылка;
		КонецЕсли;
		
		Возврат ЗаказПоставщику;
		
	КонецЕсли;
	//==Специфичный блок кода
	
	Возврат Неопределено;

КонецФункции

Функция РосМарк_ПроверитьСоответствиеСчетаИУПД(ОбъектДанных)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипЗнч(ОбъектДанных) <> Тип("Структура") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ОбъектДанных.Свойство("ТабличнаяЧасть") Тогда
		Возврат "";
	КонецЕсли;
	
	ТаблицаТоваров = РС_ОбработатьТЧСтруктурыПФ(ОбъектДанных.ТабличнаяЧасть);	
	
	ЗаказПоставщику = РосМарк_ПоискЗаказаПоставщику(ОбъектДанных.Номер);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗначениеЗаполнено(ЗаказПоставщику) Тогда
		
		Если ЗаказПоставщику.СуммаДокумента <> ТаблицаТоваров.Итог("СуммаСНДС") Тогда
			Возврат "Ошибка создания приходной накладной: несоответствие суммы в документе и в заказе №" + ЗаказПоставщику.Номер;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";

КонецФункции

Функция ДО_ПринятиеДокумента(ДанныеДокумента, ТипДокумента)
	
	СтруктураВозврата = Новый Структура("РазрешеноПринятие, Причина", Истина, "");
	
	СтруктураОбработки = Новый Структура("ДанныеДокумента,Тип", ДанныеДокумента, ТипДокумента);
	ОбъектДанных = РС_ПрочитатьОбъектДанныхИзXML(СтруктураОбработки);
	
	//==Специфический блок кода
	Если ВеткаРазработки = "РосМарк" Тогда	
		
		РезультатПроверки = РосМарк_ПроверитьСоответствиеСчетаИУПД(ОбъектДанных);
		
		Если ЗначениеЗаполнено(РезультатПроверки) Тогда
			
			СтруктураВозврата.РазрешеноПринятие = Ложь;
			СтруктураВозврата.Причина = РезультатПроверки;
			
		КонецЕсли;
		
	КонецЕсли;
	//==Специфический блок кода
	
	Возврат СтруктураВозврата;

КонецФункции
//#КонецОбласти
////////////////////////////////////////////////////////////////////////
//....................................................................//
//					#КонецОбласти РаботаСЭДО				 		  //
//....................................................................//
////////////////////////////////////////////////////////////////////////



ИспользоватьЛицензирование = Ложь;
АдресСервисаПоддержки = "http://195.88.132.1:3500/";
ВеткаРазработки = "";
НомерВерсии = "2.3.4а";
ДатаРелиза = "10.06.2020";
