
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	ЗначениеКопирования = Параметры.ЗначениеКопирования;
	СозданКопированием = НЕ ЗначениеКопирования.Пустая();
	
	Если Объект.Событие.ЭтоГруппа Тогда
		Объект.Событие = Справочники.ПЛ_События.ПустаяСсылка();
	КонецЕсли;
	
	НастройкиУведомлений = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки();
	
	Если ЭтоНовый Тогда
		ПодписиСообщений = "";
		Если НастройкиУведомлений.Свойство("ПодписиСообщений", ПодписиСообщений) <> Неопределено Тогда
			Объект.Наименование = ПодписиСообщений.ПрефиксТемы;
			Объект.ТекстСообщения = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьHTMLИзТекста(Символы.ПС + ПодписиСообщений.ПодписьСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Если НастройкиУведомлений.Свойство("НастройкиСМС") <> Неопределено Тогда
		ТелефонныйКодСтраны = СокрЛП(НастройкиУведомлений.НастройкиСМС.ТелефонныйКодСтраны);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.Статус = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ИмяОтправителя) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = '""Имя отправителя"" обязательно должно быть указано для рассылок и сообщений, отправляемых через сервисы почтовых рассылок.'");
			Сообщение.ПутьКДанным = "ПараметрыОтправки";
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ОбратныйАдрес) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = '""Обратный адрес"" обязательно должен быть указан для рассылок и сообщений, отправляемых через сервисы почтовых рассылок.'");
			Сообщение.ПутьКДанным = "ПараметрыОтправки";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка И Не ОтправкаВручную Тогда
		Если ЗначениеЗаполнено(Объект.ДатаОтправки) И Объект.ДатаОтправки < ТекущаяДатаСеанса() Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = '""Дата отправки"" не должна быть меньше текущей.
				|Можно сохранить черновик, если не требуется отправлять сообщения.'");
			Сообщение.Поле = "Объект.ДатаОтправки";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
	Если Отказ Тогда
		ТекстШаблона = ТекстШаблонаДоЗаписи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстШаблонаДоЗаписи = ТекстШаблона;
	ПолучитьТекстШаблона();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СписокПолучателей = "";
	
	// Сохранение условий для получателей уведомлений
	Для каждого Строка Из ТекущийОбъект.Получатели Цикл
		
		Если ЭтоАдресВременногоХранилища(Строка.АдресСхемыУсловий) Тогда
			СхемаУсловий = ПолучитьИзВременногоХранилища(Строка.АдресСхемыУсловий);
			Строка.СхемаУсловийОтправкиУведомления = Новый ХранилищеЗначения(СхемаУсловий);
		КонецЕсли;
		Если ЭтоАдресВременногоХранилища(Строка.АдресНастроекУсловий) Тогда
			НастройкиУсловий = ПолучитьИзВременногоХранилища(Строка.АдресНастроекУсловий);
			Строка.НастройкиУсловийОтправкиУведомления = Новый ХранилищеЗначения(НастройкиУсловий);
		КонецЕсли;
		
		Если ЭтоАдресВременногоХранилища(Строка.АдресСхемыВыборкиАдресатов) Тогда
			СхемаВыборкиАдресатов = ПолучитьИзВременногоХранилища(Строка.АдресСхемыВыборкиАдресатов);
			Строка.СхемаВыборкиАдресатов = Новый ХранилищеЗначения(СхемаВыборкиАдресатов);
		КонецЕсли;
		Если ЭтоАдресВременногоХранилища(Строка.АдресНастроекВыборкиАдресатов) Тогда
			НастройкиВыборкиАдресатов = ПолучитьИзВременногоХранилища(Строка.АдресНастроекВыборкиАдресатов);
			Строка.НастройкиВыборкиАдресатов = Новый ХранилищеЗначения(НастройкиВыборкиАдресатов);
		КонецЕсли;
		
		Если Строка.Включен Тогда
			СписокПолучателей = СписокПолучателей + СокрЛП(Строка(Строка.Адресат)) + "; ";
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.СписокПолучателей = СписокПолучателей;
	
	ТекущийОбъект.ТекстСообщения = ТекстШаблона;
	
	// Сохранение шаблонов и таблиц текста сообщения
	Если ЭтоАдресВременногоХранилища(АдресСхемыКомпоновкиШаблонов) Тогда
		ТекущийОбъект.СхемаШаблонаТекстовСообщения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиШаблонов));
	Иначе
		ТекущийОбъект.СхемаШаблонаТекстовСообщения = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(АдресНастроекКомпоновкиШаблонов) Тогда
		ТекущийОбъект.НастройкиШаблонаТекстовСообщения = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресНастроекКомпоновкиШаблонов));
	Иначе
		ТекущийОбъект.НастройкиШаблонаТекстовСообщения = Новый ХранилищеЗначения(Неопределено);
	КонецЕсли;
	
	Для каждого Строка Из ТекущийОбъект.ТаблицыШаблонов Цикл
		Если ЭтоАдресВременногоХранилища(Строка.АдресНастроек) Тогда
			НастройкиТаблицы = ПолучитьИзВременногоХранилища(Строка.АдресНастроек);
			Строка.Настройки = Новый ХранилищеЗначения(НастройкиТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ТекущийОбъект.Вложения.Очистить();
	ТекущийОбъект.ПрисоединенныеФайлы.Очистить();
	
	Если Не Объект.ОбычныйТекст Тогда
		// Вложения картинок
		Для Каждого Строка Из СписокИзображений Цикл
			ОписаниеФайла = Строка.Значение;
			НовоеВложение = ТекущийОбъект.Вложения.Добавить();
			ДвоичныеДанныеИзображения = ПолучитьИзВременногоХранилища(ОписаниеФайла.Адрес);
			Изображение = Новый Картинка(ДвоичныеДанныеИзображения);
			//Изображение
			НовоеВложение.Вложение = Новый ХранилищеЗначения(ДвоичныеДанныеИзображения);
			НовоеВложение.Идентификатор = ОписаниеФайла.Идентификатор;
			НовоеВложение.Имя = ОписаниеФайла.ИмяФайла;
			НовоеВложение.Картинка = Истина;
		КонецЦикла;
		
		// Присоединенные файлы
		Для каждого СтрокаФайла из ТаблицаПрисоединенныхФайлов Цикл
			НовоеВложение = ТекущийОбъект.ПрисоединенныеФайлы.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеВложение, СтрокаФайла);
		КонецЦикла;
		
		ВставитьКартинкиВТекстHTML(ТекущийОбъект);
		ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
	КонецЕсли;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ОтправкаВручную", ОтправкаВручную);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_Уведомления");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Завершено_редактирование_условий_получателя" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПрименитьИзменениеУсловий(Параметр);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Завершено_редактирование_выборки_адресатов" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПрименитьИзменениеВыборкиАдресатов(Параметр);
			Элементы.Получатели.ЗакончитьРедактированиеСтроки(Ложь);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Завершено_редактирование_текстов_сообщения" Тогда
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			ПрименитьИзменениеШаблоновСообщения(Параметр);
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_События_Для_Уведомлений" Тогда
		
		СобытиеПриИзмененииНаСервере();
		
	ИначеЕсли ИмяСобытия = "Запись_НастройкиУведомлений"
		Или ИмяСобытия = "Запись_НастройкиОтправкиSMS" Тогда
		
		ПроверитьНастройкиСпособовДоставки();
		УстановитьВидимостьДоступность();
		
	ИначеЕсли ИмяСобытия = "Настроены_Параметры_Отправки" Тогда
		
		ЗаполнитьЗначенияСвойств(Объект, Параметр);
		УстановитьПараметрыОтправки();
		ЭтаФорма.Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ПЛ_События") Тогда
		Объект.Событие = ВыбранноеЗначение;
		СобытиеПриИзмененииНаСервере();
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	
	СобытиеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СобытиеПриИзмененииНаСервере()
	
	Если Событие <> Объект.Событие Тогда
		
		РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Объект.Событие);
		
		Если Не (ИсточникСобытия <> РеквизитыСобытия.ИсточникСобытия
			Или Регистратор <> РеквизитыСобытия.Регистратор) Тогда
			Возврат;
		КонецЕсли;
		
		Для каждого Получатель из Объект.Получатели Цикл
			Получатель.АдресСхемыУсловий = "";
			Получатель.АдресНастроекУсловий = "";
			Получатель.СтрокаУсловий = "<задать условие>";
			Получатель.ВидУсловийОтправкиУведомления = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия;
		КонецЦикла;
		
		АдресСхемыКомпоновкиШаблонов = "";
		АдресНастроекКомпоновкиШаблонов = "";
		
		Событие = Объект.Событие;
		ИсточникСобытия = РеквизитыСобытия.ИсточникСобытия;
		Регистратор = РеквизитыСобытия.Регистратор;
		
		Элементы.Событие.Подсказка = Строка(ИсточникСобытия);
		
		ЗапускВручную =
			ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
			Или ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка;
			
		ЗапускПоПлану = (ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка);
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СпособДоставкиПриИзменении(Элемент)
	
	Объект.ЭлПочта = (Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта"));
	Объект.СервисПочтовойРассылки = (Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки"));
	Объект.СМС = (Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СМС"));
	Объект.Напоминание = (Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение"));
	
	Если Объект.СМС Или Объект.Напоминание Тогда
		Если Не Объект.ОбычныйТекст Тогда
			ПолучитьHTMLИзПоляHTMLДокумента();
			ВыполнитьПереключениеОбычныйТекст();
		КонецЕсли;
		Объект.ДелениеПоАдресатам = ПредопределенноеЗначение("Перечисление.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому");
	ИначеЕсли Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		Если Объект.ОбычныйТекст Тогда
			ВыполнитьПереключениеHTML();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьНастроитьНажатие(Элемент)
	
	Если Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений");
	ИначеЕсли Объект.СМС Тогда
		Если СМСДоступны Тогда
			ОткрытьФорму("ОбщаяФорма.НастройкаОтправкиSMS");
		Иначе
			ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.НастройкиПараметровУведомлений");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТемаСообщенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Неопределено И Объект.Наименование <> ВыбранноеЗначение Тогда
		Модифицированность = Истина;
		Объект.Наименование = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокПараметрыОтправкиНажатие(Элемент)
	
	СтруктураПараметровОтправки = Новый Структура;
	СтруктураПараметровОтправки.Вставить("ДелениеПоАдресатам",        Объект.ДелениеПоАдресатам);
	СтруктураПараметровОтправки.Вставить("ФильтрПоАдресатам",         Объект.ФильтрПоАдресатам);
	СтруктураПараметровОтправки.Вставить("ОбратныйАдрес",             Объект.ОбратныйАдрес);
	СтруктураПараметровОтправки.Вставить("ИмяОтправителя",            Объект.ИмяОтправителя);
	СтруктураПараметровОтправки.Вставить("КонтрольПовторнойОтправки", Объект.КонтрольПовторнойОтправки);
	СтруктураПараметровОтправки.Вставить("ЭлПочта",                   Объект.ЭлПочта Или Объект.СервисПочтовойРассылки);
	СтруктураПараметровОтправки.Вставить("СМС",                       Объект.СМС);
	СтруктураПараметровОтправки.Вставить("Напоминание",               Объект.Напоминание);
	СтруктураПараметровОтправки.Вставить("ИсточникСобытия",           ИсточникСобытия);
	
	ПараметрыФормы = Новый Структура("СтруктураПараметровОтправки", СтруктураПараметровОтправки);
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		ОткрытьФормуМодально("Справочник.ПЛ_УведомленияОСобытиях.Форма.РедактированиеПараметровОтправки", ПараметрыФормы, ЭтаФорма);
	#Иначе
		Выполнить("ОткрытьФорму(""Справочник.ПЛ_УведомленияОСобытиях.Форма.РедактированиеПараметровОтправки"", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
	#КонецЕсли
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ТАБЛИЦЫ ПОЛУЧАТЕЛЕЙ

&НаКлиенте
Процедура ПолучателиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ОписаниеТиповАдресата = Новый ОписаниеТипов("Строка");
	Элементы.ПолучателиАдресат.ОграничениеТипа = ОписаниеТиповАдресата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент = Элементы.ПолучателиСтрокаУсловий Тогда
		СтандартнаяОбработка = Ложь;
		НачатьРедактированиеУсловия(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиАдресатНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокСпособовАдресации = Новый СписокЗначений;
	Если ИсточникСобытия <> ПредопределенноеЗначение("Перечисление.ПЛ_ИсточникиСобытий.Рассылка") Тогда
		СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Запрос"));
	КонецЕсли;
	
	СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки"));
	
	Если ЕстьСправочникПользователей Тогда
		СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Пользователь"));
	КонецЕсли;
	Если ЕстьСправочникКонтрагентов И Не Объект.Напоминание Тогда
		СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Контрагент"), ПартнерКонтрагент);
	КонецЕсли;
	
	Если Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес"));
	ИначеЕсли Объект.СМС Тогда
		СписокСпособовАдресации.Добавить(ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.НомерТелефона"));
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Элемент", Элемент);
	Если Платформа83 Тогда
		ОписаниеОповещенияАдресатНачалоВыбораЗавершение = "";
		Выполнить("ОписаниеОповещенияАдресатНачалоВыбораЗавершение = Новый ОписаниеОповещения(""ПолучателиАдресатНачалоВыбораЗавершение"", ЭтаФорма, ДопПараметры)");
		Выполнить("ПоказатьВыборИзСписка(ОписаниеОповещенияАдресатНачалоВыбораЗавершение, СписокСпособовАдресации, Элемент)");
	Иначе
		СпособАдресации = ЭтаФорма.ВыбратьИзСписка(СписокСпособовАдресации, ДопПараметры);
		ПолучателиАдресатНачалоВыбораЗавершение(СпособАдресации, ДопПараметры);
	КонецЕсли;
	
	Элемент.Маска = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиАдресатНачалоВыбораЗавершение(СпособАдресации, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	Если СпособАдресации = Неопределено Тогда
		Возврат;
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Пользователь") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Пользователи"));
		ОписаниеТиповАдресата = Новый ОписаниеТипов(Массив, , );
		
		Элемент.ОграничениеТипа = ОписаниеТиповАдресата;
		Если ВерсияУТ = "11" Или ВерсияУТ = "Розница" Или ВерсияУТ = "ЗУП" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, Элемент);
		Иначе
			ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", , Элемент);
		КонецЕсли;
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Контрагент") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка." + ИмяСправочникаКонтрагенты));
		ОписаниеТиповАдресата = Новый ОписаниеТипов(Массив, , );
		
		Элемент.ОграничениеТипа = ОписаниеТиповАдресата;
		ОткрытьФорму("Справочник." + ИмяСправочникаКонтрагенты + ".ФормаВыбора", , Элемент);
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТиповАдресата = Новый ОписаниеТипов(Массив, , );
		
		Элемент.ОграничениеТипа = ОписаниеТиповАдресата;
		Элементы.Получатели.ТекущиеДанные.СпособАдресацииУведомления = СпособАдресации.Значение;
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.НомерТелефона") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("Строка"));
		ОписаниеТиповАдресата = Новый ОписаниеТипов(Массив, , );
		
		Элемент.ОграничениеТипа = ОписаниеТиповАдресата;
		Элементы.Получатели.ТекущиеДанные.СпособАдресацииУведомления = СпособАдресации.Значение;
		
		Если ЗначениеЗаполнено(ТелефонныйКодСтраны) Тогда
			Элемент.Маска = ТелефонныйКодСтраны + "9999999999";
		Иначе
			Элемент.Маска = "9999999999999";
		КонецЕсли;
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Запрос") Тогда
		
		НачатьРедактированиеАдресатов();
		
	ИначеЕсли СпособАдресации.Значение = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки") Тогда
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.ПЛ_Подписчики"));
		ОписаниеТиповАдресата = Новый ОписаниеТипов(Массив, , );
		
		Элемент.ОграничениеТипа = ОписаниеТиповАдресата;
		ОткрытьФорму("Справочник.ПЛ_Подписчики.ФормаВыбора", , Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиАдресатОткрытие(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанныеПолучателя = Элементы.Получатели.ТекущиеДанные;
	
	Если ТекущиеДанныеПолучателя <> Неопределено Тогда
		Если ТекущиеДанныеПолучателя.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Запрос") Тогда
			СтандартнаяОбработка = Ложь;
			НачатьРедактированиеАдресатов()
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиАдресатПриИзменении(Элемент)
	
	Элементы.Получатели.ТекущиеДанные.Включен = Истина;
	
	ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
	Если ТипЗнч(ТекущиеДанные.Адресат) = Тип("Строка") Тогда
		Если Найти(ТекущиеДанные.Адресат, "@") Тогда
			ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес");
		Иначе
			ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.НомерТелефона");
		КонецЕсли;
	ИначеЕсли ТипЗнч(ТекущиеДанные.Адресат) = Тип("СправочникСсылка.Пользователи") Тогда
		ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Пользователь");
	ИначеЕсли ТипЗнч(ТекущиеДанные.Адресат) = Тип("СправочникСсылка.Контрагенты") Тогда
		ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Контрагент");
	ИначеЕсли ТипЗнч(ТекущиеДанные.Адресат) = Тип("СправочникСсылка.ПЛ_Подписчики") Тогда
		ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.СписокРассылки");
	Иначе
		ТекущиеДанные.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Запрос");
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ВыбратьКонтакты(Команда)
	
	Попытка
		
		Если ВерсияУТ = "10" Тогда
			
			СтруктураАдресов = ОткрытьФормуМодально("Обработка.АдреснаяКнига.Форма.ФормаПодбора",
				,
				ЭтаФорма);
				
			Если ТипЗнч(СтруктураАдресов) = Тип("Структура") Тогда
				ТаблицаАдресов = СтруктураАдресов.Кому;
				МассивАдресов = ТаблицаАдресов.ВыгрузитьКолонку("АдресЭлектроннойПочты");
				Для каждого Адрес из МассивАдресов Цикл
					Если Объект.Получатели.НайтиСтроки(Новый Структура("Адресат", Адрес)).Количество() = 0 Тогда
						Получатель = Объект.Получатели.Добавить();
						Получатель.Адресат = Адрес;
						Получатель.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес");
						Получатель.Включен = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		
		ИначеЕсли ВерсияУТ = "11" Или ВерсияУТ = "ЗУП" Тогда
		
			ПараметрыОткрытия = Новый Структура;
			ПараметрыОткрытия.Вставить("Предмет", "");
			ПараметрыОткрытия.Вставить("ГруппаПоУмолчанию", НСтр("ru = 'Кому'"));
			
			Если Платформа83 Тогда
				ОписаниеОповещенияВыборКонтактов = "";
				Выполнить("ОписаниеОповещенияВыборКонтактов = Новый ОписаниеОповещения(""ВыборКонтактовЗавершение"", ЭтаФорма, ПараметрыОткрытия)");
				Выполнить("ОткрытьФорму(""ОбщаяФорма.АдреснаяКнига"", ПараметрыОткрытия,,,,, ОписаниеОповещенияВыборКонтактов, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)");
				
			Иначе
				Результат = ОткрытьФормуМодально("ОбщаяФорма.АдреснаяКнига", ПараметрыОткрытия);
				
				Если ТипЗнч(Результат) = Тип("Массив") Тогда
					Для каждого Адрес Из Результат Цикл
						Если Объект.Получатели.НайтиСтроки(Новый Структура("Адресат", Адрес)).Количество() = 0 Тогда
							Получатель = Объект.Получатели.Добавить();
							Получатель.Адресат = Адрес;
							Получатель.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес");
							Получатель.Включен = Истина;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Исключение
	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКонтактовЗавершение(Результат, ДополнительныеСвойства) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для каждого СтрокаРезультата Из Результат Цикл
			Если Объект.Получатели.НайтиСтроки(Новый Структура("Адресат", СтрокаРезультата.Адрес)).Количество() = 0 Тогда
				Получатель = Объект.Получатели.Добавить();
				Получатель.Адресат = СтрокаРезультата.Адрес;
				Получатель.СпособАдресацииУведомления = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыАдресацииУведомлений.Адрес");
				Получатель.Включен = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокТемаНажатие(Элемент)
	
	РедактироватьТемуТекстСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокТекстНажатие(Элемент)
	
	РедактироватьТемуТекстСообщения();
	
КонецПроцедуры

&НаКлиенте
Процедура Включить(Команда)
	
	Объект.Статус = 1;
	
	ОчиститьСообщения();
	
	Если Записать() Тогда
		Закрыть();
	Иначе
		ТекстШаблона = ТекстШаблонаДоЗаписи;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	
	Объект.Статус = 0;
	
	Записать();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаписатьИОтправить", ЭтаФорма);
	
	Если Объект.Статус = 2 Тогда
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Отправить повторно'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		ТекстВопроса = НСтр("ru = 'Рассылка уже отправлена ранее.'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru = 'Записать и отправить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru = 'Отмена'"));
		ТекстВопроса = НСтр("ru = 'Требуется записать новое уведомление перед отправкой.'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.ОК);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИОтправить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено
		И Результат = КодВозвратаДиалога.ОК Тогда
		
		Объект.Статус = 1;
		Объект.ДатаОтправки = ТекущаяДата();
		ОтправкаВручную = Истина;
		
		Если Записать() Тогда
			ОтправитьНаСервере();
		КонецЕсли;
		
		ОтправкаВручную = Ложь;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	НастройкиУведомлений = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройки();
	ВерсияУТ = ПЛ_УведомленияОСобытиях.ВерсияУТ();
	Платформа83 = ПЛ_УведомленияОСобытиях.Платформа83();
	
	Если Параметры.Свойство("ЗначениеКопирования") Тогда
		ЗначениеКопирования = Параметры.ЗначениеКопирования;
		СозданКопированием = Не ЗначениеКопирования.Пустая();
	Иначе
		СозданКопированием = Ложь;
	КонецЕсли;
	
	Если СозданКопированием Тогда
		СправочникОбъект = ЗначениеКопирования;
	Иначе
		СправочникОбъект = РеквизитФормыВЗначение("Объект");
	КонецЕсли;
	
	инд = 0;
	Для Каждого Получатель Из СправочникОбъект.Получатели Цикл
		
		Схема = Получатель.СхемаУсловийОтправкиУведомления.Получить();
		Настройки = Получатель.НастройкиУсловийОтправкиУведомления.Получить();
		
		Если Схема <> Неопределено
			И Настройки <> Неопределено Тогда
			Объект.Получатели[инд].АдресСхемыУсловий = ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор());
			Объект.Получатели[инд].АдресНастроекУсловий = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор());
		Иначе
			Объект.Получатели[инд].АдресСхемыУсловий = "";
			Объект.Получатели[инд].АдресНастроекУсловий = "";
		КонецЕсли;
		
		Схема = Получатель.СхемаВыборкиАдресатов.Получить();
		Настройки = Получатель.НастройкиВыборкиАдресатов.Получить();
		
		Если Схема <> Неопределено
			И Настройки <> Неопределено Тогда
			Объект.Получатели[инд].АдресСхемыВыборкиАдресатов = ПоместитьВоВременноеХранилище(Схема, Новый УникальныйИдентификатор());
			Объект.Получатели[инд].АдресНастроекВыборкиАдресатов = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор());
		Иначе
			Объект.Получатели[инд].АдресСхемыВыборкиАдресатов = "";
			Объект.Получатели[инд].АдресНастроекВыборкиАдресатов = "";
		КонецЕсли;
		
		инд = инд + 1;
	КонецЦикла;
	
	СхемаШаблоновТекстовСообщения = СправочникОбъект.Ссылка.СхемаШаблонаТекстовСообщения.Получить();
	НастройкиШаблоновТекстовСообщения = СправочникОбъект.Ссылка.НастройкиШаблонаТекстовСообщения.Получить();
	
	Если СхемаШаблоновТекстовСообщения <> Неопределено
		И НастройкиШаблоновТекстовСообщения <> Неопределено Тогда
		АдресСхемыКомпоновкиШаблонов = ПоместитьВоВременноеХранилище(СхемаШаблоновТекстовСообщения, Новый УникальныйИдентификатор());
		АдресНастроекКомпоновкиШаблонов = ПоместитьВоВременноеХранилище(НастройкиШаблоновТекстовСообщения, Новый УникальныйИдентификатор());
	Иначе
		АдресСхемыКомпоновкиШаблонов = "";
		АдресНастроекКомпоновкиШаблонов = "";
	КонецЕсли;
	
	инд = 0;
	Для Каждого ТаблицаШаблона Из СправочникОбъект.ТаблицыШаблонов Цикл
		Настройки = ТаблицаШаблона.Настройки.Получить();
		Если Настройки <> Неопределено Тогда
			Объект.ТаблицыШаблонов[инд].АдресНастроек = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор());
		Иначе
			Объект.ТаблицыШаблонов[инд].АдресНастроек = "";
		КонецЕсли;
		инд = инд + 1;
	КонецЦикла;
	
	ТекстШаблона = СправочникОбъект.ТекстСообщения;
	Если ПустаяСтрока(ТекстШаблона) Тогда
		ТекстШаблона = " ";
	КонецЕсли;
	
	Если Не СправочникОбъект.ОбычныйТекст Тогда
		ВставитьКартинкиВТекстHTML(СправочникОбъект);
		ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
	КонецЕсли;
	
	ТаблицаПрисоединенныхФайлов.Загрузить(СправочникОбъект.ПрисоединенныеФайлы.Выгрузить());
	
	// Инизиализация реквизитов формы
	Событие = Объект.Событие;
	РеквизитыСобытия = Справочники.ПЛ_События.РеквизитыСобытия(Событие);
	ИсточникСобытия = РеквизитыСобытия.ИсточникСобытия;
	Регистратор = РеквизитыСобытия.Регистратор;
	
	Элементы.Событие.Подсказка = Строка(ИсточникСобытия);
	
	ЗапускВручную =
		ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
		Или ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка;
		
	ЗапускПоПлану = (ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка);
	
	ИмяСправочника = "Пользователи";
	МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочника);
	ЕстьСправочникПользователей = (МетаданныеСправочника <> Неопределено);
	
	Если ВерсияУТ = "10" Тогда
		ИмяСправочникаКонтрагенты = "Контрагенты";
		ПартнерКонтрагент = НСтр("ru = 'Контрагент'");
	ИначеЕсли ВерсияУТ = "11" Тогда
		ИмяСправочникаКонтрагенты = "Партнеры";
		ПартнерКонтрагент = НСтр("ru = 'Партнер'");
	ИначеЕсли ВерсияУТ = "Бухгалтерия" Или ВерсияУТ = "Розница" Тогда
		ИмяСправочникаКонтрагенты = "Контрагенты";
		ПартнерКонтрагент = НСтр("ru = 'Контрагент'");
	Иначе
		Элементы.ЗаголовокКому.Видимость = Истина;
		Элементы.ВыбратьКонтакты.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИмяСправочникаКонтрагенты) Тогда
		МетаданныеСправочника = Метаданные.Справочники.Найти(ИмяСправочникаКонтрагенты);
		ЕстьСправочникКонтрагентов = (МетаданныеСправочника <> Неопределено);
	КонецЕсли;
	
	ПроверитьНастройкиСпособовДоставки();
	УстановитьПараметрыОтправки();
	ОбновитьЗаголовокВложений();
	ЗаполнитьСостояние();
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ДоступностьПоСобытию = ЗначениеЗаполнено(Объект.Событие);
	ЗависимыеЭлементы = Новый Массив;
	ЗависимыеЭлементы.Добавить(Элементы.СпособДоставки);
	ЗависимыеЭлементы.Добавить(Элементы.ВыбратьКонтакты);
	ЗависимыеЭлементы.Добавить(Элементы.Получатели);
	ЗависимыеЭлементы.Добавить(Элементы.ЗаголовокПараметрыОтправки);
	ЗависимыеЭлементы.Добавить(Элементы.ЗаголовокТема);
	ЗависимыеЭлементы.Добавить(Элементы.Наименование);
	ЗависимыеЭлементы.Добавить(Элементы.ЗаголовокТекст);
	ЗависимыеЭлементы.Добавить(Элементы.ТекстСообщенияHTML);
	ЗависимыеЭлементы.Добавить(Элементы.ТекстСообщения);
	ЗависимыеЭлементы.Добавить(Элементы.Комментарий);
	Для Каждого Элемент Из ЗависимыеЭлементы Цикл
		Элемент.Доступность = ДоступностьПоСобытию;
	КонецЦикла;
	
	Если Не ПЛ_УведомленияОСобытиях.Платформа83() Тогда
		ЭлементСМС =
			Элементы.СпособДоставки.СписокВыбора.НайтиПоЗначению(Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС);
		Если ЭлементСМС <> Неопределено Тогда
			Элементы.СпособДоставки.СписокВыбора.Удалить(ЭлементСМС);
		КонецЕсли;
	КонецЕсли;
	
	Если Не НапоминанияДоступны Тогда
		ЭлементНапоминания =
			Элементы.СпособДоставки.СписокВыбора.НайтиПоЗначению(Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение);
		Если ЭлементНапоминания <> Неопределено Тогда
			Элементы.СпособДоставки.СписокВыбора.Удалить(ЭлементНапоминания);
		КонецЕсли;
	КонецЕсли;
	
	Если Элементы.СпособДоставки.СписокВыбора.Количество() = 1 Тогда
		Элементы.СпособДоставки.Видимость = Ложь;
	КонецЕсли;
	
	ТекстЗаголовка = НСтр("ru = 'Текст'");
	Если Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		Элементы.ГруппаТемаСообщения.Видимость = Истина;
		ТекстЗаголовка = НСтр("ru = 'Текст письма:'");
	ИначеЕсли Объект.СМС Тогда
		Элементы.ГруппаТемаСообщения.Видимость = Ложь;
		ТекстЗаголовка = НСтр("ru = 'Текст сообщения:'");
	ИначеЕсли Объект.Напоминание Тогда
		Элементы.ГруппаТемаСообщения.Видимость = Истина;
		ТекстЗаголовка = НСтр("ru = 'Текст напоминания:'");
	КонецЕсли;
	Элементы.ЗаголовокТекст.Заголовок = ТекстЗаголовка;
	
	Элементы.ТекстСообщения.Видимость = Объект.ОбычныйТекст;
	Элементы.ТекстСообщенияHTML.Видимость = Не Объект.ОбычныйТекст;
	
	ВыводитьСообщениеНастройкиПочты = (Объект.ЭлПочта И Не ПочтаНастроена);
	ВыводитьСообщениеНастройкиРассылки = (Объект.СервисПочтовойРассылки И Не РассылкиНастроены);
	ВыводитьСообщениеНастройкиСМС = (Объект.СМС И Не СМСНастроены);
	ВыводитьСообщениеНастройкиНапоминаний = (Объект.Напоминание И Не НапоминанияДоступны);
	
	Если ВыводитьСообщениеНастройкиПочты Тогда
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru = 'Не настроена учетная запись для отправки писем'");
	ИначеЕсли ВыводитьСообщениеНастройкиРассылки Тогда
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru = 'Не настроено подключение к сервису рассылки'");
	ИначеЕсли ВыводитьСообщениеНастройкиСМС Тогда
		Элементы.НадписьПредупреждение.Заголовок = НСтр("ru = 'Не настроено подключение к услуге отправки SMS сообщений'");
	ИначеЕсли ВыводитьСообщениеНастройкиНапоминаний Тогда
		Элементы.НадписьПредупреждение.Заголовок =
			СтрЗаменить(НСтр("ru = 'Текущая конфигурация ""%1"" 
			|не включает в себя подсистему напоминаний пользователей.'"),
			"%1",
			Метаданные.КраткаяИнформация);
	КонецЕсли;
	
	Элементы.ГруппаПредупреждение.Видимость =
		ВыводитьСообщениеНастройкиПочты
		Или ВыводитьСообщениеНастройкиРассылки
		Или ВыводитьСообщениеНастройкиСМС;
		
	Элементы.ГруппаВложения.Видимость = ЗначениеЗаполнено(ЗаголовокВложений);
	
	Элементы.ФормаОтправить.Видимость = ЗапускВручную;
	
	ЭтоРассылка = (ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка);
	Элементы.ДатаОтправки.Видимость = ЭтоРассылка;
	Элементы.ЗаголовокВыполнить.Видимость = ЭтоРассылка;
	
	Элементы.ДатаОтправки.Доступность = (Объект.Статус <> 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстШаблона()
	
	Если Не Объект.ОбычныйТекст Тогда
		
		ПолучитьHTMLИзПоляHTMLДокумента();
		
		СписокИзображений.Очистить();
		
		ДокументHTML = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьДокументHTMLИзТекстаHTML(ТекстШаблона);
		Для каждого Картинка Из ДокументHTML.Картинки Цикл
			
			УникальныйИдентификаторФайла = ДобавитьФайлВСписокИзображений(Картинка.Источник);
			Если УникальныйИдентификаторФайла <> Неопределено Тогда
				Картинка.Источник = "cid:" + УникальныйИдентификаторФайла;
			КонецЕсли;
		КонецЦикла;
		
		КоллекцияТаблиц = ДокументHTML.ПолучитьЭлементыПоИмени("TABLE");
		Для каждого ЭлементКоллекции Из КоллекцияТаблиц Цикл
			Для каждого Атрибут Из ЭлементКоллекции.Атрибуты Цикл
				Если ВРег(Атрибут.Имя) = "BACKGROUND" Тогда
					
					УникальныйИдентификаторФайла = ДобавитьФайлВСписокИзображений(Атрибут.Значение);
					Если УникальныйИдентификаторФайла <> Неопределено Тогда
						Атрибут.ЗначениеУзла = "cid:" + УникальныйИдентификаторФайла;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстHTMLИзДокументаHTML(ДокументHTML);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьФайлВСписокИзображений(ЗначениеАтрибута)
	
	УникальныйИдентификаторФайла = Неопределено;
	
	Если Найти(ВРег(ЗначениеАтрибута), ВРег("file://")) = 1 Тогда
		ПутьФайла = Сред(ЗначениеАтрибута, СтрДлина("file://") + 1);
		ПутьФайла = СтрЗаменить(ПутьФайла, "%20", " ");
		
		ПервыйСимвол = Лев(ПутьФайла, 1);
		Если ПервыйСимвол = "/" Или ПервыйСимвол = "\" Тогда
			ПутьФайла = Сред(ПутьФайла, 2);
		КонецЕсли;
	Иначе
		ПутьФайла = ЗначениеАтрибута;
	КонецЕсли;
	
	Файл = Новый Файл(ПутьФайла);
	Если Файл.Существует() Тогда
		
		ПомещаемыеФайлы = Новый Массив;
		Описание = Новый ОписаниеПередаваемогоФайла(ПутьФайла, "");
		ПомещаемыеФайлы.Добавить(Описание);
		ПомещенныеФайлы = Новый Массив;
		Если Не ПоместитьФайлы(ПомещаемыеФайлы, ПомещенныеФайлы,, Ложь, УникальныйИдентификатор) Тогда
			ВызватьИсключение НСтр("ru = 'Не удалось прочитать файл изображения'") + " " + ПутьФайла;
		КонецЕсли;
		
		АдресВоВременномХранилище = "";
		Если ПомещенныеФайлы.Количество() = 1 Тогда
			АдресВоВременномХранилище = ПомещенныеФайлы[0].Хранение;
		Иначе
			ВызватьИсключение НСтр("ru = 'Не удалось прочитать файл изображения'") + " " + ПутьФайла;
		КонецЕсли;
		
		УникальныйИдентификаторФайла = Новый УникальныйИдентификатор;
		УникальныйИдентификаторФайла = Строка(УникальныйИдентификаторФайла);
		
		Файл = Новый Файл(ПутьФайла);
		
		ОписаниеФайла = Новый Структура;
		ОписаниеФайла.Вставить("Адрес", АдресВоВременномХранилище);
		ОписаниеФайла.Вставить("Идентификатор", УникальныйИдентификаторФайла);
		ОписаниеФайла.Вставить("ИмяФайла", Файл.Имя);
		СписокИзображений.Добавить(ОписаниеФайла);
	КонецЕсли;
	
	Возврат УникальныйИдентификаторФайла;
	
КонецФункции

&НаКлиенте
Процедура НачатьРедактированиеУсловия(Элемент)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	АдресСхемыКомпоновкиДанных = ТекущиеДанные.АдресСхемыУсловий;
	АдресНастроекКомпоновкиДанных = ТекущиеДанные.АдресНастроекУсловий;
	
	Если ПустаяСтрока(АдресСхемыКомпоновкиДанных)
		Или ПустаяСтрока(АдресНастроекКомпоновкиДанных) Тогда
		СтандартнаяСхемаУсловийДляСобытияНаСервере(Объект.Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	КонецЕсли;
	
	ПараметрыРедактированияУсловий = Новый Структура;
	ПараметрыРедактированияУсловий.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
	ПараметрыРедактированияУсловий.Вставить("ТипИсточника", ИсточникСобытия);
	ПараметрыРедактированияУсловий.Вставить("ИмяИсточника", Регистратор);
	ПараметрыРедактированияУсловий.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыРедактированияУсловий.Вставить("АдресНастроекКомпоновкиДанных", АдресНастроекКомпоновкиДанных);
	ПараметрыРедактированияУсловий.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ОткрытьФорму("Справочник.ПЛ_События.Форма.РедактированиеУсловий",
		ПараметрыРедактированияУсловий,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРедактированиеАдресатов()
	
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	
	АдресСхемыКомпоновкиДанных = ТекущиеДанные.АдресСхемыВыборкиАдресатов;
	АдресНастроекКомпоновкиДанных = ТекущиеДанные.АдресНастроекВыборкиАдресатов;
	
	Если ПустаяСтрока(АдресСхемыКомпоновкиДанных)
		Или ПустаяСтрока(АдресНастроекКомпоновкиДанных) Тогда
		СтандартнаяСхемаВыборкиАдресатовДляСобытияНаСервере(Объект.Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	КонецЕсли;
	
	ПараметрыРедактированияВыборки = Новый Структура;
	ПараметрыРедактированияВыборки.Вставить("НомерСтроки", ТекущиеДанные.НомерСтроки);
	ПараметрыРедактированияВыборки.Вставить("ТипИсточника", ИсточникСобытия);
	ПараметрыРедактированияВыборки.Вставить("ИмяИсточника", Регистратор);
	ПараметрыРедактированияВыборки.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыКомпоновкиДанных);
	ПараметрыРедактированияВыборки.Вставить("АдресНастроекКомпоновкиДанных", АдресНастроекКомпоновкиДанных);
	ПараметрыРедактированияВыборки.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыРедактированияВыборки.Вставить("СпособДоставки", Объект.СпособДоставки);
	
	Если Объект.Напоминание Тогда
		СтрокаТипы = НСтр("ru = 'Допускается тип ""Пользователь"".'");
	КонецЕсли;
	ПараметрыРедактированияВыборки.Вставить("Подсказка",
		СтрЗаменить(НСтр("ru = 'Выберите поля, которые содержат необходимых адресатов.
			|%1'"),
		"%1",
		СтрокаТипы));
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.РедактированиеВыборкиАдресатов",
		ПараметрыРедактированияВыборки,
		ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьТемуТекстСообщения()
	
	ПараметрыРедактированияШаблона = Новый Структура;
	ПараметрыРедактированияШаблона.Вставить("ТипСообщения", Объект.СпособДоставки);
	ЗаполнитьСтруктуруПараметровРедактированияШаблона(ПараметрыРедактированияШаблона);
	
	Если Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта")
		Или Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки") Тогда
		
		ПолучитьHTMLИзПоляHTMLДокумента();
		ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
		
		ПараметрыРедактированияШаблона.Вставить("ТемаСообщения",       Объект.Наименование);
		ПараметрыРедактированияШаблона.Вставить("ТекстСообщения",      ТекстШаблона);
		ПараметрыРедактированияШаблона.Вставить("ОбычныйТекст",        Объект.ОбычныйТекст);
		ПараметрыРедактированияШаблона.Вставить("ФорматВложений",      Объект.ФорматВложений);
		
	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.СМС") Тогда
		
		ПараметрыРедактированияШаблона.Вставить("ТемаСообщения",       "");
		ПараметрыРедактированияШаблона.Вставить("ТекстСообщения",      Объект.ТекстСообщения);
		ПараметрыРедактированияШаблона.Вставить("ОбычныйТекст",        Истина);
		
	ИначеЕсли Объект.СпособДоставки = ПредопределенноеЗначение("Перечисление.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение") Тогда
		
		ПараметрыРедактированияШаблона.Вставить("ТемаСообщения",       Объект.Наименование);
		ПараметрыРедактированияШаблона.Вставить("ТекстСообщения",      Объект.ТекстСообщения);
		ПараметрыРедактированияШаблона.Вставить("ОбычныйТекст",        Истина);
		
	КонецЕсли;
	
	ПараметрыРедактированияШаблона.Вставить("ИсточникСобытия",         ИсточникСобытия);
	ПараметрыРедактированияШаблона.Вставить("Регистратор",             Регистратор);
	ПараметрыРедактированияШаблона.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	
	ПараметрыРедактированияШаблона.Вставить("ДелениеПоАдресатам",      Объект.ДелениеПоАдресатам);
	ПараметрыРедактированияШаблона.Вставить("ФильтрПоАдресатам",       Объект.ФильтрПоАдресатам);
	
	ОткрытьФорму("Справочник.ПЛ_УведомленияОСобытиях.Форма.РедактированиеТемыИТекстаСообщения",
		ПараметрыРедактированияШаблона,
		ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруПараметровРедактированияШаблона(ПараметрыРедактированияШаблона)
	
	Если ПустаяСтрока(АдресСхемыКомпоновкиШаблонов)
		Или ПустаяСтрока(АдресНастроекКомпоновкиШаблонов) Тогда
		СтандартнаяСхемаШаблоновДляСобытияНаСервере(Объект.Событие, АдресСхемыКомпоновкиШаблонов, АдресНастроекКомпоновкиШаблонов);
	КонецЕсли;
	
	ПараметрыРедактированияШаблона.Вставить("АдресСхемыКомпоновкиШаблонов", АдресСхемыКомпоновкиШаблонов);
	ПараметрыРедактированияШаблона.Вставить("АдресНастроекКомпоновкиШаблонов", АдресНастроекКомпоновкиШаблонов);
	
	Если Объект.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому Тогда
		ПараметрыРедактированияШаблона.Вставить("АдресТаблицыПолучателей", АдресТаблицыПолучателей());
	КонецЕсли;
	
	ПараметрыРедактированияШаблона.Вставить("АдресТаблицШаблонов", АдресТаблицШаблонов());
	ПараметрыРедактированияШаблона.Вставить("АдресПечатныхФорм", АдресПечатныхФорм());
	ПараметрыРедактированияШаблона.Вставить("АдресПрисоединенныхФайлов", АдресПрисоединенныхФайлов());
	
КонецПроцедуры

&НаСервере
Функция АдресТаблицыПолучателей()
	
	Возврат ПоместитьВоВременноеХранилище(
		Объект.Получатели.Выгрузить(Новый Структура("Включен", Истина),
			"Адресат, СпособАдресацииУведомления, АдресСхемыВыборкиАдресатов, АдресНастроекВыборкиАдресатов"),
			Новый УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Функция АдресТаблицШаблонов()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ТаблицыШаблонов.Выгрузить(), Новый УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Функция АдресПрисоединенныхФайлов()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПрисоединенныхФайлов.Выгрузить(), Новый УникальныйИдентификатор());
	
КонецФункции

&НаСервере
Функция АдресПечатныхФорм()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ПечатныеФормы.Выгрузить(), Новый УникальныйИдентификатор());
	
КонецФункции

&НаСервереБезКонтекста
Процедура СтандартнаяСхемаУсловийДляСобытияНаСервере(Знач Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	
	ОбъектСобытие = Событие.ПолучитьОбъект();
	
	СхемаИНастройки = ОбъектСобытие.СтандартнаяСхемаУсловийДляСобытия();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.СКД, Новый УникальныйИдентификатор());
	АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.Настройки, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтандартнаяСхемаШаблоновДляСобытияНаСервере(Знач Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	
	ОбъектСобытие = Событие.ПолучитьОбъект();
	
	СхемаИНастройки = ОбъектСобытие.СтандартнаяСхемаШаблоновДляСобытия();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.СКД, Новый УникальныйИдентификатор());
	АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.Настройки, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СтандартнаяСхемаВыборкиАдресатовДляСобытияНаСервере(Знач Событие, АдресСхемыКомпоновкиДанных, АдресНастроекКомпоновкиДанных)
	
	ОбъектСобытие = Событие.ПолучитьОбъект();
	
	СхемаИНастройки = ОбъектСобытие.СтандартнаяСхемаШаблоновДляСобытия();
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаИНастройки.СКД, Новый УникальныйИдентификатор());
	
	Настройки = СхемаИНастройки.Настройки;
	Если ТипЗнч(Настройки) = Тип("НастройкиКомпоновкиДанных") Тогда
		Настройки.Выбор.Элементы.Очистить();
	КонецЕсли;
	
	АдресНастроекКомпоновкиДанных = ПоместитьВоВременноеХранилище(Настройки, Новый УникальныйИдентификатор());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыОтправки()
	
	ПараметрыОтправки = "";
	
	Если Объект.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.СкрытыеКопии Тогда
		ДелениеПоАдресатам = НСтр("ru = 'Скрытыми копиями'");
	ИначеЕсли Объект.ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому Тогда
		Если Объект.ФильтрПоАдресатам Тогда
			ДелениеПоАдресатам = НСтр("ru = 'Отдельно каждому получателю с фильтром данных по получателям'");
		Иначе
			ДелениеПоАдресатам = НСтр("ru = 'Отдельно каждому получателю'");
		КонецЕсли;
	Иначе
		ДелениеПоАдресатам = НСтр("ru = 'Общие для всех получателей'");
	КонецЕсли;
	ПараметрыОтправки = ДелениеПоАдресатам;
	
	Если Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		Если ЗначениеЗаполнено(Объект.ИмяОтправителя) Тогда
			ПараметрыОтправки = ПараметрыОтправки + "; " + НСтр("ru = 'От: '") + Объект.ИмяОтправителя;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ЭлПочта Или Объект.СервисПочтовойРассылки Тогда
		Если ЗначениеЗаполнено(Объект.ОбратныйАдрес) Тогда
			ПараметрыОтправки = ПараметрыОтправки + "; " + НСтр("ru = 'Обратный адрес: '") + Объект.ОбратныйАдрес;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.КонтрольПовторнойОтправки Тогда
		ПараметрыОтправки = ПараметрыОтправки
			+ ?(ЗначениеЗаполнено(ПараметрыОтправки), "; ", "")
			+ НСтр("ru = 'Контролировать уникальность'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	Попытка
		АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, ЭтаФорма.УникальныйИдентификатор);
		ПЛ_УведомленияОСобытиях.УведомленияПоРегламентнымПроверкам(Объект.Событие, Объект.Ссылка, АдресРезультата);
		
		Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
		
			Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
			
			СправочникОбъект = РеквизитФормыВЗначение("Объект");
			СправочникОбъект.Статус = -1;
			
			Если Результат <> Неопределено Тогда
				Если Результат.ОтправленныеСообщения.Количество() Тогда
					Для каждого ОтправленноеСообщение Из Результат.ОтправленныеСообщения Цикл
						Если ОтправленноеСообщение.Уведомление = Объект.Ссылка Тогда
							Если ОтправленноеСообщение.СпособДоставки = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
								Если ОтправленноеСообщение.Свойство("ИдентификаторСообщения") И ОтправленноеСообщение.ИдентификаторСообщения <> Неопределено Тогда
									СправочникОбъект.Статус = 2;
									СправочникОбъект.ИдентификаторСообщения = ОтправленноеСообщение.ИдентификаторСообщения;
								КонецЕсли;
							Иначе
								СправочникОбъект.Статус = 2;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ЗначениеЗаполнено(Результат.ОписаниеОшибки) Тогда
					Сообщить(НСтр("ru='Не удалось отправить рассылку по причине:'") + " " + Результат.ОписаниеОшибки
						+ " " + НСтр("ru='Подробное описание см. в журнале регистрации.'"));
				КонецЕсли;
			КонецЕсли;
			
			СправочникОбъект.Записать();
			ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
			
			ЗаполнитьСостояние();
			УстановитьВидимостьДоступность();
		КонецЕсли;
		
	Исключение
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Отправка уведомления о событии'"),
			УровеньЖурналаРегистрации.Предупреждение,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

// Применение СКД

&НаСервере
Процедура ПрименитьИзменениеУсловий(СтруктураРезультата)
	
	НомерСтроки = СтруктураРезультата.НомерСтроки;
	Объект.Получатели[НомерСтроки - 1].АдресСхемыУсловий = СтруктураРезультата.АдресСхемы;
	Объект.Получатели[НомерСтроки - 1].АдресНастроекУсловий = СтруктураРезультата.АдресНастроек;
	
	НастройкиУсловий = ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресНастроек);
	Если ЗначениеЗаполнено(НастройкиУсловий)
		И НастройкиУсловий.Отбор.Элементы.Количество() Тогда
		Объект.Получатели[НомерСтроки - 1].СтрокаУсловий = Строка(НастройкиУсловий.Отбор);
		Объект.Получатели[НомерСтроки - 1].ВидУсловийОтправкиУведомления = Перечисления.ПЛ_ВидыУсловийУведомлений.ОтборПоИсточнику;
	Иначе
		Объект.Получатели[НомерСтроки - 1].СтрокаУсловий = "<" + НСтр("ru = 'задать условие'") + ">";
		Объект.Получатели[НомерСтроки - 1].ВидУсловийОтправкиУведомления = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзменениеВыборкиАдресатов(СтруктураРезультата)
	
	НомерСтроки = СтруктураРезультата.НомерСтроки;
	Объект.Получатели[НомерСтроки - 1].АдресСхемыВыборкиАдресатов = СтруктураРезультата.АдресСхемы;
	Объект.Получатели[НомерСтроки - 1].АдресНастроекВыборкиАдресатов = СтруктураРезультата.АдресНастроек;
	Объект.Получатели[НомерСтроки - 1].СпособАдресацииУведомления = Перечисления.ПЛ_СпособыАдресацииУведомлений.Запрос;
	Объект.Получатели[НомерСтроки - 1].Включен = Истина;
	Объект.Получатели[НомерСтроки - 1].Адресат = СтруктураРезультата.АдресатСтрокой;
	Если Не ЗначениеЗаполнено(Объект.Получатели[НомерСтроки - 1].ВидУсловийОтправкиУведомления) Тогда
		Объект.Получатели[НомерСтроки - 1].ВидУсловийОтправкиУведомления = Перечисления.ПЛ_ВидыУсловийУведомлений.БезУсловия;
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьИзменениеШаблоновСообщения(СтруктураРезультата)
	
	ЭтаФорма.АдресСхемыКомпоновкиШаблонов = СтруктураРезультата.АдресСхемы;
	ЭтаФорма.АдресНастроекКомпоновкиШаблонов = СтруктураРезультата.АдресНастроек;
	
	ТекстШаблона = СтруктураРезультата.ТекстСообщения;
	
	Если СтруктураРезультата.ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.ЭлектроннаяПочта
		Или СтруктураРезультата.ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.СервисПочтовойРассылки Тогда
		
		Объект.ОбычныйТекст    = СтруктураРезультата.ОбычныйТекст;
		Объект.Наименование    = СтруктураРезультата.ТемаСообщения;
		
		Если Не Объект.ОбычныйТекст Тогда
			ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
		КонецЕсли;
		
		Объект.ТаблицыШаблонов.Загрузить(ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресТаблиц));
		
		ТаблицаПечатныхФорм = ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресПечатныхФорм);
		Отбор = Новый Структура;
		Отбор.Вставить("Пометка", Истина);
		ВыбранныеПечатныеФормы = ТаблицаПечатныхФорм.НайтиСтроки(Отбор);
		
		Объект.ПечатныеФормы.Очистить();
		Для каждого ВыбраннаяПечатнаяФорма Из ВыбранныеПечатныеФормы Цикл
			НоваяПечатнаяФорма = Объект.ПечатныеФормы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяПечатнаяФорма, ВыбраннаяПечатнаяФорма);
		КонецЦикла;
		Объект.ФорматВложений = СтруктураРезультата.ФорматВложений;
		
		ТаблицаПрисоединенныхФайлов.Очистить();
		ТаблицаПрисоединенныхФайлов.Загрузить(ПолучитьИзВременногоХранилища(СтруктураРезультата.АдресПрисоединенныхФайлов));
		
		ОбновитьЗаголовокВложений();
		УстановитьВидимостьДоступность();
		
	ИначеЕсли СтруктураРезультата.ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.СМС Тогда
		
		Объект.ОбычныйТекст    = Истина;
		Объект.ТекстСообщения  = СтруктураРезультата.ТекстСообщения;
		
	ИначеЕсли СтруктураРезультата.ТипСообщения = Перечисления.ПЛ_СпособыДоставкиУведомлений.ВнутреннееСообщение Тогда
		
		Объект.ОбычныйТекст    = Истина;
		Объект.Наименование    = СтруктураРезультата.ТемаСообщения;
		Объект.ТекстСообщения  = СтруктураРезультата.ТекстСообщения;
		
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

// Прочее

&НаСервере
Процедура ПроверитьНастройкиСпособовДоставки()
	
	ПЛ_УведомленияОСобытиях.ПроверитьНастройкиСпособовДоставки(ПочтаНастроена, СМСДоступны, СМСНастроены, НапоминанияДоступны, РассылкиНастроены);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокВложений()
	
	ЗаголовокВложений = "";
	Для каждого СтрокаПечатныхФорм ИЗ Объект.ПечатныеФормы Цикл
		ЗаголовокВложений = ЗаголовокВложений + ?(ЗаголовокВложений = "", "", "; ") + СтрокаПечатныхФорм.ПечатнаяФорма;
	КонецЦикла;
	
	Для каждого СтрокаВложений Из ТаблицаПрисоединенныхФайлов Цикл
		ЗаголовокВложений = ЗаголовокВложений + ?(ЗаголовокВложений = "", "", "; ") + СтрокаВложений.Имя;
	КонецЦикла;
	
	Элементы.ГруппаВложения.Видимость = ЗначениеЗаполнено(ЗаголовокВложений);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСостояние()
	
	Если Объект.Статус = 0 Тогда
		Заголовок = НСтр("ru = '<Черновик>'");
	ИначеЕсли Объект.Статус = 2 Тогда
		Элементы.ЗаголовокВыполнить.Заголовок = НСтр("ru = '<Отправлено>'");
	ИначеЕсли Объект.Статус = -1 Тогда
		Заголовок = НСтр("ru = '<Ошибка отправки>'");
	Иначе
		Заголовок = "";
	КонецЕсли;
	
	Если Объект.Статус = 2 Тогда
		Элементы.ЗаголовокВыполнить.Заголовок = НСтр("ru = 'Отправлено:'");
	Иначе
		Элементы.ЗаголовокВыполнить.Заголовок = НСтр("ru = 'Отправить:'");
	КонецЕсли;
	
КонецПроцедуры

// HTML

&НаКлиенте
Процедура ПолучитьHTMLИзПоляHTMLДокумента()
	
	Если Не Объект.ОбычныйТекст Тогда
		HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
		Если HTMLДокумент <> Неопределено Тогда
			Head = HTMLДокумент.head.innerHTML;
			Body = HTMLДокумент.body.innerHTML;
			ТекстШаблона = "<html><head>" + Head + "</head>" + "<body>" + Body + "</body></html>";
			ЗапомнитьПозициюHTML();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьПозициюHTML()
	
	#Если ВебКлиент Тогда
		Возврат;
	#КонецЕсли
	
	HTMLДокумент = Элементы.ТекстСообщенияHTML.Документ;
	
	Попытка
		ie9_body = HTMLДокумент.ie9_body;
	Исключение
		Возврат;
	КонецПопытки;
	
	Попытка
		
		Выделение = HTMLДокумент.getSelection();
		
		Узел = Выделение.getRangeAt(0).startContainer;
		ТекущееПоложениеНачало = Выделение.getRangeAt(0).startOffset;
		ТекущееПоложениеКонец = Выделение.getRangeAt(0).endOffset;
		
		Счетчик = 0;
		НайденныйНомерУзла = -1;
		Результат = НайтиНомерУзла(HTMLДокумент, Узел, Счетчик, НайденныйНомерУзла);
		
		ТекущийНомерУзла = НайденныйНомерУзла;
		
		ГоризонтальнаяПрокруткаHTML = HTMLДокумент.body.scrollLeft;
		ВертикальнаяПрокруткаHTML = HTMLДокумент.body.scrollTop;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиНомерУзла(ТекущийУзел, ВыделенныйУзел, Счетчик, НайденныйНомерУзла)
	
	Если ТекущийУзел.childNodes.length = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого Узел Из ТекущийУзел.childNodes Цикл
		
		Счетчик = Счетчик + 1;
		
		Если Узел = ВыделенныйУзел Тогда
			НайденныйНомерУзла = Счетчик;
			Возврат Истина;
		КонецЕсли;
		
		Результат = НайтиНомерУзла(Узел, ВыделенныйУзел, Счетчик, НайденныйНомерУзла);
		Если Результат = Истина Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВыполнитьПереключениеОбычныйТекст()
	
	ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстИзHTML(ТекстШаблона);
	Объект.ТекстСообщения = ТекстШаблона;
	Объект.ОбычныйТекст = Истина;
	
	УстановитьВидимостьДоступность();
	УстановитьПараметрыОтправки();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПереключениеHTML()
	
	ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьHTMLИзТекста(ТекстШаблона);
	ПЛ_УведомленияОСобытияхКлиентСервер.ВключитьРежимРедактированияHTML(ТекстШаблона);
	Объект.ОбычныйТекст = Ложь;
	
	УстановитьВидимостьДоступность();
	УстановитьПараметрыОтправки();
	
КонецПроцедуры

&НаСервере
Процедура ВставитьКартинкиВТекстHTML(СправочникОбъект)
	
	ДокументHTML = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьДокументHTMLИзТекстаHTML(ТекстШаблона);
	
	Для каждого Картинка Из ДокументHTML.Картинки Цикл
		
		АтрибутИсточникКартинки = Картинка.Атрибуты.ПолучитьИменованныйЭлемент("src");
		ИдентификаторКартинки = Сред(АтрибутИсточникКартинки.ТекстовоеСодержимое, СтрДлина("cid:") + 1);
		
		СтрокаВложения = СправочникОбъект.Вложения.Найти(ИдентификаторКартинки, "Идентификатор");
		Если СтрокаВложения <> Неопределено Тогда
			
			ИмяВремФайла = КаталогВременныхФайлов() + СтрокаВложения.Имя;
			СтрокаВложения.Вложение.Получить().Записать(ИмяВремФайла);
			
			НовыйАтрибутКартинки = АтрибутИсточникКартинки.КлонироватьУзел(Ложь);
			НовыйАтрибутКартинки.ТекстовоеСодержимое = "file://" + ИмяВремФайла;
			Картинка.Атрибуты.УстановитьИменованныйЭлемент(НовыйАтрибутКартинки);
		КонецЕсли;
	КонецЦикла;
	
	КоллекцияТаблиц = ДокументHTML.ПолучитьЭлементыПоИмени("TABLE");
	Для каждого ЭлементКоллекции Из КоллекцияТаблиц Цикл
		Для каждого Атрибут Из ЭлементКоллекции.Атрибуты Цикл
			Если ВРег(Атрибут.Имя) = "BACKGROUND" Тогда
				
				Если Найти(Атрибут.Значение, "cid") Тогда
					
					ИдентификаторКартинки = Сред(Атрибут.Значение, СтрДлина("cid:") + 1);
					
					СтрокаВложения = СправочникОбъект.Вложения.Найти(ИдентификаторКартинки, "Идентификатор");
					Если СтрокаВложения <> Неопределено Тогда
						ИмяВремФайла = КаталогВременныхФайлов() + СтрокаВложения.Имя;
						СтрокаВложения.Вложение.Получить().Записать(ИмяВремФайла);
						Атрибут.ЗначениеУзла = "file://" + ИмяВремФайла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ТекстШаблона = ПЛ_УведомленияОСобытияхКлиентСервер.ПолучитьТекстHTMLИзДокументаHTML(ДокументHTML);
	
КонецПроцедуры

