
&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
		
	СтруктураВыбора = Новый Структура("СписокЗначенийИнфоПоля");
		
	СтруктураВыбора.СписокЗначенийИнфоПоля = Новый Массив;
	Для Каждого ЭлементДерева Из СписокЗначенийИнфоПолей.ПолучитьЭлементы() Цикл
		Для Каждого ЭлементПоддерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
			СтруктураДанных = Новый Структура("Товар,КлючИнфоПоля,ЗначениеИнфоПоля");
			ЗаполнитьЗначенияСвойств(СтруктураДанных, ЭлементПоддерева);
			СтруктураВыбора.СписокЗначенийИнфоПоля.Добавить(СтруктураДанных);	
		КонецЦикла;
	КонецЦикла;
	Закрыть(СтруктураВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("МассивТоваров") Тогда
		Для Каждого Товар Из Параметры.МассивТоваров Цикл
			КоллекцияУзлов = СписокЗначенийИнфоПолей.ПолучитьЭлементы();
			СтрокаТовара = НайтиЭлементТовара(Товар.Товар, КоллекцияУзлов);
			Если СтрокаТовара = Неопределено Тогда
				СтрокаТовара = КоллекцияУзлов.Добавить();
				СтрокаТовара.Товар = Товар.Товар;
			КонецЕсли;
			Если Товар.КлючИнфоПоля <> Неопределено Тогда
				ДочЭлементТовара = СтрокаТовара.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(ДочЭлементТовара, Товар);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НайтиЭлементТовара(ИмяЭлемента, КоллекцияУзлов)
	Для Каждого Узел Из КоллекцияУзлов Цикл
		Если Узел.Товар = ИмяЭлемента Тогда
			Возврат Узел;	
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;	
КонецФункции

&НаКлиенте
Процедура ДобавитьЗначение(Команда)
	Если НЕ ЗначениеЗаполнено(НаименованиеИнфоПоля) Тогда
		Сообщить("Не указан общий ключ инфополя");
		Возврат;
	КонецЕсли;
	ЭлементДерева = Элементы.СписокЗначенийИнфоПолей.ТекущиеДанные;
	Пока ЭлементДерева.ПолучитьРодителя() <> Неопределено Цикл
		ЭлементДерева = ЭлементДерева.ПолучитьРодителя();	
	КонецЦикла;
	Подэлемент = ЭлементДерева.ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(Подэлемент, ЭлементДерева);
	ДопПараметры = Новый Структура("Подэлемент", Подэлемент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьЗначениеЗавершение", ЭтаФорма, ДопПараметры);
	ПоказатьВводСтроки(ОписаниеОповещения,,"Укажите значение инфополя");
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьЗначениеЗавершение(Значение, ДопПараметры) Экспорт
	Если ДопПараметры.Свойство("Подэлемент") Тогда
		ЭлементДерева = ДопПараметры.Подэлемент;
		Пока ЭлементДерева.ПолучитьРодителя() <> Неопределено Цикл
			ЭлементДерева = ЭлементДерева.ПолучитьРодителя();	
		КонецЦикла;
		ДопПараметры.Подэлемент.ЗначениеИнфоПоля = Значение;
		ДопПараметры.Подэлемент.КлючИнфоПоля = НаименованиеИнфоПоля;
		Если НаименованиеИнфоПоля = "cis" Тогда
			//Обработка КИЗов
			ДопПараметры.Подэлемент.ЗначениеИнфоПоля = Лев(Значение, 21);
			Если КИЗСуществует(ДопПараметры.Подэлемент) Тогда
				Сообщить("Внимание! Такое значение уже существует!");
				ИндексУдаления = ЭлементДерева.ПолучитьЭлементы().Индекс(ДопПараметры.Подэлемент);
				ЭлементДерева.ПолучитьЭлементы().Удалить(ИндексУдаления);		
			КонецЕсли;					
		КонецЕсли;
		
		Элементы.СписокЗначенийИнфоПолей.Развернуть(Элементы.СписокЗначенийИнфоПолей.ТекущаяСтрока, Истина);
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Функция КИЗСуществует(ЭлементУзла)
	КоллекцияУзлов = СписокЗначенийИнфоПолей.ПолучитьЭлементы();
	Для Каждого Узел Из КоллекцияУзлов Цикл
		Подузлы = Узел.ПолучитьЭлементы();
		Для Каждого ПодУзел Из Подузлы Цикл
			Если ПодУзел <> ЭлементУзла И ПодУзел.КлючИнфоПоля = "cis" И ПодУзел.ЗначениеИнфоПоля = ЭлементУзла.ЗначениеИнфоПоля  Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

&НаКлиенте
Процедура СписокЗначенийИнфоПолейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
