Перем КорректировкаЗаказаПоставщика, КорректировкаЗаказаПокупателя;
Перем КорректировкаСборкиЗаказов;
Перем КорректировкаГрузовогоМеста;

Функция  СоздатьКорректировкиЗаказовПокупателяИПоставщику(ПромЗаказ)
	
	ЗапросИзмененийпоЗакзазу = Новый Запрос;
	ЗапросИзмененийпоЗакзазу.УстановитьПараметр("ДокЗаказ",ПромЗаказ); 
	ЗапросИзмененийпоЗакзазу.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя,
	|	ЗапросыИзмененияКоличестваВЗаказах.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗапросыИзмененияКоличестваВЗаказах.Количество > ЗаказПокупателяТовары.Количество
	|			ТОГДА ЗаказПокупателяТовары.Количество
	|		ИНАЧЕ ЗапросыИзмененияКоличестваВЗаказах.Количество
	|	КОНЕЦ КАК Количество,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Размещение,
	|	ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки КАК КлючСтроки,
	|	ЗапросыИзмененияКоличестваВЗаказах.Количество КАК КоличествоВЗапросе,
	|	ЗапросыИзмененияКоличестваВЗаказах.ДатаЗапроса
	|ПОМЕСТИТЬ ОбщаяТаблица
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|		ПО ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
	|			И ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки = ЗаказПокупателяТовары.КлючСтроки
	|ГДЕ
	|	НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|	И ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = &ДокЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	СУММА(ОбщаяТаблица.Количество) КАК Количество,
	|	ОбщаяТаблица.СерияНоменклатуры,
	|	ОбщаяТаблица.Размещение
	|ИЗ
	|	ОбщаяТаблица КАК ОбщаяТаблица
	|ГДЕ
	|	ОбщаяТаблица.Размещение = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	ОбщаяТаблица.СерияНоменклатуры,
	|	ОбщаяТаблица.Размещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	СУММА(ОбщаяТаблица.Количество) КАК Количество,
	|	ОбщаяТаблица.СерияНоменклатуры,
	|	ОбщаяТаблица.Размещение
	|ИЗ
	|	ОбщаяТаблица КАК ОбщаяТаблица
	|ГДЕ
	|	НЕ ОбщаяТаблица.Размещение = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	ОбщаяТаблица.СерияНоменклатуры,
	|	ОбщаяТаблица.Размещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва КАК ЗаказПокупателя,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад КАК Размещение,
	|	СУММА(ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВтТоварыВРезервеПоЗаказу
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , ДокументРезерва = &ДокЗаказ) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
	|ГДЕ
	|	(ТоварыВРезервеНаСкладахОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|			ИЛИ ТоварыВРезервеНаСкладахОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаЗаказаПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыВРезервеПоЗаказу.ЗаказПокупателя,
	|	ВтТоварыВРезервеПоЗаказу.Номенклатура,
	|	ВтТоварыВРезервеПоЗаказу.Количество,
	|	ВтТоварыВРезервеПоЗаказу.СерияНоменклатуры,
	|	ВтТоварыВРезервеПоЗаказу.Размещение
	|ИЗ
	|	ВтТоварыВРезервеПоЗаказу КАК ВтТоварыВРезервеПоЗаказу
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад КАК Размещение,
	|	СУММА(ТоварыВРезервеНаСкладахОстаткиИОбороты.КоличествоОборот) КАК Количество
	|ПОМЕСТИТЬ ВтТоварыВРезервеПоПоступлению
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.ОстаткиИОбороты(, , Запись, , ДокументРезерва = &ДокЗаказ) КАК ТоварыВРезервеНаСкладахОстаткиИОбороты
	|ГДЕ
	|	НЕ(ТоварыВРезервеНаСкладахОстаткиИОбороты.Регистратор ССЫЛКА Документ.ЗаказПокупателя
	|				ИЛИ ТоварыВРезервеНаСкладахОстаткиИОбороты.Регистратор ССЫЛКА Документ.КорректировкаЗаказаПокупателя)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.Склад,
	|	ТоварыВРезервеНаСкладахОстаткиИОбороты.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыВРезервеПоПоступлению.ДокументРезерва,
	|	ВтТоварыВРезервеПоПоступлению.Номенклатура,
	|	ВтТоварыВРезервеПоПоступлению.СерияНоменклатуры,
	|	ВтТоварыВРезервеПоПоступлению.Размещение КАК Размещение,
	|	ВтТоварыВРезервеПоПоступлению.Количество КАК Количество
	|ИЗ
	|	ВтТоварыВРезервеПоПоступлению КАК ВтТоварыВРезервеПоПоступлению
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	СУММА(ЗаказыПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВтОстаткиПоЗаказуВсего
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &ДокЗаказ) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.Номенклатура В
	|			(ВЫБРАТЬ
	|				Таб.Номенклатура
	|			ИЗ
	|				ОбщаяТаблица КАК Таб)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстаткиПоЗаказуВсего.ЗаказПокупателя,
	|	ВтОстаткиПоЗаказуВсего.Номенклатура,
	|	ВтОстаткиПоЗаказуВсего.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	ВтОстаткиПоЗаказуВсего КАК ВтОстаткиПоЗаказуВсего
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыВРезервеПоЗаказу.ЗаказПокупателя,
	|	ВтТоварыВРезервеПоЗаказу.Номенклатура,
	|	СУММА(ВтТоварыВРезервеПоЗаказу.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтТоварыВРезервеПоЗаказуВсего
	|ИЗ
	|	ВтТоварыВРезервеПоЗаказу КАК ВтТоварыВРезервеПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыВРезервеПоЗаказу.ЗаказПокупателя,
	|	ВтТоварыВРезервеПоЗаказу.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыВРезервеПоПоступлению.Номенклатура,
	|	ВтТоварыВРезервеПоПоступлению.ДокументРезерва,
	|	СУММА(ВтТоварыВРезервеПоПоступлению.Количество) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВтТоварыВРезервеПоПоступлениюВсего
	|ИЗ
	|	ВтТоварыВРезервеПоПоступлению КАК ВтТоварыВРезервеПоПоступлению
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтТоварыВРезервеПоПоступлению.Номенклатура,
	|	ВтТоварыВРезервеПоПоступлению.ДокументРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстаткиПоЗаказуВсего.ЗаказПокупателя,
	|	ВтОстаткиПоЗаказуВсего.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК Размещение,
	|	ВтОстаткиПоЗаказуВсего.КоличествоОстаток КАК КоличествоПоЗаказуВсего,
	|	ВтТоварыВРезервеПоЗаказуВсего.Количество КАК КоличествоВРезервеПоЗаказуВсего,
	|	ВтТоварыВРезервеПоПоступлениюВсего.КоличествоОстаток КАК КоличествоВРезервеПоПоступлениюВсего,
	|	ВтОстаткиПоЗаказуВсего.КоличествоОстаток - ЕСТЬNULL(ВтТоварыВРезервеПоПоступлениюВсего.КоличествоОстаток, 0) - ЕСТЬNULL(ВтТоварыВРезервеПоЗаказуВсего.Количество, 0) КАК Количество,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ВтТоварыНеВРезерве
	|ИЗ
	|	ВтОстаткиПоЗаказуВсего КАК ВтОстаткиПоЗаказуВсего
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыВРезервеПоЗаказуВсего КАК ВтТоварыВРезервеПоЗаказуВсего
	|		ПО ВтОстаткиПоЗаказуВсего.ЗаказПокупателя = ВтТоварыВРезервеПоЗаказуВсего.ЗаказПокупателя
	|			И ВтОстаткиПоЗаказуВсего.Номенклатура = ВтТоварыВРезервеПоЗаказуВсего.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтТоварыВРезервеПоПоступлениюВсего КАК ВтТоварыВРезервеПоПоступлениюВсего
	|		ПО ВтОстаткиПоЗаказуВсего.Номенклатура = ВтТоварыВРезервеПоПоступлениюВсего.Номенклатура
	|			И ВтОстаткиПоЗаказуВсего.ЗаказПокупателя = ВтТоварыВРезервеПоПоступлениюВсего.ДокументРезерва
	|ГДЕ
	|	ВтОстаткиПоЗаказуВсего.КоличествоОстаток - ЕСТЬNULL(ВтТоварыВРезервеПоПоступлениюВсего.КоличествоОстаток, 0) - ЕСТЬNULL(ВтТоварыВРезервеПоЗаказуВсего.Количество, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтТоварыНеВРезерве.ЗаказПокупателя,
	|	ВтТоварыНеВРезерве.Номенклатура,
	|	ВтТоварыНеВРезерве.Размещение,
	|	ВтТоварыНеВРезерве.КоличествоПоЗаказуВсего,
	|	ВтТоварыНеВРезерве.КоличествоВРезервеПоЗаказуВсего,
	|	ВтТоварыНеВРезерве.КоличествоВРезервеПоПоступлениюВсего,
	|	ВтТоварыНеВРезерве.Количество,
	|	ВтТоварыНеВРезерве.СерияНоменклатуры КАК СерияНоменклатуры
	|ИЗ
	|	ВтТоварыНеВРезерве КАК ВтТоварыНеВРезерве
	|
	|УПОРЯДОЧИТЬ ПО
	|	СерияНоменклатуры
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	СУММА(ОбщаяТаблица.Количество) КАК Количество,
	|	ОбщаяТаблица.КлючСтроки,
	|	СУММА(ОбщаяТаблица.КоличествоВЗапросе) КАК КоличествоВЗапросе,
	|	ОбщаяТаблица.ДатаЗапроса,
	|	ОбщаяТаблица.Размещение
	|ИЗ
	|	ОбщаяТаблица КАК ОбщаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	ОбщаяТаблица.КлючСтроки,
	|	ОбщаяТаблица.ДатаЗапроса,
	|	ОбщаяТаблица.Размещение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.СобраноОстаток,
	|	ТоварыВСборкеОстатки.КСборкеОстаток,
	|	ТоварыВСборкеОстатки.СобраноОстаток + ТоварыВСборкеОстатки.КСборкеОстаток КАК КоличествоВСборке
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			(ЗаказПокупателя, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ОбщаяТаблица.ЗаказПокупателя,
	|					ОбщаяТаблица.Номенклатура
	|				ИЗ
	|					ОбщаяТаблица КАК ОбщаяТаблица)) КАК ТоварыВСборкеОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбщаяТаблица.ЗаказПокупателя,
	|	ОбщаяТаблица.Номенклатура,
	|	ОбщаяТаблица.КоличествоВЗапросе
	|ПОМЕСТИТЬ ВтПромОбщаяТаблица
	|ИЗ
	|	ОбщаяТаблица КАК ОбщаяТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПромОбщаяТаблица.ЗаказПокупателя,
	|	ВтПромОбщаяТаблица.Номенклатура,
	|	СУММА(ВтПромОбщаяТаблица.КоличествоВЗапросе) КАК Количество
	|ИЗ
	|	ВтПромОбщаяТаблица КАК ВтПромОбщаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтПромОбщаяТаблица.ЗаказПокупателя,
	|	ВтПромОбщаяТаблица.Номенклатура";  
	
	МассивРезультатов = ЗапросИзмененийпоЗакзазу.ВыполнитьПакет(); 
	
	РезульатНеРезервыПоЗаказу = МассивРезультатов[1];   
	ВыборкаНеРезервыПоЗаказу = РезульатНеРезервыПоЗаказу.Выбрать();
	
	РезульатРезервыПоЗаказу = МассивРезультатов[2];   
	ВыборкаРезервыПоЗаказу = РезульатРезервыПоЗаказу.Выбрать();    
	
	РезульатТоварыВРезервеПоЗаказу = МассивРезультатов[4];   
	ТоварыВРезервеПоЗаказу = РезульатТоварыВРезервеПоЗаказу.Выгрузить();
	
	РезульатТоварыВРезервеПоПоступлению = МассивРезультатов[6];   
	ТоварыВРезервеПоПоступлению = РезульатТоварыВРезервеПоПоступлению.Выгрузить();
	
	РезульатОстаткиПоЗаказуВсего = МассивРезультатов[8];   
	ТаблицаОстаткиПоЗаказуВсего = РезульатОстаткиПоЗаказуВсего.Выгрузить();
	
	РезульатТоварыНеВРезерве = МассивРезультатов[12];   
	ТоварыНеВРезерве = РезульатТоварыНеВРезерве.Выгрузить(); 
	
	РезульатОбщаяТаблица = МассивРезультатов[13];   
	ОбщаяТаблица = РезульатОбщаяТаблица.Выгрузить();
	
	РезультатТоварыВСборке = МассивРезультатов[14];
	ТаблицаТоварыВСборке = РезультатТоварыВСборке.Выгрузить();
	
	РезультатТаблицаКоличествоВЗапросе = МассивРезультатов[16];
	ТаблицаКоличествоВЗапросе = РезультатТаблицаКоличествоВЗапросе.Выгрузить();
	
	ТаблицаТоваров = Новый ТаблицаЗначений; 
	ТаблицаТоваров.Колонки.Добавить("Номенклатура"); 
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Размещение"); 
	ТаблицаТоваров.Колонки.Добавить("Количество");   
	
	ТаблицаОбщееКоличество = Новый ТаблицаЗначений;
	ТаблицаОбщееКоличество.Колонки.Добавить("Номенклатура");
	ТаблицаОбщееКоличество.Колонки.Добавить("Количество"); 
	
	ЕстьНеРезервыПоЗаказу = ВыборкаНеРезервыПоЗаказу.Количество() > 0;
	
	// 1. Распределить незарезервированную номенклатуру   
	ТаблицаОстаткиПоЗаказуВсегоКопия = ТаблицаОстаткиПоЗаказуВсего.Скопировать();
	
	Пока ВыборкаНеРезервыПоЗаказу.Следующий() Цикл  
		
		КоличествоОсталосьПогасить = ВыборкаНеРезервыПоЗаказу.Количество;
		
		СтрокаОстаток = ТаблицаОстаткиПоЗаказуВсегоКопия.Найти(ВыборкаНеРезервыПоЗаказу.Номенклатура, "Номенклатура");
		
		Если СтрокаОстаток = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОстаток.КоличествоОстаток <= 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("Номенклатура", ВыборкаНеРезервыПоЗаказу.Номенклатура);
		МассивНайденных = ТоварыВРезервеПоПоступлению.НайтиСтроки(СтруктураПоиска); 
		
		Для Каждого НайденнаяСтрока Из МассивНайденных Цикл
			
			Если КоличествоОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			КПогашению = Мин(КоличествоОсталосьПогасить, НайденнаяСтрока.Количество, СтрокаОстаток.КоличествоОстаток);  
			
			Если КПогашению <= 0 Тогда
				Продолжить; 
			КонецЕсли; 
			
			НовСтрока = ТаблицаТоваров.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока, НайденнаяСтрока);
			НовСтрока.Количество = -КПогашению; 
			
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить - КПогашению; 
			СтрокаОстаток.КоличествоОстаток = СтрокаОстаток.КоличествоОстаток - КПогашению;
			
			НСтрока = ТаблицаОбщееКоличество.Найти(НайденнаяСтрока.Номенклатура, "Номенклатура"); 
			
			Если НСтрока = Неопределено Тогда
				
				НоваяСтрока = ТаблицаОбщееКоличество.Добавить();   
				НоваяСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
				НоваяСтрока.Количество = КПогашению; 
				
			Иначе
				НСтрока.Количество = НСтрока.Количество + КПогашению;
			КонецЕсли;
			
		КонецЦикла; 		
		
	КонецЦикла;  
	
	// 2. Добавить в таблицу строки, зарезервированные самим Заказом покупателя. 
	ТаблицаОстаткиПоЗаказуВсегоКопия = ТаблицаОстаткиПоЗаказуВсего.Скопировать(); 
	ТоварыВРезервеПоЗаказуКопия = ТоварыВРезервеПоЗаказу.Скопировать();
	
	Пока ВыборкаРезервыПоЗаказу.Следующий() Цикл
		
		КоличествоОсталосьПогасить = ВыборкаРезервыПоЗаказу.Количество;
		
		СтрокаОстаток = ТаблицаОстаткиПоЗаказуВсегоКопия.Найти(ВыборкаРезервыПоЗаказу.Номенклатура, "Номенклатура");
		
		Если СтрокаОстаток = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОстаток.КоличествоОстаток <= 0 Тогда 
			Продолжить;
		КонецЕсли;  
		
		СтруктураПоиска = Новый Структура("Номенклатура", ВыборкаРезервыПоЗаказу.Номенклатура);
		МассивНайденных = ТоварыВРезервеПоЗаказуКопия.НайтиСтроки(СтруктураПоиска);  
		
		Для Каждого НайденнаяСтрока Из МассивНайденных Цикл
			
			Если КоличествоОсталосьПогасить <= 0 Тогда
				Прервать;
			КонецЕсли;  
			
			Если НайденнаяСтрока.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КПогашению = Мин(КоличествоОсталосьПогасить, НайденнаяСтрока.Количество, СтрокаОстаток.КоличествоОстаток);  
			
			Если КПогашению <= 0 Тогда
				Продолжить; 
			КонецЕсли; 
			
			НовСтрока = ТаблицаТоваров.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока, НайденнаяСтрока);
			НовСтрока.Количество = -КПогашению; 
			
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить - КПогашению; 
			СтрокаОстаток.КоличествоОстаток = СтрокаОстаток.КоличествоОстаток - КПогашению;  
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КПогашению;
			
			НСтрока = ТаблицаОбщееКоличество.Найти(НайденнаяСтрока.Номенклатура, "Номенклатура"); 
			
			Если НСтрока = Неопределено Тогда
				
				НоваяСтрока = ТаблицаОбщееКоличество.Добавить();   
				НоваяСтрока.Номенклатура = НайденнаяСтрока.Номенклатура;
				НоваяСтрока.Количество = КПогашению; 
				
			Иначе
				НСтрока.Количество = НСтрока.Количество + КПогашению;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла; 
	
	// Добавить незарезирвированные товары 
	ТаблицаОстаткиПоЗаказуВсегоКопия = ТаблицаОстаткиПоЗаказуВсего.Скопировать();
	
	Если ЕстьНеРезервыПоЗаказу Тогда
		
		КопияТаблицаКоличествоВЗапросе = ТаблицаКоличествоВЗапросе.Скопировать();
		
		Для Каждого Строка Из ТоварыНеВРезерве Цикл 
			
			КоличествоОсталосьПогасить = Строка.Количество;
			
			СтрокаОстаток = ТаблицаОстаткиПоЗаказуВсегоКопия.Найти(Строка.Номенклатура, "Номенклатура");  
			СтрокаКоличествоВЗапросе =  КопияТаблицаКоличествоВЗапросе.Найти(Строка.Номенклатура, "Номенклатура");
			
			Если СтрокаОстаток = Неопределено Или СтрокаКоличествоВЗапросе = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СтрокаОстаток.КоличествоОстаток <= 0 Или СтрокаКоличествоВЗапросе.Количество <= 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			КПогашению = Мин(КоличествоОсталосьПогасить, СтрокаОстаток.КоличествоОстаток, СтрокаКоличествоВЗапросе.Количество); 
			
			Если КПогашению <= 0 Тогда
				Продолжить; 
			КонецЕсли; 
			
			НовСтрока = ТаблицаТоваров.Добавить(); 
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
			НовСтрока.Количество = -КПогашению; 
			
			КоличествоОсталосьПогасить = КоличествоОсталосьПогасить - КПогашению; 
			СтрокаОстаток.КоличествоОстаток = СтрокаОстаток.КоличествоОстаток - КПогашению;  
			СтрокаКоличествоВЗапросе.Количество = СтрокаКоличествоВЗапросе.Количество - КПогашению; 
			
			НСтрока = ТаблицаОбщееКоличество.Найти(Строка.Номенклатура, "Номенклатура"); 
			
			Если НСтрока = Неопределено Тогда
				
				НоваяСтрока = ТаблицаОбщееКоличество.Добавить();   
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
				НоваяСтрока.Количество = КПогашению; 
				
			Иначе
				НСтрока.Количество = НСтрока.Количество + КПогашению;
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;   
	
	ТаблицаТоваров.Свернуть("Номенклатура, СерияНоменклатуры, Размещение", "Количество");
	
	// Исключить товары в сборке   
	ТаблицаТоваров.Сортировать("СерияНоменклатуры Убыв"); // Для исключения заказанных в первую очередь  
	КопияТаблицаКоличествоВЗапросе = ТаблицаКоличествоВЗапросе.Скопировать();   
	ТаблицаОстаткиПоЗаказуВсегоКопия = ТаблицаОстаткиПоЗаказуВсего.Скопировать();
	
	Для Каждого СтрокаСборка Из ТаблицаТоварыВСборке Цикл    
		
		СтрокаОстаткиПоЗаказуВсего = ТаблицаОстаткиПоЗаказуВсегоКопия.Найти(СтрокаСборка.Номенклатура, "Номенклатура"); 
		СтрокаКоличествоВЗапросе = КопияТаблицаКоличествоВЗапросе.Найти(СтрокаСборка.Номенклатура, "Номенклатура"); 
		СтрокаТоварыВРезервеПоЗаказу = ТоварыВРезервеПоЗаказу.Найти(СтрокаСборка.Номенклатура, "Номенклатура");
		
		ТекКоличествоВсего = Мин(?(СтрокаОстаткиПоЗаказуВсего = Неопределено, 0, СтрокаОстаткиПоЗаказуВсего.КоличествоОстаток), 
		?(СтрокаКоличествоВЗапросе = Неопределено, 0, СтрокаКоличествоВЗапросе.Количество),
		?(СтрокаТоварыВРезервеПоЗаказу = Неопределено, 0, СтрокаТоварыВРезервеПоЗаказу.Количество));
		
		СтрокаОбщееКоличество = ТаблицаОбщееКоличество.Найти(СтрокаСборка.Номенклатура, "Номенклатура"); 
		ТекОбщееКоличество = ?(СтрокаОбщееКоличество = Неопределено, 0, СтрокаОбщееКоличество.Количество);
		
		СтрокаКоличествоВЗапросе = ТаблицаКоличествоВЗапросе.Найти(СтрокаСборка.Номенклатура, "Номенклатура"); 
		ТекОКоличествоВЗапросе = ?(СтрокаКоличествоВЗапросе = Неопределено, 0, СтрокаКоличествоВЗапросе.Количество);
		
		Дельта = ТекКоличествоВсего - СтрокаСборка.КоличествоВСборке - ТекОбщееКоличество;
		
		Если Дельта >= 0 Тогда 
			Продолжить;
		КонецЕсли;	
		
		МожноСписать = -Дельта;
		
		СтруктураПоиска = Новый Структура("Номенклатура", СтрокаСборка.Номенклатура);
		МассивНайденных = ТаблицаТоваров.НайтиСтроки(СтруктураПоиска);
		
		КоличествоОсталосьРаспределить = Мин(МожноСписать, СтрокаСборка.КоличествоВСборке);		
		
		Для Каждого НайденнаяСтрока Из МассивНайденных Цикл  
			
			Если Не ЗначениеЗаполнено(НайденнаяСтрока.Размещение) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НайденнаяСтрока.Количество > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если КоличествоОсталосьРаспределить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			КРаспределению = Мин(КоличествоОсталосьРаспределить, -НайденнаяСтрока.Количество);
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + КРаспределению;
			КоличествоОсталосьРаспределить = КоличествоОсталосьРаспределить - КРаспределению;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Удалить строки с нулевым количеством
	сч = 0;
	
	Пока сч < ТаблицаТоваров.Количество() Цикл 
		
		ТекСтрока = ТаблицаТоваров.Получить(сч);
		
		Если ТекСтрока.Количество >= 0 Тогда
			ТаблицаТоваров.Удалить(ТекСтрока);
		Иначе
			сч = сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаТоваров.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;  
	
	НебылоОшибокСоздания = Истина;
	КорректировкаЗаказаПокупателя  = Документы.КорректировкаЗаказаПокупателя.ПустаяСсылка();  
	НачатьТранзакцию();
	
	Попытка   
		СоздатьКорректировкуЗаказаПокупателяПоТаблицеТоваров(ТаблицаТоваров, ПромЗаказ, Истина); 
	Исключение 
		
		ОтменитьТранзакцию();
		НебылоОшибокСоздания = Ложь;
		
	КонецПопытки;
	
	Если НЕ КорректировкаЗаказаПокупателя.Ссылка.Пустая() Тогда 
		СоздатьКорректировкуЗаказаПоставщикуПоКорректировкеЗаказаПокупателя(КорректировкаЗаказаПокупателя, НебылоОшибокСоздания);   
	КонецЕсли; 
	
	Если НебылоОшибокСоздания Тогда
		
		ЗафиксироватьТранзакцию();   
		
		// Скорректировать ОбщуюТаблицу  
		ОбщаяТаблица.Сортировать("Количество Убыв");
		
		Для Каждого СтрокаТоварыВРезервеПоПоступлению Из ТоварыВРезервеПоПоступлению Цикл
			
			СтруктураПоиска = Новый Структура("Номенклатура, Размещение", СтрокаТоварыВРезервеПоПоступлению.Номенклатура, Неопределено);
			МассивНайденных = ОбщаяТаблица.НайтиСтроки(СтруктураПоиска);  
			
			КоличествоОстаток = СтрокаТоварыВРезервеПоПоступлению.Количество;
			
			Для Каждого НайденнаяСтрока Из МассивНайденных Цикл    
				
				Если КоличествоОстаток <= 0 Тогда
					Прервать;
				КонецЕсли;   
				
				КоличествоПогасить = Мин(КоличествоОстаток, НайденнаяСтрока.Количество);
				
				НайденнаяСтрока.Размещение = СтрокаТоварыВРезервеПоПоступлению.Размещение;   
				
				КоличествоОстаток = КоличествоОстаток - КоличествоПогасить;
				
			КонецЦикла;
			
		КонецЦикла;
		
		ТабТовары = КорректировкаЗаказаПокупателя.Товары.Выгрузить();
		ТабТовары.Свернуть("Номенклатура, Размещение", "Количество"); 
		
		Для Каждого СтрТовары из ТабТовары Цикл 
			
			СтрТовары.Количество = -СтрТовары.Количество;  
			СтрТовары.Размещение = ?(ЗначениеЗаполнено(СтрТовары.Размещение), СтрТовары.Размещение, Неопределено);
			
		КонецЦикла;
		
		Для Каждого Строка Из ОбщаяТаблица Цикл      
			
			СтруктураПоиска = Новый Структура("Номенклатура, Размещение", Строка.Номенклатура, Строка.Размещение);
			МассивНайденных = ТабТовары.НайтиСтроки(СтруктураПоиска);   
			
			Если МассивНайденных.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НайденнаяСтрока = МассивНайденных[0];
			
			Если НайденнаяСтрока.Количество <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоКСписанию = Мин(Строка.Количество, НайденнаяСтрока.Количество); 
			
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КоличествоКСписанию;
			
			РегЗапросИзменений = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.СоздатьМенеджерЗаписи();
			РегЗапросИзменений.ЗаказПокупателя = ПромЗаказ;
			РегЗапросИзменений.Номенклатура    = Строка.Номенклатура;
			РегЗапросИзменений.КлючСтроки      = Строка.КлючСтроки;
			РегЗапросИзменений.ДатаЗапроса     = Строка.ДатаЗапроса;
			РегЗапросИзменений.Прочитать();
			РегЗапросИзменений.Обработано = Истина;
			РегЗапросИзменений.ДокументКорректировки = КорректировкаЗаказаПокупателя.Ссылка;
			РегЗапросИзменений.Записать(Истина);
			
		КонецЦикла;
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат НебылоОшибокСоздания;
	
КонецФункции 

Процедура СоздатьКорректировкуЗаказаПоставщикуПоКорректировкеЗаказаПокупателя(КорректировкаЗаказаПокупателя, НебылоОшибокСоздания) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя,
	|	КорректировкаЗаказаПокупателяТовары.Номенклатура,
	|	СУММА(КорректировкаЗаказаПокупателяТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВтКорректировкаЗаказа
	|ИЗ
	|	Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	|ГДЕ
	|	КорректировкаЗаказаПокупателяТовары.Ссылка = &Ссылка
	|	И (КорректировкаЗаказаПокупателяТовары.Размещение = НЕОПРЕДЕЛЕНО
	|			ИЛИ КорректировкаЗаказаПокупателяТовары.Размещение = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя,
	|	КорректировкаЗаказаПокупателяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКорректировкаЗаказа.ЗаказПокупателя,
	|	ВтКорректировкаЗаказа.Номенклатура,
	|	-ВтКорректировкаЗаказа.Количество КАК Количество
	|ИЗ
	|	ВтКорректировкаЗаказа КАК ВтКорректировкаЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.ТоварТара,
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ХарактеристикаНоменклатуры,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику,
	|	СУММА(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			,
	|			(ЗаказПокупателя, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ВтКорректировкаЗаказа.ЗаказПокупателя,
	|					ВтКорректировкаЗаказа.Номенклатура
	|				ИЗ
	|					ВтКорректировкаЗаказа КАК ВтКорректировкаЗаказа)) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику,
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ХарактеристикаНоменклатуры,
	|	РазмещениеЗаказовПокупателейОстатки.ТоварТара";
	
	Запрос.УстановитьПараметр("Ссылка", КорректировкаЗаказаПокупателя);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ТаблицаКорректировка = МассивРезультатов[1].Выгрузить(); 
	ТаблицаРазмещение = МассивРезультатов[2].Выгрузить(); 
	
	Если ТаблицаРазмещение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаТовары = ТаблицаРазмещение.Скопировать();
	ТаблицаТовары.Очистить();
	
	Для Каждого Строка Из ТаблицаРазмещение Цикл 
		
		КоличествоРаспределить = Строка.Количество;
		
		СтруктураПоиска = Новый Структура("Номенклатура", Строка.Номенклатура);
		МассивНайденных = ТаблицаКорректировка.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрока Из МассивНайденных Цикл
			
			Если КоличествоРаспределить <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			КЗаполнению = Мин(КоличествоРаспределить, НайденнаяСтрока.Количество);
			
			Если КЗаполнению <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.Количество = КЗаполнению;
			
			КоличествоРаспределить = КоличествоРаспределить - КЗаполнению; 
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - КЗаполнению;
			
		КонецЦикла;
		
	КонецЦикла;   
	
	МассивЗаказовПоставщику = ТаблицаТовары.ВыгрузитьКолонку("ЗаказПоставщику");
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивЗаказовПоставщику);
	
	Для Каждого ЗаказПоставщику Из МассивЗаказовПоставщику Цикл 
		
		НовыйДокумент = Документы.КорректировкаЗаказаПоставщику.СоздатьДокумент(); 
		НовыйДокумент.Заполнить(ЗаказПоставщику); 
		НовыйДокумент.Дата = ТекущаяДата();
		ТабЧастьТовары = НовыйДокумент.Товары;
		ТабЧастьТовары.Очистить();      
		
		
		СтруктураПоиска = Новый Структура("ЗаказПоставщику", ЗаказПоставщику);
		МассивНайденных = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого НайденнаяСтрока Из МассивНайденных Цикл
			
			НоваяСтрока = ТабЧастьТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденнаяСтрока);
			НоваяСтрока.Заказ = НайденнаяСтрока.ЗаказПокупателя;
			НоваяСтрока.Количество = -НоваяСтрока.Количество;    
			
			ЗаказПоставщикаТоварыСтрока = ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура,Заказ", НайденнаяСтрока.Номенклатура, НайденнаяСтрока.ЗаказПокупателя));
			НоваяСтрока.Цена = ЗаказПоставщикаТоварыСтрока[0].Цена;
			
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуТабЧасти(НоваяСтрока,НовыйДокумент);  
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, НовыйДокумент);
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, НовыйДокумент);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДокумент);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокумент); 		
			
		КонецЦикла; 
		
		НовыйДокумент.Комментарий = "Корректировка по запросу с портала"; 
		
		Попытка
			
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КорректировкаЗаказаПоставщика = НовыйДокумент.Ссылка;
			
		Исключение  
			
			#Если Клиент Тогда
				Сообщить(ОписаниеОшибки());
			#Иначе
				ЗаписьЖурналаРегистрации("Создание корректировки Заказа поставщику", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			#КонецЕсли
			НебылоОшибокСоздания = Ложь;
			Возврат;
			
		Конецпопытки;		
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура СоздатьКорректировкуЗаказаПоставщика(СтрокаРезультатаЗапроса)	
	
	КорректЗаказаПоставщику = Документы.КорректировкаЗаказаПоставщику.СоздатьДокумент();	
	ЗаказПоставщика = СтрокаРезультатаЗапроса.ЗаказПоставщику;	
	КоличествоКорректировки = СтрокаРезультатаЗапроса.Количество;
	ЗаказПоставщикаТоварыСтрока = ЗаказПоставщика.Товары.НайтиСтроки(Новый Структура("Номенклатура,Заказ", СтрокаРезультатаЗапроса.Номенклатура, СтрокаРезультатаЗапроса.ЗаказПокупателя));
	
	КорректЗаказаПоставщику.Заполнить(ЗаказПоставщика);
	КорректЗаказаПоставщику.Дата = ТекущаяДата();
	
	ТабЧастьТовары = КорректЗаказаПоставщику.Товары;                                      
	ТабЧастьТовары.Очистить();
	
	НоваяСтрока = ТабЧастьТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ЗаказПоставщикаТоварыСтрока[0]); 
	
	НоваяСтрока.Количество = -1 * КоличествоКорректировки;
	ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, КорректЗаказаПоставщику);
	
	НоваяСтрока.Заказ = СтрокаРезультатаЗапроса.ЗаказПокупателя;
	КорректЗаказаПоставщику.Комментарий = "Корректировка по запросу с портала от " + СокрЛП(СтрокаРезультатаЗапроса.ДатаЗапроса) + "";
	
	Попытка
		
		КорректЗаказаПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		КорректировкаЗаказаПоставщика = КорректЗаказаПоставщику.Ссылка;
		
	Исключение
		Возврат;
	Конецпопытки;

КонецПроцедуры

Процедура СоздатьКорректировкуЗаказаПокупателя(СтрокиТовары, ЗаказПокупателяСсылка, Проведение, КоличествоКорректировки, ПромСерияНоменклатуры = Неопределено) 
	
	НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ЗаказПокупателя = ЗаказПокупателяСсылка;
	НовыйДок.Заполнить(ЗаказПокупателяСсылка);
	НовыйДок.Комментарий = "Корректировка по запросу с портала";
	
	ТабЧастьТовары = НовыйДок.Товары;
	ТабЧастьТовары.Очистить();
	
	Для Каждого СтрокаТовары Из СтрокиТовары Цикл 
		
		Если КоличествоКорректировки = 0 Тогда 
			Прервать; 
		КонецЕсли;
		
		НоваяСтрока = ТабЧастьТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		НоваяСтрока.Количество = Мин(КоличествоКорректировки, СтрокаТовары.Количество);
		
		Если КоличествоКорректировки >= СтрокаТовары.Количество Тогда
			КоличествоКорректировки = КоличествоКорректировки - СтрокаТовары.Количество;
		Иначе
			КоличествоКорректировки = 0;
		КонецЕсли;		
		
		НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
		НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПокупателя; 
		
		// Получаем среднюю цену закупки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Цена) КАК СуммаПодсчит,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка 
		|   И ЗаказПокупателяТовары.Номенклатура = &Номенклатура 
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Номенклатура";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателяСсылка);
		Запрос.УстановитьПараметр("Номенклатура", НоваяСтрока.Номенклатура);	
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			ЦенаЗакупкиЗаЕдиницу = Окр(ВыборкаЗапроса.СуммаПодсчит / ВыборкаЗапроса.Количество, 2, 1); 			
		КонецЦикла;	 			
		
		
		НоваяСтрока.Цена = ЦенаЗакупкиЗаЕдиницу;
		
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДок);
		
		НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПокупателя;
		НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
		
		Если НЕ ПромСерияНоменклатуры = Неопределено  Тогда
			НоваяСтрока.СерияНоменклатуры = ПромСерияНоменклатуры;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоваяСтрока.СерияНоменклатуры) Тогда
			НоваяСтрока.Размещение = ЗаказПокупателяСсылка.СкладГруппа;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);		
		КорректировкаЗаказаПокупателя = НовыйДок.Ссылка;
		
	Исключение
		
	КонецПопытки;

КонецПроцедуры   

Процедура СоздатьКорректировкуЗаказаПокупателяПоТаблицеТоваров(ТаблицаТоваров, ЗаказПокупателяСсылка, Проведение) 
	
	НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ЗаказПокупателя = ЗаказПокупателяСсылка;
	НовыйДок.Заполнить(ЗаказПокупателяСсылка);
	НовыйДок.Комментарий = "Корректировка по запросу с портала";
	
	ТабЧастьТовары = НовыйДок.Товары;
	ТабЧастьТовары.Очистить();
	
	Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл 
		
		НоваяСтрока = ТабЧастьТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
		НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
		НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПокупателя; 
		
		// Получаем среднюю цену закупки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Цена) КАК СуммаПодсчит,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест,
		|	ЗаказПокупателяТовары.Коэффициент
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест,
		|	ЗаказПокупателяТовары.Коэффициент";
		
		Запрос.УстановитьПараметр("Ссылка", ЗаказПокупателяСсылка);
		Запрос.УстановитьПараметр("Номенклатура", НоваяСтрока.Номенклатура);	
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		ЕдиницаИзмеренияМест = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		Коэф = 1;
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ЦенаЗакупкиЗаЕдиницу = Окр(ВыборкаЗапроса.СуммаПодсчит / ВыборкаЗапроса.Количество, 2, 1);  
			ЕдиницаИзмерения = ВыборкаЗапроса.ЕдиницаИзмерения;
			ЕдиницаИзмеренияМест = ВыборкаЗапроса.ЕдиницаИзмеренияМест;
			Коэф = ВыборкаЗапроса.Коэффициент;
			
		КонецЦикла;	 			
		
		НоваяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;
		НоваяСтрока.ЕдиницаИзмеренияМест = ЕдиницаИзмеренияМест;
		НоваяСтрока.Коэффициент = Коэф;
		
		НоваяСтрока.Цена = ЦенаЗакупкиЗаЕдиницу;
		
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДок);
		
	КонецЦикла;
	
	Попытка
		
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);		
		КорректировкаЗаказаПокупателя = НовыйДок.Ссылка;
		
	Исключение 
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#Иначе
			ЗаписьЖурналаРегистрации("Создание корректировки Заказа покупателя", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		#КонецЕсли	
		
	КонецПопытки;

КонецПроцедуры

Процедура СоздатьКорректировкуСборки(ПромСборка, ПромЗаказ, ПромТовар, ПромКоличество)
	
	ПромКоличествоКорректировать = ПромКоличество;
	КорректировкаСборкиЗаказов = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
	КорректировкаСборкиЗаказов.СборкаЗаказовПокупателя   =  ПромСборка;
	КорректировкаСборкиЗаказов.Исполнено				 =  Истина;
	КорректировкаСборкиЗаказов.Контрагент				 =  ПромСборка.Контрагент;
	КорректировкаСборкиЗаказов.Грузополучатель 		     =	ПромСборка.Грузополучатель;
	КорректировкаСборкиЗаказов.Организация 			     =	ПромСборка.Организация;	
	//+Гавриленков В. 20.02.2026 #UT10-5711
	//КорректировкаСборкиЗаказов.Ответственный		     =	ПараметрыСеанса.ТекущийПользователь.ФизЛицо;
	КорректировкаСборкиЗаказов.Ответственный		     =	Справочники.ФизическиеЛица.Автосборка;
	//-Гавриленков В. 20.02.2026 #UT10-5711
	КорректировкаСборкиЗаказов.Дата                      =  ТекущаяДата();
	КорректировкаСборкиЗаказов.Комментарий               =  "Корректировка по запросу с портала";
	
	СтрокиПоТоварувСборке = ПромСборка.Заказано.НайтиСтроки(Новый Структура("Заказ,Номенклатура", ПромЗаказ, ПромТовар));
	
	Если НЕ СтрокиПоТоварувСборке.Количество() = 0 Тогда
		
		Для Каждого СтрокаИзСборки ИЗ СтрокиПоТоварувСборке Цикл
			
			Если НЕ ПромКоличествоКорректировать = 0 Тогда 
				
				НоваяСтрокаКорректировки = КорректировкаСборкиЗаказов.Товары.Добавить();
				НоваяСтрокаКорректировки.ЗаказПокупателя = СтрокаИзСборки.Заказ;
				НоваяСтрокаКорректировки.Номенклатура = СтрокаИзСборки.Номенклатура;
				НоваяСтрокаКорректировки.Ячейка = СтрокаИзСборки.Ячейка;
				НоваяСтрокаКорректировки.Склад = СтрокаИзСборки.Заказ.СкладГруппа;
				НоваяСтрокаКорректировки.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
				НоваяСтрокаКорректировки.Количество = Мин(ПромКоличествоКорректировать, СтрокаИзСборки.Количество);
				ПромКоличествоКорректировать = ?(ПромКоличествоКорректировать >= СтрокаИзСборки.Количество, ПромКоличествоКорректировать - СтрокаИзСборки.Количество, 0);
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
	КорректировкаСборкиЗаказов.ПровестиИСоздатьКорректировкиЗаказа();	

КонецПроцедуры

Процедура СоздатьКорректировкуГрузоместа(ПромГрузоместо,ПромЗаказ,ПромТовар,ПромКоличество) 
	
	ПромКоличествоКорректировать = ПромКоличество;
	КорректировкаГрузовогоМеста = Документы.КорректировкаГрузовогоМеста.СоздатьДокумент();
	КорректировкаГрузовогоМеста.ГрузовоеМесто   = ПромГрузоместо;
	КорректировкаГрузовогоМеста.Исполнено		= Ложь;
	КорректировкаГрузовогоМеста.Контрагент		= ПромГрузоместо.Сборка.Контрагент;
	КорректировкаГрузовогоМеста.Грузополучатель = ПромГрузоместо.Сборка.Грузополучатель;
	КорректировкаГрузовогоМеста.Организация 	= ПромГрузоместо.Сборка.Организация;		
	КорректировкаГрузовогоМеста.Дата            = ТекущаяДата();
	КорректировкаГрузовогоМеста.Комментарий     = "Корректировка по запросу с портала";
	
	СтрокиПоТоваруГрузоместе = ПромГрузоместо.Товары.НайтиСтроки(Новый Структура("Заказ,Номенклатура", ПромЗаказ, ПромТовар));
	
	Если НЕ СтрокиПоТоваруГрузоместе.Количество() = 0 Тогда
		
		Для Каждого СтрокаИзГрузоместа ИЗ СтрокиПоТоваруГрузоместе Цикл
			
			Если НЕ ПромКоличествоКорректировать = 0 Тогда 
				
				НоваяСтрокаКорректировки = КорректировкаГрузовогоМеста.Товары.Добавить();
				НоваяСтрокаКорректировки.Заказ = СтрокаИзГрузоместа.Заказ;
				НоваяСтрокаКорректировки.Номенклатура = СтрокаИзГрузоместа.Номенклатура;
				НоваяСтрокаКорректировки.КоличествоВГрузоместе = СтрокаИзГрузоместа.Количество;
				НоваяСтрокаКорректировки.Количество = Мин(ПромКоличествоКорректировать, СтрокаИзГрузоместа.Количество);
				ПромКоличествоКорректировать = ?(ПромКоличествоКорректировать >= СтрокаИзГрузоместа.Количество, ПромКоличествоКорректировать - СтрокаИзГрузоместа.Количество, 0);
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	ПромКоличество = ПромКоличествоКорректировать; 
	КорректировкаГрузовогоМеста.Записать(РежимЗаписиДокумента.Проведение);	

КонецПроцедуры

Функция СоздатьКорректировкиСборок(ПромЗаказ)
	
	ЗапросСборокДляКорректировки = Новый Запрос;
	ЗапросСборокДляКорректировки.УстановитьПараметр("ДокЗаказ", ПромЗаказ);
	ЗапросСборокДляКорректировки.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя,
	|	ЗапросыИзмененияКоличестваВЗаказах.Номенклатура,
	|	ЗапросыИзмененияКоличестваВЗаказах.Количество,
	|	ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки,
	|	ЗапросыИзмененияКоличестваВЗаказах.ДатаЗапроса
	|ПОМЕСТИТЬ ТаблицаИзменение
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|ГДЕ
	|	НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|	И ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = &ДокЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.КСборкеОстаток
	|ПОМЕСТИТЬ ТаблицаРезультат
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			(ЗаказПокупателя, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ТаблицаИзменение.ЗаказПокупателя,
	|					ТаблицаИзменение.Номенклатура
	|				ИЗ
	|					ТаблицаИзменение КАК ТаблицаИзменение)) КАК ТоварыВСборкеОстатки
	|ГДЕ
	|	ТоварыВСборкеОстатки.СобраноОстаток = 0
	|	И НЕ ТоварыВСборкеОстатки.КСборкеОстаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультат.ЗаказПокупателя,
	|	ТаблицаРезультат.Номенклатура,
	|	ТаблицаРезультат.Сборка,
	|	ТаблицаРезультат.КСборкеОстаток,
	|	ТаблицаИзменение.Количество,
	|	ТаблицаИзменение.КлючСтроки,
	|	ТаблицаИзменение.ДатаЗапроса,
	|	НапечатанныеДокументы.ДатаПечати КАК Распечатан
	|ИЗ
	|	ТаблицаИзменение КАК ТаблицаИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРезультат КАК ТаблицаРезультат
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НапечатанныеДокументы КАК НапечатанныеДокументы
	|			ПО ТаблицаРезультат.Сборка = НапечатанныеДокументы.Документ
	|		ПО ТаблицаИзменение.ЗаказПокупателя = ТаблицаРезультат.ЗаказПокупателя
	|			И ТаблицаИзменение.Номенклатура = ТаблицаРезультат.Номенклатура
	|ГДЕ
	|	НапечатанныеДокументы.ДатаПечати ЕСТЬ NULL
	|	И НЕ ТаблицаРезультат.ЗаказПокупателя ЕСТЬ NULL";
	
	РезультатСборокДляКорректировки = ЗапросСборокДляКорректировки.Выполнить();
	
	Если РезультатСборокДляКорректировки.Пустой() Тогда
		Возврат Ложь;
	Иначе
		
		ВыборкаСборокДляКорректировки = РезультатСборокДляКорректировки.Выбрать(); 
		КорректировкаСборкиЗаказов = Документы.КорректировкаСборкиЗаказовПокупателя.ПустаяСсылка();
		
		Пока ВыборкаСборокДляКорректировки.СледующийПоЗначениюПоля("Номенклатура") Цикл
			
			НебылоОшибокСоздания = Истина; 				
			
			Попытка
				
				НачатьТранзакцию();
				СоздатьКорректировкуСборки(ВыборкаСборокДляКорректировки.Сборка, ВыборкаСборокДляКорректировки.ЗаказПокупателя, 
				              ВыборкаСборокДляКорректировки.Номенклатура, ВыборкаСборокДляКорректировки.Количество);
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				НебылоОшибокСоздания = Ложь;
				#Если Клиент Тогда
					Сообщить(ОписаниеОшибки());
				#КонецЕсли 
				
			КонецПопытки;
			
		КонецЦикла;  
		
		Если Не КорректировкаСборкиЗаказов.Ссылка.Пустая() Тогда
			
			ВыборкаСборокДляКорректировки.Сбросить();			
			
			Пока ВыборкаСборокДляКорректировки.Следующий() Цикл
				
				РегЗапросИзменений = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.СоздатьМенеджерЗаписи();
				РегЗапросИзменений.ЗаказПокупателя = ВыборкаСборокДляКорректировки.ЗаказПокупателя;
				РегЗапросИзменений.Номенклатура    = ВыборкаСборокДляКорректировки.Номенклатура;
				РегЗапросИзменений.КлючСтроки      = ВыборкаСборокДляКорректировки.КлючСтроки;
				РегЗапросИзменений.ДатаЗапроса     = ВыборкаСборокДляКорректировки.ДатаЗапроса; 
				РегЗапросИзменений.Прочитать(); 
				
				Если РегЗапросИзменений.Обработано Тогда
					Продолжить;
				КонецЕсли;
				
				РегЗапросИзменений.Обработано = Истина;
				РегЗапросИзменений.ДокументКорректировки = КорректировкаСборкиЗаказов.Ссылка;
				РегЗапросИзменений.Записать(Истина);
				
			КонецЦикла;
			
		КонецЕсли;		
		
		Возврат НебылоОшибокСоздания;
		
	КонецЕсли;	

КонецФункции

Функция СоздатьКорректировкиГрузомест(ПромЗаказ)
	
	ЗапросГрузоместДляКорректировок = Новый Запрос;
	ЗапросГрузоместДляКорректировок.УстановитьПараметр("ДокЗаказ", ПромЗаказ); 
	ЗапросГрузоместДляКорректировок.УстановитьПараметр("Д1", ТекущаяДата() - 86400*14);
	ЗапросГрузоместДляКорректировок.УстановитьПараметр("Д2", ТекущаяДата());
	ЗапросГрузоместДляКорректировок.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя,
	|	ЗапросыИзмененияКоличестваВЗаказах.Номенклатура,
	|	ЗапросыИзмененияКоличестваВЗаказах.Количество,
	|	ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки,
	|	ЗапросыИзмененияКоличестваВЗаказах.ДатаЗапроса
	|ПОМЕСТИТЬ ТаблицаИзменение
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|ГДЕ
	|	НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|	И ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = &ДокЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоЗаданиям.ЗаданиеНаСборку КАК ЗаданиеНаСборку,
	|	СУММА(ОстаткиПоЗаданиям.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ УжеВезем
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаданиеНаДоставкуОбороты.ЗаданиеНаСборку КАК ЗаданиеНаСборку,
	|		СУММА(ЗаданиеНаДоставкуОбороты.КоличествоОборот) КАК КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.ЗаданиеНаДоставку.Обороты(
	|				&Д1,
	|				&Д2,
	|				Регистратор,
	|				ЗаданиеНаСборку.Заказано.Заказ В
	|					(ВЫБРАТЬ
	|						ТаблицаИзменение.ЗаказПокупателя
	|					ИЗ
	|						ТаблицаИзменение)) КАК ЗаданиеНаДоставкуОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаданиеНаДоставкуОбороты.ЗаданиеНаСборку) КАК ОстаткиПоЗаданиям
	|ГДЕ
	|	НЕ ОстаткиПоЗаданиям.КоличествоОборот = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоЗаданиям.ЗаданиеНаСборку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.СобраноОстаток
	|ПОМЕСТИТЬ ТаблицаРезультат
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			(ЗаказПокупателя, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ТаблицаИзменение.ЗаказПокупателя,
	|					ТаблицаИзменение.Номенклатура
	|				ИЗ
	|					ТаблицаИзменение КАК ТаблицаИзменение)) КАК ТоварыВСборкеОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ УжеВезем КАК УжеВезем
	|		ПО ТоварыВСборкеОстатки.Сборка = УжеВезем.ЗаданиеНаСборку
	|ГДЕ
	|	ТоварыВСборкеОстатки.Сборка.ДокументСобранИУпакован
	|	И УжеВезем.ЗаданиеНаСборку ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультат.ЗаказПокупателя,
	|	ТаблицаРезультат.Номенклатура КАК Номенклатура,
	|	ТаблицаРезультат.Сборка,
	|	ТаблицаИзменение.Количество,
	|	ТаблицаИзменение.КлючСтроки,
	|	ТаблицаИзменение.ДатаЗапроса КАК ДатаЗапроса,
	|	ГрузовоеМестоТовары.Ссылка КАК ГрузовоеМесто,
	|	ГрузовоеМестоТовары.Количество КАК КоличествоВГрузовомМесте
	|ИЗ
	|	ТаблицаИзменение КАК ТаблицаИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРезультат КАК ТаблицаРезультат
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	|			ПО ТаблицаРезультат.ЗаказПокупателя = ГрузовоеМестоТовары.Заказ
	|				И ТаблицаРезультат.Номенклатура = ГрузовоеМестоТовары.Номенклатура
	|		ПО ТаблицаИзменение.ЗаказПокупателя = ТаблицаРезультат.ЗаказПокупателя
	|			И ТаблицаИзменение.Номенклатура = ТаблицаРезультат.Номенклатура
	|ГДЕ
	|	НЕ ТаблицаРезультат.ЗаказПокупателя ЕСТЬ NULL
	|	И ГрузовоеМестоТовары.Ссылка.Проведен
	|	И НЕ ГрузовоеМестоТовары.Ссылка.Погружено
	|	И НЕ ГрузовоеМестоТовары.Ссылка.Неактуально_КорректировкаСборки
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ГрузовоеМесто"; 
	
	РезультатГрузоместДляКорректировки = ЗапросГрузоместДляКорректировок.Выполнить();
	
	Если РезультатГрузоместДляКорректировки.Пустой() Тогда
		Возврат Ложь;
	Иначе
		
		ВыборкаГрузоместДляКорректировки = РезультатГрузоместДляКорректировки.Выбрать(); 
		КорректировкаГрузовогоМеста = Документы.КорректировкаГрузовогоМеста.ПустаяСсылка();
		
		Пока ВыборкаГрузоместДляКорректировки.СледующийПоЗначениюПоля("Номенклатура") Цикл 
			
			ПромКоличество = ВыборкаГрузоместДляКорректировки.Количество;
			
			Пока ВыборкаГрузоместДляКорректировки.СледующийПоЗначениюПоля("ГрузовоеМесто") Цикл  
				
				НебылоОшибокСоздания = Истина;
				
				Если НЕ ПромКоличество = 0 Тогда
					
					Попытка
						
						НачатьТранзакцию();
						СоздатьКорректировкуГрузоместа(ВыборкаГрузоместДляКорректировки.ГрузовоеМесто, ВыборкаГрузоместДляКорректировки.ЗаказПокупателя, 
						                               ВыборкаГрузоместДляКорректировки.Номенклатура,ПромКоличество);
						ЗафиксироватьТранзакцию();
						
					Исключение
						
						ОтменитьТранзакцию();
						НебылоОшибокСоздания = Ложь;
						#Если Клиент Тогда
							Сообщить(ОписаниеОшибки());
						#КонецЕсли 
						
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если Не КорректировкаГрузовогоМеста.Ссылка.Пустая() Тогда
				
				РегЗапросИзменений = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.СоздатьМенеджерЗаписи();
				РегЗапросИзменений.ЗаказПокупателя = ВыборкаГрузоместДляКорректировки.ЗаказПокупателя;
				РегЗапросИзменений.Номенклатура    = ВыборкаГрузоместДляКорректировки.Номенклатура;
				РегЗапросИзменений.КлючСтроки      = ВыборкаГрузоместДляКорректировки.КлючСтроки;
				РегЗапросИзменений.ДатаЗапроса     = ВыборкаГрузоместДляКорректировки.ДатаЗапроса; 
				РегЗапросИзменений.Прочитать(); 
				
				Если РегЗапросИзменений.Обработано Тогда
					Продолжить;
				КонецЕсли;
				
				РегЗапросИзменений.Обработано = Истина;
				РегЗапросИзменений.ДокументКорректировки = КорректировкаГрузовогоМеста.Ссылка;
				РегЗапросИзменений.Записать(Истина);
				
			КонецЕсли;	
			
		КонецЦикла;		
		
		Возврат НебылоОшибокСоздания;
		
	КонецЕсли;

КонецФункции 

Процедура ЗакрытьЗапросПоНевозможностиВыполнения(ПромЗаказ)
	
	ЗапросНаЗакрытие = Новый Запрос;
	ЗапросНаЗакрытие.УстановитьПараметр("ДокЗаказ", ПромЗаказ); 
	ЗапросНаЗакрытие.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя,
	|	ЗапросыИзмененияКоличестваВЗаказах.Номенклатура,
	|	ЗапросыИзмененияКоличестваВЗаказах.Количество,
	|	ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки,
	|	ЗапросыИзмененияКоличестваВЗаказах.ДатаЗапроса
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|ГДЕ
	|	НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|	И ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = &ДокЗаказ"; 
	
	РезультатЗапросаНаЗакрытие = ЗапросНаЗакрытие.Выполнить();
	
	Если НЕ РезультатЗапросаНаЗакрытие.Пустой() Тогда
		
		ВыборкаЗапросаНаЗакрытие = РезультатЗапросаНаЗакрытие.Выбрать();
		
		Пока ВыборкаЗапросаНаЗакрытие.Следующий() Цикл
			
			РегЗапросИзменений = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.СоздатьМенеджерЗаписи();
			РегЗапросИзменений.ЗаказПокупателя = ВыборкаЗапросаНаЗакрытие.ЗаказПокупателя;
			РегЗапросИзменений.Номенклатура    = ВыборкаЗапросаНаЗакрытие.Номенклатура;
			РегЗапросИзменений.КлючСтроки      = ВыборкаЗапросаНаЗакрытие.КлючСтроки;
			РегЗапросИзменений.ДатаЗапроса     = ВыборкаЗапросаНаЗакрытие.ДатаЗапроса; 
			РегЗапросИзменений.Прочитать(); 
			
			Если РегЗапросИзменений.Обработано Тогда
				Продолжить;
			КонецЕсли;
			
			РегЗапросИзменений.Обработано = Истина;
			РегЗапросИзменений.Записать(Истина); 		
			
		КонецЦикла;		
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьРегистрВМодуле() Экспорт 
	
	ЗапросДанныхРегистра = Новый Запрос;
	ЗапросДанныхРегистра.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя КАК Заказ
	|ПОМЕСТИТЬ ЗаказыКОбработке
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|ГДЕ
	|	НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК ОстатокЗаказано,
	|	0 КАК ОстатокРазмещено,
	|	0 КАК ОстатокВРезерве
	|ПОМЕСТИТЬ ОстаткиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				И ЗаказПокупателя В
	|					(ВЫБРАТЬ
	|						ЗаказыКОбработке.Заказ
	|					ИЗ
	|						ЗаказыКОбработке)) КАК ЗаказыПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	0,
	|	ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0),
	|	0
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				И ЗаказПокупателя В
	|					(ВЫБРАТЬ
	|						ЗаказыКОбработке.Заказ
	|					ИЗ
	|						ЗаказыКОбработке)) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	0,
	|	0,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			,
	|			ДокументРезерва.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала
	|				И ДокументРезерва В
	|					(ВЫБРАТЬ
	|						ЗаказыКОбработке.Заказ
	|					ИЗ
	|						ЗаказыКОбработке)) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоЗаказу.ЗаказПокупателя,
	|	СУММА(ОстаткиПоЗаказу.ОстатокЗаказано) КАК ОстатокЗаказано,
	|	СУММА(ОстаткиПоЗаказу.ОстатокРазмещено) КАК ОстатокРазмещено,
	|	СУММА(ОстаткиПоЗаказу.ОстатокВРезерве) КАК ОстатокВРезерве
	|ПОМЕСТИТЬ ИтогоОстатки
	|ИЗ
	|	ОстаткиПоЗаказу КАК ОстаткиПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоЗаказу.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогоОстатки.ЗаказПокупателя,
	|	ИтогоОстатки.ОстатокЗаказано,
	|	ИтогоОстатки.ОстатокРазмещено,
	|	ИтогоОстатки.ОстатокВРезерве
	|ПОМЕСТИТЬ ОбособленныесЗаказамиПоставщику
	|ИЗ
	|	ИтогоОстатки КАК ИтогоОстатки
	|ГДЕ
	|	ИтогоОстатки.ОстатокЗаказано > 0
	|	И (ИтогоОстатки.ОстатокРазмещено > 0
	|			ИЛИ ИтогоОстатки.ОстатокВРезерве > 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКОбработке.Заказ,
	|	НЕ ОбособленныесЗаказамиПоставщику.ЗаказПокупателя ЕСТЬ NULL КАК ЕстьЗаказПоставщикуПоОбособленнойОтгрузке,
	|	ЕСТЬNULL(ОбособленныесЗаказамиПоставщику.ОстатокЗаказано, 0) КАК Заказано,
	|	ЕСТЬNULL(ОбособленныесЗаказамиПоставщику.ОстатокРазмещено, 0) КАК Размещено,
	|	ЕСТЬNULL(ОбособленныесЗаказамиПоставщику.ОстатокВРезерве, 0) КАК ВРезерве
	|ИЗ
	|	ЗаказыКОбработке КАК ЗаказыКОбработке
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОбособленныесЗаказамиПоставщику КАК ОбособленныесЗаказамиПоставщику
	|		ПО ЗаказыКОбработке.Заказ = ОбособленныесЗаказамиПоставщику.ЗаказПокупателя";

	РезультатЗапросаДанныхРегистра = ЗапросДанныхРегистра.Выполнить();
	
	Если НЕ РезультатЗапросаДанныхРегистра.Пустой() Тогда
		
		ВыборкаДанныхРегистра = РезультатЗапросаДанныхРегистра.Выбрать();
		
		Пока ВыборкаДанныхРегистра.Следующий() Цикл

			Если Не ВыборкаДанныхРегистра.ЕстьЗаказПоставщикуПоОбособленнойОтгрузке Тогда 
				
				//+Гавриленков В. 22.05.2026 #UT10-5874 Добавлен вывод остатков в Журнал регистрации
				//+Марков И. 22.04.2026 #UT10-5829
				ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Информация, , ,
				"Запуск создания корректировки заказов покупателя и поставщику по " + Строка(ВыборкаДанныхРегистра.Заказ) + ". Заказано: " + Строка(ВыборкаДанныхРегистра.Заказано) + ", Размещено: " + Строка(ВыборкаДанныхРегистра.Размещено) + ", В резерве: " + Строка(ВыборкаДанныхРегистра.ВРезерве));
				//-Марков И. 22.04.2026 #UT10-5829
				
				Если СоздатьКорректировкиЗаказовПокупателяИПоставщику(ВыборкаДанныхРегистра.Заказ) Тогда 				 
					//Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ВыборкаДанныхРегистра.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда 
				
				//+Марков И. 22.04.2026 #UT10-5829
				ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Информация, , ,
				"Запуск создания корректировки сборок по " + Строка(ВыборкаДанныхРегистра.Заказ));
				//-Марков И. 22.04.2026 #UT10-5829
				
				Если СоздатьКорректировкиСборок(ВыборкаДанныхРегистра.Заказ) Тогда 				 
					//Продолжить;
				КонецЕсли;
				
			КонецЕсли;
			
			//+Марков И. 22.04.2026 #UT10-5829
			ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах", УровеньЖурналаРегистрации.Информация, , ,
			"Запуск создания корректировки грузомест по " + Строка(ВыборкаДанныхРегистра.Заказ));
			//-Марков И. 22.04.2026 #UT10-5829
			
			Если СоздатьКорректировкиГрузомест(ВыборкаДанныхРегистра.Заказ) Тогда 				 
				//Продолжить;
			КонецЕсли;	

		КонецЦикла;		  
		
	КонецЕсли;		 

КонецПроцедуры