   
///////////////////Процедуры шаблонов сервисов///////////////////
Функция СоответствиеПолейЗаказа() Экспорт
	                                                          
	СоответсвиеШапки = Новый Соответствие;  //по справочнику НеСозданныеЗаказыПокупателей 
	//Header/OrderHeader
	СоответсвиеШапки.Вставить("OrderID", 		"ИдентификаторЗаказа");//IDЗаказаПортал 
	СоответсвиеШапки.Вставить("Comment", 		"Комментарий"); 
	СоответсвиеШапки.Вставить("KlientID", 		"ИдентификаторКонтрагента"); //УИНКонтрагента
	СоответсвиеШапки.Вставить("FilialID", 		"ИдентификаторФилиала");//УИНФилиала 
	СоответсвиеШапки.Вставить("ValutaID", 		"ИдентификаторВалюта"); //УИНВалюта
	СоответсвиеШапки.Вставить("DogovorID", 		"ИдентификаторДоговора"); //УИНДоговора
	СоответсвиеШапки.Вставить("TipDost", 		"ТипДоставки"); 
	СоответсвиеШапки.Вставить("Name", 			"НаименованиеЗаказаПортала"); 
	СоответсвиеШапки.Вставить("Mail", 			"Почта"); 
	СоответсвиеШапки.Вставить("Addres", 		"ЮрАдрес"); 
	СоответсвиеШапки.Вставить("AddresFakt", 	"ФактАдрес"); 
	СоответсвиеШапки.Вставить("AddresFaktId", 	"ИдентификаторФактАдрес");// УИНФактАдрес
	СоответсвиеШапки.Вставить("INN", 			"ИНН"); 
	СоответсвиеШапки.Вставить("KPP", 			"КПП"); 
	СоответсвиеШапки.Вставить("FirmID", 		"ИдентификаторОрганизация");//УИНОрганизация 
	СоответсвиеШапки.Вставить("SkladID", 		"ИдентификаторСклад"); // ИдСклад
	СоответсвиеШапки.Вставить("PaymentType", 	"ТипОплаты");  	
	СоответсвиеШапки.Вставить("Dostavka", 		"ДатаДоставки");  	
	СоответсвиеШапки.Вставить("OrderSource", 	"КодИсточника");  	//ПромКодИсточника
	
	//OrderLine 
	СоответсвиеСтрок = Новый Соответствие; 
	СоответсвиеСтрок.Вставить("NumberInv", 		"Артикул");			//Номенклатура.Артикул
	СоответсвиеСтрок.Вставить("Brand", 			"Родитель");		// Родитель Номенклатуры
	СоответсвиеСтрок.Вставить("Articul", 		"КодПроизводителя");//Номенклатура.КодПроизводителя
	СоответсвиеСтрок.Вставить("Name", 			"Наименование");
	СоответсвиеСтрок.Вставить("Count", 			"Количество");
	СоответсвиеСтрок.Вставить("Price", 			"ЦенаКлиента");
	СоответсвиеСтрок.Вставить("Price_Zak", 		"ЦенаЗакупки");
	СоответсвиеСтрок.Вставить("PROIZV_SUPPLIER","ПроизводительПоставщика");
	СоответсвиеСтрок.Вставить("Comment", 		"Комментарий"); 
	
	//OutLine
	СоответсвиеВозврата = Новый Соответствие; 
	СоответсвиеВозврата.Вставить("OrderNumber", 	"НомерЗаказа");//Номер заказа
	СоответсвиеВозврата.Вставить("Status", 			"Статус");	// 0 - Создан заказ из письма, по признаку (в параметрах EMailЗаказ = Истина);
														  	// 1 - В справочнике "несозданные заказы" создана запись(в параметрах EMailЗаказ = Истина);
														  	// 2 - ;
														  	// 3 - Ошибка при создании заказа;ошибка создания корректировки заказа
															// Принадлежность базы по константе ?(Константы.База.Получить() = Перечисления.НазваниеБазы.Казань, 1, 3)
															
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеШапки", 		СоответсвиеШапки);
	СтруктураСоответсвий.Вставить("СоответсвиеСтрок", 		СоответсвиеСтрок);
	СтруктураСоответсвий.Вставить("СоответсвиеВозврата", 	СоответсвиеВозврата);
															
	Возврат СтруктураСоответсвий;
	
КонецФункции	

Функция СоответствиеПолейСервис_PM_6951_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	
	СоответсвиеВходныхПараметров.Вставить("KONTRAGENT_", 	"ИдентификаторКонтрагента"); 
	СоответсвиеВходныхПараметров.Вставить("BEGIN_DATE_", 	"ДатаНачала"); 
	СоответсвиеВходныхПараметров.Вставить("END_DATE_", 		"ДатаОкончания"); 
	СоответсвиеВходныхПараметров.Вставить("DSTATE_", 		"СтатусЗаказа"); 
	СоответсвиеВходныхПараметров.Вставить("FILIALS", 		"СписокФилиалов"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("DID", 			"ИдентификаторДокумента");
	СоответсвиеВыходныхПарамтров.Вставить("DCODE", 			"НомерЗаказа");
	СоответсвиеВыходныхПарамтров.Вставить("DDATE1", 		"ДатаОформленияЗаказа");
	СоответсвиеВыходныхПарамтров.Вставить("FILIAL_NAME", 	"НаименованиеФилиала");
	СоответсвиеВыходныхПарамтров.Вставить("DNOTE", 			"Комментарий");
	СоответсвиеВыходныхПарамтров.Вставить("VALUTA_NAME", 	"НаименованиеВалюта");
	СоответсвиеВыходныхПарамтров.Вставить("DOGOVOR_NAME", 	"НаименованиеДоговора");
	СоответсвиеВыходныхПарамтров.Вставить("SKLAD_NAME", 	"НаименованиеСклада");
	СоответсвиеВыходныхПарамтров.Вставить("OUR_FIRM", 		"НаименованиеОрганизации");
	СоответсвиеВыходныхПарамтров.Вставить("STATUS", 		"Статус");
	СоответсвиеВыходныхПарамтров.Вставить("REZERV_SUM", 	"СуммаДокумента");
	СоответсвиеВыходныхПарамтров.Вставить("DATE_TIMESTAMP", "ДатаЗаказа");
	СоответсвиеВыходныхПарамтров.Вставить("FLAG_1", 		"ДействияСЗаказом");  
		
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);
															
	Возврат СтруктураСоответсвий;	

КонецФункции

Функция СоответствиеПолейСервис_PM_6951_FOR_PORTAL_EX() Экспорт
			                                                          
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("ARTICUL", 		"Артикул"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	
	СоответсвиеВыходныхПарамтров.Вставить("STATUS", 		"Статус"); 
	СоответсвиеВыходныхПарамтров.Вставить("BREND", 			"Бренд");    
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_NAME", 	"НаименованиеНоменклатура");  
	СоответсвиеВыходныхПарамтров.Вставить("ARTICUL_OUT", 	"КодПроизводителя");   
	СоответсвиеВыходныхПарамтров.Вставить("KOEF", 			"КоэффициентНомеклатуры"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_PRIMECH", 	"КомментарийНоменклатуры");    
	СоответсвиеВыходныхПарамтров.Вставить("INV_NUM", 		"НомерНоменклатуры");	
	СоответсвиеВыходныхПарамтров.Вставить("KOL_VO", 		"Количество");    
	СоответсвиеВыходныхПарамтров.Вставить("ED_IZM", 		"НаименованиеЕдиницаХранения");
	СоответсвиеВыходныхПарамтров.Вставить("PRICE", 			"ЦенаСНДС");	
	СоответсвиеВыходныхПарамтров.Вставить("VAT_RATE", 		"СтавкаНДС");
	СоответсвиеВыходныхПарамтров.Вставить("SUMMA", 			"СуммаСНДС");
	СоответсвиеВыходныхПарамтров.Вставить("FLAG_1", 		"ДействияСЗаказом"); 
	
	МассивВыходныхПараметров = Новый Массив;
	МассивВыходныхПараметров.Добавить("ИдентификаторСклад");
	МассивВыходныхПараметров.Добавить("НомерЗаказаУчетнойСистемы");
	МассивВыходныхПараметров.Добавить("ПлановаяДатаОтгрузки");
	МассивВыходныхПараметров.Добавить("ИдентификаторДокумента");
	МассивВыходныхПараметров.Добавить("Статус");
	МассивВыходныхПараметров.Добавить("Бренд");
	МассивВыходныхПараметров.Добавить("НаименованиеНоменклатура");
	МассивВыходныхПараметров.Добавить("КодПроизводителя");
	МассивВыходныхПараметров.Добавить("КоэффициентНомеклатуры");
	МассивВыходныхПараметров.Добавить("КомментарийНоменклатуры");
	МассивВыходныхПараметров.Добавить("НомерНоменклатуры"); 
	//+Белов А. 01.12.2025 #UT10-5450
	МассивВыходныхПараметров.Добавить("КодМДМНоменклатуры");  
	//-Белов А. 01.12.2025 #UT10-5450
	МассивВыходныхПараметров.Добавить("Количество");
	МассивВыходныхПараметров.Добавить("НаименованиеЕдиницаХранения");
	МассивВыходныхПараметров.Добавить("ЦенаСНДС");
	МассивВыходныхПараметров.Добавить("СтавкаНДС");
	МассивВыходныхПараметров.Добавить("СуммаСНДС");
	МассивВыходныхПараметров.Добавить("НевозвратныйТовар");
	
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);
	СтруктураСоответсвий.Вставить("МассивВыходныхПараметров", МассивВыходныхПараметров);
															
	Возврат СтруктураСоответсвий;	

КонецФункции

Функция СоответствиеПолейСервис_PM_GET_BALANCE_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("ID", "ИдентификаторКонтрагента"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("Summa_RUB",	"СуммаРУБ");
	СоответсвиеВыходныхПарамтров.Вставить("Summa_EUR",	"СуммаEUR");
		
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции  

Функция СоответствиеПолейСервис_RA_MOVE_DOC_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("IDDOC", 					"ИдентификаторДокумента"); 
	СоответсвиеВходныхПараметров.Вставить("DATETIME_DOSTAVKA", 		"ДатаДоставки");//неиспользуется 
	СоответсвиеВходныхПараметров.Вставить("DOSTAVKA_DNEY", 			"Днейдоставки");//неиспользуется     
	СоответсвиеВходныхПараметров.Вставить("DATETIME_PODBORA", 		"ДатаПодбора");//неиспользуется 
	СоответсвиеВходныхПараметров.Вставить("PRIMECH_PO_DOSTAVKE", 	"КомментарийДоставки");//неиспользуется 
	СоответсвиеВходныхПараметров.Вставить("IDUPAKOVKA_TYPE", 		"ИдентификаторТипаУпаковки");//неиспользуется 
	СоответсвиеВходныхПараметров.Вставить("IDSOTR_CLIENTA", 		"ИдентификаторКлиента");//неиспользуется 
	СоответсвиеВходныхПараметров.Вставить("IDMARSHRUT", 			"ИдентификаторМаршрута");//неиспользуется 	
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("RN_ID",		"ИдентификаторДокумента");
	СоответсвиеВыходныхПарамтров.Вставить("RN_DCODE",	"НомерДокумента");                 
			
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции

Функция СоответствиеПолейСервис_AZ_A_DOC_6951_DEL_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("DID", 		"ИдентификаторДокумента"); 
	СоответсвиеВходныхПараметров.Вставить("ID_SOTR", 	"ИдентификаторСотрудника");//неиспользуется, требуется для формирования СОАП сообщения 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
			
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции     

Функция СоответствиеПолейСервис_PM_6051_DOC_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("DID", 		"ИдентификаторДокумента"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("IDDOC", 				"ИдентификаторДокумента"); 
	СоответсвиеВыходныхПарамтров.Вставить("DCODE", 				"НомерДокумента"); 
	СоответсвиеВыходныхПарамтров.Вставить("IDKLIENT", 			"ИдентификаторКлиента"); 
	СоответсвиеВыходныхПарамтров.Вставить("KLIENT", 			"НаименованиеГоловногоКлиента"); 
	СоответсвиеВыходныхПарамтров.Вставить("DDATE1", 			"ДатаДокумента"); 
	СоответсвиеВыходныхПарамтров.Вставить("FILIAL", 			"НаименованиеФилиала"); 
	СоответсвиеВыходныхПарамтров.Вставить("VALUTA", 			"НаименованиеВалюта"); 
	СоответсвиеВыходныхПарамтров.Вставить("DSTATE", 			"СтатусОтгрузки");
	СоответсвиеВыходныхПарамтров.Вставить("DNUM1", 				"СуммаДокумента"); 
	СоответсвиеВыходныхПарамтров.Вставить("PLAN_DATE_DOSTAVKA",	"ДатаДоставки"); // по умолчанию = ДатаДокумента
	СоответсвиеВыходныхПарамтров.Вставить("VODITEL_NAME", 		"ФИОВодителя"); 
	СоответсвиеВыходныхПарамтров.Вставить("MOBILE_VODITEL", 	"КонтактыВодителя"); 
	СоответсвиеВыходныхПарамтров.Вставить("SF", 				"ИдентификаторСчетфактуры");//Неиспользуется 
	СоответсвиеВыходныхПарамтров.Вставить("FLAGS", 				"Флаг"); 

	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции     

Функция СоответствиеПолейСервис_RA_R_RN_LIN() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("IDDOC", 		"ИдентификаторДокумента"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("EID", 					"НомерСтроки"); 
	СоответсвиеВыходныхПарамтров.Вставить("EID2", 					"КодТовара"); 
	СоответсвиеВыходныхПарамтров.Вставить("PROIZV", 				"НаименованиеПроизводителя"); 
	СоответсвиеВыходныхПарамтров.Вставить("ARTICLE", 				"КодПроизводителя"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_NAME", 			"НаименованиеТовара"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_KOL_V_ED_IZM", 	"КоличествоПоЕдинициИзмерения"); 
	СоответсвиеВыходныхПарамтров.Вставить("KOEF_EDIZM", 			"Коэффициент"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_KOL", 				"Количество");
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_EDIZM", 			"НаименованиеЕдинициИзмерения"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_PRICE",			"Цена"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_SUMMA", 			"Сумма"); 
	СоответсвиеВыходныхПарамтров.Вставить("TOVAR_PRIMECH", 			"Комментарий");  //неиспользуется

	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции 

Функция СоответствиеПолейСервис_RA_INS_UPDATE_STROKA_IZ_PORTALA() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("IDDOC", 			"ИдентификаторДокумента"); 
	СоответсвиеВходныхПараметров.Вставить("IDTOVAR", 		"ИдентификаторНоменклатуры"); 
	СоответсвиеВходныхПараметров.Вставить("INV", 			"Артикул"); //неисползуется
	СоответсвиеВходныхПараметров.Вставить("KOL", 			"Количество"); 
	СоответсвиеВходныхПараметров.Вставить("PRIMECH", 		"Комментарий"); 
	СоответсвиеВходныхПараметров.Вставить("IS_LASTSTROKA", 	"ПоследняяСтрока"); //неиспользуется
	СоответсвиеВходныхПараметров.Вставить("IDLIN", 			"НомерСтроки"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("NEWIDLIN", 		"НомерСтроки"); //неиспользуется
	СоответсвиеВыходныхПарамтров.Вставить("REZERV", 		"Резерв");  //неиспользуется

	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции 

Функция СоответствиеПолейСервис_PM_CALCULATION_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("KONTRAGENT_ID", 			"ИдентификаторКонтрагента"); 
	//СоответсвиеВходныхПараметров.Вставить("SOTR_ID", 				"ИдентификаторСотрудника");   //неиспользуется
	//СоответсвиеВходныхПараметров.Вставить("USER_ID", 				"ИдентификаторПользователя"); //неиспользуется
	СоответсвиеВходныхПараметров.Вставить("BDATE", 					"ДатаНачала"); 
	СоответсвиеВходныхПараметров.Вставить("EDATE", 					"ДатаОкончания"); 
	СоответсвиеВходныхПараметров.Вставить("IS_SORT_BY_DOC_DATE", 	"ВариантСортировки"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	//СоответсвиеВыходныхПарамтров.Вставить("DID", 			"ИдентификаторДокумента"); //Всегда 0??
	СоответсвиеВыходныхПарамтров.Вставить("KONTRAGENT", 	"НаименованиеКонтрагента");  
	СоответсвиеВыходныхПарамтров.Вставить("DDATE1", 		"ДатаДокумента");  
	СоответсвиеВыходныхПарамтров.Вставить("DOC_TYPE", 		"ТипДокумента");  
	СоответсвиеВыходныхПарамтров.Вставить("DCODE", 			"НомерДокумента");  
	СоответсвиеВыходныхПарамтров.Вставить("DOC_STATE", 		"СтатусДокумента");  
	СоответсвиеВыходныхПарамтров.Вставить("FORMA_OPLATY", 	"ФормаОплаты");  
	СоответсвиеВыходныхПарамтров.Вставить("VALUTA", 		"НаименованиеВалюта");  
	СоответсвиеВыходныхПарамтров.Вставить("SUMMA_DOC", 		"СуммаДокумента");
	СоответсвиеВыходныхПарамтров.Вставить("DOLG", 			"Долг"); 
	//СоответсвиеВыходныхПарамтров.Вставить("PRIVAZ", 		"Привоз");//Неиспользуется Всегда пустое значение 
	СоответсвиеВыходныхПарамтров.Вставить("FILIAL", 		"НаименованиеФилиала");  
	//СоответсвиеВыходныхПарамтров.Вставить("RASHOD_EURO", 	"Расход_EURO");//неиспользуется  
	//СоответсвиеВыходныхПарамтров.Вставить("PRIHOD_EURO", 	"Приход_EURO"); //неиспользуется 
	//СоответсвиеВыходныхПарамтров.Вставить("SALDO_EUR", 		"Сальдо_EURO"); //неиспользуется 
	СоответсвиеВыходныхПарамтров.Вставить("RASHOD_RUB_NAL", "Расход_РУБ_Нал");  
	СоответсвиеВыходныхПарамтров.Вставить("PRIHOD_RUB_NAL", "Приход_РУБ_Нал");  
	СоответсвиеВыходныхПарамтров.Вставить("SALDO_RUB_NAL", 	"Сальдо_РУБ_Нал");  
	СоответсвиеВыходныхПарамтров.Вставить("SF", 			"НомерСчетФактура");
	СоответсвиеВыходныхПарамтров.Вставить("RASHOD_RUB", 	"Расход_РУБ");  
	СоответсвиеВыходныхПарамтров.Вставить("PRIHOD_RUB", 	"Приход_РУБ");  
	СоответсвиеВыходныхПарамтров.Вставить("SALDO_RUB", 		"Сальдо_РУБ");  
	СоответсвиеВыходныхПарамтров.Вставить("I", 				"ИдентификаторСтроки"); 
	СоответсвиеВыходныхПарамтров.Вставить("DDATE2", 		"ПлановаяДатаРасчета");  
	СоответсвиеВыходныхПарамтров.Вставить("IS_DEBIT", 		"ДебиторкаКредиторка");  
	СоответсвиеВыходныхПарамтров.Вставить("IS_NAL", 		"НаличныйРасчет");  
	
	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции 

Функция СоответствиеПолейСервис_PM_PAYMENTS_FOR_PORTAL() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("ID", 			"ИдентификаторКонтрагента"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   
	СоответсвиеВыходныхПарамтров.Вставить("DATE_OPLATY", 		"ПредставлениеДатаОплаты");
	СоответсвиеВыходныхПарамтров.Вставить("DATE_OPLATY_DATE", 	"ДатаОплаты");  
	СоответсвиеВыходныхПарамтров.Вставить("VALUTA", 			"НаименованиеВалюта");  
	СоответсвиеВыходныхПарамтров.Вставить("Summa", 				"Сумма");
	СоответсвиеВыходныхПарамтров.Вставить("VALUTA_ID", 			"ИдентификаторВалюта"); 

	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции 

Функция СоответствиеПолейСервис_Cancel_Return() Экспорт
	
	СоответсвиеВходныхПараметров = Новый Соответствие; 
	СоответсвиеВходныхПараметров.Вставить("IDDOC", 			"ИдентификаторДокумента"); 
	СоответсвиеВходныхПараметров.Вставить("KONTRAGENT_", 	"ИдентификаторКонтрагента"); 
	
	СоответсвиеВыходныхПарамтров = Новый Соответствие;   

	СтруктураСоответсвий = Новый Структура;  
	СтруктураСоответсвий.Вставить("СоответсвиеВходныхПараметров", СоответсвиеВходныхПараметров);
	СтруктураСоответсвий.Вставить("СоответсвиеВыходныхПарамтров", СоответсвиеВыходныхПарамтров);      
															
	Возврат СтруктураСоответсвий;	

КонецФункции 


///////////////////Шаблон структуры сообщения для отправления по API///////////////////   
Функция ПолучитьСтрутуруAPI()
	
	//Шапка документа
	СтруктураШапки = Новый Структура;	
	СтруктураШапки.Вставить("ИдентификаторЗаказа");
	СтруктураШапки.Вставить("ИдентификаторСообщения"); //используется со статусом EMailЗаказ = Bcnbyf
	СтруктураШапки.Вставить("ЮрАдрес");
	СтруктураШапки.Вставить("ФактАдрес");
	СтруктураШапки.Вставить("ИДФактАдрес");
	СтруктураШапки.Вставить("Комментарий");
	СтруктураШапки.Вставить("ИдентификаторДоговора");
	СтруктураШапки.Вставить("ИдентификаторОрганизация");
	СтруктураШапки.Вставить("ИдентификаторКонтрагента");
	СтруктураШапки.Вставить("ИдентификаторФилиала");
	СтруктураШапки.Вставить("ТипДоставки");
	СтруктураШапки.Вставить("ИдентификаторВалюта");
	СтруктураШапки.Вставить("НаименованиеЗаказаПортала");
	СтруктураШапки.Вставить("Почта"); 
	СтруктураШапки.Вставить("ИНН");
	СтруктураШапки.Вставить("КПП");
	СтруктураШапки.Вставить("ИдентификаторСклад");
	СтруктураШапки.Вставить("ТипОплаты");
	СтруктураШапки.Вставить("ДатаДоставки");
	СтруктураШапки.Вставить("Контрагент");			// требуется совместно с параметром "EMailЗаказ" - истина
	СтруктураШапки.Вставить("ФилиалКонтрагента");	// требуется совместно с параметром "EMailЗаказ" - истина
	СтруктураШапки.Вставить("КодИсточника"); 		//Строки документа, Массив Структур
	
	СтруктураСтрок = Новый Структура;
	СтруктураСтрок.Вставить("КодПроизводителя");//Номенклатура.КодПроизводителя
	СтруктураСтрок.Вставить("Артикул");			//Номенклатура.Артикул
	СтруктураСтрок.Вставить("Родитель");		// Родитель Номенклатуры
	СтруктураСтрок.Вставить("Наименование");
	СтруктураСтрок.Вставить("Количество");
	СтруктураСтрок.Вставить("ЦенаКлиента");
	СтруктураСтрок.Вставить("ЦенаЗакупки");
	СтруктураСтрок.Вставить("ПроизводительПоставщика");
	СтруктураСтрок.Вставить("Комментарий"); 
	
    МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(СтруктураСтрок);
	
	// Основная структура
	СтруктураСообщения = Новый Структура;   
	СтруктураСообщения.Вставить("Шапка", 	СтруктураШапки); 	//структура             
	СтруктураСообщения.Вставить("Строки", 	МассивСтрок); 		//Массив Структур     
	// Необязательные параметры
	СтруктураСообщения.Вставить("EMailЗаказ",			Ложь);// Булево
	СтруктураСообщения.Вставить("ТипЦенЗаказа", 		Неопределено);// СправочникСсылка.ТипыЦенНоменклатуры 
	
    Возврат СтруктураСообщения;
	
КонецФункции	

Функция ПараметрыПодключения(АдресСервера) Экспорт    
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("АдресСервера", АдресСервера);
	ПараметрыПодключения.Вставить("Порт", 80);
	ПараметрыПодключения.Вставить("Путь", "");
	
	Возврат ПараметрыПодключения;
	
КонецФункции 		

Функция ПроверитьТокенДоступа(ТокенДоступа) Экспорт 
	
	ТокенАктивен	= Ложь;
	СообщениеОшибки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТокеныДоступа.Ссылка КАК ТокенДоступа,
	|	ТокеныДоступа.Наименование,
	|	ТокеныДоступа.Неактивен
	|ИЗ
	|	Справочник.ТокеныДоступа КАК ТокеныДоступа
	|ГДЕ
	|	ТокеныДоступа.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ТокеныДоступа.Наименование = &ТокенДоступа";
	
	Запрос.УстановитьПараметр("ТокенДоступа", ТокенДоступа);
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаРезультат.Следующий() Тогда 
		
		Если ВыборкаРезультат.Неактивен Тогда 
			СообщениеОшибки = "Токен доступа не Активен..";
		Иначе 
			ТокенАктивен = Истина;	                     
		КонецЕсли;
		
	Иначе 	
		СообщениеОшибки = "Отсутствует Токен доступа.";
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТокенАктивен", 	ТокенАктивен);
	СтруктураОтвета.Вставить("СообщениеОшибки", СообщениеОшибки);
	
	Возврат СтруктураОтвета;
	
КонецФункции	


///////////////////client_payments///////////////////
Функция ПолучитьИсториюПлатежейСервер(ПараметрыСоответсвие) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	ПараметрыСтруктура 	= ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);  
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.client_payments.ПолучитьИсториюПлатежей", 
	УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. ПолучитьИсториюПлатежей. " + ПараметрыЗапросаСтр);
	
	СтруктураВозврата = ПолучитьДанныеПлатежей(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.client_payments.ПолучитьИсториюПлатежей", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ПолучитьИсториюПлатежей "  
	+ ". Время ответа: " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек" + ПараметрыЗапросаСтр);
		
	Возврат СтруктураВозврата;
	
КонецФункции 

Функция ПолучитьДанныеПлатежей(ПараметрыЗапроса)
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	Контрагент = НайтиКонтрагентаOnlineStore(ПараметрыЗапроса, СтруктураВозврата, "История платежей не получена. ");
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;	
	
	ТаблицаОплат = Новый ТаблицаЗначений;
	ТаблицаОплат.Колонки.Добавить("ПредставлениеДатаОплаты");
	ТаблицаОплат.Колонки.Добавить("ДатаОплаты",);
	ТаблицаОплат.Колонки.Добавить("НаименованиеВалюта");
	ТаблицаОплат.Колонки.Добавить("Сумма");
	ТаблицаОплат.Колонки.Добавить("ИдентификаторВалюта");
	
	ПоКалендарнымДням = Ложь;        
	
	Если Константы.СпособКонтроляДнейЗадолженности.Получить() = Перечисления.СпособыКонтроляДнейЗадолженности.ПоКалендарнымДням Тогда 
		ПоКалендарнымДням = Истина;
	КонецЕсли;		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата КАК Дата,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.ВалютаДокумента КАК НаименованиеВалюта,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДнейЗадолженности,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.ВалютаДокумента.Код КАК КодВалюты
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);     
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаРасчета из ТаблицаРезультат Цикл 	
		
		Если ПоКалендарнымДням Тогда 
			ДатаОплаты = ЗаполнениеДокументов.ОпределитьДатуКалендарныхДней(СтрокаРасчета.Дата, СтрокаРасчета.ДнейЗадолженности);
		Иначе     
			
			ДнейЗадолженности	=	?(СтрокаРасчета.ДнейЗадолженности >= 1, СтрокаРасчета.ДнейЗадолженности, 0);
			ДатаОплаты 			=	?(ДнейЗадолженности = 0, СтрокаРасчета.Дата,  ЗаполнениеДокументов.ОпределитьДату(СтрокаРасчета.Дата, ДнейЗадолженности));
			
		КонецЕсли;	
		
		Если НЕ ДатаОплаты =  Неопределено 
			И НЕ ДатаОплаты =  Null
			Тогда 
			
			СтрокаОплаты = ТаблицаОплат.Добавить();      
			СтрокаОплаты.ПредставлениеДатаОплаты 	= Строка(Формат(ДатаОплаты, "ДФ=dd.MM.yyyy"));
			СтрокаОплаты.ДатаОплаты 				= Формат(НачалоДня(ДатаОплаты), "ДФ=dd.MM.yyyy");
			СтрокаОплаты.НаименованиеВалюта 		= Строка(СтрокаРасчета.НаименованиеВалюта);
			СтрокаОплаты.Сумма 						= СтрокаРасчета.СуммаВзаиморасчетовОстаток;
			СтрокаОплаты.ИдентификаторВалюта 		= Строка(СтрокаРасчета.КодВалюты);   
			
		КонецЕсли;  
		
	КонецЦикла;
	
	ТаблицаОплат.Свернуть("ПредставлениеДатаОплаты,ДатаОплаты,НаименованиеВалюта,ИдентификаторВалюта", "Сумма");
	ТаблицаОплат.Сортировать("ДатаОплаты");  
	
	СтрокаПолей = ПолучитьПоляСтруктурыВыходныхПараметров(СоответствиеПолейСервис_PM_PAYMENTS_FOR_PORTAL());
	МассивСтрок = Новый Массив;
	
	Для Каждого СтрокаОплаты из ТаблицаОплат Цикл     
		
		СтруктураСтроки = Новый Структура(СтрокаПолей);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаОплаты);
		МассивСтрок.Добавить(СтруктураСтроки);
		
	КонецЦикла; 
	
	СтруктураВозврата.Результат = Истина;	
	СтруктураВозврата.Данные 	= МассивСтрок;
	
	Возврат СтруктураВозврата;  
	
КонецФункции	


///////////////////docs///////////////////
Функция ПолучитьФайлыДокументов(ПараметрыЗапроса) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	//получаем входящие параметры
	ИДДок	  = ПараметрыЗапроса.Получить("ИдентификаторДокумента");
	Формат    = ПараметрыЗапроса.Получить("Формат");  	
	Тип       = ПараметрыЗапроса.Получить("ТипДокумента");
 	
	Если НЕ ВРег(Тип) = "RETURN" Тогда
		
		ДокСФ = Документы.СчетФактураВыданный.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДок));
		
		Если ДокСФ.ПолучитьОбъект() <> Неопределено тогда
			ДокОбъект = ДокСФ.ДокументыОснования[0].ДокументОснование.ПолучитьОбъект();
		Иначе
			
			СтруктураВозврата.Сообщение = "Не найдена счет фактура по гуид: " + ИДДок;
			Возврат	СтруктураВозврата;
			
		КонецЕсли;
		
		Если ВРег(Тип) = "ORDER" тогда
			ПечатныеФормы = НовыйСчет(ДокОбъект);
		ИначеЕсли ВРег(Тип) = "UPD" тогда
			ПечатныеФормы = ПечатьУниверсальногоПередаточногоДокумента(ДокОбъект);
		Иначе
			
			СтруктураВозврата.Сообщение = "Неизвестный тип документа";
			Возврат	СтруктураВозврата;			
			
		КонецЕсли;
		
		НазваниеДокумента = ОбщегоНазначения.СформироватьЗаголовокДокумента(?(ВРег(Тип) = "ORDER", ДокОбъект.Ссылка, ДокСФ), ?(ВРег(Тип) = "ORDER", "Счет", "УПД"));
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, "/", "-");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, ".", "");
		
		Если ВРег(Формат) = "PDF" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".pdf";
			ПечатныеФормы.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		ИначеЕсли ВРег(Формат) = "XLS" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".xls";
			ПечатныеФормы.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		Иначе    
			
			СтруктураВозврата.Сообщение = "Неизвестный формат документа";
			Возврат	СтруктураВозврата;	
			
		КонецЕсли;                    
		
		СтруктураВозврата.Результат = Истина;
		СтруктураВозврата.Данные = Рез;		
		
	ИначеЕсли ВРег(Тип) = "RETURN" Тогда 
		
		Формат = "PDF";
		ДокВозврат = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(ИДДок));
		
		Если ДокВозврат.ПолучитьОбъект() <> Неопределено Тогда
			ДокОбъект = ДокВозврат.ПолучитьОбъект();
		Иначе
			
			СтруктураВозврата.Сообщение = "Не найдена заявка на возврат по гуид: " + ИДДок;
			Возврат	СтруктураВозврата;
			
		КонецЕсли; 
		
		ТаблДокВозврат = Новый ТабличныйДокумент;
		ТаблДокВозврат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТаблДокВозврат.АвтоМасштаб = Истина;
		
		//Формируем письмо-претензию
		ПечатнаяФормаВозврат  = ПечатьВозврата(ДокОбъект);
		ТаблДокВозврат.Вывести(ПечатнаяФормаВозврат);
		ТаблДокВозврат.ВывестиГоризонтальныйРазделительСтраниц();
		
		//Формируем заявлениен на возврат для розничных или возврат
		Если ДокОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда	
			ПечатнаяФормаПисьмо = ПечатьЗаявлениеНаВозвратФизЛица(ДокОбъект); 
		Иначе
			ПечатнаяФормаПисьмо =  ПечатьПретензии(ДокОбъект);
		КонецЕсли;
		
		ВремТабДок = Новый ТабличныйДокумент;
		ОбластьЯчеек = ВремТабДок.Вывести(ПечатнаяФормаПисьмо);		
		ОбластьЯчеек.СоздатьФорматСтрок();
		ТаблДокВозврат.Вывести(ВремТабДок);	
		
		НазваниеДокумента = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДокОбъект.Ссылка, "Заявка на возврат");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, "/", "-");
		НазваниеДокумента = СтрЗаменить(НазваниеДокумента, ".", ""); 
		
		Если ВРег(Формат) = "PDF" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".pdf";
			ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.PDF); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		ИначеЕсли ВРег(Формат) = "XLS" тогда
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + НазваниеДокумента + ".xls";
			ТаблДокВозврат.Записать(ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLS); 
			Рез = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайла));
			УдалитьФайлы(ПолноеИмяФайла);
			
		Иначе
			
			СтруктураВозврата.Сообщение = "Неизвестный формат документа";
			Возврат	СтруктураВозврата;	
			
		КонецЕсли;
		
		СтруктураВозврата.Результат = Истина;
		СтруктураВозврата.Данные = Рез;
		
	Иначе
		
		СтруктураВозврата.Сообщение = "Неизвестный тип документа";
		Возврат	СтруктураВозврата;			
		
	КонецЕсли;
	
	Возврат	СтруктураВозврата;
	
КонецФункции

Функция ПечатьВозврата(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("Возврат");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ЗаявкаНаВозврат.Реализация.Контрагент КАК Поставщик,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.ИНН КАК ИНН,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.КПП КАК КПП,
	|	КонтактнаяИнформация.Представление КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Реализация.Номер,
	|	ЗаявкаНаВозврат.Реализация.Дата,
	|	ЗаявкаНаВозврат.Реализация.Грузополучатель КАК филиал,
	|	ЗаявкаНаВозврат.Комментарий КАК Примечание,
	|	ЕСТЬNULL(СчетФактураВыданный.Номер, """") КАК СФНомер,
	|	ЕСТЬNULL(СчетФактураВыданный.Дата, """") КАК СФДата
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Ссылка = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетФактураВыданный.ДокументОснование = ЗаявкаНаВозврат.Реализация
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	РеализацияНомер = "";
	РеализацияДата = "";
	ТипВозврата = "";
	ВозвратТовара = "";
	
	ЗапросШапкаРекламация = Новый Запрос;
	ЗапросШапкаРекламация.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втТипПервойСтроки
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаявкаНаВозвратТовары.Тип) КАК ТипВозвратаКоличествоРазличных,
	|	ЗаявкаНаВозвратТовары.Ссылка
	|ПОМЕСТИТЬ втКоличествоТипов
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаВозвратТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втКоличествоТипов.ТипВозвратаКоличествоРазличных,
	|	втТипПервойСтроки.Тип
	|ИЗ
	|	втТипПервойСтроки КАК втТипПервойСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втКоличествоТипов КАК втКоличествоТипов
	|		ПО втТипПервойСтроки.Ссылка = втКоличествоТипов.Ссылка";
	
	ЗапросШапкаРекламация.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапкаРекламация = ЗапросШапкаРекламация.Выполнить().Выбрать();
	
	Если ВыборкаШапкаРекламация.Следующий() и ВыборкаШапкаРекламация.ТипВозвратаКоличествоРазличных = 1 И ВыборкаШапкаРекламация.Тип = "Рекламация" Тогда
		
		ТипВозврата = "Возврат брака";
		ВозвратТовара = "Рекламация покупателя";
		
	Иначе
		
		ТипВозврата = "Возврат";
		ВозвратТовара = "Возврат товара";
		
	КонецЕсли; 
	
	Если ПромОбъект.Реализация.ДоговорКонтрагента.РозничнаяПродажа Тогда
		ВозвратТовара = ВозвратТовара + " " + "(розн)";
	ИначеЕсли ПромОбъект.Реализация.ДоговорКонтрагента.ЛицевойСчет Тогда 
		ВозвратТовара = ВозвратТовара + " " + "(лиц.сч.)";
	КонецЕсли;
	
	Если ВыборкаШапка.Следующий() Тогда
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);
		Обл.Параметры.ВремяПечати = ТекущаяДата();
		Обл.Параметры.Возврат = ТипВозврата;
		Обл.Параметры.ВозвратТовара = ВозвратТовара;
		
		Если ВыборкаШапка.СФНомер = "" Тогда 
			
			РеализацияНомер = ВыборкаШапка.РеализацияНомер;
			РеализацияДата = ВыборкаШапка.РеализацияДата;
			
		Иначе
			
			РеализацияНомер = ВыборкаШапка.СФНомер;
			РеализацияДата = ВыборкаШапка.СФДата;
			
		КонецЕсли;
		
		ИмяРисункаШК = "D1";
		КоличествоМиллиметровВПикселе = 0.26;
		ПараметрыШтрихкода = Новый Структура;
		ПараметрыШтрихкода.Вставить("Ширина",          Окр(Обл.Рисунки[ИмяРисункаШК].Ширина / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Высота",          Окр(Обл.Рисунки[ИмяРисункаШК].Высота / КоличествоМиллиметровВПикселе));
		ПараметрыШтрихкода.Вставить("Штрихкод",        СокрЛП(ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ПромОбъект.Ссылка)));
		ПараметрыШтрихкода.Вставить("ТипКода",         4); // Code128
		ПараметрыШтрихкода.Вставить("ОтображатьТекст", Истина);
		ПараметрыШтрихкода.Вставить("РазмерШрифта",    9);
		
		Обл.Рисунки[ИмяРисункаШК].Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
		ТабДокумент.Вывести(Обл);
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Артикул КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель,
	|	1 КАК Коэффициент,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	
	ИтогоКоличество = 0;
	ИтогоСумма = 0;
	
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		Обл.Параметры.Реализация = РеализацияНомер + " от " + Формат(РеализацияДата, "ДФ=dd.MM.yyyy"); 
		Обл.Параметры.ПредставлениеТовара = ВыборкаТЧ.КодПроизводителя + " " + ВыборкаТЧ.Наименование;
		ИтогоКоличество = ИтогоКоличество + ВыборкаТЧ.Количество;
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Количество = ИтогоКоличество;
	Обл.Параметры.Сумма = ИтогоСумма;
	ТабДокумент.Вывести(Обл);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьУниверсальногоПередаточногоДокумента(Док)
	
	ДанныеДокумента = Новый Структура();
	ДанныеДокумента.Вставить("ДокументСсылка",    				Док.Ссылка);
	ДанныеДокумента.Вставить("Номер",             				Док.Номер);
	ДанныеДокумента.Вставить("Дата",              				Док.Дата);
	ДанныеДокумента.Вставить("Ссылка", 			  				Документы.СчетФактураВыданный.ПустаяСсылка());
	ДанныеДокумента.Вставить("ДокументОснование", 				Док.Ссылка);
	ДанныеДокумента.Вставить("Организация",   	  				Док.Организация);
	ДанныеДокумента.Вставить("Контрагент", 		  				Док.Контрагент);
	ДанныеДокумента.Вставить("ДоговорКонтрагента", 		  		Док.ДоговорКонтрагента);
	ДанныеДокумента.Вставить("Руководитель", 	  				Док.ОтпускРазрешил);
	ДанныеДокумента.Вставить("ГлавныйБухгалтер",  				Неопределено);
	ДанныеДокумента.Вставить("ВалютаРегламентированногоУчета",  глЗначениеПеременной("ВалютаРегламентированногоУчета"));
	ДанныеДокумента.Вставить("Подразделение", 	  				Док.Подразделение);
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Док.ДоговорКонтрагента, "ВидДоговора");
	ПередачаНаРеализациюПоКомиссии = (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
	ДанныеДокумента.Вставить("ПередачаНаРеализациюПоКомиссии",  ПередачаНаРеализациюПоКомиссии);
	
	СчетФактураТребуется = УчетНДС.ОпределитьСчетФактураТребуется(Док);
	
	СтруктураОтбораСчетаФактуры = Новый Структура;
	СтруктураОтбораСчетаФактуры.Вставить("ПометкаУдаления", Ложь);
	
	Возврат ПечатьУниверсальногоПередаточногоДокумента1(ДанныеДокумента, СчетФактураТребуется, СтруктураОтбораСчетаФактуры);
	
КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция ПечатьУниверсальногоПередаточногоДокумента1(ДанныеДокумента, СчетФактураТребуется, СтруктураОтбораСчетаФактуры = Неопределено, ТабДокумент = Неопределено) Экспорт
	
	Если СтруктураОтбораСчетаФактуры = Неопределено Тогда
		СчетФактура = учетндс.НайтиПодчиненныйСчетФактуру(ДанныеДокумента.ДокументСсылка, "СчетФактураВыданный");
	Иначе
		СчетФактура = учетндс.НайтиПодчиненныйСчетФактуру(ДанныеДокумента.ДокументСсылка, "СчетФактураВыданный", СтруктураОтбораСчетаФактуры);
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда
		
		ТабДокумент = Новый ТабличныйДокумент;
		// Устанавливаем параметры печати и колонтитулы
		ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху 			= 12;
		ТабДокумент.ПолеСлева  			= 0;
		ТабДокумент.ПолеСнизу  			= 0;
		ТабДокумент.ПолеСправа 			= 0;
		ТабДокумент.АвтоМасштаб 		= Истина;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетФактура) ИЛИ СчетФактураТребуется Тогда
		
		// УПД печатается из документа счет-фактура
		Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'По документу ""%1"" не выписан счет-фактура или он помечен на удаление!'"), ДанныеДокумента.ДокументСсылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
			
		КонецЕсли;
		
		РеквизитыСФ = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(СчетФактура, "Дата, ВидСчетаФактуры, Исправление,НомерИсправления,
			|СчетФактураБезНДС, КППКонтрагента");
		ДанныеДокумента.Вставить("Ссылка", 					СчетФактура); 
		ДанныеДокумента.Вставить("Дата", 					РеквизитыСФ.Дата);
		ДанныеДокумента.Вставить("ВидСчетаФактуры", 		РеквизитыСФ.ВидСчетаФактуры);
		ДанныеДокумента.Вставить("Исправление", 	 		РеквизитыСФ.Исправление);
		ДанныеДокумента.Вставить("НомерИсправления", 		РеквизитыСФ.НомерИсправления);
		ДанныеДокумента.Вставить("СчетФактураБезНДС", 		РеквизитыСФ.СчетФактураБезНДС);
		ДанныеДокумента.Вставить("КППКонтрагента", 	 		РеквизитыСФ.КППКонтрагента);
		
		СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
		ДанныеДляПечати = СчетФактураОбъект.ПодготовитьДанныеДляПечатиУниверсальногоПередаточногоДокумента(ДанныеДокумента);
		
		Если ДанныеДляПечати = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ДанныеДокумента.Свойство("ДатаОтгрузкиПередачи") Тогда
			ДанныеДляПечати.Вставить("ДатаОтгрузкиПередачи", ДанныеДокумента.ДатаОтгрузкиПередачи);
		КонецЕсли;

		ПечатьУниверсальногоПередаточногоДокумента2(ДанныеДляПечати, ТабДокумент);
		Возврат ТабДокумент;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция ПечатьУниверсальногоПередаточногоДокумента2(ДанныеДляПечати, ТабДокумент = Неопределено) Экспорт
	
	//+Гавриленков В. 25.03.2026 #UT10-5782
	Если ДанныеДляПечати.Дата >= Дата(2026,4,1) Тогда		
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент26");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
	//-Гавриленков В. 25.03.2026 #UT10-5782
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2026,1,1) Тогда		
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент1096_2026");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");  		
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2024,10,1) Тогда 
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент1096");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
	ИначеЕсли ДанныеДляПечати.Дата >= Дата(2021, 07, 1) Тогда
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент534");
	ИначеЕсли ДанныеДляПечати.ДатаСчетФактуры >= Дата(2017,10,1) Тогда
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент981");
	Иначе
		Макет = ПолучитьОбщийМакет("УниверсальныйПередаточныйДокумент");
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда
		ТабДокумент = Новый ТабличныйДокумент;
	КонецЕсли;
	
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйПередаточныйДокумент";
	
	УчетНДС.ВывестиСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	УчетНДС.ВывестиПодвалУниверсальногоПередаточногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьУниверсальногоПередаточногоДокумента

Функция ПечатьПретензии(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозврат";
	Макет = ПромОбъект.ПолучитьМакет("ПретензияПортал");
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.ИНН
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА ЗаявкаНаВозврат.Реализация.Контрагент.КПП = """"
	|				ИЛИ ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|			ТОГДА "" -------""
	|		ИНАЧЕ ЗаявкаНаВозврат.Реализация.Контрагент.КПП
	|	КОНЕЦ КАК КПП,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК ЮрАдрес,
	|	ЗаявкаНаВозврат.Реализация.Организация.Наименование КАК ОрганизацияНаименование,
	|	ЗаявкаНаВозврат.Реализация.Организация.ИНН КАК ОрганизацияИНН,
	|	ЗаявкаНаВозврат.Реализация.Организация.КПП КАК ОрганизацияКПП,
	|	ЗаявкаНаВозврат.Номер КАК Номер,
	|	ЗаявкаНаВозврат.Дата КАК Дата,
	|	ЗаявкаНаВозврат.Комментарий КАК ТекстКомментарий,
	|	ЗаявкаНаВозврат.Реализация.Контрагент.НаименованиеПолное КАК Контрагент,
	|	ЗаявкаНаВозврат.Реализация.ДоговорКонтрагента.ЛицевойСчет КАК ЛицевойСчет
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ЗаявкаНаВозврат.Реализация.Контрагент = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка";
	
	ЗапросШапка.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ВыборкаШапка = ЗапросШапка.Выполнить().Выбрать();
	
	Если ВыборкаШапка.Следующий() Тогда
		
		СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ПромОбъект.Реализация, "СчетФактураВыданный"); 
		
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			
			НомерУПД = СчетФактура.Номер;
			ДатаУПД = СчетФактура.Дата;
			
		Иначе
			
			НомерУПД = ВыборкаШапка.Реализация.Номер;
			ДатаУПД = ВыборкаШапка.Реализация.Дата;
			
		КонецЕсли;
		
		Обл   = Макет.ПолучитьОбласть("Заголовок");
		Обл.Параметры.Заполнить(ВыборкаШапка);		     
		Обл.Параметры.ТекстДоговор = "В рамках договора" + ?(ВыборкаШапка.ЛицевойСчет, " оферты", " поставки") + " с " + ВыборкаШапка.ОрганизацияНаименование + " ИНН/КПП " +
		ВыборкаШапка.ОрганизацияИНН + "/" + ВыборкаШапка.ОрганизацияКПП + " по УПД № " + НомерУПД +
		" от " + Формат(ДатаУПД, "ДФ=dd.MM.yyyy") + " нами были получены следующие позиции: "; 
		ТабДокумент.Вывести(Обл);
		Обл = Макет.ПолучитьОбласть("Шапка");	
		ТабДокумент.Вывести(Обл);
		
	КонецЕсли;
	
	ЗапросТЧ = Новый Запрос;
	ЗапросТЧ.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Тип,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя КАК Артикул,
	|	ЗаявкаНаВозвратТовары.Номенклатура.Родитель КАК Производитель
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";
	
	ЗапросТЧ.УстановитьПараметр("Ссылка", ПромОбъект.Ссылка);
	ИтогоСумма = 0;
	ВыборкаТЧ = ЗапросТЧ.Выполнить().Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл
		
		Обл = Макет.ПолучитьОбласть("Строка");
		Обл.Параметры.Заполнить(ВыборкаТЧ);
		ТабДокумент.Вывести(Обл);
		ИтогоСумма = ИтогоСумма + ВыборкаТЧ.Сумма;
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Подвал");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ТекстКомментарий = "";
	ТабДокумент.Вывести(Обл);
	
	Для Сч = 1 По 60 - ТабДокумент.ВысотаТаблицы Цикл
		
		Обл = Макет.ПолучитьОбласть("ПустаяСтрока");
		ТабДокумент.Вывести(Обл);
		
	КонецЦикла;
	
	Обл = Макет.ПолучитьОбласть("Низ");
	Обл.Параметры.Заполнить(ВыборкаШапка);
	Обл.Параметры.Сумма = ИтогоСумма;
	Обл.Параметры.ВремяПечати = ТекущаяДата();
	ТабДокумент.Вывести(Обл); 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьДанныеЧекаНаПечать(ДокОбъект)  Экспорт
	
	ТаблицаЧеков = Новый ТаблицаЗначений;
	ТаблицаЧеков.Колонки.Добавить("НомерЧека");
	ТаблицаЧеков.Колонки.Добавить("ДатаЧека"); 
	
	ТекстВозврат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Реализация
	|ПОМЕСТИТЬ ВтРеализация
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРеализация КАК ВтРеализация
	|		ПО ПриходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = ВтРеализация.Реализация
	|			И (ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Аннулирован = ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.НомерЧекаККМ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.Дата
	|ИЗ
	|	ВтРеализация КАК ВтРеализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|		ПО ВтРеализация.Реализация = ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом
	|			И (ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка.ВидОперации = &ВидОперации)";  
	
	Запрос.УстановитьПараметр("Ссылка", ДокОбъект.Ссылка);  
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если Не ЗначениеЗаполнено(Выборка.НомерЧекаККМ) Тогда
			Продолжить;
		КонецЕсли;  
		
		НовСтрока = ТаблицаЧеков.Добавить();
		НовСтрока.НомерЧека = СокрЛП(Выборка.НомерЧекаККМ);
		НовСтрока.ДатаЧека = Формат(Выборка.Дата, "ДЛФ=DD"); 
		
	КонецЦикла;
	
	Возврат ТаблицаЧеков;
	
КонецФункции

Функция НовыйСчет(Док) Экспорт 
	
	ТабДокумент  = Новый ТабличныйДокумент;
	Макет = Док.ПолучитьМакет("СчетЗаказ");
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", Док.Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Номер,
	|	РеализацияТоваровУслуг.Дата,
	|	РеализацияТоваровУслуг.ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.Контрагент КАК Получатель,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Организация КАК Поставщик,
	|	РеализацияТоваровУслуг.СуммаДокумента,
	|	РеализацияТоваровУслуг.ВалютаДокумента,
	|	РеализацияТоваровУслуг.УчитыватьНДС,
	|	РеализацияТоваровУслуг.СуммаВключаетНДС,
	|	РеализацияТоваровУслуг.ОтпускПроизвел,
	|	РеализацияТоваровУслуг.КурсВзаиморасчетов,
	|	РеализацияТоваровУслуг.КратностьВзаиморасчетов,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = &ПустойКонтрагент
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &ТекущийДокумент";
	
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата);
	
	// 	Если Тип = "Счет" Тогда
	ОбластьМакета       = Макет.ПолучитьОбласть("ЗаголовокСчета");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
	ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
	
	Банк       = СведенияОПоставщике.Банк;
	БИК        = ?(ЗначениеЗаполнено(Банк),Банк.Код, "");
	КоррСчет   = ?(ЗначениеЗаполнено(Банк),Банк.КоррСчет, "");
	ГородБанка = ?(ЗначениеЗаполнено(Банк),Банк.Город, "");
	НомерСчета = СведенияОПоставщике.НомерСчета;
	
	ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
	ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
	ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
	ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
	ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
	ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
	ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
	
	Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения) Тогда
		ОбластьМакета.Параметры.ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ОбластьМакета.Параметры.ТекстПоставщик = "Поставщик:";
	ОбластьМакета.Параметры.ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");

	Если Константы.База.Получить() = Перечисления.НазваниеБазы.Тула Тогда 
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата)
		, "ПолноеНаименование,ФактическийАдрес,");
		
	Иначе
		ОбластьМакета.Параметры.ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	КонецЕсли;      
	
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(Шапка);

	ОбластьМакета.Параметры.ТекстПокупатель = "Покупатель:";
	ОбластьМакета.Параметры.ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	
	ОбластьМакета.Параметры.ПредставлениеГрузополучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Грузополучатель, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ФактическийАдрес,Телефоны,");
	ТабДокумент.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакета);
	//
	Всего = 0;			
	ВсегоНДС = 0;			
	
	Для каждого ТекСтр Из Док.Товары Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.НомерСтроки =   ТекСтр.НомерСтроки;
		ОбластьМакета.Параметры.Товар =   ТекСтр.Номенклатура.НаименованиеПолное;
		ОбластьМакета.Параметры.Количество =  ТекСтр.Количество;
		ОбластьМакета.Параметры.ЕдиницаИзмерения = ТекСтр.ЕдиницаИзмерения;
		ОбластьМакета.Параметры.Цена =   ТекСтр.Цена;
		ОбластьМакета.Параметры.ТоварРодитель = ТекСтр.Номенклатура.Родитель;
		ОбластьМакета.Параметры.КодПроизводителя = ТекСтр.Номенклатура.КодПроизводителя;
		ОбластьМакета.Параметры.Сумма = ?(Док.СуммаВключаетНДС, ТекСтр.Сумма,ТекСтр.Сумма+ТекСтр.СуммаНДС);
		
		ТабДокумент.Вывести(ОбластьМакета);
		Всего = Всего + ТекСтр.Сумма;			
		ВсегоНДС = ВсегоНДС + ТекСтр.СуммаНДС;		
		
	КонецЦикла; 
	
	ОбластьМакета = Макет.ПолучитьОбласть("НДС");
	ОбластьМакета.Параметры.Всего = Всего;
	ОбластьМакета.Параметры.НДС = ?(Док.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:");
	ОбластьМакета.Параметры.ВсегоНДС = ВсегоНДС;
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	Сумма	 = ?(Док.СуммаВключаетНДС, Док.Товары.Итог("Сумма"), Док.Товары.Итог("Сумма") + Док.Товары.Итог("СуммаНДС"));
	
	СуммаКПрописи = Сумма; 
	ОбластьМакета.Параметры.ИтоговаяСтрока = "Всего наименований " + Док.Товары.Количество()
	+ ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
	ОбластьМакета.Параметры.СуммаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчета");
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Организация, Шапка.Дата,);
	
	Руководитель = Руководители.Руководитель;
	ДолжностьРуководителя = Руководители.РуководительДолжность;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	Если НЕ ЗначениеЗаполнено(Док.Ответственный.ФизЛицо) Тогда
		ФИООтветственный = Док.Ответственный.Наименование;
	Иначе
		
		ФамилияИмяОтчествоФизЛица      	 = ФормированиеПечатныхФорм.ФамилияИмяОтчество(Док.Ответственный.ФизЛицо, Шапка.Дата);
		ФамилияИмяОтчествоОтветственного = ФамилияИмяОтчествоФизЛица.Фамилия + " " + ФамилияИмяОтчествоФизЛица.Имя + " " + ФамилияИмяОтчествоФизЛица.Отчество;
		ФИООтветственный         		 = ОбщегоНазначения.ФамилияИнициалыФизЛица(ФамилияИмяОтчествоОтветственного);
		
	КонецЕсли;
	
	ОбластьМакета.Параметры.ФИООтветственный = ФИООтветственный;
	ОбластьМакета.Параметры.Заполнить(Шапка);
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ПолеСлева = 1;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.Вывести(ОбластьМакета);
	Возврат ТабДокумент;

КонецФункции

Функция ПечатьЗаявлениеНаВозвратФизЛица(ПромОбъект) Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаВозвратПортал";
	Макет = ПромОбъект.ПолучитьМакет("ЗаявлениеНаВозвратФизЛицаПортал");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	СведенияОбОрганизации  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ПромОбъект.Реализация.Организация,ПромОбъект.Дата,, ПромОбъект.Реализация.Организация.ОсновнойБанковскийСчет); 
	ОбластьШапка.Параметры.НаименованиеОрганизации = СведенияОбОрганизации.Представление;
	ОбластьШапка.Параметры.АдресОрганизации = СведенияОбОрганизации.ЮридическийАдрес;
	ОбластьШапка.Параметры.ИННКПП = СведенияОбОрганизации.ИНН+"/"+СведенияОбОрганизации.КПП;
	ОбластьШапка.Параметры.РасчетныйСчет = "Р/с "+СведенияОбОрганизации.НомерСчета;
	ОбластьШапка.Параметры.НаименованиеБанка = СведенияОбОрганизации.Банк;
	ОбластьШапка.Параметры.БикБанка = "БИК "+СведенияОбОрганизации.БИК;
	ОбластьШапка.Параметры.КоррСчет = "К/с "+СведенияОбОрганизации.КоррСчет;
	
	Если НЕ СведенияОбОрганизации.Банк = "" Тогда 
		ОбластьШапка.Параметры.ТелефонБанка = ?(ЗначениеЗаполнено(СведенияОбОрганизации.Банк.Телефоны), "Тел." + СведенияОбОрганизации.Банк.Телефоны, "");
	КонецЕсли;
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(ПромОбъект.Реализация.Организация, ПромОбъект.Дата,);
	ОбластьШапка.Параметры.ФИОДиректора = ?(ЗначениеЗаполнено(Руководители.РуководительВДательномПлатеже), Руководители.РуководительВДательномПлатеже, Руководители.Руководитель);
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	ОбластьСтроки.Параметры.ДатаРеализации = Формат(ПромОбъект.Реализация.Дата,"ДЛФ=DD");
	ПромСтрокаТовары = "";
	
	Для Каждого СтрокаТовары Из ПромОбъект.Товары Цикл
		ПромСтрокаТовары = ПромСтрокаТовары + ?(СокрЛП(ПромСтрокаТовары) = "", "", Символы.ПС) + СокрЛП(СтрокаТовары.Номенклатура.Наименование) 
		            + " " + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + " " + СокрЛП(СтрокаТовары.Номенклатура.Родитель) + " - " + СтрокаТовары.Количество + " шт.";
	КонецЦикла;
	
	СуммаПоДокументу = ПромОбъект.Товары.Итог("Сумма");
	ОбластьСтроки.Параметры.СуммаВозврата = Формат(СуммаПоДокументу,"ЧДЦ=2; ЧРД=,; ЧГ=") + " руб. (" 
	             + ОбщегоНазначения.СформироватьСуммуПрописью(СуммаПоДокументу, ПромОбъект.Реализация.ВалютаДокумента) + ")";
	ОбластьСтроки.Параметры.СписокТоваров = ПромСтрокаТовары;  
	ТабДокумент.Вывести(ОбластьСтроки);
	
	ТаблицаЧеков = ПолучитьДанныеЧекаНаПечать(ПромОбъект);  
	
	Если ТаблицаЧеков.Количество() = 0 Тогда
		
		ОбластьЧек = Макет.ПолучитьОбласть("ОбластьЧек"); 
		ОбластьЧек.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
		ТабДокумент.Вывести(ОбластьЧек);
		
	Иначе     
		
		ОбластьЧекиШапка = Макет.ПолучитьОбласть("ОбластьЧекиШапка");
		ТабДокумент.Вывести(ОбластьЧекиШапка);
		
		Для Каждого СтрокаЧек Из ТаблицаЧеков Цикл
			
			ОбластьЧеки = Макет.ПолучитьОбласть("ОбластьЧеки");
			ОбластьЧеки.Параметры.Заполнить(СтрокаЧек);
			ОбластьЧеки.Параметры.ТипОснования = "кассовый чек №";
			ТабДокумент.Вывести(ОбластьЧеки);
			
		КонецЦикла;
		
	КонецЕсли;

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
	ТабДокумент.Вывести(ОбластьПодвал); 
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Возврат ТабДокумент;

КонецФункции

Функция ПолучитьПараметрыСчетаНаОплату(ПараметрыЗапроса) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	//получаем входящие параметры
	ИдентификаторФилиала	  = ПараметрыЗапроса.Получить("ИдентификаторФилиала");
	
	Филиал = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИдентификаторФилиала);
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		
		СтруктураВозврата.Сообщение = "Не найден филиал под коду мдм: " + Строка(ИдентификаторФилиала);
		Возврат СтруктураВозврата;
		
	КонецЕсли; 
	
	Контрагент = Филиал.ГоловнойКонтрагент;        
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		
		СтруктураВозврата.Сообщение = "У филиала: " + Строка(Филиал) + " не заполнен головной контрагент";
		Возврат СтруктураВозврата;
		
	КонецЕсли; 

	
	Организация = Константы.ОсновнаяОрганизация.Получить();
	БанковскийСчет = Организация.ОсновнойБанковскийСчет;
	
	ДанныеСтруктура = Новый Структура;
	
	ПараметрыБанка = Новый Структура;
	ПараметрыБанка.Вставить("Наименование", Строка(БанковскийСчет.Банк));
	ПараметрыБанка.Вставить("БИК", СокрП(БанковскийСчет.Банк.Код));
	ПараметрыБанка.Вставить("КорреспондентскийСчет", СокрП(БанковскийСчет.Банк.КоррСчет));
	ПараметрыБанка.Вставить("НомерСчета", БанковскийСчет.НомерСчета);    
	
	ДанныеСтруктура.Вставить("Банк", ПараметрыБанка);

	ПараметрыОрганизации = Новый Структура;	
	ПараметрыОрганизации.Вставить("Наименование", Организация.НаименованиеПолное);
	ПараметрыОрганизации.Вставить("ИНН", Организация.ИНН);  
	ПараметрыОрганизации.Вставить("КПП", Организация.КПП); 
	ПараметрыОрганизации.Вставить("Руководитель", Строка(ПолучитьРуководителяОрганизации(Организация)));
	
	ДанныеСтруктура.Вставить("Организация", ПараметрыОрганизации);
	ДанныеСтруктура.Вставить("Поставщик", Организация.НаименованиеПолное + ", ИНН " + Организация.ИНН + ", КПП " + Организация.КПП + ", " + ПолучитьАдрес(Организация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации));
	ДанныеСтруктура.Вставить("Грузоотправитель", Организация.НаименованиеПолное + ", " + ПолучитьАдрес(Организация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации));
	ДанныеСтруктура.Вставить("Покупатель", Контрагент.НаименованиеПолное + ", ИНН " + Контрагент.ИНН + ", КПП " + Контрагент.КПП + ", " + ПолучитьАдрес(Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента));
	ДанныеСтруктура.Вставить("Грузополучатель", Филиал.НаименованиеПолное + ", " + ПолучитьАдрес(Филиал, Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента));
	
	СтруктураВозврата.Данные = ДанныеСтруктура;
	СтруктураВозврата.Результат = Истина;
	
	Возврат	СтруктураВозврата;
	
КонецФункции

Функция ПолучитьРуководителяОрганизации(Организация)
	
	Отбор = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо");
	Отбор.СтруктурнаяЕдиница = Организация;
	Отбор.ОтветственноеЛицо  = Перечисления.ОтветственныеЛицаОрганизации.Руководитель;
	СрезПоследних   = РегистрыСведений.ОтветственныеЛицаОрганизации.СрезПоследних(ТекущаяДата(), Отбор);

	Если СрезПоследних.Количество() < 1 Тогда
		Возврат Неопределено;
	Иначе
		Возврат СрезПоследних[0].ФизическоеЛицо;
	КонецЕсли;                                  
	
КонецФункции

Функция ПолучитьАдрес(Объект, Вид)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Объект", Объект); 
	Запрос.УстановитьПараметр("Вид", Вид); 
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Представление;
	КонецЕсли;                        
	
	Возврат "";
	
КонецФункции




///////////////////docsale///////////////////  
Функция ПолучитьДанныеДокументаОтгрузкиСервер(ПараметрыСоответсвие) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();  
	ПараметрыСтруктура 	= ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);  
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.docsale_goods.ПолучитьДанныеДокументаОтгрузки", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. ПолучитьДанныеДокументаОтгрузки. " + ПараметрыЗапросаСтр);
	
	СтруктураВозврата = ПолучитьИнформациюПоДокументуОтгрузки(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.docsale_goods.ПолучитьДанныеДокументаОтгрузки", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ПолучитьДанныеДокументаОтгрузки "  
	+ ". Время ответа: " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + ПараметрыЗапросаСтр);
		
	Возврат СтруктураВозврата;
	
КонецФункции    

Функция ПолучитьИнформациюПоДокументуОтгрузки(ПараметрыЗапроса)
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторДокумента") Или ПустаяСтрока(ПараметрыЗапроса.ИдентификаторДокумента) Тогда
		
		СтруктураВозврата.Сообщение = "Товары не получены. Причина: не задан параметр запроса ИдентификаторДокумента";
		Возврат СтруктураВозврата;
	
	КонецЕсли; 
	
	ИдентификаторДокумента = СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента); 
	
	НашлиДокумент = Ложь;    
	ДокументСФКлиента = ПолучитьДокументПоИдентификатору("СчетФактураВыданный", ИдентификаторДокумента);
	
	Если Не ДокументСФКлиента.Пустая() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураВыданный.Ссылка КАК Ссылка,
		|	СчетФактураВыданный.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|ГДЕ
		|	СчетФактураВыданный.Ссылка = &Ссылка
		|	И СчетФактураВыданный.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСФКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда        
			
			ДокументРеализация = ВыборкаДетальныеЗаписи.ДокументОснование;  
			НашлиДокумент 	   = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Если НЕ НашлиДокумент Тогда 
		
		ДокументРеализация = ПолучитьДокументПоИдентификатору("РеализацияТоваровУслуг", ИдентификаторДокумента);
		
		Если ДокументРеализация.Пустая() Тогда
		
			СтруктураВозврата.Сообщение = "Данные документа отгрузки не получены. Причина: не найдена счет-фактура/реализация с идентификатором " + ИдентификаторДокумента;
			Возврат СтруктураВозврата;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросПоШапкеРеализация = Новый Запрос;
	ЗапросПоШапкеРеализация.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК НомерДокумента,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Контрагент.ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
	|				ИЛИ РеализацияТоваровУслуг.Контрагент.ГоловнойКонтрагент.IDАварда = """"
	|			ТОГДА РеализацияТоваровУслуг.Контрагент.ГоловнойКонтрагент.КодМДМ
	|		ИНАЧЕ РеализацияТоваровУслуг.Контрагент.ГоловнойКонтрагент.IDАварда
	|	КОНЕЦ КАК ИдентификаторКлиента,
	|	РеализацияТоваровУслуг.Контрагент.ГоловнойКонтрагент.Наименование КАК НаименованиеГоловногоКлиента,
	|	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	|	РеализацияТоваровУслуг.Контрагент.Наименование КАК НаименованиеФилиала,
	|	РеализацияТоваровУслуг.ВалютаДокумента.Наименование КАК НаименованиеВалюта,
	|	""Отгружен"" КАК СтатусОтгрузки,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Водитель.Наименование, """") КАК ФИОВодителя,
	|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК КонтактыВодителя,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.ТаксиДоставка
	|			ТОГДА ЕСТЬNULL(Грузоместа.Грузоместо, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Грузомест,
	|	РеализацияТоваровУслуг.ТаксиДоставка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО РеализацияТоваровУслуг.Водитель = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГрузовоеМесто.РеализацияСамовывоза КАК Реализация,
	|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМесто.Ссылка) КАК Грузоместо
	|		ИЗ
	|			Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|		ГДЕ
	|			ГрузовоеМесто.РеализацияСамовывоза = &РеализацияПараметр
	|			И ГрузовоеМесто.Проведен
	|			И ГрузовоеМесто.Погружено
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ГрузовоеМесто.РеализацияСамовывоза) КАК Грузоместа
	|		ПО РеализацияТоваровУслуг.Ссылка = Грузоместа.Реализация
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &РеализацияПараметр";	       
	
	ЗапросПоШапкеРеализация.УстановитьПараметр("РеализацияПараметр", ДокументРеализация);    
	
	МассивСтрок = Новый Массив; 
	
	ДетальнаяИнформация = Неопределено;
	ПараметрыЗапроса.Свойство("ДетальнаяИнформация", ДетальнаяИнформация);  
	ДетальнаяИнформация = СтрокаВБулево(ДетальнаяИнформация);
	
	РезультатЗапросаШапкиРеализация = ЗапросПоШапкеРеализация.Выполнить(); 
	
	Если НЕ РезультатЗапросаШапкиРеализация.Пустой() Тогда            
		
		ВыборкаРезультата = РезультатЗапросаШапкиРеализация.Выбрать();  
		                                                
		СтрокаПолей = ПолучитьПоляСтруктурыВыходныхПараметров(СоответствиеПолейСервис_PM_6051_DOC_FOR_PORTAL());

		ДанныеДокумента = Новый Структура(СтрокаПолей);
		
		Пока ВыборкаРезультата.Следующий()Цикл                      
			
			ЗаполнитьЗначенияСвойств(ДанныеДокумента, ВыборкаРезультата);
			
			ДанныеДокумента.ИдентификаторДокумента   = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());				
			ДанныеДокумента.ДатаДоставки 			= Формат(ВыборкаРезультата.ДатаДокумента, "ДФ=dd.MM.yyyy");
			
			Если Не ДокументСФКлиента.Пустая() Тогда 
										
				НомерНаПечатьСтрокой = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСФКлиента,,, Истина);  
				
				ДанныеДокумента.НомерДокумента 	= НомерНаПечатьСтрокой;						
				ДанныеДокумента.Флаг 			= 1; 
				
			КонецЕсли;	
			
			Если КонецДня(ВыборкаРезультата.Ссылка.Дата) = КонецДня(ТекущаяДата()) И ВыборкаРезультата.Ссылка.ТаксиДоставка И НЕ ВыборкаРезультата.Грузомест = 0 Тогда
				ДанныеДокумента.СтатусОтгрузки = "Такси доставка (" + СокрЛП(ВыборкаРезультата.Грузомест) + " гр.мест)";
			КонецЕсли;	
			        
		КонецЦикла;	
		
	КонецЕсли;

	Если Не ДетальнаяИнформация Тогда   
		
		МассивСтрок.Добавить(ДанныеДокумента);
		
		СтруктураВозврата.Данные 	= МассивСтрок;
		СтруктураВозврата.Результат = Истина;  
		
		Возврат СтруктураВозврата; 
		
	КонецЕсли;   
	
	
	ЗапросТовары = Новый Запрос;
	ЗапросТовары.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.Номенклатура.Код КАК КодТовара,
	|	РеализацияТоваровУслугТовары.Номенклатура.Родитель.Наименование КАК Производитель,
	|	РеализацияТоваровУслугТовары.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	РеализацияТоваровУслугТовары.Номенклатура.Наименование КАК НаименованиеТовара,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Коэффициент КАК Коэффициент,
	|	РеализацияТоваровУслугТовары.Количество КАК Количество,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,   
	|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Количество * РеализацияТоваровУслугТовары.ЕдиницаИзмерения.Коэффициент КАК Число(15,3)) КАК КоличествоЕдИзм,
	|	РеализацияТоваровУслугТовары.Цена КАК Цена,
	|	РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	|	"""" КАК Комментарий
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";
	
	ЗапросТовары.УстановитьПараметр("Ссылка", ДокументРеализация);
	
	СтрокаПолей = "НомерСтроки,КодТовара,Производитель,КодПроизводителя,НаименованиеТовара,Коэффициент,Количество,ЕдиницаИзмерения,КоличествоЕдИзм,Цена,Сумма,Комментарий";
	МассивТовары = Новый Массив;
	
	ВыборкаРезультата = ЗапросТовары.Выполнить().Выбрать();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		
		ДанныеТоваров = Новый Структура(СтрокаПолей);
		ЗаполнитьЗначенияСвойств(ДанныеТоваров, ВыборкаРезультата);
		МассивТовары.Добавить(ДанныеТоваров);
		
	КонецЦикла;	 
	
	ДанныеДокумента.Вставить("Товары", МассивТовары);
	
	СтруктураВозврата.Данные = ДанныеДокумента;
	СтруктураВозврата.Результат = Истина;  
	
	Возврат СтруктураВозврата;     
	
КонецФункции


///////////////////payments_docsales///////////////////  
Функция ПолучитьСписокРеализацийДляОплатыСервер(ПараметрыСоответсвие) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	ПараметрыЗапроса 	= ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	//ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыЗапроса);  
	//
	//ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", 
	//УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. ПолучитьСписокРеализацийДляОплаты. " + ПараметрыЗапросаСтр);
	
	
	СтруктураВозврата 	= Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ИдентификаторКонтрагента) Тогда
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
		"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		СтруктураВозврата.Сообщение = "Список реализаций для оплаты не получен. Причина: не задан параметр ИдентификторКонтрагента";
		Возврат СтруктураВозврата;

	КонецЕсли;  
	
	Если Не ПараметрыЗапроса.Свойство("ДатаНачала") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаНачала) Тогда
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
		"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		СтруктураВозврата.Сообщение = "Список реализаций для оплаты не получен. Причина: не задан параметр ДатаНачала";
		Возврат СтруктураВозврата;

	КонецЕсли;   
	
	Если Не ПараметрыЗапроса.Свойство("ДатаОкончания") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаОкончания) Тогда
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
		"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		СтруктураВозврата.Сообщение = "Список реализаций для оплаты не получен. Причина: не задан параметр ДатаОкончания";
		Возврат СтруктураВозврата;

	КонецЕсли;    
	
	ИдентификаторКонтрагента = ПараметрыЗапроса.ИдентификаторКонтрагента; 
	ДатаНачала	  		     = СтрокаВДату(ПараметрыЗапроса.ДатаНачала);
	ДатаОкончания            = СтрокаВДату(ПараметрыЗапроса.ДатаОкончания);
	
	Артикул = ""; 
	НомерДокумента = "";
	
	Если ПараметрыЗапроса.Свойство("Артикул") Тогда    
		Артикул = ПараметрыЗапроса.Артикул;
	КонецЕсли;

	Если ПараметрыЗапроса.Свойство("НомерДокумента") Тогда    
		НомерДокумента = ПараметрыЗапроса.НомерДокумента;
	КонецЕсли;
	
	ПараметрыЗапуска = "ИдентификаторКонтрагента: " + ИдентификаторКонтрагента + "ДатаНачала: " + ДатаНачала + "ДатаОкончания: " + ДатаОкончания +
	"Артикул: " + Артикул + "НомерДокумента: " + НомерДокумента;     
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. Параметры:" 
	+ Символы.ПС + ПараметрыЗапуска);

	
	Если Не ЗначениеЗаполнено(ИдентификаторКонтрагента) Тогда		
		
		СтруктураВозврата.Сообщение = "Список реализаций для оплаты не получен. Причина: Не заполнен ИдентификаторКонтрагента"; 
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
		"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИдентификаторКонтрагента);	
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда		
		
		СтруктураВозврата.Сообщение = "Список реализаций для оплаты не получен. Причина: Не был найден филиал по идентификатору: " + ИдентификаторКонтрагента;
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
		"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат СтруктураВозврата;		
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг) КАК Реализация,
	|	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	|	МАКСИМУМ(ПродажиОбороты.ЗаказПокупателя.ДатаОтгрузки) КАК ДатаДоставки,
	|	МАКСИМУМ(СчетФактураВыданный.Ссылка) КАК СчетФактура
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			,
	|			ДокументПродажи ССЫЛКА Документ.РеализацияТоваровУслуг
	|				И ВЫРАЗИТЬ(ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Грузополучатель = &Филиал
	|				И (ВЫРАЗИТЬ(ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|				И ((ВЫРАЗИТЬ(&Артикул КАК СТРОКА(20))) = """"
	|					ИЛИ Номенклатура.НормализованныйКод ПОДОБНО &Артикул)) КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументОснование
	|			И (СчетФактураВыданный.Проведен)
	|ГДЕ
	|	((ВЫРАЗИТЬ(&Номер КАК СТРОКА(20))) = """"
	|			ИЛИ ВЫБОР
	|				КОГДА СчетФактураВыданный.Номер ЕСТЬ NULL
	|					ТОГДА ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг).Номер ПОДОБНО &Номер
	|				ИНАЧЕ СчетФактураВыданный.Номер ПОДОБНО &Номер
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) КАК ИтогоКОплатеПоОстаткам,
	|	ВТ_Реализации.Реализация.СуммаДокумента КАК ИтогоКОплате,
	|	ВТ_Реализации.Реализация.Дата КАК Дата,
	|	ВТ_Реализации.Реализация.ВалютаДокумента.Наименование КАК Валюта,
	|	ВТ_Реализации.Реализация.Ссылка КАК Реализация,
	|	ЕСТЬNULL(ВТ_Реализации.Реализация.Водитель.Наименование, """") КАК Водитель,
	|	ВТ_Реализации.Реализация.Грузополучатель.Наименование КАК Филиал,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) > 0
	|				И ЕСТЬNULL(СвойствоЗаблокированоДляОплаты.Значение, ЛОЖЬ) = ЛОЖЬ
	|				И ВТ_Реализации.Реализация.Организация = &ОсновнаяОрганизация
	|				И &ВключенаОпцияОплатыКартой
	|				И ВТ_Реализации.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|				И НЕ ЕСТЬNULL(СвойствоСтатусДоставки.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВозможностьОплаты,
	|	ЕСТЬNULL(СвойствоСтатусДоставки.Значение, """") КАК Статус,
	|	ВТ_Реализации.Реализация.СуммаДокумента КАК Сумма,
	|	ВТ_Реализации.СчетФактура КАК СчетФактура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0) <= 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТ_Реализации.Сумма - ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток, 0)
	|	КОНЕЦ КАК Аванс,
	|	ВЫБОР
	|		КОГДА ВТ_Реализации.ДатаДоставки = &ПустаяДата
	|			ТОГДА ВТ_Реализации.Реализация.Дата
	|		ИНАЧЕ ВТ_Реализации.ДатаДоставки
	|	КОНЕЦ КАК ДатаДоставки,
	|	ЕСТЬNULL(ТелефонВодителя.Представление, """") КАК ТелефонВодителя,
	|	ВТ_Реализации.Реализация.Контрагент.Наименование КАК Контрагент
	|ИЗ
	|	ВТ_Реализации КАК ВТ_Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|				,
	|				ДокументРасчетовСКонтрагентом ССЫЛКА Документ.РеализацияТоваровУслуг
	|					И ВЫРАЗИТЬ(ДокументРасчетовСКонтрагентом КАК Документ.РеализацияТоваровУслуг).Грузополучатель = &Филиал) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|		ПО ВТ_Реализации.Реализация = ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСтатусДоставки
	|		ПО (СвойствоСтатусДоставки.Свойство = &СвойствоДоставки)
	|			И ВТ_Реализации.Реализация = СвойствоСтатусДоставки.Объект
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоЗаблокированоДляОплаты
	|		ПО ВТ_Реализации.Реализация = СвойствоЗаблокированоДляОплаты.Объект
	|			И (СвойствоЗаблокированоДляОплаты.Свойство = &СвойствоЗаблокировано)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонВодителя
	|		ПО ВТ_Реализации.Реализация.Водитель = ТелефонВодителя.Объект
	|			И (ТелефонВодителя.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонВодителя.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура.Родитель.Наименование КАК Бренд,
	|	ПродажиОбороты.Номенклатура.КодПроизводителя КАК Артикул,
	|	ПродажиОбороты.Номенклатура.Наименование КАК Наименование,
	|	ПродажиОбороты.КоличествоОборот КАК Количество,
	|	ПродажиОбороты.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот КАК Цена,
	|	ПродажиОбороты.СтоимостьОборот КАК Сумма,
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.РеализацияТоваровУслуг) КАК Реализация
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			ДокументПродажи В
	|					(ВЫБРАТЬ
	|						ВТ_Реализации.Реализация
	|					ИЗ
	|						ВТ_Реализации)
	|				И ((ВЫРАЗИТЬ(&Артикул КАК СТРОКА(20))) = """"
	|					ИЛИ Номенклатура.НормализованныйКод ПОДОБНО &Артикул)) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг";
	
	Запрос.УстановитьПараметр("Филиал", Контрагент);
	Запрос.УстановитьПараметр("СвойствоДоставки", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	Запрос.УстановитьПараметр("СвойствоЗаблокировано", ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ОсновнаяОрганизация", Константы.ОсновнаяОрганизация.Получить());
	Запрос.УстановитьПараметр("ВключенаОпцияОплатыКартой", Константы.ИспользоватьОплатыКартой.Получить());
	
	ОчищенныйКодПроизводителя = "";
	СтрокаПроверки = СокрЛП(Артикул);
	Длина = СтрДлина(СтрокаПроверки);
	
	Для а = 1 По Длина Цикл
		
		Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
		КонецЕсли; 
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("Артикул",?(СокрЛП(ОчищенныйКодПроизводителя) <> "", "%" + ОчищенныйКодПроизводителя + "%", ""));
	Запрос.УстановитьПараметр("Номер", ?(СокрЛП(НомерДокумента) <> "", "%" + СокрЛП(НомерДокумента) + "%", ""));
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	МассивДанных = Новый Массив;
	
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ТаблицаШапок = Пакет[1].Выгрузить();
	ТаблицаТоваров = Пакет[2].Выгрузить();
	
	Для каждого СтрШапка ИЗ ТаблицаШапок Цикл
		
		СтрТовары = ТаблицаТоваров.НайтиСтроки(Новый Структура("Реализация", СтрШапка.Реализация));
		
		СтруктураДанных = Новый Структура("ИД, Дата, Номер, Валюта, Сумма, ИтогоКОплате, Аванс, Водитель, ТелефонВодителя, Контрагент, Филиал, ДатаДоставки, ВозможностьОплаты, Статус, Товары");
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрШапка);
		
		СтруктураДанных.ИД = Строка(СтрШапка.Реализация.УникальныйИдентификатор());
		
		Если ЗначениеЗаполнено(СтруктураДанных.Статус) Тогда
			
			Если СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварДоставляется Тогда
				СтруктураДанных.Статус = "Доставляется";
			ИначеЕсли СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварНеДоставлен Тогда
				СтруктураДанных.Статус = "Доставляется";
			ИначеЕсли СтруктураДанных.Статус = Перечисления.СтатусыДоставки.ТоварПередан Тогда
				СтруктураДанных.Статус = "Отгружен";
			Иначе
				СтруктураДанных.Статус = "";
			КонецЕсли;
			
		Иначе
			СтруктураДанных.Статус = "Доставляется";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрШапка.СчетФактура) Тогда
			СтруктураДанных.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СтрШапка.СчетФактура);
		Иначе
			СтруктураДанных.Номер = ОбщегоНазначения.ПолучитьНомерНаПечать(СтрШапка.Реализация);
		КонецЕсли;
		
		МассивТоваров = Новый Массив;
		
		Для каждого СтрТовар ИЗ СтрТовары Цикл
			
			СтруктураТовара = Новый Структура("Бренд, Артикул, Наименование, Количество, ЕдиницаИзмерения, Цена, Сумма");
			
			ЗаполнитьЗначенияСвойств(СтруктураТовара, СтрТовар);
			
			МассивТоваров.Добавить(СтруктураТовара);
			
		КонецЦикла;
		
		СтруктураДанных.Товары = МассивТоваров;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	СтруктураВозврата.Данные = МассивДанных;
	СтруктураВозврата.Результат = Истина;
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsales.ПолучитьСписокРеализацийДляОплаты", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис OnlineStore.payments_docsales. ПолучитьСписокРеализацийДляОплаты. " 
	+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат СтруктураВозврата;
	
КонецФункции 


///////////////////payments_docsale_summ///////////////////  
Функция ПолучитьСуммуДляОплатыПоРеализацииСервер(ПараметрыСоответсвие) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();  
	ПараметрыСтруктура 	= ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);  
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsale_summ.ПолучитьСуммуДляОплатыПоРеализации", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. ПолучитьСуммуДляОплатыПоРеализации. " + ПараметрыЗапросаСтр);
	
	СтруктураВозврата = ПолучитьСуммуДляОплатыПоРеализации(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsale_summ.ПолучитьСуммуДляОплатыПоРеализации", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ПолучитьСуммуДляОплатыПоРеализации "  
	+ ". Время ответа: " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0"));
	//+ " м.сек." + ПараметрыЗапросаСтр);
		
	Возврат СтруктураВозврата;
	
КонецФункции    

Функция ПолучитьСуммуДляОплатыПоРеализации(ПараметрыЗапроса)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	СтруктураВозврата = Новый Структура("Результат, Сумма, Сообщение", Ложь, 0, "");
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторДокумента") Или ПустаяСтрока(ПараметрыЗапроса.ИдентификаторДокумента) Тогда
		
		СтруктураВозврата.Сообщение = "Сумма для оплаты не получена. Причина: не задан параметр запроса ИдентификаторДокумента";
		Возврат СтруктураВозврата;
	
	КонецЕсли; 
	
	ИдентификаторДокумента = СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента); 
	
	ДокументРеализация = ПолучитьДокументПоИдентификатору("РеализацияТоваровУслуг", ИдентификаторДокумента);
	
	Если ДокументРеализация.Пустая() Тогда
	
		СтруктураВозврата.Сообщение = "Сумма для оплаты не получена. Причина: не найдена реализация с идентификатором " + ИдентификаторДокумента;
		Возврат СтруктураВозврата;  
		
	КонецЕсли;

	Если НЕ ПроверитьРеализациюНаВозможностьОплаты(ДокументРеализация) Тогда
		
		СтруктураВозврата.Сообщение = "Сумма для оплаты не получена. Причина: Документ реализация не актуален"; 
		Возврат СтруктураВозврата;    
		
	КонецЕсли; 
	
	СтруктураВозврата.Сумма = ДокументРеализация.СуммаДокумента;
	СтруктураВозврата.Результат = Истина;

	Возврат СтруктураВозврата;     
	
КонецФункции

Функция ПроверитьРеализациюНаВозможностьОплаты(ПромРеализация)
	
	Если НЕ ПромРеализация.Проведен	Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	ЗапросСтатусаДоставки = Новый Запрос;
	ЗапросСтатусаДоставки.УстановитьПараметр("Ссылка", ПромРеализация); 
	ЗапросСтатусаДоставки.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоСтатусДоставки
	|		ПО РеализацияТоваровУслуг.Ссылка = СвойствоСтатусДоставки.Объект
	|			И (СвойствоСтатусДоставки.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СвойствоЗаблокирован
	|		ПО РеализацияТоваровУслуг.Ссылка = СвойствоЗаблокирован.Объект
	|			И (СвойствоЗаблокирован.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты))
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка = &Ссылка
	|	И НЕ ЕСТЬNULL(СвойствоСтатусДоставки.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
	|	И ЕСТЬNULL(СвойствоЗаблокирован.Значение, ЛОЖЬ) = ЛОЖЬ";
	
	Возврат НЕ ЗапросСтатусаДоставки.Выполнить().Пустой(); 

КонецФункции


///////////////////order_create///////////////////
Функция СозданиеЗаказаСервер(СтрокаJSON, ВернутьJSON = Истина) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_create.СоздатьЗаказ", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. СоздатьЗаказ");
	
	ПараметрыСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	
	Если ПараметрыСтруктура.Свойство("Шапка") И ПараметрыСтруктура.Шапка.Свойство("ИдентификаторЗаказа") И ЗначениеЗаполнено(ПараметрыСтруктура.Шапка.ИдентификаторЗаказа) Тогда
		
		ИдентификаторЗаказа = Число(ПараметрыСтруктура.Шапка.ИдентификаторЗаказа);
		//СсылкаЗаказа	 	= Документы.ЗаказПокупателя.НайтиПоРеквизиту("IDЗаказаПортал", ИдентификаторЗаказа);        
		СсылкаЗаказа	 	= ЕстьТакойЗаказ(ИдентификаторЗаказа, ПараметрыСтруктура.Шапка.ИдентификаторСклад);
		
		Если СсылкаЗаказа.Пустая() Тогда
			СтруктураВозврата = СоздатьЗаказСПортала(ПараметрыСтруктура);
		Иначе
			
			Данные = Новый Структура("НомерЗаказа, Статус", СсылкаЗаказа.Номер, "0"); 
			
			СтруктураВозврата.Вставить("Данные", 	Данные); 
			СтруктураВозврата.Вставить("Результат", Ложь); 
			СтруктураВозврата.Вставить("Сообщение", "В базе данных уже есть Созданный Заказ Покупателю с ID: " + СокрЛП(СсылкаЗаказа.Номер));
			
		КонецЕсли;
		
		ДанныеВозврата = ?(ВернутьJSON, ОбщегоНазначения.ВернутьJSON(СтруктураВозврата), СтруктураВозврата);
		
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_create.СоздатьЗаказ", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Завершение. СоздатьЗаказ. " 
	+ Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
	
	Возврат ДанныеВозврата;
	
КонецФункции

Функция СоздатьЗаказСПортала(ПараметрыСтруктура) Экспорт 
		
	EMailЗаказ 				= ?(ПараметрыСтруктура.Свойство("EMailЗаказ"), ПараметрыСтруктура.EMailЗаказ, Ложь);
	
	Если EMailЗаказ Тогда
		ЗаписьЖурналаРегистрации("Запрос данных с эл почты", УровеньЖурналаРегистрации.Информация,,, "TransportOrderFromPortal начало ");	
	КонецЕсли;
	
	СтруктураВозврата 	= Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	ДанныеВозврата 		= Новый Структура("НомерЗаказа, Статус", "", "3");
	
	ТекДата 			= ТекущаяДата();
	Шапка				= ПараметрыСтруктура.Шапка;
	
	Если EMailЗаказ Тогда
		НеСозданныйЗаказПокупателей = Справочники.НеСозданныеЗаказыПокупателей.НайтиПоРеквизиту("ИдентификаторСообщения", СокрЛП(Шапка.ИдентификаторСообщения)); 
	Иначе		
		//НеСозданныйЗаказПокупателей = Справочники.НеСозданныеЗаказыПокупателей.НайтиПоКоду(СокрЛП(Шапка.ИдентификаторЗаказа));
		НеСозданныйЗаказПокупателей = ЕстьТакойЗаказВНесозданных(Шапка.ИдентификаторЗаказа, Шапка.ИдентификаторСклад);
	КонецЕсли;	
	
	Если НеСозданныйЗаказПокупателей <> Справочники.НеСозданныеЗаказыПокупателей.ПустаяСсылка() Тогда 

		Статус = ?(Константы.База.Получить() = Перечисления.НазваниеБазы.Казань, "1", "3");
		
		Если EMailЗаказ Тогда 
			
			ТекстСообщения 	= "Письмо " + СокрЛП(Шапка.ИдентификаторСообщения) + " было загружено ранее (см. справочник Несозданные заказы)";
			ТекстИнформации = "EMail-заказ";
			
		Иначе 
			
			ТекстСообщения 	= "В базе данных уже есть Несозданный заказ с ID " + СокрЛП(Шапка.ИдентификаторЗаказа) + ". На портал возвращается статус " + Статус + ".";	
			ТекстИнформации = "Оформление заказа с портала";
			
		КонецЕсли;
		
		ДанныеВозврата.Вставить("Статус", Статус);
		ЗаписьЖурналаРегистрации(ТекстИнформации, ?(EMailЗаказ, УровеньЖурналаРегистрации.Предупреждение, УровеньЖурналаРегистрации.Информация),,, ТекстСообщения);   
		
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Данные", 	ДанныеВозврата);
		СтруктураВозврата.Вставить("Сообщение", ТекстСообщения);
		
		Возврат СтруктураВозврата;
		
	Иначе
		
		НовыйДокЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
		НовыйДокЗаказ.Дата 		= ТекДата;
		НовыйДокЗаказ.Портал 	= Истина; 	
		ДопИнформация 			= "";
		
		НеСоздаватьНоменклатуруВУТ10 	 = Константы.НеСоздаватьНоменклатуруВУТ10.Получить();
		ИспользоватьДатуОтгрузкиИзЗаказа = Константы.ИспользоватьДатуОтгрузкиИзЗаказа.Получить();
		
		НеСозданныйЗП = Справочники.НеСозданныеЗаказыПокупателей.СоздатьЭлемент();
		НеСозданныйЗП.Дата 			= ТекДата;
		НеСозданныйЗП.Addres 		= Шапка.ЮрАдрес;
		НеСозданныйЗП.AddresFakt 	= СокрЛП(Шапка.ФактАдрес);
		НеСозданныйЗП.AddresFaktID 	= Шапка.ИдентификаторФактАдрес;
		НеСозданныйЗП.Comment 		= Шапка.Комментарий;
		НеСозданныйЗП.DogovorID 	= Шапка.ИдентификаторДоговора;	
		НеСозданныйЗП.FirmID 		= Шапка.ИдентификаторОрганизация;
		НеСозданныйЗП.KontragentID 	= Шапка.ИдентификаторКонтрагента;
		НеСозданныйЗП.FilialID 		= Шапка.ИдентификаторФилиала;
		НеСозданныйЗП.TipDost 		= Шапка.ТипДоставки;
		НеСозданныйЗП.ValutaID 		= СокрЛП(Шапка.ИдентификаторВалюта);
		НеСозданныйЗП.Код 			= СокрЛП(Шапка.ИдентификаторЗаказа);
		НеСозданныйЗП.Наименование 	= Шапка.НаименованиеЗаказаПортала;
		НеСозданныйЗП.INN 			= СокрЛП(Шапка.ИНН);
		НеСозданныйЗП.KPP 			= СокрЛП(Шапка.КПП);
		НеСозданныйЗП.SkladID 		= СокрЛП(Шапка.ИдентификаторСклад);
		//НеСозданныйЗП.PaymentType 	= СокрЛП(Шапка.ТипОплаты);   
		
		//+Белов А. 18.03.2025 #UT10-5136
		НеСозданныйЗП.IDПрайсЛиста = Шапка.ИдентификаторСклад;
		//-Белов А. 18.03.2025 #UT10-5136		
		
		ДатаДоставкиОтгрузки = Неопределено;   
		
		Если ИспользоватьДатуОтгрузкиИзЗаказа И НЕ EMailЗаказ Тогда   
			
			Если Шапка.Свойство("ДатаДоставки") И Шапка.ДатаДоставки <> Неопределено Тогда
				
				Если СтрДлина(Шапка.ДатаДоставки) = 19 Тогда     					
					ДатаДоставкиОтгрузки = ПреобразоватьДатуМДМ(Шапка.ДатаДоставки);					
				Иначе      
					ДатаДоставкиОтгрузки = ТекДата;
				КонецЕсли; 
				
			КонецЕсли; 
			
		ИначеЕсли ИспользоватьДатуОтгрузкиИзЗаказа И EMailЗаказ Тогда 
			ДатаДоставкиОтгрузки = ТекДата;
		КонецЕсли;	
		
		//+Белов А. 05.02.2026 #UT10-5641		
		////+Кабанов А.В. 19.05.2025 # UT10-5247
		//ЧасовойПоясФилиала   = Константы.ЧасовойПоясФилиала.Получить();
		//ДатаДоставкиОтгрузки = ДатаДоставкиОтгрузки - ЧасовойПоясФилиала*3600 ;				
		//+Кабанов А.В. 19.05.2025 # UT10-5247 
		//-Белов А. 05.02.2026 #UT10-5641
		
		НеСозданныйЗП.Dostavka 		= ДатаДоставкиОтгрузки;
		НовыйДокЗаказ.ДатаОтгрузки 	= ДатаДоставкиОтгрузки;     
		
		Контрагент 			= МСКWEB.НайтиКонтрагентаПоКодуИзПортала(СокрЛП(Шапка.ИдентификаторКонтрагента));
		ФилиалКонтрагента 	= МСКWEB.НайтиФилиалПоКодуИзПортала(СокрЛП(Шапка.ИдентификаторФилиала));
		
		Если EMailЗаказ Тогда 
			
			Если Не ЗначениеЗаполнено(Контрагент) И ЗначениеЗаполнено(Шапка.Контрагент) Тогда
				Контрагент = Шапка.Контрагент;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ФилиалКонтрагента) И ЗначениеЗаполнено(Шапка.ФилиалКонтрагента) Тогда
				ФилиалКонтрагента = Шапка.ФилиалКонтрагента;
			КонецЕсли;
			
			НеСозданныйЗП.OrderSource 				= 6;
			НеСозданныйЗП.EMailЗаказ 				= Истина;		
			НеСозданныйЗП.ИдентификаторСообщения 	= Шапка.ИдентификаторСообщения;  
			СтрПараметры = 
			"OrderID_ = '"	    + СокрЛП(Шапка.ИдентификаторЗаказа) + "';" +
			"Addres_ = '"	    + СокрЛП(Шапка.ЮрАдрес) + "';" +
			"AddresFakt_ = '"	+ СокрЛП(Шапка.ФактАдрес) + "';" +
			"DogovorID_ = '"	+ Строка(Шапка.ИдентификаторДоговора) + "';" +
			"FirmID_ = '"		+ Строка(Шапка.ИдентификаторОрганизация) + "';" +
			"KontragentID_ = '"	+ Строка(Шапка.ИдентификаторКонтрагента) + "';" +
			"FilialID_ = '"		+ Строка(Шапка.ИдентификаторФилиала) + "';" +
			"TipDost_ = '"		+ Строка(Шапка.ТипДоставки) + "';" +
			"INN_ = '"		    + СокрЛП(Шапка.ИНН) + "';" +
			"SkladID_ = '"		+ СокрЛП(Шапка.ИдентификаторСклад) + "';" +
			//"PaymentType_ = '"	+ СокрЛП(Шапка.ТипОплаты) + "';";
			
			СтрПараметры = СтрПараметры + "ИД_Сообщения_ = '" + СокрЛП(Шапка.ИдентификаторСообщения) + "';";  	
			ЗаписьЖурналаРегистрации("Оформление заказа через EMail", УровеньЖурналаРегистрации.Информация,,, "TransportOrderFromPortal " + Символы.ПС + СтрПараметры);	
			
		Иначе
			
			Если Шапка.Свойство("КодИсточника") И Шапка.КодИсточника <> Неопределено Тогда 
				НеСозданныйЗП.OrderSource = СокрЛП(Шапка.КодИсточника);
			КонецЕсли; 
			
		КонецЕсли;
		
		Причина = "";
		
		Если ФилиалКонтрагента <> Неопределено Тогда
			НовыйДокЗаказ.Контрагент = ФилиалКонтрагента;
		ИначеЕсли Контрагент <> Неопределено Тогда
			НовыйДокЗаказ.Контрагент = Контрагент;
		Иначе 
			
			Причина = Причина + "Не найден клиент";	
			
			Если Не EMailЗаказ Тогда
				ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,, "Не найдены контрагент по ID " + СокрЛП(Шапка.ИдентификаторКонтрагента) + " и филиал по ID " + СокрЛП(Шапка.ИдентификаторФилиала) + ".");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент)
			И ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент)
			И НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент <> НовыйДокЗаказ.Контрагент Тогда   
			
			НовыйДокЗаказ.Грузополучатель 	= НовыйДокЗаказ.Контрагент ;
			НовыйДокЗаказ.Контрагент 		= НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент ;  
			
		ИначеЕсли Не EMailЗаказ или ЗначениеЗаполнено(ФилиалКонтрагента) Тогда 
			НовыйДокЗаказ.Грузополучатель = НовыйДокЗаказ.Контрагент;		
		КонецЕсли;
		
		////////////////////Заполнение способа доставки///////////////////////////
		//Значения "TipDost" из портала:
		//0 - только резерв
		//1 - самовывоз
		//2 - экспресс доставка
		//3 - трансп компания
		//4 - стандартная доставка
		//5 - такси доставка 	
		ТипДоставки = Число(Шапка.ТипДоставки);
		Если ТипДоставки = 1 ИЛИ ТипДоставки = 5 Тогда
			
			Если ТипДоставки = 5 И Константы.ТаксиДоставка.Получить() Тогда      
				
				НовыйДокЗаказ.УпаковыватьСамовывоз = Истина;
				НовыйДокЗаказ.ТаксиДоставка        = Истина; 
				
			КонецЕсли;
			
			НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;    
			
		ИначеЕсли ТипДоставки = 2 ИЛИ ТипДоставки = 3 ИЛИ ТипДоставки = 4 Тогда 	
			НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка; 	
		ИначеЕсли ТипДоставки = 0 И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) Тогда
			
			НовыйДокЗаказ.ТолькоРезерв  = Истина;   
			
			Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель.СпособДоставки) Тогда
				НовыйДокЗаказ.СпособДоставки = НовыйДокЗаказ.Грузополучатель.СпособДоставки;
			Иначе      
				
				Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель.МаршрутДоставки) Тогда
					НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка;
				Иначе
					НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;
				КонецЕсли;
				
			КонецЕсли;	
			
		Иначе	
			Причина = ДополнитьТекстОписания(Причина, "Не указан способ доставки");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) Тогда
			Причина = ДополнитьТекстОписания(Причина, "Не заполнен филиал контрагента (выберите из справочника)");	
		КонецЕсли;
		
		Если НЕ EMailЗаказ Тогда 
			
			Если Шапка.Свойство("КодИсточника") И Шапка.КодИсточника <> Неопределено Тогда
				КодИсточника = Число(Шапка.КодИсточника);
			Иначе
				КодИсточника = 0;
			КонецЕсли;    
			
		Иначе        
			
			КодИсточника = 6; 
			
			Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) И НовыйДокЗаказ.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
				
				НеСозданныйЗП.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Истина;
				НеСозданныйЗП.SkladID = "0";
				Причина = ДополнитьТекстОписания(Причина, "Обособленная отгрузка ГМ , выбор склада");
				
			КонецЕсли;
			
		КонецЕсли;             
		
		НовыйДокЗаказ.ИсточникЗаказа =  Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", КодИсточника); 
		
		Если Константы.ЗагружатьДоговораСПортала.Получить() Тогда
			
			СтруктураДоговора = МСКWEB.НайтиДоговорПоКодуИзПортала(СокрЛП(Шапка.ИдентификаторДоговора), НовыйДокЗаказ.СпособДоставки);
			Договор = СтруктураДоговора.ДоговорКонтрагента;
			НовыйДокЗаказ.ОплатаНаличными = СтруктураДоговора.ОплатаНаличными;
			
			Если СтрДлина(СокрЛП(Шапка.ИдентификаторДоговора)) > 36 Тогда
				
				МассивСтр = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Шапка.ИдентификаторДоговора), "|");
				
				Если МассивСтр.Количество() > 3 Тогда
					
					КлючСтрокиУсловий = МассивСтр[3];
					
					Попытка
						НовыйДокЗаказ.КлючСтрокиУсловий = Число(КлючСтрокиУсловий);
					Исключение
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе     
			
			Если EMailЗаказ Тогда
				Договор = ?(ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор), НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор, НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента);
			Иначе 
				Договор = НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента;
			КонецЕсли;        
			
			НовыйДокЗаказ.ОплатаНаличными = Договор.ОплатаПоДоговоруНаличными;
			
		КонецЕсли;        
		
		Если Контрагент = Константы.ОсновнойПоставщик.Получить() 
			И (НовыйДокЗаказ.ИсточникЗаказа.КодИсточника = 2 
			ИЛИ НовыйДокЗаказ.ИсточникЗаказа.КодИсточника = 3) Тогда 
			
			ПромДоговорАПИ = Константы.ДоговорДляЗаказаЧерезАПИДляОсновногоПоставщика.Получить(); 
			
			Если НЕ ПромДоговорАПИ.Пустая() Тогда
				Договор = ПромДоговорАПИ;
			КонецЕсли;	
			
		КонецЕсли; 
		
		НовыйДокЗаказ.ДоговорКонтрагента = Договор;
		
		Если ЗначениеЗаполнено(Договор) Тогда   
			
			НовыйДокЗаказ.ВалютаДокумента 	= Договор.ВалютаВзаиморасчетов;
			НеСозданныйЗП.ТипЦенЗаказ 		= Договор.ТипЦен; 
			
		Иначе    
			
			Причина = ДополнитьТекстОписания(Причина, "Не найден основной договор с покупателем"); 
			
			Если EMailЗаказ Тогда
				ТекстОписания = "Оформление заказа через EMail";
			Иначе
				ТекстОписания = "Оформление заказа с портала";
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(ТекстОписания, УровеньЖурналаРегистрации.Предупреждение,,, "Не найден договор при создании Заказа");
			
		КонецЕсли;  
		
		НовыйДокЗаказ.Комментарий = СокрЛП(Шапка.Комментарий);
		
		Попытка   
			
			НовыйДокЗаказ.IDСклада = Число(СокрЛП(Шапка.ИдентификаторСклад));
			НовыйДокЗаказ.IDСклада_СтороннийСклад = МСК.НайтиСтороннийСкладПоID(НовыйДокЗаказ.IDСклада, Истина);	
			
		Исключение
		КонецПопытки;
		
		ЭтоСтороннийСклад = ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад);
		
		Если НЕ ЭтоСтороннийСклад И ПустойСтороннийСклад(НовыйДокЗаказ)  Тогда//???		
			ЭтоСтороннийСклад = Истина;	 	
		КонецЕсли; 	
		
		НовыйДокЗаказ.IDЗаказаПортал = СокрЛП(Шапка.ИдентификаторЗаказа);	
		
		//+Белов А. 18.03.2025 #UT10-5136
		НовыйДокЗаказ.IDПрайсЛиста = Шапка.ИдентификаторСклад;
		//-Белов А. 18.03.2025 #UT10-5136
		
		//+Белов А. 22.10.2024 UT10-4825#
		Если ЭтоСтороннийСклад И ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда
			НовыйДокЗаказ.IDСклада = НовыйДокЗаказ.IDСклада_СтороннийСклад.IDСклада;		
		КонецЕсли;
		//-Белов А. 22.10.2024 #UT10-4825
		
		Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) И НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала 
			И НЕ Константы.ОформлятьВсеЗаказыСПортала.Получить() Тогда
			
			Если НЕ ЭтоСтороннийСклад Тогда 
				Причина = ДополнитьТекстОписания(Причина, "Не портальная цена; ");
			КонецЕсли;                                               
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Договор) Тогда
			НовыйДокЗаказ.Организация = Договор.Организация;
		Иначе
			
			Если Найти(Причина, "Не найден основной договор с покупателем") = 0 Тогда
				Причина = ДополнитьТекстОписания(Причина,  "Не найден основной договор с покупателем");
			КонецЕсли;
			
		КонецЕсли;
		
		Если СокрЛП(НовыйДокЗаказ.Контрагент.ИНН) = "" Тогда
			
			Если (Константы.База.Получить() = Перечисления.НазваниеБазы.Казань ИЛИ Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж) 
				И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() Тогда 
			Иначе
				Причина = ДополнитьТекстОписания(Причина, "Нет ИНН контрагента");
			КонецЕсли;  
			
		КонецЕсли;
		
		Если (НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель))
			И (НЕ ТипДоставки = 5 ИЛИ (ТипДоставки = 5 И НЕ Константы.ТаксиДоставка.Получить())) Тогда		    
			НовыйДокЗаказ.УпаковыватьСамовывоз = НовыйДокЗаказ.Грузополучатель.УпаковыватьСамовывоз;		
		КонецЕсли;	
		
		//+Белов А. 02.04.2026 #UT10-5784 - заменил НовыйДокЗаказ.мВалютаРегламентированногоУчета на Константы.ВалютаРегламентированногоУчета.Получить() 
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйДокЗаказ, глЗначениеПеременной("глТекущийПользователь"), Константы.ВалютаРегламентированногоУчета.Получить(), "Продажа", Неопределено, Неопределено, НовыйДокЗаказ.мСтруктураПараметровДляПолученияДоговора);
		
		Если ЗначениеЗаполнено(НовыйДокЗаказ.КлючСтрокиУсловий) Тогда
			
			СтрокаСКлючем = НовыйДокЗаказ.ДоговорКонтрагента.Условия.Найти(НовыйДокЗаказ.КлючСтрокиУсловий, "КлючСтроки");
			
			Если СтрокаСКлючем <> Неопределено И ЗначениеЗаполнено(СтрокаСКлючем.ТипЦен) Тогда
				НовыйДокЗаказ.ТипЦен = СтрокаСКлючем.ТипЦен;
			КонецЕсли;
			
		КонецЕсли;
		
		Если НовыйДокЗаказ.ДоговорКонтрагента.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			Причина = ДополнитьТекстОписания(Причина, "Вид основного договора не с покупателем");	
		КонецЕсли;	
		
		НовыйДокЗаказ.УчитыватьНДС 				= Истина;
		НовыйДокЗаказ.СуммаВключаетНДС 			= Истина; 
		//+Белов А. 02.04.2026 #UT10-5784		
		НовыйДокЗаказ.ВалютаДокумента 			= Константы.ВалютаРегламентированногоУчета.Получить();
		//НовыйДокЗаказ.ВалютаДокумента 			= НовыйДокЗаказ.мВалютаРегламентированногоУчета;
		//-Белов А. 02.04.2026 #UT10-5784		
		НовыйДокЗаказ.КратностьВзаиморасчетов 	= 1;
		НовыйДокЗаказ.КурсВзаиморасчетов 		= 1;
		НовыйДокЗаказ.СкладГруппа 				= Константы.ОсновнойСклад.Получить();
		НовыйДокЗаказ.Комментарий   			= СокрЛП(Шапка.Комментарий);   
		
		Если EMailЗаказ Тогда
			
			НеСозданныйЗП.Контрагент 		= НовыйДокЗаказ.Контрагент;
			НеСозданныйЗП.ФилиалКонтрагента = НовыйДокЗаказ.Грузополучатель;
			
		КонецЕсли;
		
		ДокСумма 		= 0;
		СтрокиЗаказа 	= ПараметрыСтруктура.Строки; 
		
		МассивКодовТовара 					= Новый Массив;
		МассивАртикул						= Новый Массив;
		МассивСинонимыПроизводителя 		= Новый Массив; 
		СоответсвиеСинонимыПроизводителей 	= Новый Соответствие;
		
		Для Поиск = 1 по 2 Цикл
			
			Для Каждого СтрокаЗаказа из СтрокиЗаказа Цикл
				
				Если Поиск = 1 Тогда   
					
					ОчищенныйПроизводитель 		= НормализоватьСтроку(СтрокаЗаказа.Родитель);
					ОчищенныйКодПроизводителя 	= НормализоватьСтроку(СтрокаЗаказа.КодПроизводителя, Истина); 
					
					НормализованныйКодТовара	= ОчищенныйПроизводитель + ОчищенныйКодПроизводителя; 
					СинонимПроизводителя		= ВРег(СокрЛП(СтрокаЗаказа.Родитель));
					
					СтрокаЗаказа.Вставить("НормализованныйКодТовара", 	НормализованныйКодТовара);
					СтрокаЗаказа.Вставить("СинонимПроизводителя", 		СинонимПроизводителя); 
					СтрокаЗаказа.Вставить("ОчищенныйКодПроизводителя", 	ОчищенныйКодПроизводителя); 
					
					МассивКодовТовара.Добавить(НормализованныйКодТовара);
					МассивСинонимыПроизводителя.Добавить(СинонимПроизводителя); 
					
					Артикул = СокрЛП(СтрокаЗаказа.Артикул);
					
					Если ЗначениеЗаполнено(Артикул) Тогда 
						МассивАртикул.Добавить(Артикул);
					КонецЕсли;	
					
				ИначеЕсли Поиск = 2 Тогда 
					
					// для вторичного поиска по нормализованному коду от синонима производителя
					ПроизводительТовара = СоответсвиеСинонимыПроизводителей.Получить(СокрЛП(СтрокаЗаказа.Родитель));
					
					Если ПроизводительТовара <> Неопределено Тогда
						
						ОчищенныйПроизводитель 		= НормализоватьСтроку(ПроизводительТовара);
						НормализованныйКодТовара	= ОчищенныйПроизводитель + СтрокаЗаказа.ОчищенныйКодПроизводителя;
						МассивКодовТовара.Добавить(НормализованныйКодТовара);						
						
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;   
			
			Если Поиск = 1 Тогда
				СоответсвиеСинонимыПроизводителей 	= ПолучитьСоответсвиеДанных("РегистрСведений.СинонимыПроизводителей",МассивСинонимыПроизводителя).СоотвествиеДанных_0;
			КонецЕсли;	
				
		КонецЦикла;		
				
		//СоответсвиеНормализованныйКодТовара = ПолучитьСоответсвиеДанных("Номенклатура.НормализованныйКод",МассивКодовТовара).СоотвествиеДанных_0;
		СоответсвиеТоварАртикул 			= ПолучитьСоответсвиеДанных("Номенклатура.Артикул",МассивАртикул).СоотвествиеДанных_0;  
		СоответсвиеНормализованныйКодТовара = ПолучитьСоответсвиеДанных("Номенклатура.НормализованныйКод",МассивКодовТовара).СоотвествиеДанных_0;
		
		Для Каждого стр из СтрокиЗаказа Цикл
			
			НоваяСтрокаНеСозданныйЗП = НеСозданныйЗП.Товары.Добавить();
			НоваяСтрокаНеСозданныйЗП.Articul   = стр.КодПроизводителя;
			НоваяСтрокаНеСозданныйЗП.Brand     = стр.Родитель;
			НоваяСтрокаНеСозданныйЗП.Comment   = стр.Комментарий;
			НоваяСтрокаНеСозданныйЗП.Count     = стр.Количество;
			НоваяСтрокаНеСозданныйЗП.РазрешеноКОтгрузке = стр.Количество;
			НоваяСтрокаНеСозданныйЗП.Name      = стр.Наименование;
			НоваяСтрокаНеСозданныйЗП.NumberInv = стр.Артикул;
			НоваяСтрокаНеСозданныйЗП.Price     = стр.ЦенаКлиента;	
			НоваяСтрокаНеСозданныйЗП.Price_Zak = стр.ЦенаЗакупки;
			НоваяСтрокаНеСозданныйЗП.ПроизводительПоставщика = стр.ПроизводительПоставщика;
			НоваяСтрокаНеСозданныйЗП.Кратность = 1;// По умолчанию кратность ставим равной 1
			
			Артикул = СокрЛП(стр.Артикул);
			Товар = ?(ЗначениеЗаполнено(Артикул), СоответсвиеТоварАртикул.Получить(Артикул), Неопределено);
			
			Если Товар = Неопределено Тогда
				СтрокаПоиска = стр.НормализованныйКодТовара;
				
				Если Не ПустаяСтрока(СтрокаПоиска) Тогда                                                                                                                 
					Товар = СоответсвиеНормализованныйКодТовара.Получить(СтрокаПоиска);
				КонецЕсли;
				
				Если Товар = Неопределено Тогда 
					
					ПроизводительТовара = СоответсвиеСинонимыПроизводителей.Получить(СокрЛП(стр.Родитель));
					
					Если ПроизводительТовара <> Неопределено Тогда
						
						ОчищенныйПроизводитель 		= НормализоватьСтроку(ПроизводительТовара);
						СтрокаПоиска 				= ОчищенныйПроизводитель + стр.ОчищенныйКодПроизводителя;
						
						Если Не ПустаяСтрока(СтрокаПоиска) Тогда 
							
							Товар = СоответсвиеНормализованныйКодТовара.Получить(СтрокаПоиска);
							
							Если Товар = Неопределено Тогда 
								
								Если НеСоздаватьНоменклатуруВУТ10 Тогда  
									
									Товар 	= Неопределено;
									Причина =  ДополнитьТекстОписания(Причина, "Товар : не найден по нормализованному коду: "+ СтрокаПоиска);
									
								Иначе        
									
									Комментарий = "Создана автоматически при загрузке Заказа покупателя с портала";

									Если НЕ СоздатьНоменклатуру(Стр, ПроизводительТовара, Товар, Ложь, Комментарий, НЕ ЭтоСтороннийСклад ИЛИ EMailЗаказ) Тогда
										
										Причина =  ДополнитьТекстОписания(Причина, "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
										Товар 	= Неопределено; 
										
									КонецЕсли;  
									
								КонецЕсли;
								
							КонецЕсли;
						Иначе   
							
							Причина =  ДополнитьТекстОписания(Причина, "Товар не найден" + СтрокаПоиска);
							Товар 	= Неопределено;  
							
						КонецЕсли;
						
					Иначе    
						
						Если НеСоздаватьНоменклатуруВУТ10 Тогда
							
							Товар 	= Неопределено;
							Причина =  ДополнитьТекстОписания(Причина, ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска));
							
						Иначе                         
							
							Комментарий = "Создана автоматически при загрузке Заказа покупателя с портала";
							Если НЕ СоздатьНоменклатуру(Стр, Справочники.Номенклатура.ПустаяСсылка(), Товар, Ложь, Комментарий, НЕ ЭтоСтороннийСклад ИЛИ EMailЗаказ) Тогда
								Причина =  ДополнитьТекстОписания(Причина, ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска));
							КонецЕсли;    
							
						КонецЕсли;
						
					КонецЕсли;							
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Товар = неопределено Тогда	
				
				Если НеСоздаватьНоменклатуруВУТ10 Тогда
					
					НеСозданныйЗП.НеНайденаНоменклатура 			= Истина; 
					НоваяСтрокаНеСозданныйЗП.НеНайденаНоменклатура 	= Истина; 
					
				КонецЕсли;			
				Продолжить;	
				
			ИначеЕсли EMailЗаказ Тогда 
				
				НоваяСтрокаНеСозданныйЗП.NumberInv 	= Товар.Артикул;
				НоваяСтрокаНеСозданныйЗП.Articul 	= Товар.КодПроизводителя;
				НоваяСтрокаНеСозданныйЗП.Name 		= Товар.Наименование;
				НоваяСтрокаНеСозданныйЗП.Brand 		= СокрЛП(Товар.Родитель.Наименование);
				НоваяСтрокаНеСозданныйЗП.Кратность 	= МСК.ПолучитьКратностьНоменклатуры(Товар); 
				
			КонецЕсли;
			
			НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();	
			НоваяСтрока.Номенклатура 	= Товар;
			НоваяСтрока.ЦенаЗакупки 	= стр.ЦенаЗакупки;
			
			СоздаемНоменклатуруСкладаВМДМ = Ложь; 
			
			Если НЕ ЭтоСтороннийСклад Тогда
				СоздаемНоменклатуруСкладаВМДМ = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).СоздаватьНоменклатуруВМДМ;
			КонецЕсли;		   
			
			Если ЭтоСтороннийСклад ИЛИ СоздаемноменклатуруСкладаВМДМ И НЕ EMailЗаказ Тогда 
				НоваяСтрока.ПроизводительПоставщика = стр.ПроизводительПоставщика; 
			КонецЕсли;
			
			//+Гавриленков В. 19.12.2025 #UT10-5598
			//НоваяСтрока.СтавкаНДС 			= Товар.СтавкаНДС;
			НоваяСтрока.СтавкаНДС 			= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(Товар, НовыйДокЗаказ.Дата);
			//-Гавриленков В. 19.12.2025 #UT10-5598
			НоваяСтрока.ЕдиницаИзмерения 	= Товар.ЕдиницаХраненияОстатков;   
			НоваяСтрока.Коэффициент 		= Товар.ЕдиницаХраненияОстатков.Коэффициент;
			НоваяСтрока.Количество 			= Число(СтрЗаменить(СокрЛП(стр.Количество), Символы.НПП, ""));
			НоваяСтрока.Комментарий 		= стр.Комментарий;
			
			Если EMailЗаказ Тогда  
				
				Если НЕ МСК.ПроверкаНоменклатурыНаКратность(Товар,НоваяСтрока.Количество) Тогда    
					
					Причина = ДополнитьТекстОписания(Причина, "Нарушена кратность");
					НоваяСтрокаНеСозданныйЗП.Причина 			= ?(НоваяСтрокаНеСозданныйЗП.Причина = "", НоваяСтрокаНеСозданныйЗП.Причина, НоваяСтрокаНеСозданныйЗП.Причина + ", ") + "Нарушена кратность";
					НоваяСтрокаНеСозданныйЗП.РазрешеноКОтгрузке = 0;  
					
				КонецЕсли;
				
			КонецЕсли;		
			
			Если НЕ НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала ИЛИ ЭтоСтороннийСклад ИЛИ EMailЗаказ Тогда 
				НоваяСтрока.Цена = Число(СтрЗаменить(СокрЛП(стр.ЦенаКлиента), Символы.НПП, ""));
			КонецЕсли;	
			
			СтрСумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
			НоваяСтрока.Сумма = СтрСумма;      
			
			НоваяСтрока.СуммаНДС = УчетНДС.РассчитатьСуммуНДС(НоваяСтрока.Сумма,
																НовыйДокЗаказ.УчитыватьНДС, НовыйДокЗаказ.СуммаВключаетНДС,
																УчетНДС.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));	
			
			ДокСумма = ДокСумма + СтрСумма;
			
		КонецЦикла;                                           	
		
		Если EMailЗаказ И ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) И ЗначениеЗаполнено(НовыйДокЗаказ.ДоговорКонтрагента) Тогда
			
			ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
			ТЗ.Свернуть("Номенклатура,Цена");
			
			Запрос = Новый Запрос;
			Запрос.Текст = ПолучитьТекстЗапросаЦен(); 
			
			Запрос.УстановитьПараметр("ТипЦенЗаказ", НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен);
			Запрос.УстановитьПараметр("ТЗ", ТЗ);
			
			Результат = Запрос.Выполнить().Выгрузить();
			ПроцентОтклонения = НовыйДокЗаказ.Контрагент.EMailЗаказ_КонтролироватьРасхождениеЦенВПроцентах;
			
			Для Каждого СтрРезультата Из Результат Цикл
				
				Отбор = Новый Структура("Articul,NumberInv,Price", СтрРезультата.Номенклатура.КодПроизводителя, СтрРезультата.Номенклатура.Артикул, СтрРезультата.ЦенаКлиента);
				СтрокиНеСоздЗП = НесозданныйЗП.Товары.НайтиСтроки(Отбор);
				
				Если (СтрРезультата.ЦенаКлиента = 0) И ЗначениеЗаполнено(СтрРезультата.ЦенаПоДоговору) Тогда   
					
					СтрокиДок = НовыйДокЗаказ.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрРезультата.Номенклатура));   
					
					Для Каждого СтрДок Из СТрокиДок Цикл
						
						СтрДок.Цена 	= СтрРезультата.ЦенаПоДоговору;
						СтрДок.Сумма 	= СтрДок.Цена * СтрДок.Количество;
						
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, НовыйДокЗаказ);
						
						ДокСумма = НовыйДокЗаказ.Товары.Итог("Сумма");
						
					КонецЦикла;   
					
					Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл
						СтрНеСоздЗП.Price = СтрРезультата.ЦенаПоДоговору;
					КонецЦикла;
					
				Иначе   
					
					СтрПричина 		= "";
					ОтклонениеЦены 	= Ложь;                     
					
					Если СтрРезультата.ЦенаПоДоговору = 0 Тогда  
						
						СтрПричина = "Не задана цена по договору";
						Если Найти(Причина, "Не задана цена по договору") = 0 Тогда
							Причина = ДополнитьТекстОписания(Причина, "Не задана цена по договору для товара(ов)");
						КонецЕсли;            
						
					ИначеЕсли (СтрРезультата.ЦенаКлиента > 0) И (СтрРезультата.ЦенаКлиента < Окр(СтрРезультата.ЦенаПоДоговору * (1 - ПроцентОтклонения / 100), 2)) Тогда
						
						СтрПричина 		= Строка(Окр(СтрРезультата.ЦенаПоДоговору * (1-ПроцентОтклонения/100), 2));
						ОтклонениеЦены 	= Истина;
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(СтрПричина) Тогда      
						
						Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл  
							
							Если СтрНеСоздЗП.Причина <> СтрПричина Тогда
								
								СтрНеСоздЗП.Причина 			= ?(СтрНеСоздЗП.Причина = "", СтрНеСоздЗП.Причина, СтрНеСоздЗП.Причина + ", ") + "Откл. цены";
								СтрНеСоздЗП.ЦенаОтгрузки 		= СтрПричина;
								СтрНеСоздЗП.РазрешеноКОтгрузке 	= 0;
								
								Если ОтклонениеЦены И Найти(Причина, "Отклонение цены") = 0 Тогда
									Причина = ДополнитьТекстОписания(Причина, "Отклонение цены более " + Строка(ПроцентОтклонения) + "%") ;
								КонецЕсли;
								
							КонецЕсли;					
							
						КонецЦикла; 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
			
		КонецЕсли;
		
		Если НЕ СокрЛП(Причина) = "" Или ПустойСтороннийСклад(НовыйДокЗаказ) Тогда 
			
			НеСозданныйЗП.Причина = Причина;
			
			Если ПустойСтороннийСклад(НовыйДокЗаказ) Тогда
				НеСозданныйЗП.Причина = ?(НеСозданныйЗП.Причина = "", "", НеСозданныйЗП.Причина + ", ") + "Отсутствует сторонний склад -> Запрет создания сторонних складов";
			КонецЕсли; 
			
			НеСозданныйЗП.Записать();
			НовыйЗаказ = НеСозданныйЗП.Ссылка;
			
			ДанныеВозврата.Статус = "1";
			
			Если Не EMailЗаказ Тогда
				ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,, "Записан Несозданный заказ (код " + СокрЛП(НеСозданныйЗП.Код) + ")");
			КонецЕсли;
			
			СтруктураВозврата.Вставить("Данные", 	ДанныеВозврата);
			СтруктураВозврата.Вставить("Сообщение", Причина); 
			Возврат СтруктураВозврата;
			
		КонецЕсли;	      
		
		НовыйДокЗаказ.СуммаДокумента = ДокСумма;
		
		СтратегияАвторезервированияПоЗаказам = Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВидимостьСерии",     Истина);
		СтруктураПараметров.Вставить("Авторезервирование", Истина);
		СтруктураПараметров.Вставить("Авторазмещение",     Ложь);
		СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", СтратегияАвторезервированияПоЗаказам);
		
		НовыйДокЗаказ.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);
		
		//Флаг обособленной отгрузки заполняем именно здесь, если выше, то размещение не заполнится
		Если НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка 
			И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель)   
			И НовыйДокЗаказ.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
			
			НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Справочники.СобственныеСклады.IDСоответстуетОбособленнойОтгрузке(НовыйДокЗаказ.IDСклада);
			
		КонецЕсли;	
		
		СкладФильтр = Константы.ОсновнойСклад.Получить();
		
		Для каждого Стр Из НовыйДокЗаказ.Товары Цикл	
			
			Если НЕ Стр.Размещение = СкладФильтр ИЛИ НЕ ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда					
				Стр.Размещение = "";    
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если ТекущаяДата() >= Константы.РезервированиеЗаказовСУчетомЯчеек.Получить() Тогда 
			
			ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
			ТЗ.Свернуть("Номенклатура,Размещение","Количество");
			
			Запрос = Новый Запрос;
			Запрос.Текст = ПолучитьТекстЗапросаНехваткиТоваров();
			
			Запрос.УстановитьПараметр("ТЗ", 				ТЗ);
			Запрос.УстановитьПараметр("ПустоеРазмещение", 	Неопределено);
			Табл = Запрос.Выполнить().Выгрузить();     
			
			Для Каждого  стр Из  Табл Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("Номенклатура",Стр.Номенклатура);
				НайдСтроки 	= НовыйДокЗаказ.Товары.НайтиСтроки(Отбор);
				КУменьшению = Стр.Нехватка;             
				
				Для Каждого строка Из  НайдСтроки Цикл
					
					Если КУменьшению > 0 Тогда 
						
						Если Строка.Количество > КУменьшению Тогда
							
							НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока,Строка);
							
							Строка.Количество 				= Строка.Количество - КУменьшению;
							НоваяСтрока.Количество 			= КУменьшению;
							НоваяСтрока.Размещение 			= "";
							НоваяСтрока.СерияНоменклатуры 	= "";
							НоваяСтрока.Сумма 				= НоваяСтрока.Количество * НоваяСтрока.Цена;  
							
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
							
							Строка.Сумма = Строка.Количество * Строка.Цена; 
							
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, НовыйДокЗаказ);
							
							КУменьшению = 0;
							
						Иначе
							
							КУменьшению 				= КУменьшению - Строка.Количество;
							Строка.Размещение 			= "";
							Строка.СерияНоменклатуры 	= "";
							
						КонецЕсли; 
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СобственныйСкладКакСторонний = Ложь;
		Если НЕ ЭтоСтороннийСклад Тогда
			СобственныйСкладКакСторонний = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).ИсключитьИзОбщегоЭкспресса;
		КонецЕсли;	
		
		Если ЭтоСтороннийСклад ИЛИ СобственныйСкладКакСторонний Тогда 
			
			ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
			ТЗ.Свернуть("Номенклатура,Цена,Коэффициент,Размещение,СерияНоменклатуры","Количество");
			
			Запрос = Новый Запрос;
			Запрос.Текст = ПолучитьТекстЗапросаЦенПортала();	
			Запрос.УстановитьПараметр("ТипЦенЗаказ", 	НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен);
			Запрос.УстановитьПараметр("Рубль", 			Константы.ВалютаРегламентированногоУчета.Получить());
			Запрос.УстановитьПараметр("ПустаяСерия", 	Справочники.СерииНоменклатуры.ПустаяСсылка());
			Запрос.УстановитьПараметр("ТЗ", 			ТЗ);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() = 0 Тогда 
				
				ВременнаяТЗ = НовыйДокЗаказ.Товары.Выгрузить();
				ВременнаяТЗ.ЗаполнитьЗначения("", "Размещение,СерияНоменклатуры");
				НовыйДокЗаказ.Товары.Загрузить(ВременнаяТЗ);
				ВременнаяТЗ = Неопределено;
				
			Иначе
				
				Для каждого Стр Из НовыйДокЗаказ.Товары Цикл  
					
					СтрРезультат = Результат.Найти(Стр.Номенклатура, "Номенклатура");
					Если СтрРезультат = Неопределено  Тогда   
						
						Стр.Размещение 			= "";
						Стр.СерияНоменклатуры 	= ""; 
						
					ИначеЕсли СтрРезультат.ЦенаПоДоговору = 0 Тогда
						Стр.Размещение = "";
					КонецЕсли;   
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если НовыйДокЗаказ.ТолькоРезерв Тогда  
			
			ПромТабличнаяЧасть = НовыйДокЗаказ.Товары.Выгрузить();
			ПромТабличнаяЧасть.ЗаполнитьЗначения(НовыйДокЗаказ.ТолькоРезерв, "ТолькоРезерв");
			НовыйДокЗаказ.Товары.Загрузить(ПромТабличнаяЧасть);
			ПромТабличнаяЧасть = Неопределено;
			
		КонецЕсли;
		
		//+Белов А. 18.09.2023 #
		МСКWEB.ОбработатьРезервОбособленнойОтгрузки(НовыйДокЗаказ);
		//-Белов А. 18.09.2023 #	
		
		Попытка        
			
			//+Белов А. 10.03.2026 #UT10-5729
			ВыделитьМаркировкуВОтдельныйЗаказ = Ложь;
			
			//Если основная организация
			Если НовыйДокЗаказ.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
				ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Константы.ВыделятьТоварыСМаркировкойПоОснОрганизацииВОтдельныйЗаказ.Получить() И МСКWEB.ПоДоворуНужноВыделениеЗаказаСМаркировкойВОтдельный(НовыйДокЗаказ.ДоговорКонтрагента);		
			Иначе
			//Если управленческая организация	
				ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить();  				
			КонецЕсли;
			
			Если ВыделитьМаркировкуВОтдельныйЗаказ Тогда
				
				СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
				НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;  
				
			Иначе
				НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
			КонецЕсли;
			
			////+Белов А. 25.12.2025 #UT10-5586
			//Если Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить() 
			//	И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() 
			//	И Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) Тогда
			//	
			//	СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
			//	НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;
			//	
			////-Белов А. 25.12.2025 #UT10-5586	
			//Иначе
			//	
			//	НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
			//КонецЕсли;  
			//-Белов А. 10.03.2026 #UT10-5729
			
			ДанныеВозврата.Статус 		= "0";
			ДанныеВозврата.НомерЗаказа 	= НовыйДокЗаказ.Номер; 
			СтруктураВозврата.Вставить("Сообщение", "Создан новый Заказ покупателя: " + Строка(НовыйДокЗаказ));
			
		Исключение    
			
			ОшибкаЗаписи = ?( НеСозданныйЗП.Причина = "", "", НеСозданныйЗП.Причина + ", ") + "Ошибка при проведении заказа покупателя";
			НеСозданныйЗП.Причина = ОшибкаЗаписи; 
			НеСозданныйЗП.Записать();   
			
			ДанныеВозврата.Статус = "1";
			
			СтруктураВозврата.Вставить("Данные", 	ДанныеВозврата);
			СтруктураВозврата.Вставить("Сообщение", ОшибкаЗаписи);
			
			ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,, "Ошибка при проведении заказа покупателя (" + ОписаниеОшибки() + "). Записан Несозданный заказ (код " + СокрЛП(НеСозданныйЗП.Код) + ")");
			Возврат СтруктураВозврата;
			
		КонецПопытки;	
		
		Коментарий = "Документ сформирован автоматически при загрузке заказа покупателя из портала";  
		
		Если Не ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда
			
			Если МСК.НеобходимоПроверятьКратностьВЗаказе(НовыйДокЗаказ) Тогда 
				
				ДанныеСозданияКорректировки = МСКWEB.СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ,, Коментарий);
				
				Если ЗначениеЗаполнено(ДанныеСозданияКорректировки.Ошибка) Тогда
					ДанныеВозврата.Статус = "3";
				КонецЕсли;   
				
			КонецЕсли;		
			
		Иначе
			
			Если НовыйДокЗаказ.IDСклада_СтороннийСклад.ОтправлятьВАварду Тогда 
				
				ДанныеСозданияКорректировки = МСКWEB.ПроверитьКратностьИСоздатьКорректировкуЗаказаПокупателя(НовыйДокЗаказ, Коментарий);
				
				Если ЗначениеЗаполнено(ДанныеСозданияКорректировки.Ошибка) Тогда
					ДанныеВозврата.Статус = "3";
				КонецЕсли; 
				
			КонецЕсли;	
			
		КонецЕсли;  
		
		Если EMailЗаказ Тогда
			ЗаписьЖурналаРегистрации("Запрос данных с эл почты", УровеньЖурналаРегистрации.Информация,,, "TransportOrderFromPortal окончание ");	
		Иначе
		КонецЕсли; 
		
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Данные", 	ДанныеВозврата);	
	СтруктураВозврата.Вставить("Результат", Истина);
	
	Возврат СтруктураВозврата;		
	
КонецФункции  

Функция НормализоватьСтроку(СтрокаИсточник, КраткаяПроверка = Ложь) Экспорт
	
	СимволыПроверки = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя";
	
	Если КраткаяПроверка Тогда 
		СимволыПроверки = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz";
	КонецЕсли;	

	СтрокаВозврата 	= "";
	СтрокаПроверки 	= ВРег(СокрЛП(СтрокаИсточник));
	Длина 			= СтрДлина(СтрокаПроверки);
	
	Для а = 1 По Длина Цикл
		
		Если Найти(СимволыПроверки, Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
			СтрокаВозврата = СтрокаВозврата + Сред(СтрокаПроверки, а, 1);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрокаВозврата;	
	
КонецФункции	

Функция ДополнитьТекстОписания(ТекстПриемник, ТекстДобавочный) Экспорт
	
	Возврат ?(ТекстПриемник = "", ТекстПриемник, ТекстПриемник + ", ") + ТекстДобавочный;
	
КонецФункции  

Функция ПолучитьТекстЗапросаНехваткиТоваров()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
	|ПОМЕСТИТЬ КонстКратности
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Размещение КАК Размещение
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&ТЗ КАК ТЗ
	|ГДЕ
	|	ТЗ.Размещение <> НЕОПРЕДЕЛЕНО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Остаток,
	|	1 КАК Поле1
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
	|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|ГДЕ
	|	ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыГотовыеКСборкеОстатки.Номенклатура,
	|	-ТоварыГотовыеКСборкеОстатки.КоличествоОстаток,
	|	3
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
	|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура,
	|	СУММА(Остатки.Остаток) КАК Остаток,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА КонстКратности.ЗначениеКонстанты
	|				ТОГДА ВЫБОР
	|						КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
	|							ТОГДА Остатки.Номенклатура.КратностьФилиала
	|						ИНАЧЕ Остатки.Номенклатура.Кратность
	|					КОНЕЦ
	|			ИНАЧЕ Остатки.Номенклатура.Кратность
	|		КОНЕЦ) КАК Кратность
	|ПОМЕСТИТЬ ОстаткиГруппа
	|ИЗ
	|	Остатки КАК Остатки,
	|	КонстКратности КАК КонстКратности
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиГруппа.Номенклатура,
	|	СУММА(ОстаткиГруппа.Остаток) КАК Остаток,
	|	СУММА(ВЫБОР
	|			КОГДА ОстаткиГруппа.Остаток > 0
	|				ТОГДА ВЫБОР
	|						КОГДА ОстаткиГруппа.Кратность > ОстаткиГруппа.Остаток
	|							ТОГДА 0
	|						ИНАЧЕ ВЫБОР
	|								КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
	|									ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
	|								ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))
	|							КОНЕЦ
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
	|						ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
	|					ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))
	|				КОНЕЦ
	|		КОНЕЦ) КАК ОстатокПоКратности
	|ПОМЕСТИТЬ ОстаткиИтог
	|ИЗ
	|	ОстаткиГруппа КАК ОстаткиГруппа
	|ГДЕ
	|	ОстаткиГруппа.Остаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиГруппа.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ВЫБОР
	|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0) > ТаблицаНоменклатура.Количество
	|			ТОГДА ТаблицаНоменклатура.Количество
	|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0)
	|	КОНЕЦ КАК Нехватка_,
	|	ВЫБОР
	|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0) > ТаблицаНоменклатура.Количество
	|			ТОГДА ТаблицаНоменклатура.Количество
	|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
	|	КОНЕЦ КАК Нехватка
	|ПОМЕСТИТЬ Рез
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИтог КАК ОстаткиИтог
	|		ПО ТаблицаНоменклатура.Номенклатура = ОстаткиИтог.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рез.Номенклатура,
	|	Рез.Нехватка
	|ИЗ
	|	Рез КАК Рез
	|ГДЕ
	|	Рез.Нехватка > 0";
	
	Возврат ТекстЗапроса;
	
КонецФункции	 

Функция ПолучитьТекстЗапросаЦенПортала()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Цена КАК ЦенаПортал,
	|	ТЗ.Коэффициент КАК Коэффициент,
	|	ТЗ.Количество КАК Количество,
	|	ТЗ.Размещение КАК Размещение,
	|	ТЗ.СерияНоменклатуры КАК СерияНоменклатуры
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ТаблицаНоменклатура.ЦенаПортал,
	|	СправочникНоменклатура.Кратность КАК Коэффициент,
	|	ТаблицаНоменклатура.Количество,
	|	ТаблицаНоменклатура.Размещение,
	|	ТаблицаНоменклатура.СерияНоменклатуры
	|ПОМЕСТИТЬ ТабОстатков
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ТаблицаНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	ТаблицаНоменклатура.СерияНоменклатуры <> &ПустаяСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабОстатков.Номенклатура,
	|	ТабОстатков.ЦенаПортал,
	|	ТабОстатков.Количество,
	|	ТабОстатков.Коэффициент,
	|	ВЫБОР
	|		КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
	|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|								И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|								И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
	|								И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
	|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК ЦенаПоДоговору,
	|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
	|			КОГДА ТабОстатков.Коэффициент > 0
	|				ТОГДА ТабОстатков.Коэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Дробное,
	|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
	|			КОГДА ТабОстатков.Коэффициент > 0
	|				ТОГДА ТабОстатков.Коэффициент
	|			ИНАЧЕ 1
	|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Целое
	|ИЗ
	|	ТабОстатков КАК ТабОстатков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ТабОстатков.Номенклатура
	|						ИЗ
	|							ТабОстатков КАК ТабОстатков)
	|					И ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТабОстатков.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦенЗаказ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Рубль) КАК КурсРубля
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТабОстатков.ЦенаПортал >= ВЫБОР
	|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
	|						ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
	|					ИНАЧЕ ВЫБОР
	|							КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
	|									И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
	|									И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
	|									И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
	|								ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
	|							ИНАЧЕ 0
	|						КОНЕЦ
	|				КОНЕЦ
	|		КОНЕЦ
	|	И (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
	|				КОГДА ТабОстатков.Коэффициент > 0
	|					ТОГДА ТабОстатков.Коэффициент
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 3))) = (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
	|				КОГДА ТабОстатков.Коэффициент > 0
	|					ТОГДА ТабОстатков.Коэффициент
	|				ИНАЧЕ 1
	|			КОНЕЦ КАК ЧИСЛО(15, 0)))";
	
	Возврат ТекстЗапроса;
	
КонецФункции	

Функция ПолучитьТекстЗапросаЦен()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Цена КАК ЦенаКлиента
	|ПОМЕСТИТЬ ТаблицаНоменклатура
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаНоменклатура.Номенклатура,
	|	ЕСТЬNULL(ТаблицаНоменклатура.ЦенаКлиента,0) КАК ЦенаКлиента,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК ЦенаПоДоговору
	|ИЗ
	|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ТаблицаНоменклатура.Номенклатура
	|						ИЗ
	|							ТаблицаНоменклатура)
	|					И 
	|					ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура";

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЕстьТакойЗаказ(ИдентификаторЗаказа, ИдентификаторСклад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.IDПрайсЛиста = &ИдентификаторСклад
	|	И ЗаказПокупателя.IDЗаказаПортал = &ИдентификаторЗаказа
	|	И НЕ ЗаказПокупателя.ПометкаУдаления";
	
	//+Белов А. 05.05.2026 #ITS-91643
	Запрос.УстановитьПараметр("ИдентификаторЗаказа", Число(ИдентификаторЗаказа));
	//Запрос.УстановитьПараметр("ИдентификаторЗаказа", ИдентификаторЗаказа);
	//-Белов А. 05.05.2026 #ITS-91643
	
	Запрос.УстановитьПараметр("ИдентификаторСклад", Число(ИдентификаторСклад));
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;         
	
	Возврат Документы.ЗаказПокупателя.ПустаяСсылка(); 
		
КонецФункции  

Функция ЕстьТакойЗаказВНесозданных(ИдентификаторЗаказа, ИдентификаторСклад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателей.Ссылка
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей КАК НеСозданныеЗаказыПокупателей
	|ГДЕ
	|	НеСозданныеЗаказыПокупателей.Код = &ИдентификаторЗаказа
	|	И НЕ НеСозданныеЗаказыПокупателей.ПометкаУдаления
	|	И НеСозданныеЗаказыПокупателей.IDПрайсЛиста = &ИдентификаторСклад";
	
	Запрос.УстановитьПараметр("ИдентификаторЗаказа", Строка(ИдентификаторЗаказа));
	Запрос.УстановитьПараметр("ИдентификаторСклад", Число(ИдентификаторСклад));
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;         
	
	Возврат Справочники.НеСозданныеЗаказыПокупателей.ПустаяСсылка(); 
		
КонецФункции



///////////////////return_create///////////////////
Функция СозданиеЗаявкиНаВозвратСервер(СтрокаJSON, ВернутьJSON = Истина) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.return_create.СоздатьЗаявкуНаВозврат", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. СоздатьЗаявкуНаВозврат");
	
	МассивСтрок = ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);   
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	
	Если ТипЗнч(МассивСтрок) = Тип("Массив") И ЗначениеЗаполнено(МассивСтрок) Тогда
		                      
		СтруктураВозврата = СозданиеЗаявкиНаВозврат(МассивСтрок);
		
		ДанныеВозврата = ?(ВернутьJSON, ОбщегоНазначения.ВернутьJSON(СтруктураВозврата), СтруктураВозврата); 
		
	Иначе
		
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Заявка на возврат не создана. Не заданы строки для поиска реализаций и товаров."); 
		ДанныеВозврата = ?(ВернутьJSON, ОбщегоНазначения.ВернутьJSON(СтруктураВозврата), СтруктураВозврата); 
		
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.return_create.СоздатьЗаявкуНаВозврат", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. СоздатьЗаявкуНаВозврат. " 
	+ Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
	
	Возврат ДанныеВозврата;
	
КонецФункции

Функция СозданиеЗаявкиНаВозврат(МассивПараметры) Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Количество",         ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	ТЗ.Колонки.Добавить("Комментарий",        ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(255));
	ТЗ.Колонки.Добавить("ПричинаВозврата",    ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(1));
	ТЗ.Колонки.Добавить("НомСтр",             ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(5, 0, ДопустимыйЗнак.Неотрицательный));
	ТЗ.Колонки.Добавить("ИдентификаторДокумента", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(36));
	ТЗ.Колонки.Добавить("Номенклатура",       Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("ПроверятьКратность", Новый ОписаниеТипов("Булево")); 
	ТЗ.Колонки.Добавить("РТУ",                Новый ОписаниеТипов("ДокументСсылка.РеализацияТоваровУслуг"));
	//+Сёмин Р.И. 18.03.2026 #UT10-5766
	ТЗ.Колонки.Добавить("ЭлПочтаКлиента",     ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
	//-Сёмин Р.И. 18.03.2026 #UT10-5766
	
	//+Белов А. 03.03.2026 #UT10-5722
	СоответствиеФайлыS3 = Новый Соответствие;
	//-Белов А. 03.03.2026 #UT10-5722	
	
	ДокументыРТУ = Новый Соответствие();
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	ДанныеВозврата 	  = Новый Структура("НомерЗаявки, Статус", "", "");

	// Проверки
	Для каждого строка из МассивПараметры Цикл  
		
		НомерСтрокиСтр = Строка(МассивПараметры.Найти(строка) + 1);
		
		Если Не строка.Свойство("ИдентификаторДокумента") Или ПустаяСтрока(строка.ИдентификаторДокумента) Тогда
			
			СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр 
			+ " не указан параметр запроса ИдентификаторДокумента";  
		    Возврат СтруктураВозврата;
			
		КонецЕсли;
		
		Если Не строка.Свойство("НомерСтроки") Или ПустаяСтрока(строка.НомерСтроки) Тогда
			
			СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр 
			+ " не указан параметр запроса НомерСтроки";        
		    Возврат СтруктураВозврата;
			
		КонецЕсли;   
		
		Попытка
		    НомСтр = Число(Строка.НомерСтроки);
		Исключение
			
			СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр + " параметр запроса НомерСтроки=" 
			+ Строка.НомерСтроки + " не является числом.";  
		    Возврат СтруктураВозврата;
			
		КонецПопытки;
		
		Если Не строка.Свойство("Количество") Или ПустаяСтрока(строка.Количество) Тогда
			
			СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр + " не указан параметр запроса Количество";
		    Возврат СтруктураВозврата;
			
		КонецЕсли;   
		
		Попытка
		    Количество = Число(Строка.Количество);
		Исключение
			
			СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр + " параметр запроса Количество=" 
			+ Строка.Количество + " не является числом.";   
		    Возврат СтруктураВозврата;
			
		КонецПопытки;
		
		ИД = строка.ИдентификаторДокумента;
		
		Если ДокументыРТУ.Получить(ИД) = Неопределено Тогда
			
			Попытка
				Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ИД));	
			Исключение    
				Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецПопытки;
			
			Если ЗначениеЗаполнено(Реализация) И Не Реализация.ПолучитьОбъект() = Неопределено Тогда             
				ДокументыРТУ.Вставить(ИД, Реализация);
			Иначе 
				
				СтруктураВозврата.Сообщение = "Заявки на возврат не сформированы. Причина: в строке " + НомерСтрокиСтр 
				+ " не найдена реализация по идентификатору " + ИД;   
			    Возврат СтруктураВозврата;
				
			КонецЕсли; 	

		КонецЕсли; 	
			
	КонецЦикла;
	
	Для каждого строка из МассивПараметры Цикл  
		
		СтрокаТЗ = ТЗ.Добавить();  
		СтрокаТЗ.ИдентификаторДокумента = Строка.ИдентификаторДокумента;
		СтрокаТЗ.РТУ                    = ДокументыРТУ.Получить(Строка.ИдентификаторДокумента);
		СтрокаТЗ.Количество             = Число(Строка.Количество);
		СтрокаТЗ.НомСтр                 = Число(Строка.НомерСтроки);
		СтрокаТЗ.ПричинаВозврата        = ?(Не строка.Свойство("ПричинаВозврата"), "0", Строка(строка.ПричинаВозврата));
		строка.Свойство("Комментарий", СтрокаТЗ.Комментарий);
		//+Сёмин Р.И. 18.03.2026 #UT10-5766
		строка.Свойство("ЭлПочтаКлиента", СтрокаТЗ.ЭлПочтаКлиента);
		//-Сёмин Р.И. 18.03.2026 #UT10-5766
		
		//+Белов А. 03.03.2026 #UT10-5722
		Если строка.Свойство("ФайлыS3") Тогда
			
			Файлы = СоответствиеФайлыS3.Получить(Строка.ИдентификаторДокумента); 
			
			Если Файлы = Неопределено Тогда
				СоответствиеФайлыS3.Вставить(Строка.ИдентификаторДокумента, строка.ФайлыS3);	
			Иначе   
				
				Для каждого СсылкаНаФайл Из строка.ФайлыS3 Цикл
					Файлы.Добавить(СсылкаНаФайл);	
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		//-Белов А. 03.03.2026 #UT10-5722
		
	КонецЦикла;
	
	тзТолькоРТУ = тз.Скопировать(, "РТУ, ИдентификаторДокумента");
	тзТолькоРТУ.Свернуть("РТУ, ИдентификаторДокумента");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	 "ВЫБРАТЬ
	 |	ВЫБОР
	 |		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.СрокВозврата = 0
	 |			ТОГДА &КоличествоДнейВозврата
	 |		ИНАЧЕ РеализацияТоваровУслуг.ДоговорКонтрагента.СрокВозврата
	 |	КОНЕЦ КАК КоличествоДнейДляВозврата,
	 |	РеализацияТоваровУслуг.Ссылка КАК ДокРТУ
	 |ПОМЕСТИТЬ ВТ_РТУ1
	 |ИЗ
	 |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 |ГДЕ
	 |	РеализацияТоваровУслуг.Ссылка В(&МассивРТУ)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_РТУ.КоличествоДнейДляВозврата,
	 |	ВТ_РТУ.ДокРТУ КАК Реализация,
	 |	ВЫБОР
	 |		КОГДА НАЧАЛОПЕРИОДА(ВТ_РТУ.ДокРТУ.Дата, ДЕНЬ) < ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -ВТ_РТУ.КоличествоДнейДляВозврата)
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК ИстекСрокВозврата
	 |ПОМЕСТИТЬ ВТ_РТУ
	 |ИЗ
	 |	ВТ_РТУ1 КАК ВТ_РТУ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	тзРТУ.РТУ КАК Реализация,
	 |	тзРТУ.ИдентификаторДокумента,
	 |	тзРТУ.ПричинаВозврата,
	 |	тзРТУ.Комментарий,
	 //+Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	тзРТУ.ЭлПочтаКлиента,
	 //-Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	тзРТУ.НомСтр,
	 |	тзРТУ.Количество
	 |ПОМЕСТИТЬ ВТ_РТУизЗапроса
	 |ИЗ
	 |	&тзРТУ КАК тзРТУ
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_РТУ.Реализация,
	 |	РеализацияТоваровУслугТовары.Номенклатура,
	 |	РеализацияТоваровУслугТовары.НомерСтроки,
	 |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
	 |	РеализацияТоваровУслугТовары.Количество,
	 |	РеализацияТоваровУслугТовары.Цена,
	 |	ВТ_РТУ.КоличествоДнейДляВозврата,
	 |	РеализацияТоваровУслугТовары.ЗаказПокупателя,
	 |	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад КАК СтороннийСклад,
	 |	ВТ_РТУ.ИстекСрокВозврата,
	 |	РеализацияТоваровУслугТовары.Сумма,
	 |	РеализацияТоваровУслугТовары.СтавкаНДС
	 |ПОМЕСТИТЬ ВТ_РТУизБазы
	 |ИЗ
	 |	ВТ_РТУ КАК ВТ_РТУ
	 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	 |		ПО ВТ_РТУ.Реализация = РеализацияТоваровУслугТовары.Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_РТУизЗапроса.Реализация,
	 |	ВТ_РТУизЗапроса.ИдентификаторДокумента,
	 |	ВТ_РТУизЗапроса.НомСтр,
	 |	ВЫБОР
	 |		КОГДА ВТ_РТУизБазы.Реализация ЕСТЬ NULL
	 |			ТОГДА ""Не найдена строка реализации номер ==НомерСтроки==""
	 |		КОГДА ВТ_РТУизЗапроса.Количество > ЕСТЬNULL(ВТ_РТУизБазы.Количество, 0)
	 |			ТОГДА ""Количество в запросе превышает количество в реализации - ==КоличествоДок====НомерСтроки==""
	 |		ИНАЧЕ """"
	 |	КОНЕЦ КАК ТекстОшибки,
	 |	ВЫБОР
	 |		КОГДА ВТ_РТУизБазы.Реализация ЕСТЬ NULL
	 |			ТОГДА ЛОЖЬ
	 |		ИНАЧЕ ИСТИНА
	 |	КОНЕЦ КАК ДокументНайден,
	 |	ВТ_РТУизБазы.Номенклатура,
	 |	ВТ_РТУизБазы.НомерСтроки,
	 |	ВТ_РТУизБазы.ЕдиницаИзмерения,
	 |	ВТ_РТУизЗапроса.Количество КАК Количество,
	 |	ЕСТЬNULL(ВТ_РТУизБазы.Цена, 0) КАК Цена,
	 |	ВТ_РТУизБазы.СтороннийСклад,
	 |	ВТ_РТУизБазы.ИстекСрокВозврата,
	 |	ВТ_РТУизЗапроса.ПричинаВозврата,
	 |	ВТ_РТУизЗапроса.Комментарий,
	 //+Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	ВТ_РТУизЗапроса.ЭлПочтаКлиента,
	 //-Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	ЕСТЬNULL(ВТ_РТУизБазы.Количество, 0) КАК КоличествоДок,
	 |	ЕСТЬNULL(ВТ_РТУизБазы.Сумма, 0) КАК Сумма,
	 |	ВТ_РТУизБазы.ЗаказПокупателя
	 |ПОМЕСТИТЬ ВТ_Реализация
	 |ИЗ
	 |	ВТ_РТУизЗапроса КАК ВТ_РТУизЗапроса
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РТУизБазы КАК ВТ_РТУизБазы
	 |		ПО ВТ_РТУизЗапроса.Реализация = ВТ_РТУизБазы.Реализация
	 |			И ВТ_РТУизЗапроса.НомСтр = ВТ_РТУизБазы.НомерСтроки
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Реализация.Реализация,
	 |	ВТ_Реализация.Номенклатура,
	 |	ВТ_Реализация.Количество,
	 |	ВТ_Реализация.НомерСтроки,
	 |	СУММА(ЕСТЬNULL(ЗаявкиНаВозврат.Количество, 0)) КАК ЗаявкиНаВозврат_Количество,
	 |	ЕСТЬNULL(ЗаявкиНаВозврат.НомерСтрокиИзРТУ, 0) КАК НомерСтрокиИзРТУ
	 |ПОМЕСТИТЬ ВТ_ЗаявкиНаВозврат
	 |ИЗ
	 |	ВТ_Реализация КАК ВТ_Реализация
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкиНаВозврат
	 |		ПО (ВТ_Реализация.ДокументНайден)
	 |			И ВТ_Реализация.Реализация = ЗаявкиНаВозврат.Ссылка.Реализация
	 |			И ВТ_Реализация.Номенклатура = ЗаявкиНаВозврат.Номенклатура
	 |			И ВТ_Реализация.НомерСтроки = ЗаявкиНаВозврат.НомерСтрокиИзРТУ
	 |			И (ЗаявкиНаВозврат.Ссылка.Статус <> ""Отменен"")
	 |			И (ЗаявкиНаВозврат.Ссылка.ПометкаУдаления = ЛОЖЬ)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_Реализация.Реализация,
	 |	ВТ_Реализация.Номенклатура,
	 |	ВТ_Реализация.НомерСтроки,
	 |	ВТ_Реализация.Количество,
	 |	ЕСТЬNULL(ЗаявкиНаВозврат.НомерСтрокиИзРТУ, 0)
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Реализация.Реализация КАК Реализация,
	 |	ВТ_Реализация.Номенклатура,
	 |	ВТ_Реализация.Цена,
	 |	ВТ_Реализация.Количество,
	 |	ВЫБОР
	 |		КОГДА ВТ_Реализация.КоличествоДок > 0
	 |			ТОГДА ВТ_Реализация.Количество / ВТ_Реализация.КоличествоДок * ВТ_Реализация.Сумма
	 |		ИНАЧЕ ВТ_Реализация.Количество * ВТ_Реализация.Цена
	 |	КОНЕЦ КАК Сумма,
	 |	ВТ_Реализация.НомерСтроки,
	 |	ВТ_Реализация.КоличествоДок - ЕСТЬNULL(ЗаявкиНаВозврат.ЗаявкиНаВозврат_Количество, 0) КАК КоличествоДляВозврата,
	 |	ЗаявкиНаВозврат.ЗаявкиНаВозврат_Количество КАК ЗаявкиНаВозврат_Количество,
	 |	ВТ_Реализация.СтороннийСклад КАК СтороннийСклад,
	 |	ВТ_Реализация.ИдентификаторДокумента КАК ИдентификаторДокумента,
	 |	ВТ_Реализация.НомСтр,
	 |	ВТ_Реализация.ТекстОшибки,
	 |	ВТ_Реализация.ЕдиницаИзмерения,
	 |	ВТ_Реализация.ИстекСрокВозврата КАК ИстекСрокВозврата,
	 |	ВЫБОР
	 |		КОГДА ВТ_Реализация.Количество > ВТ_Реализация.КоличествоДок - ЕСТЬNULL(ЗаявкиНаВозврат.ЗаявкиНаВозврат_Количество, 0)
	 |			ТОГДА ИСТИНА
	 |		ИНАЧЕ ЛОЖЬ
	 |	КОНЕЦ КАК НедостаточноКоличества,
	 |	ВТ_Реализация.ПричинаВозврата,
	 |	ВТ_Реализация.Комментарий,
	 //+Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	ВТ_Реализация.ЭлПочтаКлиента,
	 //-Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	ВТ_Реализация.ЗаказПокупателя,
	 |	ВТ_Реализация.КоличествоДок
	 |ИЗ
	 |	ВТ_Реализация КАК ВТ_Реализация
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаявкиНаВозврат КАК ЗаявкиНаВозврат
	 |		ПО (ВТ_Реализация.ДокументНайден)
	 |			И ВТ_Реализация.Реализация = ЗаявкиНаВозврат.Реализация
	 |			И ВТ_Реализация.Номенклатура = ЗаявкиНаВозврат.Номенклатура
	 |			И ВТ_Реализация.НомерСтроки = ЗаявкиНаВозврат.НомерСтрокиИзРТУ
	 |			И (ЗаявкиНаВозврат.НомерСтрокиИзРТУ > 0)
	 |ИТОГИ
	 |	МАКСИМУМ(ИдентификаторДокумента),
	 //+Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	МАКСИМУМ(ЭлПочтаКлиента),
	 //-Сёмин Р.И. 18.03.2026 #UT10-5766
	 |	МАКСИМУМ(ИстекСрокВозврата)
	 |ПО
	 |	Реализация
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ВТ_Реализация.Реализация КАК Реализация,
	 |	ВТ_Реализация.ИдентификаторДокумента КАК ИдентификаторДокумента,
	 |	ВТ_Реализация.Номенклатура,
	 |	СУММА(ВТ_Реализация.Количество) КАК Количество,
	 |	МАКСИМУМ(ВТ_Реализация.ЗаказПокупателя) КАК ЗаказПокупателя,
	 |	МИНИМУМ(ВТ_Реализация.НомСтр) КАК НомСтр
	 |ИЗ
	 |	ВТ_Реализация КАК ВТ_Реализация
	 |ГДЕ
	 |	НЕ ВТ_Реализация.ЗаказПокупателя ЕСТЬ NULL
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВТ_Реализация.Реализация,
	 |	ВТ_Реализация.ИдентификаторДокумента,
	 |	ВТ_Реализация.Номенклатура
	 |ИТОГИ
	 |	МАКСИМУМ(ИдентификаторДокумента)
	 |ПО
	 |	Реализация";
	
	Запрос.УстановитьПараметр("МассивРТУ", тзТолькоРТУ.ВыгрузитьКолонку("РТУ"));
	Запрос.УстановитьПараметр("тзРТУ",     тз);    
	Запрос.УстановитьПараметр("КоличествоДнейВозврата", Константы.КоличествоДнейВозврата.Получить());  
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата())); 
	
	Пакет = Запрос.ВыполнитьПакет();
	ПоследнийПакет = Пакет.Количество() - 1;
	
	ВыборкаДок = Пакет[ПоследнийПакет].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивОшибки = Новый Массив;
	
	// Проверка кратности
	Пока ВыборкаДок.Следующий() Цикл 
		
		Выборка = ВыборкаДок.Выбрать();  
		
		Пока Выборка.Следующий() Цикл
			
			ПроверятьКратность = мск.НеобходимоПроверятьКратностьВЗаказе(Выборка.ЗаказПокупателя);
			
			Если ПроверятьКратность И НЕ МСК.ПроверкаНоменклатурыНаКратность(Выборка.Номенклатура, Выборка.Количество)  Тогда  
				
				Коэф = МСК.ПолучитьКратностьНоменклатуры(Выборка.Номенклатура);  
				Коэф = ?(Коэф = 0, 1, Коэф);
				
				ТекстОшибкиВСтроке = "Количество должно быть кратно " + Строка(коэф) + ". НомерСтроки " + Строка(Выборка.НомСтр)
				+ ", ИдентификаторДокумента " + Выборка.ИдентификаторДокумента;
				
				МассивОшибки.Добавить(ТекстОшибкиВСтроке);
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЦикла;  
	
	// Проверка количества
	ВыборкаДок = Пакет[ПоследнийПакет - 1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДок.Следующий() Цикл 
		
		Выборка = ВыборкаДок.Выбрать();  
		
		Пока Выборка.Следующий() Цикл
		
			Если Не ПустаяСтрока(Выборка.ТекстОшибки) Тогда
				
				Если Найти(Выборка.ТекстОшибки, "Не найдена строка реализации номер") > 0 Тогда
					ТекстОшибкиВСтроке = СтрЗаменить(Выборка.ТекстОшибки, "==НомерСтроки==", " " + Строка(Выборка.НомСтр)); 
				Иначе
					ТекстОшибкиВСтроке = СтрЗаменить(Выборка.ТекстОшибки, "==НомерСтроки==", ". НомерСтроки " + Строка(Выборка.НомСтр)); 
				КонецЕсли;
				
				ТекстОшибкиВСтроке = СтрЗаменить(ТекстОшибкиВСтроке, "==КоличествоДок==", Строка(Выборка.КоличествоДок))
				+ ", ИдентификаторДокумента " + Выборка.ИдентификаторДокумента;    
				
				МассивОшибки.Добавить(ТекстОшибкиВСтроке);
				
			ИначеЕсли Выборка.НедостаточноКоличества Тогда
			
				ТекстОшибкиВСтроке = "Количество в запросе превышает количество, доступное к возврату - " 
				+ Строка(МАКС(Выборка.КоличествоДляВозврата, 0)) + ". НомерСтроки " + Строка(Выборка.НомСтр) 
				+ ", ИдентификаторДокумента " + Выборка.ИдентификаторДокумента;
				
				МассивОшибки.Добавить(ТекстОшибкиВСтроке);
				
			КонецЕсли;      
			
		КонецЦикла;
	
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	Если МассивОшибки.Количество() > 0 Тогда 
		
		СтруктураВозврата.Сообщение = МассивОшибки;
		Возврат СтруктураВозврата;
	
	КонецЕсли;
	
	ДокВозврат = Неопределено;
	ПромКомментарийОтмены = "";  
	ПромСтатусЗаявки = "";
	МассивРезультат = Новый Массив;
	
	ВыборкаДок.Сбросить();
	
	Пока ВыборкаДок.Следующий() Цикл 
		
		ДанныеВозврата = Новый Структура("НомерЗаявки, Статус");    
		//+Белов А. 03.03.2026 #UT10-5722                                 
		ГуидЗаявки = Новый УникальныйИдентификатор();
		СсылкаЗаявки = ДОкументы.ЗаявкаНаВозврат.ПолучитьСсылку(ГуидЗаявки);
		ДанныеВозврата.НомерЗаявки = Строка(ГуидЗаявки);
		//-Белов А. 03.03.2026 #UT10-5722
		
		ПромСтатусЗаявки = "На согласовании";
		
		Если ВыборкаДок.ИстекСрокВозврата Тогда 
			
			ПромСтатусЗаявки = "Отказ в возврате";
			ПромКомментарийОтмены = "Истек период для возврата.";    
				
		КонецЕсли;	      
		
		ДокВозврат = Документы.ЗаявкаНаВозврат.СоздатьДокумент(); 
		ДокВозврат.УстановитьСсылкуНового(СсылкаЗаявки);
		ДокВозврат.Дата       = ТекущаяДата();
		ДокВозврат.Реализация = ВыборкаДок.Реализация;    
		ДокВозврат.СертифицированнаяТорговаяТочка = ВыборкаДок.Реализация.Грузополучатель.СертифицированнаяТорговаяТочка; 
		
		ДокВозврат.Статус     = ПромСтатусЗаявки;     
		ДанныеВозврата.Статус = ПромСтатусЗаявки;
		
		//+Сёмин Р.И. 18.03.2026 #UT10-5766
		ДокВозврат.ЭлПочтаКлиента = ВыборкаДок.ЭлПочтаКлиента;
		//-Сёмин Р.И. 18.03.2026 #UT10-5766
		
		//+Сёмин Р.И. 12.05.2026 #UT10-5807
		ДокВозврат.ДополнительныеСвойства.Вставить("ЗаполнятьКомментарийДляРекламации", Ложь);
		//-Сёмин Р.И. 12.05.2026 #UT10-5807
		
		ЕстьРекламация = Ложь;
		
		Выборка = ВыборкаДок.Выбрать();  
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаВозврат = ДокВозврат.Товары.Добавить();			
			
			СтрокаВозврат.Номенклатура     = Выборка.Номенклатура;
			СтрокаВозврат.Количество       = Выборка.Количество;
			СтрокаВозврат.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
			СтрокаВозврат.Комментарий      = Выборка.Комментарий;
			СтрокаВозврат.Цена             = Выборка.Цена;
			СтрокаВозврат.IDСклада_СтороннийСклад = Выборка.СтороннийСклад;			
			СтрокаВозврат.Сумма            = Выборка.Сумма;
			СтрокаВозврат.Тип              = ?(Выборка.ПричинаВозврата = "0", "Возврат", "Рекламация");
			СтрокаВозврат.НомерСтрокиИзРТУ = Выборка.НомерСтроки;

			Если СтрокаВозврат.Тип = "Рекламация" Тогда
				ЕстьРекламация = Истина;
			ИначеЕсли СтрокаВозврат.Тип = "Возврат" Тогда     
				
				Если ЗначениеЗаполнено(СтрокаВозврат.Комментарий)Тогда
					ДокВозврат.Комментарий = ДокВозврат.Комментарий + ?(ЗначениеЗаполнено(ДокВозврат.Комментарий), ", ", "") + СтрокаВозврат.Комментарий;
				КонецЕсли;  
				
			КонецЕсли; 
			
		КонецЦикла;       
		
		ДокВозврат.Комментарий = ?(ЕстьРекламация, "", ДокВозврат.Комментарий);
		
		ПромЕстьРекламация = Не ДокВозврат.Товары.Найти("Рекламация", "Тип") = Неопределено;
		
		Если ПромЕстьРекламация Тогда   
			
			ДокВозврат.Статус = "На согласовании";
			ПромКомментарийОтмены = ""; 
			
		Иначе            
			
			Если ПромСтатусЗаявки = "Отказ в возврате" Тогда   
				
				Для Каждого СтрокаТаблЧасти Из ДокВозврат.Товары Цикл
					СтрокаТаблЧасти.Статус = ПромСтатусЗаявки;
				КонецЦикла;   
				
			КонецЕсли; 	
			
		КонецЕсли;
		
		Если НЕ ПромКомментарийОтмены = "" Тогда
			ДокВозврат.Комментарий =  ПромКомментарийОтмены + " " + СокрЛП(ДокВозврат.Комментарий);
		КонецЕсли;	
			
		ДокВозврат.Записать(?(ДокВозврат.Статус = "Отказ в возврате", РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		
		//+Белов А. 03.03.2026 #UT10-5722
		Если ДокВозврат.Статус = "На согласовании" Тогда
			
			Файлы = СоответствиеФайлыS3.Получить(ВыборкаДок.ИдентификаторДокумента); 
			
			Если Файлы <> Неопределено Тогда
				
				Для каждого СсылкаНаФайл Из Файлы Цикл
					
					МенеджерОчереди = РегистрыСведений.ОчередьЗагрузкиСсылокS3.СоздатьМенеджерЗаписи();
					МенеджерОчереди.Идентификатор = Строка(Новый УникальныйИдентификатор());
					МенеджерОчереди.Ссылка = СсылкаНаФайл;  
					МенеджерОчереди.Документ = ДокВозврат.Ссылка;
					МенеджерОчереди.Записать();				
					
				КонецЦикла;
				
			КонецЕсли;  
			
		КонецЕсли;
		//-Белов А. 03.03.2026 #UT10-5722
		
		ДанныеВозврата.Статус = ДокВозврат.Статус;
					
		МассивРезультат.Добавить(ДанныеВозврата);
		
	КонецЦикла;
	
	СтруктураВозврата.Данные = МассивРезультат;
	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;

КонецФункции


///////////////////order_run///////////////////
Функция ОтменитьРезервЗаказаСервер(СтрокаJSON) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_run.ОтменитьРезервЗаказа", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. ОтменитьРезервЗаказа");
	
	ПараметрыСтруктура 	= ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	СтруктураВозврата = ОтменитьРезервПоЗаказу(ПараметрыСтруктура);
	
	ДанныеВозврата = ОбщегоНазначения.ВернутьJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_run.ОтменитьРезервЗаказа", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ОтменитьРезервЗаказа. " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
		
	Возврат ДанныеВозврата;
	
КонецФункции	  

Функция ОтменитьРезервПоЗаказу(ПараметрыЗапроса)
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");
	
	ИдентификаторДокумента 	= СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента);
	ДокументЗаказКлиента 	= Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторДокумента));
	
	Если ДокументЗаказКлиента.ПолучитьОбъект() = Неопределено Тогда	
		СтруктураВозврата.Сообщение = "Не найден заказ клиента с таким ID";	
	Иначе 	
		
		Если ДокументЗаказКлиента.ПометкаУдаления Тогда
			
			СтруктураВозврата.Сообщение = "Заказа покупателя помечен на удаление"; 
			Возврат СтруктураВозврата;
			
		КонецЕсли;   
		
		ОбъектЗаказа = ДокументЗаказКлиента.ПолучитьОбъект();
		
		Если ПараметрыЗапроса.Свойство("ТоварыВРезерве") Тогда
			
			ТаблицаОстатков = ПолучитьОстатокТоваровПоЗаказуСГалкойТолькоРезерв(ДокументЗаказКлиента);
			
			Для каждого СтрокаРезерва Из ПараметрыЗапроса.ТоварыВРезерве Цикл
				
				СтрокаРезерваДокумента = ОбъектЗаказа.Товары.Найти(СтрокаРезерва.ИдентификаторСтроки, "КлючСтроки");
				
				Если СтрокаРезерваДокумента = Неопределено Тогда
					
					СтруктураВозврата.Сообщение = "Не найдена строка резерва с ключем " + Строка(СтрокаРезерва.ИдентификаторСтроки); 
					Возврат СтруктураВозврата;
					
				КонецЕсли;   
				
				СтрокаПоиска = ТаблицаОстатков.Найти(СтрокаРезерваДокумента.Номенклатура, "Номенклатура");
				
				Если СтрокаПоиска = Неопределено ИЛИ СтрокаПоиска.Остаток <> СтрокаРезерва.Количество Тогда
					
					Если СтрокаПоиска = Неопределено Тогда
						СтруктураВозврата.Сообщение = "Отсутствует товар в резерве по строке с ключем " + Строка(СтрокаРезерва.ИдентификаторСтроки);
					Иначе
						СтруктураВозврата.Сообщение = "Отличается количество товара в резерве по строке с ключем " + Строка(СтрокаРезерва.ИдентификаторСтроки) + " (" + Строка(СтрокаПоиска.Остаток) + "<>" + Строка(СтрокаРезерва.Количество) + ")";
					КонецЕсли;
					
					СтатусыЗаказов.ПоместитьВОчередьВФоне(Новый Структура("Ссылка", ДокументЗаказКлиента));                               
					Возврат СтруктураВозврата;
					
				КонецЕсли;
				
				СтрокаРезерваДокумента.ТолькоРезерв = Ложь;	
				
				ОбъектЗаказа.ТолькоРезерв = ОбъектЗаказа.Товары.НайтиСтроки(Новый Структура("ТолькоРезерв", Истина)).Количество() > 0								
				
			КонецЦикла; 
						
		Иначе
			ОбъектЗаказа.ТолькоРезерв = Ложь;
		КонецЕсли;	
		
		Попытка		
			
			ОбъектЗаказа.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			
			ДанныеДокумента = Новый Структура("ИдентификаторДокумента,НомерДокумента", Строка(ДокументЗаказКлиента.УникальныйИдентификатор()), СокрЛП(ДокументЗаказКлиента.Номер));
			
			СтруктураВозврата.Данные 	= ДанныеДокумента;
            СтруктураВозврата.Результат = Истина;
			СтруктураВозврата.Сообщение = "Заказ успешно снят с резерва и готов к сборке";		
			
		Исключение 		
			СтруктураВозврата.Сообщение = "Возникла ошибка при записи заказа" + Символы.ПС + ОписаниеОшибки();		
		КонецПопытки;  	  
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьОстатокТоваровПоЗаказуСГалкойТолькоРезерв(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	СУММА(ЗаказыПокупателейОстатки.КоличествоОстаток) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя = &Заказ
	|				И ТолькоРезерв) КАК ЗаказыПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПокупателейОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);  
	
	Возврат Запрос.Выполнить().Выгрузить();	
		
КонецФункции



///////////////////order_delete///////////////////
Функция ЗакрытьЗаказПокупателяСервер(СтрокаJSON) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_delete.ЗакрытьЗаказПокупателя", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. ЗакрытьЗаказПокупателя");
	
	ПараметрыСтруктура 	= ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	СтруктураВозврата = ВыполнитьЗакрытиеЗаказа(ПараметрыСтруктура);
	
	ДанныеВозврата = ОбщегоНазначения.ВернутьJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_delete.ЗакрытьЗаказПокупателя", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ЗакрытьЗаказПокупателя. " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
		
	Возврат ДанныеВозврата;
	
КонецФункции  

Функция ВыполнитьЗакрытиеЗаказа(ПараметрыЗапроса)
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
		
	ИдентификаторДокумента	= СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента);
	ДокументЗаказКлиента 	= Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторДокумента));
	
	Если ДокументЗаказКлиента.ПолучитьОбъект() = Неопределено Тогда	
		СтруктураВозврата.Сообщение = "Не найден заказ клиента с таким ID";	
	Иначе 
		
		Если МСКWEB.ЕстьСборка(ДокументЗаказКлиента) Тогда
			СтруктураВозврата.Сообщение = "Заказ уже отправлен на сборку";	
		ИначеЕсли МСКWEB.ЕстьЗаказПоставщику(ДокументЗаказКлиента) Тогда
			СтруктураВозврата.Сообщение = "По заказу уже сформирован заказ поставщику";	
		Иначе          		
			
			Попытка	  		
				
				ДокументЗакрытия = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
				ДокументЗакрытия.Заполнить(ДокументЗаказКлиента); 
				
				ДокументЗакрытия.Дата 			= ТекущаяДата();
				ДокументЗакрытия.ВидОперации 	= Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
				ДокументЗакрытия.Комментарий 	= "Документ сформирован через интернет-портал";
				ДокументЗакрытия.Записать(РежимЗаписиДокумента.Проведение);
				
				Если МСКWEB.ЕстьСборка(ДокументЗаказКлиента) Тогда
					
					ДокументЗакрытия.УстановитьПометкуУдаления(Истина);  
					
					СтруктураВозврата.Сообщение = "Заказ уже отправлен на сборку";	
					
				Иначе	
					
					СтруктураВозврата.Результат = Истина;
					СтруктураВозврата.Сообщение = "Заказ успешно отменен!";	
					
				КонецЕсли;
				
			Исключение 		
				СтруктураВозврата.Сообщение = "Возникла ошибка при записи документа снятия резервов" + Символы.ПС + ОписаниеОшибки();		
			КонецПопытки;  	
			
		КонецЕсли;
		
	КонецЕсли;
			
	Возврат СтруктураВозврата;
	
КонецФункции  


///////////////////order_goods_update///////////////////
Функция СкорректироватьТоварЗаказаСервер(СтрокаJSON) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_goods_update.СкорректироватьТоварЗаказа", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. СкорректироватьТоварЗаказаСервер");
	
	ПараметрыСтруктура 	= ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	СтруктураВозврата = ВыполнитьКорректировкуТовараЗаказа(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.order_goods_update.СкорректироватьТоварЗаказа", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. СкорректироватьТоварЗаказаСервер. " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
		
	Возврат СтруктураВозврата;
	
КонецФункции 

Функция ВыполнитьКорректировкуТовараЗаказа(ПараметрыЗапроса) Экспорт 
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение, КодОтвета", Ложь, "", 200);               
	
	МассивСтатусовПроверки = Новый Массив;     
	МассивСтатусовПроверки.Добавить("Заказан");
	МассивСтатусовПроверки.Добавить("Заказано поставщику");
	МассивСтатусовПроверки.Добавить("Зарезервирован");	
	МассивСтатусовПроверки.Добавить("На подборе");
	МассивСтатусовПроверки.Добавить("Готов к отгрузке");	
	
	ИдентификаторЗаказа = ПараметрыЗапроса.ИдентификаторЗаказа;   
	КодМДМНоменклатуры 	= ПараметрыЗапроса.КодМДМНоменклатуры; 
	ИдентификаторЗапроса = ПараметрыЗапроса.ИдентификаторЗапроса;
	Количество = Число(ПараметрыЗапроса.Количество);        
	Статус = ПараметрыЗапроса.Статус;  
	
	Если МассивСтатусовПроверки.Найти(Статус) = Неопределено Тогда
		
		СтруктураВозврата.Сообщение = "Запрещено изменять количество для товара со статусом: " + Статус;	
		Возврат СтруктураВозврата;
		
	КонецЕсли;

	Заказ = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЗаказа));
	
	Если Заказ.ПолучитьОбъект() = Неопределено Тогда
   		
		СтруктураВозврата.Сообщение = "Не найден заказ клиента с ID: " + Строка(ИдентификаторЗаказа);	
		Возврат СтруктураВозврата;
		
	КонецЕсли;    
	
	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", КодМДМНоменклатуры);
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		
		СтруктураВозврата.Сообщение = "Не найдена Номенклатура с кодом МДМ: " + Строка(КодМДМНоменклатуры);
		Возврат СтруктураВозврата;
		
	КонецЕсли;   
	
	ЭтоСтороннийСклад = ЗначениеЗаполнено(Заказ.IDСклада_СтороннийСклад); 
	
	Если ЭтоСтороннийСклад И Статус <> "Заказан" Тогда
		
		СтруктураВозврата.Сообщение = "Для сторонних складов изменять количество можно только из статуса Заказан" ;
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Заказ
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказахНовые КАК ЗапросыИзмененияКоличестваВЗаказахНовые
	|ГДЕ
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Идентификатор = &Идентификатор
	|	И ЗапросыИзмененияКоличестваВЗаказахНовые.Номенклатура = &Номенклатура
	|	И ЗапросыИзмененияКоличестваВЗаказахНовые.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторЗапроса);
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		
		СтруктураВозврата.Сообщение = "Уже найден запрос изменения с идентификатором: " + Строка(ИдентификаторЗапроса);
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	МассивЗаказов = Новый Массив; 
	МассивЗаказов.Добавить(Заказ);  
	
	Попытка
		СтруктураРезультата = МодульИнтеграцииСПорталом.ПолучитьДанныеПоЗаказамСервер(Новый Структура("ДетальнаяИнформация", "1"), МассивЗаказов);	
	Исключение
		
		СтруктураВозврата.Сообщение = "Возникла ошибка при получении статусов по заказу: " + ОписаниеОшибки();
		Возврат СтруктураВозврата;
		
	КонецПопытки;
	
	Если СтруктураРезультата.Результат Тогда
		
		Данные = СтруктураРезультата.Данные; 
		
		Если Данные.Количество() > 0 Тогда
			
			ЗаказСтруктура = Данные[0]; 
			ТоварыТаблица = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ЗаказСтруктура.Товары);
			
			СтрокиПоиска = ТоварыТаблица.НайтиСтроки(Новый Структура("Статус, НомерНоменклатуры", Статус, Номенклатура.Код));   
			
			Если СтрокиПоиска.Количество() > 0 Тогда
				
				КоличествоПоСтатусу = СтрокиПоиска[0].Количество;
				
				Если КоличествоПоСтатусу < Количество Тогда
					
					СтруктураВозврата.Сообщение = "Количество товара по статусу " + Строка(Статус) + " в заказе меньше количества на уменьшение: " + Строка(КоличествоПоСтатусу) + " < " + Строка(Количество);  
					СтруктураВозврата.КодОтвета = 406;   
					
				Иначе    
					
					Менеджер = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.СоздатьМенеджерЗаписи();
					Менеджер.Заказ = Заказ;
					Менеджер.Номенклатура = Номенклатура;
					Менеджер.Идентификатор = ИдентификаторЗапроса; 
					Менеджер.Количество = Количество; 
					Менеджер.ДатаСоздания = ТекущаяДата();
					Менеджер.СтатусТовара = Статус; 
					
					Если Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала И (Статус <> "Готов к отгрузке" И Статус <> "Заказан") Тогда
						
						Менеджер.Статус = Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Обрабатывается;
						Менеджер.ОжидаемыеСтатусы = "Готов к отгрузке";
						Менеджер.КомментарийОбработки = "Ожидаем готовности к отгрузке для отмены";
						
					Иначе						
						Менеджер.Статус = Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Новый;					
					КонецЕсли;					
					
					Менеджер.Записать(Истина); 
					
					СтруктураВозврата.Результат = Истина;
					СтруктураВозврата.Сообщение = "Запрос на изменение количества успешно добавлен в очередь обработки";
				
				КонецЕсли;
				
			Иначе
				
				СтруктураВозврата.Сообщение = "Не найдены товар в заказе со статусом: " + Строка(Статус);  
				СтруктураВозврата.КодОтвета = 406;

			КонецЕсли;
			
		Иначе
			
			СтруктураВозврата.Сообщение = "Была полученая пустая таблица данных по заказу";
			Возврат СтруктураВозврата;	
			
		КонецЕсли;
		
	Иначе
		
		СтруктураВозврата.Сообщение = "Возникла ошибка при получении статусов по заказу: " + СтруктураРезультата.Сообщение;
		Возврат СтруктураВозврата;		
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
		
КонецФункции 

Процедура ОбработатьЗапросыИзмененияКоличестваВЗаказах() Экспорт
	
	МассивСтатусов = Новый Массив;  
	МассивСтатусов.Добавить(Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Новый);
	МассивСтатусов.Добавить(Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Обрабатывается);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Заказ КАК Заказ,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Номенклатура,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Идентификатор,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Количество,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Статус,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.ДатаСоздания,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.ДатаОбработки,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Комментарий,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.СвязанныйДокумент,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.СтатусТовара,
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.ОжидаемыеСтатусы
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказахНовые КАК ЗапросыИзмененияКоличестваВЗаказахНовые
	|ГДЕ
	|	ЗапросыИзмененияКоличестваВЗаказахНовые.Статус В(&МассивСтатусов)
	|	И НЕ ЗапросыИзмененияКоличестваВЗаказахНовые.Заказ.ПометкаУдаления
	|ИТОГИ ПО
	|	Заказ";
	
	Запрос.УстановитьПараметр("МассивСтатусов", МассивСтатусов);  
	
	ВыборкаЗаказы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаказы.Следующий() Цикл 		
		
		Заказ = ВыборкаЗаказы.Заказ;
		
		МассивЗаказов = Новый Массив; 
		МассивЗаказов.Добавить(Заказ);  
		
		Попытка
			СтруктураРезультата = МодульИнтеграцииСПорталом.ПолучитьДанныеПоЗаказамСервер(Новый Структура("ДетальнаяИнформация", "1"), МассивЗаказов);	
		Исключение
			
			ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Ошибка, , , "Возникла ошибка при получении статусов по заказу " + Строка(Заказ) + ": " + ОписаниеОшибки());     
			Продолжить;
			
		КонецПопытки;  
		
		Если СтруктураРезультата.Результат И СтруктураРезультата.Данные.Количество() > 0 Тогда
			
			ЗаказСтруктура = СтруктураРезультата.Данные[0]; 
			ТоварыТаблица = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(ЗаказСтруктура.Товары);     
					
			Выборка = ВыборкаЗаказы.Выбрать();  
			
			Пока Выборка.Следующий() Цикл   
				
				ЖдемСтатус = Ложь;
				
				Количество = Выборка.Количество;    
				Номенклатура = Выборка.Номенклатура;
				Идентификатор = Выборка.Идентификатор;
				
				Если Выборка.Статус = Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Обрабатывается Тогда
					
					Если ЗначениеЗаполнено(Выборка.ОжидаемыеСтатусы) Тогда 
						
						СтатусТовара = Выборка.ОжидаемыеСтатусы;     
						ЖдемСтатус = Истина;
						
					Иначе
						//Обработка таких записей происходит по подписке
						Продолжить;
					КонецЕсли;   
					
				Иначе
					СтатусТовара = Выборка.СтатусТовара;						
				КонецЕсли;                                  				
				
				СтрокиПоиска = ТоварыТаблица.НайтиСтроки(Новый Структура("Статус, НомерНоменклатуры", СтатусТовара, Выборка.Номенклатура.Код));  
				
				Если СтрокиПоиска.Количество() > 0 Тогда
					
					КоличествоПоСтатусу = СтрокиПоиска[0].Количество;
					
					Если КоличествоПоСтатусу < Количество Тогда
						
						Если Не ЖдемСтатус Тогда
							
							ДопПараметры = Новый Структура("ДатаОбработки, Комментарий", ТекущаяДата(), "Количество товара по статусу " + Строка(СтатусТовара) + " в заказе меньше количества на уменьшение: " + Строка(КоличествоПоСтатусу) + " < " + Строка(Количество));
							РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Заказ, Номенклатура, Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Отменен, ДопПараметры); 
						
						КонецЕсли; 
						
					Иначе
						//Запускаем процесс обработки запроса
						
						Попытка
							ОбработатьЗапросИзмененияКоличества(Выборка, СтатусТовара);	
						Исключение
							ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Ошибка, , , "Возникла ошибка при обработке запроса по заказу " + Строка(Заказ) + " товар " + Строка(Номенклатура) + ": " + ОписаниеОшибки());     			
						КонецПопытки;						
						
					КонецЕсли;
					
				Иначе
					
					Если Не ЖдемСтатус Тогда
						
						ДопПараметры = Новый Структура("ДатаОбработки, Комментарий", ТекущаяДата(), "Не найдены товар в заказе со статусом: " + Строка(СтатусТовара));
						РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Заказ, Номенклатура, Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Отменен, ДопПараметры); 						
						
					КонецЕсли; 				
					
				КонецЕсли;				
				
			КонецЦикла;
			
		Иначе
			ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось получить данные по заказу " + Строка(Заказ));     			
		КонецЕсли;	
		
	КонецЦикла;  
	
КонецПроцедуры   

Процедура ОбработатьЗапросИзмененияКоличества(Выборка, СтатусТовара)
	
	Если СтатусТовара = "Заказан" ИЛИ СтатусТовара = "Зарезервирован" Тогда  
		
		ТаблицаТоваров = ПолучитьПустуюТаблицаТоваровКорректировкиЗаказа();  
		
		НСтр = ТаблицаТоваров.Добавить();
		НСтр.Номенклатура = Выборка.Номенклатура;
		НСтр.Количество = Выборка.Количество * -1;
		
		Корректировка = СоздатьКорректировкуЗаказаПокупателяПоТаблицеТоваров(Выборка.Заказ, Истина, ТаблицаТоваров, ?(СтатусТовара = "Зарезервирован", Истина, Ложь), Перечисления.ПричиныКорректировкиСборки.ОтказКлиента);
		
		Если ЗначениеЗаполнено(Корректировка) Тогда
			
			ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), "Успешно создан документ корректировки заказа: " + Строка(Корректировка));
			РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Выполнен, ДопПараметры);
			
		КонецЕсли; 	
		
	ИначеЕсли СтатусТовара = "Заказано поставщику" Тогда 
		СкорректироватьПоСтатусуЗаказаноПоставщику(Выборка);	
	ИначеЕсли СтатусТовара = "На подборе" Тогда
		СкорректироватьПоСтатусуНаПодборе(Выборка);	
	ИначеЕсли СтатусТовара = "Готов к отгрузке" Тогда
		СкорректироватьПоСтатусуГотовКОтгрузке(Выборка);	
	КонецЕсли;
		
КонецПроцедуры

Процедура СкорректироватьПоСтатусуЗаказаноПоставщику(Выборка)
	
	ТаблицаТоваровКорректировкаЗаказаПоставщику = ПолучитьПустуюТаблицаТоваровКорректировкиЗаказаПоставщику(); 
	
	НСтр = ТаблицаТоваровКорректировкаЗаказаПоставщику.Добавить();
	НСтр.Номенклатура = Выборка.Номенклатура;
	НСтр.Количество = Выборка.Количество * -1;     
	
	ТаблицаТоваров = ПолучитьПустуюТаблицаТоваровКорректировкиЗаказа();
	
	НСтр = ТаблицаТоваров.Добавить();
	НСтр.Номенклатура = Выборка.Номенклатура;
	НСтр.Количество = Выборка.Количество * -1;
	
	Попытка			
		
		НачатьТранзакцию();
		
		КорректировкаЗаказаПоставщику = СоздатьКорректировкуЗаказаПоставщикуПоТаблицеТоваров(ПолучитьЗаказПоставщикуПоЗаказуИТовару(Выборка.Заказ, Выборка.Номенклатура), Истина, ТаблицаТоваровКорректировкаЗаказаПоставщику, Истина);
		
		Если ЗначениеЗаполнено(КорректировкаЗаказаПоставщику) Тогда				
			
			Корректировка = СоздатьКорректировкуЗаказаПокупателяПоТаблицеТоваров(Выборка.Заказ, Истина, ТаблицаТоваров, Ложь);   
			
			Если ЗначениеЗаполнено(Корректировка) Тогда   
				
				ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), "Успешно создан документ корректировки заказа поставщику: " + Строка(КорректировкаЗаказаПоставщику) + Символы.ПС + "Успешно создан документ корректировки заказа: " + Строка(Корректировка));
				РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Выполнен, ДопПараметры);
				
				ЗафиксироватьТранзакцию();
				
			Иначе
				ВызватьИсключение("Не удалось создать корректировку заказа");	
			КонецЕсли;
			
		Иначе
			ВызватьИсключение("Не удалось создать корректировку заказа поставщику");
		КонецЕсли;
		
	Исключение               
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации("Изменения количества товаров в заказах новое", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось создать документы по заказу: " + Строка(Выборка.Заказ) + " " + ОписаниеОшибки());     			
		
	КонецПопытки; 
		
КонецПроцедуры

Процедура СкорректироватьПоСтатусуНаПодборе(Выборка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	ТоварыВСборкеОстатки.ЗаказПокупателя,
	|	ТоварыВСборкеОстатки.Сборка,
	|	ТоварыВСборкеОстатки.КСборкеОстаток
	|ПОМЕСТИТЬ ТаблицаРезультат
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			ЗаказПокупателя = &Заказ
	|				И Номенклатура = &Номенклатура) КАК ТоварыВСборкеОстатки
	|ГДЕ
	|	ТоварыВСборкеОстатки.СобраноОстаток = 0
	|	И НЕ ТоварыВСборкеОстатки.КСборкеОстаток = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультат.ЗаказПокупателя,
	|	ТаблицаРезультат.Номенклатура,
	|	ТаблицаРезультат.Сборка,
	|	ТаблицаРезультат.КСборкеОстаток,
	|	НапечатанныеДокументы.ДатаПечати КАК Распечатан
	|ИЗ
	|	ТаблицаРезультат КАК ТаблицаРезультат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НапечатанныеДокументы КАК НапечатанныеДокументы
	|		ПО ТаблицаРезультат.Сборка = НапечатанныеДокументы.Документ
	|ГДЕ
	|	НапечатанныеДокументы.ДатаПечати ЕСТЬ NULL
	|	И НЕ ТаблицаРезультат.ЗаказПокупателя ЕСТЬ NULL";  
	
	Запрос.УстановитьПараметр("Заказ", Выборка.Заказ); 
	Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
	
	ВыборкаСборок = Запрос.Выполнить().Выбрать(); 
	
	Если ВыборкаСборок.Следующий() И ВыборкаСборок.КСборкеОстаток >= Выборка.Количество Тогда
				
		КорректировкаСборки = СоздатьКорректировкуСборки(ВыборкаСборок.Сборка, ВыборкаСборок.ЗаказПокупателя, ВыборкаСборок.Номенклатура, Выборка.Количество);
		
		ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), "Успешно создан документ корректировки сборки: " + Строка(КорректировкаСборки));
		РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Выполнен, ДопПараметры);	
		
	Иначе
		
		ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), "Не удалось скорректировать количество по запросу. Заказ уже находится в сборке");
		РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Отменен, ДопПараметры);	

	КонецЕсли;
		
КонецПроцедуры

Процедура СкорректироватьПоСтатусуГотовКОтгрузке(Выборка)
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПоЗаданиям.ЗаданиеНаСборку КАК ЗаданиеНаСборку,
		|	СУММА(ОстаткиПоЗаданиям.КоличествоОборот) КАК КоличествоОборот
		|ПОМЕСТИТЬ УжеВезем
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ЗаданиеНаДоставкуОбороты.ЗаданиеНаСборку КАК ЗаданиеНаСборку,
		|		СУММА(ЗаданиеНаДоставкуОбороты.КоличествоОборот) КАК КоличествоОборот
		|	ИЗ
		|		РегистрНакопления.ЗаданиеНаДоставку.Обороты(&Д1, &Д2, Регистратор, ЗаданиеНаСборку.Заказано.Заказ = &Заказ) КАК ЗаданиеНаДоставкуОбороты
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЗаданиеНаДоставкуОбороты.ЗаданиеНаСборку) КАК ОстаткиПоЗаданиям
		|ГДЕ
		|	НЕ ОстаткиПоЗаданиям.КоличествоОборот = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПоЗаданиям.ЗаданиеНаСборку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВСборкеОстатки.Номенклатура,
		|	ТоварыВСборкеОстатки.ЗаказПокупателя,
		|	ТоварыВСборкеОстатки.Сборка,
		|	ТоварыВСборкеОстатки.СобраноОстаток
		|ПОМЕСТИТЬ ТаблицаРезультат
		|ИЗ
		|	РегистрНакопления.ТоварыВСборке.Остатки(
		|			,
		|			ЗаказПокупателя = &Заказ
		|				И Номенклатура = &Номенклатура) КАК ТоварыВСборкеОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ УжеВезем КАК УжеВезем
		|		ПО ТоварыВСборкеОстатки.Сборка = УжеВезем.ЗаданиеНаСборку
		|ГДЕ
		|	ТоварыВСборкеОстатки.Сборка.ДокументСобранИУпакован
		|	И УжеВезем.ЗаданиеНаСборку ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Ссылка КАК ГрузовоеМесто,
		|	ГрузовоеМестоТовары.Количество,
		|	ТаблицаРезультат.Сборка
		|ИЗ
		|	ТаблицаРезультат КАК ТаблицаРезультат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|		ПО ТаблицаРезультат.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		|			И ТаблицаРезультат.ЗаказПокупателя = ГрузовоеМестоТовары.Заказ
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Проведен
		|	И НЕ ГрузовоеМестоТовары.Ссылка.Погружено
		|	И НЕ ГрузовоеМестоТовары.Ссылка.Неактуально_КорректировкаСборки
		|	И ГрузовоеМестоТовары.Заказ = &Заказ
		|	И ГрузовоеМестоТовары.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Заказ", Выборка.Заказ); 
		Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура); 
		Запрос.УстановитьПараметр("Д1", ТекущаяДата() - 86400*14);
		Запрос.УстановитьПараметр("Д2", ТекущаяДата());
		
		ВыборкаГМ = Запрос.Выполнить().Выбрать(); 
		
		МассивСозданныхКорректировок = Новый Массив;
		
		КоличествоСкорректировать = Выборка.Количество;
		
		Пока ВыборкаГМ.Следующий() Цикл
			
			Если КоличествоСкорректировать <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			КоличествоТекущегоСписания = 0;
			
			Если КоличествоСкорректировать > ВыборкаГМ.Количество Тогда
				
				КоличествоТекущегоСписания = ВыборкаГМ.Количество;
				КоличествоСкорректировать = КоличествоСкорректировать - КоличествоТекущегоСписания;
				
			Иначе			
				
				КоличествоТекущегоСписания = КоличествоСкорректировать;
				КоличествоСкорректировать = 0;
				
			КонецЕсли; 
			
			НачатьТранзакцию();
			
			КорректировкаГМ = СоздатьКорректировкуГрузоместа(ВыборкаГМ.ГрузовоеМесто, Выборка.Заказ, Выборка.Номенклатура, КоличествоТекущегоСписания);
			
			МассивСозданныхКорректировок.Добавить(КорректировкаГМ);
			
		КонецЦикла;
		
		Если КоличествоСкорректировать = 0 Тогда
			
			КомментарийОбработки = "";
			
			Для каждого Корр Из МассивСозданныхКорректировок Цикл
				КомментарийОбработки = КомментарийОбработки + ?(ЗначениеЗаполнено(КомментарийОбработки), Символы.ПС, "") + "Успешно создан документ корректировки ГМ: " + Строка(Корр);	
			КонецЦикла;
			
			ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), КомментарийОбработки);
			РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Выполнен, ДопПараметры);
			
			ЗафиксироватьТранзакцию();
			
		Иначе
			
			//Отменяем созданные документы корректирвоки, если они были
			Если ТранзакцияАктивна() Тогда			
				ОтменитьТранзакцию();
			КонецЕсли;	
			
			//Не удалось значит скорректировать все количество, отменяем запрос	
			ДопПараметры = Новый Структура("ДатаОбработки, КомментарийОбработки", ТекущаяДата(), "Не удалось скорректироваь все количество по запросу");
			РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказахНовые.ИзменитьСтатусЗапроса(Выборка.Заказ, Выборка.Номенклатура, Выборка.Идентификатор, Перечисления.СтатусыЗапросовИзмененияКоличестваВЗаказах.Отменен, ДопПараметры);	
			
		КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьЗаказПоставщикуПоЗаказуИТовару(Заказ, Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			,
	|			ЗаказПокупателя = &Заказ
	|				И Номенклатура = &Номенклатура) КАК РазмещениеЗаказовПокупателейОстатки";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);  
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЗаказПоставщику;
	КонецЕсли;                          
	
	Возврат Неопределено;	
	
КонецФункции

Функция ПолучитьПустуюТаблицаТоваровКорректировкиЗаказа()
	
	ТаблицаТоваров = Новый ТаблицаЗначений;  
	ТаблицаТоваров.Колонки.Добавить("Номенклатура"); 
	ТаблицаТоваров.Колонки.Добавить("СерияНоменклатуры");
	ТаблицаТоваров.Колонки.Добавить("Размещение"); 
	ТаблицаТоваров.Колонки.Добавить("Количество");
	
	Возврат ТаблицаТоваров;
	
КонецФункции 

Функция ПолучитьПустуюТаблицаТоваровКорректировкиЗаказаПоставщику()
	
	ТаблицаТоваров = Новый ТаблицаЗначений;  
	ТаблицаТоваров.Колонки.Добавить("Номенклатура"); 
	ТаблицаТоваров.Колонки.Добавить("Количество");
	
	Возврат ТаблицаТоваров;
	
КонецФункции

Функция СоздатьКорректировкуЗаказаПокупателяПоТаблицеТоваров(Заказ, Проведение, ТаблицаТоваров, ПоОстаткам = Ложь, Причина = Неопределено) 
	
	НовыйДок = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.ЗаказПокупателя = Заказ;
	НовыйДок.Заполнить(Заказ);
	НовыйДок.Комментарий = "Корректировка по запросу с портала";
	
	ТабЧастьТовары = НовыйДок.Товары;
	
	Если Не ПоОстаткам Тогда
			
		ТабЧастьТовары.Очистить();
		
		Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл 
			
			НоваяСтрока = ТабЧастьТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
			НоваяСтрока.ОтказПоставщика = Справочники.ПричиныЗакрытияЗаказов.ОтказПокупателя;     		
						
		КонецЦикла;          	
		
	Иначе          
		
		МассивУдаления = Новый Массив;
		
		Для каждого Стр Из ТаблицаТоваров Цикл   			
			
			СтрокиПоиска = ТабЧастьТовары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
			
			Для каждого СтрПоиска Из СтрокиПоиска Цикл
				
				Если Стр.Количество = 0 Тогда 
					
					МассивУдаления.Добавить(СтрПоиска);	    
					Продолжить;
					
				КонецЕсли;
				
				//-5, а в отмене -3
				Если СтрПоиска.Количество <= Стр.Количество Тогда
					
					СтрПоиска.Количество = Стр.Количество; 
					Стр.Количество = 0;	
					
				//-1, а в отмене -4
				ИначеЕсли СтрПоиска.Количество > Стр.Количество Тогда 				
					Стр.Количество = Стр.Количество - СтрПоиска.Количество;										
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;  
		
		//+Марков И. 29.07.2026 #UT10-5964
		Для Каждого Стр Из ТабЧастьТовары Цикл
			
			СтрокиПоиска = ТаблицаТоваров.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
			
			Если СтрокиПоиска.Количество() = 0 И МассивУдаления.Найти(Стр) = Неопределено Тогда
				МассивУдаления.Добавить(Стр);	    
			КонецЕсли;	
			
		КонецЦикла;
		//-Марков И. 29.07.2026 #UT10-5964
		
		Для каждого СтрУдаления Из МассивУдаления Цикл
			ТабЧастьТовары.Удалить(СтрУдаления);	
		КонецЦикла;
		
	КонецЕсли;     
	
	Для Каждого СтрокаТовары Из ТабЧастьТовары Цикл 
		
		Если ЗначениеЗаполнено(Причина) Тогда
			СтрокаТовары.Причина = Причина;
		КонецЕсли;
		
		// Получаем среднюю цену закупки
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество * ЗаказПокупателяТовары.Цена) КАК СуммаПодсчит,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест,
		|	ЗаказПокупателяТовары.Коэффициент
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.Номенклатура = &Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЗаказПокупателяТовары.ЕдиницаИзмеренияМест,
		|	ЗаказПокупателяТовары.Коэффициент";
		
		Запрос.УстановитьПараметр("Ссылка", Заказ);
		Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);	
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ЕдиницаХраненияОстатков;
		ЕдиницаИзмеренияМест = Справочники.ЕдиницыИзмерения.ПустаяСсылка();
		Коэф = 1;
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ЦенаЗакупкиЗаЕдиницу = Окр(ВыборкаЗапроса.СуммаПодсчит / ВыборкаЗапроса.Количество, 2, 1);  
			ЕдиницаИзмерения = ВыборкаЗапроса.ЕдиницаИзмерения;
			ЕдиницаИзмеренияМест = ВыборкаЗапроса.ЕдиницаИзмеренияМест;
			Коэф = ВыборкаЗапроса.Коэффициент;
			
		КонецЦикла;	 			
		
		СтрокаТовары.ЕдиницаИзмерения = ЕдиницаИзмерения;
		СтрокаТовары.ЕдиницаИзмеренияМест = ЕдиницаИзмеренияМест;
		СтрокаТовары.Коэффициент = Коэф;
		
		СтрокаТовары.Цена = ЦенаЗакупкиЗаЕдиницу;
		
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовары, НовыйДок);
		
	КонецЦикла;
	
	Попытка 	
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);				
	Исключение    
		
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#Иначе
			ЗаписьЖурналаРегистрации("Создание корректировки Заказа покупателя", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		#КонецЕсли	 
		
		Возврат Неопределено;
		
	КонецПопытки; 
	
	Возврат НовыйДок.Ссылка;

КонецФункции

Функция СоздатьКорректировкуЗаказаПоставщикуПоТаблицеТоваров(ЗаказПоставщику, Проведение, ТаблицаТоваров, ПоОстаткам = Ложь) 
	
	НовыйДок = Документы.КорректировкаЗаказаПоставщику.СоздатьДокумент();
	
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Заполнить(ЗаказПоставщику);
	НовыйДок.Комментарий = "Корректировка по запросу с портала";
	
	ТабЧастьТовары = НовыйДок.Товары;
	
	Если Не ПоОстаткам Тогда
			
		ТабЧастьТовары.Очистить();
		
		Для Каждого СтрокаТовары Из ТаблицаТоваров Цикл 
			
			НоваяСтрока = ТабЧастьТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);  		
						
		КонецЦикла;          	
		
	Иначе          
		
		МассивУдаления = Новый Массив;
		
		Для каждого Стр Из ТаблицаТоваров Цикл   			
			
			СтрокиПоиска = ТабЧастьТовары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
			
			Для каждого СтрПоиска Из СтрокиПоиска Цикл
				
				Если Стр.Количество = 0 Тогда 
					
					МассивУдаления.Добавить(СтрПоиска);	    
					Продолжить;
					
				КонецЕсли;
				
				//-5, а в отмене -3
				Если СтрПоиска.Количество <= Стр.Количество Тогда
					
					СтрПоиска.Количество = Стр.Количество; 
					Стр.Количество = 0;	
					
				//-1, а в отмене -4
				ИначеЕсли СтрПоиска.Количество > Стр.Количество Тогда 				
					Стр.Количество = Стр.Количество - СтрПоиска.Количество;										
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;  
		
		Для каждого СтрУдаления Из МассивУдаления Цикл
			ТабЧастьТовары.Удалить(СтрУдаления);	
		КонецЦикла;
		
	КонецЕсли;     
	
	Для Каждого СтрокаТовары Из ТабЧастьТовары Цикл
		
		ЗаказПоставщикаТоварыСтрока = ЗаказПоставщику.Товары.НайтиСтроки(Новый Структура("Номенклатура, Заказ", СтрокаТовары.Номенклатура, СтрокаТовары.Заказ));
		СтрокаТовары.Цена = ЗаказПоставщикаТоварыСтрока[0].Цена;
		
		ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуТабЧасти(СтрокаТовары, НовыйДок);  
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТовары, НовыйДок);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТовары, НовыйДок); 
		
	КонецЦикла;
	
	Попытка 	
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);				
	Исключение    
		
		#Если Клиент Тогда
			Сообщить(ОписаниеОшибки());
		#Иначе
			ЗаписьЖурналаРегистрации("Создание корректировки Заказа покупателя", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		#КонецЕсли	 
		
		Возврат Неопределено;
		
	КонецПопытки; 
	
	Возврат НовыйДок.Ссылка;

КонецФункции

Функция СоздатьКорректировкуГрузоместа(ПромГрузоместо, ПромЗаказ, ПромТовар, ПромКоличество) 
	
	ПромКоличествоКорректировать = ПромКоличество;
	КорректировкаГрузовогоМеста = Документы.КорректировкаГрузовогоМеста.СоздатьДокумент();
	КорректировкаГрузовогоМеста.ГрузовоеМесто   = ПромГрузоместо;
	КорректировкаГрузовогоМеста.Исполнено		= Ложь;
	КорректировкаГрузовогоМеста.Контрагент		= ПромГрузоместо.Сборка.Контрагент;
	КорректировкаГрузовогоМеста.Грузополучатель = ПромГрузоместо.Сборка.Грузополучатель;
	КорректировкаГрузовогоМеста.Организация 	= ПромГрузоместо.Сборка.Организация;		
	КорректировкаГрузовогоМеста.Дата            = ТекущаяДата();
	КорректировкаГрузовогоМеста.Комментарий     = "Корректировка по запросу с портала";
	
	СтрокиПоТоваруГрузоместе = ПромГрузоместо.Товары.НайтиСтроки(Новый Структура("Заказ, Номенклатура", ПромЗаказ, ПромТовар));
	
	Если НЕ СтрокиПоТоваруГрузоместе.Количество() = 0 Тогда
		
		Для Каждого СтрокаИзГрузоместа ИЗ СтрокиПоТоваруГрузоместе Цикл
			
			Если НЕ ПромКоличествоКорректировать = 0 Тогда 
				
				НоваяСтрокаКорректировки = КорректировкаГрузовогоМеста.Товары.Добавить();
				НоваяСтрокаКорректировки.Заказ = СтрокаИзГрузоместа.Заказ;
				НоваяСтрокаКорректировки.Номенклатура = СтрокаИзГрузоместа.Номенклатура;
				НоваяСтрокаКорректировки.КоличествоВГрузоместе = СтрокаИзГрузоместа.Количество;
				НоваяСтрокаКорректировки.Количество = Мин(ПромКоличествоКорректировать, СтрокаИзГрузоместа.Количество);
				ПромКоличествоКорректировать = ?(ПромКоличествоКорректировать >= СтрокаИзГрузоместа.Количество, ПромКоличествоКорректировать - СтрокаИзГрузоместа.Количество, 0);
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	ПромКоличество = ПромКоличествоКорректировать; 
	КорректировкаГрузовогоМеста.Записать(РежимЗаписиДокумента.Проведение);	
	
	Возврат КорректировкаГрузовогоМеста.Ссылка;

КонецФункции

Функция СоздатьКорректировкуСборки(ПромСборка, ПромЗаказ, ПромТовар, ПромКоличество)
	
	ПромКоличествоКорректировать = ПромКоличество;
	
	КорректировкаСборкиЗаказов = Документы.КорректировкаСборкиЗаказовПокупателя.СоздатьДокумент();
	КорректировкаСборкиЗаказов.СборкаЗаказовПокупателя   =  ПромСборка;
	КорректировкаСборкиЗаказов.Исполнено				 =  Истина;
	КорректировкаСборкиЗаказов.Контрагент				 =  ПромСборка.Контрагент;
	КорректировкаСборкиЗаказов.Грузополучатель 		     =	ПромСборка.Грузополучатель;
	КорректировкаСборкиЗаказов.Организация 			     =	ПромСборка.Организация;		
	КорректировкаСборкиЗаказов.Ответственный		     =	Справочники.ФизическиеЛица.Автосборка;	
	КорректировкаСборкиЗаказов.Дата                      =  ТекущаяДата();
	КорректировкаСборкиЗаказов.Комментарий               =  "Корректировка по запросу с портала";
	
	СтрокиПоТоварувСборке = ПромСборка.Заказано.НайтиСтроки(Новый Структура("Заказ, Номенклатура", ПромЗаказ, ПромТовар));
	
	Если НЕ СтрокиПоТоварувСборке.Количество() = 0 Тогда
		
		Для Каждого СтрокаИзСборки ИЗ СтрокиПоТоварувСборке Цикл
			
			Если НЕ ПромКоличествоКорректировать = 0 Тогда 
				
				НоваяСтрокаКорректировки = КорректировкаСборкиЗаказов.Товары.Добавить();
				НоваяСтрокаКорректировки.ЗаказПокупателя = СтрокаИзСборки.Заказ;
				НоваяСтрокаКорректировки.Номенклатура = СтрокаИзСборки.Номенклатура;
				НоваяСтрокаКорректировки.Ячейка = СтрокаИзСборки.Ячейка;
				НоваяСтрокаКорректировки.Склад = СтрокаИзСборки.Заказ.СкладГруппа;
				НоваяСтрокаКорректировки.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
				НоваяСтрокаКорректировки.Количество = Мин(ПромКоличествоКорректировать, СтрокаИзСборки.Количество);
				ПромКоличествоКорректировать = ?(ПромКоличествоКорректировать >= СтрокаИзСборки.Количество, ПромКоличествоКорректировать - СтрокаИзСборки.Количество, 0);
				
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
	КорректировкаСборкиЗаказов.ПровестиИСоздатьКорректировкиЗаказа();	
	
	Возврат КорректировкаСборкиЗаказов.Ссылка;
	
КонецФункции


///////////////////return_delete///////////////////
Функция ОтменитьВозвратПокупателяСервер(СтрокаJSON) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.return_delete.ОтменитьВозвратПокупателя", УровеньЖурналаРегистрации.Информация,,, "HTTP-сервис:Запуск. ОтменитьВозвратПокупателя");
	
	ПараметрыСтруктура 	= ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	СтруктураВозврата = ВыполнитьОтменуВозвратаПокупателя(ПараметрыСтруктура);
	
	ДанныеВозврата = ОбщегоНазначения.ВернутьJSON(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.return_delete.ОтменитьВозвратПокупателя", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ОтменитьВозвратПокупателя. " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." 
	+ " Запрос:" + Символы.ПС + СтрокаJSON);
		
	Возврат ДанныеВозврата;
	
КонецФункции      

Функция ВыполнитьОтменуВозвратаПокупателя(ПараметрыЗапроса)   
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	ИдентификаторДокумента		= СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента);
	
	//+Сёмин Р.И. 25.03.2026 #UT10-5777
	//ИдентификаторКонтрагента	= СокрЛП(ПараметрыЗапроса.ИдентификаторКонтрагента);
	//-Сёмин Р.И. 25.03.2026 #UT10-5777
	
	ДокументЗаявка = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторДокумента)); 
	
	Если ДокументЗаявка.ПолучитьОбъект() = Неопределено Тогда   
		
		СтруктураВозврата.Сообщение = "В базе УТ не найдена заявка на возврат";	
		Возврат ДокументЗаявка;
		
	Иначе	
		
		//+Сёмин Р.И. 25.03.2026 #UT10-5777
		//РеализацияПринадлежитДругомуКонтрагенту = Ложь; 
		//
		//ПроверятьПоКодуМДМ = СтрДлина(ИдентификаторКонтрагента) = 36;
		//
		//Если ПроверятьПоКодуМДМ Тогда
		//	РеализацияПринадлежитДругомуКонтрагенту = ДокументЗаявка.Реализация.Контрагент.КодМДМ <> ИдентификаторКонтрагента;
		//Иначе
		//	РеализацияПринадлежитДругомуКонтрагенту = СокрЛП(ДокументЗаявка.Реализация.Контрагент.IDАварда) <> СокрЛП(ИдентификаторКонтрагента);	
		//КонецЕсли;
		//
		//Если РеализацияПринадлежитДругомуКонтрагенту Тогда
		//	СтруктураВозврата.Сообщение = "В базе УТ отличается контрагент в заявке на возврат";
		//Иначе 	
		//	
		ДокументЗаявкаОбъект = ДокументЗаявка.ПолучитьОбъект();  
		
		ДокументЗаявкаОбъект.Статус = "Отменен"; 
		
		Для Каждого СтрокаТовар Из ДокументЗаявкаОбъект.Товары Цикл
			СтрокаТовар.Статус = "Отменен";
		КонецЦикла;
		
		Попытка    
			
			ДокументЗаявкаОбъект.Записать(); 
			СтруктураВозврата.Результат = Истина;
			
		Исключение             
			СтруктураВозврата.Сообщение = "Ошибка при записи документа в базу";
		КонецПопытки ;
		//				
		//КонецЕсли;
		//+Сёмин Р.И. 25.03.2026 #UT10-5777
		
	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции


///////////////////payments_docsale_block///////////////////
Функция ЗаблокироватьРеализациюСервер(СтрокаJSON) Экспорт 
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsale_block.ЗаблокироватьРеализацию", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. ЗаблокироватьРеализацию");
	
	ПараметрыСтруктура 	= ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);
	
	Если ЗначениеЗаполнено(ПараметрыСтруктура) Тогда
		                      
		СтруктураВозврата = ЗаблокироватьРеализацию(ПараметрыСтруктура);
		ДанныеВозврата = ОбщегоНазначения.ВернутьJSON(СтруктураВозврата);
		
	Иначе
		
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Блокировка не выполнена. Не задан ИдентификаторДокумента.");
		
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_docsale_block.ЗаблокироватьРеализацию", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ЗаблокироватьРеализацию. " + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." 
	+ " Запрос:" + Символы.ПС + СтрокаJSON);
		
	Возврат ДанныеВозврата;
	
КонецФункции      

Функция ЗаблокироватьРеализацию(ПараметрыЗапроса)   
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторДокумента") Или ПустаяСтрока(ПараметрыЗапроса.ИдентификаторДокумента) Тогда
		
		СтруктураВозврата.Сообщение = "Не задан параметр запроса ИдентификаторДокумента";
		Возврат СтруктураВозврата;
	
	КонецЕсли; 
	
	ИдентификаторДокумента = СокрЛП(ПараметрыЗапроса.ИдентификаторДокумента); 
	Реализация = ПолучитьДокументПоИдентификатору("РеализацияТоваровУслуг", ИдентификаторДокумента);
	
	Если Реализация.Пустая() Тогда   
		
		СтруктураВозврата.Сообщение = "В базе УТ не найдена реализация с идентификатором";	
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	СтатусЗаблокировано = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусЗаблокировано.Отбор.Объект.Установить(Реализация);
	СтатусЗаблокировано.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты);
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусЗаблокировано.Прочитать();
	
	Если СтатусЗаблокировано.Количество() = 0 Тогда   
		
		НовыйСтатусЗаблокировано = СтатусЗаблокировано.Добавить();
		НовыйСтатусЗаблокировано.Объект = Реализация;
		НовыйСтатусЗаблокировано.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ЗаблокированоДляОплаты;  
		
	Иначе
		НовыйСтатусЗаблокировано = СтатусЗаблокировано[0];
	КонецЕсли;
	
	НовыйСтатусЗаблокировано.Значение = Истина;
	СтатусЗаблокировано.Записать();
	УстановитьПривилегированныйРежим(Ложь);		
	
	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;

КонецФункции


///////////////////payments_create///////////////////
Функция СоздатьОплатуПлатежнойКартойСервер(СтрокаJSON, ВернутьJSON = Истина) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_create.СоздатьОплатуПлатежнойКартой", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. СоздатьОплатуПлатежнойКартой");
	
	ПараметрыСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(СтрокаJSON);   
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	
	Если ЗначениеЗаполнено(ПараметрыСтруктура) Тогда

		ПараметрыСтруктура.Вставить("СтрокаJSON", СтрокаJSON);
		
		СтруктураВозврата = СоздатьОплатуПлатежнойКартой(ПараметрыСтруктура);
		
		ДанныеВозврата = ?(ВернутьJSON, ОбщегоНазначения.ВернутьJSON(СтруктураВозврата), СтруктураВозврата); 
		
	Иначе
		
		СтруктураВозврата.Вставить("Результат", Ложь); 
		СтруктураВозврата.Вставить("Сообщение", "Оплата не создана. Не заданы строки для поиска реализаций и товаров.");
		
	КонецЕсли; 
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_create.СоздатьОплатуПлатежнойКартой", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. СоздатьОплатуПлатежнойКартой. "  
	+ Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0"));
	//+ " м.сек." + " Запрос:" + Символы.ПС + СтрокаJSON);
	
	Возврат ДанныеВозврата;
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартой(ПараметрыЗапроса) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	СтруктураВозврата = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "");    

	МассивРезультат = Новый Массив;
	
	Если Не ПараметрыЗапроса.Свойство("НомерТерминала") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.НомерТерминала) Тогда	
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не заполнен номер терминала"; 
		Возврат СтруктураВозврата;		
		
	КонецЕсли;
	
	НомерТерминала = ПараметрыЗапроса.НомерТерминала;
	ДоговорЭквайринга = Справочники.ДоговорыЭквайринга.НайтиПоРеквизиту("Номер", НомерТерминала);
	
	Если Не ЗначениеЗаполнено(ДоговорЭквайринга) Тогда		
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не найден договор эквайринга по номеру: " + НомерТерминала;  
		Возврат СтруктураВозврата;		              
		
	КонецЕсли;  
	
	ЛицевойСчет = Неопределено;
	ПараметрыЗапроса.Свойство("ЛицевойСчет", ЛицевойСчет);  
	ЛицевойСчет = СтрокаВБулево(ЛицевойСчет);
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторДокумента") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ИдентификаторДокумента) Тогда    
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не заполнен идентификатор " + ?(ЛицевойСчет, "договора", "реализации"); 
		Возврат СтруктураВозврата;		               
		
	КонецЕсли;
	
	ИдентификаторДокумента = ПараметрыЗапроса.ИдентификаторДокумента;
	
	Если Не ПараметрыЗапроса.Свойство("ИДПлатежа") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ИДПлатежа) Тогда    
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не заполнен ИД платежа"; 
		Возврат СтруктураВозврата;		               
		
	КонецЕсли;
	
	ИДПлатежа = ПараметрыЗапроса.ИДПлатежа;
	
	Если ЛицевойСчет Тогда     
		
		Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
		ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", ИдентификаторДокумента);	
		
		Если ДоговорКонтрагента.Пустая() Тогда		
			
			СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не был найден договор контрагента по ИД : " + ИдентификаторДокумента; 
			Возврат СтруктураВозврата;		
			
		КонецЕсли; 	
		
		Контрагент = ДоговорКонтрагента.Владелец;  
		
	Иначе	
		
		Реализация = ПолучитьДокументПоИдентификатору("РеализацияТоваровУслуг", ИдентификаторДокумента);	
		
		Если Реализация.Пустая() Тогда		
			
			СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не была найдена реализация по ИД: " + ИдентификаторДокумента; 
			Возврат СтруктураВозврата;	
			
		КонецЕсли;
		
		ДоговорКонтрагента = Реализация.ДоговорКонтрагента;
		Контрагент = Реализация.Контрагент;    
		
	КонецЕсли;     
	
	Если Не ПараметрыЗапроса.Свойство("Сумма") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.Сумма) Тогда    
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Не заполнена сумма платежа";
		Возврат СтруктураВозврата;	
		
	КонецЕсли;                                          
	
	Попытка
		Сумма = Число(ПараметрыЗапроса.Сумма);
	Исключение
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Сумма платежа не является числом";
		Возврат СтруктураВозврата;	
		
	КонецПопытки;		
	
	ДокументСИДПлатежаСуществует = ПроверитьДокументОплатыСуществует(ИДПлатежа); 
	
	Если ДокументСИДПлатежаСуществует Тогда
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Оплата с ИД платежа " + ИДПлатежа + " уже существует";
		Возврат СтруктураВозврата;	
		
	КонецЕсли;
	
	ПараметрыЗапуска = "НомерТерминала: " + НомерТерминала + " ИДПлатежа: " + ИДПлатежа + " ИДДокумента: " + ИдентификаторДокумента + " Сумма: " + Строка(Сумма);
	
	Попытка
		
		НовыйДокумент = Документы.ОплатаОтПокупателяПлатежнойКартой.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Организация = ДоговорЭквайринга.ДоговорВзаиморасчетов.Организация;
		НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
		
		НовыйДокумент.ДоговорЭквайринга = ДоговорЭквайринга;
		НовыйДокумент.Эквайрер = ДоговорЭквайринга.Эквайрер;
		
		Если НЕ ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание.Количество() = 0 Тогда
			
			НовыйДокумент.ВидОплаты = ДоговорЭквайринга.ТарифыЗаРасчетноеОбслуживание[0].ВидОплаты;			
			ПроцентТорговойУступки = УправлениеРозничнойТорговлей.ПолучитьПроцентТорговойУступки(ДоговорЭквайринга, НовыйДокумент.ВидОплаты);
			НовыйДокумент.СуммаТорговойУступки = Сумма * ПроцентТорговойУступки / 100;
			НовыйДокумент.ПроцентТорговойУступки = ПроцентТорговойУступки;
			
		КонецЕсли;		
		
		НовыйДокумент.ДоговорВзаиморасчетовЭквайрера = ДоговорЭквайринга.ДоговорВзаиморасчетов;
		НовыйДокумент.Касса = ДоговорЭквайринга.Касса;
		
		НовыйДокумент.ИДПлатежа = ИДПлатежа;
		НовыйДокумент.Контрагент = Контрагент;
		НовыйДокумент.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя;
		НовыйДокумент.ВалютаДокумента = ДоговорЭквайринга.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		
		НовыйДокумент.КурсДокумента = 1;
		НовыйДокумент.КратностьДокумента = 1;
		НовыйДокумент.СуммаДокумента = Сумма;
		
		Если НовыйДокумент.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
			
			НовыйДокумент.ОтражатьВБухгалтерскомУчете = Истина;
			НовыйДокумент.ОтражатьВНалоговомУчете = Истина;
			
		КонецЕсли;		
		
		НовыйДокумент.ОтражатьВУправленческомУчете 	= Истина;

		Если НЕ ЛицевойСчет Тогда
			
			РасшифровкаПлатежа = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			РеализацияСсылка = Реализация;
			РасшифровкаПлатежа.ДоговорКонтрагента = ДоговорКонтрагента; 
			
			РасшифровкаПлатежа.ДокументРасчетовСКонтрагентом = Реализация;
			РасшифровкаПлатежа.Сделка = РеализацияСсылка.Сделка;
			РасшифровкаПлатежа.КратностьВзаиморасчетов = 1;
			РасшифровкаПлатежа.КурсВзаиморасчетов = 1;
			//+Гавриленков В. 05.12.2025 #UT10-5574
			РасшифровкаПлатежа.СтавкаНДС = ?(НовыйДокумент.Дата >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);  
			//-Гавриленков В. 05.12.2025 #UT10-5574
			РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ДоговорКонтрагента.ОсновнаяСтатьяДвиженияДенежныхСредств; 
			
			УправлениеДенежнымиСредствами.УстановитьСтатьюДДСПоУмолчанию(РасшифровкаПлатежа, НовыйДокумент.ВидОперации);
			РасшифровкаПлатежа.СуммаВзаиморасчетов = НовыйДокумент.СуммаДокумента;
			РасшифровкаПлатежа.СуммаПлатежа = НовыйДокумент.СуммаДокумента;
			
			ЗначениеСтавкиНДС = УчетНДС.ПолучитьСтавкуНДС(РасшифровкаПлатежа.СтавкаНДС);
			РасшифровкаПлатежа.СуммаНДС = РасшифровкаПлатежа.СуммаПлатежа * ЗначениеСтавкиНДС / (100 + ЗначениеСтавкиНДС);
			РасшифровкаПлатежа.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная;
			РасшифровкаПлатежа.Проект = РасшифровкаПлатежа.ДоговорКонтрагента.ОсновнойПроект;
			
		Иначе
			
			СтруктураПараметров=Новый Структура;
			
			СтруктураПараметров.Вставить("Организация"					, НовыйДокумент.Организация);
			СтруктураПараметров.Вставить("Контрагент"					, НовыйДокумент.Контрагент);
			СтруктураПараметров.Вставить("ВалютаДокумента"				, НовыйДокумент.ВалютаДокумента);
			СтруктураПараметров.Вставить("СуммаДокумента"				, НовыйДокумент.СуммаДокумента);
			СтруктураПараметров.Вставить("ДатаДок"						, НовыйДокумент.Дата);
			СтруктураПараметров.Вставить("ВидОперацииДок"				, НовыйДокумент.ВидОперации);
			СтруктураПараметров.Вставить("РасшифровкаПлатежа"			, НовыйДокумент.РасшифровкаПлатежа);
			СтруктураПараметров.Вставить("КурсДокумента"				, НовыйДокумент.КурсДокумента);
			СтруктураПараметров.Вставить("КратностьДокумента"			, НовыйДокумент.КратностьДокумента);
			СтруктураПараметров.Вставить("ТипЗадолженности"				, ">0");
			СтруктураПараметров.Вставить("Интерактивно"					, ЛОЖЬ);
			СтруктураПараметров.Вставить("ПлатежПоСуммеВзаиморасчетов"	, Истина);
			СтруктураПараметров.Вставить("ФормаОплаты"					, Перечисления.ВидыДенежныхСредств.Наличные);
			СтруктураПараметров.Вставить("ВидОперацииПлан"				, УправлениеДенежнымиСредствами.ОпределитьВидОперацииПлан(НовыйДокумент.ВидОперации));
			СтруктураПараметров.Вставить("ИмяРегистраПлан"				, "ПланируемыеПоступленияДенежныхСредств");
			СтруктураПараметров.Вставить("БанковскийСчетКасса"			, Неопределено);
			СтруктураПараметров.Вставить("СсылкаНаДокумент"				, НовыйДокумент.Ссылка);
			СтруктураПараметров.Вставить("ОтражатьВБухгалтерскомУчете"	, НовыйДокумент.ОтражатьВБухгалтерскомУчете);
			
			СтруктураПараметровАвто = Новый Структура; 		
			СтруктураПараметровАвто.Вставить("УчитыватьФактическиеЗадолженности" , Истина);
			СтруктураПараметровАвто.Вставить("УчитыватьОперативныеЗадолженности" , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьСумму"			    , Истина);
			СтруктураПараметровАвто.Вставить("ПодборПоСуммеПлатежа"			, Истина);
			СтруктураПараметровАвто.Вставить("СуммаДляПодбора"			    , НовыйДокумент.СуммаДокумента);
			СтруктураПараметровАвто.Вставить("СпособЗаполнения"			    , "ФИФО");
			СтруктураПараметровАвто.Вставить("ПоЗаявкам"				    , Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьПланируемыеДвижения"	, Ложь);
			СтруктураПараметровАвто.Вставить("НеПревышатьЗапланированныхЗначений", Ложь);
			СтруктураПараметровАвто.Вставить("ВключенныеВПлатежныйКалендарь", Ложь);
			СтруктураПараметровАвто.Вставить("ПодбиратьСумму", Истина);
			СтруктураПараметровАвто.Вставить("ДоговорКонтрагента"       , ДоговорКонтрагента);   
			СтруктураПараметровАвто.Вставить("ОтбиратьПоДоговорам"      , Истина);   
			
			СтруктураПараметров.Вставить("СтруктураПараметровАвто"		, СтруктураПараметровАвто);
			
			УправлениеДенежнымиСредствами.ЗаполнитьРасшифровкуПлатежей(СтруктураПараметров);
			
			Если НовыйДокумент.РасшифровкаПлатежа.Количество() = 0 Тогда
				НоваяСтрока = НовыйДокумент.РасшифровкаПлатежа.Добавить();
			КонецЕсли;
			
			НовыйДокумент.СуммаДокумента = НовыйДокумент.РасшифровкаПлатежа.Итог("СуммаПлатежа");
			
		КонецЕсли;

		Если Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
			Чеки.ЗаполнитьСоставЧекаККМДляОПК_Оплата(НовыйДокумент);	
		КонецЕсли;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
		
	Исключение
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();  
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_create.СоздатьОплатуПлатежнойКартой", УровеньЖурналаРегистрации.Ошибка,,,
		"HTTP-сервис OnlineStore.payments_create.СоздатьОплатуПлатежнойКартой:Ошибка. " + 
		Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") + " Возникла ошибка при создании документа" + Символы.ПС + ПараметрыЗапуска + Символы.ПС + ОписаниеОшибки());
		
		СтруктураВозврата.Сообщение = "Оплата на создана. Причина: Возникла ошибка при проведении документа Оплата платежной картой: " + ОписаниеОшибки();  
		Возврат СтруктураВозврата;		
		
	КонецПопытки;
	
	Попытка
		
		Если Чеки.ИспользоватьПечатьЧековЧерезСервер() Тогда
			
			Док = НовыйДокумент.Ссылка;
			
			Если ЗначениеЗаполнено(Док.Касса.ИД) И Док.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
				
				ЗаписьЖурналаРегистрации("Печать чеков.Начало", 
				УровеньЖурналаРегистрации.Информация, , , 
				"Начало отправки документов ПКО на печать из системы PortalPayments");								
				
				Если Док.Проведен Тогда
					
					МожноЛиПечататьСтруктура = Чеки.МожноПечататьЧеки(Док.Касса);
					
					Если Не МожноЛиПечататьСтруктура.Результат Тогда
						
						ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, Метаданные.Справочники.Кассы, Док.Касса, 
						"По кассе " + Строка(Док.Касса) + " в данный момент нельзя печатать чеки" + Символы.ПС + МожноЛиПечататьСтруктура.Сообщение 
						+ Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
						
						Чеки.ЗаписатьНовоеЗадание(Док, "prepare", МожноЛиПечататьСтруктура.Сообщение);				
						
					Иначе
						
						РезультатПроверки = Чеки.ПоверитьКорректностьСоставаЧекаККМ(Док);
						
						Если Не РезультатПроверки.Результат Тогда
							Чеки.ЗаписатьНовоеЗадание(Док, "error", "При проверке корректности состава Чека ККМ обнаружены ошибки" + Символы.ПС + РезультатПроверки.Сообщение);						
						Иначе
							
							СтруктураВозвратаЧека = Чеки.ОтправитьЧекВОчередьНаПечать(Док, Истина,, Константы.АдресПортала.Получить());  
							
							Чеки.ОтправитьЧекиИзПлатежногоДокументаПоРеализациям(Док);
							
							Если НЕ СтруктураВозвратаЧека.Результат Тогда
								
								ЗаписьЖурналаРегистрации("Печать чеков.Обработка", УровеньЖурналаРегистрации.Информация, 
								Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой, Док , 
								"Документ не был отправлен в очередь на печать" + Символы.ПС 
								+ СтруктураВозвратаЧека.Сообщение + Символы.ПС + "Документ добавлен в очередь на печать со статусом prepare");								
								
								Чеки.ЗаписатьНовоеЗадание(Док, "prepare", СтруктураВозвратаЧека.Сообщение);
								
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе                
					
					ЗаписьЖурналаРегистрации("Печать чеков.Ошибка", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой, 
					Док, "Документ ОПК был записан, но не проведен. Чек не был отправлен на печать в ККМ");		
					
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации("Печать чеков.Завершение", УровеньЖурналаРегистрации.Информация, Метаданные.WebСервисы.PortalPayments, , 
				"Окончание отправки документов ПКО на печать из системы PortalPayments");								
				
			КонецЕсли;			
			
		КонецЕсли;
		
	Исключение
		
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.payments_create.СоздатьОплатуПлатежнойКартой", УровеньЖурналаРегистрации.Ошибка,,,
		"HTTP-сервис:Ошибка. СоздатьОплатуПлатежнойКартой " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0") 
		+ " Возникла ошибка при печати чека, но документ был создан" + Символы.ПС + ПараметрыЗапуска + Символы.ПС + ОписаниеОшибки());
		
		
	КонецПопытки;
	
	СтруктураВозврата.Результат = Истина;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция ПроверитьДокументОплатыСуществует(ИДПлатежа)  

	ВозвращаемоеЗначение = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОплатаОтПокупателяПлатежнойКартой.Ссылка
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой КАК ОплатаОтПокупателяПлатежнойКартой
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартой.ПометкаУдаления = ЛОЖЬ
	|	И ОплатаОтПокупателяПлатежнойКартой.ИДПлатежа = &ИДПлатежа
	|	И ОплатаОтПокупателяПлатежнойКартой.ВидОперации = &ВидОперации";
	
	Запрос.УстановитьПараметр("ИДПлатежа", ИДПлатежа); 
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя); 
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();	

КонецФункции    


///////////////////orders///////////////////
Функция ПолучитьДанныеПоЗаказамСервер(ПараметрыСоответсвие, МассивЗаказов = Неопределено) Экспорт  

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	ПараметрыСтруктура = ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);  
	ПараметрыЗапросаСтр = ПараметрыЗапросаСтр + ?(МассивЗаказов <> Неопределено, " Количество заказов: " + Строка(МассивЗаказов.Количество()), "");
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.Orders.ПолучитьДанныеПоЗаказам", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. ПолучитьДанныеПоЗаказам. " + ПараметрыЗапросаСтр);
		
	СтруктураВозврата = ПолучитьДанныеПоЗаказам(ПараметрыСтруктура, МассивЗаказов);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.Orders.ПолучитьДанныеПоЗаказам", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ПолучитьДанныеПоЗаказам. "  
	+ Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + ПараметрыЗапросаСтр);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьЗаказыПоИдентификатору(ИдентификаторЗаказаИМ)
	
	МассивИдентификторов = Новый Массив;
	МассивИдентификторовЧисло = Новый Массив;
	МассивИдентификторовСтрока = Новый Массив;
	
	Если ТипЗнч(ИдентификаторЗаказаИМ) = Тип("Массив") Тогда
		МассивИдентификторов = ИдентификаторЗаказаИМ;
	Иначе
		МассивИдентификторов.Добавить(ИдентификаторЗаказаИМ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателя.Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.IDЗаказаПортал В(&МассивИдентификторовЧисло)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НеСозданныеЗаказыПокупателей.Ссылка,
	|	2
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей КАК НеСозданныеЗаказыПокупателей
	|ГДЕ
	|	НеСозданныеЗаказыПокупателей.Код В(&МассивИдентификторовСтрока)
	|	И НеСозданныеЗаказыПокупателей.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Ссылка
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Документы.Приоритет";   
	
	Для каждого Ид Из МассивИдентификторов Цикл     
		
		//+Белов А. 29.12.2025 #UT10-5607
		Если Число(Ид) = 0 Тогда
			Продолжить;
		КонецЕсли; 
		//-Белов А. 29.12.2025 #UT10-5607
		
		МассивИдентификторовЧисло.Добавить(Число(Ид));
		
	КонецЦикла;
	
	Для каждого Ид Из МассивИдентификторов Цикл
		
		//+Белов А. 29.12.2025 #UT10-5607
		Если Формат(Ид, "ЧГ=0") = "0" Тогда
			Продолжить;
		КонецЕсли; 
		//-Белов А. 29.12.2025 #UT10-5607
		
		МассивИдентификторовСтрока.Добавить(Формат(Ид, "ЧГ=0"));
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивИдентификторовСтрока", МассивИдентификторовСтрока);  
	Запрос.УстановитьПараметр("МассивИдентификторовЧисло", МассивИдентификторовЧисло);  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьДанныеПоЗаказам(ПараметрыЗапроса, МассивЗаказов) 
	
	СтруктураВозврата 	= Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	СтрокаПараметров	= "ИдентификаторЗаказаИМ, ДатаОформленияЗаказа, НаименованиеГрузополучатель,ИдентификаторГрузополучатель, АдресДоставки, ТипДоставки, ДатаСамовывоза, НаименованиеОрганизации, ИдентификаторУчетнойСистемы, ИдентификаторТипаЦен, НаименованиеКонтрагент,ИдентификаторКонтрагент, НаименованиеДоговора, ИдентификаторДоговора, ИсточникЗаказа, Комментарий, НаименованиеВалюта,СуммаДокументаСНДС";
	
	
	//Дополнительные параметры по получению данных по заказку и номенклатуры
	//используется для дополнительного запроса по http сервису, детального запроса по номенклатуре 

	ИдентификаторДокумента 	= "";
	ДокументыЗаказа 		= Новый Массив;  
	ДанныеПоЗаказу 			= Ложь;
	ДетальнаяИнформация 	= Ложь;
	ДатаНачала 				= Дата(1, 1, 1);
	ДатаОкончания			= Дата(1, 1, 1);   
	ИдентификаторКонтрагента= "";
	Филиалы 				= "";
	СписокФилиалов 			= Новый Массив; 
	МассивРезультат 		= Новый Массив; 
	АртикулТовара 			= "";
	НомерДокумента 			= "";
	СтатусЗаказа 			= "";
	ИскатьПоКодуМДМ 		= Ложь;     
	
	Если ПараметрыЗапроса.Свойство("ИдентификаторЗаказаИМ") И Найти(ПараметрыЗапроса.ИдентификаторЗаказаИМ, "[") > 0 Тогда
		
		МассивИдентификаторов = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ПараметрыЗапроса.ИдентификаторЗаказаИМ);
		МассивЗаказов = ПолучитьЗаказыПоИдентификатору(МассивИдентификаторов);   
		
		Если МассивЗаказов.Количество() = 0 Тогда
			
			СтруктураВозврата.Сообщение = "Данные заказа не получены. Причина: не найдены Заказы клиента с Идентификаторами: " + ПараметрыЗапроса.ИдентификаторЗаказаИМ;
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
		//+Сёмин Р.И. 23.03.2026 #P3-4087
	ИначеЕсли НЕ ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") И ПараметрыЗапроса.Свойство("НомерДокумента") И Найти(ПараметрыЗапроса.НомерДокумента, "[") > 0 Тогда
		
		НомераДокументов = СтрЗаменить(ПараметрыЗапроса.НомерДокумента, "[", "");
		НомераДокументов = СтрЗаменить(НомераДокументов, "]", "");
		
		МассивНомеров = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(НомераДокументов, ",");
		МассивЗаказов = ПолучитьЗаказыПоНомеру(МассивНомеров);   
		
		Если МассивЗаказов.Количество() = 0 Тогда
			
			СтруктураВозврата.Сообщение = "Данные заказа не получены. Причина: не найдены Заказы клиента с Номерами: " + ПараметрыЗапроса.НомерДокумента;
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		//-Сёмин Р.И. 23.03.2026 #P3-4087
		
	КонецЕсли;
	
	Если МассивЗаказов <> Неопределено Тогда
		
		ДанныеПоЗаказу 			= Истина;
		ДокументыЗаказа = МассивЗаказов;
		
		ДатаНачала	  = ДокументыЗаказа[0].Дата;
		ДатаОкончания = ДокументыЗаказа[МассивЗаказов.Количество() - 1].Дата;
		
	ИначеЕсли ПараметрыЗапроса.Свойство("ИдентификаторЗаказаИМ") И ПараметрыЗапроса.ИдентификаторЗаказаИМ <> "" Тогда  
		
		ДанныеПоЗаказу 			= Истина;
		ИдентификаторЗаказаИМ 	= ПараметрыЗапроса.ИдентификаторЗаказаИМ;   
		
		ДокументыЗаказа = ПолучитьЗаказыПоИдентификатору(ИдентификаторЗаказаИМ);
		
		Если ДокументыЗаказа.Количество() = 0 Тогда
			
			СтруктураВозврата.Сообщение = "Данные заказа не получены. Причина: не найден Заказ клиента с ИдентификаторДокумента " + ИдентификаторЗаказаИМ;
			Возврат СтруктураВозврата;
			
		КонецЕсли;  
		
		ДатаНачала	  = ДокументыЗаказа[0].Дата;
		ДатаОкончания = ДокументыЗаказа[0].Дата;
		
	Иначе // общие параметры для др. частей запросов   
		
		Если Не ПараметрыЗапроса.Свойство("ДатаНачала") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаНачала) Тогда
			ДатаНачала = НачалоДня(ТекущаяДата());			
		Иначе
			ДатаНачала = СтрокаВДату(ПараметрыЗапроса.ДатаНачала);	
		КонецЕсли;   
		
		Если Не ПараметрыЗапроса.Свойство("ДатаОкончания") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаОкончания) Тогда
			ДатаОкончания = КонецДня(ТекущаяДата());
		Иначе
			ДатаОкончания = СтрокаВДату(ПараметрыЗапроса.ДатаОкончания);	
		КонецЕсли;  
		
		Если Не ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ИдентификаторКонтрагента) Тогда
			
			СтруктураВозврата.Сообщение = "Данные заказа не получены. Причина: не задан параметр ИдентификаторКонтрагента";
			Возврат СтруктураВозврата;
	
		КонецЕсли; 
		
		
		ИдентификаторКонтрагента = СтрЗаменить(СокрЛП(ПараметрыЗапроса.ИдентификаторКонтрагента), Символы.НПП, "");  
		
		Если ПараметрыЗапроса.Свойство("СписокФилиалов") Тогда
			Филиалы = СокрЛП(ПараметрыЗапроса.СписокФилиалов);	
		КонецЕсли;  
		
	КонецЕсли;	
	
	ДетальнаяИнформация = Неопределено;
	ПараметрыЗапроса.Свойство("ДетальнаяИнформация", ДетальнаяИнформация);  
	ДетальнаяИнформация = СтрокаВБулево(ДетальнаяИнформация);
	
	Если ДокументыЗаказа.Количество() = 0 И ПараметрыЗапроса.Свойство("НомерДокумента") Тогда
		
		НомерДокумента = СокрЛП(ПараметрыЗапроса.НомерДокумента);   
		
		Если ЗначениеЗаполнено(НомерДокумента) Тогда
			
			ЗапросДокумента = Новый Запрос;
			ЗапросДокумента.Текст = "ВЫБРАТЬ
			                        |	ЗаказыПокупателейОбороты.ЗаказПокупателя
			                        |ИЗ
			                        |	РегистрНакопления.ЗаказыПокупателей.Обороты(&ДатаНачала, &ДатаОкончания, , ЗаказПокупателя.Номер = &Номер) КАК ЗаказыПокупателейОбороты
			                        |
			                        |СГРУППИРОВАТЬ ПО
			                        |	ЗаказыПокупателейОбороты.ЗаказПокупателя
			                        |
			                        |ОБЪЕДИНИТЬ ВСЕ
			                        |
			                        |ВЫБРАТЬ
			                        |	ЗаказыПокупателейОбороты.ЗаказПокупателя
			                        |ИЗ
			                        |	РегистрНакопления.ЗаказыПокупателей.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ЗаказыПокупателейОбороты
			                        |ГДЕ
			                        |	ЗаказыПокупателейОбороты.Регистратор.Номер = &Номер";
			
			ЗапросДокумента.УстановитьПараметр("ДатаНачала", ДатаНачала);
			ЗапросДокумента.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), КонецДня(ТекущаяДата())));
			ЗапросДокумента.УстановитьПараметр("Номер", НомерДокумента);
			
			ВыборкаДокумента = ЗапросДокумента.Выполнить().Выбрать();
			
			Если ВыборкаДокумента.Следующий() Тогда       
				
				ДокументыЗаказа.Добавить(ВыборкаДокумента.ЗаказПокупателя);      			
				ДанныеПоЗаказу = Истина;         
				
				ДатаНачала = ВыборкаДокумента.ЗаказПокупателя.Дата;
				ДатаОкончания = ВыборкаДокумента.ЗаказПокупателя.Дата;
				
			КонецЕсли;		
			
		КонецЕсли;  
		
	КонецЕсли;  
	
	Если ПараметрыЗапроса.Свойство("СтатусЗаказа") Тогда
		СтатусЗаказа = СокрЛП(ПараметрыЗапроса.СтатусЗаказа);	
	КонецЕсли;
	
	Если ДетальнаяИнформация Тогда
		
		Если ПараметрыЗапроса.Свойство("Артикул") И ПараметрыЗапроса.Артикул <> "" Тогда  
			
			Артикул = СокрЛП(ПараметрыЗапроса.Артикул);	
			АртикулТовара = Артикул;  
			
		КонецЕсли;    
										
	КонецЕсли;	
	
	Если ДанныеПоЗаказу И Не ДокументыЗаказа.Количество() = 0 Тогда 
		
		Если МассивЗаказов = Неопределено Тогда 
			
			НайденныйЗаказ = ДокументыЗаказа[0];
			
			Если ТипЗнч(НайденныйЗаказ) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
				
				Контрагент = ДокументыЗаказа[0].Контрагент;  	   
				
				Если ЗначениеЗаполнено(Контрагент.КодМДМ) Тогда
					
					ИдентификаторКонтрагента = Контрагент.КодМДМ;
					ИскатьПоКодуМДМ = Истина;       
					РеквизитПоиска = "КодМДМ";
					
				Иначе
					
					ИдентификаторКонтрагента 	= СтрЗаменить(СокрЛП(Контрагент.IDАварда), Символы.НПП, "");
					РеквизитПоиска = "IDАварда";
					
				КонецЕсли; 
				
				//Это несозданный заказ
			Иначе         
				
				Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", НайденныйЗаказ.KontragentID);   
				
				ИдентификаторКонтрагента = Контрагент.КодМДМ;
				ИскатьПоКодуМДМ = Истина;       
				РеквизитПоиска = "КодМДМ";
				
			КонецЕсли;    
			
		КонецЕсли;
				
	Иначе 	     
		
		Если СтрДлина(ИдентификаторКонтрагента) = 36 Тогда
			
			ИскатьПоКодуМДМ = Истина;       
			РеквизитПоиска = "КодМДМ";  
			
		Иначе
			
			РеквизитПоиска = "IDАварда";
			
		КонецЕсли;
				
		Если ЗначениеЗаполнено(Филиалы) И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда    
			
			Филиалы = СтрЗаменить(Филиалы, " ", "");
			СписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Филиалы), ",");   
			
		КонецЕсли;
		
		Контрагент = НайтиКонтрагентаOnlineStore(ПараметрыЗапроса, СтруктураВозврата, "Данные заказов не получены. ");
		
	КонецЕсли;
	
	Если МассивЗаказов <> Неопределено ИЛИ (НЕ Контрагент.Пустая() ИЛИ НЕ СписокФилиалов.Количество() = 0) Тогда   
		                                                                                  
		ЗапросЗаказовПоСтатусам = Новый Запрос;    
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач",			?(ЗначениеЗаполнено(ДатаНачала), НачалоДня(ДатаНачала), НачалоДня(ТекущаяДата() - 86400 * 14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон",			?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Артикул", 			?(СокрЛП(АртикулТовара) <> "", "%" + АртикулТовара + "%", ""));  
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("БезОтбораПоАртикулу", НЕ ЗначениеЗаполнено(СокрЛП(АртикулТовара))); 
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументыЗаказа", 	ПолучитьТипИзМассива(ДокументыЗаказа, Тип("ДокументСсылка.ЗаказПокупателя")));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументыЗаказаНесозданные", 	ПолучитьТипИзМассива(ДокументыЗаказа, Тип("СправочникСсылка.НеСозданныеЗаказыПокупателей")));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда",			ИдентификаторКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД",			СписокФилиалов);  
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("НомерДокумента", 	НомерДокумента);
		//+Гавриленков В. 05.12.2025 #UT10-5574
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СтавкаНДС",		 	Перечисления.СтавкиНДС.НДС20); 
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СтавкаНДС",		 	?(ТекущаяДата() >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20));
		//-Гавриленков В. 05.12.2025 #UT10-5574
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ЧислоДней",		 	Константы.ЧислоДнейДляРегламентаПоКорректировкамСобранныхСборок.Получить());  
		
		УстановитьПривилегированныйРежим(Истина);
	 	СкладДопПоставщикаДляСтатусовНаПортале = Константы.СкладДопПоставщикаДляСтатусовНаПортале.Получить();
		
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДопПоставщик", ?(Константы.ОтправлятьЗаказыВСтророннююУТ11.Получить(), 
		                                            Константы.ДопПоставщик.Получить(), Справочники.Контрагенты.ПустаяСсылка()));
	 	ЗапросЗаказовПоСтатусам.УстановитьПараметр("СкладДопПоставщикаДляСтатусовНаПортале", СкладДопПоставщикаДляСтатусовНаПортале);		
		ЗапросЗаказовПоСтатусам.Текст = ПолучитьТекстЗапросаСтатусовЗаказов(ИскатьПоКодуМДМ, СписокФилиалов, ДетальнаяИнформация, ДанныеПоЗаказу, МассивЗаказов);
		
		Попытка
			РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить();  	
		Исключение
			
			Ошибка = ОписаниеОшибки();
			
			СтруктураВозврата.Сообщение = Ошибка;
			Возврат СтруктураВозврата;
			
		КонецПопытки;
		  
		УстановитьПривилегированныйРежим(Ложь);
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда 
			ОбработатьЗапросПоЗаказу(РезультатЗапросаЗаказовПоСтатусам, ДетальнаяИнформация, СтрокаПараметров, МассивРезультат, СтатусЗаказа);  
		КонецЕсли;		

		//ДобавитьНеСозданныеЗаказыПокупателей(ДатаНачала, ДатаОкончания, ИдентификаторКонтрагента, МассивРезультат, СтрокаПараметров);  
		
	Иначе
		СтруктураВозврата.Сообщение = "Данные заказа не получены. Причина: не найден контрагент, не заданы филиалы.";
	КонецЕсли;    
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Данные 	= МассивРезультат;
	
	Возврат СтруктураВозврата;
	
КонецФункции 

Функция ПолучитьТипИзМассива(Массив, Тип)
	
	МассивВозврата = Новый Массив;
	
	Для каждого Эл Из Массив Цикл
		
		Если ТипЗнч(Эл) = Тип Тогда
			МассивВозврата.Добавить(Эл);
		КонецЕсли; 
		
	КонецЦикла;             
	
	Возврат МассивВозврата;
		
КонецФункции

Функция ПолучитьТекстЗапросаСтатусовЗаказов(ИскатьПоКодуМДМ, пСписокФилиалов, ДетальнаяИнформация, ДанныеПоЗаказу, МассивЗаказов) 
	
	ТекстЗапроса = ""; 
	
	Если МассивЗаказов <> Неопределено Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Значение(Справочник.Контрагенты.ПустаяСсылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов"; 
		
	ИначеЕсли пСписокФилиалов.Количество() <> 0 Тогда  
		
		ТекстЗапроса = 			
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ ВТ_ИДАварда
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.IDАварда = &IDАварда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.IDФилиала В (&СписокИД)
		|			ИЛИ Контрагенты.КодМДМ В (&СписокИД))
		|	И Контрагенты.ГоловнойКонтрагент В
		|			(ВЫБРАТЬ
		|				ИДАварда.Ссылка
		|			ИЗ
		|				ВТ_ИДАварда КАК ИДАварда)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагенты.Ссылка"; 
		
	Иначе       
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Контрагенты.Ссылка"; 
		
	КонецЕсли;
	
	Если ИскатьПоКодуМДМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + ПолучитьТекстЗапросаДетальнойИнформации();   
	                                                
	Если пСписокФилиалов.Количество() = 0 Тогда 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "
		|УНИЧТОЖИТЬ ВТ_ИДАварда
		|;", "");
		
	КонецЕсли;	
	
	Если ДанныеПоЗаказу Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ТаблицаКлиентов.Ссылка = ЗаказПокупателя.Грузополучатель", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ЗаказПокупателя.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ)", "ЗаказПокупателя.Ссылка В (&ДокументыЗаказа)"); 	
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И ВТ_ТаблицаКлиентов.Ссылка.КодМДМ = НеСозданныеЗаказыПокупателейТовары.Ссылка.FilialID", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ)", "НеСозданныеЗаказыПокупателейТовары.Ссылка В (&ДокументыЗаказаНесозданные)"); 	
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ПолучитьТекстЗапросаДетальнойИнформации()
	
	Текст = ";";
	
	Текст = Текст + "ВЫБРАТЬ
	                |	ВЫБОР
	                |		КОГДА Константы.ОтправлятьЗаказыВСтророннююУТ11
	                |			ТОГДА Константы.ДопПоставщик
	                |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |	КОНЕЦ КАК ДопПоставщик,
	                |	Константы.СкладДопПоставщикаДляСтатусовНаПортале КАК СкладДопПоставщикаДляСтатусовНаПортале
	                |ПОМЕСТИТЬ ВТ_КонстантыПоставщика
	                |ИЗ
	                |	Константы КАК Константы
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказПокупателя.Ссылка КАК Заказ,
	                |	МИНИМУМ(ВЫБОР
	                |			КОГДА СобственныеСклады.Ссылка ЕСТЬ NULL
	                |					ИЛИ СобственныеСклады.Ссылка = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
	                |					ИЛИ НЕ СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	                |				ТОГДА """"
	                |			ИНАЧЕ СобственныеСклады.СкладПоставщикаДляСтатусовНаПортале
	                |		КОНЕЦ) КАК СкладДляПортала
	                |ПОМЕСТИТЬ ВТ_ОбщийЗаказыПокупателя
	                |ИЗ
	                |	ВТ_ТаблицаКлиентов КАК ТаблицаКлиентов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	                |		ПО (ИСТИНА)
	                |			И ТаблицаКлиентов.Ссылка = ЗаказПокупателя.Грузополучатель
	                |			И (ЗаказПокупателя.Ссылка.Проведен)
	                |			И (ЗаказПокупателя.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ))
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СобственныеСклады КАК СобственныеСклады
	                |		ПО (ЗаказПокупателя.IDСклада = СобственныеСклады.Идентификатор)
	                |ГДЕ
	                |	НЕ ЗаказПокупателя.Ссылка ЕСТЬ NULL
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказПокупателя.Ссылка
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Заказ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказПокупателя.Заказ КАК Заказ,
	                |	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	                |	МАКСИМУМ(ЗаказПокупателяТовары.Цена) КАК Цена,
	                |	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	                |	МАКСИМУМ(ЗаказПокупателяТовары.Комментарий) КАК КомментарийНоменклатуры,
	                |	МАКСИМУМ(ЗаказПокупателяТовары.СтавкаНДС) КАК СтавкаНДС,
	                |	МИНИМУМ(ЗаказПокупателя.СкладДляПортала) КАК СкладДляПортала,
	                |	ЗаказПокупателя.Заказ.IDСклада КАК ИдентификаторСклад,
	                |	ЗаказПокупателя.Заказ.Грузополучатель КАК Грузополучатель,
	                |	ЗаказПокупателя.Заказ.ИсточникЗаказа.КодИсточника КАК ИсточникЗаказа,
	                |	ЗаказПокупателя.Заказ.ТаксиДоставка КАК ТаксиДоставка,
	                |	ЗаказПокупателя.Заказ.СпособДоставки КАК СпособДоставки,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента КАК Договор,
	                |	ВЫБОР
	                |		КОГДА ЗаказПокупателя.Заказ.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)
	                |			ТОГДА 1
	                |		ИНАЧЕ 2
	                |	КОНЕЦ КАК ТипДоставки,
	                |	ВЫБОР
	                |		КОГДА ЗаказПокупателя.Заказ.IDЗаказаПортал = 0
	                |			ТОГДА ЗаказПокупателя.Заказ.Номер
	                |		ИНАЧЕ СТРЗАМЕНИТЬ(СТРОКА(ЗаказПокупателя.Заказ.IDЗаказаПортал), "" "", """")
	                |	КОНЕЦ КАК ИдентификаторЗаказаИМ,
	                |	ВЫБОР
	                |		КОГДА ЗаказПокупателяТовары.Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                |			ТОГДА """"
	                |		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(80))
	                |	КОНЕЦ КАК Бренд,
	                |	ЗаказПокупателя.Заказ.Грузополучатель.Наименование КАК НаименованиеГрузополучатель,
	                |	ЗаказПокупателя.Заказ.Грузополучатель.КодМДМ КАК ИдентификаторГрузополучатель,
	                |	ЗаказПокупателя.Заказ.Контрагент.КодМДМ КАК ИдентификаторКонтрагент,
	                |	ВЫРАЗИТЬ(ЗаказПокупателя.Заказ.Комментарий КАК СТРОКА(200)) КАК Комментарий,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента.Наименование КАК НаименованиеДоговор,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента.КодМДМ КАК ИдентификаторДоговор,
	                |	ЗаказПокупателя.Заказ.СуммаДокумента КАК СуммаДокумента
	                |ПОМЕСТИТЬ ВТ_ЗаказыПокупателя
	                |ИЗ
	                |	ВТ_ОбщийЗаказыПокупателя КАК ЗаказПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	                |		ПО ЗаказПокупателя.Заказ = ЗаказПокупателяТовары.Ссылка
	                |ГДЕ
	                |	(&БезОтбораПоАртикулу
	                |			ИЛИ ЗаказПокупателяТовары.Номенклатура.НормализованныйКод ПОДОБНО &Артикул)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказПокупателя.Заказ,
	                |	ЗаказПокупателяТовары.Номенклатура,
	                |	ЗаказПокупателя.Заказ.Грузополучатель,
	                |	ЗаказПокупателя.Заказ.ИсточникЗаказа.КодИсточника,
	                |	ЗаказПокупателя.Заказ.ТаксиДоставка,
	                |	ЗаказПокупателя.Заказ.СпособДоставки,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента,
	                |	ВЫБОР
	                |		КОГДА ЗаказПокупателя.Заказ.IDЗаказаПортал = 0
	                |			ТОГДА ЗаказПокупателя.Заказ.Номер
	                |		ИНАЧЕ СТРЗАМЕНИТЬ(СТРОКА(ЗаказПокупателя.Заказ.IDЗаказаПортал), "" "", """")
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА ЗаказПокупателяТовары.Номенклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	                |			ТОГДА """"
	                |		ИНАЧЕ ВЫРАЗИТЬ(ЗаказПокупателяТовары.Номенклатура.Родитель.Наименование КАК СТРОКА(80))
	                |	КОНЕЦ,
	                |	ЗаказПокупателя.Заказ.Грузополучатель.Наименование,
	                |	ЗаказПокупателя.Заказ.Грузополучатель.КодМДМ,
	                |	ЗаказПокупателя.Заказ.Контрагент.КодМДМ,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента.Наименование,
	                |	ЗаказПокупателя.Заказ.ДоговорКонтрагента.КодМДМ,
	                |	ЗаказПокупателя.Заказ.СуммаДокумента,
	                |	ВЫРАЗИТЬ(ЗаказПокупателя.Заказ.Комментарий КАК СТРОКА(200)),
	                |	ЗаказПокупателя.Заказ.IDСклада
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	Заказ,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка,
	                |	Контрагенты.Ссылка КАК Контрагент,
	                |	КонтрагентыГрузополучатель.Ссылка КАК Грузополучатель,
	                |	СУММА(НеСозданныеЗаказыПокупателейТовары.Price * НеСозданныеЗаказыПокупателейТовары.Count) КАК Сумма,
	                |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	                |	ЕСТЬNULL(НеСозданныеЗаказыПокупателейТовары.Ссылка.ТипЦенЗаказ.КодМДМ, """") КАК ИдентификаторТипЦен
	                |ПОМЕСТИТЬ ВТ_НесозданныеЗаказы
	                |ИЗ
	                |	ВТ_ТаблицаКлиентов КАК ВТ_ТаблицаКлиентов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                |			ПО НеСозданныеЗаказыПокупателейТовары.Ссылка.KontragentID = Контрагенты.КодМДМ
	                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                |			ПО ((ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.DogovorID КАК СТРОКА(36))) = ДоговорыКонтрагентов.КодМДМ)
	                |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыГрузополучатель
	                |			ПО НеСозданныеЗаказыПокупателейТовары.Ссылка.FilialID = КонтрагентыГрузополучатель.КодМДМ
	                |		ПО (ИСТИНА)
	                |			И (НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) И КОНЕЦПЕРИОДА(&ДатаКон, ДЕНЬ))
	                |			И (НЕ НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления)
	                |			И ВТ_ТаблицаКлиентов.Ссылка.КодМДМ = НеСозданныеЗаказыПокупателейТовары.Ссылка.FilialID
	                |ГДЕ
	                |	(&БезОтбораПоАртикулу
	                |			ИЛИ НеСозданныеЗаказыПокупателейТовары.Articul ПОДОБНО &Артикул)
	                |	И НЕ НеСозданныеЗаказыПокупателейТовары.Ссылка ЕСТЬ NULL
	                |	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка,
	                |	Контрагенты.Ссылка,
	                |	ДоговорыКонтрагентов.Ссылка,
	                |	КонтрагентыГрузополучатель.Ссылка,
	                |	ЕСТЬNULL(НеСозданныеЗаказыПокупателейТовары.Ссылка.ТипЦенЗаказ.КодМДМ, """")
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказыПокупателя.Заказ КАК ЗаказПокупателя,
	                |	ЗаказыПокупателя.Номенклатура КАК Номенклатура,
	                |	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоРезерв
	                |ПОМЕСТИТЬ ВТ_Зарезервированно
	                |ИЗ
	                |	ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	                |				,
	                |				(ДокументРезерва, Номенклатура) В
	                |					(ВЫБРАТЬ
	                |						ТаблЧасть.Заказ КАК ДокументРезерва,
	                |						ТаблЧасть.Номенклатура
	                |					ИЗ
	                |						ВТ_ЗаказыПокупателя КАК ТаблЧасть)) КАК ТоварыВРезервеНаСкладахОстатки
	                |		ПО ЗаказыПокупателя.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	                |			И ЗаказыПокупателя.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказыПокупателя.Заказ,
	                |	ЗаказыПокупателя.Номенклатура
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	                |	ВЫРАЗИТЬ(РеализацияТоваровУслуг.ЗаказПокупателя КАК Документ.ЗаказПокупателя) КАК Заказ,
	                |	РеализацияТоваровУслуг.Номенклатура,
	                |	СУММА(ВЫБОР
	                |			КОГДА ЕСТЬNULL(СтатусДоставки.Значение, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
	                |				ТОГДА РеализацияТоваровУслуг.Количество
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК Передано,
	                |	СУММА(ВЫБОР
	                |			КОГДА ЕСТЬNULL(СтатусДоставки.Значение, НЕОПРЕДЕЛЕНО) <> ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
	                |				ТОГДА РеализацияТоваровУслуг.Количество
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК НеПередано
	                |ПОМЕСТИТЬ ВТ_Реализации
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК СтатусДоставки
	                |		ПО РеализацияТоваровУслуг.Ссылка = СтатусДоставки.Объект
	                |			И (СтатусДоставки.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки))
	                |ГДЕ
	                |	РеализацияТоваровУслуг.ЗаказПокупателя В
	                |			(ВЫБРАТЬ
	                |				ВТ_ЗаказыПокупателя.Заказ
	                |			ИЗ
	                |				ВТ_ЗаказыПокупателя)
	                |	И РеализацияТоваровУслуг.Ссылка.Проведен
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВЫРАЗИТЬ(РеализацияТоваровУслуг.ЗаказПокупателя КАК Документ.ЗаказПокупателя),
	                |	РеализацияТоваровУслуг.Ссылка,
	                |	РеализацияТоваровУслуг.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказыПокупателя.Заказ КАК ЗаказПокупателя,
	                |	ЗаказыПокупателя.Номенклатура КАК Номенклатура,
	                |	ВТ_Реализации.Реализация КАК ДокументаОтгрузки,
	                |	СУММА(ВТ_Реализации.Передано) КАК Передано,
	                |	МАКСИМУМ(ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, НЕОПРЕДЕЛЕНО)) КАК ДатаПередачи
	                |ПОМЕСТИТЬ ВТ_СтатусыЗаказовДокОтгрузки
	                |ИЗ
	                |	ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	                |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                |			ПО ВТ_Реализации.Реализация = ЗначенияСвойствОбъектов.Объект
	                |				И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.ВремяПередачи))
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_Реализации.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_Реализации.Номенклатура
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказыПокупателя.Заказ,
	                |	ЗаказыПокупателя.Номенклатура,
	                |	ВТ_Реализации.Реализация
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СтатусыЗаказовДокОтгрузки.ЗаказПокупателя КАК ЗаказПокупателя,
	                |	СтатусыЗаказовДокОтгрузки.Номенклатура КАК Номенклатура,
	                |	ЕСТЬNULL(ДокументСчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка)) КАК СчетФактураВыданный,
	                |	ВЫБОР
	                |		КОГДА ДокументСчетФактураВыданный.Ссылка ЕСТЬ NULL
	                |			ТОГДА """"
	                |		ИНАЧЕ ""RUB""
	                |	КОНЕЦ КАК ВалютаСчетФактуры,
	                |	СтатусыЗаказовДокОтгрузки.ДокументаОтгрузки КАК ДокументаОтгрузки,
	                |	СтатусыЗаказовДокОтгрузки.Передано КАК КоличествоОтгрузки,
	                |	СтатусыЗаказовДокОтгрузки.ДатаПередачи КАК ДатаОтгрузки,
	                |	РеализацияТоваровУслуг.Номер КАК НомерОтгрузки,
	                |	ЕСТЬNULL(ДокументСчетФактураВыданный.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСчетФактуры,
	                |	ЕСТЬNULL(ДокументСчетФактураВыданный.Номер, """") КАК НомерСчетФактуры,
	                |	РеализацияТоваровУслуг.Дата КАК ДатаРеализации
	                |ПОМЕСТИТЬ ВТ_СтатусыЗаказовДатаОтгрузки
	                |ИЗ
	                |	ВТ_СтатусыЗаказовДокОтгрузки КАК СтатусыЗаказовДокОтгрузки
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                |		ПО СтатусыЗаказовДокОтгрузки.ДокументаОтгрузки = РеализацияТоваровУслуг.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК ДокументСчетФактураВыданный
	                |		ПО СтатусыЗаказовДокОтгрузки.ДокументаОтгрузки = ДокументСчетФактураВыданный.ДокументОснование
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказыПокупателя.Заказ КАК ЗаказПокупателя,
	                |	ЗаказыПокупателя.Номенклатура КАК Номенклатура,
	                |	МИНИМУМ(ЕСТЬNULL(СтатусыАварда.Статус, """")) КАК СтатусAvarda,
	                |	МИНИМУМ(ВЫБОР
	                |			КОГДА НЕ ЗаказыПокупателя.СкладДляПортала = """"
	                |				ТОГДА ЗаказыПокупателя.СкладДляПортала
	                |			ИНАЧЕ ВЫБОР
	                |					КОГДА КонстантыПоставщика.ДопПоставщик = СтатусыАварда.Документ.Контрагент
	                |						ТОГДА КонстантыПоставщика.СкладДопПоставщикаДляСтатусовНаПортале
	                |					ИНАЧЕ ""ЦС в Москве""
	                |				КОНЕЦ
	                |		КОНЕЦ) КАК СтатусПоДопПостащику
	                |ПОМЕСТИТЬ ВТ_СтатусыАварда
	                |ИЗ
	                |	ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК СтатусыАварда
	                |		ПО ЗаказыПокупателя.Заказ = СтатусыАварда.ЗаказПокупателя
	                |			И ЗаказыПокупателя.Номенклатура = СтатусыАварда.Номенклатура,
	                |	ВТ_КонстантыПоставщика КАК КонстантыПоставщика
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказыПокупателя.Заказ,
	                |	ЗаказыПокупателя.Номенклатура
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказыПокупателя.Заказ КАК ЗаказПокупателя,
	                |	ЗаказыПокупателя.Номенклатура КАК Номенклатура,
	                |	СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0)) КАК ЗаказаноПоставщикуОстаток
	                |ПОМЕСТИТЬ ВТ_РазмещениеЗаказов
	                |ИЗ
	                |	ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ) КАК РазмещениеЗаказовПокупателейОстатки
	                |		ПО ЗаказыПокупателя.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
	                |			И ЗаказыПокупателя.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказыПокупателя.Заказ,
	                |	ЗаказыПокупателя.Номенклатура
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказПокупателяТовары.Номенклатура,
	                |	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
	                |	ЗаказПокупателяТовары.Ссылка КАК Заказ
	                |ПОМЕСТИТЬ ВТ_Заказано
	                |ИЗ
	                |	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	                |ГДЕ
	                |	ЗаказПокупателяТовары.Ссылка В
	                |			(ВЫБРАТЬ
	                |				ВТ_ЗаказыПокупателя.Заказ
	                |			ИЗ
	                |				ВТ_ЗаказыПокупателя)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказПокупателяТовары.Номенклатура,
	                |	ЗаказПокупателяТовары.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	СборкаЗаказовПокупателяЗаказано.Заказ,
	                |	СборкаЗаказовПокупателяЗаказано.Номенклатура,
	                |	СУММА(СборкаЗаказовПокупателяЗаказано.Количество) КАК Количество,
	                |	МАКСИМУМ(ВЫБОР
	                |			КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован = ИСТИНА
	                |					И СборкаЗаказовПокупателяЗаказано.Ссылка.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)
	                |				ТОГДА ДОБАВИТЬКДАТЕ(ВЫБОР
	                |							КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.ДатаДоставкиКлиенту = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                |								ТОГДА СборкаЗаказовПокупателяЗаказано.Заказ.Дата
	                |							ИНАЧЕ СборкаЗаказовПокупателяЗаказано.Ссылка.ДатаДоставкиКлиенту
	                |						КОНЕЦ, ДЕНЬ, ВЫБОР
	                |							КОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.Договор.ДержатьРезервБезОплатыОграниченноеВремя
	                |									И СборкаЗаказовПокупателяЗаказано.Ссылка.Договор.ЧислоДнейРезерваБезОплаты > &ЧислоДней
	                |								ТОГДА СборкаЗаказовПокупателяЗаказано.Ссылка.Договор.ЧислоДнейРезерваБезОплаты
	                |							ИНАЧЕ &ЧислоДней
	                |						КОНЕЦ)
	                |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                |		КОНЕЦ) КАК ДатаСамовывоза,
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	МАКСИМУМ(СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован) КАК ДокументСобранИУпакован
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ПОМЕСТИТЬ ВТ_Собрано
	                |ИЗ
	                |	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	                |ГДЕ
	                |	СборкаЗаказовПокупателяЗаказано.Заказ В
	                |			(ВЫБРАТЬ
	                |				ВТ_ЗаказыПокупателя.Заказ
	                |			ИЗ
	                |				ВТ_ЗаказыПокупателя)
	                |	И СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	СборкаЗаказовПокупателяЗаказано.Заказ,
	                |	СборкаЗаказовПокупателяЗаказано.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Реализации.Номенклатура,
	                |	ВТ_Реализации.Заказ КАК Заказ,
	                |	СУММА(ВТ_Реализации.Передано) КАК Передано,
	                |	СУММА(ВТ_Реализации.НеПередано) КАК НеПередано
	                |ПОМЕСТИТЬ ВТ_ПереданоНеПередано
	                |ИЗ
	                |	ВТ_Реализации КАК ВТ_Реализации
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_Реализации.Номенклатура,
	                |	ВТ_Реализации.Заказ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ГрузовоеМестоТовары.Заказ,
	                |	СУММА(ЕСТЬNULL(ВЫБОР
	                |				КОГДА НЕ ГрузовоеМестоТовары.Ссылка.Погружено
	                |					ТОГДА ГрузовоеМестоТовары.Количество
	                |				ИНАЧЕ 0
	                |			КОНЕЦ, 0)) КАК КПогрузке,
	                |	СУММА(ЕСТЬNULL(ВЫБОР
	                |				КОГДА ГрузовоеМестоТовары.Ссылка.Погружено
	                |					ТОГДА ГрузовоеМестоТовары.Количество
	                |				ИНАЧЕ 0
	                |			КОНЕЦ, 0)) КАК НаДоставке,
	                |	ГрузовоеМестоТовары.Номенклатура
	                |ПОМЕСТИТЬ ВТ_КПогрузкеНаДоставке
	                |ИЗ
	                |	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	                |ГДЕ
	                |	ГрузовоеМестоТовары.Ссылка.Проведен
	                |	И ГрузовоеМестоТовары.Заказ В
	                |			(ВЫБРАТЬ
	                |				ВТ_ЗаказыПокупателя.Заказ
	                |			ИЗ
	                |				ВТ_ЗаказыПокупателя)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ГрузовоеМестоТовары.Заказ,
	                |	ГрузовоеМестоТовары.Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	КорректировкаЗаказаПокупателяТовары.Номенклатура,
	                |	СУММА(ВЫБОР
	                |			КОГДА КорректировкаЗаказаПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
	                |				ТОГДА КорректировкаЗаказаПокупателяТовары.Количество * -1
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК ОтказКлиента,
	                |	КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя КАК Заказ,
	                |	СУММА(ВЫБОР
					//+Сёмин Р.И. 12.03.2026 #UT10-5726
					//|			КОГДА КорректировкаЗаказаПокупателяТовары.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
					|			КОГДА КорректировкаЗаказаПокупателяТовары.Причина <> ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
					//-Сёмин Р.И. 12.03.2026 #UT10-5726
	                |				ТОГДА КорректировкаЗаказаПокупателяТовары.Количество * -1
	                |			ИНАЧЕ 0
	                |		КОНЕЦ) КАК ОтказПоставщика
	                |ПОМЕСТИТЬ ВТ_ОтказКлиентаПоставщика
	                |ИЗ
	                |	Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	                |ГДЕ
	                |	КорректировкаЗаказаПокупателяТовары.Ссылка.Проведен
	                |	И КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя В
	                |			(ВЫБРАТЬ
	                |				ВТ_ЗаказыПокупателя.Заказ
	                |			ИЗ
	                |				ВТ_ЗаказыПокупателя)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	КорректировкаЗаказаПокупателяТовары.Номенклатура,
	                |	КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЗаказыПокупателя.Заказ КАК ЗаказПокупателя,
	                |	ЗаказыПокупателя.Номенклатура КАК Номенклатура,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_Заказано.Количество, 0)) КАК КоличествоЗаказано,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_Собрано.Количество, 0)) КАК КоличествоСобрано,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_КПогрузкеНаДоставке.КПогрузке, 0)) КАК КоличествоКПогрузке,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_КПогрузкеНаДоставке.НаДоставке, 0)) КАК КоличесвоНаДоставке,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_ПереданоНеПередано.Передано, 0)) КАК КоличествоВыполнено,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_ПереданоНеПередано.НеПередано, 0)) КАК КоличествоВРелизацииНеПереданного,
	                |	МАКСИМУМ(0) КАК КоличествоОжидается,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_ОтказКлиентаПоставщика.ОтказКлиента, 0)) КАК КоличествоОтказКлиента,
	                |	МАКСИМУМ(ЕСТЬNULL(ВТ_ОтказКлиентаПоставщика.ОтказПоставщика, 0)) КАК КоличествоОтказПоставщика,
	                |	МАКСИМУМ(ЕСТЬNULL(РазмещениеЗаказов.ЗаказаноПоставщикуОстаток, 0)) КАК ЗаказаноПоставщикуОстаток,
	                |	ЗаказыПокупателя.Заказ.Контрагент.Наименование КАК НаименованиеКонтрагент,
	                |	ЗаказыПокупателя.Заказ.Организация.Наименование КАК НаименованиеОрганизация,
	                |	ЕСТЬNULL(ЗаказыПокупателя.Заказ.ТипЦен.КодМДМ, """") КАК ИдентификаторТипЦен,
	                |	МИНИМУМ(ВТ_Собрано.ДатаСамовывоза) КАК ДатаСамовывоза,
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	МИНИМУМ(ВТ_Собрано.ДокументСобранИУпакован) КАК ДокументСобранИУпакован
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ПОМЕСТИТЬ ВТ_СтатусыЗаказов
	                |ИЗ
	                |	ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РазмещениеЗаказов КАК РазмещениеЗаказов
	                |		ПО ЗаказыПокупателя.Заказ = РазмещениеЗаказов.ЗаказПокупателя
	                |			И ЗаказыПокупателя.Номенклатура = РазмещениеЗаказов.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заказано КАК ВТ_Заказано
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_Заказано.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_Заказано.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Собрано КАК ВТ_Собрано
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_Собрано.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_Собрано.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КПогрузкеНаДоставке КАК ВТ_КПогрузкеНаДоставке
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_КПогрузкеНаДоставке.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_КПогрузкеНаДоставке.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПереданоНеПередано КАК ВТ_ПереданоНеПередано
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_ПереданоНеПередано.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_ПереданоНеПередано.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтказКлиентаПоставщика КАК ВТ_ОтказКлиентаПоставщика
	                |		ПО ЗаказыПокупателя.Заказ = ВТ_ОтказКлиентаПоставщика.Заказ
	                |			И ЗаказыПокупателя.Номенклатура = ВТ_ОтказКлиентаПоставщика.Номенклатура
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ЗаказыПокупателя.Заказ,
	                |	ЗаказыПокупателя.Номенклатура,
	                |	ЗаказыПокупателя.Заказ.Контрагент.Наименование,
	                |	ЗаказыПокупателя.Заказ.Организация.Наименование,
	                |	ЕСТЬNULL(ЗаказыПокупателя.Заказ.ТипЦен.КодМДМ, """")
	                |
	                |ИНДЕКСИРОВАТЬ ПО
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_РазмещениеЗаказов
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_СтатусыЗаказов.ЗаказПокупателя,
	                |	ВТ_СтатусыЗаказов.Номенклатура,
	                |	СтатусыЗаказовДатаОтгрузки.СчетФактураВыданный КАК СчетФактураВыданный,
	                |	СтатусыЗаказовДатаОтгрузки.ДокументаОтгрузки КАК ДокументОтгрузки,
	                |	ВТ_СтатусыЗаказов.ЗаказПокупателя.Номер КАК НомерЗаказа,
	                |	СтатусыЗаказовДатаОтгрузки.НомерСчетФактуры КАК НомерСчетФактуры,
	                |	ВТ_СтатусыЗаказов.ЗаказПокупателя.Дата КАК ДатаЗаказа,
	                |	СтатусыЗаказовДатаОтгрузки.ДатаСчетФактуры КАК ДатаСчетФактуры,
	                |	ЗаказыПокупателя.НаименованиеГрузополучатель КАК НаименованиеГрузополучатель,
	                |	ЗаказыПокупателя.ИдентификаторГрузополучатель КАК ИдентификаторГрузополучатель,
	                |	ЗаказыПокупателя.ИдентификаторКонтрагент КАК ИдентификаторКонтрагент,
	                |	ЗаказыПокупателя.Комментарий КАК Комментарий,
	                |	""RUB"" КАК НаименованиеВалюта,
	                |	ЗаказыПокупателя.НаименованиеДоговор КАК НаименованиеДоговор,
	                |	ЗаказыПокупателя.ИдентификаторДоговор КАК ИдентификаторДоговор,
	                |	Склады.Наименование КАК НаименованиеСклад,
	                |	ВТ_СтатусыЗаказов.НаименованиеОрганизация КАК НаименованиеОрганизация,
	                |	ВТ_СтатусыЗаказов.НаименованиеКонтрагент КАК НаименованиеКонтрагент,
	                |	ЗаказыПокупателя.СуммаДокумента КАК СуммаДокумента,
	                |	ВТ_СтатусыЗаказов.КоличествоЗаказано,
	                |	ВТ_СтатусыЗаказов.КоличествоСобрано,
	                |	ВТ_СтатусыЗаказов.КоличествоКПогрузке,
	                |	ВТ_СтатусыЗаказов.КоличесвоНаДоставке,
	                |	ВТ_СтатусыЗаказов.КоличествоВыполнено,
	                |	ВТ_СтатусыЗаказов.КоличествоВРелизацииНеПереданного,
	                |	ВТ_СтатусыЗаказов.КоличествоОжидается,
	                |	ВТ_СтатусыЗаказов.ЗаказаноПоставщикуОстаток,
	                |	ВТ_СтатусыЗаказов.КоличествоОтказКлиента,
	                |	ВТ_СтатусыЗаказов.КоличествоОтказПоставщика,
	                |	ВТ_Зарезервированно.КоличествоРезерв,
	                |	ВТ_СтатусыЗаказов.Номенклатура.Код КАК НомерНоменклатуры,
	                |	СтатусыЗаказовДатаОтгрузки.ВалютаСчетФактуры,
	                |	ВТ_СтатусыЗаказов.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентНомеклатуры,
	                |	ВТ_СтатусыЗаказов.КоличествоЗаказано КАК Количество,
	                |	СтатусыЗаказовДатаОтгрузки.ДатаОтгрузки,
	                |	ЕСТЬNULL(СтатусыЗаказовДатаОтгрузки.КоличествоОтгрузки, 0) КАК КоличествоОтгрузки,
	                |	ЗаказыПокупателя.Цена,
	                |	ЗаказыПокупателя.КомментарийНоменклатуры КАК КомментарийНоменклатуры,
	                |	ЗаказыПокупателя.Цена * ЗаказыПокупателя.Количество КАК Сумма,
	                |	ЗаказыПокупателя.СтавкаНДС КАК СтавкаНДС,
	                |	ВТ_СтатусыЗаказов.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	                |	ВТ_СтатусыЗаказов.Номенклатура.Наименование КАК НаименованиеНоменклатура,
	                |	ВТ_СтатусыЗаказов.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК НаименованиеЕдиницаХранения,
	                |	"" "" КАК Статус,
	                |	ЗаказыПокупателя.Бренд КАК Бренд,
	                |	ВТ_СтатусыЗаказов.КоличествоЗаказано - ВТ_СтатусыЗаказов.КоличествоВыполнено КАК КоличествоМинус,
	                |	ВТ_СтатусыЗаказов.ЗаказПокупателя.ДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	                |	ВТ_СтатусыАварда.СтатусAvarda,
	                |	ВТ_СтатусыАварда.СтатусПоДопПостащику,
	                |	ЗаказыПокупателя.ТипДоставки КАК ТипДоставки,
	                |	ЗаказыПокупателя.ИдентификаторЗаказаИМ КАК ИдентификаторЗаказаИМ,
	                |	ЗаказыПокупателя.ИдентификаторСклад КАК ИдентификаторСклад,
	                |	ЗаказыПокупателя.Грузополучатель КАК Грузополучатель,
	                |	ЗаказыПокупателя.ИсточникЗаказа КАК ИсточникЗаказа,
	                |	ЗаказыПокупателя.ТаксиДоставка КАК ТаксиДоставка,
	                |	ЗаказыПокупателя.СпособДоставки КАК СпособДоставки,
	                |	ЗаказыПокупателя.Договор КАК Договор,
	                |	ВТ_СтатусыЗаказов.ИдентификаторТипЦен КАК ИдентификаторТипЦен,
	                |	ВТ_СтатусыЗаказов.Номенклатура.НеПодлежитВозврату
	                |		ИЛИ ВТ_СтатусыЗаказов.ЗаказПокупателя.IDСклада_СтороннийСклад <> ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка) КАК НевозвратныйТовар,
	                |	ВТ_СтатусыЗаказов.ДатаСамовывоза,
	                |	СтатусыЗаказовДатаОтгрузки.ДатаРеализации,
	                |	ВТ_СтатусыЗаказов.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	ВТ_СтатусыЗаказов.ДокументСобранИУпакован
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ПОМЕСТИТЬ ВТ_Итоговая
	                |ИЗ
	                |	ВТ_СтатусыЗаказов КАК ВТ_СтатусыЗаказов
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Зарезервированно КАК ВТ_Зарезервированно
	                |		ПО ВТ_СтатусыЗаказов.ЗаказПокупателя = ВТ_Зарезервированно.ЗаказПокупателя
	                |			И ВТ_СтатусыЗаказов.Номенклатура = ВТ_Зарезервированно.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыАварда КАК ВТ_СтатусыАварда
	                |		ПО ВТ_СтатусыЗаказов.ЗаказПокупателя = ВТ_СтатусыАварда.ЗаказПокупателя
	                |			И ВТ_СтатусыЗаказов.Номенклатура = ВТ_СтатусыАварда.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыЗаказовДатаОтгрузки КАК СтатусыЗаказовДатаОтгрузки
	                |		ПО ВТ_СтатусыЗаказов.ЗаказПокупателя = СтатусыЗаказовДатаОтгрузки.ЗаказПокупателя
	                |			И ВТ_СтатусыЗаказов.Номенклатура = СтатусыЗаказовДатаОтгрузки.Номенклатура
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	                |		ПО ВТ_СтатусыЗаказов.ЗаказПокупателя.СкладГруппа = Склады.Ссылка
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗаказыПокупателя КАК ЗаказыПокупателя
	                |		ПО ВТ_СтатусыЗаказов.ЗаказПокупателя = ЗаказыПокупателя.Заказ
	                |			И ВТ_СтатусыЗаказов.Номенклатура = ЗаказыПокупателя.Номенклатура
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка,
	                |	НеСозданныеЗаказыПокупателейТовары.НомерСтроки,
	                |	ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка),
	                |	ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка),
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.Код,
	                |	"""",
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата,
	                |	NULL,
	                |	ЕСТЬNULL(ВТ_НесозданныеЗаказы.Грузополучатель.Наименование, """"),
	                |	ВТ_НесозданныеЗаказы.Грузополучатель.КодМДМ,
	                |	ВТ_НесозданныеЗаказы.Контрагент.КодМДМ,
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment,
	                |	""RUB"",
	                |	ЕСТЬNULL(ВТ_НесозданныеЗаказы.Договор.Наименование, """"),
	                |	ВТ_НесозданныеЗаказы.Договор.КодМДМ,
	                |	"""",
	                |	ЕСТЬNULL(ВТ_НесозданныеЗаказы.Договор.Организация.Наименование, """"),
	                |	ЕСТЬNULL(ВТ_НесозданныеЗаказы.Контрагент.Наименование, """"),
	                |	ВТ_НесозданныеЗаказы.Сумма,
	                |	НеСозданныеЗаказыПокупателейТовары.Count,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	0,
	                |	НеСозданныеЗаказыПокупателейТовары.NumberInv,
	                |	"""",
	                |	НеСозданныеЗаказыПокупателейТовары.Кратность,
	                |	НеСозданныеЗаказыПокупателейТовары.Count,
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.Dostavka,
	                |	0,
	                |	НеСозданныеЗаказыПокупателейТовары.Price,
	                |	НеСозданныеЗаказыПокупателейТовары.Comment,
	                |	НеСозданныеЗаказыПокупателейТовары.Price * НеСозданныеЗаказыПокупателейТовары.Count,
	                |	&СтавкаНДС,
	                |	НеСозданныеЗаказыПокупателейТовары.Articul,
	                |	НеСозданныеЗаказыПокупателейТовары.Name,
	                |	НеСозданныеЗаказыПокупателейТовары.EDIzmer,
	                |	"" "",
	                |	НеСозданныеЗаказыПокупателейТовары.Brand,
	                |	0,
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.Dostavka,
	                |	"""",
	                |	"""",
	                |	ВЫБОР
	                |		КОГДА НеСозданныеЗаказыПокупателейТовары.Ссылка.TipDost = 1
	                |			ТОГДА 1
	                |		ИНАЧЕ 2
	                |	КОНЕЦ,
	                |	СТРОКА(НеСозданныеЗаказыПокупателейТовары.Ссылка.Код),
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.SkladID,
	                |	ВТ_НесозданныеЗаказы.Грузополучатель,
	                |	НеСозданныеЗаказыПокупателейТовары.Ссылка.OrderSource,
	                |	ВЫБОР
	                |		КОГДА НеСозданныеЗаказыПокупателейТовары.Ссылка.TipDost = 5
	                |			ТОГДА ИСТИНА
	                |		ИНАЧЕ ЛОЖЬ
	                |	КОНЕЦ,
	                |	ВЫБОР
	                |		КОГДА НеСозданныеЗаказыПокупателейТовары.Ссылка.TipDost = 1
	                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СпособДоставки.Самовывоз)
	                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СпособДоставки.НашаДоставка)
	                |	КОНЕЦ,
	                |	ВТ_НесозданныеЗаказы.Договор,
	                |	ВТ_НесозданныеЗаказы.ИдентификаторТипЦен,
	                |	ЛОЖЬ,
	                |	НЕОПРЕДЕЛЕНО,
	                |	НЕОПРЕДЕЛЕНО,
	                |	"""",
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	НЕОПРЕДЕЛЕНО
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ИЗ
	                |	ВТ_НесозданныеЗаказы КАК ВТ_НесозданныеЗаказы
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	                |		ПО ВТ_НесозданныеЗаказы.Ссылка = НеСозданныеЗаказыПокупателейТовары.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_ЗаказыПокупателя
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_СтатусыЗаказовДатаОтгрузки
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_СтатусыАварда
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_Зарезервированно
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_Итоговая.ЗаказПокупателя КАК ЗаказПокупателя,
	                |	ВТ_Итоговая.ИдентификаторЗаказаИМ КАК ИдентификаторЗаказаИМ,
	                |	ВТ_Итоговая.ТипДоставки КАК ТипДоставки,
	                |	ВТ_Итоговая.ИсточникЗаказа КАК ИсточникЗаказа,
	                |	ВТ_Итоговая.ИдентификаторСклад КАК ИдентификаторСклад,
	                |	ВТ_Итоговая.Грузополучатель КАК Грузополучатель,
	                |	ВТ_Итоговая.Номенклатура КАК Номенклатура,
	                |	ВТ_Итоговая.Комментарий КАК Комментарий,
	                |	ВТ_Итоговая.СчетФактураВыданный КАК СчетФактураВыданный,
	                |	ВТ_Итоговая.ДокументОтгрузки КАК ДокументаОтгрузки,
	                |	ВТ_Итоговая.НомерЗаказа КАК НомерЗаказа,
	                |	ВТ_Итоговая.НомерСчетФактуры,
	                |	ВТ_Итоговая.ДатаЗаказа КАК ДатаЗаказа,
	                |	ВТ_Итоговая.ДатаСчетФактуры,
	                |	ВТ_Итоговая.НаименованиеГрузополучатель КАК НаименованиеГрузополучатель,
	                |	ВТ_Итоговая.ИдентификаторГрузополучатель КАК ИдентификаторГрузополучатель,
	                |	ВТ_Итоговая.ИдентификаторКонтрагент КАК ИдентификаторКонтрагент,
	                |	ВТ_Итоговая.НаименованиеДоговор КАК НаименованиеДоговор,
	                |	ВТ_Итоговая.ИдентификаторДоговор КАК ИдентификаторДоговор,
	                |	ВТ_Итоговая.НаименованиеСклад КАК НаименованиеСклад,
	                |	ВТ_Итоговая.НаименованиеОрганизация КАК НаименованиеОрганизация,
	                |	ВТ_Итоговая.НаименованиеКонтрагент КАК НаименованиеКонтрагент,
					//+Сёмин Р.И. 18.03.2026 #UT10-5776
					//|	ВЫРАЗИТЬ(ВТ_Итоговая.СуммаДокумента КАК ЧИСЛО(15, 2)) КАК СуммаДокументаСНДС,
	                |	ВЫРАЗИТЬ(ЕСТЬNULL(ВТ_Итоговая.СуммаДокумента, 0) КАК ЧИСЛО(15, 2)) КАК СуммаДокументаСНДС,
					//-Сёмин Р.И. 18.03.2026 #UT10-5776
	                |	ВТ_Итоговая.КоличествоЗаказано КАК КоличествоЗаказано,
	                |	ВТ_Итоговая.КоличествоСобрано КАК КоличествоСобрано,
	                |	ВТ_Итоговая.КоличествоКПогрузке КАК КоличествоКПогрузке,
	                |	ВТ_Итоговая.КоличесвоНаДоставке КАК КоличесвоНаДоставке,
	                |	ВТ_Итоговая.КоличествоВыполнено КАК КоличествоВыполнено,
	                |	ВТ_Итоговая.КоличествоВРелизацииНеПереданного КАК КоличествоВРелизацииНеПереданного,
	                |	ВТ_Итоговая.КоличествоОжидается КАК КоличествоОжидается,
	                |	ВТ_Итоговая.ЗаказаноПоставщикуОстаток КАК ЗаказаноПоставщикуОстаток,
	                |	ВТ_Итоговая.КоличествоОтказКлиента КАК КоличествоОтказКлиента,
	                |	ВТ_Итоговая.КоличествоОтказПоставщика КАК КоличествоОтказПоставщика,
	                |	ВТ_Итоговая.КоличествоРезерв КАК КоличествоРезерв,
	                |	ВТ_Итоговая.НомерНоменклатуры КАК НомерНоменклатуры,
	                |	ВТ_Итоговая.ВалютаСчетФактуры,
	                |	ВТ_Итоговая.КоэффициентНомеклатуры КАК КоэффициентНомеклатуры,
	                |	ВТ_Итоговая.Количество КАК Количество,
	                |	ВТ_Итоговая.ДатаОтгрузки КАК ДатаОтгрузки,
	                |	ВТ_Итоговая.КоличествоОтгрузки КАК КоличествоОтгрузкиСФ,
	                |	ВТ_Итоговая.Цена КАК ЦенаСНДС,
	                |	ВТ_Итоговая.СтавкаНДС КАК СтавкаНДС,
	                |	ВТ_Итоговая.КомментарийНоменклатуры КАК КомментарийНоменклатуры,
	                |	ВЫРАЗИТЬ(ВТ_Итоговая.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма,
	                |	ВТ_Итоговая.КодПроизводителя КАК КодПроизводителя,
	                |	ВТ_Итоговая.НаименованиеНоменклатура КАК НаименованиеНоменклатура,
	                |	ВТ_Итоговая.Бренд КАК Бренд,
	                |	ВТ_Итоговая.НаименованиеЕдиницаХранения КАК НаименованиеЕдиницаХранения,
	                |	ВТ_Итоговая.КоличествоМинус КАК КоличествоМинус,
	                |	ВТ_Итоговая.ПлановаяДатаОтгрузки КАК ПлановаяДатаОтгрузки,
	                |	ВТ_Итоговая.СтатусAvarda КАК СтатусAvarda,
	                |	ВТ_Итоговая.СтатусПоДопПостащику КАК СтатусПоДопПостащику,
	                |	ВТ_Итоговая.ТаксиДоставка КАК ТаксиДоставка,
	                |	ВТ_Итоговая.СпособДоставки КАК СпособДоставки,
	                |	ВТ_Итоговая.Договор КАК Договор,
	                |	ВТ_Итоговая.ИдентификаторТипЦен КАК ИдентификаторТипаЦен,
	                |	ВТ_Итоговая.НевозвратныйТовар КАК НевозвратныйТовар,
	                |	ВТ_Итоговая.ДатаСамовывоза КАК ДатаСамовывоза,
	                |	ВТ_Итоговая.ДатаРеализации,
	                |	ВТ_Итоговая.КодМДМНоменклатуры КАК КодМДМНоменклатуры,
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	ВТ_Итоговая.ДокументСобранИУпакован КАК ДокументСобранИУпакован
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ИЗ
	                |	ВТ_Итоговая КАК ВТ_Итоговая
					//+Сёмин Р.И. 18.03.2026 #UT10-5776
					|	ГДЕ
					|		ЕСТЬNULL(ВТ_Итоговая.Сумма, 0) <> 0
					//-Сёмин Р.И. 18.03.2026 #UT10-5776
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	ДатаЗаказа УБЫВ
	                |ИТОГИ
	                |	МАКСИМУМ(ТипДоставки),
	                |	МАКСИМУМ(ИсточникЗаказа),
	                |	МАКСИМУМ(ИдентификаторСклад),
	                |	МАКСИМУМ(Грузополучатель),
	                |	МАКСИМУМ(Комментарий),
	                |	МАКСИМУМ(СчетФактураВыданный),
	                |	МАКСИМУМ(ДокументаОтгрузки),
	                |	МАКСИМУМ(НомерЗаказа),
	                |	МАКСИМУМ(ДатаЗаказа),
	                |	МАКСИМУМ(НаименованиеГрузополучатель),
	                |	МАКСИМУМ(ИдентификаторГрузополучатель),
	                |	МАКСИМУМ(ИдентификаторКонтрагент),
	                |	МАКСИМУМ(НаименованиеДоговор),
	                |	МАКСИМУМ(ИдентификаторДоговор),
	                |	МАКСИМУМ(НаименованиеСклад),
	                |	МАКСИМУМ(НаименованиеОрганизация),
	                |	МАКСИМУМ(НаименованиеКонтрагент),
	                |	МАКСИМУМ(СуммаДокументаСНДС),
	                |	МАКСИМУМ(КоличествоЗаказано),
	                |	МАКСИМУМ(КоличествоСобрано),
	                |	МАКСИМУМ(КоличествоКПогрузке),
	                |	МАКСИМУМ(КоличесвоНаДоставке),
	                |	МАКСИМУМ(КоличествоВыполнено),
	                |	МАКСИМУМ(КоличествоВРелизацииНеПереданного),
	                |	МАКСИМУМ(КоличествоОжидается),
	                |	МАКСИМУМ(ЗаказаноПоставщикуОстаток),
	                |	МАКСИМУМ(КоличествоОтказКлиента),
	                |	МАКСИМУМ(КоличествоОтказПоставщика),
	                |	МАКСИМУМ(КоличествоРезерв),
	                |	МАКСИМУМ(НомерНоменклатуры),
	                |	МАКСИМУМ(КоэффициентНомеклатуры),
	                |	МАКСИМУМ(Количество),
	                |	МАКСИМУМ(ДатаОтгрузки),
	                |	МАКСИМУМ(ЦенаСНДС),
	                |	МАКСИМУМ(СтавкаНДС),
	                |	МАКСИМУМ(КомментарийНоменклатуры),
	                |	МАКСИМУМ(Сумма),
	                |	МАКСИМУМ(КодПроизводителя),
	                |	МАКСИМУМ(НаименованиеНоменклатура),
	                |	МАКСИМУМ(Бренд),
	                |	МАКСИМУМ(НаименованиеЕдиницаХранения),
	                |	МАКСИМУМ(КоличествоМинус),
	                |	МАКСИМУМ(ПлановаяДатаОтгрузки),
	                |	МИНИМУМ(СтатусAvarda),
	                |	МИНИМУМ(СтатусПоДопПостащику),
	                |	МАКСИМУМ(ТаксиДоставка),
	                |	МАКСИМУМ(СпособДоставки),
	                |	МАКСИМУМ(Договор),
	                |	МАКСИМУМ(ИдентификаторТипаЦен),
	                |	МАКСИМУМ(НевозвратныйТовар),
	                |	МАКСИМУМ(ДатаСамовывоза),
	                |	МАКСИМУМ(КодМДМНоменклатуры),
					//+Сёмин Р.И. 13.03.2026 #UT10-5726
					|	МАКСИМУМ(ДокументСобранИУпакован)
					//-Сёмин Р.И. 13.03.2026 #UT10-5726
	                |ПО
	                |	ИдентификаторЗаказаИМ,
	                |	ЗаказПокупателя,
	                |	Номенклатура
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |УНИЧТОЖИТЬ ВТ_Итоговая";
	
	Возврат Текст;
	
КонецФункции

Процедура ОбработатьЗапросПоЗаказу(РезультатЗапросаЗаказовПоСтатусам, ДетальнаяИнформация, СтрокаПараметров, МассивРезультат, СтатусЗаказа)
	
	ИдентификаторУчетнойСистемы = Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
	
	ВыборкаПоИдентификаторам = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаПоИдентификаторам.Следующий() Цикл
		
		МассивСФ = Новый Массив;
		МассивДобавленныхНомеровСФ = Новый Массив;
		
		МассивТоваров = Новый Массив;  
		
		ИтоговаяСуммаДокументаСНДС = 0;
		
		ВыборкаРезультатаЗаказ = ВыборкаПоИдентификаторам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		
		Пока ВыборкаРезультатаЗаказ.Следующий() Цикл
			
			ИтоговаяСуммаДокументаСНДС = ИтоговаяСуммаДокументаСНДС + ВыборкаРезультатаЗаказ.СуммаДокументаСНДС;
			
			МассивСтруктурСтатусов = Новый Массив;
			
			ТаблицаСтатусов = Новый ТаблицаЗначений;
			ТаблицаСтатусов.Колонки.Добавить("Статус");
			ТаблицаСтатусов.Колонки.Добавить("Количество");
			
			ЗаказПокупателя = ВыборкаРезультатаЗаказ.ЗаказПокупателя; 
			
			СтрокаВозврата = Новый Структура(СтрокаПараметров);
			ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультатаЗаказ); 
			
			СтрокаВозврата.АдресДоставки = ?(ЗначениеЗаполнено(ЗначениеЗаполнено(ВыборкаРезультатаЗаказ.Грузополучатель)), ПолучитьАдресДоставки(ВыборкаРезультатаЗаказ.Грузополучатель), "");
			СтрокаВозврата.ДатаОформленияЗаказа 	= ЗаказПокупателя.Дата;
			
			//общие параметры из заказа   
			СтрокаВозврата.ИдентификаторУчетнойСистемы = ИдентификаторУчетнойСистемы;
			СтрокаВозврата.НаименованиеГрузополучатель 	= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеГрузополучатель);
			СтрокаВозврата.НаименованиеКонтрагент 		= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеКонтрагент);     
			СтрокаВозврата.ИдентификаторГрузополучатель 	= СокрЛП(ВыборкаРезультатаЗаказ.ИдентификаторГрузополучатель);
			СтрокаВозврата.ИдентификаторКонтрагент 		= СокрЛП(ВыборкаРезультатаЗаказ.ИдентификаторКонтрагент);
			СтрокаВозврата.Комментарий 				= СокрЛП(ВыборкаРезультатаЗаказ.Комментарий);
			СтрокаВозврата.НаименованиеВалюта 		= "RUB";
			СтрокаВозврата.НаименованиеДоговора 	= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеДоговор);
			СтрокаВозврата.ИдентификаторДоговора 	= СокрЛП(ВыборкаРезультатаЗаказ.ИдентификаторДоговор);	
			СтрокаВозврата.СуммаДокументаСНДС = ИтоговаяСуммаДокументаСНДС;
				
			СтрокаВозврата.НаименованиеОрганизации 	= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеОрганизация); 
						
			ВыборкаРезультатаНоменклатура = ВыборкаРезультатаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРезультатаНоменклатура.Следующий() Цикл 
								
				//Формируем массив товаров
				МассивСтруктурСтатусов = ЗаполнитьСтрокуОтвета(ВыборкаРезультатаНоменклатура, ДетальнаяИнформация, СтрокаПараметров, МассивТоваров, СтатусЗаказа);
				
				Если Не ЗначениеЗаполнено(МассивСтруктурСтатусов) Тогда
					Продолжить;
				КонецЕсли;  
				
				Для каждого СтруктураСтатуса Из МассивСтруктурСтатусов Цикл
					
					НСтр = ТаблицаСтатусов.Добавить();
					НСтр.Статус = СтруктураСтатуса.Статус;
					НСтр.Количество = СтруктураСтатуса.Количество;
					
				КонецЦикла; 			
				
			КонецЦикла;	
		
			ТаблицаСтатусов.Свернуть("Статус", "Количество");
			ИтоговыйСтатус = "";
			
			Для каждого Стр Из ТаблицаСтатусов Цикл
				ИтоговыйСтатус = ИтоговыйСтатус + Стр.Статус + ";" + СокрЛП(Стр.Количество) + ",";	
			КонецЦикла;       
						
		КонецЦикла;	
				
		Если ДетальнаяИнформация Тогда		
			
			СтрокаВозврата.Вставить("Товары", МассивТоваров); 
			
			//+Белов А. 22.09.2025 #UT10-5334
			СтрокаВозврата.Вставить("ТоварыВРезерве", ПолучитьМассивТоваровВРезерве(МассивТоваров)); 
			//-Белов А. 22.09.2025 #UT10-5334  
			
			//+Белов А. 10.11.2025 #UT10-5495
			СтрокаВозврата.Вставить("ЗапросыИзмененияКоличества", ПолучитьМассивЗапросовНаИзменениеКоличества(МассивТоваров)); 	
			//-Белов А. 10.11.2025 #UT10-5495
						
		КонецЕсли;  
			
		МассивРезультат.Добавить(СтрокаВозврата);
		
	КонецЦикла;

КонецПроцедуры

Функция ПолучитьМассивЗапросовНаИзменениеКоличества(МассивТоваров)
	
	МассивВозврата = Новый Массив;
	
	ТаблицаТоваров = ПреобразованиеМассивВТаблицуЗначений(МассивТоваров);
	
	ТаблицаТоваровКопия = ТаблицаТоваров.Скопировать();
	ТаблицаТоваровКопия.Свернуть("ИдентификаторДокумента");
	
	Для каждого СтрДокумента Из ТаблицаТоваровКопия Цикл
		
		Заказ = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДокумента.ИдентификаторДокумента)); 
		
		Если Заказ.ПолучитьОбъект() = Неопределено Тогда
			Продолжить;
		КонецЕсли;     
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Номенклатура.Код КАК НомерНоменклатуры,
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Статус,
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Количество,
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Комментарий,
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Идентификатор,
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Номенклатура.КодМДМ КАК КодМДМ
		|ИЗ
		|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказахНовые КАК ЗапросыИзмененияКоличестваВЗаказахНовые
		|ГДЕ
		|	ЗапросыИзмененияКоличестваВЗаказахНовые.Заказ = &Заказ";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);  
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураЗапроса = Новый Структура;
			СтруктураЗапроса.Вставить("НомерНоменклатуры", Выборка.НомерНоменклатуры);
			//+Белов А. 01.12.2025 #UT10-5450
			СтруктураЗапроса.Вставить("КодМДМНоменклатуры", Выборка.КодМДМ);
			//-Белов А. 01.12.2025 #UT10-5450
			СтруктураЗапроса.Вставить("Статус", Строка(Выборка.Статус));
			СтруктураЗапроса.Вставить("Количество", Выборка.Количество);
			СтруктураЗапроса.Вставить("Комментарий", Выборка.Комментарий);
			СтруктураЗапроса.Вставить("ИдентификаторЗапроса", Выборка.Идентификатор);
			
			МассивВозврата.Добавить(СтруктураЗапроса);
			
		КонецЦикла;                             		
					
	КонецЦикла;   
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ПолучитьМассивТоваровВРезерве(МассивТоваров)
	//+Белов А. 22.09.2025 #UT10-5334
	
	МассивИерархииСтатусов = Новый Массив;  
	МассивИерархииСтатусов.Добавить("Заказан");
	МассивИерархииСтатусов.Добавить("ЗаказаноПоставщику");
	МассивИерархииСтатусов.Добавить("Зарезервирован");
	
	МассивВозврата = Новый Массив;
	
	ТаблицаТоваров = ПреобразованиеМассивВТаблицуЗначений(МассивТоваров);
	
	ТаблицаТоваровКопия = ТаблицаТоваров.Скопировать();
	ТаблицаТоваровКопия.Свернуть("ИдентификаторДокумента");
	
	Для каждого СтрДокумента Из ТаблицаТоваровКопия Цикл
		
		Заказ = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрДокумента.ИдентификаторДокумента));
		
		Если Заказ.ПолучитьОбъект() = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		//+Сёмин Р. 13.11.2025 #UT10-5422
		ОбработкаКорректировкаРезервов = Обработки.КорректировкаРезервов.Создать();
		РезультатПакетаЗапросов = ОбработкаКорректировкаРезервов.ПолучитьДанныеПоРезервамЗаказовПокупателей(Заказ);
		РезультатЗапросаПоРезервам = РезультатПакетаЗапросов[2];
		
		Если РезультатЗапросаПоРезервам.Пустой() Тогда
			
			//+Сёмин Р.И. 10.03.2026 #UT10-5726
			//ДатаОкончанияРезерва = "";
			ДатаОкончанияРезерва = ОбработкаКорректировкаРезервов.ПолучитьДанныеПоРезервуЗаказаНеИзРегистра(Заказ);
			//+Сёмин Р.И. 10.03.2026 #UT10-5726
			
		Иначе
			
			Выборка = РезультатЗапросаПоРезервам.Выбрать();
			Выборка.Следующий();
			
			ДатаОкончанияРезерва = Выборка.ОкончаниеРезерва;
			
		КонецЕсли;
		//-Сёмин Р. 13.11.2025 #UT10-5422
		
		СтрокиСГалкой = Заказ.Товары.НайтиСтроки(Новый Структура("ТолькоРезерв", Истина)); 
		
		Для каждого СтрГалка Из СтрокиСГалкой Цикл
			
			СтрокаПоСтатусом = Неопределено; 
			СтатусОтбора = Неопределено;
			
			ВремТаблицаТоваров = ТаблицаТоваров.Скопировать(Новый Структура("ИдентификаторДокумента, НомерНоменклатуры", СтрДокумента.ИдентификаторДокумента, СтрГалка.Номенклатура.Код));
			ВремТаблицаТоваров.Свернуть("Статус");
			
			Если ВремТаблицаТоваров.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Для каждого СтатусИерархии Из МассивИерархииСтатусов Цикл
				
				СтрокаПоиска = ВремТаблицаТоваров.Найти(СтатусИерархии, "Статус");
				Если СтрокаПоиска <> Неопределено Тогда
					
					СтатусОтбора = СтрокаПоиска.Статус;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтатусОтбора = Неопределено Тогда
				СтатусОтбора = ВремТаблицаТоваров[0].Статус; 	
			КонецЕсли;
						
			СтрокиТоваров = ТаблицаТоваров.НайтиСтроки(Новый Структура("ИдентификаторДокумента, НомерНоменклатуры, Статус", СтрДокумента.ИдентификаторДокумента, СтрГалка.Номенклатура.Код, СтатусОтбора));
			
			Если СтрокиТоваров.Количество() > 0 Тогда
				
				СтруктураВозврата = Новый Структура;
				
				Для каждого Кол Из ТаблицаТоваров.Колонки Цикл
					СтруктураВозврата.Вставить(Кол.Имя, СтрокиТоваров[0][Кол.Имя]);
				КонецЦикла;                                                        
				
				СтруктураВозврата.Вставить("ИдентификаторСтроки", СтрГалка.КлючСтроки); 
				СтруктураВозврата.Количество = СтрГалка.Количество;
				СтруктураВозврата.СуммаСНДС = СтрГалка.Количество * СтруктураВозврата.ЦенаСНДС; 
				
				//+Сёмин Р. 13.11.2025 #UT10-5422
				СтруктураВозврата.Вставить("ДатаОкончанияРезерва", ДатаОкончанияРезерва); 
				//-Сёмин Р. 13.11.2025 #UT10-5422      
								
				МассивВозврата.Добавить(СтруктураВозврата);
				
			КонецЕсли;			
			
		КонецЦикла;
		
	КонецЦикла;   
	
	Возврат МассивВозврата;
	
	//-Белов А. 22.09.2025 #UT10-5334
КонецФункции

Функция ПолучитьНаименованиеСтатусаДляПортала(ИмяСтатуса, Выборка)

	КодСтатуса = ПолучитьКодПоИмениСтатуса(ИмяСтатуса); 	
	ПредставлениеСтатуса = Строка(Перечисления.СостояниеЗаказаПокупателя[ИмяСтатуса]);
	
	//Возврат КодСтатуса + ";" + ПредставлениеСтатуса;
	Возврат ВРег(Лев(ПредставлениеСтатуса, 1)) + Сред(ПредставлениеСтатуса, 2);
	
КонецФункции

Функция ПолучитьКодПоИмениСтатуса(ИмяСтатуса)
	
	Если ИмяСтатуса = "ОтказПокупателя" Тогда
		Возврат "100";	
	ИначеЕсли ИмяСтатуса = "ЗаказаноПоставщику" Тогда
		Возврат "10";
	ИначеЕсли ИмяСтатуса = "ОтказПоставщика" Тогда 
		Возврат "110";
	ИначеЕсли ИмяСтатуса = "Выполнен" Тогда 
		Возврат "60";                         
	ИначеЕсли ИмяСтатуса = "НаДоставке" Тогда
		Возврат "50";
	ИначеЕсли ИмяСтатуса = "ГотовКОтгрузке" Тогда
		Возврат "40";
	ИначеЕсли ИмяСтатуса = "НаПодборе" Тогда
		Возврат "30";	
	ИначеЕсли ИмяСтатуса = "Зарезервирован" Тогда
		Возврат "10";
	ИначеЕсли ИмяСтатуса = "Заказан" Тогда
		Возврат "20";		
	КонецЕсли;

	Возврат "";
	
КонецФункции 	
		
Функция ЗаполнитьСтрокуОтвета(ВыборкаРезультата, ДетальнаяИнформация, СтрокаПараметров, МассивРезультат, СтатусЗаказа = "")     
	
	ЗаказПокупателя = ВыборкаРезультата.ЗаказПокупателя;
		
	МассивСтатусовПолученияОстатка = Новый Массив;
	МассивСтатусовПолученияОстатка.Добавить("Выполнен");
	МассивСтатусовПолученияОстатка.Добавить("НаДоставке");
	МассивСтатусовПолученияОстатка.Добавить("ГотовКОтгрузке");
	МассивСтатусовПолученияОстатка.Добавить("НаПодборе");
	МассивСтатусовПолученияОстатка.Добавить("Зарезервирован");
	МассивСтатусовПолученияОстатка.Добавить("Заказан");
	
	ЗаказаноПоставщику = ВыборкаРезультата.ЗаказаноПоставщикуОстаток;    
	ОтказаноПоставщиком = ВыборкаРезультата.КоличествоОтказПоставщика;   
	ОтказаноКлиентом = ВыборкаРезультата.КоличествоОтказКлиента;
	
	ВсегоЗаказано = ВыборкаРезультата.КоличествоЗаказано - (ОтказаноКлиентом + ОтказаноПоставщиком); 
	
	СтруктураСтатусов = Новый Структура();
	СтруктураСтатусов.Вставить("ОтказПокупателя",    ВыборкаРезультата.КоличествоОтказКлиента);
	СтруктураСтатусов.Вставить("ЗаказаноПоставщику", ВыборкаРезультата.ЗаказаноПоставщикуОстаток);
	СтруктураСтатусов.Вставить("ОтказПоставщика",    ВыборкаРезультата.КоличествоОтказПоставщика); 
	
	Набрано = 0;   
	
	Для каждого СтатусОстатка Из МассивСтатусовПолученияОстатка Цикл
		
		Если ВсегоЗаказано - Набрано > 0 Тогда
			
			Количество = 0;
			
			Если СтатусОстатка = "Выполнен" Тогда			
				Количество = ВыборкаРезультата.КоличествоВыполнено; 
			ИначеЕсли СтатусОстатка = "НаДоставке" Тогда			
				
				Количество = ВыборкаРезультата.КоличесвоНаДоставке - Набрано;
				
				//+Белов А. 26.02.2026 #
				//Такое срабатывает для самовывозов, там не может быть статуса на доставке
				Если Количество < 0 Тогда
					
					СтруктураСтатусов.Вставить(СтатусОстатка, 0);
					Продолжить;
					
				КонецЕсли;
				//-Белов А. 26.02.2026 #
				
			ИначеЕсли СтатусОстатка = "ГотовКОтгрузке" Тогда			
				
				//+Белов А. 26.02.2026 #Для самовывоза не делаются ГМ, поэтому статус готовности к отгрузки определяется по количеству собранного
				
				//+Сёмин Р.И. 13.03.2026 #UT10-5726
				//Если ВыборкаРезультата.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда
				Если ВыборкаРезультата.СпособДоставки = Перечисления.СпособДоставки.Самовывоз И ВыборкаРезультата.ДокументСобранИУпакован = Истина Тогда
				//-Сёмин Р.И. 13.03.2026 #UT10-5726
					Количество = ВыборкаРезультата.КоличествоСобрано;	
				//-Белов А. 26.02.2026 #
				Иначе
					Количество = ВыборкаРезультата.КоличествоКПогрузке;  
				КонецЕсли;
				
			ИначеЕсли СтатусОстатка = "НаПодборе" Тогда			
				Количество = ВыборкаРезультата.КоличествоСобрано - Набрано; 
			ИначеЕсли СтатусОстатка = "Зарезервирован" Тогда			
				Количество = (ВыборкаРезультата.КоличествоРезерв + ВыборкаРезультата.КоличествоВРелизацииНеПереданного) 
				           - СтруктураСтатусов.НаПодборе - СтруктураСтатусов.ГотовКОтгрузке - СтруктураСтатусов.НаДоставке;
			ИначеЕсли СтатусОстатка = "Заказан" Тогда			
				Количество = ВсегоЗаказано - Набрано - СтруктураСтатусов.ЗаказаноПоставщику;
			КонецЕсли;	
			
			Набрано = Набрано + Количество;
			СтруктураСтатусов.Вставить(СтатусОстатка, Количество);	
				
		КонецЕсли; 	
		
	КонецЦикла; 
	
	МассивСтруктурСтатусов = Новый Массив;  
	НаименованиеСтатусаДляПортала = "";
	
	Для каждого Статус Из СтруктураСтатусов Цикл
		
		Если Не Статус.Значение > 0 Тогда
			Продолжить;
		КонецЕсли;	 
		
		КодСтатуса = ПолучитьКодПоИмениСтатуса(Статус.Ключ);   
		
		Если ЗначениеЗаполнено(СокрЛП(СтатусЗаказа)) И СокрЛП(КодСтатуса) <> СокрЛП(СтатусЗаказа) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Статус.Ключ = "ЗаказаноПоставщику" Тогда
			НаименованиеСтатусаДляПортала = СформироватьСообщениеДляПортала(Статус.Ключ, Статус.Значение, ВыборкаРезультата.СтатусAvarda, 10, Ложь, ?(ВыборкаРезультата.СтатусПоДопПостащику = "", "ЦС в Москве", ВыборкаРезультата.СтатусПоДопПостащику));
		ИначеЕсли Статус.Ключ = "ОтказПоставщика" Тогда	
			НаименованиеСтатусаДляПортала = ?(ВыборкаРезультата.ТаксиДоставка, "Нет на складе", "Отказ поставщика");
		ИначеЕсли Статус.Ключ = "Выполнен" Тогда				
			
			Если ЗаказПокупателя.ТаксиДоставка И ?(ДетальнаяИнформация, КонецДня(ВыборкаРезультата.ДокументаОтгрузки.Дата) = КонецДня(ТекущаяДата()), КонецДня(ВыборкаРезультата.ДатаПоследнейОтгрузки) = КонецДня(ТекущаяДата())) Тогда
				//НаименованиеСтатусаДляПортала = "60;Такси доставка " + ?(Статус.Значение = 0 , "", "(" + СокрЛП(Статус.Значение) + " гр.мест)") + "";
				НаименованиеСтатусаДляПортала = "Такси доставка";
			Иначе
				НаименованиеСтатусаДляПортала = ПолучитьНаименованиеСтатусаДляПортала(Статус.Ключ, ВыборкаРезультата);	
			КонецЕсли;      	
			
		Иначе
			НаименованиеСтатусаДляПортала = ПолучитьНаименованиеСтатусаДляПортала(Статус.Ключ, ВыборкаРезультата);
		КонецЕсли; 		
		
		Если ДетальнаяИнформация Тогда
			
			СтрокаВозврата = ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, НаименованиеСтатусаДляПортала, Статус.Значение);
			
			Если НЕ СтрокаВозврата = "" Тогда 
				МассивРезультат.Добавить(СтрокаВозврата);	
			КонецЕсли;
				
		КонецЕсли; 
		
		МассивСтруктурСтатусов.Добавить(Новый Структура("Статус, Количество", НаименованиеСтатусаДляПортала, Статус.Значение));	
		
	КонецЦикла; 
	
	Возврат МассивСтруктурСтатусов; 
	
КонецФункции

Функция СформироватьСообщениеДляПортала(ИмяПоля, Количество, СтатусAvarda, КодСообщения, ДобавитьТочкуСЗапятой = Ложь, СтатусПоДопПостащику = "ЦС в Москве") Экспорт
	
	Результат = "";
	
	Если ИмяПоля = "ЗаказаноПоставщику" И Количество > 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(СтатусAvarda)  Тогда
			Результат = "Заказано поставщику"			
		Иначе

			Если СтатусAvarda = "10; составлен" Тогда                   
				Результат = "Размещен на складе";
			ИначеЕсли СтатусAvarda = "10; зарезервирован" Тогда                    
				Результат = "Зарезервирован на складе";
			ИначеЕсли СтатусAvarda = "30; на подборе" Тогда                     
				Результат = "Подбирается на складе";
			ИначеЕсли СтатусAvarda = "40; подобрано" Тогда                     
				Результат = "Подобрано на складе";
			ИначеЕсли СтатусAvarda = "40; готов к отгрузке" Тогда                    
				Результат = "Готов к отгрузке со склада";
			ИначеЕсли СтатусAvarda = "50; на доставке" Тогда
				Результат = "Отгружено со склада" ;
			ИначеЕсли СтатусAvarda = "300; принят в работу" Тогда
				Результат = "Размещен у поставщика";
			ИначеЕсли СтатусAvarda = "310; размещен у поставщика" Тогда
				Результат = "Размещен у поставщика";
			ИначеЕсли СтатусAvarda = "320; подтвежден поставщиком" Тогда
				Результат = "Подтвержден поставщиком";
			ИначеЕсли СтатусAvarda = "320; в пути на склад" Тогда
				Результат = "В пути на склад ЦС в Москве";
			ИначеЕсли СтатусAvarda = "330; поступило на склад" Тогда
				Результат = "Поступило на склад ЦС в Москве";
			ИначеЕсли Результат = "" Тогда
				Результат = "заказано поставщику";				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ДобавитьТочкуСЗапятой Тогда
		Результат = Результат + ";";
	КонецЕсли; 
	
	Возврат Результат ;
	
КонецФункции

Функция ДобавитьСтрокуКЗаказуНаПортал(ВыборкаРезультата, СтрокаСтатус, КоличествоВСтатусе)
	
	СтрокаПолей 	= ПолучитьПоляЗаполненияЗаказаИТовара();
	СтрокаВозврата 	= Новый Структура(СтрокаПолей);
	
	ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата); 
	
	ЭтоНеСозданныйЗазказ = ТипЗнч(ВыборкаРезультата.ЗаказПокупателя) = Тип("СправочникСсылка.НеСозданныеЗаказыПокупателей");
	
	Если Не ЭтоНеСозданныйЗазказ И Найти(СтрокаВозврата.КомментарийНоменклатуры, "Стор") = 0 Тогда
		
		Если НЕ ВыборкаРезультата.ЗаказПокупателя.IDСклада_СтороннийСклад.Пустая() Тогда
			
			Если (СтрДлина(СтрокаВозврата.КомментарийНоменклатуры) + СтрДлина(" Стор " + СокрЛП(ВыборкаРезультата.ЗаказПокупателя.IDСклада_СтороннийСклад.Идентификатор))) <= 80 Тогда
				//+Сёмин Р.И. 10.03.2026 #UT10-5721
				//СтрокаВозврата.КомментарийНоменклатуры = СтрокаВозврата.КомментарийНоменклатуры + " Стор " + СокрЛП(ВыборкаРезультата.ЗаказПокупателя.IDСклада_СтороннийСклад.Идентификатор);
				//-Сёмин Р.И. 10.03.2026 #UT10-5721
			КонецЕсли;
		
		КонецЕсли; 
		
	КонецЕсли;     
	
	СтрокаВозврата.ИдентификаторДокумента = СокрЛП(ВыборкаРезультата.ЗаказПокупателя.УникальныйИдентификатор());
	СтрокаВозврата.НомерЗаказаУчетнойСистемы = СокрЛП(ВыборкаРезультата.НомерЗаказа);
	СтрокаВозврата.Статус = СокрЛП(СтрокаСтатус);
	СтрокаВозврата.Количество = КоличествоВСтатусе;  
	СтрокаВозврата.СтавкаНДС = СтрЗаменить(Строка(СтрокаВозврата.СтавкаНДС), "%", "");
	
	Попытка                                      
		СтрокаВозврата.СуммаСНДС = КоличествоВСтатусе * ВыборкаРезультата.ЦенаСНДС;
	Исключение
		СтрокаВозврата.СуммаСНДС = 0;
	КонецПопытки;
	
	//Формируем массив СФ
	МассивСФ = Новый Массив; 
	МассивДобавленныхНомеровСФ = Новый Массив;
	
	Если ЗначениеЗаполнено(ВыборкаРезультата.СчетФактураВыданный) Тогда
		
		ВыборкаРезультатаПоСФ = ВыборкаРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);				
		
		Пока ВыборкаРезультатаПоСФ.Следующий() Цикл  
			
			Если Не ЗначениеЗаполнено(ВыборкаРезультатаПоСФ.НомерСчетФактуры) Тогда
				Продолжить;
			КонецЕсли;
			
			//+Белов А. 25.11.2025 #UT10-5530
			//Если Не ЗначениеЗаполнено(ВыборкаРезультатаПоСФ.ДатаОтгрузки) Тогда
			//	Продолжить;
			//КонецЕсли; 
			//-Белов А. 25.11.2025 #UT10-5530
			
			Если МассивДобавленныхНомеровСФ.Найти(ВыборкаРезультатаПоСФ.НомерСчетФактуры) <> Неопределено Тогда
				Продолжить;	
			КонецЕсли;
			
			МассивДобавленныхНомеровСФ.Добавить(ВыборкаРезультатаПоСФ.НомерСчетФактуры);
			
			//+Сёмин Р.И. 10.03.2026 #UT10-5721
			//МассивСФ.Добавить(Новый Структура("Номер, Дата, ДатаПередачиКлиенту", ОбщегоНазначения.ПолучитьНомерНаПечать(ВыборкаРезультатаПоСФ.СчетФактураВыданный), ВыборкаРезультатаПоСФ.ДатаСчетФактуры, ВыборкаРезультатаПоСФ.ДатаОтгрузки));
			
			МассивСФ.Добавить(
				Новый Структура("Номер, Дата, ДатаПередачиКлиенту, ИДРеализации , ИДСчетФактуры",
				ОбщегоНазначения.ПолучитьНомерНаПечать(ВыборкаРезультатаПоСФ.СчетФактураВыданный),
				ВыборкаРезультатаПоСФ.ДатаСчетФактуры,
				ВыборкаРезультатаПоСФ.ДатаОтгрузки,
				Строка(ВыборкаРезультатаПоСФ.СчетФактураВыданный.ДокументОснование.УникальныйИдентификатор()),
				Строка(ВыборкаРезультатаПоСФ.СчетФактураВыданный.УникальныйИдентификатор()))
			);
			//-Сёмин Р.И. 10.03.2026 #UT10-5721
			
		КонецЦикла;  
		
	КонецЕсли;
	
	СтрокаВозврата.Вставить("Отгрузки", МассивСФ);

	Возврат СтрокаВозврата; 
	
КонецФункции

Функция ПолучитьПоляЗаполненияЗаказаИТовара()
	
	СтруктураПараметоровМетода = СоответствиеПолейСервис_PM_6951_FOR_PORTAL_EX();  
	
	СтрокеПолей = "";
	
	Для Каждого ЭлементПоля Из СтруктураПараметоровМетода.МассивВыходныхПараметров Цикл 
		
		Если СтрокеПолей <> "" Тогда
			СтрокеПолей = СтрокеПолей + ",";
		КонецЕсли;
		
		СтрокеПолей = СтрокеПолей + ЭлементПоля;
		
	КонецЦикла;	

	Возврат СтрокеПолей;
	
КонецФункции	

Функция ПолучитьСписокДействийСЗаказом(Заказ, МожноКорректировать = Ложь)
		
	ДействияВДесятичномВиде = ?(Заказ.ТолькоРезерв, "1", "0") + "0"+ ?(МожноКорректировать, "1", "0") + "0";
	
	Возврат ДвоичноеВДесятичное(ДействияВДесятичномВиде);
	
КонецФункции  

Функция ПолучитьАдресДоставки(Грузополучатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|						И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|						И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|						И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|						И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|					ТОГДА АдресДоставки.Представление
	|				ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|						КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							ТОГДА """"
	|						ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|					КОНЕЦ + "" "" + ВЫБОР
	|						КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|							ТОГДА """"
	|						ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|					КОНЕЦ + """"
	|			КОНЕЦ
	|	КОНЕЦ КАК АдресДоставки
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	|ГДЕ
	|	АдресДоставки.Объект = &Грузополучатель
	|	И АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|	И АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента)";
	
	Запрос.УстановитьПараметр("Грузополучатель", Грузополучатель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.АдресДоставки;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьЗаказыПоНомеру(НомерЗаказа)
	
	//+Сёмин Р.И. 23.03.2026 #P3-4087
	МассивНомеров = Новый Массив;
	
	Если ТипЗнч(НомерЗаказа) = Тип("Массив") Тогда
		МассивНомеров = НомерЗаказа;
	Иначе
		МассивНомеров.Добавить(НомерЗаказа);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказПокупателя.Дата) КАК Дата,
		|	ЗаказПокупателя.Номер
		|ПОМЕСТИТЬ ВТ_ДатыНомераЗаказов
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Номер В(&МассивНомеров)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка
		|ПОМЕСТИТЬ ВТ_Документы
		|ИЗ
		|	ВТ_ДатыНомераЗаказов КАК ВТ_ДатыНомераЗаказов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ВТ_ДатыНомераЗаказов.Дата = ЗаказПокупателя.Дата
		|			И ВТ_ДатыНомераЗаказов.Номер = ЗаказПокупателя.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Документы.Ссылка
		|ИЗ
		|	ВТ_Документы КАК ВТ_Документы";   
	
	Запрос.УстановитьПараметр("МассивНомеров", МассивНомеров);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	//-Сёмин Р.И. 23.03.2026 #P3-4087
	
КонецФункции


///////////////////returns///////////////////
Функция ПолучитьДанныеПоВозвратамСервер(ПараметрыСоответсвие) Экспорт  

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах(); 
	ПараметрыСтруктура = ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);  
	
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.returns.ПолучитьДанныеПоВозвратам", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Запуск. ПолучитьДанныеПоЗаказам. " + ПараметрыЗапросаСтр);
		
	СтруктураВозврата = ПолучитьДанныеПоВозвратам(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("HTTP-сервис OnlineStore.returns.ПолучитьДанныеПоВозвратам", УровеньЖурналаРегистрации.Информация,,, 
	"HTTP-сервис:Завершение. ПолучитьДанныеПоВозвратам. "  
	+ Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + ПараметрыЗапросаСтр);
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПолучитьДанныеПоВозвратам(ПараметрыЗапроса) 
	
	СтруктураВозврата 	= Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
	СтрокаПараметров	= "НомерЗаявки, ДатаЗаявки, ИдентификаторДокумента, Статус,НаименованиеФилиала,Комментарий,НаименованиеВалюта," + 
						  "НаименованиеДоговора,НаименованиеСклада,НаименованиеОрганизации,ИНН,КПП,СуммаДокумента,СчетФактура,СчетФактураДата,ДокументРеализации";
	
	
	//Дополнительные параметры по получению данных по заказку и номенклатуры
	//используется для дополнительного запроса по http сервису, детального запроса по номенклатуре 

	ИдентификаторДокумента 	= "";
	ДокументЗаявки 			= Документы.ЗаказПокупателя.ПустаяСсылка();
	ДанныеПоЗаявке 			= Ложь;
	ДетальнаяИнформация 	= Ложь;
	ДатаНачала 				= Дата(1, 1, 1);
	ДатаОкончания			= Дата(1, 1, 1); 
	//+Гавриленков В. 06.03.2026 #UT10-5741
	//ИдентификаторКонтрагента= "";
	ТаблицаИдентификаторовКонтрагента = Новый ТаблицаЗначений;
	ТаблицаИдентификаторовКонтрагента.Колонки.Добавить("ИдентификаторКонтрагента");
	ТаблицаИдентификаторовКонтрагента.Колонки.Добавить("ПоКодуМДМ");
	//+Гавриленков В. 06.03.2026 #UT10-5741
	Филиалы 				= "";
	СписокФилиалов 			= Новый Массив; 
	МассивРезультат 		= Новый Массив; 
	АртикулТовара 			= "";
	НомерДокумента 			= "";
	СтатусЗаявки 			= "";
	ИскатьПоКодуМДМ 		= Ложь;
	
	Если ПараметрыЗапроса.Свойство("ИдентификаторДокумента") И ПараметрыЗапроса.ИдентификаторДокумента <> "" Тогда  
		
		ДанныеПоЗаявке 			= Истина;
		ИдентификаторДокумента 	= ПараметрыЗапроса.ИдентификаторДокумента;   
		
		ДокументЗаявки = ПолучитьДокументПоИдентификатору("ЗаявкаНаВозврат", ИдентификаторДокумента);
		
		Если ДокументЗаявки.Пустая() Тогда
			
			СтруктураВозврата.Сообщение = "Данные возвратов не получены. Причина: не найдена Заявка на возврат с ИдентификаторДокумента " + ИдентификаторДокумента;
			Возврат СтруктураВозврата;
			
		КонецЕсли;  
		
		ДатаНачала	  = ДокументЗаявки.Дата;
		ДатаОкончания = ДокументЗаявки.Дата;
		
	Иначе // общие параметры для др. частей запросов   
		
		Если Не ПараметрыЗапроса.Свойство("ДатаНачала") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаНачала) Тогда
			
			СтруктураВозврата.Сообщение = "Данные возвратов не получены. Причина: не задан параметр ДатаНачала";
			Возврат СтруктураВозврата;
	
		КонецЕсли;   
		
		Если Не ПараметрыЗапроса.Свойство("ДатаОкончания") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ДатаОкончания) Тогда
			
			СтруктураВозврата.Сообщение = "Данные возвратов не получены. Причина: не задан параметр ДатаОкончания";
			Возврат СтруктураВозврата;
	
		КонецЕсли;  
		
		Если Не ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") Или Не ЗначениеЗаполнено(ПараметрыЗапроса.ИдентификаторКонтрагента) Тогда
			
			СтруктураВозврата.Сообщение = "Данные возвратов не получены. Причина: не задан параметр ИдентификаторКонтрагента";
			Возврат СтруктураВозврата;
	
		КонецЕсли; 
		
		ДатаНачала	  			 = СтрокаВДату(ПараметрыЗапроса.ДатаНачала);
		ДатаОкончания	  		 = СтрокаВДату(ПараметрыЗапроса.ДатаОкончания);  
		//+Гавриленков В. 06.03.2026 #UT10-5741
		//ИдентификаторКонтрагента = ПараметрыЗапроса.ИдентификаторКонтрагента;
		СтрокаКонтрагентовВТаблицу(ПараметрыЗапроса.ИдентификаторКонтрагента, ТаблицаИдентификаторовКонтрагента);
		//-Гавриленков В. 06.03.2026 #UT10-5741
		
		Если ПараметрыЗапроса.Свойство("СписокФилиалов") Тогда
			Филиалы = СокрЛП(ПараметрыЗапроса.СписокФилиалов);	
		КонецЕсли;  
		
	КонецЕсли;	
	
	ДетальнаяИнформация = Неопределено;
	ПараметрыЗапроса.Свойство("ДетальнаяИнформация", ДетальнаяИнформация);  
	ДетальнаяИнформация = СтрокаВБулево(ДетальнаяИнформация);
	
	Если ДокументЗаявки.Пустая() И ПараметрыЗапроса.Свойство("НомерДокумента") Тогда
		
		НомерДокумента = СокрЛП(ПараметрыЗапроса.НомерДокумента);   
		
		Если ЗначениеЗаполнено(НомерДокумента) Тогда
			
			ЗапросДокумента = Новый Запрос;
			ЗапросДокумента.Текст =  
			"ВЫБРАТЬ
			|	ЗаявкаНаВозврат.Ссылка,
			|	ЗаявкаНаВозврат.Дата
			|ИЗ
			|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
			|ГДЕ
			|	ЗаявкаНаВозврат.Номер = &Номер
			|	И НЕ ЗаявкаНаВозврат.ПометкаУдаления
			|	И ЗаявкаНаВозврат.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
			
			ЗапросДокумента.УстановитьПараметр("ДатаНачала", ДатаНачала);
			ЗапросДокумента.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), КонецДня(ТекущаяДата())));
			ЗапросДокумента.УстановитьПараметр("Номер", НомерДокумента);
			
			ВыборкаДокумента = ЗапросДокумента.Выполнить().Выбрать();
			
			Если ВыборкаДокумента.Следующий() Тогда       
				
				ДокументЗаявки = ВыборкаДокумента.Ссылка;      			
				ДанныеПоЗаявке = Истина;         
				
				ДатаНачала = ДокументЗаявки.Дата;
				ДатаОкончания = ДокументЗаявки.Дата;
				
			КонецЕсли;		
			
		КонецЕсли;  
		
	КонецЕсли;  

	
	Если ДетальнаяИнформация Тогда
		
		Если ПараметрыЗапроса.Свойство("Артикул") И ПараметрыЗапроса.Артикул <> "" Тогда  

			Артикул = СокрЛП(ПараметрыЗапроса.Артикул);	
			АртикулТовара = Артикул;
			
			//Длина = СтрДлина(Артикул);  
			//
			//Для а = 1 По Длина Цикл   
			//	
			//	Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(Артикул, а, 1)) <> 0 Тогда
			//		АртикулТовара = АртикулТовара + Сред(Артикул, а, 1);
			//	КонецЕсли;
			//	
			//КонецЦикла;   
			
		КонецЕсли;
						
	КонецЕсли;	
	
	//+Гавриленков В. 06.03.2026 #UT10-5741
	МассивКонтрагентов = Новый Массив;
	//-Гавриленков В. 06.03.2026 #UT10-5741
	
	Если ДанныеПоЗаявке И Не ДокументЗаявки.Пустая() Тогда 
		
		//+Гавриленков В. 06.03.2026 #UT10-5741
		//Контрагент = ДокументЗаявки.Реализация.Грузополучатель;
		МассивКонтрагентов.Добавить(ДокументЗаявки.Реализация.Грузополучатель);
		
		//Если ЗначениеЗаполнено(Контрагент.КодМДМ) Тогда
		Если ЗначениеЗаполнено(ДокументЗаявки.Реализация.Грузополучатель.КодМДМ) Тогда
			
			//ИдентификаторКонтрагента = Контрагент.КодМДМ;
			НоваяСтрока = ТаблицаИдентификаторовКонтрагента.Добавить();
			НоваяСтрока.ИдентификаторКонтрагента = ДокументЗаявки.Реализация.Грузополучатель.КодМДМ;
			НоваяСтрока.ПоКодуМДМ = Истина;
			
			//ИскатьПоКодуМДМ = Истина;       
			//РеквизитПоиска = "КодМДМ"; 
			//-Гавриленков В. 06.03.2026 #UT10-5741
			
		Иначе
			
			//+Гавриленков В. 06.03.2026 #UT10-5741
			//ИдентификаторКонтрагента 	= СтрЗаменить(СокрЛП(Контрагент.IDАварда), Символы.НПП, "");
			НоваяСтрока = ТаблицаИдентификаторовКонтрагента.Добавить();
			НоваяСтрока.ИдентификаторКонтрагента = СтрЗаменить(СокрЛП(ДокументЗаявки.Реализация.Грузополучатель.IDАварда), Символы.НПП, "");
			
			//РеквизитПоиска = "IDАварда";
			//-Гавриленков В. 06.03.2026 #UT10-5741
	
		КонецЕсли;
				
	Иначе 	
				
		Если ЗначениеЗаполнено(Филиалы) И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда  
			Филиалы = СтрЗаменить(Филиалы, " ", "");
			
			СписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Филиалы), ","); 
		КонецЕсли;
		
		//+Гавриленков В. 06.03.2026 #UT10-5741
		//ИдентификаторКонтрагента = СтрЗаменить(СокрЛП(ИдентификаторКонтрагента), Символы.НПП, "");
		//
		//ИскатьПоКодуМДМ 		= СтрДлина(ИдентификаторКонтрагента) = 36;
		//
		//Если ИскатьПоКодуМДМ Тогда  
		//	РеквизитПоиска = "КодМДМ";	
		//Иначе
		//	РеквизитПоиска = "IDАварда";	
		//КонецЕсли;
		
		//Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту(РеквизитПоиска, ИдентификаторКонтрагента);
		Для Каждого СтрокаТаблицы Из ТаблицаИдентификаторовКонтрагента Цикл
			
			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту(?(СтрокаТаблицы.ПоКодуМДМ, "КодМДМ", "IDАварда"), СтрокаТаблицы.ИдентификаторКонтрагента); 
			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Продолжить;
			КонецЕсли;
			
			МассивКонтрагентов.Добавить(Контрагент);
			
		КонецЦикла;
		//-Гавриленков В. 06.03.2026 #UT10-5741
		
	КонецЕсли;
	
	//+Гавриленков В. 06.03.2026 #UT10-5741
	//Если НЕ Контрагент.Пустая() Или НЕ СписокФилиалов.Количество() = 0 Тогда
	Если МассивКонтрагентов.Количество() > 0 Или НЕ СписокФилиалов.Количество() = 0 Тогда
	//-Гавриленков В. 06.03.2026 #UT10-5741
		                                                                                  
		Запрос = Новый Запрос;    
		Запрос.УстановитьПараметр("ДатаНач",			?(ЗначениеЗаполнено(ДатаНачала), НачалоДня(ДатаНачала), НачалоДня(ТекущаяДата() - 86400 * 14)));
		Запрос.УстановитьПараметр("ДатаКон",			?(ЗначениеЗаполнено(ДатаОкончания), КонецДня(ДатаОкончания), КонецДня(ТекущаяДата())));
		Запрос.УстановитьПараметр("Артикул", 			?(СокрЛП(АртикулТовара) <> "", "%" + АртикулТовара + "%", ""));  
		Запрос.УстановитьПараметр("БезОтбораПоАртикулу", НЕ ЗначениеЗаполнено(СокрЛП(АртикулТовара))); 
		Запрос.УстановитьПараметр("ДокументЗаявки", 	ДокументЗаявки);
		//+Гавриленков В. 06.03.2026 #UT10-5741
		//Запрос.УстановитьПараметр("IDАварда",			ИдентификаторКонтрагента); 
		Запрос.УстановитьПараметр("МассивКонтрагентов",			МассивКонтрагентов);
		//-Гавриленков В. 06.03.2026 #UT10-5741
		Запрос.УстановитьПараметр("СписокИД",			СписокФилиалов);  
		Запрос.УстановитьПараметр("НомерДокумента", 	НомерДокумента);  
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос.Текст = ПолучитьТекстЗапросаЗаявкиНаВозврат(ИскатьПоКодуМДМ, СписокФилиалов, ДетальнаяИнформация, ДанныеПоЗаявке);
		РезультатЗапроса = Запрос.Выполнить();    
		
		УстановитьПривилегированныйРежим(Ложь);
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			ОбработатьЗапросПоЗаявкам(РезультатЗапроса, ДетальнаяИнформация, СтрокаПараметров, МассивРезультат);  
		КонецЕсли;		

	Иначе
		СтруктураВозврата.Сообщение = "Данные возвратов не получены. Причина: не найден контрагент, не заданы филиалы.";
	КонецЕсли;    
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Данные 	= МассивРезультат;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Процедура СтрокаКонтрагентовВТаблицу(Знач ИдентификаторКонтрагента, ТаблицаИдентификаторовКонтрагента)
//+Гавриленков В. 06.03.2026 #UT10-5741
	
	МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Сред(ИдентификаторКонтрагента, 2, СтрДлина(ИдентификаторКонтрагента) - 2), ",");
	
	Для Каждого Эл Из МассивСтрок Цикл
		
		НоваяСтрока = ТаблицаИдентификаторовКонтрагента.Добавить();
		НоваяСтрока.ИдентификаторКонтрагента = СтрЗаменить(СокрЛП(Эл), Символы.НПП, "");
		НоваяСтрока.ПоКодуМДМ = (СтрДлина(НоваяСтрока.ИдентификаторКонтрагента) = 36); 
		
	КонецЦикла;
	
//-Гавриленков В. 06.03.2026 #UT10-5741
КонецПроцедуры

Функция ПолучитьТекстЗапросаЗаявкиНаВозврат(ИскатьПоКодуМДМ, пСписокФилиалов, ДетальнаяИнформация, ДанныеПоЗаявке) 
		
	Если ДанныеПоЗаявке Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗаявкаНаВозврат.Ссылка КАК Заявка,
		|	МАКСИМУМ(ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))) КАК СчетФактура
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ЗаявкаНаВозврат.Реализация = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	ЗаявкаНаВозврат.Ссылка = &ДокументЗаявки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозврат.Ссылка
		|;";
		
	Иначе
		
		Если пСписокФилиалов.Количество() <> 0 Тогда  
			
			//+Гавриленков В. 06.03.2026 #UT10-5741
			//ТекстЗапроса = 			
			//"ВЫБРАТЬ
			//|	Контрагенты.Ссылка
			//|ПОМЕСТИТЬ ВТ_ИДАварда
			//|ИЗ
			//|	Справочник.Контрагенты КАК Контрагенты
			//|ГДЕ
			//|	Контрагенты.IDАварда = &IDАварда 
			//|;
			//|
			//|////////////////////////////////////////////////////////////////////////////////
			//|ВЫБРАТЬ
			//|	Контрагенты.Ссылка
			//|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
			//|ИЗ
			//|	Справочник.Контрагенты КАК Контрагенты
			//|ГДЕ                                     
			//|	(Контрагенты.IDФилиала В(&СписокИД) ИЛИ Контрагенты.КодМДМ В(&СписокИД))
			//|	И Контрагенты.ГоловнойКонтрагент В
			//|			(ВЫБРАТЬ
			//|				ИДАварда.Ссылка
			//|			ИЗ
			//|				ВТ_ИДАварда КАК ИДАварда)
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Ссылка
			//|;";
			
			ТекстЗапроса = 			
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ВТ_ИДАварда
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты В (&МассивКонтрагентов) 
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ                                     
			|	(Контрагенты.IDФилиала В(&СписокИД) ИЛИ Контрагенты.КодМДМ В(&СписокИД))
			|	И Контрагенты.ГоловнойКонтрагент В
			|			(ВЫБРАТЬ
			|				ИДАварда.Ссылка
			|			ИЗ
			|				ВТ_ИДАварда КАК ИДАварда)
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;";
			
			//-Гавриленков В. 06.03.2026 #UT10-5741
			
		Иначе       
			
			//+Гавриленков В. 06.03.2026 #UT10-5741
			//ТекстЗапроса = 
			//"ВЫБРАТЬ
			//|	Контрагенты.Ссылка
			//|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
			//|ИЗ
			//|	Справочник.Контрагенты КАК Контрагенты
			//|ГДЕ
			//|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
			//|ИНДЕКСИРОВАТЬ ПО
			//|	Ссылка
			//|;";  
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ГоловнойКонтрагент В (&МассивКонтрагентов)
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|;";
			
			//-Гавриленков В. 06.03.2026 #UT10-5741
			
		КонецЕсли;
		
		//+Гавриленков В. 06.03.2026 #UT10-5741
		//Если ИскатьПоКодуМДМ Тогда
		//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
		//КонецЕсли;
		//-Гавриленков В. 06.03.2026 #UT10-5741
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ
		|	ЗаявкаНаВозврат.Ссылка КАК Заявка,
		|	МАКСИМУМ(ЕСТЬNULL(СчетФактураВыданный.Ссылка, ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка))) КАК СчетФактура
		|ПОМЕСТИТЬ ВТ_Заявки
		|ИЗ
		|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ПО ЗаявкаНаВозврат.Реализация.Грузополучатель = ТаблицаКлиентов.Ссылка
		|			И (ЗаявкаНаВозврат.Дата МЕЖДУ &ДатаНач И &ДатаКон) И (НЕ ЗаявкаНаВозврат.ПометкаУдаления)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ЗаявкаНаВозврат.Реализация = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	НЕ ЗаявкаНаВозврат.Ссылка ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозврат.Ссылка
		|;";
		
		
	КонецЕсли;   
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заявки.Заявка,
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	ЗаявкаНаВозвратТовары.Цена,   
		|	ЗаявкаНаВозвратТовары.Комментарий, 
		|	ЗаявкаНаВозвратТовары.Сумма,
		|	ЗаявкаНаВозвратТовары.Количество,
		|	ЗаявкаНаВозвратТовары.НомерСтроки,  
		|	ЗаявкаНаВозвратТовары.Статус, 
		|	ЗаявкаНаВозвратТовары.Тип,
		|	ВТ_Заявки.СчетФактура
		|ПОМЕСТИТЬ ВТ_ТаблЗаявки
		|ИЗ
		|	ВТ_Заявки КАК ВТ_Заявки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
		|		ПО ВТ_Заявки.Заявка = ЗаявкаНаВозвратТовары.Ссылка
		|			И (&Артикул = """"
		|				ИЛИ ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя ПОДОБНО &Артикул)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ     
		|	ВТ_ТаблЗаявки.Заявка КАК Заявка,
		|	ВТ_ТаблЗаявки.Заявка.Номер КАК НомерЗаявки,
		|	ВТ_ТаблЗаявки.Заявка.Дата КАК ДатаЗаявки,    
		|	ВТ_ТаблЗаявки.Заявка.Статус КАК СтатусДокумента,  
		|	ВТ_ТаблЗаявки.Статус КАК Статус, 
		|	ВЫБОР
		|		КОГДА ВТ_ТаблЗаявки.Тип = ""Возврат""
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ПризнакРекламации,
		|	ВТ_ТаблЗаявки.СчетФактура,
		|	ВТ_ТаблЗаявки.Заявка.Реализация.Грузополучатель.Наименование КАК НаименованиеФилиала,
		|	ВТ_ТаблЗаявки.Заявка.Комментарий КАК Комментарий,   
		|	ВТ_ТаблЗаявки.Заявка.Реализация КАК Реализация,
		|	ВТ_ТаблЗаявки.Заявка.Реализация.ВалютаДокумента.Наименование КАК ВалютаНаименование,
		|	ВТ_ТаблЗаявки.Заявка.Реализация.ДоговорКонтрагента.Наименование КАК НаименованиеДоговора,
		|	ВТ_ТаблЗаявки.Заявка.Реализация.Склад.Наименование КАК НаименованиеСклада,
		|	ВЫРАЗИТЬ(ВТ_ТаблЗаявки.Заявка.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК НаименованиеОрганизации,
		|	ВТ_ТаблЗаявки.Номенклатура.Код КАК НомерНоменклатуры,
		|	ВТ_ТаблЗаявки.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентНомеклатуры,
		|	ВТ_ТаблЗаявки.Количество КАК Количество,
		|	ВТ_ТаблЗаявки.Цена КАК Цена,
		|	ВТ_ТаблЗаявки.Комментарий КАК КомментарийНоменклатуры,
		|	ВТ_ТаблЗаявки.Сумма КАК Сумма,   
		|	ВТ_ТаблЗаявки.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ВТ_ТаблЗаявки.Номенклатура.Наименование КАК НаименованиеНоменклатура,
		|	ВТ_ТаблЗаявки.Номенклатура.Родитель.Наименование КАК Бренд,
		|	ВТ_ТаблЗаявки.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК НаименованиеЕдиницаХранения,
		|	ВТ_ТаблЗаявки.Номенклатура КАК Номенклатура,
		|	ВТ_ТаблЗаявки.НомерСтроки КАК НомерСтроки, 
		|	ВЫБОР
		|		КОГДА ВТ_ТаблЗаявки.Тип = ""Возврат""
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Рекламация,
		|	ВЫРАЗИТЬ(ВТ_ТаблЗаявки.Заявка.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК ОрганизацияНаименование,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблЗаявки.Заявка.Реализация.Организация.ИНН = """"
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ТаблЗаявки.Заявка.Реализация.Организация.ИНН КАК СТРОКА(10))
		|	КОНЕЦ КАК ИНН,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблЗаявки.Заявка.Реализация.Организация.КПП = """"
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_ТаблЗаявки.Заявка.Реализация.Организация.КПП КАК СТРОКА(9))
		|	КОНЕЦ КАК КПП,
		|	ВТ_ТаблЗаявки.СчетФактура
		|ИЗ
		|	ВТ_ТаблЗаявки КАК ВТ_ТаблЗаявки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаЗаявки УБЫВ,
		|	НомерЗаявки УБЫВ,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	МАКСИМУМ(Цена),   
		|	МАКСИМУМ(ИНН),    
		|	МАКСИМУМ(КПП),    
		|	МАКСИМУМ(ПризнакРекламации),  
		|	МАКСИМУМ(КомментарийНоменклатуры),  
		|	МАКСИМУМ(СтатусДокумента),       
		|	МАКСИМУМ(Реализация), 
		|	МАКСИМУМ(СчетФактура),
		|	СУММА(Сумма)
		|ПО
		|	Заявка,      
		|	Статус,
		|	Номенклатура";
		
	
	Если пСписокФилиалов.Количество() = 0 Тогда 
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "
		|УНИЧТОЖИТЬ ВТ_ИДАварда
		|;", "");
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Процедура ОбработатьЗапросПоЗаявкам(РезультатЗапросаЗаказовПоСтатусам, ДетальнаяИнформация, СтрокаПараметров, МассивРезультат)
		
	ВыборкаРезультатаЗаказ = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	
	Пока ВыборкаРезультатаЗаказ.Следующий() Цикл 
		
		СтрокаВозврата = Новый Структура(СтрокаПараметров);
		
		СтрокаВозврата.НомерЗаявки = СокрЛП(ВыборкаРезультатаЗаказ.НомерЗаявки);	
		СтрокаВозврата.ИдентификаторДокумента   = СокрЛП(ВыборкаРезультатаЗаказ.Заявка.УникальныйИдентификатор()); 
		СтрокаВозврата.НаименованиеФилиала 		= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеФилиала);
		СтрокаВозврата.Комментарий 				= СокрЛП(ВыборкаРезультатаЗаказ.Комментарий);
		СтрокаВозврата.НаименованиеВалюта 		= "RUB";
		СтрокаВозврата.НаименованиеДоговора 	= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеДоговора);
		СтрокаВозврата.НаименованиеСклада 		= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеСклада);
		СтрокаВозврата.НаименованиеОрганизации 	= СокрЛП(ВыборкаРезультатаЗаказ.НаименованиеОрганизации);
		СтрокаВозврата.СуммаДокумента 			= ВыборкаРезультатаЗаказ.Сумма;
		СтрокаВозврата.ДатаЗаявки 				= Формат(НачалоДня(ВыборкаРезультатаЗаказ.ДатаЗаявки), "ДФ='dd.MM.yyyy HH:mm'");     
		СтрокаВозврата.Статус                   = ВыборкаРезультатаЗаказ.СтатусДокумента;
		СтрокаВозврата.ИНН                      = ВыборкаРезультатаЗаказ.ИНН;
		СтрокаВозврата.КПП                      = ВыборкаРезультатаЗаказ.КПП;
		
		Если ЗначениеЗаполнено(ВыборкаРезультатаЗаказ.СчетФактура) тогда  
			
			СчетФактура = ВыборкаРезультатаЗаказ.СчетФактура;
			СтрокаВозврата.СчетФактура        = ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура)+ " от " + Формат(СчетФактура.Дата, "ДЛФ=Д");
			СтрокаВозврата.СчетФактураДата    = Формат(СчетФактура.Дата,"ДФ='yyyy-MM-ddTHH:mm:ss'");
			СтрокаВозврата.ДокументРеализации = СтрокаВозврата.СчетФактура;   
			
		Иначе  
			
			СтрокаВозврата.СчетФактура        = СтрокаВозврата.Реализация.Номер + " от " + Формат(СтрокаВозврата.Реализация.Дата, "ДЛФ=Д"); 
			СтрокаВозврата.СчетФактураДата    = "0001-01-01T00:00:00";
			СтрокаВозврата.ДокументРеализации = СтрокаВозврата.СчетФактура;   
			
		КонецЕсли;
		
		ИтоговыйСтатус = "";
		МассивТоваров = Новый Массив;
		
		ВыборкаСтатус = ВыборкаРезультатаЗаказ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСтатус.Следующий() Цикл 
			
			ИтоговыйСтатус = ИтоговыйСтатус + ВыборкаСтатус.Статус + ";" + СокрЛП(ВыборкаСтатус.Количество) + ",";	
			
			Если ДетальнаяИнформация Тогда
				
				ВыборкаРезультатаНоменклатура = ВыборкаСтатус.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаРезультатаНоменклатура.Следующий() Цикл  
					
					СтрокаНоменклатура 	= Новый Структура("Бренд, НаименованиеНоменклатура, КодПроизводителя, НомерНоменклатуры, НаименованиеЕдиницаХранения,
					|Количество, КоэффициентНомеклатуры, Цена, Сумма, Статус, ПризнакРекламации, КомментарийНоменклатуры");
					
					ЗаполнитьЗначенияСвойств(СтрокаНоменклатура, ВыборкаРезультатаНоменклатура);
					МассивТоваров.Добавить(СтрокаНоменклатура);	 
					
				КонецЦикла;	
			КонецЕсли;
			
		КонецЦикла;
			
		Если ДетальнаяИнформация Тогда   
			
			СтрокаВозврата.Вставить("Товары", МассивТоваров);   
			МассивРезультат.Добавить(СтрокаВозврата);
			
		Иначе      
			
			СтрокаВозврата.Статус = ИтоговыйСтатус;    
			МассивРезультат.Добавить(СтрокаВозврата);
			
		КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры


///////////////////nom_for_return///////////////////
Функция ПолучитьДоступныеНоменклатурыДляВозвратаСервер(ПараметрыСоответсвие) Экспорт
	
	//+Сёмин Р.И. 26.03.2026 #UT10-5775
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ПараметрыСтруктура = ПолучитьСтруктуруИзСоответствия(ПараметрыСоответсвие);
	
	ПараметрыЗапросаСтр = ПолучитьОписаниеПараметровЗапроса(ПараметрыСтруктура);
	
	ЗаписьЖурналаРегистрации(
		"HTTP-сервис OnlineStore.nom_for_return.ПолучитьНоменклатурыДляВозврата",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"HTTP-сервис:Запуск. ПолучитьНоменклатурыДляВозврата. " + ПараметрыЗапросаСтр
	);
		
	СтруктураВозврата = ПолучитьДоступныеНоменклатурыДляВозврата(ПараметрыСтруктура);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ЗаписьЖурналаРегистрации(
		"HTTP-сервис OnlineStore.nom_for_return.ПолучитьНоменклатурыДляВозврата",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"HTTP-сервис:Завершение. ПолучитьНоменклатурыДляВозврата. "  + Формат(ВремяОкончанияUTC - ВремяНачалаUTC, "ЧН=0; ЧГ=0") + " м.сек." + ПараметрыЗапросаСтр
	);
	
	Возврат СтруктураВозврата;
	//-Сёмин Р.И. 26.03.2026 #UT10-5775
	
КонецФункции

Функция ПолучитьДоступныеНоменклатурыДляВозврата(ПараметрыЗапроса)
	
	//+Сёмин Р.И. 26.03.2026 #UT10-5775
	СтруктураВозврата = Новый Структура(
		"Результат,Данные,Сообщение",
		Ложь,
		Неопределено,
		""
	);
	
	СтрокаПараметров = "ГУИДРТУ,НомерДокумента,ДатаДокумента,НаименованиеФилиала,Комментарий,НаименованиеДоговора,НаименованиеСклада,ЮрЛицо,НаименованиеОрганизации,ИнвНомер,НаименованиеВалюта," +
						"КоэффициентНомеклатуры,Количество,ЦенаСНДС,КомментарийНоменклатуры,СуммаСНДС,КодПроизводителя,НаименованиеНоменклатура,Бренд,НаименованиеЕдиницаХранения,КоличествоДляВозврата,НомерСтроки,ДействияСЗаказом";
	
	МассивДанных = Новый Массив;
	
	Если НЕ ПараметрыЗапроса.Свойство("ДатаНачала") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗапроса.ДатаНачала) Тогда
		
		СтруктураВозврата.Сообщение = "Данные по номенклатуре для возврата не получены. Причина: не задан параметр ДатаНачала";
		Возврат СтруктураВозврата;
		
	КонецЕсли;   
	
	Если НЕ ПараметрыЗапроса.Свойство("ДатаОкончания") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗапроса.ДатаОкончания) Тогда
		
		СтруктураВозврата.Сообщение = "Данные по номенклатуре для возврата не получены. Причина: не задан параметр ДатаОкончания";
		Возврат СтруктураВозврата;
		
	КонецЕсли;  
	
	Если НЕ ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗапроса.ИдентификаторКонтрагента) Тогда
		
		Если НЕ ПараметрыЗапроса.Свойство("ГУИДДокумента") ИЛИ НЕ ЗначениеЗаполнено(ПараметрыЗапроса.ГУИДДокумента) Тогда
			
			СтруктураВозврата.Сообщение = "Данные по номенклатуре для возврата не получены. Причина: надо указать ИдентификаторКонтрагента или ГУИДДокумента";
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	пДатаНачалаОтчета = СтрокаВДату(ПараметрыЗапроса.ДатаНачала);
	пДатаКонцаОтчета = СтрокаВДату(ПараметрыЗапроса.ДатаОкончания);
	
	Если ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") Тогда
		пКодКонтрагентаПортал = ПараметрыЗапроса.ИдентификаторКонтрагента;
	Иначе
		пКодКонтрагентаПортал = "";
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("ГУИДДокумента") Тогда
		пГУИДДокумента = СокрЛП(ПараметрыЗапроса.ГУИДДокумента);
	Иначе
		пГУИДДокумента = "";
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("Артикул") Тогда
		пАртикулТовара = ПараметрыЗапроса.Артикул;
	Иначе
		пАртикулТовара = "";
	КонецЕсли;
	
	Если ПараметрыЗапроса.Свойство("Филиалы") Тогда
		пФилиалы = СокрЛП(ПараметрыЗапроса.Филиалы);
	Иначе
		пФилиалы = "";
	КонецЕсли;
	
	пСписокФилиалов = Новый Массив;
	ИскатьФилиалыПоКодуМДМ = Ложь;
	
	Если ЗначениеЗаполнено(пФилиалы) Тогда
		
		пСписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пФилиалы), ",");
		ИскатьФилиалыПоКодуМДМ = (пСписокФилиалов.Количество() > 0 И СтрДлина(пСписокФилиалов[0]) = 36);
		
	КонецЕсли;
	
	ИДАвардаКонтрагента = СтрЗаменить(СокрЛП(пКодКонтрагентаПортал), Символы.НПП, "");
	
	ИскатьПоКодуМДМ = СтрДлина(ИДАвардаКонтрагента) = 36;
	
	Если ЗначениеЗаполнено(ИДАвардаКонтрагента) Тогда
		
		Если ИскатьПоКодуМДМ Тогда
			пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИДАвардаКонтрагента);
		Иначе
			пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", ИДАвардаКонтрагента);
		КонецЕсли;
		
	Иначе
		пКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(пГУИДДокумента) Тогда
		ДокументРеализации = ПолучитьДокументПоИдентификатору("РеализацияТоваровУслуг", Новый УникальныйИдентификатор(пГУИДДокумента));
	Иначе
		ДокументРеализации = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() ИЛИ пСписокФилиалов.Количество() <> 0 ИЛИ ЗначениеЗаполнено(ДокументРеализации) Тогда
		
		ТаблСФ = Новый ТаблицаЗначений;
		ТаблСФ.Колонки.Добавить("Документ");
		ТаблСФ.Колонки.Добавить("ДатаДокумента");
		ТаблСФ.Колонки.Добавить("НомерДокумента");
		
		
		ЗапросЗаказовПоСтатусам = Новый Запрос;
		ЗапросЗаказовПоСтатусам.Текст = ПолучитьТекстЗапросаДоступныеНоменклатурыДляВозврата(ИскатьПоКодуМДМ, ИскатьФилиалыПоКодуМДМ);
		
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400 * 14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда", ИДАвардаКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД", пСписокФилиалов);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Артикул", ?(СокрЛП(пАртикулТовара) <> "", "%" + пАртикулТовара + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("АртикулНормализованный", ?(СокрЛП(пАртикулТовара) <> "", "%" + СтрЗаменить(СтрЗаменить(пАртикулТовара, " ", ""), "-", "") + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ГУИДДокумента", пГУИДДокумента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ПоСпискуФилиалов", пСписокФилиалов.Количество() > 0);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Грузополучатель", ДокументРеализации.Грузополучатель);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Контрагент", ДокументРеализации.Контрагент);
		
		РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить();
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда
			ОбработатьЗапросПоДоступнымНоменклатурамДляВозврата(РезультатЗапросаЗаказовПоСтатусам, СтрокаПараметров, МассивДанных, ТаблСФ);
		КонецЕсли;
		
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	СтруктураВозврата.Данные = МассивДанных;
	
	Возврат СтруктураВозврата;
	//-Сёмин Р.И. 26.03.2026 #UT10-5775
	
КонецФункции

Функция ПолучитьТекстЗапросаДоступныеНоменклатурыДляВозврата(ИскатьПоКодуМДМ, ИскатьФилиалыПоКодуМДМ)
	
	//+Сёмин Р.И. 27.03.2026 #UT10-5775
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СторонниеСклады.Идентификатор КАК Идентификатор,
		|	СторонниеСклады.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СторонниеСклады
		|ИЗ
		|	Справочник.СторонниеСклады КАК СторонниеСклады
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаКлиентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.IDАварда В(&СписокИД)
		|	И &ПоСпискуФилиалов = ИСТИНА
		|	И Контрагенты.IDАварда <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|	И &ПоСпискуФилиалов = ЛОЖЬ
		|	И Контрагенты.ГоловнойКонтрагент.IDАварда <> """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.ГоловнойКонтрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|	И &ПоСпискуФилиалов = ИСТИНА
		|	И Контрагенты.ГоловнойКонтрагент.IDАварда <> """"
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Грузополучатель
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка = &Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаВозвратТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаВозвратТовары.Ссылка.Реализация КАК Реализация,
		|	ЗаявкаНаВозвратТовары.НомерСтрокиИзРТУ,
		|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ЗаявкиНаВозврат
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
		|		ПО ТаблицаКлиентов.Ссылка = ЗаявкаНаВозвратТовары.Ссылка.Реализация.Контрагент
		|ГДЕ
		|	ЗаявкаНаВозвратТовары.Ссылка.Статус <> ""Отменен""
		|	И ЗаявкаНаВозвратТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	ЗаявкаНаВозвратТовары.НомерСтрокиИзРТУ,
		|	ЗаявкаНаВозвратТовары.Ссылка.Реализация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СРЕДНЕЕ(РеализацияТоваровУслугТовары.Цена) КАК Цена,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада КАК IDСклада,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад КАК IDСклада_СтороннийСклад
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|			ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|		ПО ТаблицаКлиентов.Ссылка = РеализацияТоваровУслуг.Грузополучатель
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		|	И ВЫБОР
		|			КОГДА &ГУИДДокумента = """"
		|				ТОГДА РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка = &ДокументРеализации
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада,
		|	РеализацияТоваровУслугТовары.НомерСтроки,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Реализация,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	IDСклада,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.НомерСтроки КАК НомерСтроки,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
		|ПОМЕСТИТЬ ТаблПродаж
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			Запись,
		|			(ДокументПродажи, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТаблЧасть.Реализация КАК ДокументПродажи,
		|					ТаблЧасть.Номенклатура
		|				ИЗ
		|					ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ДокументПродажи,
		|	ПродажиОбороты.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи,
		|	Номенклатура,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Реализация,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.НомерСтроки,
		|	СУММА(ТаблПродаж.КоличествоОборот - ВЫБОР
		|			КОГДА ЗаявкиНаВозврат.Количество ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ЗаявкиНаВозврат.Количество
		|		КОНЕЦ) КАК КоличествоДляВозврата,
		|	СУММА(ТаблПродаж.КоличествоОборот) КАК ТаблПродаж_КоличествоОборот,
		|	СУММА(ЗаявкиНаВозврат.Количество) КАК ЗаявкиНаВозврат_Количество,
		|	ТаблЧасть.IDСклада_СтороннийСклад КАК IDСклада_СтороннийСклад,
		|	ТаблЧасть.IDСклада КАК IDСклада
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаВозврат КАК ЗаявкиНаВозврат
		|		ПО ТаблЧасть.Реализация = ЗаявкиНаВозврат.Реализация
		|			И ТаблЧасть.Номенклатура = ЗаявкиНаВозврат.Номенклатура
		|			И ТаблЧасть.НомерСтроки = ЗаявкиНаВозврат.НомерСтрокиИзРТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблПродаж КАК ТаблПродаж
		|		ПО ТаблЧасть.Реализация = ТаблПродаж.ДокументПродажи
		|			И ТаблЧасть.Номенклатура = ТаблПродаж.Номенклатура
		|			И ТаблЧасть.НомерСтроки = ТаблПродаж.НомерСтроки
		|ГДЕ
		|	(&Артикул = """"
		|			ИЛИ ТаблЧасть.Номенклатура.КодПроизводителя ПОДОБНО &Артикул
		|			ИЛИ СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(ТаблЧасть.Номенклатура.КодПроизводителя, "" "", """"), ""-"", """") ПОДОБНО &АртикулНормализованный)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЧасть.Реализация,
		|	ТаблЧасть.НомерСтроки,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.IDСклада_СтороннийСклад,
		|	ТаблЧасть.IDСклада
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDСклада
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Реализация,
		|	ТаблЗаказа.Номенклатура,
		|	СУММА(ТаблЗаказа.Цена) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблЗаказа.Количество ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ТаблЗаказа.Количество
		|		КОНЕЦ) КАК Количество,
		|	ТаблЗаказа.НомерСтроки,
		|	СУММА(ТаблЗаказа.КоличествоДляВозврата) КАК КоличествоДляВозврата,
		|	ТаблЗаказа.IDСклада,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СторонниеСклады.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЭтоСтороннийСклад,
		|	СчетФактураВыданный.Ссылка КАК СчетФактура
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ СторонниеСклады КАК СторонниеСклады
		|		ПО ТаблЗаказа.IDСклада_СтороннийСклад = СторонниеСклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ТаблЗаказа.Реализация = СчетФактураВыданный.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Реализация,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.НомерСтроки,
		|	ТаблЗаказа.IDСклада,
		|	СчетФактураВыданный.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Реализация.Ссылка КАК Ссылка,
		|	ИтоговаяТаблица.Реализация.Номер КАК НомерДокумента,
		|	ИтоговаяТаблица.Реализация.Дата КАК ДатаДокумента,
		|	ИтоговаяТаблица.Реализация.Грузополучатель.Наименование КАК НаименованиеФилиала,
		|	ИтоговаяТаблица.Реализация.Комментарий КАК Комментарий,
		|	ИтоговаяТаблица.Реализация.ВалютаДокумента.Наименование КАК НаименованиеВалюта,
		|	ИтоговаяТаблица.Реализация.ДоговорКонтрагента.Наименование КАК НаименованиеДоговора,
		|	ИтоговаяТаблица.Реализация.Склад.Наименование КАК НаименованиеСклада,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК НаименованиеОрганизации,
		|	""Москворечье Трейдинг"" КАК ЮрЛицо,
		|	ИтоговаяТаблица.Номенклатура.КодПоБазеМоскоречье КАК ИнвНомер,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК КоэффициентНомеклатуры,
		|	ИтоговаяТаблица.Количество КАК Количество,
		|	ИтоговаяТаблица.Цена КАК ЦенаСНДС,
		|	"""" КАК КомментарийНоменклатуры,
		|	ИтоговаяТаблица.Количество * ИтоговаяТаблица.Цена КАК СуммаСНДС,
		|	ИтоговаяТаблица.Номенклатура.КодПроизводителя КАК КодПроизводителя,
		|	ИтоговаяТаблица.Номенклатура.Наименование КАК НаименованиеНоменклатура,
		|	ЕСТЬNULL(ИтоговаяТаблица.Номенклатура.Родитель.Наименование, """") КАК Бренд,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК НаименованиеЕдиницаХранения,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ЭтоСтороннийСклад
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ДействияСЗаказом,
		|	ЕСТЬNULL(ИтоговаяТаблица.КоличествоДляВозврата, 0) КАК КоличествоДляВозврата,
		|	ИтоговаяТаблица.СчетФактура
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ ИтоговаяТаблица.ЭтоСтороннийСклад
		|				ТОГДА НЕ ИтоговаяТаблица.Номенклатура.НеПодлежитВозврату
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаДокумента УБЫВ,
		|	НомерДокумента УБЫВ,
		|	НомерСтроки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(ЦенаСНДС),
		|	СУММА(СуммаСНДС)
		|ПО
		|	Ссылка,
		|	Номенклатура";
	
	Если ИскатьПоКодуМДМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
	КонецЕсли;
	
	Если ИскатьФилиалыПоКодуМДМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.IDАварда В(&СписокИД)", "Контрагенты.КодМДМ В(&СписокИД)");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.КодМДМ В(&СписокИД)", "Контрагенты.IDАварда В(&СписокИД)");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	//-Сёмин Р.И. 27.03.2026 #UT10-5775
	
КонецФункции

Процедура ОбработатьЗапросПоДоступнымНоменклатурамДляВозврата(РезультатЗапросаДоступныеНоменклатурыКВозврату, СтрокаПараметров, МассивДанных, ТаблСФ)
	
	//+Сёмин Р.И. 27.03.2026 #UT10-5775
	ВыборкаРезультата1 = РезультатЗапросаДоступныеНоменклатурыКВозврату.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаРезультата1.Следующий() Цикл
		
		ВыборкаРезультата2 = ВыборкаРезультата1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаРезультата2.Следующий() Цикл
			
			ВыборкаРезультата = ВыборкаРезультата2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				СтрокаВозврата = Новый Структура(СтрокаПараметров);
				
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата);
				
				ЕстьРН = ЗначениеЗаполнено(ВыборкаРезультата.Ссылка);
				
				Если ЕстьРН Тогда
					СтрокаВозврата.ГУИДРТУ = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());
					СтрокаВозврата.ДатаДокумента = Формат(ВыборкаРезультата.ДатаДокумента, "ДФ='yyyy-MM-ddTHH:mm:ss'");
					СтрокаВозврата.НомерДокумента = ВыборкаРезультата.НомерДокумента;
				КонецЕсли; 		  				
				
				СтрокаТЗ = ПолучитьДанныеСФ(ВыборкаРезультата.Ссылка, ВыборкаРезультата.СчетФактура, ТаблСФ);
				
				Если ЗначениеЗаполнено(СтрокаТЗ.НомерДокумента) Тогда 
					СтрокаВозврата.НомерДокумента = СтрокаТЗ.НомерДокумента;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаТЗ.ДатаДокумента) Тогда 
					СтрокаВозврата.ДатаДокумента = СтрокаТЗ.ДатаДокумента;
				КонецЕсли; 
				
				МассивДанных.Добавить(СтрокаВозврата);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;	
	//-Сёмин Р.И. 27.03.2026 #UT10-5775
	
КонецПроцедуры

Функция ПолучитьДанныеСФ(Документ, СФ, ТЗ)
	
	//+Сёмин Р.И. 27.03.2026 #UT10-5775
	Строка = ТЗ.Найти(Документ);
	
	Если Строка = Неопределено Тогда
		
		Строка = ТЗ.Добавить();
		Строка.Документ = Документ;
		СчетФактура = СФ;
		
		Если ЗначениеЗаполнено(СчетФактура) Тогда
			
			Строка.НомерДокумента = ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура) + " от " + Формат(СчетФактура.Дата, "ДФ='дд ММММ гггг'") + " г.";
			Строка.ДатаДокумента = Формат(СчетФактура.Дата, "ДФ='yyyy-MM-ddTHH:mm:ss'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка;
	//-Сёмин Р.И. 27.03.2026 #UT10-5775

КонецФункции


///////////////////Процедуры общие процедуры и функции///////////////////

// Взвращает Структуру с заданным количеством соответсвий по заданному запросу данных
// Параметры:
//			ВидСоответствия - Тип "Строка",  возможные значение "Номенклатура.НормализованныйКод", "РегистрСведений.СинонимыПроизводителей"
Функция ПолучитьСоответсвиеДанных(ВидСоответствия, МассивЗначенийОтбора, КоличествоСоответствий = 1)  
	
	СтруктураСоответсвий = Новый Структура;
	
	Для Счетчик = 0 по КоличествоСоответствий - 1 Цикл 
		СтруктураСоответсвий.Вставить("СоотвествиеДанных_" + Строка(Счетчик), Новый Соответствие);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаСоответсвия(ВидСоответствия);
	
	Запрос.Параметры.Вставить("МассивЗначенийОтбора", МассивЗначенийОтбора);
	ВыборкаДанных = Запрос.Выполнить().Выбрать(); 
	
	Пока ВыборкаДанных.Следующий() Цикл 
		
		Для Счетчик = 0 по КоличествоСоответствий - 1 Цикл 
			
			СоответсвиеДанных = СтруктураСоответсвий["СоотвествиеДанных_" + Строка(Счетчик)];
			СоответсвиеДанных.Вставить(СокрЛП(ВыборкаДанных["Ключ_" + Строка(Счетчик)]), ВыборкаДанных["Значение_" + Строка(Счетчик)]);
			
		КонецЦикла;	
		
	КонецЦикла;	
		
    Возврат СтруктураСоответсвий;
	
КонецФункции

Функция ПолучитьТекстЗапросаСоответсвия(ВидСоответствия)  
	
	ТекстЗапроса = "";
	
	Если ВидСоответствия = "Номенклатура.НормализованныйКод" Тогда 
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Номенклатура.НормализованныйКод КАК Ключ_0,
		|	Номенклатура.Ссылка КАК Значение_0
		|	//Номенклатура.Артикул КАК Ключ_1,	// второй ключ для второго соответсвия
		|	//Номенклатура.Ссылка КАК Значение_1  // второе значение для второго соответсвия 
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.НормализованныйКод В(&МассивЗначенийОтбора)";
		
	ИначеЕсли ВидСоответствия = "Номенклатура.Артикул" Тогда 
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Номенклатура.Артикул КАК Ключ_0,
		|	Номенклатура.Ссылка КАК Значение_0
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Артикул В(&МассивЗначенийОтбора)"; 	
		
	ИначеЕсли ВидСоответствия = "РегистрСведений.СинонимыПроизводителей" Тогда 
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СинонимыПроизводителей.СинонимПроизводителя КАК Ключ_0,
		|	СинонимыПроизводителей.Производитель КАК Значение_0
		|ИЗ
		|	РегистрСведений.СинонимыПроизводителей КАК СинонимыПроизводителей
		|ГДЕ
		|	СинонимыПроизводителей.СинонимПроизводителя В(&МассивЗначенийОтбора)";
		
	КонецЕсли;	
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПреобразоватьДатуМДМ(СтроковаяДата) Экспорт   
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-", "");   
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":", "");  
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T", "");  
	
	Возврат Дата(СтроковаяДата); 
	
КонецФункции      

Функция СтрокаВДату(Знач ДатаСтрока) 
	
	ДатаСтрока = Лев(СОКРЛП(ДатаСтрока), 10);
	
	СначалаГод = Найти("0123456789", Сред(ДатаСтрока, 3, 1)) > 0;
	
	ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", "")); 
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "-", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "/", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "\", "");
	
	Если СначалаГод Тогда 
		ДатаСтрока = Лев(ДатаСтрока, 4) + Сред(ДатаСтрока, 5, 2) + Прав(ДатаСтрока, 2);  
	Иначе
		ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);  
	
		Если СтрДлина(ДатаСтрока) = 6 Тогда
			ДатаСтрока = "20" + ДатаСтрока;
		КонецЕсли;    
		
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(ДатаСтрока);
	
	Возврат Результат;
	
КонецФункции    

Функция СтрокаВБулево(Знач ЗначСтрока) 
	
	Если ПустаяСтрока(ЗначСтрока) Или ЗначСтрока = "0" Тогда 
		Возврат Ложь;
		
	ИначеЕсли ЗначСтрока = "1" Тогда  
		Возврат Истина;
	Иначе
	
		Попытка
			ЗначБулево = Булево(ЗначСтрока);
		Исключение
		    ЗначБулево = Ложь;
		КонецПопытки;
		
		Возврат ЗначБулево;
		
	КонецЕсли;

КонецФункции   

Функция ДвоичноеВДесятичное(Знач Стр2) 
	
	Стр = СокрЛП(Стр2);
	Рез = 0;
	
	Для Н = 1 по СтрДлина(Стр) Цикл
		Рез = Рез * 2 + Число(Сред(Стр, Н, 1));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции   

Функция ВернутьСоответсвиеИзJSON(Строка) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
	
	Возврат Данные;
	
КонецФункции

Функция ПолучитьСтруктуруИзСоответствия(СоответвиеИсточник) Экспорт
	
	СтруктураВозврат = Новый Структура;
	
	Если ТипЗнч(СоответвиеИсточник) = Тип("Соответствие") Или ТипЗнч(СоответвиеИсточник) = Тип("ФиксированноеСоответствие") Тогда
				
		Для Каждого КлючЗначение Из СоответвиеИсточник Цикл   
			СтруктураВозврат.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение); 
		КонецЦикла;    
		
	ИначеЕсли ТипЗнч(СоответвиеИсточник) = Тип("Структура") Тогда 
		СтруктураВозврат = СоответвиеИсточник;
	КонецЕсли;
	
	Возврат СтруктураВозврат; 
	
КонецФункции

Функция ПолучитьПоляСтруктурыВыходныхПараметров(СтруктураПараметоровМетода)
	
	СтрокеПолей = "";
	
	Для Каждого ЭлементПоля Из СтруктураПараметоровМетода.СоответсвиеВыходныхПарамтров Цикл 
		
		Если СтрокеПолей <> "" Тогда
			СтрокеПолей = СтрокеПолей + ",";
		КонецЕсли;
		
		СтрокеПолей = СтрокеПолей + ЭлементПоля.Значение;
		
	КонецЦикла;	  
	
	Возврат СтрокеПолей;
	
КонецФункции			

Функция ПолучитьОписаниеПараметровЗапроса(ПараметрыЗапроса)
	
	ПараметрыСтр = "Параметры: ";
	
	Для каждого КлючЗначение Из ПараметрыЗапроса Цикл
		ПараметрыСтр = ПараметрыСтр + КлючЗначение.Ключ + "=" + КлючЗначение.Значение + Символы.ПС;
	КонецЦикла;		
	
	Возврат ПараметрыСтр;

КонецФункции 

///////////////////Вспомогательные процедуры /////////////////// 

Функция ПреобразованиеМассивВТаблицуЗначений(Массив)

   // Создаем новую пустую таблицу значений
   ТЗ = Новый ТаблицаЗначений;

   // Обрабатываем каждую строку (структуру) в массиве
   Для Каждого СтрокаМассива Из Массив Цикл

       // Если таблица еще не имеет колонок (первая строка)
       Если ТЗ.Колонки.Количество() = 0 Тогда
           // Создаем колонки на основе ключей первой структуры
           Для Каждого ЭлементМассива Из СтрокаМассива Цикл
               // Добавляем колонку с именем ключа структуры
               ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
           КонецЦикла;
       КонецЕсли;

       // Добавляем новую строку в таблицу
       НоваяСтрока = ТЗ.Добавить();

       // Заполняем значения строки из структуры
       Для Каждого ЭлементМассива Из СтрокаМассива Цикл
           // Устанавливаем значение в соответствующую колонку
           НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
       КонецЦикла;

   КонецЦикла;

   // Возвращаем сформированную таблицу значений
   Возврат ТЗ;

КонецФункции

//Перенесена из МСКWEB.ПустойСтороннийСклад
Функция ПустойСтороннийСклад(НовыйДокЗаказ)
	Результат = Ложь;
	
	// Проверяем значение НовыйДокЗаказ.IDСклада, что это Собственный Склад	
	Если НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад)  Тогда
		Результат = МСК.ЭтоСтороннийСклад(НовыйДокЗаказ.IDСклада);		
		Если НЕ Результат Тогда
			Возврат Результат;
		КонецЕсли; 
	КонецЕсли; 
	
	
	Если  ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада) И НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад)
		И Константы.НеСоздаватьСтороннийСклад.Получить() Тогда
		Результат = Истина;	   
	КонецЕсли;		
	
	
	Возврат Результат;
КонецФункции

//МСКWEB.СоздатьНовуюНоменклатуру - аналогична
Функция СоздатьНоменклатуру(ДаннныеТовара, НоменклатураРодитель, Товар, ЭтоНашТовар, Комментарий = "", EMailЗаказ = Ложь) Экспорт
	
	Если EMailЗаказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка  
		
		Если НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка() Тогда    
			
			ИскомаяГруппа = Справочники.Номенклатура.НайтиПоНаименованию(ВРег(ДаннныеТовара.Родитель), Истина); 
			
			Если ИскомаяГруппа = Неопределено Тогда   
				
				НоменклатураРодитель = Справочники.Номенклатура.СоздатьГруппу();
				НоменклатураРодитель.ВидНоменклатуры 	= Константы.ВидНоменклатурыПоУмолчанию.Получить();
				НоменклатураРодитель.Наименование 		= ВРег(ДаннныеТовара.Родитель);
				НоменклатураРодитель.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
				НоменклатураРодитель.Записать();  
				
			Иначе 
				НоменклатураРодитель = ИскомаяГруппа;
			КонецЕсли;   
			
		КонецЕсли;
		
		НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.ВестиУчетПоСериям 				= Истина;
		НовыйЭлемент.Наименование 					= ДаннныеТовара.Наименование;
		НовыйЭлемент.ВидНоменклатуры 				= Константы.ВидНоменклатурыПоУмолчанию.Получить();
		//+Гавриленков В. 05.12.2025 #UT10-5574
		//НовыйЭлемент.СтавкаНДС 						= Перечисления.СтавкиНДС.НДС20;
		НовыйЭлемент.СтавкаНДС 						= ?(ТекущаяДата() >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, Перечисления.СтавкиНДС.НДС20);
		//-Гавриленков В. 05.12.2025 #UT10-5574

		Если НЕ ЭтоНашТовар Тогда 
			НовыйЭлемент.НаименованиеПолное = СтрЗаменить(ДаннныеТовара.КодПроизводителя + " " + ДаннныеТовара.Наименование, "'" , "");	
		Иначе
			НовыйЭлемент.НаименованиеПолное = ДаннныеТовара.КодПроизводителя + " " + ДаннныеТовара.Наименование;
		КонецЕсли;

		НовыйЭлемент.КодПроизводителя				= ДаннныеТовара.КодПроизводителя;
		НовыйЭлемент.ВестиПартионныйУчетПоСериям 	= Истина;
		НовыйЭлемент.БазоваяЕдиницаИзмерения 		= Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
		НовыйЭлемент.Комментарий 					= Комментарий;
		НовыйЭлемент.НеПодлежитВозврату 			= Ложь; 
		НовыйЭлемент.Кратность 						= 1;
		НовыйЭлемент.Родитель 						= НоменклатураРодитель.Ссылка;
		
		Если ЭтоНашТовар Тогда  
			
			НовыйЭлемент.Артикул                    = СокрЛП(ДаннныеТовара.Артикул);
			НовыйЭлемент.КодПоБазеМоскоречье        = СокрЛП(ДаннныеТовара.Артикул);   
			
		КонецЕсли;
		
		НовыйЭлемент.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Прочее;
		НовыйЭлемент.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
		НовыйЭлемент.Записать();
		
		НоваяЕдиница 							= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НоваяЕдиница.Владелец 					= НовыйЭлемент.Ссылка ;
		НоваяЕдиница.Наименование 				= НовыйЭлемент.БазоваяЕдиницаИзмерения.Наименование;
		НоваяЕдиница.ЕдиницаПоКлассификатору 	= НовыйЭлемент.БазоваяЕдиницаИзмерения;
		НоваяЕдиница.Коэффициент 				= 1;
		НоваяЕдиница.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
		НоваяЕдиница.Записать();
		
		НовыйЭлемент.ЕдиницаХраненияОстатков	= НоваяЕдиница.Ссылка;
		НовыйЭлемент.ЕдиницаДляОтчетов			= НоваяЕдиница.Ссылка;
		НовыйЭлемент.ЕдиницаИзмеренияМест       = НоваяЕдиница.Ссылка;
		НовыйЭлемент.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP",Истина);	
		НовыйЭлемент.Записать();
		
		Товар = НовыйЭлемент.Ссылка;
		Возврат Истина;     
		
	Исключение    
		
		Товар = Неопределено;
		Возврат Ложь;
		
	КонецПопытки; 
	
КонецФункции

Функция НайтиКонтрагентаOnlineStore(ПараметрыЗапроса, СтруктураВозврата, ТекстОшибки)
	
	Если Не ПараметрыЗапроса.Свойство("ИдентификаторКонтрагента") Или ПустаяСтрока(ПараметрыЗапроса.ИдентификаторКонтрагента) Тогда  
		
		СтруктураВозврата.Сообщение = ТекстОшибки + "Причина: не задан параметр запроса ИдентификаторКонтрагента";
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	
	КонецЕсли;
	
	ИдентификаторКонтрагента = СтрЗаменить(СокрЛП(ПараметрыЗапроса.ИдентификаторКонтрагента), Символы.НПП, "");
	
	Если СтрДлина(ИдентификаторКонтрагента) = 36 Тогда  
		РеквизитПоиска = "КодМДМ";
	Иначе
		РеквизитПоиска = "IDАварда";
	КонецЕсли;	   
	
	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту(РеквизитПоиска, ИдентификаторКонтрагента);
	
	Если Контрагент.Пустая() Тогда               
		СтруктураВозврата.Сообщение = ТекстОшибки + "Причина: не найден контрагент по идентификатору " + ПараметрыЗапроса.ИдентификаторКонтрагента;
	КонецЕсли;  
	
	Возврат Контрагент;

КонецФункции // ()

Функция ПолучитьДокументПоИдентификатору(ИмяДокумента, ИдентификаторДокумента)

	Попытка
	
		ГУИД = Новый УникальныйИдентификатор(ИдентификаторДокумента);
		ДокСсылка = Документы[ИмяДокумента].ПолучитьСсылку(ГУИД);
		
		Если ДокСсылка.ПолучитьОбъект() = Неопределено Тогда
			ДокСсылка = Документы[ИмяДокумента].ПустаяСсылка();
		КонецЕсли;
		
	Исключение  
		ДокСсылка = Документы[ИмяДокумента].ПустаяСсылка();
	КонецПопытки;
	
    Возврат ДокСсылка;
	
КонецФункции // ()

// перенесена из МСКWEB.ЕстьСборка
Функция ЕстьСборка(Заказ) 
	
	ЕстьСборка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(СобраноПоЗаказуОбороты.КоличествоОборот) КАК Количество
	|ИЗ
	|	РегистрНакопления.СобраноПоЗаказу.Обороты(, , , Заказ = &Заказ) КАК СобраноПоЗаказуОбороты";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Количество <> NULL И Выборка.Количество > 0 Тогда
			ЕстьСборка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьСборка;
	
КонецФункции

// перенесена из МСКWEB.ЕстьЗаказПоставщику
Функция ЕстьЗаказПоставщику(Заказ) 
	
	ЕстьЗаказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(РазмещениеЗаказовПокупателейОбороты.КоличествоПриход) КАК Количество
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(, , , ЗаказПокупателя = &Заказ) КАК РазмещениеЗаказовПокупателейОбороты";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Количество <> NULL И Выборка.Количество > 0 Тогда
			ЕстьЗаказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьЗаказ;
	
КонецФункции

//перенесен измодуля МСКWEB.ДобавитьНеСозданныеЗаказыПокупателей,- аналогична
Процедура ДобавитьНеСозданныеЗаказыПокупателей(пДатаНачалаОтчета, пДатаКонцаОтчета, ИДАвардаКонтрагента, МассивРезультат, СтрокаПараметров)
		
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУММА(НеСозданныеЗаказыПокупателейТовары.Price * НеСозданныеЗаказыПокупателейТовары.Count) КАК SUMMA,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Ссылка,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата КАК DATE_TIMESTAMP,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Наименование КАК FILIAL_NAME,
	|	ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment КАК СТРОКА(100)) КАК DNOTE,
	|	""RUB"" КАК VALUTA_NAME,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.FirmID КАК OUR_FIRM
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.KontragentID = &KontragentID
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.FirmID,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Ссылка,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата,
	|	ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment КАК СТРОКА(100)),
	|	ПРЕДСТАВЛЕНИЕ(НеСозданныеЗаказыПокупателейТовары.Ссылка.ФилиалКонтрагента)
	|
	|УПОРЯДОЧИТЬ ПО
	|	DATE_TIMESTAMP");
	
	Запрос.УстановитьПараметр("ДатаНач", 		?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400 * 14)));
	Запрос.УстановитьПараметр("ДатаКон", 		?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("KontragentID",	ИДАвардаКонтрагента);
	
	РезЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрРез Из РезЗапроса Цикл  
		
		СтрокаВозврата = Новый Структура(СтрокаПараметров);       
		
		СтрокаВозврата.ДатаЗаказа = СтрРез.DATE_TIMESTAMP;
		
		СтрокаВозврата.НаименованиеКонтрагент 		= СтрРез.FILIAL_NAME;
		СтрокаВозврата.Комментарий 				= СтрРез.DNOTE;
		СтрокаВозврата.НаименованиеВалюта 		= СтрРез.VALUTA_NAME;
		СтрокаВозврата.НаименованиеДоговора 	= "";
		СтрокаВозврата.НаименованиеСклада 		= "";
		СтрокаВозврата.НаименованиеОрганизации 	= СтрРез.OUR_FIRM;		
		СтрокаВозврата.ИдентификаторДокумента 	= СокрЛП(СтрРез.Ссылка.УникальныйИдентификатор());
		СтрокаВозврата.ДатаОформленияЗаказа 	= Формат(СтрРез.DATE_TIMESTAMP, "ДФ='dd.MM.yyyy HH:mm'");
		СтрокаВозврата.НомерЗаказа 				= "Заказ от " + СтрокаВозврата.ДатаЗаказа;
		СтрокаВозврата.Статус 					= "10;принят в работу";
		СтрокаВозврата.СуммаДокументаСНДС 		= СтрРез.SUMMA;
		//СтрокаВозврата.ДействияСЗаказом 		= "0000";
		
		МассивРезультат.Добавить(СтрокаВозврата);
		
	КонецЦикла;		
	
КонецПроцедуры

//перенесен измодуля МСКWEB.ПроверитьСтатусСборки
Функция ПроверитьСтатусСборки(ПромЗаказ, ПромТовар) 
	
	ЗапросНаличияСборки = Новый Запрос;
	ЗапросНаличияСборки.УстановитьПараметр("Заказ",ПромЗаказ);
	ЗапросНаличияСборки.УстановитьПараметр("Товар",ПромТовар);
	ЗапросНаличияСборки.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Сборка.Ссылка,
	|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			ЗаказПокупателя = &Заказ ";
	Если НЕ ПромТовар = NULL Тогда
		ЗапросНаличияСборки.Текст = ЗапросНаличияСборки.Текст +"
		|				И Номенклатура = &Товар";
	КонецЕсли;
	ЗапросНаличияСборки.Текст = ЗапросНаличияСборки.Текст +" 
	|) КАК ТоварыВСборкеОстатки";
	Если НЕ ЗапросНаличияСборки.Выполнить().Пустой()Тогда		
		ЗапросСтатусаСборки = Новый Запрос;
		ЗапросСтатусаСборки.УстановитьПараметр("Заказ",ПромЗаказ);
		ЗапросСтатусаСборки.УстановитьПараметр("Товар",ПромТовар);
		ЗапросСтатусаСборки.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВСборкеОстатки.Сборка.Ссылка,
		|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки
		|ИЗ
		|	РегистрНакопления.ТоварыВСборке.Остатки(
		|			,
		|			ЗаказПокупателя = &Заказ ";
		Если НЕ ПромТовар = NULL Тогда
			ЗапросСтатусаСборки.Текст = ЗапросСтатусаСборки.Текст +"
			|				И Номенклатура = &Товар";
		КонецЕсли;
		ЗапросСтатусаСборки.Текст = ЗапросСтатусаСборки.Текст +"		
		|) КАК ТоварыВСборкеОстатки
		|ГДЕ
		|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
		Возврат НЕ ЗапросСтатусаСборки.Выполнить().Пустой();
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции

Функция ПоказатьВременнуюТаблицу(МенеджерВременныхТаблицИлиЗапрос, ИмяВременнойТаблицы) Экспорт
	
	ЗакрытьМенеджерВременныхТаблиц = Ложь;
	
	Если ТипЗнч(МенеджерВременныхТаблицИлиЗапрос) = Тип("Запрос") Тогда
		Если МенеджерВременныхТаблицИлиЗапрос.МенеджерВременныхТаблиц = Неопределено Тогда
			МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			ЗакрытьМенеджерВременныхТаблиц = Истина;
			МенеджерВременныхТаблицИлиЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
		Иначе
			МенеджерВременныхТаблиц = МенеджерВременныхТаблицИлиЗапрос.МенеджерВременныхТаблиц;
		КонецЕсли;
		Попытка
			МенеджерВременныхТаблицИлиЗапрос.Выполнить();
		Исключение
			// Ничего не делаем.
		КонецПопытки;
	Иначе
		МенеджерВременныхТаблиц = МенеджерВременныхТаблицИлиЗапрос;
	КонецЕсли; 
	
	ДанныеТаблицы = ЗапросВыполнитьВыгрузить("ВЫБРАТЬ * ИЗ " + ИмяВременнойТаблицы,, МенеджерВременныхТаблиц);
	
	Если ЗакрытьМенеджерВременныхТаблиц Тогда
		МенеджерВременныхТаблиц.Закрыть();
		МенеджерВременныхТаблицИлиЗапрос.МенеджерВременныхТаблиц = Неопределено;
	КонецЕсли; 
	
	Возврат ДанныеТаблицы;
	
КонецФункции

Функция ЗапросВыполнитьВыгрузить(ТекстЗапроса, ПараметрыЗапроса = Неопределено, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Для Каждого Параметр Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
