////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.СтруктураПараметровОтправки);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РазделениеУведомленийПриИзменении(Элемент)
	
	Если ДелениеПоАдресатам <> ПредопределенноеЗначение("Перечисление.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому") Тогда
		ФильтрПоАдресатам = Ложь;
	КонецЕсли;
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Готово(Команда)
	
	Если Модифицированность Тогда
		
		СтруктураПараметровОтправки = Новый Структура;
		СтруктураПараметровОтправки.Вставить("ДелениеПоАдресатам",        ДелениеПоАдресатам);
		СтруктураПараметровОтправки.Вставить("ФильтрПоАдресатам",         ФильтрПоАдресатам);
		СтруктураПараметровОтправки.Вставить("ИмяОтправителя",            ИмяОтправителя);
		СтруктураПараметровОтправки.Вставить("ОбратныйАдрес",             ОбратныйАдрес);
		СтруктураПараметровОтправки.Вставить("КонтрольПовторнойОтправки", КонтрольПовторнойОтправки);
		
		Оповестить("Настроены_Параметры_Отправки", СтруктураПараметровОтправки, ЭтаФорма);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУР И ФУНКЦИИ

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.РазделениеУведомлений1.Видимость = ЭлПочта;
	Элементы.РазделениеУведомлений2.Видимость = ЭлПочта;
	Элементы.РазделениеУведомлений3.Видимость = (Элементы.РазделениеУведомлений1.Видимость Или Элементы.РазделениеУведомлений2.Видимость);
	
	Элементы.ГруппаОбратныйАдресИмяОтправителя.Видимость = ЭлПочта;
	
	Элементы.ФильтрПоАдресатам.Доступность = (ДелениеПоАдресатам = Перечисления.ПЛ_ДелениеУведомленийПоАдресатам.ОтдельноКаждому);
	
КонецПроцедуры