Функция Печать(Ссылка = Неопределено, КоллекцияПечатныхФорм=Неопределено) Экспорт
	
	Если Ссылка <> Неопределено  Тогда 
		Документ = СсылкаНаОбъект;
		
		СтруктураОтбораСчетаФактуры = Новый Структура;
		СписокВидовСчетовФактур = Новый СписокЗначений;
		СписокВидовСчетовФактур.Добавить(Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
		СтруктураОтбораСчетаФактуры.Вставить("ВидСчетаФактуры", СписокВидовСчетовФактур);
		СтруктураОтбораСчетаФактуры.Вставить("ПометкаУдаления", Ложь);
		
		Если ЗначениеЗаполнено(КоллекцияПечатныхФорм) Тогда
			МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Универсальный корректировочный документ УКД",
			"Универсальный корректировочный документ УКД",
			ПечатьУниверсальногоКорректировочногоДокумента(Ссылка, 0, СтруктураОтбораСчетаФактуры));
		Иначе
			ТабДокумент = ПечатьУниверсальногоКорректировочногоДокумента(Ссылка, 1, СтруктураОтбораСчетаФактуры); 
			//УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, 1, Ложь, "Универсальный корректировочный документ УКД", Ссылка);
			Возврат ТабДокумент;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
 	
КонецФункции
//
Функция ПечатьУниверсальногоКорректировочногоДокумента(Ссылка, Признак = 0, СтруктураОтбораСчетаФактуры) Экспорт 
	
	
	Если Ссылка.Дата < '20130101' Тогда
		ТекстСообщения = "Применение формы универсального корректировочного документа возможно только с 01 января 2013 года!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтруктураОтбораСчетаФактуры = Неопределено Тогда
		СчетФактура = НайтиПодчиненныйСчетФактуру(Ссылка, "СчетФактураВыданный");
	Иначе
		СчетФактура = НайтиПодчиненныйСчетФактуру(Ссылка, "СчетФактураВыданный", СтруктураОтбораСчетаФактуры);
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
		
	// УКД печатается из документа счет-фактура
	Если ЗначениеЗаполнено(СчетФактура) Тогда
		
		Если НЕ ЗначениеЗаполнено(СчетФактура) Тогда
			ТекстСообщения = "По документу %1 не выписан счет-фактура";
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстСообщения, Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Неопределено;
		КонецЕсли;
		
		СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
		
		ДанныеДляПечати = ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокумента(СчетФактура, Ссылка);
		Если ДанныеДляПечати = Неопределено Тогда
			Возврат ТабДокумент;
		КонецЕсли;
		
		Возврат ПечатьУКД(ДанныеДляПечати);
		
	КонецЕсли;
	
	// УКД печатается по статусу 2
	ДанныеДляПечати = ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокументаСтатус2(Ссылка);
	
	Если ДанныеДляПечати = Неопределено Тогда
		Возврат ТабДокумент;
	КонецЕсли;
	
	Таблица = ДанныеДляПечати.ТабличнаяЧасть;
	
	СуммаУменьшения = Таблица.Итог("РазницаБезНДСУменьшение") + Таблица.Итог("РазницаСНДСУменьшение") + Таблица.Итог("РазницаНДСУменьшение");
	СуммаУвеличения = Таблица.Итог("РазницаБезНДСУвеличение") + Таблица.Итог("РазницаСНДСУвеличение") + Таблица.Итог("РазницаНДСУвеличение");
	
	Если СуммаУменьшения = 0 И СуммаУвеличения = 0 Тогда
		ТекстСообщения = "Печать универсального корректировочного документа без изменения суммовых показателей не возможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	// Устанавливаем параметры печати и колонтитулы
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДокумент.ПолеСверху = 12;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент";
	
	Макет = ПолучитьМакет("УниверсальныйКорректировочныйДокумент");
	
	ВывестиКорректировочныйСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	ВывестиПодвалУниверсальногоКорректировочногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	Возврат ТабДокумент;			

КонецФункции

Функция ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокумента(СчетФактура, Ссылка)
	
	ДанныеДляПечати = ПодготовитьОбщиеДанныеДляПечатиКорректировочногоСчетаФактуры(СчетФактура, Истина);
	
	Если ДанныеДляПечати = Неопределено Тогда
		Возврат ДанныеДляПечати;
	КонецЕсли;
	
	ДанныеДляПечати.Вставить("Основание", Строка(СчетФактура.ДоговорКонтрагента));
	ДанныеДляПечати.Вставить("СтатусУКД", 1);
	ТекущийПользДляКоррСчФк = Константы.ПользовательДляПечатиВКоррСчФк.Получить();
	
	Если ТекущийПользДляКоррСчФк = Перечисления.ПользовательДляПечатиКорректСчетФк.ОтветственоеЛицоИзДокумента Тогда 
		ОтветственныйЗначение = СчетФактура.Ответственный;
	ИначеЕсли ТекущийПользДляКоррСчФк = Перечисления.ПользовательДляПечатиКорректСчетФк.ТекущийПользователь Тогда 
		ОтветственныйЗначение = ПараметрыСеанса.ТекущийПользователь; 
	ИначеЕсли ТекущийПользДляКоррСчФк = Перечисления.ПользовательДляПечатиКорректСчетФк.ОтветственноеЛицоОрганизации Тогда 
		ОтветственныйЗначение = Справочники.Пользователи.НайтиПоРеквизиту("ФизЛицо",ДанныеДляПечати.РуководительФизЛицо);
	КонецЕсли; 
	
	ЗапросПоОтветственным = Новый Запрос();
	ЗапросПоОтветственным.УстановитьПараметр("ДатаСреза",   Ссылка.Дата);
	ЗапросПоОтветственным.УстановитьПараметр("Ответственный",   ОтветственныйЗначение);
	ЗапросПоОтветственным.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК ФИООтветственного,
	|	ФизическиеЛица.Ссылка КАК ФизЛицо,
	|	Пользователи.Должность КАК ДолжностьОтветственного,
	|	ВЫБОР
	|		КОГДА ФизическиеЛица.Ссылка ЕСТЬ NULL
	|			ТОГДА Пользователи.Ссылка.Наименование
	|		ИНАЧЕ ФИОФизЛицСрезПоследних.Фамилия + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Имя, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ + ВЫБОР
	|				КОГДА ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) <> """"
	|					ТОГДА "" "" + ПОДСТРОКА(ФИОФизЛицСрезПоследних.Отчество, 1, 1) + "".""
	|				ИНАЧЕ """"
	|			КОНЕЦ
	|	КОНЕЦ КАК ФИОПолное,
	|	Пользователи.Приказ КАК Приказ
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаСреза, ) КАК ФИОФизЛицСрезПоследних
	|			ПО ФизическиеЛица.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ПО Пользователи.ФизЛицо = ФизическиеЛица.Ссылка
	|ГДЕ
	|	Пользователи.Ссылка = &Ответственный";
	
	Выборка = ЗапросПоОтветственным.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеДляПечати.Вставить("ФИООтветственного",		Выборка.ФИООтветственного);
		ДанныеДляПечати.Вставить("ФИОРуководителя", 		Выборка.ФИООтветственного);
		ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", 	Выборка.ФИООтветственного);
		ДанныеДляПечати.Вставить("ДолжностьОтветственного", Выборка.ДолжностьОтветственного);
		ДанныеДляПечати.Вставить("ФИОКладовщика", 			Выборка.ФИООтветственного);
		ДанныеДляПечати.Вставить("Приказ", 					Выборка.Приказ);			
		
	КонецЦикла;
	
	Если Выборка.Количество() = 0 Тогда  
		
		Если ЗначениеЗаполнено(ОтветственныйЗначение) Тогда
			
			ДанныеДляПечати.Вставить("ФИООтветственного",		ОтветственныйЗначение.Наименование);
			ДанныеДляПечати.Вставить("ФИОРуководителя", 		ОтветственныйЗначение.Наименование);
			ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", 	ОтветственныйЗначение.Наименование);
			ДанныеДляПечати.Вставить("ДолжностьОтветственного", "");
			ДанныеДляПечати.Вставить("ФИОКладовщика", 			ОтветственныйЗначение.Наименование);
			
		Иначе 
			
			ДанныеДляПечати.Вставить("ФИООтветственного",		"");
			ДанныеДляПечати.Вставить("ФИОРуководителя", 		"");
			ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", 	"");
			ДанныеДляПечати.Вставить("ДолжностьОтветственного", "");
			ДанныеДляПечати.Вставить("ФИОКладовщика", 			"");
			ДанныеДляПечати.Вставить("Приказ", 					"");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат ДанныеДляПечати;	 

КонецФункции

Функция ПодготовитьОбщиеДанныеДляПечатиКорректировочногоСчетаФактуры(СчетФактура, ЭтоПечатьУКД = Ложь)
	
	СписокОснований = ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(СчетФактура.ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"),Истина);
	
	ОбщиеДанныеДляПечати = Неопределено;
	
	ДанныеСчетаФактуры = Новый Структура();
	ДанныеСчетаФактуры.Вставить("Ссылка", 							СчетФактура.Ссылка);
	ДанныеСчетаФактуры.Вставить("Номер",  							ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура));
	ДанныеСчетаФактуры.Вставить("Дата",   							СчетФактура.Дата);
	ДанныеСчетаФактуры.Вставить("Организация",   					СчетФактура.Организация);
	ДанныеСчетаФактуры.Вставить("Контрагент",   					СчетФактура.Контрагент);
	ДанныеСчетаФактуры.Вставить("ДоговорКонтрагента",               СчетФактура.ДоговорКонтрагента);
	ДанныеСчетаФактуры.Вставить("ВидСчетаФактуры",                  СчетФактура.ВидСчетаФактуры);
	ДанныеСчетаФактуры.Вставить("Исправление",                      СчетФактура.Исправление);
	ДанныеСчетаФактуры.Вставить("НомерИсправления",                 СчетФактура.НомерИсправления);
	ДанныеСчетаФактуры.Вставить("НомерИсправляемогоКорректировочногоДокумента", СчетФактура.НомерИсправляемогоКорректировочногоДокумента);
	ДанныеСчетаФактуры.Вставить("ДатаИсправляемогоКорректировочногоДокумента",  СчетФактура.ДатаИсправляемогоКорректировочногоДокумента);
	ДанныеСчетаФактуры.Вставить("Продавец",                         СчетФактура.Контрагент);
	ДанныеСчетаФактуры.Вставить("КППКонтрагента",                   СчетФактура.КППКонтрагента);
	ДанныеСчетаФактуры.Вставить("СчетФактураБезНДС",                СчетФактура.СчетФактураБезНДС);
	ДанныеСчетаФактуры.Вставить("ДатаСчетФактуры",					СчетФактура.Дата);
	
	Для Каждого ТекущееОснование из СписокОснований Цикл

		Если Не ЗначениеЗаполнено(ТекущееОснование) Тогда
			Продолжить;
		КонецЕсли; 
		
		ТипОснования = ТипЗнч(ТекущееОснование);
		ДанныеДляПечати = Неопределено;
		
		Если ТипОснования = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			ДанныеДляПечати = СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(ТекущееОснование, ДанныеСчетаФактуры.Ссылка);
		КонецЕсли;
		
		Если ДанныеДляПечати = Неопределено или ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщиеДанныеДляПечати = Неопределено Тогда
			ОбщиеДанныеДляПечати = ДанныеДляПечати;
		Иначе

			Для Каждого СтрДанных Из ДанныеДляПечати Цикл
				
				Если СтрДанных.Ключ = "ТабличнаяЧасть" Тогда

					ОбщаяТабЧасть = ОбщиеДанныеДляПечати.ТабличнаяЧасть;
					ТекущаяТабЧасть = СтрДанных.Значение;
					
					Для Каждого СтрокаТекущейТабЧасть Из ТекущаяТабЧасть Цикл
						СтрокаТабЧасти = ОбщаяТабЧасть.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабЧасти, СтрокаТекущейТабЧасть);
					КонецЦикла;

				Иначе

					Если Не ОбщиеДанныеДляПечати.Свойство(СтрДанных.Ключ) Тогда
						// Если данный параметр для печати шапки документа еще не определен - то определяем его
						ОбщиеДанныеДляПечати.Вставить(СтрДанных.Ключ, СтрДанных.Значение);
					КонецЕсли;

				КонецЕсли;

			КонецЦикла;
			
		КонецЕсли;

	КонецЦикла;
	
	Если ОбщиеДанныеДляПечати <> Неопределено Тогда
		
		КорректируемыеСчетаФактуры = Новый ТаблицаЗначений;
		КорректируемыеСчетаФактуры.Колонки.Добавить("НомерСчетаФактуры");
		КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаСчетаФактуры");
		КорректируемыеСчетаФактуры.Колонки.Добавить("УчитыватьИсправлениеИсходногоДокумента");
		КорректируемыеСчетаФактуры.Колонки.Добавить("НомерИсправления");
		КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаИсправления");
		
		
		РеквизитыПередаточныхДокументов = ""; 
		
		Для Каждого ТекущееОснование ИЗ СчетФактура.ДокументыОснования Цикл

			РеквизитыСчетаФактуры = КорректируемыеСчетаФактуры.Добавить();
			РеквизитыСчетаФактуры.НомерСчетаФактуры = ТекущееОснование.НомерИсходногоДокумента;
			РеквизитыСчетаФактуры.ДатаСчетаФактуры  = ТекущееОснование.ДатаИсходногоДокумента;
			РеквизитыСчетаФактуры.УчитыватьИсправлениеИсходногоДокумента = ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента;
			РеквизитыСчетаФактуры.НомерИсправления  = ?(ТекущееОснование.НомерИсправленияИсходногоДокумента = 0 ИЛИ НЕ ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента,
														"--", ТекущееОснование.НомерИсправленияИсходногоДокумента);
			РеквизитыСчетаФактуры.ДатаИсправления   = ?(Не ЗначениеЗаполнено(ТекущееОснование.ДатаИсправленияИсходногоДокумента) ИЛИ НЕ ТекущееОснование.УчитыватьИсправлениеИсходногоДокумента,
														'00010101', ТекущееОснование.ДатаИсправленияИсходногоДокумента);
			ИсправляемыйДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(ТекущееОснование.ДокументОснование, Истина);
			РеквизитыПередаточныхДокументов = РеквизитыПередаточныхДокументов + ?(РеквизитыПередаточныхДокументов = "", "", ", ")
				+ ?(ЭтоПечатьУКД,"Универсальный передаточный документ " + РеквизитыПервичногоДокумента(ИсправляемыйДокументРеализации),
							РеквизитыПервичногоДокумента(ИсправляемыйДокументРеализации,,,Истина));

		КонецЦикла;
		
		ДанныеДляПечати.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов);
		
		КорректируемыеСчетаФактуры.Свернуть("НомерСчетаФактуры, ДатаСчетаФактуры, УчитыватьИсправлениеИсходногоДокумента, НомерИсправления, ДатаИсправления");
		
		Если КорректируемыеСчетаФактуры.Количество() <> 0 Тогда
			
			КорректируемыеСчетаФактуры.Сортировать("ДатаСчетаФактуры Возр", Новый СравнениеЗначений);
			
			Если КорректируемыеСчетаФактуры[0].ДатаСчетаФактуры >= '20160701' Тогда
				
				Для Каждого СтрокаТабЧасти Из ОбщиеДанныеДляПечати.ТабличнаяЧасть Цикл
					
					Если СтрокаТабЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС0
						И ЗначениеЗаполнено(СтрокаТабЧасти.ТоварКодТНВЭД) Тогда
						// Дополняем наименование товара информацией о коде ТН ВЭД
						СтрокаТабЧасти.НаименованиеТовара = СтрокаТабЧасти.НаименованиеТовара
							+ ", код ТН ВЭД " + СокрЛП(СтрокаТабЧасти.ТоварКодТНВЭД);
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщиеДанныеДляПечати.Вставить("КорректируемыеСчетаФактуры", КорректируемыеСчетаФактуры);
		
		ОбщиеДанныеДляПечати.Вставить("КППКонтрагента",  	СчетФактура.КППКонтрагента);
		
		КолонкиГруппировок = ""
		+"Номенклатура,"
		+"ТоварКод,"
		+"ТоварАртикул,"
		+"НаименованиеТовара,"
		+"НаименованиеЕдиницыИзмерения,"
		+"ЕдиницаИзмеренияКод,"
		+"ЦенаДоИзменения,"	
		+"ЦенаПослеИзменения,"
		+"СтавкаНДС,"
		+"СуммаВключаетНДС,"
		+"СтранаПроисхожденияКод,"
		+"ПредставлениеСтраны,"
		+"ПредставлениеГТД";
		
		КолонкиСуммирования = ""
		+"СуммаНДСДоИзменения,"
		+"СуммаНДСПослеИзменения,"
		+"СтоимостьСНДСДоИзменения,"
		+"СтоимостьСНДСПослеИзменения,"
		+"РазницаБезНДСУвеличение,"
		+"РазницаБезНДСУменьшение,"
		+"РазницаНДСУвеличение,"
		+"РазницаНДСУменьшение,"
		+"РазницаСНДСУвеличение,"
		+"РазницаСНДСУменьшение,"
		+"СтоимостьБезНДСДоИзменения,"
		+"СтоимостьБезНДСПослеИзменения,"
		+"КоличествоДоИзменения,"
		+"КоличествоПослеИзменения";
		
		ОбщиеДанныеДляПечати.ТабличнаяЧасть.Свернуть(КолонкиГруппировок, КолонкиСуммирования);
		
		ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10, 0));
		НомерСтроки = 0;
		
		Для Каждого Строчка Из ОбщиеДанныеДляПечати.ТабличнаяЧасть Цикл
			
			НомерСтроки = НомерСтроки + 1;
			Строчка.НомерСтроки = НомерСтроки;
			
		КонецЦикла;		
		
		// заполнение колонок код и артикул
		ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
		
		Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить Тогда
			
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.ЗаполнитьЗначения("", "ТоварКод");
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");
			
		ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
			
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварКод");
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.ТоварАртикул.Имя = "ТоварКод";
			
		Иначе
			ОбщиеДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");
		КонецЕсли;
		
		ОбщиеДанныеДляПечати.Вставить("ДокументыОснования", СписокОснований);
		
	КонецЕсли;
	
	Возврат ОбщиеДанныеДляПечати;

КонецФункции

Функция ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокументаСтатус2(Ссылка) Экспорт
	
	// сбор данных для печати счета фактуры
	ДанныеДляПечати = СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(Ссылка, Ссылка);
	
	Если ДанныеДляПечати = Неопределено или ТипЗнч(ДанныеДляПечати) = Тип("Соответствие") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляПечати.ТабличнаяЧасть.ЗаполнитьЗначения(ДанныеДляПечати.СуммаВключаетНДС, "СуммаВключаетНДС");
	
	КорректируемыеСчетаФактуры = Новый ТаблицаЗначений;
	КорректируемыеСчетаФактуры.Колонки.Добавить("НомерСчетаФактуры");
	КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаСчетаФактуры");
	КорректируемыеСчетаФактуры.Колонки.Добавить("УчитыватьИсправлениеИсходногоДокумента");
	КорректируемыеСчетаФактуры.Колонки.Добавить("НомерИсправления");
	КорректируемыеСчетаФактуры.Колонки.Добавить("ДатаИсправления");
	ДанныеДляПечати.Вставить("КорректируемыеСчетаФактуры", КорректируемыеСчетаФактуры);
	
	// заполнение колонок код и артикул
	ДополнительнаяКолонкаПечатныхФормДокументов = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();

	Если ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.НеВыводить Тогда

		ДанныеДляПечати.ТабличнаяЧасть.ЗаполнитьЗначения("", "ТоварКод");
		ДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");

	ИначеЕсли ДополнительнаяКолонкаПечатныхФормДокументов = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда

		ДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварКод");
		ДанныеДляПечати.ТабличнаяЧасть.Колонки.ТоварАртикул.Имя = "ТоварКод";

	Иначе
		ДанныеДляПечати.ТабличнаяЧасть.Колонки.Удалить("ТоварАртикул");
	КонецЕсли;
	
	ИсправляемыйДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(Ссылка, Истина);
	РеквизитыПередаточныхДокументов = "Универсальный передаточный документ " + РеквизитыПервичногоДокумента(ИсправляемыйДокументРеализации);
	
	ДанныеДляПечати.Вставить("РеквизитыПередаточныхДокументов", РеквизитыПередаточныхДокументов);
	
	ДанныеДляПечати.Вставить("СтатусУКД", 				2);
	ДанныеДляПечати.Вставить("Основание", 				Строка(Ссылка.ДоговорКонтрагента));
	
	Возврат ДанныеДляПечати;
	
КонецФункции

Функция СобратьДанныеДляПечатиКорректировочногоСчетаФактуры(ТекущееОснование, Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДокументОснование", ТекущееОснование);
	Запрос.УстановитьПараметр("ПустойКонтрагент", Справочники.Контрагенты.ПустаяСсылка());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Организация,
	|	КорректировкаРеализации.Организация КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузоотправитель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА ""он же""
	|		ИНАЧЕ КорректировкаРеализации.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	КорректировкаРеализации.Контрагент КАК Покупатель,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КорректировкаРеализации.Грузополучатель, &ПустойКонтрагент) = &ПустойКонтрагент
	|			ТОГДА КорректировкаРеализации.Контрагент
	|		ИНАЧЕ КорректировкаРеализации.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	КорректировкаРеализации.СуммаДокумента КАК Сумма,
	|	КорректировкаРеализации.ВалютаДокумента КАК Валюта,
	|	КорректировкаРеализации.УчитыватьНДС КАК УчитыватьНДС,
	|	КорректировкаРеализации.СуммаВключаетНДС КАК СуммаВключаетНДС,
	|	КорректировкаРеализации.АдресДоставки КАК АдресДоставки,
	|	КорректировкаРеализации.Подразделение КАК Подразделение,
	|	КорректировкаРеализации.ДоговорКонтрагента.ВидАгентскогоДоговора КАК ВидАгентскогоДоговора
	|ПОМЕСТИТЬ ВТИсходныйДокумент
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИсходныйДокумент.Организация,
	|	ВТИсходныйДокумент.Покупатель,
	|	ВТИсходныйДокумент.Грузополучатель,
	|	ВТИсходныйДокумент.Поставщик,
	|	ВТИсходныйДокумент.Грузоотправитель,
	|	ВТИсходныйДокумент.Сумма,
	|	ВТИсходныйДокумент.Валюта,
	|	ВТИсходныйДокумент.УчитыватьНДС,
	|	ВТИсходныйДокумент.СуммаВключаетНДС,
	|	ВТИсходныйДокумент.Подразделение,
	|	ВТИсходныйДокумент.ВидАгентскогоДоговора
	|ИЗ
	|	ВТИсходныйДокумент КАК ВТИсходныйДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Поставщик = Шапка.Поставщик;
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		
		ДанныеДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "Дата,Исправление,ВидСчетаФактуры,НомерИсправления,СчетФактураБезНДС,КППКонтрагента,ВидСчетаФактуры,
																			|НомерИсправляемогоКорректировочногоДокумента,ДатаИсправляемогоКорректировочногоДокумента");
		ДанныеДокумента.Вставить("Номер",ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка));
		
	Иначе
		
		ДанныеДокумента = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(Ссылка, "НомерИсправления,Дата,Организация,Контрагент,ДоговорКонтрагента");
		
		ДанныеДокумента.Вставить("Номер",                            ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка));
		ДанныеДокумента.Вставить("ВидСчетаФактуры",                  Перечисления.ВидСчетаФактурыВыставленного.Корректировочный);
		ДанныеДокумента.Вставить("Исправление",                      Ложь);
		ДанныеДокумента.Вставить("НомерИсправления",                 "");
		ДанныеДокумента.Вставить("НомерИсправляемогоКорректировочногоДокумента", "");
		ДанныеДокумента.Вставить("ДатаИсправляемогоКорректировочногоДокумента",  '00010101');
		ДанныеДокумента.Вставить("Продавец",                         ДанныеДокумента.Контрагент);
		ДанныеДокумента.Вставить("КППКонтрагента",                   "");
		ДанныеДокумента.Вставить("СчетФактураБезНДС",                Ложь);

	КонецЕсли;
		
	ДанныеДляПечати = Новый Структура();

	ДанныеДляПечати.Вставить("Организация",       	Шапка.Организация);
	ДанныеДляПечати.Вставить("Поставщик",         	Поставщик);
	ДанныеДляПечати.Вставить("Валюта",			  	Шапка.Валюта);
	ДанныеДляПечати.Вставить("Покупатель",        	Шапка.Покупатель);
	ДанныеДляПечати.Вставить("Грузополучатель",    	Шапка.Грузополучатель);
	ДанныеДляПечати.Вставить("СуммаВключаетНДС",  	Шапка.СуммаВключаетНДС);
	ДанныеДляПечати.Вставить("Подразделение",     	Шапка.Подразделение);
	ДанныеДляПечати.Вставить("ВидАгентскогоДоговора",Шапка.ВидАгентскогоДоговора);	
	ДанныеДляПечати.Вставить("ДатаСчетФактуры",		ДанныеДокумента.Дата);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры",		ДанныеДокумента.ВидСчетаФактуры);
	ДанныеДляПечати.Вставить("Ссылка",         		Ссылка);
	ДанныеДляПечати.Вставить("Номер",               ?(ДанныеДокумента.Исправление, ДанныеДокумента.НомерИсправляемогоКорректировочногоДокумента, ДанныеДокумента.Номер));
	ДанныеДляПечати.Вставить("Дата",                ?(ДанныеДокумента.Исправление, ДанныеДокумента.ДатаИсправляемогоКорректировочногоДокумента, ДанныеДокумента.Дата));
	ДанныеДляПечати.Вставить("НомерИсправления",    ?(ДанныеДокумента.Исправление, ДанныеДокумента.НомерИсправления, "--"));
	ДанныеДляПечати.Вставить("ДатаИсправления",     ?(ДанныеДокумента.Исправление, ДанныеДокумента.Дата, '00010101'));
	ДанныеДляПечати.Вставить("ДатаСчетФактуры",     ДанныеДокумента.Дата);
	ДанныеДляПечати.Вставить("СчетФактураБезНДС",   ДанныеДокумента.СчетФактураБезНДС);
	ДанныеДляПечати.Вставить("КППКонтрагента",      ДанныеДокумента.КППКонтрагента);
	ДанныеДляПечати.Вставить("ВидСчетаФактуры",     ДанныеДокумента.ВидСчетаФактуры);	
	
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Организация, ДанныеДокумента.Дата);
	
	ДанныеДляПечати.Вставить(?(Ссылка.Организация.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо, "ФИОПБОЮЛ", "ФИОРуководителя"), Руководители.Руководитель);
	ДанныеДляПечати.Вставить("ФИОГлавногоБухгалтера", Руководители.ГлавныйБухгалтер);
	ДанныеДляПечати.Вставить("РуководительФизЛицо", Руководители.РуководительФизЛицо);
	
	Если ТипЗнч(ТекущееОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		ДанныеДляПечати.Вставить("Штрихкод",     	 ШтрихкодированиеПечатныхФорм.ЧисловойКодПоСсылке(ТекущееОснование));
	КонецЕсли;//МЮ.Конец
		
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Ссылка,
	|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|	КорректировкаРеализацииТовары.Номенклатура,
	|	ВЫРАЗИТЬ(КорректировкаРеализацииТовары.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеТовара,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры КАК Серия,
	|	КорректировкаРеализацииТовары.ХарактеристикаНоменклатуры КАК Характеристика,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения КАК НаименованиеЕдиницыИзмерения,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	ИсходныйДокумент.СуммаВключаетНДС,
	|	КорректировкаРеализацииТовары.СуммаНДС КАК СуммаНДСПослеИзменения,
	|	КорректировкаРеализацииТовары.СуммаНДСДоИзменения,
	|	КорректировкаРеализацииТовары.Количество КАК КоличествоПослеИзменения,
	|	КорректировкаРеализацииТовары.КоличествоДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаРеализацииТовары.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|						ТОГДА (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) / КорректировкаРеализацииТовары.Количество
	|					ИНАЧЕ КорректировкаРеализацииТовары.Сумма / КорректировкаРеализацииТовары.Количество
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаПослеИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаРеализацииТовары.КоличествоДоИзменения = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|						ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения) / КорректировкаРеализацииТовары.КоличествоДоИзменения
	|					ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения / КорректировкаРеализацииТовары.КоличествоДоИзменения
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК ЦенаДоИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма
	|	КОНЕЦ КАК СтоимостьБезНДСПослеИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения
	|	КОНЕЦ КАК СтоимостьБезНДСДоИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС
	|	КОНЕЦ КАК СтоимостьСНДСПослеИзменения,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|	КОНЕЦ КАК СтоимостьСНДСДоИзменения,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС > 0
	|			ТОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУменьшение,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС < 0
	|			ТОГДА (КорректировкаРеализацииТовары.СуммаНДСДоИзменения - КорректировкаРеализацииТовары.СуммаНДС) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РазницаНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) > 0
	|						ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма > 0
	|					ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаБезНДСУменьшение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС) < 0
	|						ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаНДС)) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма < 0
	|					ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаБезНДСУвеличение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма > 0
	|						ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС) > 0
	|					ТОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаСНДСУменьшение,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма < 0
	|						ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения - КорректировкаРеализацииТовары.Сумма) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС) < 0
	|					ТОГДА (КорректировкаРеализацииТовары.СуммаДоИзменения + КорректировкаРеализацииТовары.СуммаНДСДоИзменения - (КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС)) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ КАК РазницаСНДСУвеличение,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК ЕдиницаИзмеренияКод,
	|	1 КАК НомерТЧ,
	|	КорректировкаРеализацииТовары.Номенклатура.Код КАК ТоварКод,
	|	КорректировкаРеализацииТовары.Номенклатура.Артикул КАК ТоварАртикул,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения.Код КАК СтранаПроисхожденияКод,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения.Наименование КАК ПредставлениеСтраны,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД.Код КАК ПредставлениеГТД,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения КАК СтранаПроисхождения
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары,
	|	ВТИсходныйДокумент КАК ИсходныйДокумент
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &ДокументОснование
	|	И (КорректировкаРеализацииТовары.Количество <> КорректировкаРеализацииТовары.КоличествоДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.Сумма <> КорректировкаРеализацииТовары.СуммаДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.СуммаНДС <> КорректировкаРеализацииТовары.СуммаНДСДоИзменения
	|			ИЛИ КорректировкаРеализацииТовары.Цена <> КорректировкаРеализацииТовары.ЦенаДоИзменения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализацииУслуги.Ссылка,
	|	КорректировкаРеализацииУслуги.НомерСтроки,
	|	КорректировкаРеализацииУслуги.Номенклатура,
	|	ВЫРАЗИТЬ(КорректировкаРеализацииУслуги.Содержание КАК СТРОКА(1000)),
	|	NULL,
	|	NULL,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков,
	|	КорректировкаРеализацииУслуги.СтавкаНДС,
	|	ИсходныйДокумент.СуммаВключаетНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДС,
	|	КорректировкаРеализацииУслуги.СуммаНДСДоИзменения,
	|	КорректировкаРеализацииУслуги.Количество,
	|	КорректировкаРеализацииУслуги.КоличествоДоИзменения,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаРеализацииУслуги.Количество = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|						ТОГДА (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) / КорректировкаРеализацииУслуги.Количество
	|					ИНАЧЕ КорректировкаРеализацииУслуги.Сумма / КорректировкаРеализацииУслуги.Количество
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА КорректировкаРеализацииУслуги.КоличествоДоИзменения = 0
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|						ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения) / КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|					ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения / КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|				КОНЕЦ
	|		КОНЕЦ КАК ЧИСЛО(15, 2)),
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.Сумма
	|		ИНАЧЕ КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения
	|		ИНАЧЕ КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС > 0
	|			ТОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС < 0
	|			ТОГДА (КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - КорректировкаРеализацииУслуги.СуммаНДС) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) > 0
	|						ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма > 0
	|					ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС) < 0
	|						ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма - КорректировкаРеализацииУслуги.СуммаНДС)) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма < 0
	|					ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма > 0
	|						ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС) > 0
	|					ТОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС)
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИсходныйДокумент.СуммаВключаетНДС
	|			ТОГДА ВЫБОР
	|					КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма < 0
	|						ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения - КорректировкаРеализацииУслуги.Сумма) * -1
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС) < 0
	|					ТОГДА (КорректировкаРеализацииУслуги.СуммаДоИзменения + КорректировкаРеализацииУслуги.СуммаНДСДоИзменения - (КорректировкаРеализацииУслуги.Сумма + КорректировкаРеализацииУслуги.СуммаНДС)) * -1
	|				ИНАЧЕ 0
	|			КОНЕЦ
	|	КОНЕЦ,
	|	КорректировкаРеализацииУслуги.Номенклатура.ЕдиницаХраненияОстатков.ЕдиницаПоКлассификатору.Код,
	|	2,
	|	КорректировкаРеализацииУслуги.Номенклатура.Код,
	|	КорректировкаРеализацииУслуги.Номенклатура.Артикул,
	|	"""",
	|	"""",
	|	"""",
	|	NULL
	|ИЗ
	|	Документ.КорректировкаРеализации.Услуги КАК КорректировкаРеализацииУслуги,
	|	ВТИсходныйДокумент КАК ИсходныйДокумент
	|ГДЕ
	|	КорректировкаРеализацииУслуги.Ссылка = &ДокументОснование
	|	И (КорректировкаРеализацииУслуги.Количество <> КорректировкаРеализацииУслуги.КоличествоДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.Сумма <> КорректировкаРеализацииУслуги.СуммаДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.СуммаНДС <> КорректировкаРеализацииУслуги.СуммаНДСДоИзменения
	|			ИЛИ КорректировкаРеализацииУслуги.Цена <> КорректировкаРеализацииУслуги.ЦенаДоИзменения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерТЧ,
	|	НомерСтроки";
	
	Если ДанныеДокумента.Исправление Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДоИзменения", "ДоКорректировки");
	КонецЕсли;
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Колонка Из ТаблицаРезультата.Колонки Цикл
		Колонка.Имя = СтрЗаменить(Колонка.Имя, "ДоКорректировки", "ДоИзменения");
	КонецЦикла;
	
	Для Каждого Строчка Из ТаблицаРезультата Цикл
		
		Строчка.НаименованиеТовара = СокрЛП(Строчка.НаименованиеТовара) + ФормированиеПечатныхФорм.ПредставлениеСерий(Строчка); 
		
		Если Строка(Строчка.ПредставлениеСтраны) = "Россия" 
			ИЛИ Строка(Строчка.ПредставлениеСтраны) = "Российская Федерация"
			ИЛИ Строчка.СтранаПроисхождения = Справочники.КлассификаторСтранМира.РОССИЯ Тогда			
			
			Строчка.ПредставлениеСтраны    = "--";
			Строчка.СтранаПроисхожденияКод = "--";
			Строчка.ПредставлениеГТД       = "--";
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляПечати.Вставить("ТабличнаяЧасть", ТаблицаРезультата); 
	
	Возврат ДанныеДляПечати;

КонецФункции

Функция НайтиПодчиненныйСчетФактуру(Знач ДокументСсылка, ВидДокумента = "СчетФактураВыданный", Отбор = Неопределено, ИсключитьИзВыборкиСФ = Неопределено, 
	МетаданныеОснования = Неопределено) Экспорт

	Если не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат Неопределено;
	Иначе
		
		Если МетаданныеОснования = Неопределено Тогда
			МетаданныеОснования = ДокументСсылка.Метаданные();
		КонецЕсли; 
		
		Если МетаданныеОснования.Реквизиты.Найти("ИспользоватьДокументРасчетовКакСчетФактуру") <> Неопределено
			И МетаданныеОснования.Реквизиты.Найти("РасчетныйДокумент") <> Неопределено 
			И ДокументСсылка.ИспользоватьДокументРасчетовКакСчетФактуру Тогда
			
			Если не ЗначениеЗаполнено(ДокументСсылка.РасчетныйДокумент) Тогда
				Возврат Неопределено;
			Иначе
				
				Если ТипЗнч(ДокументСсылка.РасчетныйДокумент) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
					И Не ДокументСсылка.РасчетныйДокумент.ПокупателемВыставляетсяСчетФактураНаВозврат Тогда
					
					ДокументСсылка = ДокументСсылка.РасчетныйДокумент.Сделка;
					МетаданныеОснования = ДокументСсылка.Метаданные();
					
					Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
						Возврат Неопределено;
					КонецЕсли;
					
				Иначе
					
					ДокументСсылка = ДокументСсылка.РасчетныйДокумент;
					МетаданныеОснования = ДокументСсылка.Метаданные();
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	НайденныйДокумент = Неопределено;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СФ.Ссылка
	|ПОМЕСТИТЬ ВрмТбл
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.Авансы КАК Авансы
	|		ПО СФ.Ссылка = Авансы.Ссылка
	|ГДЕ
	|	СФ.ДокументОснование = &ДокументСсылка";
	
	Если не ВидДокумента = "СчетФактураВыданный" Тогда
		Запрос.Текст = СтрЗаменитЬ(Запрос.Текст,"СчетФактураВыданный", ВидДокумента);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ИсключитьИзВыборкиСФ) Тогда
		
		Запрос.УстановитьПараметр("ИсключитьИзВыборкиСФ", ИсключитьИзВыборкиСФ);
		
		Если ТипЗнч(ИсключитьИзВыборкиСФ) = Тип("Массив") Тогда
			Запрос.Текст = Запрос.Текст + "
				|	И НЕ СФ.Ссылка В (&ИсключитьИзВыборкиСФ)
				|";
		Иначе
			Запрос.Текст = Запрос.Текст + "
				|	И НЕ СФ.Ссылка = &ИсключитьИзВыборкиСФ
				|";
		КонецЕсли;
		
	КонецЕсли; 
	
	Если не Отбор = Неопределено Тогда
		
		Для каждого ЭлементОтбора Из Отбор Цикл
			
			Если ТипЗнч(ЭлементОтбора.Значение) = Тип("Булево") Тогда
				Запрос.Текст = Запрос.Текст + "
					|	И " + ?(ЭлементОтбора.Значение, " ", " НЕ ") + " СФ.Ссылка." + ЭлементОтбора.Ключ;
			ИначеЕсли ЭлементОтбора.Ключ = "СтавкиНДС" Тогда
			
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				Запрос.Текст = Запрос.Текст + "
					|	И Авансы.СтавкаНДС В (&" + ЭлементОтбора.Ключ + ")";
				
			ИначеЕсли ЭлементОтбора.Ключ = "СчетНаОплату" 
						И ВидДокумента = "СчетФактураВыданный" Тогда
			
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				Запрос.Текст = Запрос.Текст + "
					|	И Авансы.СчетНаОплату В (&" + ЭлементОтбора.Ключ + ")";
				
			Иначе
				
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("Массив") 
					ИЛИ ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					Запрос.Текст = Запрос.Текст  +  "
					|	И СФ.Ссылка." + ЭлементОтбора.Ключ + " В (&" + ЭлементОтбора.Ключ + ")";
				Иначе
					Запрос.Текст = Запрос.Текст  +  "
					|	И СФ.Ссылка." + ЭлементОтбора.Ключ + " = &" + ЭлементОтбора.Ключ;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Запрос.Текст = Запрос.Текст + ";";
	
	Запрос.Текст = Запрос.Текст + "
	|ВЫБРАТЬ Ссылка
	| ИЗ ВрмТбл
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка.ПометкаУдаления,
	|	Ссылка.Проведен УБЫВ,
	|	Ссылка.Дата";
	
	ВыборкаИзЗапроса = Запрос.Выполнить().Выбрать();

	Если ВыборкаИзЗапроса.Следующий() Тогда
		НайденныйДокумент = ВыборкаИзЗапроса.Ссылка;
	КонецЕсли;

	Возврат НайденныйДокумент;

КонецФункции

Функция РеквизитыПервичногоДокумента(Документ, ТЧ = "", Строка = 0, УказыватьВид = Ложь) 
	
	НомерНаПечать = "";
	ДатаНаПечать = "";
	МетаданныеДокумента = Документ.Метаданные();
	
	//Проверим дату и номер первичного документа в табличной части
	Если (ЗначениеЗаполнено(ТЧ)) и (Строка > 0) Тогда
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("НомерВходящегоДокумента", МетаданныеДокумента, ТЧ) И
			ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ДатаВходящегоДокумента", МетаданныеДокумента, ТЧ) Тогда
			
			Если НЕ Документ[ТЧ].Количество() < Строка-1 Тогда
				
				НомерНаПечать = Документ[ТЧ][Строка-1].НомерВходящегоДокумента;
				ДатаНаПечать = Формат(Документ[ТЧ][Строка-1].ДатаВходящегоДокумента, "ДФ=дд.ММ.гггг");
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Проверим дату и номер первичного документа в шапке
	Если НЕ ЗначениеЗаполнено(НомерНаПечать) И НЕ ЗначениеЗаполнено(ДатаНаПечать) Тогда
		
		Если МетаданныеДокумента.Реквизиты.Найти("НомерВходящегоДокумента") <> Неопределено И
			МетаданныеДокумента.Реквизиты.Найти("ДатаВходящегоДокумента") <> Неопределено Тогда
			
			НомерНаПечать = Документ.НомерВходящегоДокумента;
			ДатаНаПечать = Формат(Документ.ДатаВходящегоДокумента, "ДФ=дд.ММ.гггг");
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если дата и номер первичного документа не указаны или не заполнены, используем дату и номер регистрации
	Если НЕ ЗначениеЗаполнено(НомерНаПечать) Тогда
		НомерНаПечать = ОбщегоНазначения.ПолучитьНомерНаПечать(Документ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаНаПечать) Тогда
		ДатаНаПечать = Формат(Документ.Дата, "ДФ=дд.ММ.гггг");
	КонецЕсли; 
	
	УказыватьПервичныйСчетФактуруВОснованииКоррСчФ = Константы.УказыватьПервичныйСчетФактуруВОснованииКоррСчФ.Получить();
	
	Если ЗначениеЗаполнено(УказыватьПервичныйСчетФактуруВОснованииКоррСчФ) Тогда
		
		Если ЗначениеЗаполнено(Документ) Тогда
			
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
				
				Если  Документ.Дата>=УказыватьПервичныйСчетФактуруВОснованииКоррСчФ Тогда
					
					ЗапросСчетаФактуры = Новый Запрос();
					ЗапросСчетаФактуры.Текст = "ВЫБРАТЬ
					                           |	СчетФактураВыданный.Ссылка
					                           |ИЗ
					                           |	Документ.СчетФактураВыданный КАК СчетФактураВыданный
					                           |ГДЕ
					                           |	НЕ СчетФактураВыданный.ПометкаУдаления
					                           |	И СчетФактураВыданный.ДокументОснование = &Реализация";
					
					ЗапросСчетаФактуры.УстановитьПараметр("Реализация", Документ);
					
					Результат = ЗапросСчетаФактуры.Выполнить().Выбрать();
					
					Если Результат.Следующий() Тогда
						
						НомерНаПечать = ОбщегоНазначения.ПолучитьНомерНаПечать(Результат.Ссылка);
			            ДатаНаПечать = Формат(Результат.Ссылка.Дата, "ДФ=дд.ММ.гггг"); 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РеквизитыПервичногоДокумента = "№ "+ НомерНаПечать + " от " + ДатаНаПечать;
	
	Если УказыватьВид Тогда
		РеквизитыПервичногоДокумента = МетаданныеДокумента.Синоним + " " + РеквизитыПервичногоДокумента;
	КонецЕсли;
	
	Возврат РеквизитыПервичногоДокумента;
КонецФункции

Функция ПечатьУКД(ДанныеДляПечати, ТабДокумент = Неопределено) Экспорт//МЮ.Добавлена Функция(ПечатьУКД)
	
	Таблица = ДанныеДляПечати.ТабличнаяЧасть;
	
	СуммаУменьшения = Таблица.Итог("РазницаБезНДСУменьшение") + Таблица.Итог("РазницаСНДСУменьшение") + Таблица.Итог("РазницаНДСУменьшение");
	СуммаУвеличения = Таблица.Итог("РазницаБезНДСУвеличение") + Таблица.Итог("РазницаСНДСУвеличение") + Таблица.Итог("РазницаНДСУвеличение");
	
	Если СуммаУменьшения = 0 И СуммаУвеличения = 0 Тогда
		
		ТекстСообщения = "Печать универсального корректировочного документа без изменения суммовых показателей не возможна!";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
		
	КонецЕсли;
	
	Если ТабДокумент = Неопределено Тогда		
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		// Устанавливаем параметры печати и колонтитулы
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДокумент.ПолеСверху = 12;
		ТабДокумент.ПолеСлева  = 0;
		ТабДокумент.ПолеСнизу  = 0;
		ТабДокумент.ПолеСправа = 0;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УниверсальныйКорректировочныйДокумент";
		
	КонецЕсли;
	
	//+Гавриленков В. 25.03.2026 #UT10-5782
	Если ДанныеДляПечати.Дата >= Дата(2026,4,1) Тогда        
		
		Макет = ПолучитьМакет("УниверсальныйКорректировочныйДокумент26");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
		
	//-Гавриленков В. 25.03.2026 #UT10-5782
	ИначеЕсли ДанныеДляПечати.Дата >=Дата(2024,10,1) Тогда        
		
		Макет = ПолучитьМакет("УниверсальныйКорректировочныйДокумент1096");
		ДанныеДляПечати.Вставить("ВерсияПостановления", "1096");
		
	ИначеЕсли ДанныеДляПечати.Дата >=Дата(2022,11,01) Тогда
		Макет = ПолучитьМакет("УниверсальныйКорректировочныйДокумент534");
	Иначе
		Макет = ПолучитьМакет("УниверсальныйКорректировочныйДокумент981");
	КонецЕсли;
	
	ВывестиКорректировочныйСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	ВывестиПодвалУниверсальногоКорректировочногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати);
	
	Возврат ТабДокумент;

КонецФункции

Процедура ВывестиКорректировочныйСчетФактуруВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати) Экспорт
	
	Дата = ДанныеДляПечати.ДатаСчетФактуры;
	ЭтоПечатьУКД = ДанныеДляПечати.Свойство("СтатусУКД");
	
	СведенияОбПокупателе	  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, Дата);
	СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Грузополучатель, Дата); 
	СведенияОПоставщике		  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, Дата);
	
	СведенияОбПодразделенииПокупателя = Неопределено;
	
	Если ТипЗнч(ДанныеДляПечати.Покупатель) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ДанныеДляПечати.Покупатель) Тогда
		
		РеквизитыПокупателя = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДанныеДляПечати.Покупатель, "ГоловнойКонтрагент");
		
		Если ЗначениеЗаполнено(РеквизитыПокупателя.ГоловнойКонтрагент) Тогда
			
			СведенияОбПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(РеквизитыПокупателя.ГоловнойКонтрагент, Дата);
			СведенияОбПодразделенииПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, Дата);	
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Выводим шапку   
	ИндексПодразделения = 0;
	
	Если ДанныеДляПечати.Свойство("ВерсияПостановления") И ДанныеДляПечати.ВерсияПостановления = "1096" Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокДокумента");
		ОбластьМакета.Параметры.Номер = ДанныеДляПечати.Номер + ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, "");
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеДляПечати.Дата, "ДЛФ=ДД; ДП=--");
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = ДанныеДляПечати.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = Формат(ДанныеДляПечати.ДатаИсправления, "ДЛФ=ДД; ДП=--");  
		
		Если ДанныеДляПечати.Свойство("Штрихкод") И ЗначениеЗаполнено(ДанныеДляПечати.Штрихкод) Тогда
			
			Для Каждого ИмяРисунка Из ОбластьМакета.Рисунки Цикл
				
				Если ОбластьМакета.Рисунки.Штрихкод.Имя = "Штрихкод" Тогда
					
					Если РаботаСТорговымОборудованием.ПроверитьШтрихКод(ДанныеДляПечати.Штрихкод,ПланыВидовХарактеристик.ТипыШтрихкодов.Code128) Тогда
						
						Попытка
							
							ОбластьМакета.Рисунки.Штрихкод.Объект.ТипКода   = 4;
							ОбластьМакета.Рисунки.Штрихкод.Объект.Сообщение = СокрЛП(ДанныеДляПечати.Штрихкод);
							
						Исключение
						КонецПопытки;
						
					Иначе
						
						ТекстСообщения = "У документа штрихкод не задан или имеет неверный формат!";
						Сообщить(ТекстСообщения,СтатусСообщения.БезСтатуса);
						
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если ЭтоПечатьУКД Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснования"); 
			
			Если ДанныеДляПечати.КорректируемыеСчетаФактуры.Количество()>0 Тогда
				
				Основание = ДанныеДляПечати.КорректируемыеСчетаФактуры[0];  
				ОбластьМакета.Параметры.НомерОснования 				= Основание.НомерСчетаФактуры + ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, ""); 
				ОбластьМакета.Параметры.ДатаОсновнания  			= Формат(Основание.ДатаСчетаФактуры, "ДЛФ=ДД; ДП=--");
				ОбластьМакета.Параметры.НомерИсправленияОснования 	= Основание.НомерИсправления;
				ОбластьМакета.Параметры.ДатаИсправленияОснования  	= Формат(Основание.ДатаИсправления, "ДЛФ=ДД; ДП=--");
				
			Иначе
				
				ОбластьМакета.Параметры.НомерОснования 				= "--";
				ОбластьМакета.Параметры.ДатаОсновнания  			= "--";
				ОбластьМакета.Параметры.НомерИсправленияОснования 	= "--";
				ОбластьМакета.Параметры.ДатаИсправленияОснования  	= "--";
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета); 
		
		Иначе     
			
			ОбластьМакета = Макет.ПолучитьОбласть("ОбластьОснований");  
			
			Для Каждого ОснованиеСчетаФактуры Из ДанныеДляПечати.КорректируемыеСчетаФактуры Цикл
				
				РеквизитыОснований = РеквизитыОснований + ?(РеквизитыОснований = "", "", ", ") 
				+ "№ " + ОснованиеСчетаФактуры.НомерСчетаФактуры 
				+ ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, "")
				+ " от " + Формат(ОснованиеСчетаФактуры.ДатаСчетаФактуры, "ДЛФ=ДД; ДП=--") 
				+ ", с учетом исправления № "
				+ ОснованиеСчетаФактуры.НомерИсправления + " от " + Формат(ОснованиеСчетаФактуры.ДатаИсправления, "ДЛФ=ДД; ДП=--");
				
			КонецЦикла; 
			
			ОбластьМакета.Параметры.РеквизитыОснований = РеквизитыОснований;
			
			ТабДокумент.Вывести(ОбластьМакета); 
			
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");  
		
		ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
		
		Если НЕ (ДанныеДляПечати.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент) Тогда
			
			КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
			
			Если ЗначениеЗаполнено(КПП) Тогда
				КПП = "/" + КПП;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ИННКПППродавца = ?(ЭтоПечатьУКД, "", "ИНН/КПП продавца: ")
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
			
			Если ЗначениеЗаполнено(КПП) Тогда
				КПП = "/" + КПП;
			КонецЕсли;
			ОбластьМакета.Параметры.ИННКПППродавца = ""
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
			
		Иначе
			ОбластьМакета.Параметры.ИННКПППродавца = "--"
		КонецЕсли;
		
	Иначе
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		
		ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
		
		Если НЕ (ДанныеДляПечати.ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент) Тогда
			
			КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
			
			Если ЗначениеЗаполнено(КПП) Тогда
				КПП = "/" + КПП;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ИННКПППродавца = ?(ЭтоПечатьУКД, "", "ИНН/КПП продавца: ")
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
			
			Если ЗначениеЗаполнено(КПП) Тогда
				КПП = "/" + КПП;
			КонецЕсли;
			
			ОбластьМакета.Параметры.ИННКПППродавца = ""
			+ ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь) + КПП;
			
		Иначе
			ОбластьМакета.Параметры.ИННКПППродавца = "--"
		КонецЕсли;
		
		ОбластьМакета.Параметры.Номер = ДанныеДляПечати.Номер + ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, "");
		ОбластьМакета.Параметры.Дата  = Формат(ДанныеДляПечати.Дата, "ДЛФ=ДД; ДП=--");
		ОбластьМакета.Параметры.НомерИсправленияКорректировочного = ДанныеДляПечати.НомерИсправления;
		ОбластьМакета.Параметры.ДатаИсправленияКорректировочного = Формат(ДанныеДляПечати.ДатаИсправления, "ДЛФ=ДД; ДП=--");
		
		РеквизитыОснований = "";
		
		Если ЭтоПечатьУКД Тогда
			
			Если ДанныеДляПечати.КорректируемыеСчетаФактуры.Количество() > 0 Тогда
				
				Основание = ДанныеДляПечати.КорректируемыеСчетаФактуры[0];  
				ОбластьМакета.Параметры.НомерОснования 				= Основание.НомерСчетаФактуры + ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, ""); 
				ОбластьМакета.Параметры.ДатаОсновнания  			= Формат(Основание.ДатаСчетаФактуры, "ДЛФ=ДД; ДП=--");
				ОбластьМакета.Параметры.НомерИсправленияОснования 	= Основание.НомерИсправления;
				ОбластьМакета.Параметры.ДатаИсправленияОснования  	= Формат(Основание.ДатаИсправления, "ДЛФ=ДД; ДП=--");
				
			Иначе
				
				ОбластьМакета.Параметры.НомерОснования 				= "--";
				ОбластьМакета.Параметры.ДатаОсновнания  			= "--";
				ОбластьМакета.Параметры.НомерИсправленияОснования 	= "--";
				ОбластьМакета.Параметры.ДатаИсправленияОснования  	= "--";
				
			КонецЕсли;
			
		Иначе
			
			Для Каждого ОснованиеСчетаФактуры Из ДанныеДляПечати.КорректируемыеСчетаФактуры Цикл
				
				РеквизитыОснований = РеквизитыОснований + ?(РеквизитыОснований = "", "", ", ") 
				+ "№ " + ОснованиеСчетаФактуры.НомерСчетаФактуры 
				+ ?(ИндексПодразделения <> 0, "/" + ИндексПодразделения, "")
				+ " от " + Формат(ОснованиеСчетаФактуры.ДатаСчетаФактуры, "ДЛФ=ДД; ДП=--") 
				+ ", с учетом исправления № "
				+ ОснованиеСчетаФактуры.НомерИсправления + " от " + Формат(ОснованиеСчетаФактуры.ДатаИсправления, "ДЛФ=ДД; ДП=--");
				
			КонецЦикла;
			
			ОбластьМакета.Параметры.РеквизитыОснований = РеквизитыОснований;
			
		КонецЕсли; 
		
		Если ДанныеДляПечати.Свойство("Штрихкод") И ЗначениеЗаполнено(ДанныеДляПечати.Штрихкод) Тогда
			
			Для Каждого ИмяРисунка Из ОбластьМакета.Рисунки Цикл
				
				Если ОбластьМакета.Рисунки.Штрихкод.Имя = "Штрихкод" Тогда
					
					Если РаботаСТорговымОборудованием.ПроверитьШтрихКод(ДанныеДляПечати.Штрихкод,ПланыВидовХарактеристик.ТипыШтрихкодов.Code128) Тогда
						
						Попытка
							
							ОбластьМакета.Рисунки.Штрихкод.Объект.ТипКода   = 4;
							ОбластьМакета.Рисунки.Штрихкод.Объект.Сообщение = СокрЛП(ДанныеДляПечати.Штрихкод);
							
						Исключение
						КонецПопытки;
						
					Иначе
						
						ТекстСообщения = "У документа штрихкод не задан или имеет неверный формат!";
						Сообщить(ТекстСообщения,СтатусСообщения.БезСтатуса);
						
					КонецЕсли;
					
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ОбластьМакета.Параметры.НаименованиеПродавца = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,  "ПолноеНаименование,");
	ОбластьМакета.Параметры.АдресПродавца = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике,  "ЮридическийАдрес,");
	ОбластьМакета.Параметры.НаименованиеПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ПолноеНаименование,");  

	Если ЗначениеЗаполнено(СведенияОГрузополучателе.ЮридическийАдресОбособленногоПодразделения) Тогда
		ОбластьМакета.Параметры.АдресПокупателя = СведенияОГрузополучателе.ЮридическийАдресОбособленногоПодразделения;	
	Иначе
		ОбластьМакета.Параметры.АдресПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ЮридическийАдрес,");
	КонецЕсли; 

	Если ЗначениеЗаполнено(ДанныеДляПечати.КППКонтрагента) Тогда
		КПП = ДанныеДляПечати.КППКонтрагента;
	ИначеЕсли СведенияОбПодразделенииПокупателя <> Неопределено Тогда
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПодразделенииПокупателя, "КПП,", Ложь);
	Иначе
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "КПП,", Ложь);
	КонецЕсли;		
		
	Если ЗначениеЗаполнено(КПП) Тогда
		КПП = "/" + КПП;
	КонецЕсли;
	
	ОбластьМакета.Параметры.ИННКПППокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ИНН,", Ложь) + КПП;
	
	Если ЭтоПечатьУКД Тогда
		СтрокаВалюта = "";
	Иначе
		СтрокаВалюта = "Валюта: наименование, код ";
	КонецЕсли;  
	
	ОбластьМакета.Параметры.Валюта = СтрокаВалюта + ?(ЗначениеЗаполнено(ДанныеДляПечати.Валюта), 
			ДанныеДляПечати.Валюта.НаименованиеПолное + ", " + ДанныеДляПечати.Валюта.Код, "");
			
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Если НЕ ЭтоПечатьУКД Тогда
		ВывестиРеквизитыКомиссионера(ДанныеДляПечати.Организация, ДанныеДляПечати.Поставщик, ДанныеДляПечати.Покупатель, Дата, Макет, ТабДокумент);
	КонецЕсли;
	
	ОбластьМакетаЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);

	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	ВыборкаТабличнойЧасти = ДанныеДляПечати.ТабличнаяЧасть;
	
	КоличествоСтраниц = 1;
	
	ИтогРазницаБезНДСУменьшение = 0;
	ИтогРазницаБезНДСУвеличение = 0;
	ИтогРазницаСНДСУменьшение   = 0;
	ИтогРазницаСНДСУвеличение   = 0;
	ИтогРазницаНДСУменьшение    = 0;
	ИтогРазницаНДСУвеличение    = 0;
				
	Для Каждого СтрокаТабличнойЧасти ИЗ ВыборкаТабличнойЧасти Цикл 
		
		// Порядок определения показателей при расчетной ставке НДС
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120
			ИЛИ СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118
			ИЛИ СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110
			//+Гавриленков В. 11.12.2025 #UT10-5574
			Или СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.НДС22_122 Тогда
			//-Гавриленков В. 11.12.2025 #UT10-5574
			
			СтрокаТабличнойЧасти.СтоимостьБезНДСДоИзменения = СтрокаТабличнойЧасти.СтоимостьСНДСДоИзменения;
			СтрокаТабличнойЧасти.СтоимостьБезНДСПослеИзменения = СтрокаТабличнойЧасти.СтоимостьСНДСПослеИзменения;
			
			СтрокаТабличнойЧасти.ЦенаДоИзменения = 0;
			СтрокаТабличнойЧасти.ЦенаПослеИзменения = 0;
						
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеЕдиницыИзмерения) Тогда
			
			СтрокаТабличнойЧасти.КоличествоДоИзменения    = 0;
			СтрокаТабличнойЧасти.КоличествоПослеИзменения = 0;
			СтрокаТабличнойЧасти.ЦенаДоИзменения          = 0;
			СтрокаТабличнойЧасти.ЦенаПослеИзменения       = 0;
			
		Иначе
			
			Если СтрокаТабличнойЧасти.КоличествоДоИзменения = 0 Тогда
				СтрокаТабличнойЧасти.ЦенаДоИзменения = 0;
			ИначеЕсли СтрокаТабличнойЧасти.ЦенаДоИзменения = 0 Тогда
				СтрокаТабличнойЧасти.ЦенаДоИзменения = Окр(СтрокаТабличнойЧасти.СтоимостьБезНДСДоИзменения / СтрокаТабличнойЧасти.КоличествоДоИзменения, 2);
			КонецЕсли;
			
			Если СтрокаТабличнойЧасти.КоличествоПослеИзменения = 0 Тогда
				СтрокаТабличнойЧасти.ЦенаПослеИзменения = 0;
			ИначеЕсли СтрокаТабличнойЧасти.ЦенаПослеИзменения = 0 Тогда
				СтрокаТабличнойЧасти.ЦенаПослеИзменения = Окр(СтрокаТабличнойЧасти.СтоимостьБезНДСПослеИзменения / СтрокаТабличнойЧасти.КоличествоПослеИзменения, 2);
			КонецЕсли;
			
			Если СтрокаТабличнойЧасти.КоличествоДоИзменения = 0 
				И СтрокаТабличнойЧасти.КоличествоПослеИзменения = 0 Тогда
				СтрокаТабличнойЧасти.НаименованиеЕдиницыИзмерения = "";
			КонецЕсли;
			
		КонецЕсли;
		
		ОбластьМакета.Параметры.Заполнить(СтрокаТабличнойЧасти);   
		
		Если ДанныеДляПечати.Свойство("ВерсияПостановления") И ДанныеДляПечати.ВерсияПостановления = "1096" Тогда
			
			ОбластьМакета.Параметры.НомерСтрокиУКД = СтрокаТабличнойЧасти.НомерСтроки;
			ОбластьМакета.Параметры.НомерСтроки = "--";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеТовара) Тогда
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.НаименованиеТовара;               
		Иначе
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = СтрокаТабличнойЧасти.Номенклатура;               
		КонецЕсли;
				
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.НаименованиеЕдиницыИзмерения) Тогда
			
			ОбластьМакета.Параметры.ЕдиницаИзмеренияКод = "--";
			ОбластьМакета.Параметры.НаименованиеЕдиницыИзмерения = "--";
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоДоИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.КоличествоПослеИзменения) Тогда
			ОбластьМакета.Параметры.КоличествоПослеИзменения = "--";
		КонецЕсли;	
		       		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаДоИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаДоИзменения = "--";
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(ОбластьМакета.Параметры.ЦенаПослеИзменения) Тогда
			ОбластьМакета.Параметры.ЦенаПослеИзменения = "--";
		КонецЕсли;	
		          		
		Если СтрокаТабличнойЧасти.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
			
			ОбластьМакета.Параметры.СтавкаНДС = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСДоИзменения = "без НДС";
			ОбластьМакета.Параметры.СуммаНДСПослеИзменения = "без НДС";
			ОбластьМакета.Параметры.РазницаНДСУвеличение = "--";
			ОбластьМакета.Параметры.РазницаНДСУменьшение = "--";
			
		КонецЕсли;
		
		Если ЭтоПечатьУКД Тогда
			
			Если ДанныеДляПечати.СтатусУКД = 2 Тогда
				
				ОбластьМакета.Параметры.СтавкаНДС 	= "--";
				ОбластьМакета.Параметры.Акциз 		= "--";
				ОбластьМакета.Параметры.СуммаНДСДоИзменения = "--";
				ОбластьМакета.Параметры.СуммаНДСПослеИзменения = "--";
				ОбластьМакета.Параметры.РазницаНДСУвеличение = "--";
				ОбластьМакета.Параметры.РазницаНДСУменьшение = "--";
				
			Иначе
				ОбластьМакета.Параметры.Акциз = "без акциза";
			КонецЕсли;
			
		КонецЕсли;		
		
		Попытка
			
			Если Не ТабДокумент.ПроверитьВывод(ОбластьМакета) Тогда 
				
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаЗаголовокТаблицы);
				КоличествоСтраниц = КоличествоСтраниц + 1;
				
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
		Исключение
			ТабДокумент.Вывести(ОбластьМакета);
		КонецПопытки;
				
		ИтогРазницаБезНДСУменьшение = ИтогРазницаБезНДСУменьшение + СтрокаТабличнойЧасти.РазницаБезНДСУменьшение;
		ИтогРазницаБезНДСУвеличение = ИтогРазницаБезНДСУвеличение + СтрокаТабличнойЧасти.РазницаБезНДСУвеличение;
		ИтогРазницаСНДСУменьшение   = ИтогРазницаСНДСУменьшение   + СтрокаТабличнойЧасти.РазницаСНДСУменьшение;
		ИтогРазницаСНДСУвеличение   = ИтогРазницаСНДСУвеличение   + СтрокаТабличнойЧасти.РазницаСНДСУвеличение;
		ИтогРазницаНДСУменьшение    = ИтогРазницаНДСУменьшение    + СтрокаТабличнойЧасти.РазницаНДСУменьшение;
		ИтогРазницаНДСУвеличение    = ИтогРазницаНДСУвеличение    + СтрокаТабличнойЧасти.РазницаНДСУвеличение;
	
	КонецЦикла;
	
	КоличествоЛистов = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Документ составлен на%1%2 %3'"), Символы.ПС, КоличествоСтраниц,
		ОбщегоНазначения.ФормаМножественногоЧисла(
			НСтр("ru = 'листе'"), НСтр("ru = 'листах'"), НСтр("ru = 'листах'"), КоличествоСтраниц));
	ДанныеДляПечати.Вставить("КоличествоЛистов", КоличествоЛистов);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	
	ОбластьМакета.Параметры.РазницаБезНДСУменьшение = ИтогРазницаБезНДСУменьшение;
	ОбластьМакета.Параметры.РазницаБезНДСУвеличение = ИтогРазницаБезНДСУвеличение;
	ОбластьМакета.Параметры.РазницаСНДСУменьшение   = ИтогРазницаСНДСУменьшение;
	ОбластьМакета.Параметры.РазницаСНДСУвеличение   = ИтогРазницаСНДСУвеличение;
	
	Если ЭтоПечатьУКД И ДанныеДляПечати.СтатусУКД = 2 Тогда
		
		ОбластьМакета.Параметры.РазницаНДСУменьшение = "--";
		ОбластьМакета.Параметры.РазницаНДСУвеличение = "--";
		
	Иначе
		
		ОбластьМакета.Параметры.РазницаНДСУменьшение    = ?(ДанныеДляПечати.СчетФактураБезНДС, "без НДС", ИтогРазницаНДСУменьшение);
		ОбластьМакета.Параметры.РазницаНДСУвеличение    = ?(ДанныеДляПечати.СчетФактураБезНДС, "без НДС", ИтогРазницаНДСУвеличение);
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);	
	ОбластьМакета.Параметры.Свидетельство = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "Свидетельство,");
	ТабДокумент.Вывести(ОбластьМакета);
 	
	// Устанавливаем параметры печати и колонтитулы
	ЗаголовокДляПечати = ОбщегоНазначения.СформироватьЗаголовокДокумента(ДанныеДляПечати, "Счет-фактура") + " г.";
	ТабДокумент.ВерхнийКолонтитул.Выводить          = Истина;
	ТабДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	ТабДокумент.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	ТабДокумент.ВерхнийКолонтитул.ТекстСлева   = ЗаголовокДляПечати;
	ТабДокумент.ВерхнийКолонтитул.ТекстСправа  = "Лист [&НомерСтраницы]";
	
КонецПроцедуры

Процедура ВывестиРеквизитыКомиссионера(Организация, Поставщик, Покупатель, Дата, Макет, ТабДокумент)
	
	Если ТипЗнч(Покупатель) = Тип("СправочникСсылка.Контрагенты") 
		И (ТипЗнч(Поставщик) = Тип("СправочникСсылка.Контрагенты")
		ИЛИ ТипЗнч(Поставщик) = Тип("Массив")) Тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("РеквизитыКомиссионера");
		
		СведенияОКомиссионере = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Организация, Дата);
		
		НаименованиеКомиссионера = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ПолноеНаименование,");
		ЮридическийАдресКомиссионера = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ЮридическийАдрес,");
		ИННКомиссионера = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "ИНН,", Ложь);
		КППКомиссионера = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОКомиссионере, "КПП,", Ложь);
		
		ОбластьМакета.Параметры.ПредставлениеКомиссионера = "Составлен комиссионером (агентом): " + НаименованиеКомиссионера 
			+ ", " + ЮридическийАдресКомиссионера 
			+ ", ИНН/КПП: " + ИННКомиссионера 
			+ ?(ЗначениеЗаполнено(КППКомиссионера), "/" + КППКомиссионера, "");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиПодвалУниверсальногоКорректировочногоДокументаВТабличныйДокумент(ТабДокумент, Макет, ДанныеДляПечати) Экспорт

	Если ТипЗнч(ДанныеДляПечати.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный")
		И ТипЗнч(ДанныеДляПечати.Поставщик) = Тип("СправочникСсылка.Контрагенты")
		И ТипЗнч(ДанныеДляПечати.Покупатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Организация, ДанныеДляПечати.Дата);
	Иначе
		СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Поставщик, ДанныеДляПечати.Дата);
	КонецЕсли;

	СведенияОбОрганизации = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Организация, ДанныеДляПечати.Дата);
	
	ИННпоставщика = "";
	ВидАгентскогоДоговора = ДанныеДляПечати.ВидАгентскогоДоговора;
	
	Если НЕ (ВидАгентскогоДоговора = Перечисления.ВидыАгентскихДоговоров.Нерезидент) Тогда
		
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "КПП,", Ложь);
		
		Если ЗначениеЗаполнено(КПП) Тогда
			КПП = "/" + КПП;
		КонецЕсли;
		
		ИННпоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ИНН,", Ложь);
		ИННпоставщика = ?(ПустаяСтрока(ИННпоставщика), "", "ИНН") + ?(ПустаяСтрока(ИННпоставщика) ИЛИ ПустаяСтрока(КПП), " ", "/КПП ")
			+ ИННпоставщика + КПП;
		
	КонецЕсли;
	
	СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, ДанныеДляПечати.Дата);
	
	СведенияОПодразделенииПокупателя = Неопределено;
	
	Если ДанныеДляПечати.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.НаРеализацию Тогда
		
		Если ТипЗнч(ДанныеДляПечати.Покупатель) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(ДанныеДляПечати.Покупатель) Тогда
			
			РеквизитыПокупателя = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДанныеДляПечати.Покупатель, "ГоловнойКонтрагент");
			
			Если ЗначениеЗаполнено(РеквизитыПокупателя.ГоловнойКонтрагент) Тогда
				
				СведенияОПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(РеквизитыПокупателя.ГоловнойКонтрагент, ДанныеДляПечати.Дата);
				СведенияОПодразделенииПокупателя = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(ДанныеДляПечати.Покупатель, ДанныеДляПечати.Дата);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеДляПечати.Свойство("КППКонтрагента") И ЗначениеЗаполнено(ДанныеДляПечати.КППКонтрагента) Тогда
		КПП = ДанныеДляПечати.КППКонтрагента;
	ИначеЕсли СведенияОПодразделенииПокупателя <> Неопределено Тогда
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПодразделенииПокупателя, "КПП,", Ложь);
	Иначе
		КПП = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "КПП,", Ложь);
	КонецЕсли;	
	
	ИННПокупателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ИНН,", Ложь);
	ИННПокупателя = ?(ПустаяСтрока(ИННПокупателя), "", "ИНН") + ?(ПустаяСтрока(ИННПокупателя) ИЛИ ПустаяСтрока(КПП), " " , "/КПП ")
		+ ИННПокупателя	+ ?(ПустаяСтрока(КПП), "" , "/") + КПП;
		
	ОбластьМакета = Макет.ПолучитьОбласть("ПодвалНакладной");
	ОбластьМакета.Параметры.Заполнить(ДанныеДляПечати);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,")
		+ ?(ПустаяСтрока(ИННпоставщика), "" , ", ") + ИННпоставщика;
	ОбластьМакета.Параметры.ПредставлениеКонтрагента = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПокупателе, "ПолноеНаименование,")
		+ ?(ПустаяСтрока(ИННПокупателя), "" , ", ") + ИННПокупателя;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
КонецПроцедуры