
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Необходимые проверки...
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ТекСтрокаТовары.Ячейка = ТекСтрокаТовары.ЯчейкаКуда Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " ячейки ""откуда"" и ""куда"" совпадают", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
		// Всё должно быть заполнено
		Если Не ЗначениеЗаполнено(ТекСтрокаТовары.Номенклатура) или Не ЗначениеЗаполнено(ТекСтрокаТовары.Ячейка) или Не ЗначениеЗаполнено(ТекСтрокаТовары.ЯчейкаКуда)  
			или ТекСтрокаТовары.Количество = 0 или ТекСтрокаТовары.КоличествоПереместить = 0 Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " не все данные заполнены", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
		Если ТекСтрокаТовары.Количество < ТекСтрокаТовары.КоличествоПереместить Тогда
			
			Сообщить("В строке № " + ТекСтрокаТовары.НомерСтроки + " попытка переместить больше, чем есть в ячейке", СтатусСообщения.Внимание);
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не Отказ Тогда
		
		// Проверка: Действительно ли в ячейках лежит столько, сколько хотят переместить
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВЯчейкахОстатки.Номенклатура,
		               |	ТоварыВЯчейкахОстатки.Ячейка,
		               |	ТоварыВЯчейкахОстатки.КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки(
		               |			&Д,
		               |			Склад = &Склад
		               |				И Номенклатура В (&Номенклатура)
		               |				И Ячейка В (&Ячейка)) КАК ТоварыВЯчейкахОстатки
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки";
		
		Запрос.УстановитьПараметр("Д", МоментВремени());
		
		ФильтрПоНоменклатуре = Товары.ВыгрузитьКолонку("Номенклатура");
		ФильтрПоЯчейкам = Товары.ВыгрузитьКолонку("Ячейка");
		
		Запрос.УстановитьПараметр("Склад", Склад);
		Запрос.УстановитьПараметр("Номенклатура", ФильтрПоНоменклатуре);
		Запрос.УстановитьПараметр("Ячейка", ФильтрПоЯчейкам);

		Результат = Запрос.Выполнить();
		НоменклатураВЯчейках = Результат.Выбрать();
		
		Движения.ТоварыВЯчейках.Записывать = Истина;
		Движения.ТоварыВЯчейках.Очистить();
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			СтруктураПоиска = Новый Структура("Номенклатура,Ячейка");
			СтруктураПоиска.Вставить("Номенклатура", ТекСтрокаТовары.Номенклатура);
			СтруктураПоиска.Вставить("Ячейка", ТекСтрокаТовары.Ячейка);
			НоменклатураВЯчейках.Сбросить();
			
			Если НоменклатураВЯчейках.НайтиСледующий(СтруктураПоиска) Тогда
				
				Если НоменклатураВЯчейках.КоличествоОстаток < ТекСтрокаТовары.КоличествоПереместить Тогда
					
					Сообщить("Номенклатуры в строке № " + ТекСтрокаТовары.НомерСтроки + " меньше, чем собираетесь переместить ");
					Отказ = Истина;
					Продолжить;
					
				КонецЕсли;
				
			иначе
				
				Сообщить("Номенклатуры в строке № " + ТекСтрокаТовары.НомерСтроки + " нет в ячейке " + ТекСтрокаТовары.Ячейка);
				Отказ = Истина;
				Продолжить;
				
			КонецЕсли;
			
			Движение = Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.Ячейка;
			Движение.Количество = ТекСтрокаТовары.КоличествоПереместить;
			
			Движение = Движения.ТоварыВЯчейках.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Ячейка = ТекСтрокаТовары.ЯчейкаКуда;
			Движение.Количество = ТекСтрокаТовары.КоличествоПереместить;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Клеверенс И ЗначениеЗаполнено(Ячейка) И ЗначениеЗаполнено(ЯчейкаКуда) Тогда

		Склад = Константы.ОсновнойСклад.Получить();
		
		Для Каждого Стр Из Товары Цикл
			
			Стр.Ячейка = Ячейка;
			Стр.ЯчейкаКуда = ЯчейкаКуда;
			Стр.КоличествоПереместить = Стр.Количество;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
