
Функция PM_GET_BALANCE_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_GET_BALANCE_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_GET_BALANCE_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PM_GET_BALANCE_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_GET_BALANCE_FOR_PORTAL: " + Символы.ПС 
	+ МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_GET_BALANCE_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_GET_BALANCE_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_GET_BALANCE_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции

Функция PM_CALCULATION_FOR_PORTAL(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_CALCULATION_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. PM_CALCULATION_FOR_PORTAL");
	ЗаписьЖурналаРегистрации("Web-сервис PM_CALCULATION_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. PM_CALCULATION_FOR_PORTAL: " + Символы.ПС 
	+ МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 
	
	Результат = МСКWEB.PM_CALCULATION_FOR_PORTAL(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис PM_CALCULATION_FOR_PORTAL", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. PM_CALCULATION_FOR_PORTAL " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции
