	 
///////////////////Вызовы из подписок и регламентов///////////////////
Функция СформироватСообщенияПоСостояниюТоваровНаСкладах(КодыМДМ = Неопределено, КодыМДМСкладов = Неопределено, UploadInitiator = "ScheduledTask", ДатаСостояния = Неопределено) Экспорт
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка состояния товаров на складе", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");   
		
		Возврат Ложь;     
		
	КонецЕсли;
	
	ИмяДокумента = "СостоянияТоваровНаСкладе";	
	ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", ИмяДокумента);
	
	ПродолжитьПроверку = Ложь;    
	
	Если ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver_2 Тогда 
		ПродолжитьПроверку = Истина; 
	КонецЕсли; 
	
	Если Не ПродолжитьПроверку Тогда
		Возврат Ложь;           
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка,
	|	Склады.ВыгружатьСостояниеТоваровНаСкладе
	|ИЗ                                                     
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ВыгружатьСостояниеТоваровНаСкладе
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладам
	|				ТОГДА Склады.КодМДМ В (&КодыМДМСкладов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";
	
	Запрос.Параметры.Вставить("ОтборПоСкладам", ЗначениеЗаполнено(КодыМДМСкладов));
	Запрос.Параметры.Вставить("КодыМДМСкладов", КодыМДМСкладов);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ДополнСвойства = Новый СписокЗначений;
		ДополнЗаголовки = Новый СписокЗначений;	
		
		СкладСсылка = РезультатЗапроса.Ссылка;
		ДатаВремяСобытия = ТекущаяДата();
		
		НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
		НовоеСообщение.ОбменДанными.Загрузка = Истина;
		НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;                           
		НовоеСообщение.Объект = "СостоянияТоваровНаСкладе";
		НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
		
		ID = Новый УникальныйИдентификатор();     	
		НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
		
		ДополнПараметры = Новый Структура;
		ДополнПараметры.Вставить("Склад", СкладСсылка);
		ДополнПараметры.Вставить("КодыМДМ", КодыМДМ); 
		//+ Пашкин О.А. 12.02.2025 #UT11-5465
		ДополнПараметры.Вставить("ДатаСостояния", ДатаСостояния); 
		//- Пашкин О.А. 12.02.2025 #UT11-5465
		
		ДобавитьJSONВСообщение_ВиртуальныйДокумент(НовоеСообщение, ИмяДокумента, ДополнПараметры);	
		ДобавитьДанныеВСвойстваИЗаголовки_СостоянияТоваровНаСкладе(СкладСсылка, ДополнСвойства, ДополнЗаголовки, UploadInitiator);	
		ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ИмяДокумента, ДополнСвойства, ДополнЗаголовки, "status");
		
		НовоеСообщение.Записать();
		
	КонецЦикла; 		

КонецФункции

Функция СформироватьСообщенияПередачаРеквизитовНоменклатуры() Экспорт 
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Передача реквизитов номенклатуры между ОП юр лица", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат Ложь;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("Передача реквизитов номенклатуры между ОП юр лица", УровеньЖурналаРегистрации.Информация, , ,
	"Начато регламентное Передача реквизитов номенклатуры между ОП юр лица");
	
	ИмяДокумента = "ПередачаРеквизитовНоменклатуры";	
	ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", ИмяДокумента);
	
	ПродолжитьПроверку = Ложь;
	
	Если ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver_2 Тогда 
		ПродолжитьПроверку = Истина; 
	КонецЕсли; 
	
	Если Не ПродолжитьПроверку Тогда
		Возврат Ложь;           
	КонецЕсли; 
	
	ДополнСвойства = Новый СписокЗначений;
	ДополнЗаголовки = Новый СписокЗначений;	
	
	ДатаВремяСобытия = ТекущаяДата(); 
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;                           
	НовоеСообщение.Объект = "ПередачаРеквизитовНоменклатуры";
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	ДополнПараметры = Новый Структура;
	
	ДобавитьJSONВСообщение_ВиртуальныйДокумент(НовоеСообщение, ИмяДокумента, ДополнПараметры);	
	ДобавитьДанныеВСвойстваИЗаголовки_ПередачаРеквизитовНоменклатуры(ДополнСвойства, ДополнЗаголовки);	
	ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ИмяДокумента, ДополнСвойства, ДополнЗаголовки , "status");
	
	НовоеСообщение.Записать();
	
	ЗаписьЖурналаРегистрации("Передача реквизитов номенклатуры между ОП юр лица", УровеньЖурналаРегистрации.Информация, , ,
	"Закончено регламентное Передача реквизитов номенклатуры между ОП юр лица"); 
	
КонецФункции

Функция СоздатьИсходящееСообщение(ДокументОбъект, ОтменаПроведения = Ложь, ПеречитатьРегистры = Истина, ДополнСвойства = Неопределено, 
	                              ДополнЗаголовки = Неопределено, Точка = "", НеЗаписыватьСообщение = Ложь) Экспорт
	
	Если ДополнСвойства = Неопределено Тогда   
		ДополнСвойства = Новый СписокЗначений;  
	КонецЕсли; 
	
	Если ДополнЗаголовки = Неопределено Тогда     
		ДополнЗаголовки = Новый СписокЗначений;	  
	КонецЕсли; 
	
	ЭтоНовый = Ложь;
	
	Если ДокументОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") Тогда  
		ЭтоНовый = ДокументОбъект.ДополнительныеСвойства.ЭтоНовый;  
	КонецЕсли;
	
	Документ = ДокументОбъект.Ссылка;
	
	ТипДокумента = Документ.Метаданные().Имя;
	 
	Если ТипДокумента = "РеализацияТоваровУслуг" И Документ.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда 
		ТипДокумента = "ПеремещениеТоваровМеждуСкладами";   
	КонецЕсли;
	
	Если ТипДокумента = "ПоступлениеТоваровУслуг" И НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(Документ) Тогда  
		ТипДокумента = "ПеремещениеТоваровМеждуСкладами";     
	КонецЕсли;
	
	//+Бычков О. 24.04.2025 #UT10-5207
	// Вставка
	Если ТипДокумента = "КорректировкаРеализации" Тогда  
		
		Если КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			ТипДокумента = "ПеремещениеТоваровМеждуСкладами";
		КонецЕсли;
		
	КонецЕсли;
	//-Бычков О. 24.04.2025 #UT10-5207
	
	//+Бычков О. 28.04.2025 #UT10-5208
	// Вставка
	Если ТипДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда  
		
		Если ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			ТипДокумента = "ПеремещениеТоваровМеждуСкладами";
		ИначеЕсли ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПоступлениеТоваровУслуг(Документ) Тогда
			ТипДокумента = "ПоступлениеТоваровУслуг";
		КонецЕсли;
		
	КонецЕсли;
	//-Бычков О. 28.04.2025 #UT10-5208
	
	Если ТипДокумента = "АктВыполненныхРабот" Тогда  
		ТипДокумента = "ПоступлениеУслугПрочихАктивов";     
	КонецЕсли;
	
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	
	Если ЗначениеЗаполнено(Точка) Тогда  
		НовоеСообщение.ТочкаПубликации = Точка;
	Иначе            
		НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить(); 
	КонецЕсли; 
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	ДобавитьJSONВСообщение(НовоеСообщение, Документ, ДокументОбъект, ОтменаПроведения, ПеречитатьРегистры);	
	ДобавитьДанныеВСвойстваИЗаголовки(ДокументОбъект, ДополнСвойства, ДополнЗаголовки);	
	ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ТипДокумента, ДополнСвойства, ДополнЗаголовки);                                                             	
	ДобавитьДополнительныйЗаголовокДляОбособленныхПодразделений(ТипДокумента,Документ, НовоеСообщение);
	НовоеСообщение.Объект = Документ.Ссылка;  
	
	Если НеЗаписыватьСообщение Тогда 
		Возврат НовоеСообщение;   
	Иначе        
		
		Если ЗначениеЗаполнено(НовоеСообщение.Сообщение) Тогда
			НовоеСообщение.Записать(); 
		КонецЕсли;
		
		Если НЕ НовоеСообщение.БылаОшибка Тогда	
			
			Если (ТипДокумента = "РеализацияТоваровУслуг" 
				ИЛИ ТипДокумента = "КорректировкаРеализации")  
				И (ЗначениеЗаполнено(Документ.Грузополучатель.DS_Подразделение_ID) ИЛИ ЗначениеЗаполнено(Документ.ДоговорКонтрагента.DS_Подразделение_ID))
				И ПроверитьКонтрагентаДляВыгрузкиВУТ11(ДокументОбъект) = "ERP" 
				И МСК.ПолучитьСостояниеЭДО(Документ.Ссылка).Пустая() Тогда
				МСК.ЗаписатьСостояниеЭДО(Документ.Ссылка,Перечисления.СостояниеЭДО.ВПроцессеОтправки);			
			КонецЕсли;	
			
		КонецЕсли;
		
		Возврат Не НовоеСообщение.БылаОшибка;  
		
	КонецЕсли;	
	
КонецФункции

Процедура СформироватьСообщениеПриемкиРазмещенияДневное() Экспорт
	
	Отчеты.СводныйОтчетПриемкиРазмещения.СформирватьДанныеДляОтправки();
	
КонецПроцедуры

Процедура СформироватьСообщениеПриемкиРазмещенияИнтервал() Экспорт
	
	Отчеты.СводныйОтчетПриемкиРазмещения.СформирватьДанныеДляОтправки(31);
	
КонецПроцедуры

Процедура СформироватьСообщениеПриемкиРазмещенияИнтервалДоп() Экспорт
	 
	ДнейВПрошломМесяце = День(НачалоМесяца(ТекущаяДата()) - 1);
	Отчеты.СводныйОтчетПриемкиРазмещения.СформирватьДанныеДляОтправки(ДнейВПрошломМесяце + День(ТекущаяДата()) - 1);

КонецПроцедуры

Функция СформироватьСообщениеСостояниеЭДО(Документ, Запись) Экспорт 
//+Белов А. 18.11.2024 #

	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = СокрЛП(Константы.AMQP_Exchange.Получить());
	НовоеСообщение.Объект = Документ;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));                                                                                   
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("ТипСодержимого", "application/json");
	СтруктураДокумента.Вставить("ВидДокумента", "ИсторияОбменовЭДО");
	СтруктураДокумента.Вставить("ТипДокумента", СокрЛП(Документ.Метаданные().Имя)); 
	СтруктураДокумента.Вставить("УникальныйИдентификатор", Строка(Документ.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("Номер", Строка(Документ.Номер));
	СтруктураДокумента.Вставить("Дата", Формат(Документ.Дата, "ДЛФ=DT"));
	
	СтруктураДокумента.Вставить("Период", Запись.Период);
	СтруктураДокумента.Вставить("Статус", ОбщегоНазначения.ИмяЗначенияПеречисления(Запись.Статус));
	СтруктураДокумента.Вставить("Ошибка", Запись.Ошибка);
	СтруктураДокумента.Вставить("Комментарий", Запись.Комментарий);
	СтруктураДокумента.Вставить("Период", Запись.Период);
	
	НовоеСообщение.Сообщение = ОбщегоНазначения.ВернутьJSON(СтруктураДокумента);
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("document_type",  "ИсторияОбменовЭДО");	
	Заголовки.Добавить("message_ver",    "2.0");		
	Заголовки.Добавить("app_Receiver_id", "ERP");
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;  
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",            "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать();                                     

//-Белов А. 18.11.2024 #
КонецФункции

Функция СформироватьСообщениеЗаказЗаявка(Документ, Запись) Экспорт 
//+Белов А. 03.09.2026 #UT10-6035

	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = СокрЛП(Константы.AMQP_Exchange.Получить());
	НовоеСообщение.Объект = Документ;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));                                                                                   
	
	СтруктураДокумента = Новый Структура;	
	СтруктураДокумента.Вставить("ВидДокумента", "ЗаказЗаявка"); 
	СтруктураДокумента.Вставить("УникальныйИдентификатор", Строка(Документ.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("Номер", Строка(Документ.Номер));
	СтруктураДокумента.Вставить("Дата", Формат(Документ.Дата, "ДЛФ=DT"));
	
	СтруктураДокумента.Вставить("ГрузоотправительКодМДМ", Документ.Организация.КодМДМ);
	СтруктураДокумента.Вставить("ПеревозчикКодМДМ", Документ.Контрагент.КодМДМ);
	СтруктураДокумента.Вставить("ДоговорПеревозчикаКодМДМ", Документ.ДоговорКонтрагента.КодМДМ);
	СтруктураДокумента.Вставить("ТелефонКонтрагента", Документ.ТелефонКонтрагента);
	СтруктураДокумента.Вставить("ДатаПогрузки", Документ.ДатаПогрузки);
	СтруктураДокумента.Вставить("КоличествоГрузомест", Документ.КоличествоГрузомест);
	СтруктураДокумента.Вставить("ВесГруза", Документ.ВесГруза);
	СтруктураДокумента.Вставить("ОбъемГруза", Документ.ОбъемГруза);
	СтруктураДокумента.Вставить("Грузоподъемность", Документ.Грузоподъемность);
	СтруктураДокумента.Вставить("Вместимость", Документ.Вместимость);          
	СтруктураДокумента.Вставить("ОтветПеревозчика", ОбщегоНазначения.ВернутьСтруктуруИзJSON(Документ.ОтветПеревозчика));
	
	МассивГрузополучателей = Новый Массив; 
	
	Для каждого Стр Из Документ.Грузополучатели Цикл       	
		МассивГрузополучателей.Добавить(Новый Структура("ГрузополучательКодМДМ", Стр.Контрагент.КодМДМ));		
	КонецЦикла; 
	
	СтруктураДокумента.Вставить("Грузополучатели", МассивГрузополучателей);
	
	НовоеСообщение.Сообщение = ОбщегоНазначения.ВернутьJSON(СтруктураДокумента);
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("document_type",  "ЗаказЗаявка");	
	Заголовки.Добавить("message_ver",    "2.0");		
	Заголовки.Добавить("app_Receiver_id", Документ.Организация.ИДбазы);
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;  
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",            "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать();                                     

//-Белов А. 03.09.2026 #UT10-6035 
КонецФункции



///////////////////Общие процедуры и функции///////////////////
Функция ПроверитьНужноЛиВыгружатьДокумент(Документ) Экспорт
	
	ИмяДокумента = Документ.Метаданные().Имя;
	
	ДокументВыгрузки = Справочники.AMQP_ДокументыВыгрузки.НайтиПоРеквизиту("ИмяДокумента", ИмяДокумента);
	
	Если Не ЗначениеЗаполнено(ДокументВыгрузки) ИЛИ Не ДокументВыгрузки.Выгружать Или ДокументВыгрузки.ПометкаУдаления Тогда		
		Возврат Ложь;                                                                                                       	
	КонецЕсли;
	                           
	ПродолжитьПроверку = Ложь;   
	
	Если ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver1_Ver2 
		Или ДокументВыгрузки.ВерсияВыгрузки =  Перечисления.ВерсияВыгрузкиСообщенийДляРаббит.Ver_2 Тогда 		
		ПродолжитьПроверку = Истина;                                                                     	
	КонецЕсли; 
	
	Если ИмяДокумента = "РеализацияТоваровУслуг" И Документ.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда 		
		ПродолжитьПроверку = Истина; 
	//+Бычков О. 23.04.2025 #UT10-5207
	// Было
	//ИначеЕсли ИмяДокумента = "КорректировкаРеализации" И Документ.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
	//	Возврат Ложь;        
	// Стало
	// Теперь такие документы выгружаем по условиям ниже.
	//-Бычков О. 23.04.2025 #UT10-5207
	ИначеЕсли ИмяДокумента = "СчетФактураПолученный" Тогда
		//+Бычков О. 21.01.2026 #UT11-5775
		// Было
		//Возврат Не Константы.ОсновнаяОрганизация.Получить().ИНН = Документ.Контрагент.ИНН;
		// Стало
		Возврат ПроверитьНужноЛиВыгружатьСчетФактуруПолученный(Документ);
		//-Бычков О. 21.01.2026 #UT11-5775
	//+Бычков О. 21.01.2026 #UT10-5642
	// Было
	//ИначеЕсли ИмяДокумента = "СчетФактураВыданный" И ОбщегоНазначения.ЕстьРеквизитДокумента("Грузополучатель", Документ.ДокументОснование.Метаданные()) 
	//	И Документ.ДокументОснование.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда                      
	//	Возврат Ложь;
	// Стало
	ИначеЕсли ИмяДокумента = "СчетФактураВыданный" Тогда                      
		ПродолжитьПроверку = ПроверитьНужноЛиВыгружатьСчетФактуруВыданный(Документ);
	//-Бычков О. 21.01.2026 #UT10-5642
	ИначеЕсли ИмяДокумента = "ПлатежноеПоручениеВходящее" Тогда 
		
		Если Не ПроверитьДоговорДляВыгрузкиВБиллинг(Документ, ИмяДокумента) ИЛИ Не (ЗначениеЗаполнено(Документ.Контрагент) И ЗначениеЗаполнено(Документ.Контрагент.КодМДМ)) Тогда
			Возврат Ложь;        
		КонецЕсли;    
		
	ИначеЕсли ИмяДокумента = "АвансовыйОтчет" Тогда
		ПродолжитьПроверку = Истина;                                                                     	
	ИначеЕсли ИмяДокумента = "УстановкаЦенНоменклатуры" И ПроверитьУстановкуЦен(Документ) Тогда 
		Возврат Ложь; 
	ИначеЕсли ИмяДокумента = "УстановкаЦенНоменклатурыКонтрагентов" И ПроверитьУстановкуЦенКонтрагентов(Документ) Тогда 
		Возврат Ложь; 
	ИначеЕсли ИмяДокумента = "АктВыполненныхРабот"  И ПроверитьАктВыполненныхРабот(Документ) Тогда 
		Возврат Ложь;

	//- Пашкин О.А. 07.07.2025 #UT10-5299
	ИначеЕсли ИмяДокумента = "ЗаказНаЭмиссиюКодовМаркировкиСУЗ" Тогда	
		
		Возврат Ложь; 
		
	//+ Пашкин О.А. 12.07.2025 #UT10-5299
	ИначеЕсли ИмяДокумента = "ОтчетОНанесенииКИЗ" Тогда	
		
		Возврат Ложь; 
	//- Пашкин О.А. 12.07.2025 #UT10-5299
		
	ИначеЕсли ИмяДокумента = "ВводВОборотКИЗ" Тогда	
		
		Возврат Ложь; 
	//- Пашкин О.А. 07.07.2025 #UT10-5299
		
	//+Бычков О. 23.04.2025 #UT10-5207
	//+Белов А. 24.03.2026 #UT10-5761
	ИначеЕсли ИмяДокумента = "ВыводИзОборотаКИЗ" Тогда	
		Возврат Ложь;	
	//-Белов А. 24.03.2026 #UT10-5761
	// Вставка
	ИначеЕсли ИмяДокумента = "КорректировкаПоступления" Тогда
		
		Если КорректировкаПоступленияТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка) Тогда
			
			Если Не ВыполненыДополнительныеУсловияВыгрузкиКорректировкиПоступленияТоваровУслугКакПеремещенияТоваровМеждуСкладами(Документ.Ссылка) Тогда
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяДокумента = "КорректировкаРеализации" Тогда		
		
		Если КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка) Тогда
			
			Если Не ВыполненыДополнительныеУсловияВыгрузкиКорректировкиРеализацииТоваровУслугКакПеремещенияТоваровМеждуСкладами(Документ.Ссылка) Тогда
				Возврат Ложь;
			КонецЕсли;
		
		КонецЕсли;
		
	//-Бычков О. 23.04.2025 #UT10-5207
	//+Бычков О. 28.04.2025 #UT10-5208
	// Вставка
	ИначеЕсли ИмяДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда  
		
		Если Не ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка)
			И Не ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПоступлениеТоваровУслуг(Документ.Ссылка) Тогда
			Возврат Ложь;
		КонецЕсли;
		
	//-Бычков О. 28.04.2025 #UT10-5208
	КонецЕсли;  
	
	Если Не ПродолжитьПроверку Тогда
		Возврат Ложь;  
	КонецЕсли; 
	
	Если ИмяДокумента = "ПоступлениеТоваровУслуг" И НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка) Тогда
		
		Если Документ.ТранзитнаяПоставка И Документ.Статус <> Перечисления.СтатусыПТУ.Закрыт Тогда 
			Возврат Ложь;                                                                                
		КонецЕсли;
		
	КонецЕсли;
	
	Если Документ.Дата < Константы.AMQP_ДатаНачалаВыгрузки.Получить() Тогда   
		Возврат Ложь;       
	КонецЕсли;  
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ШтампВерсии", Документ.Метаданные()) Тогда 
		
		Если Документ.ШтампВерсии = 0 тогда   
			Возврат Ложь;     
		КонецЕсли;   
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьДоговорДляВыгрузкиВБиллинг(Документ , ИмяДокумента)
	
	Если ИмяДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда
		
		Результат = ПроверитьДокументКорректировкаСборкиЗаказовПокупателя(Документ);
		Возврат Результат;
		
	КонецЕсли; 
	
	Если ИмяДокумента = "КорректировкаРеализации" Тогда
		
		Результат = ПроверитьДокументКорректировкаРеализации(Документ);
		Возврат Результат;
		
	КонецЕсли; 
	
	Если ИмяДокумента = "КорректировкаДолга" Тогда	
		
		Результат = ПроверитьДокументКорректировкаДолга(Документ);
		Возврат Результат;
		
	КонецЕсли;
	
	Если ИмяДокумента = "ПлатежноеПоручениеВходящее" Тогда
		
		Результат = ПроверитьДокументПлатежноеПоручениеВходящее(Документ);
		Возврат Результат;
		
	КонецЕсли; 
	
	Если ИмяДокумента = "ПриходныйКассовыйОрдер" Тогда
		
		Результат = ПроверитьДокументПриходныйКассовыйОрдер(Документ);
		Возврат Результат;		
		
	КонецЕсли; 
	
	Если ИмяДокумента = "ОплатаОтПокупателяПлатежнойКартой" Тогда
		
		Результат = ПроверитьДокументОплатаОтПокупателяПлатежнойКартой(Документ);
		Возврат Результат;		
		
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Договор", Документ.Метаданные()) Тогда
		
		Если Не ПроверитьДоговор(Документ.Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;	                                  
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДоговорКонтрагента", Документ.Метаданные()) Тогда
		
		Если Не ПроверитьДоговор(Документ.ДоговорКонтрагента) Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПроверитьДокументПриходныйКассовыйОрдер(ДокументОбъект)
	
	Результат = Ложь;
	
	Если ДокументОбъект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		
		Результат = ПроверитьДоговор(ДокументОбъект.ДоговорКонтрагента);
		Возврат Результат;
		
	КонецЕсли;
	
	Для каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Результат = ПроверитьДоговор(Стр.ДоговорКонтрагента);
		Если Результат Тогда
			Прервать;
		КонецЕсли; 	
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументОплатаОтПокупателяПлатежнойКартой(ДокументОбъект)

	Результат = Ложь;
	
	Для Каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Результат = ПроверитьДоговор(Стр.ДоговорКонтрагента);  
		
		Если Результат Тогда  
			Прервать;    
		КонецЕсли; 	
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументПлатежноеПоручениеВходящее(ДокументОбъект)
	
	Результат = Ложь;
	
	Если ДокументОбъект.РасшифровкаПлатежа.Количество() = 1 Тогда		
		
		Результат = ПроверитьДоговор(ДокументОбъект.ДоговорКонтрагента);
		Возврат Результат;
		
	КонецЕсли;
	
	Для каждого Стр Из ДокументОбъект.РасшифровкаПлатежа Цикл
		
		Результат = ПроверитьДоговор(Стр.ДоговорКонтрагента);
		
		Если Результат Тогда
			Прервать;
		КонецЕсли; 	
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции 

Функция ПроверитьДокументКорректировкаДолга(ДокументОбъект)
	
	Результат = Ложь;
	
	Запрос = Новый Запрос;                             
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВзаиморасчетыСКонтрагентами.Регистратор,
	|	ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами КАК ВзаиморасчетыСКонтрагентами
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентами.Регистратор = &Регистратор
	|	И ВзаиморасчетыСКонтрагентами.ДоговорКонтрагента.ВыгружаетсяВБиллинг"; 
	
	Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда		
		Результат = Истина;			
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументКорректировкаРеализации(ДокументОбъект)
	
	Результат = Ложь;	
	
	Искать = Истина;
	Запрос = Новый Запрос;      
	
	ПараметрСсылка = ДокументОбъект.Ссылка;
	
	Пока Искать Цикл
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КорректировкаРеализации.Ссылка КАК Ссылка,
		|	КорректировкаРеализации.ДокументРеализации КАК ДокументОснование
		|ИЗ
		|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
		|ГДЕ
		|	КорректировкаРеализации.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ПараметрСсылка);
		
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		ПараметрСсылка = РезультатЗапроса.ДокументОснование;
		
		Если ТипЗнч(РезультатЗапроса.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда			
			Продолжить;
		КонецЕсли; 
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента.ВыгружаетсяВБиллинг КАК ВыгружаетсяВБиллинг
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ПараметрСсылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.ВыгружаетсяВБиллинг;
		Искать = Ложь;		
		
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции

Функция ПроверитьДокументКорректировкаСборкиЗаказовПокупателя(ДокументОбъект)
	
	Результат = Ложь;	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	СборкаЗаказовПокупателя.Ссылка,
	|	СборкаЗаказовПокупателя.Договор,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.ВыгружаетсяВБиллинг, ЛОЖЬ) КАК ВыгружаетсяВБиллинг,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Ссылка, """") КАК Договор
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СборкаЗаказовПокупателя.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СборкаЗаказовПокупателя.Ссылка = &СборкаЗаказовПокупателя";	
	
	Запрос.УстановитьПараметр("СборкаЗаказовПокупателя", ДокументОбъект.СборкаЗаказовПокупателя);  
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда  
		
		РезультатЗапроса.Следующий();
		Результат =  РезультатЗапроса.ВыгружаетсяВБиллинг; 
		
	КонецЕсли; 
	
	Возврат Результат;	
	
КонецФункции

Функция ПроверитьДоговор(Договор) 
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") И НЕ Договор.ВыгружаетсяВБиллинг Тогда 
		Возврат Ложь;     
	КонецЕсли;      
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьКонтрагентаДляВыгрузкиВУТ11(Документ)

	Если Документ.ДополнительныеСвойства.Свойство("app_Recipient_id") Тогда
		Возврат Документ.ДополнительныеСвойства.app_Recipient_id;	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Контрагент", Документ.Метаданные()) Тогда
		
		Если ЗначениеЗаполнено(Документ.Контрагент.ДатаНачалаОбменаВНовомФормате) И Документ.Дата >= Документ.Контрагент.ДатаНачалаОбменаВНовомФормате Тогда
			Возврат "ERP";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";

КонецФункции

Процедура ДобавитьДанныеВСвойстваИЗаголовки(ДокументОбъект, ДополнСвойства, ДополнЗаголовки)
	
	Документ     = ДокументОбъект.Ссылка;
	ТипДокумента = ПолучитьТипДокументаИзБиллингаДля1С(Документ.Метаданные().Имя);
	ИмяДокумента = Документ.Метаданные().Имя;
		
	Если ИмяДокумента = "РасходныйКассовыйОрдер" Тогда
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);
	
	ИначеЕсли ИмяДокумента = "РеализацияТоваровУслуг" Тогда 
		
		Если Документ.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
			
			ДополнЗаголовки.Добавить("document_type",  "ПеремещениеТоваровМеждуСкладами");	
			ДополнЗаголовки.Добавить("message_ver",    "2.0");			
			ДополнЗаголовки.Добавить("operation_type", "РеализацияТоваровУслуг");

		Иначе	
			
			ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
			ДополнЗаголовки.Добавить("message_ver",    "2.2");		
			ДополнЗаголовки.Добавить("warehouse_id",   СокрЛП(ДокументОбъект.Склад.КодМДМ));
			ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
			ДополнЗаголовки.Добавить("app_Recipient_id", ПроверитьКонтрагентаДляВыгрузкиВУТ11(ДокументОбъект)); 
			
		КонецЕсли; 
		
	ИначеЕсли ИмяДокумента = "КорректировкаСборкиЗаказовПокупателя" Тогда
		
	ИначеЕсли ИмяДокумента = "КорректировкаРеализации" Тогда    
		
		//+Бычков О. 24.04.2025 #UT10-5207
		// Вставка
		Если КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
		
			ДополнЗаголовки.Добавить("document_type",  "ПеремещениеТоваровМеждуСкладами");	
			ДополнЗаголовки.Добавить("message_ver",    "2.0");			
			ДополнЗаголовки.Добавить("operation_type", "КорректировкаРеализации");
			
		Иначе
		//-Бычков О. 24.04.2025 #UT10-5207
		
			ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
			ДополнЗаголовки.Добавить("message_ver",    "2.2");		
			ДополнЗаголовки.Добавить("warehouse_id",   СокрЛП(ДокументОбъект.Склад.КодМДМ));
			ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
			ДополнЗаголовки.Добавить("app_Recipient_id", ПроверитьКонтрагентаДляВыгрузкиВУТ11(ДокументОбъект));

		//+Бычков О. 24.04.2025 #UT10-5207
		// Вставка
		КонецЕсли;
		//-Бычков О. 24.04.2025 #UT10-5207
	ИначеЕсли ИмяДокумента = "ОплатаОтПокупателяПлатежнойКартой" Тогда  
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
		
		Если ДокументОбъект.ДополнительныеСвойства.Свойство("app_Recipient_id") Тогда    
			ДополнЗаголовки.Добавить("app_Recipient_id", ДокументОбъект.ДополнительныеСвойства.app_Recipient_id); 
		Иначе                                                        
			ДополнЗаголовки.Добавить("app_Recipient_id", "ERP");   
		КонецЕсли;     
		
	ИначеЕсли ИмяДокумента = "СчетФактураВыданный" Тогда  
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.2");		
		ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
		ДополнЗаголовки.Добавить("app_Recipient_id", ПроверитьКонтрагентаДляВыгрузкиВУТ11(ДокументОбъект));   
		
	ИначеЕсли ИмяДокумента = "ПлатежноеПоручениеВходящее" Тогда

		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		

	ИначеЕсли ИмяДокумента = "ПриходныйКассовыйОрдер" Тогда
		
	ИначеЕсли ИмяДокумента = "ПоступлениеТоваровУслуг" Тогда
		
		Если НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			
			ДополнЗаголовки.Добавить("document_type",  "ПеремещениеТоваровМеждуСкладами");	
			ДополнЗаголовки.Добавить("message_ver",    "2.0");		
			ДополнЗаголовки.Добавить("operation_type", "ПоступлениеТоваровУслуг");
			
		Иначе
			СформироватьЗаголовкиИСвойства_ПоступлениеТоваровУслуг(ДополнЗаголовки, ДополнСвойства, ДокументОбъект);
		КонецЕсли;
		
	ИначеЕсли ИмяДокумента = "ВозвратТоваровОтПокупателя" Тогда
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		ДополнЗаголовки.Добавить("warehouse_id",   СокрЛП(ДокументОбъект.СкладОрдер.КодМДМ));
		ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
 	
	ИначеЕсли ИмяДокумента = "ЗаявкаНаВозврат" Тогда
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		
	ИначеЕсли ИмяДокумента = "КорректировкаПоступления" Тогда
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		ДополнЗаголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ)); 
		
	ИначеЕсли ИмяДокумента = "АктВыполненныхРабот" Тогда
		
		ДополнЗаголовки.Добавить("document_type",  "ПоступлениеУслугПрочихАктивов");	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		
    //+Бычков О. 28.04.2025 #UT10-5208
	// Вставка
	ИначеЕсли ИмяДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда
		
		Если ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			
			ДополнЗаголовки.Добавить("document_type",  "ПеремещениеТоваровМеждуСкладами");	
			ДополнЗаголовки.Добавить("message_ver",    "2.0");		
			ДополнЗаголовки.Добавить("operation_type", "ПоступлениеТоваровНаОтветственноеХранение");
			
		ИначеЕсли ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПоступлениеТоваровУслуг(Документ) Тогда
			
			СформироватьЗаголовкиИСвойстваВыгрузкиПоступленияТоваровНаОтветственноеХранениеВПоступлениеТоваровУслуг(ДополнЗаголовки, ДополнСвойства, ДокументОбъект);
			
		КонецЕсли;
	//-Бычков О. 28.04.2025 #UT10-5208
	
	//+Сёмин Р.И. 04.08.2026 #UT10-5985
	ИначеЕсли ИмяДокумента = "ЗаказПокупателя" Тогда
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
	//-Сёмин Р.И. 04.08.2026 #UT10-5985
		
	КонецЕсли;  
	
	Если ДополнЗаголовки.НайтиПоЗначению("document_type") = Неопределено Тогда   
		
		ДополнЗаголовки.Добавить("document_type",  ТипДокумента);	
		ДополнЗаголовки.Добавить("message_ver",    "2.0");		
		
	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьДанныеВСвойстваИЗаголовки_СостоянияТоваровНаСкладе(СкладСсылка, ДополнСвойства, ДополнЗаголовки, UploadInitiator) 

	СкладОбъект = СкладСсылка.ПолучитьОбъект();
	ДополнЗаголовки.Добавить("document_type"  ,  "СостоянияТоваровНаСкладе");	
	ДополнЗаголовки.Добавить("message_ver"    ,    "2.1"); 		
	ДополнЗаголовки.Добавить("warehouse_id"   ,   СокрЛП(СкладОбъект.КодМДМ));
	ДополнЗаголовки.Добавить("price_id"       , СкладОбъект.ИдентификаторПрайса);
	ДополнЗаголовки.Добавить("UploadInitiator", UploadInitiator); 

КонецПроцедуры

Процедура ДобавитьДанныеВСвойстваИЗаголовки_ПередачаРеквизитовНоменклатуры(ДополнСвойства , ДополнЗаголовки) 
	
	ДополнЗаголовки.Добавить("document_type",  "ПередачаРеквизитовНоменклатуры");	
	ДополнЗаголовки.Добавить("message_ver",    "2.0");		

КонецПроцедуры

Процедура ДобавитьСвойстваИЗаголовкиВСообщение(НовоеСообщение, ТипДокумента, ДополнСвойства = Неопределено, ДополнЗаголовки = Неопределено, Тип = "")
	
	Заголовки = Новый СписокЗначений;

	НужноДобавлятьЗаголовокПолучателя = Истина;
	
	Если ЗначениеЗаполнено(ДополнЗаголовки) И ДополнЗаголовки.НайтиПоЗначению("app_Receiver_id") <> Неопределено Тогда
		НужноДобавлятьЗаголовокПолучателя = Ложь;	
	КонецЕсли;  
	
	Если НужноДобавлятьЗаголовокПолучателя Тогда
		Заголовки.Добавить("app_Receiver_id", "None");	
	КонецЕсли;  

	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	
	Если Не ЗначениеЗаполнено(Тип)Тогда 
		Свойства.Добавить("Тип", "document"); 
	Иначе                                      
		Свойства.Добавить("Тип", Тип); 	   
	КонецЕсли; 
	
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;	
		
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;   
	
	// Добавить дополнительные заголовки
	Если ЗначениеЗаполнено(ДополнЗаголовки) Тогда
		
		Для каждого ЗаголовокЭлемент Из ДополнЗаголовки Цикл	
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = ЗаголовокЭлемент.Значение;
			НоваяСтрока.Значение = ЗаголовокЭлемент.Представление;	
			
		КонецЦикла;   		                                      
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнСвойства) Тогда
		
		Для Каждого СвойствоЭлемент Из ДополнСвойства Цикл	
			
			НоваяСтрока = НовоеСообщение.Свойства.Добавить();
			НоваяСтрока.Наименование = СвойствоЭлемент.Значение;
			НоваяСтрока.Значение = СвойствоЭлемент.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТипДокументаИзБиллингаДля1С(ТипДокумента) Экспорт
	
	Соотв = Новый Соответствие;
	Соотв.Вставить("СборкаЗаказа", "СборкаЗаказовПокупателя");
	Соотв.Вставить("Возврат", "ВозвратТоваровОтПокупателя");
	
	Имя = Соотв.Получить(ТипДокумента);
	
	Если Имя = Неопределено Тогда  
		Возврат ТипДокумента; 
	Иначе                    
		Возврат Имя;    
	КонецЕсли;   	
	
КонецФункции      

Процедура ДобавитьJSONВСообщение_ВиртуальныйДокумент(НовоеСообщение, ТипДокумента, ДополнПараметры)	
	
	СтруктураДокумента = Новый Структура;		
	
	Если ТипДокумента = "СостоянияТоваровНаСкладе" Тогда
		ЗаписатьСостоянияДокументовНаСкладах(СтруктураДокумента, ДополнПараметры);	
	КонецЕсли; 
	
	Если ТипДокумента = "ПередачаРеквизитовНоменклатуры" Тогда
		ЗаписатьРеквизитыНоменклатуры(СтруктураДокумента, ДополнПараметры);	
	КонецЕсли;
	
	ЕстьОшибки = Ложь;   
	
	Для каждого Стр Из СтруктураДокумента Цикл
		
		Если Найти(Стр.Ключ, "МДМ") <> 0 И Не ЗначениеЗаполнено(СокрЛП(Стр.Значение)) Тогда
			
			ЕстьОшибки = Истина;
			СписокОшибок = СписокОшибок + ?(ЗначениеЗаполнено(СписокОшибок),Символы.ПС,"") + "Не заполнен Код МДМ для реквизита: " + Стр.Ключ;
			СтруктураДокумента.Вставить(Стр.Ключ, СокрЛП(Стр.Значение));
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		ЗаписьЖурналаРегистрации("ФормированиеСообщения" + ТипДокумента, УровеньЖурналаРегистрации.Ошибка, , , СписокОшибок); 
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, " ", Истина);	
	
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	НовоеСообщение.Сообщение = JsonСтрока;	
	
КонецПроцедуры

Процедура ДобавитьJSONВСообщение(НовоеСообщение, Документ, ДокументОбъект, ОтменаПроведения, ПеречитатьРегистры = Истина) Экспорт
	
	СтруктураДокумента = Новый Структура;
	
	//+Бычков О. 23.04.2025 #UT10-5207
	// Было
	//ТипДокумента = Документ.Метаданные().Имя;
	// Стало
	ТекТипДокументаВЭтойБазе = Документ.Метаданные().Имя;
	ТипДокумента = ТекТипДокументаВЭтойБазе;
	//-Бычков О. 23.04.2025 #UT10-5207
	
	Если ТипДокумента = "РеализацияТоваровУслуг" И Документ.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
		ТипДокумента = "ПеремещениеТоваровМеждуСкладами"; 
	ИначеЕсли ТипДокумента = "ПоступлениеТоваровУслуг" И НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(Документ) Тогда 
		ТипДокумента = "ПеремещениеТоваровМеждуСкладами"; 
	ИначеЕсли ТипДокумента = "АктВыполненныхРабот" Тогда  
		ТипДокумента = "ПоступлениеУслугПрочихАктивов";
	//+Бычков О. 23.04.2025 #UT10-5207
	// Вставка
	ИначеЕсли ТипДокумента = "КорректировкаРеализации" Тогда
	
		Если КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			ТипДокумента = "ПеремещениеТоваровМеждуСкладами";
		КонецЕсли;
		
	//-Бычков О. 23.04.2025 #UT10-5207
	//+Бычков О. 28.04.2025 #UT10-5208
	// Вставка
	ИначеЕсли ТипДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда
		
		Если ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ) Тогда
			ТипДокумента = "ПеремещениеТоваровМеждуСкладами";
		ИначеЕсли ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПоступлениеТоваровУслуг(Документ) Тогда
			ТипДокумента = "ПоступлениеТоваровУслуг";
		КонецЕсли;
		
	//-Бычков О. 28.04.2025 #UT10-5208
	КонецЕсли;

	ЗаписатьПредопределенныеРеквизитыДокумента(ДокументОбъект, СтруктураДокумента, ОтменаПроведения, ТипДокумента);					
	
	ИсключПоля = Новый Структура;  
	
	Если ТипДокумента = "РеализацияТоваровУслуг" Тогда  
		ЗаписатьРеализацияТоваровУслуг(ДокументОбъект, СтруктураДокумента , ПеречитатьРегистры);	
	ИначеЕсли ТипДокумента = "СчетФактураПолученный" Тогда 
		ЗаписатьСчетФактураПолученный(ДокументОбъект, СтруктураДокумента); 
	ИначеЕсли ТипДокумента = "ТребованиеНакладная" Тогда
		ЗаписатьТребованиеНакладная(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "ПересортицаТоваров" Тогда
		ЗаписатьПересортицаТоваров(ДокументОбъект, СтруктураДокумента);   
	ИначеЕсли ТипДокумента = "РасходныйКассовыйОрдер" Тогда 
		ЗаписатьРасходныйКассовыйОрдер(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "СостоянияТоваровНаСкладе" Тогда
		
	ИначеЕсли ТипДокумента = "ОплатаОтПокупателяПлатежнойКартой" Тогда  
		ЗаписатьОплатуПлатежнойКартой(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "ПлатежноеПоручениеВходящее" Тогда
		ЗаписатьПлатежноеПоручениеВходящее(ДокументОбъект, СтруктураДокумента);	
	ИначеЕсли ТипДокумента = "СчетФактураВыданный" Тогда 
		ЗаписатьСчетФактуру(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "КорректировкаРеализации" Тогда
		ЗаписатьКорректировкуРеализации(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);
	ИначеЕсли ТипДокумента = "ВозвратТоваровОтПокупателя" Тогда
		ЗаписатьВозвратТоваровОтПокупателя(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);	
	ИначеЕсли ТипДокумента = "ПеремещениеТоваровМеждуСкладами" Тогда

		//+Бычков О. 23.04.2025 #UT10-5207
		// Было
		//ЗаписатьРеализацияТоваровУслугКакПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);
		// Стало
		ЗаписатьПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);
		//-Бычков О. 23.04.2025 #UT10-5207
		
	ИначеЕсли ТипДокумента = "ЗаявкаНаВозврат" Тогда
		ЗаписатьЗаявкаНаВозврат(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);  
	ИначеЕсли ТипДокумента = "ПоступлениеТоваровУслуг" Тогда 
		
		ТЗТовары = Новый ТаблицаЗначений;
		//+Бычков О. 28.04.2025 #UT10-5208
		// Было
		//ЗаписатьПоступлениеТоваровУслугРаббит(ДокументОбъект, СтруктураДокумента, ТЗТовары); 
		// Стало
		ЗаписатьПоступлениеТоваровУслуг(ДокументОбъект, СтруктураДокумента, ТЗТовары); 
		//-Бычков О. 28.04.2025 #UT10-5208
		
	ИначеЕсли ТипДокумента = "КорректировкаПоступления" Тогда  
		
		ТЗТовары = Новый ТаблицаЗначений;
		ЗаписатьКорректировкаПоступленияТоваровУслугРаббит(ДокументОбъект, СтруктураДокумента, ТЗТовары);
		
	ИначеЕсли ТипДокумента = "УстановкаЦенНоменклатуры" Тогда  
		ЗаписатьУстановкуЦенНоменклатуры(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "ВыкупСОтветственногоХранения" Тогда  
		ЗаписатьВыкупСОтветственногоХранения(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "УстановкаЦенНоменклатурыКонтрагентов" Тогда  
		ЗаписатьУстановкуЦенНоменклатурыКонтрагента(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "ПоступлениеУслугПрочихАктивов" Тогда  
		ЗаписатьАктВыполненныхРабот(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТипДокумента = "АвансовыйОтчет" Тогда  
		ЗаписатьАвансовыйОтчет(ДокументОбъект, СтруктураДокумента);
		
		//+Сёмин Р.И. 04.08.2026 #UT10-5985
	ИначеЕсли ТипДокумента = "ЗаказПокупателя" Тогда
		ЗаписатьЗаказПокупателя(ДокументОбъект, СтруктураДокумента);
		//-Сёмин Р.И. 04.08.2026 #UT10-5985
		
	КонецЕсли;	                                    
	
	ЕстьОшибки = Ложь;
	СписокОшибок = "";
	
	Для каждого Стр Из СтруктураДокумента Цикл
		
		Если Найти(Стр.Ключ, "МДМ") <> 0 И Не ЗначениеЗаполнено(СокрЛП(Стр.Значение)) Тогда   
			
			ЕстьОшибки = Истина;
			СписокОшибок = СписокОшибок + ?(ЗначениеЗаполнено(СписокОшибок), Символы.ПС, "") + "Не заполнен Код МДМ для реквизита: " + Стр.Ключ;
			СтруктураДокумента.Вставить(Стр.Ключ, СокрЛП(Стр.Значение));
			
		КонецЕсли;		
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда			
		ЗаписьЖурналаРегистрации("ФормированиеСообщения" + ТипДокумента, УровеньЖурналаРегистрации.Ошибка, , ДокументОбъект.Ссылка, СписокОшибок);  		
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	НовоеСообщение.Сообщение = JsonСтрока;	
	
КонецПроцедуры


///////////////////Процедуры записи документов///////////////////
Процедура ЗаписатьКорректировкуРеализации(Документ, СтруктураДокумента, ПеречитатьРегистры)

	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодФилиалаМДМ");		
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Грузополучатель", "КодМДМ", "КодФилиалаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Договор", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорКонтрагента", "КодМДМ", "КодДоговораМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Склад", "КодМДМ", "КодСкладаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМПартнера", "КодПартнераМДМ");
	
	СтруктураДокумента.Вставить("ОтражатьВУправленческомУчете", Число(Документ.ОтражатьВУправленческомУчете));
	
	Если Документ.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить() Тогда
		СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаНеОблагаетсяНДС");	
	Иначе
		СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");
	КонецЕсли;

	Если Документ.Движения.Найти("Продажи") <> Неопределено Тогда    
		
		Если Документ.Проведен 
			И Документ.ДополнительныеСвойства.Свойство("РежимЗаписи") 
			И Документ.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
			ПеречитатьРегистры = Истина;
		КонецЕсли;
		
		Если ПеречитатьРегистры Тогда     
			Документ.Движения.Продажи.Прочитать();        
		КонецЕсли;
		
		ТаблицаПродаж = Документ.Движения.Продажи.Выгрузить();
		СуммаКорректировки = ТаблицаПродаж.Итог("Стоимость");
		СтруктураДокумента.Вставить("Сумма", СуммаКорректировки);
		
		СуммаКорректировкиНДС = ТаблицаПродаж.Итог("НДС");
		
		СтруктураДокумента.Вставить("СуммаНДС", СуммаКорректировкиНДС);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ.ДокументРеализации) Тогда 
		
		СтруктураДокумента.Вставить("КодОснованияГУИД", Строка(Документ.ДокументРеализации.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("НомерОснования", Документ.ДокументРеализации.Номер); 
		СтруктураДокумента.Вставить("ДатаОснования", Формат(Документ.ДокументРеализации.Дата, "ДЛФ=DT")); 
		СтруктураДокумента.Вставить("ВидДокументаОснования", Документ.ДокументРеализации.Метаданные().Имя);  
		
	Иначе                                                       
		
		СтруктураДокумента.Вставить("КодОснованияГУИД", "");
		СтруктураДокумента.Вставить("НомерОснования", "");
		СтруктураДокумента.Вставить("ДатаОснования", "");
		СтруктураДокумента.Вставить("ВидДокументаОснования", "");  
		
	КонецЕсли;
	
	ДокументРеализации = Неопределено;
	УровеньВложенностиРеализации = 0;
	
	Если ТипЗнч(Документ.ДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		ДокументРеализации = Документ.ДокументРеализации;	      
		
	ИначеЕсли ТипЗнч(Документ.ДокументРеализации) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		УровеньВложенностиРеализации = 1;
		Ист = Документ.ДокументРеализации;
		
		Пока ТипЗнч(Ист) = Тип("ДокументСсылка.КорректировкаРеализации") Цикл 
			
			УровеньВложенностиРеализации = УровеньВложенностиРеализации + 1;
			Ист = Ист.ДокументРеализации;     
			
		КонецЦикла;
		
		Если ТипЗнч(Ист) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда   
			ДокументРеализации = Ист;    
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументРеализации) Тогда   
		
		СтруктураДокумента.Вставить("КодРеализацииГУИД", Строка(ДокументРеализации.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("НомерРеализации", ДокументРеализации.Номер); 
		СтруктураДокумента.Вставить("ДатаРеализации", Формат(ДокументРеализации.Дата, "ДЛФ=DT"));
		СтруктураДокумента.Вставить("УровеньВложенностиРеализации", УровеньВложенностиРеализации);  
		
	Иначе                                                   
		
		СтруктураДокумента.Вставить("КодРеализацииГУИД", "");
		СтруктураДокумента.Вставить("НомерРеализации", ""); 
		СтруктураДокумента.Вставить("ДатаРеализации", "");
		СтруктураДокумента.Вставить("УровеньВложенностиРеализации", 0);
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);
	
	СтруктураДокумента.Вставить("Ответственный", Документ.Ответственный.Наименование);
	
	КроссДокинг = Ложь; 
	
	Для каждого Стр ИЗ Документ.Товары Цикл
		
		Если Стр.ЗаказПокупателя.КроссДокинг Тогда  
			
			КроссДокинг = Истина;   			
			Прервать;       
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КроссДокинг", Число(КроссДокинг));
	
	КодСоглашенияАварда = "";	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыАварды.КодАварда
	|ИЗ
	|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	|ГДЕ
	|	ДоговорыАварды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Пока Выборка.Следующий() Цикл 		
		КодСоглашенияАварда = КодСоглашенияАварда + ?(ЗначениеЗаполнено(КодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(Выборка.КодАварда), " ", ""); 		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", КодСоглашенияАварда);
	
	Если Документ.Товары.Количество() > 0 И ЗначениеЗаполнено(Документ.Товары[0].ЗаказПокупателя) Тогда		
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", Документ.Товары[0].ЗаказПокупателя.КлючСтрокиУсловий); 		
	Иначе                                                                                                       	
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", 0);                                                    	
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Водитель", "");
	СтруктураДокумента.Вставить("КоличествоКорректировок", 0);
	СтруктураДокумента.Вставить("НомерКорректировки", 0);
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(Документ.НомерЧекаККМ), 1, 0)); 	
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ЗаказыМассив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.ЗаказПокупателя
	|ПОМЕСТИТЬ ВТЗаказКлиента
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииТовары.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказПокупателя,
	|	ЗаказКлиентаТовары.Ссылка.Номер КАК Номер,
	|	ЗаказКлиентаТовары.Ссылка.Дата КАК Дата,
	|	СУММА(ЗаказКлиентаТовары.Сумма) КАК Сумма,
	|	СУММА(ЗаказКлиентаТовары.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ЗаказКлиентаТовары.Ссылка.IDЗаказаПортал) КАК IDЗаказаПортал
	|ИЗ
	|	ВТЗаказКлиента КАК ВТЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказКлиентаТовары
	|		ПО ВТЗаказКлиента.ЗаказПокупателя = ЗаказКлиентаТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка,
	|	ЗаказКлиентаТовары.Ссылка.Номер,
	|	ЗаказКлиентаТовары.Ссылка.Дата";                  
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать();        
	
	Пока Выб.Следующий() Цикл
		
		ЗаказыСтруктура = Новый Структура;
		
		ЗаказыСтруктура.Вставить("УникальныйИдентификатор", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));
		ЗаказыСтруктура.Вставить("Номер", СокрЛП(Выб.Номер));
		ЗаказыСтруктура.Вставить("Дата", Формат(Выб.Дата, "ДЛФ=DT"));
		ЗаказыСтруктура.Вставить("Сумма", Выб.Сумма);
		ЗаказыСтруктура.Вставить("СуммаНДСЗаказа", Выб.СуммаНДС);
		ЗаказыСтруктура.Вставить("УИПортал", "");
		
		ЗаказыМассив.Добавить(ЗаказыСтруктура);   		
		
	КонецЦикла;	     
	
	СтруктураДокумента.Вставить("Заказы", ЗаказыМассив);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КорректировкаРеализацииТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	КорректировкаРеализацииТовары.Количество,
	|	КорректировкаРеализацииТовары.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА КорректировкаРеализацииТовары.Сумма
	|		ИНАЧЕ КорректировкаРеализацииТовары.Сумма + КорректировкаРеализацииТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	КорректировкаРеализацииТовары.СуммаНДС,
	|	КорректировкаРеализацииТовары.Цена,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииТовары.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА КорректировкаРеализацииТовары.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ""ПродажаСоСторСклада""
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	КорректировкаРеализацииТовары.ЗаказПокупателя,      
	//+Шульман А. 18.11.2024 #UT10-4903 
	|	КорректировкаРеализацииТовары.ЗаказПокупателя.ТипЦен.КодМДМ КАК ТипЦенКодМДМ,
	//-Шульман А. 18.11.2024 #UT10-4903 
	|	КорректировкаРеализацииТовары.НомерСтроки КАК НомерСтроки,
	|	КорректировкаРеализацииТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	|	КорректировкаРеализацииТовары.КоличествоДоИзменения,
	|	КорректировкаРеализацииТовары.СтавкаНДСДоИзменения,
	|	КорректировкаРеализацииТовары.СуммаДоИзменения,
	|	КорректировкаРеализацииТовары.СуммаНДСДоИзменения,
	|	КорректировкаРеализацииТовары.ЦенаДоИзменения,
	|	КорректировкаРеализацииТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатуры
	|ИЗ
	|	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|ГДЕ
	|	КорректировкаРеализацииТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать();             
	
	Пока Выб.Следующий() Цикл                     
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		
		ТоварыСтруктура.Вставить("КоличествоДоИзменения", Выб.КоличествоДоИзменения);
		ТоварыСтруктура.Вставить("СуммаДоИзменения", Выб.СуммаДоИзменения);
		ТоварыСтруктура.Вставить("ЦенаДоИзменения", Выб.ЦенаДоИзменения);
		
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));    
		ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", ?(ЗначениеЗаполнено(Выб.КодМДМСтранаПроисхождения), СокрЛП(Выб.КодМДМСтранаПроисхождения), ""));    
		ТоварыСтруктура.Вставить("НаправлениеДеятельности", ?(ЗначениеЗаполнено(Выб.НаправлениеДеятельности), СокрЛП(Выб.НаправлениеДеятельности), ""));    
		
		ТоварыСтруктура.Вставить("СерияНоменклатуры", Выб.СерияНоменклатуры);
		ТоварыСтруктура.Вставить("КодЗаказаГУИД", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));		
		
		//+Шульман А. 18.11.2024 #UT10-4903  
		ТоварыСтруктура.Вставить("ВидЦены", ?(ЗначениеЗаполнено(Выб.ТипЦенКодМДМ), СокрЛП(Выб.ТипЦенКодМДМ), ""));    
		//-Шульман А. 18.11.2024 #UT10-4903 
		
		Если Документ.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить() Тогда
			
			ТоварыСтруктура.Вставить("СуммаНДС", 0);		
			ТоварыСтруктура.Вставить("СтавкаНДС", 0);  
			ТоварыСтруктура.Вставить("СуммаНДСДоИзменения", 0);
			ТоварыСтруктура.Вставить("СтавкаНДСДоИзменения", 0);
					
		Иначе
			
			ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);		
			ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));                      
			ТоварыСтруктура.Вставить("СуммаНДСДоИзменения", Выб.СуммаНДСДоИзменения);
			ТоварыСтруктура.Вставить("СтавкаНДСДоИзменения", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДСДоИзменения));
		
		КонецЕсли;

		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Товары", Товары); 
			
КонецПроцедуры

Процедура ЗаписатьСчетФактуру(Документ , СтруктураДокумента)
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");		
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодФилиалаМДМ");		
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Договор", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорКонтрагента", "КодМДМ", "КодДоговораМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМПартнера", "КодПартнераМДМ");
	
	Если ЗначениеЗаполнено(Документ.ДокументОснование) Тогда
		
		СтруктураДокумента.Вставить("КодОснованияГУИД", Строка(Документ.ДокументОснование.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("ВидДокументаОснования", Документ.ДокументОснование.Метаданные().Имя); 
		СтруктураДокумента.Вставить("НомерОснования", Документ.ДокументОснование.Номер);
		СтруктураДокумента.Вставить("ДатаОснования", Формат(Документ.ДокументОснование.Дата, "ДЛФ=DT")); 
		
	Иначе 
		
		СтруктураДокумента.Вставить("КодОснованияГУИД", "");
		СтруктураДокумента.Вставить("ВидДокументаОснования", "");
		СтруктураДокумента.Вставить("НомерОснования", "");
		СтруктураДокумента.Вставить("ДатаОснования", "");
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);		
	СтруктураДокумента.Вставить("Корректировочный", ?(Документ.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыВыставленного.Корректировочный, 1, 0));
	СтруктураДокумента.Вставить("Исправление", Число(Документ.Исправление));   
	СтруктураДокумента.Вставить("КодВидаОперации", ?(СтруктураДокумента.Корректировочный = 1, "01", Документ.КодВидаОперации));  
	
	СтруктураДокумента.Вставить("НомерИсправления", Документ.НомерИсправления);
	
	МассивТипов = МассивПоддерживаемыхТиповJSON();
	
	СтруктураДокумента.Вставить("Контрагент", ЗначениеJSON(Документ.Контрагент, МассивТипов));
	СтруктураДокумента.Вставить("Договор", ЗначениеJSON(Документ.ДоговорКонтрагента, МассивТипов));
	СтруктураДокумента.Вставить("ДокументОснование", ЗначениеJSON(Документ.ДокументОснование, МассивТипов));
	СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");   
	СтруктураДокумента.Вставить("КодВидаОперацииНаУменьшение", ?(СтруктураДокумента.Корректировочный = 1, Документ.КодВидаОперации, ""));  
	СтруктураДокумента.Вставить("ДатаВыставления", Документ.ДатаВыставления);
	СтруктураДокумента.Вставить("КППКонтрагента", Документ.КППКонтрагента);
	
	//+Марков И. 04.12.2024 #UT10-4954
	СтруктураДокумента.Вставить("СуммаДокумента", Документ.СуммаДокумента);
	СтруктураДокумента.Вставить("СуммаНДСДокумента", Документ.СуммаНДСДокумента);
	СтруктураДокумента.Вставить("СуммаУвеличение", Документ.СуммаУвеличение);
	СтруктураДокумента.Вставить("СуммаНДСУвеличение", Документ.СуммаНДСУвеличение);
	СтруктураДокумента.Вставить("СуммаУменьшение", Документ.СуммаУменьшение);
	СтруктураДокумента.Вставить("СуммаНДСУменьшение", Документ.СуммаНДСУменьшение);
	//-Марков И. 04.12.2024 #UT10-4954
	
	СтруктураДокумента.Вставить("СчетФактураОснование", ЗначениеJSON(Документ.ИсправляемыйСчетФактура, МассивТипов));
	СтруктураДокумента.Вставить("Договор", ЗначениеJSON(Документ.ДоговорКонтрагента, МассивТипов));
	
	КроссДокинг = Ложь;
	
	Если ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") 
	 ИЛИ ТипЗнч(Документ.ДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		
		Для каждого Стр ИЗ Документ.ДокументОснование.Товары Цикл
			
			Если Стр.ЗаказПокупателя.КроссДокинг Тогда
				
				КроссДокинг = Истина;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("КроссДокинг", Число(КроссДокинг));
	
	МассивОснований = Новый Массив;
	
	Для каждого Стр Из Документ.ДокументыОснования Цикл
		
		СтруктураОснования = Новый Структура;
		СтруктураОснования.Вставить("Номер", Стр.НомерИсходногоДокумента);
		СтруктураОснования.Вставить("Дата", Формат(Стр.ДатаИсходногоДокумента, "ДЛФ=DT"));
		СтруктураОснования.Вставить("НомерИсправления", Стр.НомерИсправленияИсходногоДокумента);
		СтруктураОснования.Вставить("ДатаИсправления", Формат(Стр.ДатаИсправленияИсходногоДокумента, "ДЛФ=DT"));
		
		СтруктураОснования.Вставить("КодОснованияГУИД", Строка(Стр.ДокументОснование.УникальныйИдентификатор()));
		СтруктураОснования.Вставить("ВидДокументаОснования", Стр.ДокументОснование.Метаданные().Имя); 
		СтруктураОснования.Вставить("НомерОснования", Стр.ДокументОснование.Номер);
		СтруктураОснования.Вставить("ДатаОснования", Формат(Стр.ДокументОснование.Дата, "ДЛФ=DT"));
		СтруктураОснования.Вставить("ДокументОснование", ЗначениеJSON(Стр.ДокументОснование, МассивТипов));
		СтруктураОснования.Вставить("ИсходныйДокумент", СтруктураДокумента.СчетФактураОснование);
		
		МассивОснований.Добавить(СтруктураОснования);
		
	КонецЦикла;  
	
	ПлатежноРасчетныеДокументы = Новый Массив;
	
	Если ЗначениеЗаполнено(Документ.НомерПлатежноРасчетногоДокумента) Тогда
		ПлатежноРасчетныеДокументы.Добавить(Новый Структура("НомерПлатежноРасчетногоДокумента, ДатаПлатежноРасчетногоДокумента", 
		Документ.НомерПлатежноРасчетногоДокумента, Документ.ДатаПлатежноРасчетногоДокумента));
	КонецЕсли;
	
	СтруктураДокумента.Вставить("ПлатежноРасчетныеДокументы", ПлатежноРасчетныеДокументы);
	СтруктураДокумента.Вставить("ДокументыОснования", МассивОснований);
				
КонецПроцедуры

Процедура ЗаписатьОплатуПлатежнойКартой(Документ , СтруктураДокумента)
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");				
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорЭквайринга", "Номер", "НомерДоговораЭквайринга");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМПартнера", "КодПартнераМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорЭквайринга", "КодМДМ", "КодЭквайринговогоТерминалаМДМ"); 
	
	СтруктураДокумента.Вставить("Валюта", Документ.ВалютаДокумента.КодМДМ);		
	СтруктураДокумента.Вставить("ИДПлатежа", Документ.ИДПлатежа);       
	
	RRNКод = Документ.RRNКодОперации;
	
	Если Документ.RRNКодОперации = "111111111111" И ЗначениеЗаполнено(Документ.ТекстСлипЧека) Тогда 
		RRNКод = Чеки.ПолучитьSBPRRNИзСлипЧека(ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Документ.ТекстСлипЧека, Символы.ПС));
	КонецЕсли; 
	
	СтруктураДокумента.Вставить("RRNКод", RRNКод);
	СтруктураДокумента.Вставить("Сумма", Документ.СуммаДокумента);       
	СтруктураДокумента.Вставить("НомерЧекаККМ", Документ.НомерЧекаККМ);
	СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС"); 
		
	Если Документ.ВидОперации = Перечисления.ВидыОперацийОплатаОтПокупателяПлатежнойКартой.ОплатаПокупателя Тогда   
		
		СтруктураДокумента.Вставить("ВидОперации", "Оплата");
		СтруктураДокумента.Вставить("ХозяйственнаяОперация", "ПоступлениеОплатыОтКлиента"); 
		
	Иначе                                                                                    
		
		СтруктураДокумента.Вставить("ВидОперации", "Возврат");
		СтруктураДокумента.Вставить("ХозяйственнаяОперация", "ВозвратОплатыКлиенту");  
		
	КонецЕсли; 
	
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(Документ.НомерЧекаККМ), 1, 0)); 	
	
	МассивОснований = Новый Массив;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента.Владелец.КодМДМПартнера КАК КодПартнераМДМ,
	|	ЕСТЬNULL(ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДоговорКонтрагента.КодМДМ, """") КАК КодДоговораМДМ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СуммаПлатежа,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СуммаПлатежа КАК Сумма,
	|	ЕСТЬNULL(ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.КодМДМ, """") КАК КодСтатьиДвиженияДенежныхСредствМДМ,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом КАК _ДокументРасчетовСКонтрагентом,
	|	ЕСТЬNULL(ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом.Номер, """") КАК _ДокументРасчетовСКонтрагентомНомер,
	|	ЕСТЬNULL(ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом.Дата, """") КАК _ДокументРасчетовСКонтрагентомДата,
	|	&ВалютаВзаиморасчетов,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СуммаНДС,
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.СтавкаНДС КАК _СтавкаНДС
	|ИЗ
	|	Документ.ОплатаОтПокупателяПлатежнойКартой.РасшифровкаПлатежа КАК ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа
	|ГДЕ
	|	ОплатаОтПокупателяПлатежнойКартойРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", СтруктураДокумента.Валюта); 
	
	Массив = МассивПоддерживаемыхТиповJSON();
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Структура = Новый Структура;
		ЗаполнитьКоллекциюЗначений(Структура, Выборка, Выборка.Владелец().Колонки, Массив);
		
		Структура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выборка._СтавкаНДС));
		
		Если ЗначениеЗаполнено(Выборка._ДокументРасчетовСКонтрагентом) Тогда
			
			Структура.Вставить("КодДокументаРасчетовГУИД", XMLСтрока(Выборка._ДокументРасчетовСКонтрагентом));
			Структура.Вставить("ВидДокументаРасчетов", Выборка._ДокументРасчетовСКонтрагентом.Метаданные().Имя);
			Структура.Вставить("НомерДокументаРасчетов", Выборка._ДокументРасчетовСКонтрагентомНомер);
			Структура.Вставить("ДатаДокументаРасчетов", Строка(Выборка._ДокументРасчетовСКонтрагентомДата));
			
		Иначе
			
			Структура.Вставить("КодДокументаРасчетовГУИД", "");
			Структура.Вставить("ВидДокументаРасчетов", "");
			Структура.Вставить("НомерДокументаРасчетов", "");
			Структура.Вставить("ДатаДокументаРасчетов", "");
			
		КонецЕсли;   
		
		Структура.Вставить("ДокументРасчетовСКонтрагентом", ЗначениеJSON(Выборка._ДокументРасчетовСКонтрагентом, Массив));
		МассивОснований.Добавить(Структура);
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("РасшифровкаПлатежа", МассивОснований);
	
КонецПроцедуры

Процедура ЗаписатьСостоянияДокументовНаСкладах(СтруктураДокумента , ДополнПараметры)
	
	//+ Пашкин О.А. 12.02.2025 #UT11-5465
	Если ДополнПараметры.Свойство("ДатаСостояния") И ЗначениеЗаполнено(ДополнПараметры.ДатаСостояния) Тогда
		СтруктураДокумента.Вставить("ДатаСостояния", Формат(Дата(ДополнПараметры.ДатаСостояния), "ДЛФ=DT"));
	Иначе
		СтруктураДокумента.Вставить("ДатаСостояния", Формат(НачалоДня(ТекущаяДата()), "ДЛФ=DT"));
	КонецЕсли;
	//- Пашкин О.А. 12.02.2025 #UT11-5465
	
	Идентификаторы = Новый Массив;
	Идентификаторы.Добавить("КодМДМ");
	Идентификаторы.Добавить("КоличествоНаСкладе");
	Идентификаторы.Добавить("КоличествоДоступно");
	Идентификаторы.Добавить("КоличествоВПути");
	Идентификаторы.Добавить("КоличествоВРезерве");
	Идентификаторы.Добавить("НаПриемке");
	Идентификаторы.Добавить("ЗаказаноПоставщику");
	Идентификаторы.Добавить("ВНедоступныхЯчейках"); 
	Идентификаторы.Добавить("НаПриемкеПоПеремещению");
	
	//+Макрушин Е. 12.12.2025 #UT10-5579
	Идентификаторы.Добавить("ОстатокТОХ");
	//-Макрушин Е. 12.12.2025 #UT10-5579
		
	СтруктураДокумента.Вставить("Идентификаторы", Идентификаторы);
	
	Товары = Новый Массив;
	
	Запрос = Новый Запрос;                    
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.Номенклатура, ТоварыНаСкладахОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток_Врезерве,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток_Наскладах
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			&Дата,
	|			Склад = &Склад
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&Дата,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ОтборПоКодам
	|							ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|		ПО ТоварыВРезервеНаСкладахОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ.Номенклатура, ТоварыКПолучениюНаСкладыОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ.КоличествоОстаток_Врезерве, 0) КАК КоличествоОстаток_Врезерве,
	|	ЕСТЬNULL(ВТ.КоличествоОстаток_Наскладах, 0) КАК КоличествоОстаток_Наскладах,
	|	ЕСТЬNULL(ТоварыКПолучениюНаСкладыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток_Кполучению
	|ПОМЕСТИТЬ ВТ_2
	|ИЗ
	|	ВТ КАК ВТ
	|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПолучениюНаСклады.Остатки(
	|				&Дата,
	|				Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ОтборПоКодам
	|							ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ТоварыКПолучениюНаСкладыОстатки
	|		ПО ВТ.Номенклатура = ТоварыКПолучениюНаСкладыОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	СУММА(ТоварыНаСкладахОбороты.КоличествоПриход) КАК НаПриемкеПоПеремещению
	|ПОМЕСТИТЬ ПТУнаПриемке
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаПТУ,
	|			,
	|			Регистратор,
	|			Склад = &Склад
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыНаСкладахОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ТоварыНаСкладахОбороты.Регистратор = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &Свойство)
	|			И (ЗначенияСвойствОбъектов.Значение = &ЗначениеСвойства)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках КАК ТоварыВЯчейках
	|		ПО (ТоварыВЯчейках.Регистратор ССЫЛКА Документ.РазмещениеПоЯчейкам)
	|			И ТоварыНаСкладахОбороты.Регистратор = ТоварыВЯчейках.Регистратор.ДокументОснование
	|			И ТоварыНаСкладахОбороты.Номенклатура = ТоварыВЯчейках.Номенклатура
	|ГДЕ
	|	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|	И ТоварыНаСкладахОбороты.Регистратор.Контрагент = &Контрагент
	|	И ТоварыНаСкладахОбороты.Регистратор.Экспресс = ЛОЖЬ
	|	И ТоварыНаСкладахОбороты.Регистратор.ТранзитнаяПоставка = ЛОЖЬ
	|	И ЕСТЬNULL(ТоварыВЯчейках.Количество, 0) <= 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_2.Номенклатура, ПТУнаПриемке.Номенклатура) КАК Номенклатура,
	|	СУММА(ЕСТЬNULL(ВТ_2.КоличествоОстаток_Врезерве, 0)) КАК КоличествоОстаток_Врезерве,
	|	СУММА(ЕСТЬNULL(ВТ_2.КоличествоОстаток_Наскладах, 0)) КАК КоличествоОстаток_Наскладах,
	|	СУММА(ЕСТЬNULL(ВТ_2.КоличествоОстаток_Кполучению, 0)) КАК КоличествоОстаток_Кполучению,
	|	СУММА(ЕСТЬNULL(ВТ_2.КоличествоОстаток_Наскладах, 0) - ЕСТЬNULL(ВТ_2.КоличествоОстаток_Врезерве, 0)) КАК КоличествоОстаток_Доступно,
	|	СУММА(ЕСТЬNULL(ПТУнаПриемке.НаПриемкеПоПеремещению, 0)) КАК НаПриемкеПоПеремещению
	|ПОМЕСТИТЬ ВТ_3
	|ИЗ
	|	ВТ_2 КАК ВТ_2
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПТУнаПриемке КАК ПТУнаПриемке
	|		ПО ВТ_2.Номенклатура = ПТУнаПриемке.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ВТ_2.Номенклатура, ПТУнаПриемке.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ЗаказаноУПоставщиков
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&Дата,
	|			ЗаказПоставщику.Склад = &Склад
	|				И НЕ Номенклатура.КодМДМ = """"
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РазмещеноЗаказов
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			&Дата,
	|			ЗаказПоставщику.Склад = &Склад
	|				И НЕ Номенклатура.КодМДМ = """"
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ЗаказаноУПоставщиков.Номенклатура, РазмещеноЗаказов.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ЗаказаноУПоставщиков.КоличествоОстаток, 0) КАК Заказано,
	|	ЕСТЬNULL(РазмещеноЗаказов.КоличествоОстаток, 0) КАК Размещено,
	|	ЕСТЬNULL(ЗаказаноУПоставщиков.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещеноЗаказов.КоличествоОстаток, 0) КАК УжеЗаказано
	|ПОМЕСТИТЬ ЗаказаноИРазмещено
	|ИЗ
	|	ЗаказаноУПоставщиков КАК ЗаказаноУПоставщиков
	|		ПОЛНОЕ СОЕДИНЕНИЕ РазмещеноЗаказов КАК РазмещеноЗаказов
	|		ПО ЗаказаноУПоставщиков.Номенклатура = РазмещеноЗаказов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва КАК ЗаказПокупателя
	|ПОМЕСТИТЬ ТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|			&Дата,
	|			Склад = &Склад
	|				И ДокументРезерва ССЫЛКА Документ.ЗаказПокупателя
	|				И ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыВРезервеНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
//+Макрушин Е. 12.12.2025 #UT10-5579	
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапросТоварыТОХ.Номенклатура,
	|	ВЫБОР
	|		КОГДА ЗапросТоварыТОХ.КоличествоОстатокТОХ - ЕСТЬNULL(ЗапросТоварыТОХПереданные.КоличествоОстатокТОХПереданные, 0) > 0
	|			ТОГДА ЗапросТоварыТОХ.КоличествоОстатокТОХ - ЕСТЬNULL(ЗапросТоварыТОХПереданные.КоличествоОстатокТОХПереданные, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОстатокТОХ
	|ПОМЕСТИТЬ ВТ_ТоварыТОХ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыОтветственногоХраненияОстатки.Номенклатура КАК Номенклатура,
	|		СУММА(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток) КАК КоличествоОстатокТОХ
	|	ИЗ
	|		РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	|				&Дата,
	|				ВЫБОР
	|					КОГДА &ОтборПоКодам
	|						ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыОтветственногоХраненияОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТоварыОтветственногоХраненияОстатки.Номенклатура) КАК ЗапросТоварыТОХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура КАК Номенклатура,
	|			СУММА(ТоварыОтветственногоХраненияПереданныеОстатки.КоличествоОстаток) КАК КоличествоОстатокТОХПереданные
	|		ИЗ
	|			РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	|					&Дата,
	|					ВЫБОР
	|						КОГДА &ОтборПоКодам
	|							ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ТоварыОтветственногоХраненияПереданныеОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТоварыОтветственногоХраненияПереданныеОстатки.Номенклатура) КАК ЗапросТоварыТОХПереданные
	|		ПО ЗапросТоварыТОХ.Номенклатура = ЗапросТоварыТОХПереданные.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
//-Макрушин Е. 12.12.2025 #UT10-5579	
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_3.Номенклатура, ЗаказаноИРазмещено.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0) КАК КоличествоОстаток_Врезерве,
	|	ЕСТЬNULL(ВТ_3.КоличествоОстаток_Наскладах, 0) КАК КоличествоОстаток_Наскладах,
	|	ЕСТЬNULL(ВТ_3.КоличествоОстаток_Кполучению, 0) КАК КоличествоОстаток_Кполучению,
	|	ЕСТЬNULL(ЗаказаноИРазмещено.УжеЗаказано, 0) КАК УжеЗаказано,
	|	ЕСТЬNULL(ВТ_3.КоличествоОстаток_Наскладах, 0) - ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_3.КоличествоОстаток_Наскладах, 0) - ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0) > ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)
	|			ТОГДА ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_3.КоличествоОстаток_Наскладах, 0) - ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0)
	|	КОНЕЦ - ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0) КАК КоличествоНаПриемке,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_3.КоличествоОстаток_Доступно, 0) <= ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|			ТОГДА ЕСТЬNULL(ВТ_3.КоличествоОстаток_Доступно, 0)
	|		ИНАЧЕ ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ВТ_3.КоличествоОстаток_Врезерве, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) + ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)
	|	КОНЕЦ КАК КоличествоДоступно,
	|	ЕСТЬNULL(ТоварыВЯчейкахНедоступныеОстатки.КоличествоОстаток, 0) КАК ВНедоступныхЯчейках,
	|	ЕСТЬNULL(ВТ_3.НаПриемкеПоПеремещению, 0) КАК НаПриемкеПоПеремещению,
//+Макрушин Е. 12.12.2025 #UT10-5579
	|	ЕСТЬNULL(ВТ_ТоварыТОХ.ОстатокТОХ, 0) КАК ОстатокТОХ
//-Макрушин Е. 12.12.2025 #UT10-5579	
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ВТ_3 КАК ВТ_3
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				&Дата,
	|				НЕ Ячейка.НеУчитыватьВОперативномУчете
	|					И Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ОтборПоКодам
	|							ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ТоварыВЯчейкахОстатки
	|		ПО ВТ_3.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
	|		ПОЛНОЕ СОЕДИНЕНИЕ ЗаказаноИРазмещено КАК ЗаказаноИРазмещено
	|		ПО ВТ_3.Номенклатура = ЗаказаноИРазмещено.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
	|				&Дата,
	|				(ЗаказПокупателя, Номенклатура) В
	|					(ВЫБРАТЬ
	|						ТоварыВРезерве.ЗаказПокупателя КАК ЗаказПокупателя,
	|						ТоварыВРезерве.Номенклатура
	|					ИЗ
	|						ТоварыВРезерве КАК ТоварыВРезерве)) КАК ТоварыВСборкеОстатки
	|		ПО ВТ_3.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
	|				&Дата,
	|				Ячейка.НеУчитыватьВОперативномУчете = ИСТИНА
	|					И Склад = &Склад
	|					И ВЫБОР
	|						КОГДА &ОтборПоКодам
	|							ТОГДА Номенклатура.КодМДМ В (&КодыМДМ)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ТоварыВЯчейкахНедоступныеОстатки
	|		ПО ВТ_3.Номенклатура = ТоварыВЯчейкахНедоступныеОстатки.Номенклатура
//+Макрушин Е. 12.12.2025 #UT10-5579
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТоварыТОХ КАК ВТ_ТоварыТОХ
	|		ПО ВТ_3.Номенклатура = ВТ_ТоварыТОХ.Номенклатура
//-Макрушин Е. 12.12.2025 #UT10-5579	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.КоличествоОстаток_Врезерве,
	|	ИтоговаяТаблица.КоличествоОстаток_Наскладах,
	|	ИтоговаяТаблица.КоличествоОстаток_Кполучению,
	|	ИтоговаяТаблица.УжеЗаказано,
	|	ИтоговаяТаблица.КоличествоНаПриемке,
	|	ИтоговаяТаблица.КоличествоДоступно,
	|	ИтоговаяТаблица.ВНедоступныхЯчейках,
	|	ИтоговаяТаблица.НаПриемкеПоПеремещению,
	|	ИтоговаяТаблица.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
//+Макрушин Е. 12.12.2025 #UT10-5579	
	|	ИтоговаяТаблица.ОстатокТОХ
//-Макрушин Е. 12.12.2025 #UT10-5579	
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ОтборПоКодам
	|				ТОГДА ИтоговаяТаблица.Номенклатура.КодМДМ В (&КодыМДМ)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ИтоговаяТаблица.Номенклатура.КодМДМ <> """"";
	
	Запрос.УстановитьПараметр("Дата",  Новый Граница(КонецДня(НачалоДня(ТекущаяДата()) - 1), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Склад", ДополнПараметры.Склад);
	Запрос.УстановитьПараметр("ОтборПоКодам", ЗначениеЗаполнено(ДополнПараметры.КодыМДМ));
	Запрос.УстановитьПараметр("КодыМДМ", ДополнПараметры.КодыМДМ);
	//Дата выбрана по причине того, что ранее допускались ошибки в статусе документа и 
	//на момент доработки было принято решение, что более старые документы не нужно учитывать
	Запрос.УстановитьПараметр("ДатаПТУ", Дата('2024.01.01 00:00:01'));
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
	Запрос.УстановитьПараметр("ЗначениеСвойства", Перечисления.СтатусыПриемки.Обработка);
	Запрос.УстановитьПараметр("Контрагент", Константы.ОсновнойПоставщик.Получить());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();  
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Запись = Новый Массив;
		//+Пашкин О. 06.02.2025 #UT10-5084
		//Запись.Добавить(РезультатЗапроса.Номенклатура.КодМДМ);
		Запись.Добавить(РезультатЗапроса.НоменклатураКодМДМ);
		//+Пашкин О. 06.02.2025 #UT10-5084
		Запись.Добавить(?(РезультатЗапроса.КоличествоОстаток_Наскладах >=0, РезультатЗапроса.КоличествоОстаток_Наскладах, 0));
		Запись.Добавить(?(РезультатЗапроса.КоличествоДоступно >= 0, РезультатЗапроса.КоличествоДоступно, 0));
		Запись.Добавить(?(РезультатЗапроса.КоличествоОстаток_Кполучению >= 0, РезультатЗапроса.КоличествоОстаток_Кполучению, 0));
		Запись.Добавить(?(РезультатЗапроса.КоличествоОстаток_Врезерве >= 0, РезультатЗапроса.КоличествоОстаток_Врезерве, 0));
		Запись.Добавить(?(РезультатЗапроса.КоличествоНаПриемке >= 0, РезультатЗапроса.КоличествоНаПриемке, 0));
		Запись.Добавить(?(РезультатЗапроса.УжеЗаказано >= 0, РезультатЗапроса.УжеЗаказано, 0));
		Запись.Добавить(?(РезультатЗапроса.ВНедоступныхЯчейках >= 0, РезультатЗапроса.ВНедоступныхЯчейках, 0)); 
		Запись.Добавить(?(РезультатЗапроса.НаПриемкеПоПеремещению >= 0, РезультатЗапроса.НаПриемкеПоПеремещению, 0));
		
		//+Макрушин Е. 12.12.2025 #UT10-5579
		Запись.Добавить(?(РезультатЗапроса.ОстатокТОХ >= 0, РезультатЗапроса.ОстатокТОХ, 0));
		//-Макрушин Е. 12.12.2025 #UT10-5579
		
		Товары.Добавить(Запись);
		
	КонецЦикла; 
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьРеквизитыНоменклатуры(СтруктураДокумента, ДополнПараметры)
	
	СтруктураДокумента.Вставить("ТипСодержимого", "application/json");
	СтруктураДокумента.Вставить("ВидДокумента", "ПередачаРеквизитовНоменклатуры");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	Номенклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара,
	|	Номенклатура.КратностьФилиала
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.КодМДМ = """"
	|			И (Номенклатура.НеЗагружатьЦеныЕслиЕстьОстатокТовара
	|				ИЛИ НЕ Номенклатура.КратностьФилиала = 0)";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Товары  = Новый Массив;
	
	КолСтрокВСообщении = 0;
	
	Если НЕ РезультатЗапроса.Пустой() Тогда   
		
		КолСтрокВСообщении = СокрЛП(РезультатЗапроса.Выгрузить().Количество());
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ТоварыСтруктура = Новый Структура;
			
			ТоварыСтруктура.Вставить("НоменклатураКодМДМ" 	                      , ВыборкаЗапроса.НоменклатураКодМДМ);
			ТоварыСтруктура.Вставить("НеЗагружатьЦеныЕслиЕстьОстатокТовара" 	  , ВыборкаЗапроса.НеЗагружатьЦеныЕслиЕстьОстатокТовара);
			ТоварыСтруктура.Вставить("КратностьФилиала" 	                      , ВыборкаЗапроса.КратностьФилиала);
			Товары.Добавить(ТоварыСтруктура);
			
		КонецЦикла;
		
	КонецЕсли; 
	
	СтруктураДокумента.Вставить("КоличествоСтрок", КолСтрокВСообщении);
	СтруктураДокумента.Вставить("Товары"  , Товары);
	
КонецПроцедуры 
	
Процедура ЗаписатьПредопределенныеРеквизитыДокумента(Документ , СтруктураДокумента , ОтменаПроведения , ИмяДокумента) 	
 
	СтруктураДокумента.Вставить("УникальныйИдентификатор" , Строка(Документ.Ссылка.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента"          , СокрЛП(Документ.Номер));
	СтруктураДокумента.Вставить("ДатаДокумента"           , Формат(Документ.Дата, "ДЛФ=DT"));	
	СтруктураДокумента.Вставить("Статус"                  , ?(Документ.Проведен, ?(ОтменаПроведения, 0, 1), 0)); 
	СтруктураДокумента.Вставить("ШтампВерсии"             , Документ.ШтампВерсии); 
	СтруктураДокумента.Вставить("ПометкаУдаления"         , Документ.ПометкаУдаления); 
	СтруктураДокумента.Вставить("Комментарий"			  , ?(ОбщегоНазначения.ЕстьРеквизитДокумента("Комментарий", Документ.Метаданные()), Документ.Комментарий, ""));
	
	Если ИмяДокумента = "КорректировкаПоступления" ИЛИ ИмяДокумента = "УстановкаЦенНоменклатуры" 
		ИЛИ ИмяДокумента = "УстановкаЦенНоменклатурыКонтрагентов"
		ИЛИ ИмяДокумента = "ПоступлениеУслугПрочихАктивов" Тогда  
		
		СтруктураДокумента.Вставить("ТипСодержимого" , "application/json");
		СтруктураДокумента.Вставить("ВидДокумента"   , ИмяДокумента);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьВозвратТоваровОтПокупателя(Документ , СтруктураДокумента , ПеречитатьРегистры)

	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодФилиалаМДМ");	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Грузополучатель", "КодМДМ", "КодФилиалаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Договор", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорКонтрагента", "КодМДМ", "КодДоговораМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Склад", "КодМДМ", "КодСкладаМДМ");     	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СуммаДокумента", "Сумма");  
	
	СтруктураДокумента.Вставить("КодПартнераМДМ", "");	
	
	СуммаНДС = Документ.Товары.Итог("СуммаНДС");
	СтруктураДокумента.Вставить("СуммаНДС", СуммаНДС);	
	
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
	КодСоглашенияАварда = "";	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыАварды.КодАварда
	|ИЗ
	|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	|ГДЕ
	|	ДоговорыАварды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();	  
	
	Пока Выборка.Следующий() Цикл     
		КодСоглашенияАварда = КодСоглашенияАварда + ?(ЗначениеЗаполнено(КодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(Выборка.КодАварда), " ", ""); 
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", КодСоглашенияАварда);
	
	Если Документ.Товары.Количество() > 0 И ЗначениеЗаполнено(Документ.Товары[0].ЗаказПокупателя) Тогда 
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", Документ.Товары[0].ЗаказПокупателя.КлючСтрокиУсловий);   
	Иначе                                                                      
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", 0);                
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ВозвратТоваровОтПокупателяТовары.Количество,
	|	ВозвратТоваровОтПокупателяТовары.СтавкаНДС,
	|	ВозвратТоваровОтПокупателяТовары.Сумма,
	|	ВозвратТоваровОтПокупателяТовары.СуммаНДС,
	|	ВозвратТоваровОтПокупателяТовары.Цена,
	|	ВозвратТоваровОтПокупателяТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	|	ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя,
	|	ВозвратТоваровОтПокупателяТовары.НомерСтроки КАК НомерСтроки,
	|	ВозвратТоваровОтПокупателяТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	|	ВозвратТоваровОтПокупателяТовары.ДокументПартии
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);  
	
	Выб = Запрос.Выполнить().Выбрать();     
	
	Пока Выб.Следующий() Цикл  
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);		
		ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		ТоварыСтруктура.Вставить("ГУИДДокументаОснование", Строка(Выб.ДокументПартии.УникальныйИдентификатор()));		
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Товары", Товары);

КонецПроцедуры                                

Процедура ЗаписатьРеализацияТоваровУслуг(Документ , СтруктураДокумента , ПеречитатьРегистры)
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодФилиалаМДМ");	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Грузополучатель", "КодМДМ", "КодФилиалаМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Договор", "КодМДМ", "КодДоговораМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорКонтрагента", "КодМДМ", "КодДоговораМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Склад", "КодМДМ", "КодСкладаМДМ");     	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СуммаДокумента", "Сумма");     	
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМПартнера", "КодПартнераМДМ");	
	
	СуммаНДС = Документ.Товары.Итог("СуммаНДС");
	СтруктураДокумента.Вставить("СуммаНДС", СуммаНДС);	
	
	Валюта = Документ.ВалютаДокумента;
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
	СтруктураДокумента.Вставить("КодОрганизацииИС", "");
	СтруктураДокумента.Вставить("КодКонтрагентаИС", "");
	СтруктураДокумента.Вставить("КодПартнераИС", "");
	СтруктураДокумента.Вставить("КодФилиалаИС", "");
	СтруктураДокумента.Вставить("КодДоговораИС", "");
	СтруктураДокумента.Вставить("КодСкладаИС", "");
	СтруктураДокумента.Вставить("ВалютаЦифровойКод", "");
	СтруктураДокумента.Вставить("ВалютаБуквенныйКод", "");
	СтруктураДокумента.Вставить("АдресДоставки", Документ.АдресДоставки);
	
    //Управленческая организация
	Если Документ.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить() Тогда
		СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаНеОблагаетсяНДС");	
	Иначе
		СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");
	КонецЕсли;
	
	КроссДокинг = Ложь;
	
	Для каждого Стр ИЗ Документ.Товары Цикл
		
		Если Стр.ЗаказПокупателя.КроссДокинг Тогда
			
			КроссДокинг = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КроссДокинг", Число(КроссДокинг));
	СтруктураДокумента.Вставить("ОтражатьВУправленческомУчете", Число(Документ.ОтражатьВУправленческомУчете));
	
	КодСоглашенияАварда = "";	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыАварды.КодАварда
	|ИЗ
	|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	|ГДЕ
	|	ДоговорыАварды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();	     
	
	Пока Выборка.Следующий() Цикл   
		КодСоглашенияАварда = КодСоглашенияАварда + ?(ЗначениеЗаполнено(КодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(Выборка.КодАварда), " ", "");  
	КонецЦикла;
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", КодСоглашенияАварда);
	
	Если Документ.Товары.Количество() > 0 И ЗначениеЗаполнено(Документ.Товары[0].ЗаказПокупателя) Тогда 
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", Документ.Товары[0].ЗаказПокупателя.КлючСтрокиУсловий); 
	Иначе                                                                                      
		СтруктураДокумента.Вставить("КлючСтрокиУсловий", 0);                                
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Водитель", Строка(Документ.Водитель));
	СтруктураДокумента.Вставить("ОбратнаяПродажа", 0);
	СтруктураДокумента.Вставить("КоличествоКорректировок", 0); 
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(Документ.НомерЧекаККМ), 1, 0)); 	
	СтруктураДокумента.Вставить("ДатаПлатежа", Формат(Документ.ДатаПлатежа, "ДЛФ=DT"));
	
	//+Бычков О. 23.10.2025 #UT10-5480
	// Вставка
	Если ЭтоРеализацияТоваровИУслугПоОрганизацииТОХ(Документ.Ссылка) Тогда
		
	    ТекКодМДМОрганизацииТОХ = Константы.КодМДМОрганизацииТОХ.Получить();
		
		СтруктураДокумента.Вставить("КодМДМОрганизацииТОХ", ТекКодМДМОрганизацииТОХ);
		
		ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "ДоговорПоставщикаТОХ", "КодМДМ", "ДоговорПоставщикаТОХКодМДМ");

	КонецЕсли;
	//-Бычков О. 23.10.2025 #UT10-5480
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если Документ.Движения.Найти("Продажи") <> Неопределено Тогда
		
		ПродажиМассив = Новый Массив;
		
		Если ПеречитатьРегистры Тогда
			Документ.Движения.Продажи.Прочитать();
		КонецЕсли;
		
		ТаблицаПродаж = Документ.Движения.Продажи.Выгрузить();
		ТаблицаПродаж.Свернуть("ЗаказПокупателя", "Стоимость, НДС");
		
		Для каждого Продажа Из ТаблицаПродаж Цикл
			
			Если Не ЗначениеЗаполнено(Продажа.ЗаказПокупателя) Тогда
				Продолжить;
			КонецЕсли;
			
			ПродажиСтруктура = Новый Структура;    
			ПродажиСтруктура.Вставить("УникальныйИдентификатор", Строка(Продажа.ЗаказПокупателя.УникальныйИдентификатор()));
			ПродажиСтруктура.Вставить("Номер", СокрЛП(Продажа.ЗаказПокупателя.Номер));
			ПродажиСтруктура.Вставить("Дата",  Формат(Продажа.ЗаказПокупателя.Дата, "ДЛФ=DT"));
			ПродажиСтруктура.Вставить("Сумма", Продажа.Стоимость);
			ПродажиСтруктура.Вставить("СуммаНДСЗаказа", Продажа.НДС);
			ПродажиСтруктура.Вставить("УИПортал", Продажа.ЗаказПокупателя.IDЗаказаПортал);
			
			ПродажиМассив.Добавить(ПродажиСтруктура);   		
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Заказы", ПродажиМассив);
		
	КонецЕсли;
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслугТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА РеализацияТоваровУслугТовары.Сумма
	|		ИНАЧЕ РеализацияТоваровУслугТовары.Сумма + РеализацияТоваровУслугТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	РеализацияТоваровУслугТовары.СуммаНДС,
	|	РеализацияТоваровУслугТовары.Цена,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслугТовары.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|			ТОГДА """"
	|		КОГДА РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
	|			ТОГДА """"
	|		ИНАЧЕ ""ПродажаСоСторСклада""
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	РеализацияТоваровУслугТовары.ЗаказПокупателя,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	|	РеализацияТоваровУслугТовары.СерияНоменклатуры.Наименование КАК СерияНоменклатуры,
	//+Шульман А. 18.11.2024 #UT10-4903 
	|	РеализацияТоваровУслугТовары.ЗаказПокупателя.ТипЦен.КодМДМ КАК ТипЦенКодМДМ    
	//-Шульман А. 18.11.2024 #UT10-4903 
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка";  
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка);  
	
	//+Бычков О. 28.11.2025 #UT10-5543
	// Было
	//Выб = Запрос.Выполнить().Выбрать();
	// Стало
	Запрос.Текст = Запрос.Текст
		+ "
		  |;
		  |
		  |////////////////////////////////////////////////////////////////////////////////
		  |";
	Запрос.Текст = Запрос.Текст
		+ "ВЫБРАТЬ
		  |	РеализацияТоваровУслугУслуги.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
		  |	РеализацияТоваровУслугУслуги.Количество,
		  |	РеализацияТоваровУслугУслуги.СтавкаНДС,
		  |	ВЫБОР
		  |		КОГДА РеализацияТоваровУслугУслуги.Ссылка.СуммаВключаетНДС
		  |			ТОГДА РеализацияТоваровУслугУслуги.Сумма
		  |		ИНАЧЕ РеализацияТоваровУслугУслуги.Сумма + РеализацияТоваровУслугУслуги.СуммаНДС
		  |	КОНЕЦ КАК Сумма,
		  |	РеализацияТоваровУслугУслуги.СуммаНДС,
		  |	РеализацияТоваровУслугУслуги.Цена,
		  |	ВЫБОР
		  |		КОГДА РеализацияТоваровУслугУслуги.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
		  |			ТОГДА """"
		  |		КОГДА РеализацияТоваровУслугУслуги.ЗаказПокупателя.IDСклада_СтороннийСклад = ЗНАЧЕНИЕ(Справочник.СторонниеСклады.ПустаяСсылка)
		  |			ТОГДА """"
		  |		ИНАЧЕ ""ПродажаСоСторСклада""
		  |	КОНЕЦ КАК НаправлениеДеятельности,
		  |	РеализацияТоваровУслугУслуги.НомерСтроки КАК НомерСтроки,
		  |	РеализацияТоваровУслугУслуги.ЗаказПокупателя.ТипЦен.КодМДМ КАК ТипЦенКодМДМ
		  |ИЗ
		  |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		  |ГДЕ
		  |	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка";  
		
	ТекРезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ТекРезультатЗапроса = ТекРезультатыЗапроса[0];
	
	Выб = ТекРезультатЗапроса.Выбрать();
	//-Бычков О. 28.11.2025 #UT10-5543
	
	Пока Выб.Следующий() Цикл                     
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		ТоварыСтруктура.Вставить("КодЗаказаГУИД", Строка(Выб.ЗаказПокупателя.УникальныйИдентификатор()));
		ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", ?(ЗначениеЗаполнено(Выб.КодМДМСтранаПроисхождения), СокрЛП(Выб.КодМДМСтранаПроисхождения), ""));
		ТоварыСтруктура.Вставить("НаправлениеДеятельности", ?(ЗначениеЗаполнено(Выб.НаправлениеДеятельности), СокрЛП(Выб.НаправлениеДеятельности), "")); 	   
		//+Шульман А. 18.11.2024 #UT10-4903 
		ТоварыСтруктура.Вставить("ВидЦены", ?(ЗначениеЗаполнено(Выб.ТипЦенКодМДМ), СокрЛП(Выб.ТипЦенКодМДМ), ""));
		//-Шульман А. 18.11.2024 #UT10-4903 
		
		Если Документ.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить() Тогда
			
			ТоварыСтруктура.Вставить("СуммаНДС", 0);		
			ТоварыСтруктура.Вставить("СтавкаНДС", 0);
					
		Иначе
			
			ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);		
			ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));
		
		КонецЕсли;
		
		ТоварыСтруктура.Вставить("ИнвентарныйНомер", "");
		ТоварыСтруктура.Вставить("Артикул", "");
		ТоварыСтруктура.Вставить("НаименованиеПроизводителя", "");
		ТоварыСтруктура.Вставить("НазваниеЕдиницыИзмерения", "");
		ТоварыСтруктура.Вставить("СерияНоменклатуры", Выб.СерияНоменклатуры);
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
	//+Бычков О. 01.12.2025 #UT10-5543
	// Вставка
	ТекРезультатЗапроса = ТекРезультатыЗапроса[1];
	
	Выб = ТекРезультатЗапроса.Выбрать();
	
	Услуги = Новый Массив;
	
	Пока Выб.Следующий() Цикл                     
		
		УслугиСтруктура = Новый Структура;
		
		УслугиСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		УслугиСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		УслугиСтруктура.Вставить("Количество", Выб.Количество);
		УслугиСтруктура.Вставить("Цена", Выб.Цена);
		УслугиСтруктура.Вставить("Сумма", Выб.Сумма);
		УслугиСтруктура.Вставить("НаправлениеДеятельности", ?(ЗначениеЗаполнено(Выб.НаправлениеДеятельности), СокрЛП(Выб.НаправлениеДеятельности), "")); 	   
		УслугиСтруктура.Вставить("ВидЦены", ?(ЗначениеЗаполнено(Выб.ТипЦенКодМДМ), СокрЛП(Выб.ТипЦенКодМДМ), ""));
		
		Если Документ.Организация = Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить() Тогда
			
			УслугиСтруктура.Вставить("СуммаНДС", 0);		
			УслугиСтруктура.Вставить("СтавкаНДС", 0);
					
		Иначе
			
			УслугиСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);		
			УслугиСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));
		
		КонецЕсли;
		
		УслугиСтруктура.Вставить("ИнвентарныйНомер", "");
		УслугиСтруктура.Вставить("Артикул", "");
		УслугиСтруктура.Вставить("НаименованиеПроизводителя", "");
		УслугиСтруктура.Вставить("НазваниеЕдиницыИзмерения", "");
		УслугиСтруктура.Вставить("СерияНоменклатуры", "");
		
		Услуги.Добавить(УслугиСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Услуги", Услуги);
	
	//-Бычков О. 01.12.2025 #UT10-5543
	
КонецПроцедуры                                

Процедура ЗаписатьРеализацияТоваровУслугКакПеремещениеТоваровМеждуСкладами(Документ , СтруктураДокумента , ПеречитатьРегистры) 	

	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");
	
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СуммаДокумента", "Сумма");     	
	СтруктураДокумента.Вставить("СуммаНДС", УчетНДС.ПолучитьНДСДокумента(Документ,"Товары"));
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда

		//+Бычков О. 30.04.2025 #UT10-5208
		// Вставка
	    ТекКодМДМОрганизацииТОХ = "";
		
		//+Бычков О. 23.10.2025 #UT10-5480
		// Было
		//ТекЗапросТОХ = Новый Запрос;
		//
		//ТекЗапросТОХ.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		//                     |	МАКСИМУМ(РеализацияТоваровУслугТовары.ЗаказПокупателя.ДоговорПоставщикаТОХ) КАК ДоговорПоставщикаТОХ
		//                     |ИЗ
		//                     |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//                     |ГДЕ
		//                     |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		//                     |	И НЕ ЕСТЬNULL(РеализацияТоваровУслугТовары.ЗаказПокупателя.ДоговорПоставщикаТОХ, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)";
		//
		//ТекЗапросТОХ.УстановитьПараметр("Ссылка", Документ.Ссылка);
		//
		//ТекРезультатЗапросаТОХ = ТекЗапросТОХ.Выполнить();
		//
		//Если Не ТекРезультатЗапросаТОХ.Пустой() Тогда
		//	
		//	ТекВыборка = ТекРезультатЗапросаТОХ.Выбрать();
		//	
		//	Если ТекВыборка.Следующий() Тогда
		//	
		//		Если ЗначениеЗаполнено(ТекВыборка.ДоговорПоставщикаТОХ) Тогда
		//			ТекКодМДМОрганизацииТОХ = Константы.КодМДМОрганизацииТОХ.Получить();
		//		КонецЕсли;
		//	
		//	КонецЕсли;
		//	
		//КонецЕсли;
		// Стало
		Если ЭтоРеализацияТоваровИУслугПоОрганизацииТОХ(Документ.Ссылка) Тогда
		    ТекКодМДМОрганизацииТОХ = Константы.КодМДМОрганизацииТОХ.Получить();
		КонецЕсли;
		//-Бычков О. 23.10.2025 #UT10-5480
		
		СтруктураДокумента.Вставить("КодМДМОрганизацииТОХ", ТекКодМДМОрганизацииТОХ);
		//-Бычков О. 30.04.2025 #UT10-5208
		
		СтруктураДокумента.Вставить("НомерДокументаУТ11", ВРег(Лев(СокрЛП(Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить()), 2)) 
		+ "0" + Лев(Прав(СокрЛП(Документ.Номер), 6), 1) + "-Р" + Прав(СокрЛП(Документ.Номер), 5));
		
		ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Склад", "КодМДМ", "КодСкладаМДМ");
		ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Грузополучатель", "ТранзитныйСкладКодМДМ", "КодСкладаПолучателяМДМ");
		
	Иначе
		
		СтруктураДокумента.Вставить("НомерДокументаУТ11", ВРег(Лев(СокрЛП(Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить()), 2))
		+ "0" + Лев(Прав(СокрЛП(Документ.Номер), 6), 1) + "-П" + Прав(СокрЛП(Документ.Номер), 5));
		
		ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СкладОрдер", "КодМДМ", "КодСкладаПолучателяМДМ");
		ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "СкладОрдер", "ТранзитныйСкладКодМДМ", "КодСкладаМДМ");
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("КодСоглашения", СокрЛП(Документ.Грузополучатель.КодСоглашения));
	
	Валюта = Документ.ВалютаДокумента;    
	
	СтруктураДокумента.Вставить("Валюта", Валюта.КодМДМ);
	
	СтруктураДокумента.Вставить("ВозвратРекламационногоТовара", "");
	СтруктураДокумента.Вставить("СтатусСогласования", "");
	СтруктураДокумента.Вставить("ВозвратСтороннимСкладам", "");
	СтруктураДокумента.Вставить("Ответственный", СокрЛП(Документ.Ответственный));
	СтруктураДокумента.Вставить("ХозяйственнаяОперация", "ПеремещениеТоваров");
	СтруктураДокумента.Вставить("ДокументОснование", Неопределено);
	
	//+Макрушин Е. 22.07.2026 #UT10-5966
	тзКМ = Неопределено;
	//-Макрушин Е. 03.08.2026 #UT11-5966
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		
		Если ЗначениеЗаполнено(Документ.КодМДМОрганизацииВСмежнойБазе) И Документ.КодМДМОрганизацииВСмежнойБазе <> СтруктураДокумента.КодОрганизацииМДМ Тогда
			СтруктураДокумента.КодОрганизацииМДМ = Документ.КодМДМОрганизацииВСмежнойБазе;	
		КонецЕсли;
		
	//+Макрушин Е. 22.07.2026 #UT10-5966	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугКодыМаркировки.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки.Номенклатура КАК Номенклатура,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки.СрокГодности КАК СрокГодности,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки.ДатаПроизводства КАК ДатаПроизводства,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки.ТипПоступления КАК ТипПоступления,
		|	РеализацияТоваровУслугКодыМаркировки.КодМаркировки.КодМаркировки КАК Код
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК РеализацияТоваровУслугКодыМаркировки
		|ГДЕ
		|	РеализацияТоваровУслугКодыМаркировки.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		тзКМ = Запрос.Выполнить().Выгрузить();  
	//-Макрушин Е. 22.07.2026 #UT10-5966
		
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ОбъектМетаданных.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	//+Макрушин Е. 22.07.2026 #UT10-5966
    |	ОбъектМетаданных.Номенклатура КАК Номенклатура,
	//-Макрушин Е. 22.07.2026 #UT10-5966
	|	ОбъектМетаданных.Количество,
	|	ОбъектМетаданных.СтавкаНДС,
	|	ОбъектМетаданных.Сумма,
	|	ОбъектМетаданных.СуммаНДС,
	|	ОбъектМетаданных.Цена,
	|	ОбъектМетаданных.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	|	ОбъектМетаданных.НомерСтроки КАК НомерСтроки,
	|	ОбъектМетаданных.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ОбъектМетаданных
	|ГДЕ
	|	ОбъектМетаданных.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Документ.РеализацияТоваровУслуг", Документ.Метаданные().ПолноеИмя());
	
	Товары = Новый Массив;  
	
	Запрос = Новый Запрос(ТекстЗапроса);   
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать(); 
	
	Пока Выб.Следующий() Цикл    
		
		ТоварыСтруктура = Новый Структура; 		
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("КоличествоУпаковок", Выб.Количество);
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Выб.СуммаНДС);		
		ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("НомерГТД", СокрЛП(Выб.НомерГТД));
		
		//+Макрушин Е. 22.07.2026 #UT10-5966
		мКодыМаркировки = Новый Массив;
		
		Если тзКМ <> Неопределено Тогда
			
			Для сч = 1 По Выб.Количество Цикл
				
				НайденнаяСтрокаПоКМ = тзКМ.Найти(Выб.Номенклатура, "Номенклатура");
				
				Если НайденнаяСтрокаПоКМ <> Неопределено Тогда
					
					КодыМаркировкиСтруктура = Новый Структура;
					КодыМаркировкиСтруктура.Вставить("Код", НайденнаяСтрокаПоКМ.Код);
					КодыМаркировкиСтруктура.Вставить("ДатаПроизводства", ?(ЗначениеЗаполнено(НайденнаяСтрокаПоКМ.ДатаПроизводства), Формат(НайденнаяСтрокаПоКМ.ДатаПроизводства, "ДФ=yyyy-MM-dd"), ""));
					КодыМаркировкиСтруктура.Вставить("СрокГодности", ?(ЗначениеЗаполнено(НайденнаяСтрокаПоКМ.СрокГодности), Формат(НайденнаяСтрокаПоКМ.СрокГодности, "ДФ=yyyy-MM-dd"), ""));
					КодыМаркировкиСтруктура.Вставить("ТипПоступления", НайденнаяСтрокаПоКМ.ТипПоступления);
					
					мКодыМаркировки.Добавить(КодыМаркировкиСтруктура);
					тзКМ.Удалить(НайденнаяСтрокаПоКМ);
					
				КонецЕсли;	
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если мКодыМаркировки.Количество() > 0 Тогда
			ТоварыСтруктура.Вставить("КодыМаркировки", мКодыМаркировки);
		КонецЕсли;
		//-Макрушин Е. 22.07.2026 #UT10-5966

		Товары.Добавить(ТоварыСтруктура);  
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("Товары", Товары);   
	
КонецПроцедуры                                

Процедура ЗаписатьЗаявкаНаВозврат(Документ , СтруктураДокумента , ПеречитатьРегистры)

	СтруктураДокумента.Вставить("ВидДокумента", "ЗаявкаНаВозврат");
	СтруктураДокумента.Вставить("СтатусДокумента", СокрЛП(Документ.Статус));
	СтруктураДокумента.Вставить("РеализацияУникальныйИдентификатор", Строка(Документ.Реализация.УникальныйИдентификатор()));
	
	//+Сёмин Р.И. 17.03.2026 #UT10-5760
	Если ЗначениеЗаполнено(Документ.ЭлПочтаКлиента) Тогда
		
		ЭлПочтаКлиента = ?(ЗначениеЗаполнено(СтруктураДокумента.Комментарий), ". Эл. почта клиента: " + Документ.ЭлПочтаКлиента, "Эл. почта клиента: " + Документ.ЭлПочтаКлиента);
		СтруктураДокумента.Комментарий = СтруктураДокумента.Комментарий + ЭлПочтаКлиента;
		
	КонецЕсли;
	//-Сёмин Р.И. 17.03.2026 #UT10-5760
	
	Префикс = ПланыОбмена.ОбменУправлениеТорговлейУТ11.НайтиПоКоду("УТ").Префикс;
	ЧислоСимволов = 6;
	НовыйНомер = Прав(СокрЛП(Документ.Реализация.Номер), ЧислоСимволов);   
	
	Пока СтрДлина(НовыйНомер) < ЧислоСимволов Цикл   
		НовыйНомер = "0" + НовыйНомер;               
	КонецЦикла;     
	
	ВЧ = ?(Документ.Реализация.Организация.ИНН <> "7701302972", "УО-", "00-");
	РеализацияНомерДокумента = ?(Префикс = "", "00", Префикс) + ВЧ + НовыйНомер;
	СтруктураДокумента.Вставить("РеализацияНомерДокумента", РеализацияНомерДокумента);
	СтруктураДокумента.Вставить("РеализацияДатаДокумента", Формат(Документ.Реализация.Дата, "ДЛФ=DT"));
	
	Префикс = Лев(Документ.Реализация.Организация.Префикс,2);
	ЧислоСимволов = 6;
	НовыйНомер = Прав(СокрЛП(Документ.Номер), ЧислоСимволов);  
	
	Пока СтрДлина(НовыйНомер) < ЧислоСимволов Цикл     
		НовыйНомер = "0" + НовыйНомер;                 
	КонецЦикла;       
	
	НомерДокументаУТ11 = ?(Префикс = "", "00", Префикс) + "00-" + НовыйНомер;	
	СтруктураДокумента.Вставить("НомерДокументаУТ11", НомерДокументаУТ11);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Товары = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаНаВозвратТовары.Номенклатура КАК Номенклатура,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ЗаявкаНаВозвратТовары.Номенклатура.КодПоБазеМоскоречье КАК КодПоБазеМоскоречье,
	|	ЗаявкаНаВозвратТовары.Количество,
	|	ЗаявкаНаВозвратТовары.Сумма,
	|	ЗаявкаНаВозвратТовары.Цена,
	|	ЗаявкаНаВозвратТовары.Статус,
	|	ЗаявкаНаВозвратТовары.Комментарий,
	|	ЗаявкаНаВозвратТовары.НомерСтрокиИзРТУ,
	|	ЗаявкаНаВозвратТовары.IDСклада_СтороннийСклад КАК СтороннийСклад,
	|	ЗаявкаНаВозвратТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	|	ЗаявкаНаВозвратТовары.НомерСтроки,
	|	ЗаявкаНаВозвратТовары.Тип
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка = &Ссылка";    
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);    
	
	Выб = Запрос.Выполнить().Выбрать();        
	
	Пока Выб.Следующий() Цикл             
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("Номенклатура", Строка(Выб.Номенклатура));
		ТоварыСтруктура.Вставить("НоменклатураКодМДМ", Выб.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("КодПоБазеМоскоречье", Выб.КодПоБазеМоскоречье);
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);
		ТоварыСтруктура.Вставить("Количество", Выб.Количество);
		ТоварыСтруктура.Вставить("Цена", Выб.Цена);
		ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
		ТоварыСтруктура.Вставить("Статус", Выб.Статус);
		ТоварыСтруктура.Вставить("Комментарий", Выб.Комментарий);
		ТоварыСтруктура.Вставить("КодСторСклада", СокрЛП(Выб.СтороннийСклад.КодМДМ));

		Если ЗначениеЗаполнено(Выб.СтороннийСклад) Тогда       
			
			ТоварыСтруктура.Вставить("Рекламация", Ложь);
			ТоварыСтруктура.Вставить("Тип", "Возврат"); 
			
		Иначе                                                           
			
			ТоварыСтруктура.Вставить("Рекламация", Выб.Тип="Рекламация");			
			ТоварыСтруктура.Вставить("Тип", Выб.Тип);                    
			
		КонецЕсли;
		
		ТоварыСтруктура.Вставить("НомерСтрокиИзРТУ", Выб.НомерСтрокиИзРТУ);
		ТоварыСтруктура.Вставить("НомерСтроки", Выб.НомерСтроки);
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла; 
	
	СтруктураДокумента.Вставить("Товары", Товары);
	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Файлы = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка Как ФайлСсылка,
	|	ХранилищеДополнительнойИнформации.Наименование,
	|	ХранилищеДополнительнойИнформации.ПутьКФайлу,
	|	ХранилищеДополнительнойИнформации.ПометкаУдаления
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать();               
	
	Пока Выб.Следующий() Цикл                        
		
		Если Не ЗначениеЗаполнено(Выб.ПутьКФайлу) Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлыСтруктура = Новый Структура;
		
		ФайлыСтруктура.Вставить("ТомХраненияФайлов", СокрЛП(Константы.ТомХраненияФайлов.Получить()));
		ФайлыСтруктура.Вставить("Наименование", СокрЛП(Выб.Наименование));
		ФайлыСтруктура.Вставить("ПутьКФайлу", СокрЛП(Выб.ПутьКФайлу));
		ФайлыСтруктура.Вставить("ФайлУникальныйИдентификатор", Строка(Выб.ФайлСсылка.УникальныйИдентификатор()));
		ФайлыСтруктура.Вставить("ПометкаУдаления", Выб.ПометкаУдаления);
		
		Файлы.Добавить(ФайлыСтруктура);   		
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Файлы", Файлы);

КонецПроцедуры                                

Процедура ЗаписатьКорректировкаПоступленияТоваровУслугРаббит(Документ, СтруктураДокумента, ТЗТовары)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КорректировкаПоступления.Организация.КодМДМГоловнойОрганизации, """") КАК КодОрганизацииМДМ,
	|	ЕСТЬNULL(КорректировкаПоступления.Контрагент.КодМДМ, """") КАК КодКонтрагентаМДМ,
	|	ЕСТЬNULL(КорректировкаПоступления.Контрагент.КодМДМПартнера, """") КАК КодПартнераМДМ,
	|	ЕСТЬNULL(КорректировкаПоступления.ДоговорКонтрагента.КодМДМ, """") КАК КодДоговораМДМ,
	|	ЕСТЬNULL(Склады.КодМДМ, """") КАК КодСкладаМДМ,
	//+Бычков О. 23.04.2025 #UT10-5207
	// Вставка
	|	ЕСТЬNULL(Склады.ТранзитныйСкладКодМДМ, """") КАК КодСкладаОтправителяМДМ,
	|КорректировкаПоступления.Ссылка В
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		КорректировкаПоступленияТовары.Ссылка
	|	ИЗ
	|		Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|	ГДЕ
	|		КорректировкаПоступленияТовары.Ссылка = &Ссылка
	|		И КорректировкаПоступленияТовары.Количество < КорректировкаПоступленияТовары.КоличествоДоИзменения) КАК НуженСкладПолучатель,
	//-Бычков О. 23.04.2025 #UT10-5207
	|	ЕСТЬNULL(КорректировкаПоступления.ВалютаДокумента.КодМДМ, """") КАК Валюта,
	|	КорректировкаПоступления.ДокументПоступления,
	//+Бычков О. 06.08.2026 #UT10-5997
	// Вставка
	|	КорректировкаПоступления.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	КорректировкаПоступления.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	//-Бычков О. 06.08.2026 #UT10-5997
	|	0 КАК Сумма,
	|	0 КАК СуммаНДС,
	|	"""" КАК КодСоглашенияАварда,
	|	"""" КАК КоличествоКорректировок,
	|	"""" КАК НомерКорректировки,
	|	"""" КАК КодОснованияГУИД,
	|	"""" КАК НомерОснования,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОснования,
	|	"""" КАК ВидДокументаОснования,
	|	"""" КАК РодительДокументаОснования,
	|	"""" КАК КодОрганизацииИС,
	|	"""" КАК КодКонтрагентаИС,
	|	"""" КАК КодПартнераИС,
	|	"""" КАК КодДоговораИС,
	|	"""" КАК КодСкладаИС,
	|	"""" КАК ВалютаЦифровойКод,
	|	"""" КАК ВалютаБуквенныйКод,
	|	КорректировкаПоступления.СуммаВключаетНДС КАК ЦенаВключаетНДС,
	|	""ПродажаОблагаетсяНДС"" КАК НалогообложениеНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаПоступления.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки)
	|			ТОГДА ""ИсправлениеОшибок""
	|		ИНАЧЕ ""КорректировкаПоСогласованиюСторон""
	|	КОНЕЦ КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО КорректировкаПоступления.СкладОрдер = Склады.Ссылка
	|ГДЕ
	|	КорректировкаПоступления.Ссылка = &Ссылка";
	
	СтруктураДокумента.Вставить("ПометкаУдаления", Документ.ПометкаУдаления);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);  
	
	Выборка = Запрос.Выполнить().Выбрать();       
	
	Выборка.Следующий();
	
	//+Бычков О. 24.04.2025 #UT10-5207
	// Вставка
	ТекВыгружаемВПеремещение = КорректировкаПоступленияТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка);
	//-Бычков О. 24.04.2025 #UT10-5207
	
	Для Каждого Колонка Из Выборка.Владелец().Колонки Цикл 
		
		//+Бычков О. 23.04.2025 #UT10-5207
		// Было
		//Если Колонка.Имя <> "ДокументПоступления" Тогда
		// Стало
		Если Колонка.Имя <> "ДокументПоступления"
			И Колонка.Имя <> "НуженСкладПолучатель"
			Тогда
		//-Бычков О. 23.04.2025 #UT10-5207
			
			Значение = Выборка[Колонка.Имя];  
			
			Если ТипЗнч(Значение) = Тип("Дата") Тогда 
				Значение = Формат(Значение, "ДЛФ=DT");
			КонецЕсли;
			
			//+Бычков О. 24.04.2025 #UT10-5207
			// Было
			//СтруктураДокумента.Вставить(Колонка.Имя, Значение);
			// Стало
			ТекИмяПоля = Колонка.Имя;
			
			Если ТекИмяПоля = "КодСкладаОтправителяМДМ" Тогда
				
				Если Не ТекВыгружаемВПеремещение Тогда
					Продолжить;
				КонецЕсли;
				
				Если Выборка.НуженСкладПолучатель Тогда
					ТекИмяПоля = "КодСкладаПолучателяМДМ";
				КонецЕсли;
			
			КонецЕсли;
			
			СтруктураДокумента.Вставить(ТекИмяПоля, Значение);
			//-Бычков О. 24.04.2025 #UT10-5207
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Выборка.ДокументПоступления) Тогда     
		
		Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Выборка.ДокументПоступления, "Номер, Дата");
		
		СтруктураДокумента.Вставить("КодОснованияГУИД", Строка(Выборка.ДокументПоступления.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("НомерОснования", Данные.Номер);
		СтруктураДокумента.Вставить("ДатаОснования", Формат(Данные.Дата, "ДЛФ=DT"));
		СтруктураДокумента.Вставить("ВидДокументаОснования", Выборка.ДокументПоступления.Метаданные().Имя);
		
		ДокументПоступления = Выборка.ДокументПоступления;   
		
		Пока ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Цикл    
			ДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "ДокументПоступления");
		КонецЦикла;
		
		Если ТипЗнч(ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда   
			
			СтруктураДокумента.Вставить("РодительДокументаОснования", Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументПоступления, "ИДДокументаВСмежнойБазе")));
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Взят за основу такой же кусок кода из корректировки реализации
	ДокументПоступления = Неопределено;
	УровеньВложенностиПоступления = 0;

	Если ТипЗнч(Выборка.ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ДокументПоступления = Выборка.ДокументПоступления;	      		
	ИначеЕсли ТипЗнч(Выборка.ДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		
		УровеньВложенностиПоступления = 1;
		Ист = Выборка.ДокументПоступления;    
		
		Пока ТипЗнч(Ист) = Тип("ДокументСсылка.КорректировкаПоступления") Цикл 
			
			УровеньВложенностиПоступления = УровеньВложенностиПоступления + 1;
			Ист = Ист.ДокументПоступления;     
			
		КонецЦикла;
		
		Если ТипЗнч(Ист) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда   	
			ДокументПоступления = Ист;    
		КонецЕсли;                                                               
		
	КонецЕсли;
	
	//+Бычков О. 06.05.2025 #UT10-5208
	// Вставка
	Если Не ТекВыгружаемВПеремещение Тогда
		
		ТекОформлениеСделкиТОХ = ЭтоОформлениеСделкиТОХ(ДокументПоступления);
		
		СтруктураДокумента.Вставить("ОформлениеСделкиТОХ", ТекОформлениеСделкиТОХ);
		
	КонецЕсли;
	//-Бычков О. 06.05.2025 #UT10-5208
	
	Если ЗначениеЗаполнено(ДокументПоступления) Тогда   
		
		СтруктураДокумента.Вставить("КодПоступленияГУИД", Строка(ДокументПоступления.УникальныйИдентификатор()));
		СтруктураДокумента.Вставить("НомерПоступления", ДокументПоступления.Номер); 
		СтруктураДокумента.Вставить("ДатаПоступления", Формат(ДокументПоступления.Дата, "ДЛФ=DT"));  
		СтруктураДокумента.Вставить("УровеньВложенностиПоступления", УровеньВложенностиПоступления);  
		
	Иначе                                                   
		
		СтруктураДокумента.Вставить("КодПоступленияГУИД", "");
		СтруктураДокумента.Вставить("НомерПоступления", ""); 
		СтруктураДокумента.Вставить("ДатаПоступления", ""); 
		СтруктураДокумента.Вставить("УровеньВложенностиПоступления", 0);
		
	КонецЕсли;
	
	Товары = Новый Массив;   
	
	ЗапросТоваровПоДокументу = Новый Запрос; 
	ЗапросТоваровПоДокументу.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КорректировкаПоступленияТовары.Номенклатура
	|ПОМЕСТИТЬ ОткорретированныеТовары
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректировкаПоступленияТовары.Номенклатура,         
	|	КорректировкаПоступленияТовары.СерияНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	КорректировкаПоступленияТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения,
	|	СУММА(КорректировкаПоступленияТовары.Количество) КАК Количество,
	|	СУММА(КорректировкаПоступленияТовары.Сумма) КАК Сумма,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДС) КАК СуммаНДС,
	|	СУММА(КорректировкаПоступленияТовары.КоличествоДоИзменения) КАК КоличествоДоИзменения,
	|	СУММА(КорректировкаПоступленияТовары.СуммаДоИзменения) КАК СуммаДоИзменения,
	|	МАКСИМУМ(КорректировкаПоступленияТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДСДоИзменения) КАК СуммаНДСДоИзменения,
	|	КорректировкаПоступленияТовары.СтавкаНДС
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|ГДЕ
	|	КорректировкаПоступленияТовары.Ссылка = &Ссылка
	|	И КорректировкаПоступленияТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				ОткорретированныеТовары.Номенклатура
	|			ИЗ
	|				ОткорретированныеТовары КАК ОткорретированныеТовары)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияТовары.Номенклатура,
	|	КорректировкаПоступленияТовары.СерияНоменклатуры.НомерГТД.Код,
	|	КорректировкаПоступленияТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ, 
	|	КорректировкаПоступленияТовары.СтавкаНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура,
	|	ТаблицаДокумента.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ТаблицаДокумента.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,  
	|	ТаблицаДокумента.НомерГТД КАК НомерГТД,
	|	ТаблицаДокумента.КодМДМСтранаПроисхождения КАК КодМДМСтранаПроисхождения,
	|	ТаблицаДокумента.Количество,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.Сумма / ТаблицаДокумента.Количество КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК Цена,
	|	ТаблицаДокумента.Сумма,
	|	ТаблицаДокумента.СуммаНДС,
	|	ТаблицаДокумента.КоличествоДоИзменения,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.КоличествоДоИзменения = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.СуммаДоИзменения / ТаблицаДокумента.КоличествоДоИзменения КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК ЦенаДоИзменения,
	|	ТаблицаДокумента.СуммаДоИзменения,
	|	ТаблицаДокумента.СуммаНДСДоИзменения,
	|	ТаблицаДокумента.СтавкаНДС
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента";                           
	
	ЗапросТоваровПоДокументу.УстановитьПараметр("Ссылка",Документ.Ссылка);
	
	РезультатЗапросаТоваров = ЗапросТоваровПоДокументу.Выполнить(); 
	
	Если НЕ РезультатЗапросаТоваров.Пустой() Тогда  
		
		Выб = РезультатЗапросаТоваров.Выбрать();
		
		ПромНомСтроки = 1;
		Сумма = 0;
		СуммаНДС = 0;   
		
		Пока Выб.Следующий() Цикл 
			
			Сумма = Сумма + Выб.Сумма - Выб.СуммаДоИзменения;
			СуммаНДС = СуммаНДС + Выб.СуммаНДС - Выб.СуммаНДСДоИзменения;     
			
			ТоварыСтруктура = Новый Структура; 			
			ТоварыСтруктура.Вставить("НомерСтроки", ПромНомСтроки);
			ТоварыСтруктура.Вставить("КодМДМНоменклатуры", Выб.НоменклатураКодМДМ);
			ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", Выб.КодМДМЕдиницыИзмерения);  
			ТоварыСтруктура.Вставить("НомерГТД", ?(ЗначениеЗаполнено(Выб.НомерГТД), СОКРЛП(Выб.НомерГТД), ""));
			ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", ?(ЗначениеЗаполнено(Выб.КодМДМСтранаПроисхождения), СОКРЛП(Выб.КодМДМСтранаПроисхождения), ""));
			ТоварыСтруктура.Вставить("Количество", Выб.Количество);
			ТоварыСтруктура.Вставить("Цена", Выб.Цена);
			ТоварыСтруктура.Вставить("Сумма", Выб.Сумма);
			ТоварыСтруктура.Вставить("СуммаНДС", ?(ЗначениеЗаполнено(Выб.СуммаНДС), Выб.СуммаНДС, 0)); 
			ТоварыСтруктура.Вставить("КоличествоДоИзменения", Выб.КоличествоДоИзменения);
			ТоварыСтруктура.Вставить("ЦенаДоИзменения", Выб.ЦенаДоИзменения); 
			ТоварыСтруктура.Вставить("СуммаДоИзменения", Выб.СуммаДоИзменения);
			ТоварыСтруктура.Вставить("СуммаНДСДоИзменения", ?(ЗначениеЗаполнено(Выб.СуммаНДСДоИзменения), Выб.СуммаНДСДоИзменения, 0)); 
			
			ТоварыСтруктура.Вставить("ИнвентарныйНомер","");
			ТоварыСтруктура.Вставить("Артикул","");
			ТоварыСтруктура.Вставить("НаименованиеПроизводителя","");
			ТоварыСтруктура.Вставить("НазваниеЕдиницыИзмерения","");			
			ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС)); 

			ТоварыСтруктура.Вставить("ПодразделениеКодМДМ", "");
			ТоварыСтруктура.Вставить("СписатьНаРасходы", Ложь);
			ТоварыСтруктура.Вставить("СтатьяРасходов", Неопределено);
			ТоварыСтруктура.Вставить("АналитикаРасходов", Неопределено);
			ТоварыСтруктура.Вставить("Содержание", "");
			
			Товары.Добавить(ТоварыСтруктура); 
			ПромНомСтроки = ПромНомСтроки+1;  
			
		КонецЦикла;    
		
		СтруктураДокумента.Вставить("Сумма", Сумма);
		СтруктураДокумента.Вставить("СуммаНДС", СуммаНДС);  		
		СтруктураДокумента.Вставить("Товары", Товары);        
		
	КонецЕсли;	                                
	
КонецПроцедуры  

Процедура ЗаписатьПлатежноеПоручениеВходящее(Документ, СтруктураДокумента) Экспорт

	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");  
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Контрагент", "КодМДМ", "КодКонтрагентаМДМ");	
	
	КодДоговора = "";     
	
	Если Документ.РасшифровкаПлатежа.Количество() > 0 Тогда	
		
		Для Каждого СтрРасшифровки Из Документ.РасшифровкаПлатежа Цикл 
			
			ТекДоговор = СтрРасшифровки.ДоговорКонтрагента; 
			
			Если ЗначениеЗаполнено(ТекДоговор) И ЗначениеЗаполнено(ТекДоговор.КодМДМ) Тогда  
				
				КодДоговора = ТекДоговор.КодМДМ;
				Прервать;   
				
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	СтруктураДокумента.Вставить("КодДоговораМДМ", 		СокрЛП(КодДоговора));
	СтруктураДокумента.Вставить("Сумма", 				Документ.СуммаДокумента);	
	СтруктураДокумента.Вставить("Валюта", 				?(ЗначениеЗаполнено(Документ.ВалютаДокумента), Документ.ВалютаДокумента.КодМДМ, ""));
	СтруктураДокумента.Вставить("БанковскийНомер", 		Документ.НомерВходящегоДокумента);
	СтруктураДокумента.Вставить("ДатаБанковскогоДокумента", Формат(Документ.ДатаВходящегоДокумента, "ДФ=dd.MM.yyyy"));	
	СтруктураДокумента.Вставить("НазначениеПлатежа", 	СокрЛП(Документ.НазначениеПлатежа));
	СтруктураДокумента.Вставить("УИП", 				    "");

КонецПроцедуры

Процедура ЗаписатьУстановкуЦенНоменклатуры(Документ, СтруктураДокумента)
	
	СтруктураДокумента.Вставить("АвторWebadmin", СокрЛП(Документ.Ответственный.Код)  = "webadmin");

	ТипыЦен = Новый Массив;
	Товары  = Новый Массив;    	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыТипыЦен.ТипЦен.Наименование КАК ТипЦенНаименование,
	|	УстановкаЦенНоменклатурыТипыЦен.ТипЦен.КодМДМ КАК ТипЦенКодМДМ
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.ТипыЦен КАК УстановкаЦенНоменклатурыТипыЦен
	|ГДЕ
	|	УстановкаЦенНоменклатурыТипыЦен.Ссылка = &Ссылка
	|	И НЕ УстановкаЦенНоменклатурыТипыЦен.ТипЦен.КодМДМ = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыТовары.ТипЦен.КодМДМ КАК ТипЦенКодМДМ,
	|	УстановкаЦенНоменклатурыТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	УстановкаЦенНоменклатурыТовары.Цена КАК Цена,
	|	УстановкаЦенНоменклатурыТовары.ИндексСтрокиТаблицыЦен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
	|ГДЕ
	|	УстановкаЦенНоменклатурыТовары.Ссылка = &Ссылка
	|	И НЕ УстановкаЦенНоменклатурыТовары.Номенклатура.КодМДМ = """"
	|	И НЕ УстановкаЦенНоменклатурыТовары.ТипЦен.КодМДМ = """""; 
	
	Запрос.УстановитьПараметр("Ссылка",Документ.Ссылка); 
	
	ПакетЗапросаУстановкаЦен = Запрос.ВыполнитьПакет();
	
	ПакетТипыЦен = ПакетЗапросаУстановкаЦен[0].Выгрузить();
	ПакетТовары  = ПакетЗапросаУстановкаЦен[1].Выгрузить();
	
	Для Каждого СтрокаПакетаТипЦен Из ПакетТипыЦен Цикл
		
		ТипыЦенСтруктура = Новый Структура;
		
		ТипыЦенСтруктура.Вставить("ТипЦенНаименование", СтрокаПакетаТипЦен.ТипЦенНаименование);
		ТипыЦенСтруктура.Вставить("ТипЦенКодМДМ"      , СтрокаПакетаТипЦен.ТипЦенКодМДМ); 
		
		ТипыЦен.Добавить(ТипыЦенСтруктура);
		
	КонецЦикла;
	
	
	Для Каждого СтрокаПакетаТовары Из ПакетТовары Цикл  
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("ТипЦенКодМДМ"       	  , СтрокаПакетаТовары.ТипЦенКодМДМ);
		ТоварыСтруктура.Вставить("НоменклатураКодМДМ" 	  , СтрокаПакетаТовары.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Цена"              	  , СтрокаПакетаТовары.Цена); 
		ТоварыСтруктура.Вставить("ИндексСтрокиТаблицыЦен" , СтрокаПакетаТовары.ИндексСтрокиТаблицыЦен);
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("ТипыЦен", ТипыЦен);
	СтруктураДокумента.Вставить("Товары", Товары);
	
КонецПроцедуры

Процедура ЗаписатьУстановкуЦенНоменклатурыКонтрагента(Документ, СтруктураДокумента)
	
	ТипыЦен = Новый Массив;
	Товары  = Новый Массив;    	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.ТипЦен.Наименование КАК ТипЦенНаименование,
	|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.ТипЦен.КодМДМ КАК ТипЦенКодМДМ
	|ИЗ
	|	Документ.УстановкаЦенНоменклатурыКонтрагентов.ТипыЦен КАК УстановкаЦенНоменклатурыКонтрагентовТипыЦен
	|ГДЕ
	|	УстановкаЦенНоменклатурыКонтрагентовТипыЦен.Ссылка = &Ссылка
	|	И НЕ УстановкаЦенНоменклатурыКонтрагентовТипыЦен.ТипЦен.КодМДМ = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.ТипЦен.КодМДМ КАК ТипЦенКодМДМ,
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Цена КАК Цена,
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.ИндексСтрокиТаблицыЦен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентовТовары
	|ГДЕ
	|	УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка = &Ссылка
	|	И НЕ УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура.КодМДМ = """"
	|	И НЕ УстановкаЦенНоменклатурыКонтрагентовТовары.ТипЦен.КодМДМ = """""; 
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	ПакетЗапросаУстановкаЦен = Запрос.ВыполнитьПакет();
	
	ПакетТипыЦен = ПакетЗапросаУстановкаЦен[0].Выгрузить();
	ПакетТовары  = ПакетЗапросаУстановкаЦен[1].Выгрузить();
	
	Для Каждого СтрокаПакетаТипЦен Из ПакетТипыЦен Цикл
		
		ТипыЦенСтруктура = Новый Структура;
		
		ТипыЦенСтруктура.Вставить("ТипЦенНаименование", СтрокаПакетаТипЦен.ТипЦенНаименование);
		ТипыЦенСтруктура.Вставить("ТипЦенКодМДМ"      , СтрокаПакетаТипЦен.ТипЦенКодМДМ); 
		
		ТипыЦен.Добавить(ТипыЦенСтруктура);
		
	КонецЦикла;
	
	
	Для Каждого СтрокаПакетаТовары Из ПакетТовары Цикл  
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("ТипЦенКодМДМ"       	  , СтрокаПакетаТовары.ТипЦенКодМДМ);
		ТоварыСтруктура.Вставить("НоменклатураКодМДМ" 	  , СтрокаПакетаТовары.НоменклатураКодМДМ);
		ТоварыСтруктура.Вставить("Цена"              	  , СтрокаПакетаТовары.Цена); 
		ТоварыСтруктура.Вставить("ИндексСтрокиТаблицыЦен" , СтрокаПакетаТовары.ИндексСтрокиТаблицыЦен);
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;  
	
	СтруктураДокумента.Вставить("ТипыЦен", ТипыЦен);
	СтруктураДокумента.Вставить("Товары" , Товары);
	
КонецПроцедуры

Процедура ЗаписатьВыкупСОтветственногоХранения(Документ , СтруктураДокумента) 
	
	СтруктураДокумента.Вставить("ТипСодержимого"    , "application/json");
	СтруктураДокумента.Вставить("ВидДокумента"      , "ВыкупСОтветственногоХранения");
	СтруктураДокумента.Вставить("КодМДМФилиала"     , Константы.КодКонтрагентаВстороннейУТ10Пополнение.Получить());
	СтруктураДокумента.Вставить("КодМДМДоговораТОХ" , Документ.ДоговорКонтрагента.КодМДМ);
	СтруктураДокумента.Вставить("НазваниеБазы"      , СокрЛП(Константы.База.Получить()));
	СтруктураДокумента.Вставить("НачалоПериода"     , Строка(Документ.НачалоПериода));
	СтруктураДокумента.Вставить("КонецПериода"      , Строка(Документ.КонецПериода));
	
	//+Бычков О. 28.07.2026 #UT10-5970
	// Вставка
	Если СтруктураДокумента.Свойство("Статус") Тогда
		ТекСтатусПроведения = СтруктураДокумента.Статус;
	Иначе
		ТекСтатусПроведения = ?(Документ.Проведен, 1, 0);
	КонецЕсли;
	
	СтруктураДокумента.Вставить("СтатусПроведения", ТекСтатусПроведения);
	//-Бычков О. 28.07.2026 #UT10-5970
	
	СтруктураДокумента.Вставить("Статус"            , Число(Перечисления.СтатусыТОХ.Индекс(Документ.Статус)));
	
	//+Бычков О. 29.04.2025 #UT10-5208
	// Вставка
	ТекМассивТипов = МассивПоддерживаемыхТиповJSON();
	
	ТекДополнительныеПоляЗапросаТоваров = "";
	
	ТекПеремещениеТоваровМеждуСкладами = ВыкупСОтветственногоХраненияДолженВыгружатьсяКакПеремещениеТоваровМеждуСкладами(Документ.Ссылка);
	ТекВозвратТоваровПоставщику = ВыкупСОтветственногоХраненияДолженВыгружатьсяКакВозвратТоваровПоставщику(Документ.Ссылка);
	
	Если ТекПеремещениеТоваровМеждуСкладами Или ТекВозвратТоваровПоставщику Тогда
		
		ТекОформлениеСделкиТОХ = ЭтоОформлениеСделкиТОХ(Документ.Ссылка);
		
		СтруктураДокумента.Вставить("ОформлениеСделкиТОХ", ТекОформлениеСделкиТОХ);
		СтруктураДокумента.Вставить("СкладКодМДМ", Документ.Склад.КодМДМ);
		
		ТекОрганизацияКодМДМ = Константы.КодМДМОрганизацииТОХ.Получить();
		ТекЭтоМиниВыкупГП = Ложь;
		
		Если ТекПеремещениеТоваровМеждуСкладами Тогда
			
			ТекЭтоМиниВыкупИзБазыОП = ЭтоМиниВыкупИзБазыОП(Документ.Ссылка);
			
			Если ТекЭтоМиниВыкупИзБазыОП Тогда
				
			    ТекКодСкладаПолучателяМДМ = Константы.КодМДМОсновногоСкладаВБазеГП.Получить();
				ТекОрганизацияКодМДМ = Константы.КодМДМОрганизацииТОХ.Получить();
				
			Иначе
				
				ТекКодСкладаПолучателяМДМ = Документ.Филиал.СкладКодМДМ;
				//+Бычков О. 10.04.2026 #UT10-5819
				// Было
				//ТекОрганизацияКодМДМ = Документ.Организация.КодМДМ;
				// Стало
				ТекОрганизацияКодМДМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация, "КодМДМГоловнойОрганизации");
				//-Бычков О. 10.04.2026 #UT10-5819
				ТекЭтоМиниВыкупГП = Истина;
				
			КонецЕсли;
			
			СтруктураДокумента.Вставить("КодСкладаПолучателяМДМ", ТекКодСкладаПолучателяМДМ);
			СтруктураДокумента.Вставить("ЭтоМиниВыкупГП", ТекЭтоМиниВыкупГП);
			
		КонецЕсли;
		
		Если ТекВозвратТоваровПоставщику Тогда
		
			СтруктураДокумента.Вставить("ПартнерКодМДМ", Документ.Контрагент.КодМДМПартнера);
			СтруктураДокумента.Вставить("КонтрагентКодМДМ", Документ.Контрагент.КодМДМ);
			СтруктураДокумента.Вставить("ДоговорКодМДМ", Документ.ДоговорКонтрагента.КодМДМ);
			СтруктураДокумента.Вставить("ВалютаКодМДМ", Документ.ВалютаДокумента.КодМДМ);
			СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаНеОблагаетсяНДС");
			СтруктураДокумента.Вставить("Операция", "ВозвратТоваровПоставщику");
			СтруктураДокумента.Вставить("СпособКомпенсации", "ВернутьДенежныеСредства");
			СтруктураДокумента.Вставить("СуммаДокумента", 0);
			СтруктураДокумента.Вставить("ЦенаВключаетНДС", Истина);
			
			ТекДополнительныеПоляЗапросаТоваров = ",
			|	ВыкупСОтветственногоХраненияТовары.Цена,
			|	ВыкупСОтветственногоХраненияТовары.Сумма";
			
		КонецЕсли;
		
		СтруктураДокумента.Вставить("ОрганизацияКодМДМ", ТекОрганизацияКодМДМ);
		
	КонецЕсли;
	//-Бычков О. 29.04.2025 #UT10-5208
	
	Товары  = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыкупСОтветственногоХраненияТовары.Номенклатура.КодМДМ,
	|	ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры,
	|	ЕСТЬNULL(ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.СтранаПроисхождения.Код, ""-- "") КАК СтранаПроисхожденияКод,
	|	ЕСТЬNULL(ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ, """") КАК СтранаПроисхожденияКодМДМ,
	|	ЕСТЬNULL(ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.СтранаПроисхождения.Наименование, ""--"") КАК СтранаПроисхожденияНаименование,
	|	ВыкупСОтветственногоХраненияТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	//+Бычков О. 29.04.2025 #UT10-5208
	// Было
	//|	ВыкупСОтветственногоХраненияТовары.Количество
	// Стало
	|	ВыкупСОтветственногоХраненияТовары.Количество"
	+ ТекДополнительныеПоляЗапросаТоваров
	+ "
	//-Бычков О. 29.04.2025 #UT10-5208
	|ИЗ
	|	Документ.ВыкупСОтветственногоХранения.Товары КАК ВыкупСОтветственногоХраненияТовары
	|ГДЕ
	|	ВыкупСОтветственногоХраненияТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();     
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			ТоварыСтруктура = Новый Структура;
			
			ТоварыСтруктура.Вставить("НоменклатураКодМДМ"     	 , ВыборкаЗапроса.НоменклатураКодМДМ);
			ТоварыСтруктура.Вставить("СтранаПроисхожденияКод" 	 , ВыборкаЗапроса.СтранаПроисхожденияКод);
			ТоварыСтруктура.Вставить("СтранаПроисхожденияКодМДМ" , ВыборкаЗапроса.СтранаПроисхожденияКодМДМ);
			ТоварыСтруктура.Вставить("СтранаПроисхождения"     	 , ВыборкаЗапроса.СтранаПроисхожденияНаименование);
			ТоварыСтруктура.Вставить("НомерГТД"     		 	 , ВыборкаЗапроса.НомерГТД);
			ТоварыСтруктура.Вставить("Количество"             	 , ВыборкаЗапроса.Количество); 

			//+Бычков О. 29.04.2025 #UT10-5208
			// Вставка
			Если ТекВозвратТоваровПоставщику Тогда                                             
				
				ТоварыСтруктура.Вставить("Цена", ВыборкаЗапроса.Цена); 
				ТоварыСтруктура.Вставить("Сумма", ВыборкаЗапроса.Сумма); 
				ТоварыСтруктура.Вставить("СуммаНДС", 0); 
				ТоварыСтруктура.Вставить("СуммаСНДС", ВыборкаЗапроса.Сумма);
				ТоварыСтруктура.Вставить("СтавкаНДС", ЗначениеJSON(Перечисления.СтавкиНДС.БезНДС, ТекМассивТипов));
				
				СтруктураДокумента.СуммаДокумента = СтруктураДокумента.СуммаДокумента + ВыборкаЗапроса.Сумма;
				
			КонецЕсли;
			//-Бычков О. 29.04.2025 #UT10-5208
			
			Товары.Добавить(ТоварыСтруктура); 
			
		КонецЦикла;
		
	КонецЕсли;

	СтруктураДокумента.Вставить("Товары"  , Товары);
	
КонецПроцедуры

Процедура ЗаписатьПоступлениеТоваровУслугРаббит(Документ, СтруктураДокумента, ТЗТовары)

	СтруктураДокумента.Вставить("ПометкаУдаления", Число(Документ.ПометкаУдаления));
	СтруктураДокумента.Вставить("КодОрганизацииМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Организация, "КодМДМГоловнойОрганизации"));
	СтруктураДокумента.Вставить("КодКонтрагентаМДМ", 	?(ЗначениеЗаполнено(Документ.Контрагент), Документ.Контрагент.КодМДМ, ""));	
	СтруктураДокумента.Вставить("КодПартнераМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Контрагент, "КодМДМПартнера"));		
	СтруктураДокумента.Вставить("КодДоговораМДМ", 		?(ЗначениеЗаполнено(Документ.ДоговорКонтрагента), Документ.ДоговорКонтрагента.КодМДМ, ""));
	
//+Бычков О. 06.05.2025 #UT10-5208
// Вставка
	ТекОформлениеСделкиТОХ = ЭтоОформлениеСделкиТОХ(Документ.Ссылка);
	
	СтруктураДокумента.Вставить("ОформлениеСделкиТОХ", ТекОформлениеСделкиТОХ);
//-Бычков О. 06.05.2025 #UT10-5208

	Если ТипЗнч(Документ.СкладОрдер) = Тип("СправочникСсылка.Склады") Тогда
		СтруктураДокумента.Вставить("КодСкладаМДМ", ?(ЗначениеЗаполнено(Документ.СкладОрдер), Документ.СкладОрдер.КодМДМ, ""));	
	Иначе
		СтруктураДокумента.Вставить("КодСкладаМДМ", "");	
	КонецЕсли;
	
	Сумма = Документ.Товары.Итог("Сумма");
	СуммаНДС = Документ.Товары.Итог("СуммаНДС");
	
	Если Не Документ.СуммаВключаетНДС Тогда
		Сумма = Сумма + СуммаНДС;
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Сумма", 	Сумма);
	СтруктураДокумента.Вставить("СуммаНДС", СуммаНДС);
	СтруктураДокумента.Вставить("Валюта", 	?(ЗначениеЗаполнено(Документ.ВалютаДокумента),Документ.ВалютаДокумента.КодМДМ, ""));
	
	КодСоглашенияАварда = "";	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыАварды.КодАварда
	|ИЗ
	|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	|ГДЕ
	|	ДоговорыАварды.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Документ.ДоговорКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();	 
	
	Пока Выборка.Следующий() Цикл       
		КодСоглашенияАварда = КодСоглашенияАварда + ?(ЗначениеЗаполнено(КодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(Выборка.КодАварда), " ", "");
	КонецЦикла;
	
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", 	КодСоглашенияАварда); 
	
	//+Шульман А. 09.01.2025 #UT10-5019  
	СтруктураДокумента.Вставить("КодСоглашенияМДМ", ""); 
	СтруктураДокумента.Вставить("ПополнениеЗапасов", Документ.ПополнениеЗапасов);
	//-Шульман А. 09.01.2025 #UT10-5019
	
	СтруктураДокумента.Вставить("ОбратноеПоступление",	0);
	СтруктураДокумента.Вставить("КоличествоКорректировок", 0);
	СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаОблагаетсяНДС");
	СтруктураДокумента.Вставить("КодОрганизацииИС", "");
	СтруктураДокумента.Вставить("КодКонтрагентаИС", "");
	СтруктураДокумента.Вставить("КодПартнераИС", "");
	СтруктураДокумента.Вставить("КодДоговораИС", "");
	СтруктураДокумента.Вставить("КодСкладаИС", "");
	СтруктураДокумента.Вставить("ВалютаЦифровойКод", "");
	СтруктураДокумента.Вставить("ВалютаБуквенныйКод", "");
	СтруктураДокумента.Вставить("НомерВходящегоДокумента", Документ.НомерВходящегоДокумента);
	СтруктураДокумента.Вставить("ДатаВходящегоДокумента", Строка(Документ.ДатаВходящегоДокумента));
	СтруктураДокумента.Вставить("ДатаПоступления", Строка(Документ.Дата));
	СтруктураДокумента.Вставить("ФактическаяДатаПоступления", Строка(Документ.ДатаПриходаТовараНаСклад));
	СтруктураДокумента.Вставить("ТоварПоступил", ЗначениеЗаполнено(Документ.ДатаПриходаТовараНаСклад));
	СтруктураДокумента.Вставить("Предварительный", Ложь);
	
	//+Бычков О. 19.06.2025 #UT10-5297
	// Было
	//Если ЗначениеЗаполнено(Документ.КодМДМОрганизацииВСмежнойБазе) И Документ.КодМДМОрганизацииВСмежнойБазе <> СтруктураДокумента.КодОрганизацииМДМ Тогда
	//	СтруктураДокумента.КодОрганизацииМДМ = Документ.КодМДМОрганизацииВСмежнойБазе;	
	//КонецЕсли;
	// Стало
	//-Бычков О. 19.06.2025 #UT10-5297
	
	СтруктураДокумента.Вставить("УникальныйИдентификаторОснования", "");  
	СтруктураДокумента.Вставить("ДатаОснования", Дата(1, 1, 1));  
	СтруктураДокумента.Вставить("НомерОснования", "");  
	
	//+Бычков О. 09.06.2026 #UT10-5905
	// Вставка
	ТекСтатусПриемки = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Наименование = &Наименование
	|	И ЗначенияСвойствОбъектов.Объект = &Объект
	|	И ЗначенияСвойствОбъектов.Значение = &Значение";

	Запрос.УстановитьПараметр("Значение", Перечисления.СтатусыПриемки.ВПути);
	Запрос.УстановитьПараметр("Наименование", "Статус приемки");
	Запрос.УстановитьПараметр("Объект", Документ.Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекСтатусПриемки = ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	МассивТипов = МассивПоддерживаемыхТиповJSON();
	
	СтруктураДокумента.Вставить("СтатусПриемки", ЗначениеJSON(ТекСтатусПриемки, МассивТипов));
	//-Бычков О. 09.06.2026 #UT10-5905
	
	ТоварыМассив = Новый Массив;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугТовары.Номенклатура.КодМДМ КАК КодНоменклатурыМДМ,
	|	ПоступлениеТоваровУслугТовары.Количество,
	|	ПоступлениеТоваровУслугТовары.Цена,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
	|			ТОГДА ПоступлениеТоваровУслугТовары.Сумма
	|		ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
	|	КОНЕЦ КАК Сумма,
	|	ПоступлениеТоваровУслугТовары.СтавкаНДС,
	|	ПоступлениеТоваровУслугТовары.СуммаНДС,
	|	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.НомерГТД.Код КАК НомерГТД,
	|	ПоступлениеТоваровУслугТовары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
	
	Выб = Запрос.Выполнить().Выбрать();    
	Пока Выб.Следующий() Цикл
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("НомерСтроки", ?(ЗначениеЗаполнено(Выб.НомерСтроки), Выб.НомерСтроки, ""));		
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", ?(ЗначениеЗаполнено(Выб.КодНоменклатурыМДМ), Выб.КодНоменклатурыМДМ, "")); 		
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", ?(ЗначениеЗаполнено(Выб.КодМДМЕдиницыИзмерения), Выб.КодМДМЕдиницыИзмерения, "")); 		
		ТоварыСтруктура.Вставить("Количество", ?(ЗначениеЗаполнено(Выб.Количество), Выб.Количество, 0));
		ТоварыСтруктура.Вставить("Цена", ?(ЗначениеЗаполнено(Выб.Цена), Выб.Цена, 0)); 
		ТоварыСтруктура.Вставить("Сумма", ?(ЗначениеЗаполнено(Выб.Сумма), Выб.Сумма, 0)); 
		ТоварыСтруктура.Вставить("СтавкаНДС",УчетНДС.ПолучитьСтавкуНДС(Выб.СтавкаНДС));
		ТоварыСтруктура.Вставить("СуммаСНДС", ?(ЗначениеЗаполнено(Выб.Сумма), Выб.Сумма, 0)); 
		ТоварыСтруктура.Вставить("СуммаНДС", ?(ЗначениеЗаполнено(Выб.СуммаНДС), Выб.СуммаНДС, 0)); 
		ТоварыСтруктура.Вставить("ИнвентарныйНомер", "");
		ТоварыСтруктура.Вставить("Артикул", "");
		ТоварыСтруктура.Вставить("НаименованиеПроизводителя", "");
		ТоварыСтруктура.Вставить("НазваниеЕдиницыИзмерения", "");
		ТоварыСтруктура.Вставить("НомерГТД", ?(ЗначениеЗаполнено(Выб.НомерГТД), СОКРЛП(Выб.НомерГТД), ""));
		ТоварыСтруктура.Вставить("КодМДМСтранаПроисхождения", ?(ЗначениеЗаполнено(Выб.КодМДМСтранаПроисхождения), СОКРЛП(Выб.КодМДМСтранаПроисхождения), ""));
		ТоварыСтруктура.Вставить("ПодразделениеКодМДМ", "");
		ТоварыСтруктура.Вставить("СписатьНаРасходы", Ложь);
		ТоварыСтруктура.Вставить("СтатьяРасходов", Неопределено);
		ТоварыСтруктура.Вставить("АналитикаРасходов", Неопределено);
		ТоварыСтруктура.Вставить("Отменено", ЛОЖЬ);

		ТоварыМассив.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Товары", ТоварыМассив);
	СтруктураДокумента.Вставить("ЭтапыГрафикаОплаты", Новый Массив); 
	
КонецПроцедуры

Процедура ЗаписатьПересортицаТоваров(ДокументОбъект , СтруктураДокумента)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПересортицаТоваров.Проведен,
	|	ПересортицаТоваров.Организация.КодМДМГоловнойОрганизации КАК ОрганизацияКодМДМ,
	|	ПересортицаТоваров.Склад.КодМДМ,
	|	ИСТИНА КАК ПриходоватьТоварыПоСебестоимостиСписания,
	|	Константы.ВалютаРегламентированногоУчета.КодМДМ КАК ВалютаКодМДМ,
	|	ПересортицаТоваров.Товары.(
	|		Номенклатура.КодМДМ КАК НоменклатураКодМДМ, 
    |		НоменклатураОприходование.КодМДМ КАК НоменклатураОприходованиеКодМДМ,	
	|		Количество,       
	|		ЕСТЬNULL(СерияНоменклатуры.НомерГТД.Код, """") КАК НомерГТД,
	|		ЕСТЬNULL(ПересортицаТоваров.Товары.СерияНоменклатуры.СтранаПроисхождения.КодМДМ, """") КАК КодМДМСтранаПроисхождения,
	|		ЕСТЬNULL(СерияОприходование.НомерГТД.Код, """") КАК НомерГТДОприходование,
	|		ЕСТЬNULL(СерияОприходование.СтранаПроисхождения.КодМДМ, """") КАК КодМДМСтранаПроисхожденияОприходование 
	|	)
	|ИЗ
	|	Документ.ПересортицаТоваров КАК ПересортицаТоваров,
	|	Константы КАК Константы
	|ГДЕ
	|	ПересортицаТоваров.Ссылка = &Ссылка";
	
	ВыгрузитьВыборку(ДокументОбъект, СтруктураДокумента, ТекстЗапроса);
	
	СтруктураДокумента.Вставить("ПометкаУдаления", ДокументОбъект.ПометкаУдаления);    
	
КонецПроцедуры 

Процедура ЗаписатьТребованиеНакладная(ДокументОбъект, СтруктураДокумента)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТребованиеНакладная.Организация.КодМДМГоловнойОрганизации КАК ОрганизацияКодМДМ,
	|	ТребованиеНакладная.Склад.КодМДМ, 
	|	ТребованиеНакладная.Подразделение.КодМДМ КАК ПодразделениеКодМДМ,  
	|	""СписаниеТоваровПоТребованию"" КАК ХозяйственнаяОперация
	|ИЗ
	|	Документ.ТребованиеНакладная КАК ТребованиеНакладная
	|ГДЕ
	|	ТребованиеНакладная.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТребованиеНакладнаяМатериалы.Номенклатура.КодМДМ,
	|	ТребованиеНакладнаяМатериалы.Количество,
	|	ТребованиеНакладнаяМатериалы.Количество КАК КоличествоУпаковок,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	ТребованиеНакладнаяМатериалы.СтатьяЗатрат.КодМДМ КАК СтатьяРасходовКодМДМ,  
	|	ЕСТЬNULL(ТребованиеНакладнаяМатериалы.СерияНоменклатуры.НомерГТД.Код, """") КАК НомерГТД,
	|	ЕСТЬNULL(ТребованиеНакладнаяМатериалы.СерияНоменклатуры.СтранаПроисхождения.КодМДМ, """") КАК КодМДМСтранаПроисхождения
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ТребованиеНакладная.Материалы КАК ТребованиеНакладнаяМатериалы
	|ГДЕ
	|	ТребованиеНакладнаяМатериалы.Ссылка = &Ссылка";
	
	ВыгрузитьВыборку(ДокументОбъект, СтруктураДокумента, ТекстЗапроса);
	
	СтруктураДокумента.Вставить("ПометкаУдаления", ДокументОбъект.ПометкаУдаления); 
	
КонецПроцедуры

Процедура ЗаписатьСчетФактураПолученный(ДокументОбъект , СтруктураДокумента)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Организация.КодМДМГоловнойОрганизации КАК КодОрганизацииМДМ,
	|	СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный) КАК Корректировочный,
	|	СчетФактураПолученный.ВалютаДокумента.КодМДМ КАК Валюта,
	|	СчетФактураПолученный.КодВидаОперации,
	|	СчетФактураПолученный.Исправление,
	|	СчетФактураПолученный.НомерИсправления,
	|	СчетФактураПолученный.ДатаИсправления,
	|	ЛОЖЬ КАК ПолученВЭлектронномВиде,
	|	СчетФактураПолученный.Контрагент,                                                  
	|	СчетФактураПолученный.ДокументОснование.ДоговорКонтрагента.КодМДМ КАК ДоговорКодМДМ, 
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаСоставления,
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаЗаписиКнигиПокупок, 
	|	ВЫБОР КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный) 
	|         ТОГДА ""18""
	|         ИНАЧЕ """"
	|   КОНЕЦ КАК КодВидаОперацииНаУменьшение, 
	|	СчетФактураПолученный.НомерВходящегоДокумента КАК НомерДокумента, 
	|	СчетФактураПолученный.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	СчетФактураПолученный.Дата КАК ДатаДокумента,
	|	СчетФактураПолученный.ИсправляемыйСчетФактура КАК СчетФактураОснование,
	|	СчетФактураПолученный.КППКонтрагента,
	|	СчетФактураПолученный.Контрагент.ИНН КАК ИННКонтрагента
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование,
	|	СчетФактураПолученныйДокументыОснования.Ссылка.ИсправляемыйСчетФактура КАК ИсходныйДокумент
	|ПОМЕСТИТЬ ДокументыОснования
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка = &Ссылка";
	
	ВыгрузитьВыборку(ДокументОбъект, СтруктураДокумента, ТекстЗапроса);
	
	СтруктураДокумента.Вставить("ПометкаУдаления", ДокументОбъект.ПометкаУдаления); 
	
	Если ДокументОбъект.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный 
	   И СтруктураДокумента.Свойство("ДокументыОснования") И ЗначениеЗаполнено(СтруктураДокумента.ДокументыОснования) Тогда  
		
		СтруктураИсходный = СтруктураДокумента.ДокументыОснования[0].ИсходныйДокумент;
		
		ДанныеСФИсх = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбъект.ИсправляемыйСчетФактура, "НомерВходящегоДокумента, ДатаВходящегоДокумента");
		СтруктураИсходный.Номер = СОКРЛП(ДанныеСФИсх.НомерВходящегоДокумента);
		СтруктураИсходный.Дата  = Строка(ДанныеСФИсх.ДатаВходящегоДокумента);
		
		СтруктураДокумента.СчетФактураОснование.Номер = СОКРЛП(ДанныеСФИсх.НомерВходящегоДокумента); 
		СтруктураДокумента.СчетФактураОснование.Дата  = Строка(ДанныеСФИсх.ДатаВходящегоДокумента);
		
	КонецЕсли;				   
	
КонецПроцедуры

Процедура ЗаписатьРасходныйКассовыйОрдер(ДокументОбъект, СтруктураДокумента)

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Организация.КодМДМ КАК КодОрганизацииМДМ,
	|	РасходныйКассовыйОрдер.Организация.КодМДМГоловнойОрганизации КАК _КодГоловнойОрганизацииМДМ,
	|	РасходныйКассовыйОрдер.Касса.КодМДМ КАК КодКассыМДМ,
	|	РасходныйКассовыйОрдер.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю)
	|			ТОГДА ""ВозвратОплатыКлиенту""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасчетыПоКредитамИЗаймамСКонтрагентами)
	|			ТОГДА ""ОплатаПоКредитам""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПоставщику)
	|			ТОГДА ""ОплатаПоставщику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ПрочиеРасчетыСКонтрагентами)
	|			ТОГДА ""ОплатаПоставщику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствПодотчетнику)
	|			ТОГДА ""ВыдачаДенежныхСредствПодотчетнику""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВыдачаДенежныхСредствКассеККМ)
	|			ТОГДА ""ВыдачаДенежныхСредствВДругуюКассу""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ВзносНаличнымиВБанк)
	|			ТОГДА ""ИнкассацияДенежныхСредствВБанк""
	|		КОГДА РасходныйКассовыйОрдер.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.РасходДенежныхСредствПрочее)
	|			ТОГДА ""ВыплатаЗарплатыЧерезКассу""
	|		ИНАЧЕ ""ПрочаяВыдачаДенежныхСредств""
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(Контрагенты.КодМДМ, """") КАК КодКонтрагентаМДМ,
	|	РасходныйКассовыйОрдер.ВалютаДокумента.КодМДМ КАК Валюта,
	|	РасходныйКассовыйОрдер.Номер КАК НомерДокумента,
	|	РасходныйКассовыйОрдер.Дата КАК ДатаДокумента,
	|	РасходныйКассовыйОрдер.ШтампВерсии,
	|	РасходныйКассовыйОрдер.Проведен,
	|	"""" КАК ПодотчетноеЛицоКодМДМ,
	|	РасходныйКассовыйОрдер.Подразделение.КодМДМ КАК ПодразделениеКодМДМ,
	|	"""" КАК НомерВедомостиНаВыплатуЗарплаты,
	|	"""" КАК ДатаВедомостиНаВыплатуЗарплаты,
	|	РасходныйКассовыйОрдер.Выдать КАК Выдать,
	|	РасходныйКассовыйОрдер.Основание КАК Основание,
	|	РасходныйКассовыйОрдер.Приложение КАК Приложение,
	|	РасходныйКассовыйОрдер.ПоДокументу КАК ПоДокументу
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО РасходныйКассовыйОрдер.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.Владелец.КодМДМПартнера КАК КодПартнераМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаПлатежа КАК Сумма,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.ВалютаВзаиморасчетовРаботника.КодМДМ КАК ВалютаВзаиморасчетов,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаВзаиморасчетов,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтавкаНДС КАК СтавкаНДС,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СуммаНДС,
	|	"""" КАК КодДоговораКредитаИДепозитаМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.ДоговорКонтрагента.КодМДМ КАК КодДоговораМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств.КодМДМ КАК КодСтатьиДвиженияДенежныхСредствМДМ,
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом,
	|	1 КАК КурсВзаиморасчетов,
	|	"""" КАК ТипСуммы,
	|	"""" КАК ТипДоговора,
	|	"""" КАК ТипСрочности,
	|	"""" КАК СтатьяРасходовКодМДМ,            
	|	"""" КАК СчетРасходов                  
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	|ГДЕ
	|	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	Массив = Запрос.ВыполнитьПакет();
	МассивПоддерживаемыхТипов = МассивПоддерживаемыхТиповJSON();
	
	РезультатПоШапке = Массив[Массив.ВГраница() - 1];
	
	Выборка = РезультатПоШапке.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьКоллекциюЗначений(СтруктураДокумента, Выборка, РезультатПоШапке.Колонки, МассивПоддерживаемыхТипов); 
	КонецЦикла;                                                                           
	
	Если ЗначениеЗаполнено(СокрЛП(Выборка._КодГоловнойОрганизацииМДМ)) Тогда      
		СтруктураДокумента.Вставить("КодОрганизацииМДМ", Выборка._КодГоловнойОрганизацииМДМ); 
	КонецЕсли;
	
	МассивРасшифровкаПлатежа = Новый Массив;
	РезультатПоРасшифровкеПлатежа = Массив[Массив.ВГраница()];    
	
	Выборка = РезультатПоРасшифровкеПлатежа.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		Структура = Новый Структура; 
		ЗаполнитьКоллекциюЗначений(Структура, Выборка, РезультатПоРасшифровкеПлатежа.Колонки, МассивПоддерживаемыхТипов);		
		Структура.Вставить("КодОрганизацииМДМ", СтруктураДокумента.КодОрганизацииМДМ);
		
		МассивРасшифровкаПлатежа.Добавить(Структура);
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("РасшифровкаПлатежа", МассивРасшифровкаПлатежа);
	СтруктураДокумента.Вставить("ПометкаУдаления", ДокументОбъект.ПометкаУдаления); 
	СтруктураДокумента.Вставить("ЧекККМ", ?(ЗначениеЗаполнено(ДокументОбъект.НомерЧекаККМ), 1, 0)); 	

КонецПроцедуры

Процедура ЗаписатьАктВыполненныхРабот(ДокументОбъект , СтруктураДокумента)
	
	СуммаПоТЧУслуги = ДокументОбъект.Услуги.Итог("Сумма");
	
	СтруктураДокумента.Вставить("ХозяйственнаяОперация"			  , "ЗакупкаУПоставщика");
	СтруктураДокумента.Вставить("ОрганизацияКодМДМ"	   			  , СокрЛП(ДокументОбъект.Организация.КодМДМГоловнойОрганизации));
	СтруктураДокумента.Вставить("БанковскийСчетОрганизацииКодМДМ" , "");
	СтруктураДокумента.Вставить("КонтрагентКодМДМ"				  , СокрЛП(ДокументОбъект.Контрагент.КодМДМ));
	СтруктураДокумента.Вставить("ПартнерКодМДМ"					  , СокрЛП(ДокументОбъект.Контрагент.КодМДМПартнера));
	СтруктураДокумента.Вставить("ДоговорКодМДМ"                   , СокрЛП(ДокументОбъект.ДоговорКонтрагента.КодМДМ));
	СтруктураДокумента.Вставить("ПодразделениеКодМДМ"             , "");
	СтруктураДокумента.Вставить("СуммаДокумента"                  , СуммаПоТЧУслуги); 
	СтруктураДокумента.Вставить("СуммаОплаты"                     , ДокументОбъект.СуммаДокумента);
	СтруктураДокумента.Вставить("СуммаВзаиморасчетов"             , СуммаПоТЧУслуги);
	СтруктураДокумента.Вставить("ВалютаКодМДМ"                    , СокрЛП(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов.КодМДМ));
	СтруктураДокумента.Вставить("ВалютаВзаиморасчетовКодМДМ"      , СокрЛП(ДокументОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов.КодМДМ));
	СтруктураДокумента.Вставить("ЦенаВключаетНДС"                 , ЛОЖЬ);
	СтруктураДокумента.Вставить("ФормаОплаты"                     , "");
	СтруктураДокумента.Вставить("ДатаОплаты"                      , "");
   	СтруктураДокумента.Вставить("НалогообложениеНДС"              , "ПродажаНеОблагаетсяНДС");
	СтруктураДокумента.Вставить("НомерВходящегоДокумента"         , ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументОбъект, , Ложь));
	СтруктураДокумента.Вставить("ДатаВходящегоДокумента"          , Формат(ДокументОбъект.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ЗакупкаПодДеятельность"          , "");
	СтруктураДокумента.Вставить("ПорядокРасчетов"                 , "");
	СтруктураДокумента.Вставить("ПодотчетноеЛицоКодМДМ"           , "");
	СтруктураДокумента.Вставить("ОтветственныйКодМДМ"             , СокрЛП(ДокументОбъект.Ответственный.ФизЛицо.КодМДМ));
	СтруктураДокумента.Вставить("ДатаНачала"                  	  , Формат(ДокументОбъект.ДатаНачала, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ДатаОкончания"                   , Формат(КонецДня(ДокументОбъект.ДатаОкончания), "ДЛФ=DT"));
	
	Услуги = Новый Массив; 
	
	ЗапросТаблицыУслуг = Новый Запрос;
	ЗапросТаблицыУслуг.Текст = 
	"ВЫБРАТЬ
	|	АктВыполненныхРаботУслуги.Номенклатура КАК Товар,
	|	СУММА(АктВыполненныхРаботУслуги.Количество) КАК Количество,
	|	АктВыполненныхРаботУслуги.Тариф КАК Цена,
	|	СУММА(АктВыполненныхРаботУслуги.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
	|ГДЕ
	|	АктВыполненныхРаботУслуги.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	АктВыполненныхРаботУслуги.Номенклатура,
	|	АктВыполненныхРаботУслуги.Тариф
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.Товар.Наименование КАК Содержание,
	|	ВТ_Услуги.Количество,
	|	ВТ_Услуги.Цена,
	|	ВТ_Услуги.Сумма,
	|	ВТ_Услуги.Сумма КАК СуммаВзаиморасчетов,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаНДСВзаиморасчетов,
	|	ВТ_Услуги.Сумма КАК СуммаСНДС,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	"""" КАК ПодразделениеКодМДМ,
	|	"""" КАК СтатьяРасходов,
	|	"""" КАК АналитикаРасходов,
	|	"""" КАК КомментарийРаспределения,
	|	"""" КАК АналитикаАктивовПассивов
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги";
	
	ЗапросТаблицыУслуг.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка); 
	
	РезультатЗапросаТаблицыУслуг = ЗапросТаблицыУслуг.Выполнить();  
	
	ВыборкаЗапросаТаблицыУслуг = РезультатЗапросаТаблицыУслуг.Выбрать();
	
	Пока ВыборкаЗапросаТаблицыУслуг.Следующий() Цикл
		
		УслугиСтруктура = Новый Структура;
		
		УслугиСтруктура.Вставить("Содержание"       	    , "Услуги по ПГАТ за " + Формат(ДокументОбъект.ДатаНачала, "ДФ='MMMM yyyy'") + " (с " + Формат(ДокументОбъект.ДатаНачала, "ДФ=dd.MM.yyyy") + " по " + Формат(ДокументОбъект.ДатаОкончания, "ДФ=dd.MM.yyyy") + ")");    		
		УслугиСтруктура.Вставить("Количество"       	    , ВыборкаЗапросаТаблицыУслуг.Количество);
		УслугиСтруктура.Вставить("Цена"       	            , ВыборкаЗапросаТаблицыУслуг.Цена);
		УслугиСтруктура.Вставить("Сумма"       	            , ВыборкаЗапросаТаблицыУслуг.Сумма);
		УслугиСтруктура.Вставить("СуммаВзаиморасчетов"      , ВыборкаЗапросаТаблицыУслуг.СуммаВзаиморасчетов);
		УслугиСтруктура.Вставить("СуммаНДС"       	        , ВыборкаЗапросаТаблицыУслуг.СуммаНДС);
		УслугиСтруктура.Вставить("СуммаНДСВзаиморасчетов"   , ВыборкаЗапросаТаблицыУслуг.СуммаНДСВзаиморасчетов);
		УслугиСтруктура.Вставить("СуммаСНДС"       	        , ВыборкаЗапросаТаблицыУслуг.СуммаСНДС);
		УслугиСтруктура.Вставить("СтавкаНДС"       	        , УчетНДС.ПолучитьСтавкуНДС(ВыборкаЗапросаТаблицыУслуг.СтавкаНДС));
		УслугиСтруктура.Вставить("ПодразделениеКодМДМ"      , ВыборкаЗапросаТаблицыУслуг.ПодразделениеКодМДМ);
		УслугиСтруктура.Вставить("СтатьяРасходов"           , ВыборкаЗапросаТаблицыУслуг.СтатьяРасходов);
		УслугиСтруктура.Вставить("АналитикаРасходов"        , ВыборкаЗапросаТаблицыУслуг.АналитикаРасходов);
		УслугиСтруктура.Вставить("КомментарийРаспределения" , ВыборкаЗапросаТаблицыУслуг.КомментарийРаспределения);
		УслугиСтруктура.Вставить("АналитикаАктивовПассивов" , ВыборкаЗапросаТаблицыУслуг.АналитикаАктивовПассивов);
		
		Услуги.Добавить(УслугиСтруктура);
		
	КонецЦикла;	
	
	СтруктураДокумента.Вставить("Расходы" , Услуги);
	
	Файлы = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка Как ФайлСсылка,
	|	ХранилищеДополнительнойИнформации.Наименование,
	|	ХранилищеДополнительнойИнформации.ПутьКФайлу,
	|	ХранилищеДополнительнойИнформации.ПометкаУдаления
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Объект = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект.Ссылка); 
	
	Выб = Запрос.Выполнить().Выбрать();               
	
	Пока Выб.Следующий() Цикл                        
		
		Если Не ЗначениеЗаполнено(Выб.ПутьКФайлу) Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлыСтруктура = Новый Структура;
		
		ФайлыСтруктура.Вставить("ТомХраненияФайлов"           , СокрЛП(Константы.ТомХраненияФайлов.Получить()));
		ФайлыСтруктура.Вставить("Наименование"                , СокрЛП(Выб.Наименование));
		ФайлыСтруктура.Вставить("ПутьКФайлу"                  , СокрЛП(Выб.ПутьКФайлу));
		ФайлыСтруктура.Вставить("ФайлУникальныйИдентификатор" , Строка(Выб.ФайлСсылка.УникальныйИдентификатор()));
		ФайлыСтруктура.Вставить("ПометкаУдаления"             , Выб.ПометкаУдаления);
		
		Файлы.Добавить(ФайлыСтруктура);   		
		
	КонецЦикла;    
	
	СтруктураДокумента.Вставить("Файлы", Файлы);
	
КонецПроцедуры

Процедура ЗаписатьАвансовыйОтчет(ДокументОбъект , СтруктураДокумента)
	
	МассивТипов = МассивПоддерживаемыхТиповJSON();
	
	СтруктураДокумента.Вставить("ОрганизацияКодМДМ"	   			  , СокрЛП(ДокументОбъект.Организация.КодМДМГоловнойОрганизации));
	СтруктураДокумента.Вставить("ПодотчетноеЛицоКодМДМ"           , СокрЛП(ДокументОбъект.ФизЛицо.КодМДМ));
	СтруктураДокумента.Вставить("ВалютаКодМДМ"				      , СокрЛП(ДокументОбъект.ВалютаДокумента.КодМДМ));
	СтруктураДокумента.Вставить("СуммаИзрасходовано"              , ДокументОбъект.СуммаДокумента); 
	СтруктураДокумента.Вставить("СуммаОтклонено"                  , 0);      
	СтруктураДокумента.Вставить("НазначениеАванса"                , ДокументОбъект.НазначениеАванса);
	СтруктураДокумента.Вставить("СтатусДокумента"                 , "");
	СтруктураДокумента.Вставить("ЦенаВключаетНДС"                 , ДокументОбъект.СуммаВключаетНДС);
	СтруктураДокумента.Вставить("КоличествоДокументов"            , ДокументОбъект.КоличествоДокументов);
	СтруктураДокумента.Вставить("КоличествоЛистов"                , ДокументОбъект.КоличествоЛистов);
	СтруктураДокумента.Вставить("ПодразделениеКодМДМ"             , ДокументОбъект.Подразделение.КодМДМ);   
	СтруктураДокумента.Вставить("БанковскийСчетКодМДМ"            , "");   
	СтруктураДокумента.Вставить("ДокументОснование"               , Неопределено);
	
	ПрочиеРасходы = Новый Массив; 
	ОплатаПоставщикам = Новый Массив; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =   
	"ВЫБРАТЬ
	|	"""" КАК СтатьяДвиженияДенежныхСредствКодМДМ,
	|	АвансовыйОтчет.ВидДокВходящий КАК НаименованиеВходящегоДокумента,
	|	АвансовыйОтчет.НомерВходящегоДокумента,
	|	АвансовыйОтчет.ДатаВходящегоДокумента,
	|	АвансовыйОтчет.Сумма,
	|	АвансовыйОтчет.СтатьяЗатрат КАК СтатьяРасходов,
	|	АвансовыйОтчет.Подразделение КАК АналитикаРасходов,
	|	АвансовыйОтчет.Содержание КАК Комментарий,
	|	ЕСТЬNULL(АвансовыйОтчет.Подразделение.КодМДМ, """") КАК ПодразделениеКодМДМ,  
	|	АвансовыйОтчет.СтавкаНДС,
	|	АвансовыйОтчет.СуммаНДС,
	|	ВЫБОР
	|		КОГДА АвансовыйОтчет.Ссылка.НДСВключенВСтоимость
	|			ТОГДА АвансовыйОтчет.Сумма
	|		ИНАЧЕ АвансовыйОтчет.Сумма + АвансовыйОтчет.СуммаНДС
	|	КОНЕЦ КАК СуммаСНДС,
	|	ЕСТЬNULL(АвансовыйОтчет.Поставщик.КодМДМ, """") КАК КонтрагентКодМДМ
	|ИЗ
	|	Документ.АвансовыйОтчет.Прочее КАК АвансовыйОтчет
	|ГДЕ
	|	АвансовыйОтчет.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""" КАК СтатьяДвиженияДенежныхСредствКодМДМ,
	|	ЕСТЬNULL(АвансовыйОтчетОплатаПоставщикам.Контрагент.КодМДМ, """") КАК ПоставщикКодМДМ,
	|	ЕСТЬNULL(АвансовыйОтчетОплатаПоставщикам.Контрагент.КодМДМ, """") КАК КонтрагентКодМДМ,
	|	ЕСТЬNULL(АвансовыйОтчетОплатаПоставщикам.ДоговорКонтрагента.КодМДМ, """") КАК ДоговорКодМДМ,
	|	АвансовыйОтчетОплатаПоставщикам.Сумма,
	|	ЕСТЬNULL(АвансовыйОтчетОплатаПоставщикам.Ссылка.ВалютаДокумента.КодМДМ, """") КАК ВалютаВзаиморасчетовКодМДМ,
	|	АвансовыйОтчетОплатаПоставщикам.Сумма КАК СуммаВзаиморасчетов,
	|	АвансовыйОтчетОплатаПоставщикам.Содержание КАК Комментарий,
	|	АвансовыйОтчетОплатаПоставщикам.НомерВходящегоДокумента,
	|	АвансовыйОтчетОплатаПоставщикам.ДатаВходящегоДокумента
	|ИЗ
	|	Документ.АвансовыйОтчет.ОплатаПоставщикам КАК АвансовыйОтчетОплатаПоставщикам
	|ГДЕ
	|	АвансовыйОтчетОплатаПоставщикам.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);  
	
	ВыпПакет = Запрос.ВыполнитьПакет();  
	
	Выборка = ВыпПакет[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		УслугиСтруктура = Новый Структура;
		
		УслугиСтруктура.Вставить("СтатьяДвиженияДенежныхСредствКодМДМ" , Выборка.СтатьяДвиженияДенежныхСредствКодМДМ);    		
		УслугиСтруктура.Вставить("НаименованиеВходящегоДокумента"      , Выборка.НаименованиеВходящегоДокумента);
		УслугиСтруктура.Вставить("НомерВходящегоДокумента"       	   , Выборка.НомерВходящегоДокумента);
		УслугиСтруктура.Вставить("ДатаВходящегоДокумента"       	   , Строка(Выборка.ДатаВходящегоДокумента));
		УслугиСтруктура.Вставить("Сумма"                               , Выборка.Сумма);                               
		
		СтатьяРасходов = ЗначениеJSON(Выборка.СтатьяРасходов, МассивТипов);    
		СтатьяРасходов.Тип = "ПланВидовХарактеристик.СтатьиРасходов";
		УслугиСтруктура.Вставить("СтатьяРасходов"       	           , СтатьяРасходов);   
		
		АналитикаРасходов = ЗначениеJSON(Выборка.АналитикаРасходов, МассивТипов);
		АналитикаРасходов.Тип = "Справочник.СтруктураПредприятия";

		УслугиСтруктура.Вставить("АналитикаРасходов"       	           , АналитикаРасходов);
		УслугиСтруктура.Вставить("АналитикаАктивовПассивов"       	   , Неопределено);
		УслугиСтруктура.Вставить("Комментарий"                         , Выборка.Комментарий);  
		УслугиСтруктура.Вставить("СуммаНДС"       	                   , Выборка.СуммаНДС);
		УслугиСтруктура.Вставить("СуммаСНДС"       	                   , Выборка.СуммаСНДС);
		УслугиСтруктура.Вставить("СтавкаНДС"       	                   , УчетНДС.ПолучитьСтавкуНДС(Выборка.СтавкаНДС));
		УслугиСтруктура.Вставить("ПодразделениеКодМДМ"                 , Выборка.ПодразделениеКодМДМ);
		УслугиСтруктура.Вставить("КонтрагентКодМДМ"                    , Выборка.КонтрагентКодМДМ);
		
		ПрочиеРасходы.Добавить(УслугиСтруктура);
		
	КонецЦикла;	
	
	СтруктураДокумента.Вставить("ПрочиеРасходы", ПрочиеРасходы);
	
	Выборка = ВыпПакет[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОплатаСтруктура = Новый Структура;
		ОплатаСтруктура.Вставить("СтатьяДвиженияДенежныхСредствКодМДМ" , Выборка.СтатьяДвиженияДенежныхСредствКодМДМ);    		
		ОплатаСтруктура.Вставить("ПоставщикКодМДМ" ,                     Выборка.ПоставщикКодМДМ);    		
		ОплатаСтруктура.Вставить("КонтрагентКодМДМ" ,                    Выборка.КонтрагентКодМДМ);    		
		ОплатаСтруктура.Вставить("ДоговорКодМДМ" ,                       Выборка.ДоговорКодМДМ);    		
		ОплатаСтруктура.Вставить("Сумма" ,                               Выборка.Сумма);    		
		ОплатаСтруктура.Вставить("ВалютаВзаиморасчетовКодМДМ" ,          Выборка.ВалютаВзаиморасчетовКодМДМ);    		
		ОплатаСтруктура.Вставить("СуммаВзаиморасчетов" ,                 Выборка.СуммаВзаиморасчетов);    		
		ОплатаСтруктура.Вставить("Комментарий" ,                         Выборка.Комментарий);    	
		ОплатаСтруктура.Вставить("НомерВходящегоДокумента" ,             Выборка.НомерВходящегоДокумента);    		
		ОплатаСтруктура.Вставить("ДатаВходящегоДокумента" ,              Строка(Выборка.ДатаВходящегоДокумента));    		

		ОплатаПоставщикам.Добавить(ОплатаСтруктура);
		
	КонецЦикла;	
	
	СтруктураДокумента.Вставить("ОплатаПоставщикам", ОплатаПоставщикам);
		
КонецПроцедуры

Процедура ЗаписатьКорректировкаРеализацииКакПеремещениеТоваровМеждуСкладами(ДокументОбъект , СтруктураДокумента)

//+Бычков О. 23.04.2025 #UT10-5207
// Вставка
	ТекЗапрос = Новый Запрос;
	ТекЗапрос.Текст = "ВЫБРАТЬ
	                  |	Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы
	                  |ИЗ
	                  |	Константы КАК Константы
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	КорректировкаРеализации.Организация.КодМДМГоловнойОрганизации КАК КодОрганизацииМДМ,
	                  |	КорректировкаРеализации.Контрагент.КодМДМ КАК КодКонтрагентаМДМ,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализации.Ссылка В
	                  |				(ВЫБРАТЬ ПЕРВЫЕ 1
	                  |					КорректировкаРеализацииТовары.Ссылка
	                  |				ИЗ
	                  |					Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                  |				ГДЕ
	                  |					КорректировкаРеализацииТовары.Ссылка = &Ссылка
	                  |					И КорректировкаРеализацииТовары.Количество < КорректировкаРеализацииТовары.КоличествоДоИзменения)
	                  |			ТОГДА КорректировкаРеализации.Грузополучатель.ТранзитныйСкладКодМДМ
	                  |		ИНАЧЕ КорректировкаРеализации.Склад.КодМДМ
	                  |	КОНЕЦ КАК КодСкладаМДМ,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализации.Ссылка В
	                  |				(ВЫБРАТЬ ПЕРВЫЕ 1
	                  |					КорректировкаРеализацииТовары.Ссылка
	                  |				ИЗ
	                  |					Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                  |				ГДЕ
	                  |					КорректировкаРеализацииТовары.Ссылка = &Ссылка
	                  |					И КорректировкаРеализацииТовары.Количество < КорректировкаРеализацииТовары.КоличествоДоИзменения)
	                  |			ТОГДА КорректировкаРеализации.Склад.КодМДМ
	                  |		ИНАЧЕ КорректировкаРеализации.Грузополучатель.ТранзитныйСкладКодМДМ
	                  |	КОНЕЦ КАК КодСкладаПолучателяМДМ,
	                  |	КорректировкаРеализации.Грузополучатель.КодСоглашения КАК КодСоглашения,
	                  |	КорректировкаРеализации.ВалютаДокумента.КодМДМ КАК Валюта,
	                  |	КорректировкаРеализации.Ответственный.Представление КАК Ответственный,
	                  |	КорректировкаРеализации.Номер КАК Номер
	                  |ИЗ
	                  |	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	                  |ГДЕ
	                  |	КорректировкаРеализации.Ссылка = &Ссылка
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	КорректировкаРеализацииТовары.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	                  |	КорректировкаРеализацииТовары.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализацииТовары.Количество > КорректировкаРеализацииТовары.КоличествоДоКорректировки
	                  |			ТОГДА 1
	                  |		ИНАЧЕ -1
	                  |	КОНЕЦ * (КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоКорректировки) КАК Количество,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализацииТовары.Количество > КорректировкаРеализацииТовары.КоличествоДоКорректировки
	                  |			ТОГДА 1
	                  |		ИНАЧЕ -1
	                  |	КОНЕЦ * (КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоКорректировки) КАК КоличествоУпаковок,
	                  |	КорректировкаРеализацииТовары.Цена КАК Цена,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализацииТовары.Сумма > КорректировкаРеализацииТовары.СуммаДоКорректировки
	                  |			ТОГДА 1
	                  |		ИНАЧЕ -1
	                  |	КОНЕЦ * (КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоКорректировки) КАК Сумма,
	                  |	ВЫБОР
	                  |		КОГДА КорректировкаРеализацииТовары.СуммаНДС > КорректировкаРеализацииТовары.СуммаНДСДоКорректировки
	                  |			ТОГДА 1
	                  |		ИНАЧЕ -1
	                  |	КОНЕЦ * (КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоКорректировки) КАК СуммаНДС,
	                  |	КорректировкаРеализацииТовары.СтавкаНДС КАК СтавкаНДС,
					  //+Бычков О. 30.04.2025 #UT10-5208
					  // Вставка
	                  |	КорректировкаРеализацииТовары.ЗаказПокупателя.ДоговорПоставщикаТОХ КАК ДоговорПоставщикаТОХ,
					  //-Бычков О. 30.04.2025 #UT10-5208
	                  |	КорректировкаРеализацииТовары.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД
	                  |ИЗ
	                  |	Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	                  |ГДЕ
	                  |	КорректировкаРеализацииТовары.Ссылка = &Ссылка
	                  |	И (НЕ КорректировкаРеализацииТовары.Количество - КорректировкаРеализацииТовары.КоличествоДоКорректировки = 0
	                  |			ИЛИ НЕ КорректировкаРеализацииТовары.Сумма - КорректировкаРеализацииТовары.СуммаДоКорректировки = 0
	                  |			ИЛИ НЕ КорректировкаРеализацииТовары.СуммаНДС - КорректировкаРеализацииТовары.СуммаНДСДоКорректировки = 0)";
	
	ТекЗапрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	ТекРезультатыЗапроса = ТекЗапрос.ВыполнитьПакет();
	
	ТекРезультат = ТекРезультатыЗапроса[0];
	
	ТекПрефиксУзлаРаспределеннойИнформационнойБазы = "";
	
	Если Не ТекРезультат.Пустой() Тогда
	
		ТекВыборка = ТекРезультат.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
		
			ТекПрефиксУзлаРаспределеннойИнформационнойБазы = ТекВыборка.ПрефиксУзлаРаспределеннойИнформационнойБазы;
		
		КонецЕсли;
	
	КонецЕсли;
	
	МассивПоддерживаемыхТипов = МассивПоддерживаемыхТиповJSON();
	
	ТекРезультат = ТекРезультатыЗапроса[1];
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
			
			СтруктураДокумента.Вставить("КодОрганизацииМДМ", ТекВыборка.КодОрганизацииМДМ);
			//+Бычков О. 30.04.2025 #UT10-5208
			// Вставка
			СтруктураДокумента.Вставить("КодМДМОрганизацииТОХ", "");
			//-Бычков О. 30.04.2025 #UT10-5208
			
			СтруктураДокумента.Вставить("КодКонтрагентаМДМ", ТекВыборка.КодКонтрагентаМДМ);
			
			СтруктураДокумента.Вставить("Сумма", 0);
			СтруктураДокумента.Вставить("СуммаНДС", 0);
			
			СтруктураДокумента.Вставить("НомерДокументаУТ11", ВРег(Лев(СокрЛП(ТекПрефиксУзлаРаспределеннойИнформационнойБазы), 2))
			+ "0" + Лев(Прав(СокрЛП(ТекВыборка.Номер), 6), 1) + "-Р" + Прав(СокрЛП(ТекВыборка.Номер), 5));
			
			СтруктураДокумента.Вставить("КодСкладаМДМ", ТекВыборка.КодСкладаМДМ);
			СтруктураДокумента.Вставить("КодСкладаПолучателяМДМ", ТекВыборка.КодСкладаПолучателяМДМ);
			СтруктураДокумента.Вставить("КодСоглашения", СокрЛП(ТекВыборка.КодСоглашения));
			СтруктураДокумента.Вставить("Валюта", ТекВыборка.Валюта);
			
			СтруктураДокумента.Вставить("ВозвратРекламационногоТовара", "");
			СтруктураДокумента.Вставить("СтатусСогласования", "");
			СтруктураДокумента.Вставить("ВозвратСтороннимСкладам", "");
			СтруктураДокумента.Вставить("Ответственный", СокрЛП(ТекВыборка.Ответственный));
			СтруктураДокумента.Вставить("ХозяйственнаяОперация", "ПеремещениеТоваров");
			СтруктураДокумента.Вставить("ДокументОснование", Неопределено);
			
		КонецЕсли;
	
	КонецЕсли;
	
	ТекСуммаДокумента = 0;
	ТекСуммаНДСДокумента = 0;
	//+Бычков О. 30.04.2025 #UT10-5208
	// Вставка
	ТекЗаменитьОрганизациюНаОХ = Ложь;	
	//-Бычков О. 30.04.2025 #UT10-5208
	
	ТекРезультат = ТекРезультатыЗапроса[2];
	
	ТекТовары = Новый Массив;
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		ТекНомерСтроки = 1;
		
		Пока ТекВыборка.Следующий() Цикл
			
		    ТекСтрокаТовара = Новый Структура;
			
			ТекСтрокаТовара.Вставить("НомерСтроки", ТекНомерСтроки);
			ТекСтрокаТовара.Вставить("КодМДМНоменклатуры", ТекВыборка.КодМДМНоменклатуры);
			ТекСтрокаТовара.Вставить("Количество", ТекВыборка.Количество);
			ТекСтрокаТовара.Вставить("КоличествоУпаковок", ТекВыборка.Количество);
			ТекСтрокаТовара.Вставить("КодМДМЕдиницыИзмерения", ТекВыборка.КодМДМЕдиницыИзмерения);
			ТекСтрокаТовара.Вставить("Цена", ТекВыборка.Цена);
			ТекСтрокаТовара.Вставить("Сумма", ТекВыборка.Сумма);
			ТекСтрокаТовара.Вставить("СуммаНДС", ТекВыборка.СуммаНДС);		
			ТекСтрокаТовара.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(ТекВыборка.СтавкаНДС));
			ТекСтрокаТовара.Вставить("НомерГТД", СокрЛП(ТекВыборка.НомерГТД));
			
			ТекТовары.Добавить(ТекСтрокаТовара);
			
			ТекСуммаДокумента = ТекСуммаДокумента + ТекВыборка.Сумма;
			
			//+Бычков О. 30.04.2025 #UT10-5208
			// Вставка
			Если ЗначениеЗаполнено(ТекВыборка.ДоговорПоставщикаТОХ) Тогда
				ТекЗаменитьОрганизациюНаОХ = Истина;
			КонецЕсли;
			//-Бычков О. 30.04.2025 #UT10-5208
			
			ТекСуммаНДСДокумента = ТекСуммаНДСДокумента + ТекВыборка.СуммаНДС;
			
			ТекНомерСтроки = ТекНомерСтроки + 1;
			
		КонецЦикла;
	
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Сумма", ТекСуммаДокумента);
	СтруктураДокумента.Вставить("СуммаНДС", ТекСуммаНДСДокумента);
	
	//+Бычков О. 30.04.2025 #UT10-5208
	// Вставка
	Если ТекЗаменитьОрганизациюНаОХ Тогда
		СтруктураДокумента.Вставить("КодМДМОрганизацииТОХ", Константы.КодМДМОрганизацииТОХ.Получить());
	КонецЕсли;
	//-Бычков О. 30.04.2025 #UT10-5208
	
	СтруктураДокумента.Вставить("Товары", ТекТовары);
//-Бычков О. 23.04.2025 #UT10-5207	

КонецПроцедуры

Процедура ЗаписатьПоступлениеТоваровНаОтветственноеХранениеКакПеремещениеТоваровМеждуСкладами(ДокументОбъект , СтруктураДокумента) 
	
//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекЗапрос = Новый Запрос;
	ТекЗапрос.Текст = "ВЫБРАТЬ
	                  |	Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы
	                  |ИЗ
	                  |	Константы КАК Константы
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	Константы.КодМДМОрганизацииТОХ КАК КодОрганизацииМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Контрагент.КодМДМ КАК КодКонтрагентаМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Склад.ТранзитныйСкладКодМДМ КАК КодСкладаМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Склад.КодМДМ КАК КодСкладаПолучателяМДМ,
	                  |	"""" КАК КодСоглашения,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ВалютаДокумента.КодМДМ КАК Валюта,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Ответственный.Представление КАК Ответственный,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Номер КАК Номер
	                  |ИЗ
	                  |	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	                  |		ПО (ИСТИНА)
	                  |ГДЕ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка = &Ссылка
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Количество КАК Количество,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Количество КАК КоличествоУпаковок,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Цена КАК Цена,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Сумма КАК Сумма,
	                  |	0 КАК СуммаНДС,
	                  |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД
	                  |ИЗ
	                  |	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранение
	                  |ГДЕ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка = &Ссылка";
	
	ТекЗапрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	ТекРезультатыЗапроса = ТекЗапрос.ВыполнитьПакет();
	
	ТекРезультат = ТекРезультатыЗапроса[0];
	
	ТекПрефиксУзлаРаспределеннойИнформационнойБазы = "";
	
	Если Не ТекРезультат.Пустой() Тогда
	
		ТекВыборка = ТекРезультат.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
		
			ТекПрефиксУзлаРаспределеннойИнформационнойБазы = ТекВыборка.ПрефиксУзлаРаспределеннойИнформационнойБазы;
		
		КонецЕсли;
	
	КонецЕсли;
	
	МассивПоддерживаемыхТипов = МассивПоддерживаемыхТиповJSON();
	
	ТекРезультат = ТекРезультатыЗапроса[1];
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
			
			СтруктураДокумента.Вставить("КодОрганизацииМДМ", ТекВыборка.КодОрганизацииМДМ);
			СтруктураДокумента.Вставить("КодКонтрагентаМДМ", ТекВыборка.КодКонтрагентаМДМ);
			
			СтруктураДокумента.Вставить("Сумма", 0);
			СтруктураДокумента.Вставить("СуммаНДС", 0);
			
			СтруктураДокумента.Вставить("НомерДокументаУТ11", ВРег(Лев(СокрЛП(ТекПрефиксУзлаРаспределеннойИнформационнойБазы), 2))
			+ "0" + Лев(Прав(СокрЛП(ТекВыборка.Номер), 6), 1) + "-П" + Прав(СокрЛП(ТекВыборка.Номер), 5));
			
			СтруктураДокумента.Вставить("КодСкладаМДМ", ТекВыборка.КодСкладаМДМ);
			СтруктураДокумента.Вставить("КодСкладаПолучателяМДМ", ТекВыборка.КодСкладаПолучателяМДМ);
			СтруктураДокумента.Вставить("КодСоглашения", СокрЛП(ТекВыборка.КодСоглашения));
			СтруктураДокумента.Вставить("Валюта", ТекВыборка.Валюта);
			
			СтруктураДокумента.Вставить("ВозвратРекламационногоТовара", "");
			СтруктураДокумента.Вставить("СтатусСогласования", "");
			СтруктураДокумента.Вставить("ВозвратСтороннимСкладам", "");
			СтруктураДокумента.Вставить("Ответственный", СокрЛП(ТекВыборка.Ответственный));
			СтруктураДокумента.Вставить("ХозяйственнаяОперация", "ПеремещениеТоваров");
			СтруктураДокумента.Вставить("ДокументОснование", Неопределено);
			
		КонецЕсли;
	
	КонецЕсли;
	
	ТекСуммаДокумента = 0;
	ТекСуммаНДСДокумента = 0;
	
	ТекРезультат = ТекРезультатыЗапроса[2];
	
	ТекТовары = Новый Массив;
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		ТекНомерСтроки = 1;
		
		Пока ТекВыборка.Следующий() Цикл
			
		    ТекСтрокаТовара = Новый Структура;
			
			ТекСтрокаТовара.Вставить("НомерСтроки", ТекНомерСтроки);
			ТекСтрокаТовара.Вставить("КодМДМНоменклатуры", ТекВыборка.КодМДМНоменклатуры);
			ТекСтрокаТовара.Вставить("Количество", ТекВыборка.Количество);
			ТекСтрокаТовара.Вставить("КоличествоУпаковок", ТекВыборка.Количество);
			ТекСтрокаТовара.Вставить("КодМДМЕдиницыИзмерения", ТекВыборка.КодМДМЕдиницыИзмерения);
			ТекСтрокаТовара.Вставить("Цена", ТекВыборка.Цена);
			ТекСтрокаТовара.Вставить("Сумма", ТекВыборка.Сумма);
			ТекСтрокаТовара.Вставить("СуммаНДС", ТекВыборка.СуммаНДС);		
			ТекСтрокаТовара.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(ТекВыборка.СтавкаНДС));
			ТекСтрокаТовара.Вставить("НомерГТД", СокрЛП(ТекВыборка.НомерГТД));
			
			ТекТовары.Добавить(ТекСтрокаТовара);
			
			ТекСуммаДокумента = ТекСуммаДокумента + ТекВыборка.Сумма;
			
			ТекСуммаНДСДокумента = ТекСуммаНДСДокумента + ТекВыборка.СуммаНДС;
			
			ТекНомерСтроки = ТекНомерСтроки + 1;
			
		КонецЦикла;
	
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Сумма", ТекСуммаДокумента);
	СтруктураДокумента.Вставить("СуммаНДС", ТекСуммаНДСДокумента);
	
	СтруктураДокумента.Вставить("Товары", ТекТовары);
//-Бычков О. 28.04.2025 #UT10-5208	

КонецПроцедуры

Процедура ЗаписатьПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры)

//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекМетаданные = ДокументОбъект.Метаданные();
	
	ТекИмяДокумента = ТекМетаданные.Имя;
	
	Если ТекИмяДокумента = "КорректировкаРеализации" Тогда
		ЗаписатьКорректировкаРеализацииКакПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента);
	ИначеЕсли ТекИмяДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда
		ЗаписатьПоступлениеТоваровНаОтветственноеХранениеКакПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента);
	Иначе
		ЗаписатьРеализацияТоваровУслугКакПеремещениеТоваровМеждуСкладами(ДокументОбъект, СтруктураДокумента, ПеречитатьРегистры);
	КонецЕсли;
//-Бычков О. 28.04.2025 #UT10-5208

КонецПроцедуры

Процедура ЗаписатьПоступлениеТоваровНаОтветственноеХранениеКакПоступлениеТоваровУслуг(ДокументОбъект , СтруктураДокумента) 
	
//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекЗапрос = Новый Запрос;
	ТекЗапрос.Текст = "ВЫБРАТЬ
	                  |	Константы.КодМДМОрганизацииТОХ КАК КодОрганизацииМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Контрагент.КодМДМ КАК КодКонтрагентаМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Контрагент.КодМДМПартнера КАК КодПартнераМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ДоговорКонтрагента.КодМДМ КАК КодДоговораМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Склад.КодМДМ КАК КодСкладаМДМ,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ВалютаДокумента.КодМДМ КАК Валюта,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Дата КАК ДатаПоступления,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ДатаПриходаТовараНаСклад КАК ФактическаяДатаПоступления
	                  |ИЗ
	                  |	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	                  |		ПО (ИСТИНА)
	                  |ГДЕ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка = &Ссылка
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.НомерСтроки КАК НомерСтроки,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Номенклатура.КодМДМ КАК КодМДМНоменклатуры,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.ЕдиницаИзмерения.КодМДМ КАК КодМДМЕдиницыИзмерения,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Количество КАК Количество,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Цена КАК Цена,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Сумма КАК Сумма,
	                  |	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Сумма КАК СуммаСНДС,
	                  |	0 КАК СуммаНДС,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.СерияНоменклатуры.НомерГТД.Представление КАК НомерГТД,
	                  |	ПоступлениеТоваровНаОтветственноеХранение.СерияНоменклатуры.СтранаПроисхождения.КодМДМ КАК КодМДМСтранаПроисхождения
	                  |ИЗ
	                  |	Документ.ПоступлениеТоваровНаОтветственноеХранение.Товары КАК ПоступлениеТоваровНаОтветственноеХранение
	                  |ГДЕ
	                  |	ПоступлениеТоваровНаОтветственноеХранение.Ссылка = &Ссылка
	                  |	И НЕ ПоступлениеТоваровНаОтветственноеХранение.Количество = 0
	                  |
	                  |УПОРЯДОЧИТЬ ПО
	                  |	НомерСтроки
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ДоговорыАварды.КодАварда
	                  |ИЗ
	                  |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
	                  |		ПО ПоступлениеТоваровУслуг.ДоговорКонтрагента = ДоговорыАварды.ДоговорКонтрагента
	                  |ГДЕ
	                  |	ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	
	ТекЗапрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	ТекРезультатыЗапроса = ТекЗапрос.ВыполнитьПакет();
	
	МассивПоддерживаемыхТипов = МассивПоддерживаемыхТиповJSON();
	
	ТекРезультат = ТекРезультатыЗапроса[0];
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
			
			СтруктураДокумента.Вставить("КодОрганизацииМДМ", ТекВыборка.КодОрганизацииМДМ);
			СтруктураДокумента.Вставить("КодКонтрагентаМДМ", ТекВыборка.КодКонтрагентаМДМ);
			СтруктураДокумента.Вставить("КодПартнераМДМ", ТекВыборка.КодПартнераМДМ);
			СтруктураДокумента.Вставить("КодДоговораМДМ", ТекВыборка.КодДоговораМДМ);
			СтруктураДокумента.Вставить("КодСкладаМДМ", ТекВыборка.КодСкладаМДМ);
			СтруктураДокумента.Вставить("Сумма", 0);
			СтруктураДокумента.Вставить("СуммаНДС", 0);
			СтруктураДокумента.Вставить("Валюта", ТекВыборка.Валюта);
			СтруктураДокумента.Вставить("КодСоглашенияАварда", "");
			СтруктураДокумента.Вставить("КодСоглашенияМДМ", "");
			СтруктураДокумента.Вставить("ПополнениеЗапасов", Ложь);
			СтруктураДокумента.Вставить("ОбратноеПоступление",	0);
			СтруктураДокумента.Вставить("КоличествоКорректировок", 0);
			СтруктураДокумента.Вставить("НалогообложениеНДС", "ПродажаНеОблагаетсяНДС");
			СтруктураДокумента.Вставить("КодОрганизацииИС", "");
			СтруктураДокумента.Вставить("КодКонтрагентаИС", "");
			СтруктураДокумента.Вставить("КодПартнераИС", "");
			СтруктураДокумента.Вставить("КодДоговораИС", "");
			СтруктураДокумента.Вставить("КодСкладаИС", "");
			СтруктураДокумента.Вставить("ВалютаЦифровойКод", "");
			СтруктураДокумента.Вставить("ВалютаБуквенныйКод", "");
			СтруктураДокумента.Вставить("НомерВходящегоДокумента", ТекВыборка.НомерВходящегоДокумента);
			СтруктураДокумента.Вставить("ДатаВходящегоДокумента", Строка(ТекВыборка.ДатаВходящегоДокумента));
			СтруктураДокумента.Вставить("ДатаПоступления", Строка(ТекВыборка.ДатаПоступления));
			СтруктураДокумента.Вставить("ФактическаяДатаПоступления", Строка(ТекВыборка.ФактическаяДатаПоступления));
			СтруктураДокумента.Вставить("ТоварПоступил", ЗначениеЗаполнено(ТекВыборка.ФактическаяДатаПоступления));
			СтруктураДокумента.Вставить("Предварительный", Ложь);
			СтруктураДокумента.Вставить("УникальныйИдентификаторОснования", "");  
			СтруктураДокумента.Вставить("ДатаОснования", Дата(1, 1, 1));  
			СтруктураДокумента.Вставить("НомерОснования", "");  
			
		КонецЕсли;
	
	КонецЕсли;
	
	ТекСуммаДокумента = 0;
	ТекСуммаНДСДокумента = 0;
	
	ТекРезультат = ТекРезультатыЗапроса[1];
	
	ТекТовары = Новый Массив;
	
	Если Не ТекРезультат.Пустой() Тогда
		
		ТекВыборка = ТекРезультат.Выбрать();
		
		Пока ТекВыборка.Следующий() Цикл
			
		    ТекСтрокаТовара = Новый Структура;
			
			ТекСтрокаТовара.Вставить("НомерСтроки", ?(ЗначениеЗаполнено(ТекВыборка.НомерСтроки), ТекВыборка.НомерСтроки, ""));		
			ТекСтрокаТовара.Вставить("КодМДМНоменклатуры", ?(ЗначениеЗаполнено(ТекВыборка.КодМДМНоменклатуры), ТекВыборка.КодМДМНоменклатуры, "")); 		
			ТекСтрокаТовара.Вставить("КодМДМЕдиницыИзмерения", ?(ЗначениеЗаполнено(ТекВыборка.КодМДМЕдиницыИзмерения), ТекВыборка.КодМДМЕдиницыИзмерения, "")); 		
			ТекСтрокаТовара.Вставить("Количество", ?(ЗначениеЗаполнено(ТекВыборка.Количество), ТекВыборка.Количество, 0));
			ТекСтрокаТовара.Вставить("Цена", ?(ЗначениеЗаполнено(ТекВыборка.Цена), ТекВыборка.Цена, 0)); 
			ТекСтрокаТовара.Вставить("Сумма", ?(ЗначениеЗаполнено(ТекВыборка.Сумма), ТекВыборка.Сумма, 0)); 
			ТекСтрокаТовара.Вставить("СтавкаНДС",УчетНДС.ПолучитьСтавкуНДС(ТекВыборка.СтавкаНДС));
			ТекСтрокаТовара.Вставить("СуммаСНДС", ?(ЗначениеЗаполнено(ТекВыборка.Сумма), ТекВыборка.Сумма, 0)); 
			ТекСтрокаТовара.Вставить("СуммаНДС", ?(ЗначениеЗаполнено(ТекВыборка.СуммаНДС), ТекВыборка.СуммаНДС, 0)); 
			ТекСтрокаТовара.Вставить("ИнвентарныйНомер", "");
			ТекСтрокаТовара.Вставить("Артикул", "");
			ТекСтрокаТовара.Вставить("НаименованиеПроизводителя", "");
			ТекСтрокаТовара.Вставить("НазваниеЕдиницыИзмерения", "");
			ТекСтрокаТовара.Вставить("НомерГТД", ?(ЗначениеЗаполнено(ТекВыборка.НомерГТД), СокрЛП(ТекВыборка.НомерГТД), ""));
			ТекСтрокаТовара.Вставить("КодМДМСтранаПроисхождения", ?(ЗначениеЗаполнено(ТекВыборка.КодМДМСтранаПроисхождения), СокрЛП(ТекВыборка.КодМДМСтранаПроисхождения), ""));
			ТекСтрокаТовара.Вставить("ПодразделениеКодМДМ", "");
			ТекСтрокаТовара.Вставить("СписатьНаРасходы", Ложь);
			ТекСтрокаТовара.Вставить("СтатьяРасходов", Неопределено);
			ТекСтрокаТовара.Вставить("АналитикаРасходов", Неопределено);
			ТекСтрокаТовара.Вставить("Отменено", ЛОЖЬ);
			
			ТекТовары.Добавить(ТекСтрокаТовара);
			
			ТекСуммаДокумента = ТекСуммаДокумента + ТекВыборка.Сумма;
			
			ТекСуммаНДСДокумента = ТекСуммаНДСДокумента + ТекВыборка.СуммаНДС;
			
		КонецЦикла;
	
	КонецЕсли;
	
	СтруктураДокумента.Вставить("Сумма", ТекСуммаДокумента);
	СтруктураДокумента.Вставить("СуммаНДС", ТекСуммаНДСДокумента);
	
	СтруктураДокумента.Вставить("Товары", ТекТовары);

	ТекКодСоглашенияАварда = "";
	
	ТекРезультат = ТекРезультатыЗапроса[2];
	
	Если Не ТекРезультат.Пустой() Тогда
	
		ТекВыборка = ТекРезультат.Выбрать();

		Пока ТекВыборка.Следующий() Цикл       
			ТекКодСоглашенияАварда = ТекКодСоглашенияАварда + ?(ЗначениеЗаполнено(ТекКодСоглашенияАварда), ",", "") + СтрЗаменить(Строка(ТекВыборка.КодАварда), " ", "");
		КонецЦикла;
	
	КонецЕсли;
	
	СтруктураДокумента.Вставить("КодСоглашенияАварда", 	ТекКодСоглашенияАварда);
	
	СтруктураДокумента.Вставить("ЭтапыГрафикаОплаты", Новый Массив); 
	
//-Бычков О. 28.04.2025 #UT10-5208	

КонецПроцедуры

Процедура ЗаписатьПоступлениеТоваровУслуг(ДокументОбъект, СтруктураДокумента, ТЗТовары)

//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекМетаданные = ДокументОбъект.Метаданные();
	
	ТекИмяДокумента = ТекМетаданные.Имя;
	
	Если ТекИмяДокумента = "ПоступлениеТоваровНаОтветственноеХранение" Тогда
		ЗаписатьПоступлениеТоваровНаОтветственноеХранениеКакПоступлениеТоваровУслуг(ДокументОбъект , СтруктураДокумента);
	Иначе
		ЗаписатьПоступлениеТоваровУслугРаббит(ДокументОбъект, СтруктураДокумента, ТЗТовары);
	КонецЕсли;
//-Бычков О. 28.04.2025 #UT10-5208	

КонецПроцедуры

Процедура ЗаписатьЗаказПокупателя(Документ, СтруктураДокумента)
	
	//+Сёмин Р.И. 04.08.2026 #UT10-5985
	ЗаписатьРеквизитДокументаВСтруктуру(СтруктураДокумента, Документ, "Организация", "КодМДМГоловнойОрганизации", "КодОрганизацииМДМ");
	СтруктураДокумента.Вставить("КодКонтрагентаМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Контрагент, "КодМДМ"));
	СтруктураДокумента.Вставить("КодПартнераМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Контрагент, "КодМДМПартнера"));
	СтруктураДокумента.Вставить("КодФилиалаМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.Грузополучатель, "КодМДМ"));
	СтруктураДокумента.Вставить("КодДоговораМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.ДоговорКонтрагента, "КодМДМ"));
	СтруктураДокумента.Вставить("КодСкладаМДМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.СкладГруппа, "КодМДМ"));
	СтруктураДокумента.Вставить("СпособДоставки", Строка(Документ.СпособДоставки));
	СтруктураДокумента.Вставить("ИсточникЗаказа", Документ.ИсточникЗаказа.КодИсточника);
	СтруктураДокумента.Вставить("Сумма", Документ.СуммаДокумента);
	СтруктураДокумента.Вставить("СуммаНДС", Документ.Товары.Итог("СуммаНДС"));	
	СтруктураДокумента.Вставить("Валюта", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ.ВалютаДокумента, "КодМДМ"));
	
	Товары = Новый Массив;
	
	Для Каждого Стр Из Документ.Товары Цикл
		
		ТоварыСтруктура = Новый Структура;
		
		ТоварыСтруктура.Вставить("НомерСтроки", Стр.НомерСтроки);
		ТоварыСтруктура.Вставить("КодМДМНоменклатуры", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.Номенклатура, "КодМДМ"));
		ТоварыСтруктура.Вставить("КодМДМЕдиницыИзмерения", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Стр.ЕдиницаИзмерения, "КодМДМ"));
		ТоварыСтруктура.Вставить("Количество", Стр.Количество);
		ТоварыСтруктура.Вставить("Цена", Стр.Цена);
		ТоварыСтруктура.Вставить("Сумма", Стр.Сумма);
		ТоварыСтруктура.Вставить("СуммаНДС", Стр.СуммаНДС);
		ТоварыСтруктура.Вставить("СтавкаНДС", УчетНДС.ПолучитьСтавкуНДС(Стр.СтавкаНДС));
		
		Товары.Добавить(ТоварыСтруктура);   		
		
	КонецЦикла;
	
	СтруктураДокумента.Вставить("Товары", Товары);
	//-Сёмин Р.И. 04.08.2026 #UT10-5985
	
КонецПроцедуры

///////////////////Вспомогательные процедуры///////////////////
Функция ДатуВTimestamp(Знач пДата = Неопределено) Экспорт
	
	Если ТипЗнч(пДата) = Тип("Дата") Тогда     
		пДата = УниверсальноеВремя(пДата);	  
	КонецЕсли;
	
	Возврат Формат(Число(?(ТипЗнч(пДата) = Тип("Дата"), пДата, УниверсальноеВремя(ТекущаяДата())) - Дата("19700101")), "ЧН=0; ЧГ=0");
	
КонецФункции

Процедура ОповеститьСерверМониторинга(Успешно, ЗаписыватьВЖурналОшибку = Истина, ИсходящееСообщение = Неопределено, ТекстОшибки = "", НомерСообщения = "") Экспорт 
	
	КодПрикладнойСистемы = ПолучитьКодПрикладнойСистемы();
	
	СтруктураСообщения = Новый Структура; 
	
	Если Не Успешно Тогда    
		
		СтруктураСообщения.Вставить("service", "doc-order-sending");
		СтруктураСообщения.Вставить("error", ?(ЗначениеЗаполнено(ТекстОшибки), ТекстОшибки, "Not estimated")); 	
		СтруктураСообщения.Вставить("solved", Успешно);
		
		СвойстваСтруктура = Новый Структура;
		СвойстваСтруктура.Вставить("app_id", КодПрикладнойСистемы);    					
		СтруктураСообщения.Вставить("props", СвойстваСтруктура); 
		
	Иначе        		                                          
		
		СвойстваСтруктура = Новый Структура;
		СвойстваСтруктура.Вставить("solved", Истина);    					
		СтруктураСообщения.Вставить("doc", СвойстваСтруктура); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИсходящееСообщение) Тогда 		
		
		Если Не Успешно И ЗначениеЗаполнено(ИсходящееСообщение.Сообщение) Тогда  
			
			СтруктураСообщения.Вставить("body", ИсходящееСообщение.Сообщение);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НомерСообщения) Тогда                    
			
			НомерСообщения = ИсходящееСообщение.УникальныйИдентификатор();  
			
		КонецЕсли;
		
	КонецЕсли;     
	
	Оповещен = AMQP_РаботаСоСправочниками.ОтправитьСообщениеВЭластик(СтруктураСообщения, НомерСообщения, ЗаписыватьВЖурналОшибку, "ОтправкаСообщений.Ошибка");
	
	Если Оповещен И Не Успешно Тогда   
		
		Если ЗначениеЗаполнено(ИсходящееСообщение) Тогда   
			
			Об = ИсходящееСообщение.ПолучитьОбъект();
			Об.БылаОшибка = Истина;
			Об.Записать(); 
			
		КонецЕсли;    
		
	КонецЕсли;  
	
КонецПроцедуры

Функция ПолучитьКодПрикладнойСистемы()
	
	Выборка = Справочники.ПодпискиНаОчередиСообщений.Выбрать();
	
	Если Выборка.Следующий() Тогда                    
		Возврат Лев(Выборка.ИмяОчереди, Найти(Выборка.ИмяОчереди, ".") - 1); 
	Иначе                     
		Возврат "Test";     
	КонецЕсли;
	
КонецФункции

Функция ЭтоСсылка(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда  
		Возврат Ложь;   
	Иначе                
		Возврат Истина;   
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьРеквизитДокументаВСтруктуру(Структура, Документ, ИмяРеквизита, ИмяРеквизитаДоп = "", Представление = "") 	
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента(ИмяРеквизита, Документ.Метаданные()) Тогда
		
		Значение = Документ[ИмяРеквизита];
		ЭтоСсылка = ЭтоСсылка(Значение);			
		
		Если Не ЭтоСсылка Тогда    
			Структура.Вставить(?(ЗначениеЗаполнено(ИмяРеквизитаДоп), ИмяРеквизитаДоп, ИмяРеквизита), Значение);	
		Иначе   
			
			Если ЗначениеЗаполнено(ИмяРеквизитаДоп) Тогда 		
				
				ЗначениеДоп = Значение[ИмяРеквизитаДоп];  					
				Структура.Вставить(?(ЗначениеЗаполнено(Представление), Представление, ИмяРеквизитаДоп), ЗначениеДоп);	
				
			КонецЕсли;    
			
		КонецЕсли;   
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПрисвоитьШтрихКод(Владелец) Экспорт
	
	ТекЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
	ТекЗапись.Владелец = Владелец;
	ТекЗапись.ТипШтрихкода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
	
	ШК = РаботаСТорговымОборудованием.СформироватьШтрихКод();
	ТекЗапись.Штрихкод = ?(ШК = Неопределено, "", ШК); 
	
	Попытка 
		
		ТекЗапись.Записать();
		Возврат Истина; 
		
	Исключение	
		Возврат Ложь; 		
	КонецПопытки;    	
	
КонецФУнкции

Процедура СформироватьЗаголовкиИСвойства_ПоступлениеТоваровУслуг(Заголовки, Свойства, ДокументОбъект) Экспорт

	Заголовки.Добавить("document_type",  ДокументОбъект.Ссылка.Метаданные().Имя);	
	Заголовки.Добавить("message_ver",    "2.0");
	
	Если ТипЗнч(ДокументОбъект.СкладОрдер) = Тип("СправочникСсылка.Склады") Тогда 
		Заголовки.Добавить("warehouse_id",   СокрЛП(ДокументОбъект.СкладОрдер.КодМДМ));  
	Иначе        
		Заголовки.Добавить("warehouse_id",   ""); 
	КонецЕсли;          
	
	Заголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));

КонецПроцедуры

Процедура ДобавитьДополнительныйЗаголовокДляОбособленныхПодразделений(ИмяДокумента, Документ, НовоеСообщение)

	ЗначениеОтбора = 0;  
	
	Если ИмяДокумента = "КорректировкаПоступления" Тогда 
		
		Если НЕ Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить() Тогда 
			ЗначениеОтбора = 0;           
		ИначеЕсли  Документ.Контрагент = Константы.ДопПоставщик.Получить() Тогда 
			ЗначениеОтбора = 1;  
		КонецЕсли;		      
		
	КонецЕсли;
	
	НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
	НоваяСтрока.Наименование = "ReplenishmentSeparateSubdivisionLE";
	НоваяСтрока.Значение = ЗначениеОтбора;

КонецПроцедуры 

Функция НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(Ссылка)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ПоступлениеТоваровУслуг.Организация = Организации.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ПоступлениеТоваровУслуг.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	Организации.ИНН = Контрагенты.ИНН
	|	И ПоступлениеТоваровУслуг.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции  

Функция ПроверитьУстановкуЦен(ПромДок)
	
	Возврат ПромДок.Ответственный = Справочники.Пользователи.НайтиПоКоду("robot")   
	ИЛИ ПромДок.Дата < НачалоДня(ТекущаяДата() - 86400*7)
	ИЛИ ЗначениеЗаполнено(ПромДок.ИДДокументаВСмежнойБазе);    
	
КонецФункции

Функция ПроверитьУстановкуЦенКонтрагентов(ПромДок)
	
	Возврат ПромДок.Контрагент = Константы.ОсновнойПоставщик.Получить()   
	ИЛИ ЗначениеЗаполнено(ПромДок.ИДДокументаВСмежнойБазе);    
	
КонецФункции 

Функция ПроверитьАктВыполненныхРабот(ПромДок) 
	
	Возврат НЕ (ПромДок.Организация = Константы.ОсновнаяОрганизация.Получить() 
	И ПромДок.Статус = Перечисления.СтатусАктаВыполненныхРабот.КОплате);  	
	
КонецФункции

// Позволяет определить, есть ли среди реквизитов объекта реквизит с переданным именем.
//
// Параметры:
//  ИмяРеквизита - Строка - имя реквизита;
//  МетаданныеОбъекта - ОбъектМетаданных - объект, в котором требуется проверить наличие реквизита.
//
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, МетаданныеОбъекта) Экспорт
	
	Возврат НЕ (МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено);
	
КонецФункции

// Определяет принадлежность объекта метаданных к ссылочному типу.
//
// Параметры:
//  ОбъектМетаданных - ОбъектМетаданных - объект, для которого необходимо определить принадлежность к заданному типу.
// 
//  Возвращаемое значение:
//   Булево.
//
Функция ЭтоОбъектСсылочногоТипа(ОбъектМетаданных) Экспорт
	
	ИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	Позиция = Найти(ИмяОбъектаМетаданных, ".");  
	
	Если Позиция > 0 Тогда 
		
		ИмяБазовогоТипа = Лев(ИмяОбъектаМетаданных, Позиция - 1);
		Возврат ИмяБазовогоТипа = "Справочник"
		Или ИмяБазовогоТипа = "Документ"
		Или ИмяБазовогоТипа = "БизнесПроцесс"
		Или ИмяБазовогоТипа = "Задача"
		Или ИмяБазовогоТипа = "ПланСчетов"
		Или ИмяБазовогоТипа = "ПланОбмена"
		Или ИмяБазовогоТипа = "ПланВидовХарактеристик"
		Или ИмяБазовогоТипа = "ПланВидовРасчета";   
		
	Иначе 
		
		Возврат Ложь;   
		
	КонецЕсли;
	
КонецФункции

Функция МассивПоддерживаемыхТиповJSON() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	Массив.Добавить(Тип("Булево"));
	Массив.Добавить(Тип("Число"));
	Массив.Добавить(Тип("Структура"));
	Массив.Добавить(Тип("Соответствие"));
	Массив.Добавить(Тип("Массив"));
	Массив.Добавить(Тип("Неопределено"));
	
	Возврат Массив;  
	
КонецФункции 

Функция _XMLСтрока(Значение) Экспорт 
	
	Если ТипЗнч(Значение) = Тип("Дата") Тогда
		Результат = Строка(Значение);
	Иначе
		Результат = XMLСтрока(Значение);
	КонецЕсли;   
	
	Возврат Результат;     
	
КонецФункции 

Функция ЗначениеJSON(Значение , МассивПоддерживаемыхТипов) Экспорт 
	
	Если МассивПоддерживаемыхТипов.Найти(ТипЗнч(Значение)) <> Неопределено Тогда     
		Возврат Значение;
	КонецЕсли;                 
	
	Результат = Неопределено;
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Значение)); 
	
	Если МетаданныеОбъекта <> Неопределено И ЭтоОбъектСсылочногоТипа(МетаданныеОбъекта) Тогда    
		
		Результат = Новый Структура("Тип, Идентификатор", МетаданныеОбъекта.ПолноеИмя(), XMLСтрока(Значение));
		Результат.Вставить("Представление", Строка(Значение));
		
		МассивСвойств = Новый Массив;
		МассивСвойств.Добавить("КодМДМ");
		МассивСвойств.Добавить("Дата");
		МассивСвойств.Добавить("Номер");
		
		Массив = Новый Массив;
		
		Для Каждого Ключ Из МассивСвойств Цикл                		
			
			Если ЕстьРеквизитОбъекта(Ключ, МетаданныеОбъекта) Тогда 
				Массив.Добавить(Ключ);
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Реквизит Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл  
			
			Если МассивСвойств.Найти(Реквизит.Имя) <> Неопределено Тогда   
				Массив.Добавить(Реквизит.Имя);
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Массив) Тогда
			
			Для Каждого КлючЗначение Из ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Значение, Массив) Цикл 
				Результат.Вставить(КлючЗначение.Ключ, _XMLСтрока(КлючЗначение.Значение));
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда    
		Результат = _XMLСтрока(Значение);  
	КонецЕсли;
	
	Возврат Результат;            
	
КонецФункции

Процедура ЗаполнитьКоллекциюЗначений(Структура, Выборка, Коллекция, МассивПоддерживаемыхТипов) Экспорт
	
	Для Каждого Ключ Из Коллекция Цикл
		
		Если ТипЗнч(Ключ) = Тип("КолонкаРезультатаЗапроса") Тогда
			Ключ = Ключ.Имя;
		КонецЕсли;
		
		Если Не Лев(Ключ, 1) = "_" Тогда   
			
			Значение = Выборка[Ключ];
			
			Если ТипЗнч(Значение) = Тип("РезультатЗапроса") Тогда
				Массив = Новый Массив;
				
				Если Не Значение.Пустой() Тогда  
					
					ВыборкаЗначений = Значение.Выбрать();  
					
					Пока ВыборкаЗначений.Следующий() Цикл  
						
						СтруктураЗначений = Новый Структура;
						ЗаполнитьКоллекциюЗначений(СтруктураЗначений, ВыборкаЗначений, Значение.Колонки, МассивПоддерживаемыхТипов);
						Массив.Добавить(СтруктураЗначений);
						
					КонецЦикла;
					
				Конецесли;
				
				Структура.Вставить(Ключ, Массив);
				
			Иначе
				Структура.Вставить(Ключ, ЗначениеJSON(Значение, МассивПоддерживаемыхТипов));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;      
	
КонецПроцедуры 

Процедура ВыгрузитьВыборку(ДокументОбъект, СтруктураДокумента, ТекстЗапроса) Экспорт
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументОбъект.Ссылка);
	
	МассивПоддерживаемыхТипов = МассивПоддерживаемыхТиповJSON();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьКоллекциюЗначений(СтруктураДокумента, Выборка, Выборка.Владелец().Колонки, МассивПоддерживаемыхТипов);
	
	Для Каждого Таблица Из Запрос.МенеджерВременныхТаблиц.Таблицы Цикл  
		
		Результат = Таблица.ПолучитьДанные();
		Массив = Новый Массив;
		
		Если Не Результат.Пустой() Тогда   
			
			Выборка = Результат.Выбрать(); 
			
			Пока Выборка.Следующий() Цикл   
				
				Структура = Новый Структура;   
				ЗаполнитьКоллекциюЗначений(Структура, Выборка, Результат.Колонки, МассивПоддерживаемыхТипов);

				Массив.Добавить(Структура);
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтруктураДокумента.Вставить(Таблица.ПолноеИмя, Массив);
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ВКорректировкеЕстьИУвеличениеИУменьшениеКоличества(пКорректировка)

//+Бычков О. 23.04.2025 #UT10-5207
// Вставка
	ТекЗапрос = Новый Запрос;
	ТекЗапрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ТоварыКорректировки.НомерСтроки КАК НомерСтрокиУвеличения
	                  |ИЗ
	                  |	Документ.КорректировкаПоступления.Товары КАК ТоварыКорректировки
	                  |ГДЕ
	                  |	ТоварыКорректировки.Ссылка = &Корректировка
	                  |	И ТоварыКорректировки.Количество > ТоварыКорректировки.КоличествоДоИзменения
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ ПЕРВЫЕ 1
	                  |	ТоварыКорректировки.НомерСтроки КАК НомерСтрокиУвеличения
	                  |ИЗ
	                  |	Документ.КорректировкаПоступления.Товары КАК ТоварыКорректировки
	                  |ГДЕ
	                  |	ТоварыКорректировки.Ссылка = &Корректировка
	                  |	И ТоварыКорректировки.Количество < ТоварыКорректировки.КоличествоДоИзменения";
	
	ТекМетаданныеКорректировки = пКорректировка.Метаданные();
	
	ТекИмяТЧТовары = "Документ." + ТекМетаданныеКорректировки.Имя + ".Товары";
	
	Если Не ТекИмяТЧТовары = "Документ.КорректировкаПоступления.Товары" Тогда
		ТекЗапрос.Текст = СтрЗаменить(ТекЗапрос.Текст, "Документ.КорректировкаПоступления.Товары", ТекИмяТЧТовары);
	КонецЕсли;
	
	ТекЗапрос.УстановитьПараметр("Корректировка", пКорректировка);
	
	ТекРезультатыЗапроса = ТекЗапрос.ВыполнитьПакет();
	
	ТекЕстьИУвеличениеИУменьшениеКоличества = Не ТекРезультатыЗапроса[0].Пустой() И Не ТекРезультатыЗапроса[1].Пустой();
	
	Возврат ТекЕстьИУвеличениеИУменьшениеКоличества;
//-Бычков О. 23.04.2025 #UT10-5207	

КонецФункции

Функция ВыполненыДополнительныеУсловияВыгрузкиКорректировкиПоступленияТоваровУслугКакПеремещенияТоваровМеждуСкладами(пСсылка)
	
//+Бычков О. 23.04.2025 #UT10-5207
// Вставка
	Если ВКорректировкеЕстьИУвеличениеИУменьшениеКоличества(пСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//ТекИсходныйДокументПоступления = УчетНДС.ПолучитьИсправляемыйДокументПоступления(пСсылка, Истина);

	//Если ТекИсходныйДокументПоступления.ТранзитнаяПоставка И ТекИсходныйДокументПоступления.Статус <> Перечисления.СтатусыПТУ.Закрыт Тогда
	//	Возврат Ложь;                                                                                
	//КонецЕсли;
	
	Возврат Истина;
//-Бычков О. 23.04.2025 #UT10-5207	
	
КонецФункции

Функция ВыполненыДополнительныеУсловияВыгрузкиКорректировкиРеализацииТоваровУслугКакПеремещенияТоваровМеждуСкладами(пСсылка)
	
//+Бычков О. 23.04.2025 #UT10-5207
// Вставка
	Если ВКорректировкеЕстьИУвеличениеИУменьшениеКоличества(пСсылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
//-Бычков О. 23.04.2025 #UT10-5207	
	
КонецФункции

Функция КорректировкаПоступленияТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(пСсылка)

//+Бычков О. 23.04.2025 #UT10-5207
// Вставка                                                                            
	ТекРезультат = Ложь;
	
	ТекИсходныйДокументПоступления = УчетНДС.ПолучитьИсправляемыйДокументПоступления(пСсылка, Истина);
	
	Если ТипЗнч(ТекИсходныйДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Если НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(ТекИсходныйДокументПоступления) Тогда
			
			ТекТекстЗапроса =
			"ВЫБРАТЬ
			|	КорректировкаПоступления.Ссылка
			|ИЗ
			|	Документ.КорректировкаПоступления КАК КорректировкаПоступления
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
			|		ПО КорректировкаПоступления.Организация = Организации.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
			|		ПО КорректировкаПоступления.Контрагент = Контрагенты.Ссылка
			|ГДЕ
			|	Организации.ИНН = Контрагенты.ИНН
			|	И КорректировкаПоступления.Ссылка = &Ссылка";
			
			Запрос = Новый Запрос(ТекТекстЗапроса);
			
			Запрос.УстановитьПараметр("Ссылка", пСсылка);
			
			ТекРезультат = Не Запрос.Выполнить().Пустой();
		
		КонецЕсли;
		
	КонецЕсли;

	Возврат ТекРезультат;
//-Бычков О. 23.04.2025 #UT10-5207	

КонецФункции  

Функция КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(пСсылка)

//+Бычков О. 23.04.2025 #UT10-5207
// Вставка                                                                            
	ТекРезультат = Ложь;
	
	ТекИсходныйДокументРеализации = УчетНДС.ПолучитьИсправляемыйДокументРеализации(пСсылка, Истина);
	
	Если ТипЗнч(ТекИсходныйДокументРеализации) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		Если ТекИсходныйДокументРеализации.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
		
			ТекРезультат = пСсылка.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекРезультат;
//-Бычков О. 23.04.2025 #UT10-5207	

КонецФункции

Функция ЭтоБазаОбособленногоПодразделения(пДата)

//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекРезультат = Ложь;
	
	ДатаСменыОП_ГП = Константы.ДатаСменыОП_ГП.Получить();
	
	ТекПополнениеДляОбособленногоПодразделенияЮЛ = Константы.ПополнениеДляОбособленногоПодразделенияЮЛ.Получить();
	
	Если ЗначениеЗаполнено(ДатаСменыОП_ГП) Тогда
		
		Если ТекПополнениеДляОбособленногоПодразделенияЮЛ = Истина 
		   И пДата >= ДатаСменыОП_ГП Тогда
		   	ТекРезультат = Истина;
		ИначеЕсли ТекПополнениеДляОбособленногоПодразделенияЮЛ = Ложь
		   И пДата < ДатаСменыОП_ГП Тогда		
			ТекРезультат = Истина;
		КонецЕсли;
		
	Иначе
		
		Если ТекПополнениеДляОбособленногоПодразделенияЮЛ = Истина Тогда
			ТекРезультат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекРезультат;
//-Бычков О. 28.04.2025 #UT10-5208	

КонецФункции

Функция ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПеремещениеТоваровМеждуСкладами(пСсылка)

//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекРезультат = ЭтоБазаОбособленногоПодразделения(пСсылка.Дата);
	
	Возврат ТекРезультат;
//-Бычков О. 28.04.2025 #UT10-5208	

КонецФункции

Функция ПоступлениеТоваровНаОтветственноеХранениеДолжноВыгружатьсяКакПоступлениеТоваровУслуг(пСсылка)

//+Бычков О. 28.04.2025 #UT10-5208
// Вставка
	ТекРезультат = Не ЭтоБазаОбособленногоПодразделения(пСсылка.Дата);
	
	Возврат ТекРезультат;
//-Бычков О. 28.04.2025 #UT10-5208	

КонецФункции

Процедура СформироватьЗаголовкиИСвойстваВыгрузкиПоступленияТоваровНаОтветственноеХранениеВПоступлениеТоваровУслуг(Заголовки, Свойства, ДокументОбъект) Экспорт

	Заголовки.Добавить("document_type",  "ПоступлениеТоваровУслуг");	
	Заголовки.Добавить("message_ver",    "2.0");
	Заголовки.Добавить("operation_type", "ПоступлениеТоваровНаОтветственноеХранение");
	Заголовки.Добавить("warehouse_id",   СокрЛП(ДокументОбъект.Склад.КодМДМ));
	Заголовки.Добавить("counterpart_id", СокрЛП(ДокументОбъект.Контрагент.КодМДМ));

КонецПроцедуры

Функция ЭтоМиниВыкупИзБазыГП(пСсылка)

//+Бычков О. 30.04.2025 #UT10-5208
// Вставка
	ТекРезультат = Ложь;
	
	Если Не ЭтоБазаОбособленногоПодразделения(пСсылка.Дата) Тогда
		
		Если ЗначениеЗаполнено(пСсылка.Филиал) Тогда
			ТекРезультат = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекРезультат;
//-Бычков О. 30.04.2025 #UT10-5208	

КонецФункции

Функция ЭтоМиниВыкупИзБазыОП(пСсылка)

//+Бычков О. 30.04.2025 #UT10-5208
// Вставка
	ТекРезультат = ЭтоБазаОбособленногоПодразделения(пСсылка.Дата);
	
	Возврат ТекРезультат;
//-Бычков О. 30.04.2025 #UT10-5208	

КонецФункции

Функция ЭтоМиниВыкуп(пСсылка)

//+Бычков О. 30.04.2025 #UT10-5208
// Вставка
	Возврат ЭтоМиниВыкупИзБазыОП(пСсылка) Или ЭтоМиниВыкупИзБазыГП(пСсылка);
//-Бычков О. 30.04.2025 #UT10-5208	

КонецФункции // ЭтоМиниВыкуп()

Функция ВыкупСОтветственногоХраненияДолженВыгружатьсяКакПеремещениеТоваровМеждуСкладами(пСсылка)

//+Бычков О. 23.04.2025 #UT10-5208
// Вставка
	ТекРезультат = ЭтоМиниВыкуп(пСсылка);
	
	//+Бычков О. 21.08.2025 #UT10-5389
	// Вставка  
	Если ТекРезультат Тогда
	
		Если пСсылка.Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку Тогда
			Если ЭтоМиниВыкупИзБазыГП(пСсылка) Тогда
				ТекРезультат = Ложь;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	//-Бычков О. 21.08.2025 #UT10-5389
	
	Возврат ТекРезультат;
//-Бычков О. 23.04.2025 #UT10-5208	

КонецФункции  

Функция ВыкупСОтветственногоХраненияДолженВыгружатьсяКакВозвратТоваровПоставщику(пСсылка)

//+Бычков О. 23.04.2025 #UT10-5208
// Вставка
	ТекРезультат = Не ЭтоМиниВыкуп(пСсылка);
	
	//+Бычков О. 21.08.2025 #UT10-5389
	Если Не ТекРезультат Тогда
		
		Если пСсылка.Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку Тогда
			Если ЭтоМиниВыкупИзБазыГП(пСсылка) Тогда
				ТекРезультат = Истина;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	//-Бычков О. 21.08.2025 #UT10-5389
	
	Возврат ТекРезультат;
//-Бычков О. 23.04.2025 #UT10-5208	

КонецФункции  

Функция ЭтоОформлениеСделкиТОХ(пДокумент)

//+Бычков О. 06.05.2025 #UT10-5208
// Вставка
   	ТекРезультат = Ложь;
	
	Если ЗначениеЗаполнено(пДокумент) Тогда
		
		ТекМетаданные = пДокумент.Метаданные();
		
		Если ТекМетаданные.Имя = "ВыкупСОтветственногоХранения" Тогда
			ТекРезультат = Не пДокумент.Статус = Перечисления.СтатусыТОХ.ВозвратПоБраку;
		ИначеЕсли ТекМетаданные.Имя = "ПоступлениеТоваровУслуг" Тогда
			ТекРезультат = ЭтоОформлениеСделкиТОХ(пДокумент.ДокументВыкупаСОтветственногоХранения);
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ТекРезультат;
//-Бычков О. 06.05.2025 #UT10-5208	

КонецФункции

Функция ЭтоРеализацияТоваровИУслугПоОрганизацииТОХ(пДокументСсылка)
//+Бычков О. 23.10.2025 #UT10-5480
// Вставка

   	ТекРезультат = Ложь;
	
	ТекЗапросТОХ = Новый Запрос;
	
	ТекЗапросТОХ.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                     |	МАКСИМУМ(РеализацияТоваровУслугТовары.ЗаказПокупателя.ДоговорПоставщикаТОХ) КАК ДоговорПоставщикаТОХ
	                     |ИЗ
	                     |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	                     |ГДЕ
	                     |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
	                     |	И НЕ ЕСТЬNULL(РеализацияТоваровУслугТовары.ЗаказПокупателя.ДоговорПоставщикаТОХ, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)";
	
	ТекЗапросТОХ.УстановитьПараметр("Ссылка", пДокументСсылка);
	
	ТекРезультатЗапросаТОХ = ТекЗапросТОХ.Выполнить();
	
	Если Не ТекРезультатЗапросаТОХ.Пустой() Тогда
		
		ТекВыборка = ТекРезультатЗапросаТОХ.Выбрать();
		
		Если ТекВыборка.Следующий() Тогда
		
			Если ЗначениеЗаполнено(ТекВыборка.ДоговорПоставщикаТОХ) Тогда
				ТекРезультат = Истина;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ТекРезультат;

//-Бычков О. 23.10.2025 #UT10-5480
КонецФункции

Функция ПроверитьНужноЛиВыгружатьСчетФактуруПолученный(пДокумент)
//+Бычков О. 21.01.2026 #UT10-5642
// Вставка

	ТекРезультат = Не Константы.ОсновнаяОрганизация.Получить().ИНН = пДокумент.Контрагент.ИНН;

	Если ТекРезультат Тогда
		
		// по старой логике нужно выгружать, скорректируем с учётом новой логики
		ТекДокументОснование = пДокумент.ДокументОснование;
		
		Если ТипЗнч(ТекДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			
			Если НужноВыгрузитьПоступлениеТоваровУслугКакПеремещениеТоваровМеждуСкладами(ТекДокументОснование) Тогда
				ТекРезультат = Ложь;
			КонецЕсли;
		
		ИначеЕсли ТипЗнч(ТекДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
			
			Если КорректировкаПоступленияТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(ТекДокументОснование) Тогда
				ТекРезультат = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ТекРезультат;
	
//-Бычков О. 21.01.2026 #UT10-5642
КонецФункции

Функция ПроверитьНужноЛиВыгружатьСчетФактуруВыданный(пДокумент)
//+Бычков О. 21.01.2026 #UT10-5642
// Вставка

	ТекРезультат = Истина;
	
	Если ОбщегоНазначения.ЕстьРеквизитДокумента("Грузополучатель", пДокумент.ДокументОснование.Метаданные()) 
		И пДокумент.ДокументОснование.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение Тогда
		ТекРезультат = Ложь;
	КонецЕсли;
	
	Если ТекРезультат Тогда
		
		// по старой логике нужно выгружать, скорректируем с учётом новой логики
		ТекДокументОснование = пДокумент.ДокументОснование;
		
		Если ТипЗнч(ТекДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			
			Если ЭтоРеализацияТоваровИУслугПоОрганизацииТОХ(ТекДокументОснование) Тогда
				ТекРезультат = Ложь;
			КонецЕсли;
		
		ИначеЕсли ТипЗнч(ТекДокументОснование) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			
			Если КорректировкаРеализацииТоваровУслугДолжнаВыгружатьсяКакПеремещениеТоваровМеждуСкладами(ТекДокументОснование) Тогда
				ТекРезультат = Ложь;
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ТекРезультат;
	
//-Бычков О. 21.01.2026 #UT10-5642
КонецФункции
