Функция ПроверкаНаличияТовараВЯчейке(Склад, ШКЯчейка, ШКНоменклатура, Количество) Экспорт	
		
	Запрос = Новый Запрос;
	Запрос.Текст	=	"ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки,
	|	(ВЫБРАТЬ
	|		Штрихкоды.Владелец КАК Владелец
	|	ИЗ
	|		РегистрСведений.Штрихкоды КАК Штрихкоды
	|	ГДЕ
	|		Штрихкоды.Штрихкод = &ШКНоменклатура) КАК ВложенныйНоменклатура,
	|	(ВЫБРАТЬ
	|		Штрихкоды.Владелец КАК Владелец
	|	ИЗ
	|		РегистрСведений.Штрихкоды КАК Штрихкоды
	|	ГДЕ
	|		Штрихкоды.Штрихкод = &ШКЯчейка) КАК ВложенныйЯчейка
	|ГДЕ
	|	ВложенныйНоменклатура.Владелец = ТоварыВЯчейкахОстатки.Номенклатура
	|	И ВложенныйЯчейка.Владелец = ТоварыВЯчейкахОстатки.Ячейка";
	
	Запрос.УстановитьПараметр("Склад",Справочники.Склады.НайтиПоКоду(Склад));
	Запрос.УстановитьПараметр("ШКНоменклатура",ШКНоменклатура);
	Запрос.УстановитьПараметр("ШКЯчейка",ШКЯчейка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Ложь;	
	Иначе         
		
		Результат =	Результат.Выбрать();
		Результат.Следующий();   
		
		Остаток	= Результат.КоличествоОстаток - Количество;
		
		Если Остаток>=0  Тогда
			Возврат Истина;
		Иначе	
			Возврат Ложь;
		КонецЕсли;      
		
	КонецЕсли;
	
		
КонецФункции		

Функция ПолучитьСкладИз1С() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;

КонецФункции

Функция ПолучитьСостоянияДокументаИнвентаризацияПоЯчейкам(НомерДокумента) Экспорт
		
	ДокументИнвентаризация = Документы.ИнвентаризацияПоЯчейкам.НайтиПоНомеру(НомерДокумента, ТекущаяДата());
	
	Если ДокументИнвентаризация.ИнвентаризацияУспешна Тогда
		Возврат "Инвентаризация Ячейки прошла успешно";
	Иначе       
		
		Текст = "Инвентаризация не успешна.";		
		Возврат "Инвентаризация не успешна.";
		
    КонецЕсли;
		
КонецФункции

Функция БлокирующаяЯчейку(ШКЯчейки,Заблокировать) Экспорт
	
	Возврат Истина;

КонецФункции

	

