Процедура ЗаполнитьКорректировкуЗаказовПокупателяСУчетомСборки(ДокЗаказ, ДокКорректировка, МассивСборок, ТекстОшибки, Отказ) Экспорт
	
	//+Шульман А. 21.02.2025 #UT10-5103   
	// Корректировка создается на разницу между товарами в ДокЗаказ и в сборках    
	
	ДокКорректировка = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ДокКорректировка, ДокЗаказ);  
	ДокКорректировка.Дата = ТекущаяДата();
	ДокКорректировка.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ДокКорректировка.ВалютаДокумента = ДокЗаказ.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	
	ДокКорректировка.СтруктурнаяЕдиница      = ДокЗаказ.СтруктурнаяЕдиница;
	ДокКорректировка.КурсВзаиморасчетов      = ДокЗаказ.КурсВзаиморасчетов;
	ДокКорректировка.КратностьВзаиморасчетов = ДокЗаказ.КратностьВзаиморасчетов;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тзЗаказ.Номенклатура,
		|	тзЗаказ.СерияНоменклатуры,
		|	тзЗаказ.СтавкаНДС,
		|	тзЗаказ.Цена,
		|	тзЗаказ.ЕдиницаИзмерения,
		|	тзЗаказ.Количество
		|ПОМЕСТИТЬ ВТ_Заказ
		|ИЗ
		|	&тзЗаказ КАК тзЗаказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СборкаЗаказовПокупателяЗаказано.Номенклатура,
		|	СУММА(СборкаЗаказовПокупателяЗаказано.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_Сборки
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
		|		ПО СборкаЗаказовПокупателяЗаказано.Ссылка = СборкаЗаказовПокупателя.Ссылка
		|ГДЕ
		|	СборкаЗаказовПокупателя.Ссылка В(&МассивСборок)
		|
		|СГРУППИРОВАТЬ ПО
		|	СборкаЗаказовПокупателяЗаказано.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Заказ.Номенклатура КАК Номенклатура,
		|	ВТ_Заказ.СерияНоменклатуры КАК СерияНоменклатуры,
		|	ВТ_Заказ.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Заказ.СтавкаНДС КАК СтавкаНДС,
		|	ВТ_Заказ.Цена КАК Цена,
		|	ВТ_Заказ.Количество КАК Количество,
		|	ЕСТЬNULL(ВТ_Сборки.Количество, 0) КАК КоличествоВСборке
		|ИЗ
		|	ВТ_Заказ КАК ВТ_Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сборки КАК ВТ_Сборки
		|		ПО ВТ_Заказ.Номенклатура = ВТ_Сборки.Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ЕдиницаИзмерения),
		|	МАКСИМУМ(СтавкаНДС),
		|	СУММА(Количество),
		|	МАКСИМУМ(КоличествоВСборке)
		|ПО
		|	Номенклатура,
		|	СерияНоменклатуры";
	
	тзЗаказ = ДокЗаказ.Товары.Выгрузить();
	тзЗаказ.Свернуть("Номенклатура, СерияНоменклатуры, ЕдиницаИзмерения, СтавкаНДС, Цена", "Количество");
	
	Запрос.УстановитьПараметр("тзЗаказ", тзЗаказ);
	Запрос.УстановитьПараметр("МассивСборок", МассивСборок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл     
		
		Если ВыборкаНоменклатура.КоличествоВСборке >= ВыборкаНоменклатура.Количество Тогда
			Продолжить;
		КонецЕсли;
		
		ВКорректировку = ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоВСборке; 

		ВыборкаСерия = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		
		Пока ВыборкаСерия.Следующий() И ВКорректировку > 0 Цикл
			
			Выборка = ВыборкаСерия.Выбрать();
			
			Пока Выборка.Следующий() И ВКорректировку > 0 Цикл    
				
				Распределить = МИН(ВКорректировку, Выборка.Количество);
				
				НоваяСтрокаКорр = ДокКорректировка.Товары.Добавить();
				НоваяСтрокаКорр.Номенклатура 		= Выборка.Номенклатура;   
				НоваяСтрокаКорр.СерияНоменклатуры 	= Выборка.СерияНоменклатуры; 
				НоваяСтрокаКорр.ЕдиницаИзмерения    = Выборка.ЕдиницаИзмерения;  
				НоваяСтрокаКорр.ЕдиницаИзмеренияМест = Выборка.ЕдиницаИзмерения;   
				НоваяСтрокаКорр.СтавкаНДС           = Выборка.СтавкаНДС;
				НоваяСтрокаКорр.Коэффициент         = Выборка.ЕдиницаИзмерения.Коэффициент;
				НоваяСтрокаКорр.Количество          = -Распределить;        
				НоваяСтрокаКорр.КоличествоМест      = -Распределить;        
				НоваяСтрокаКорр.Цена 				= Выборка.Цена;
				НоваяСтрокаКорр.Сумма 				= -Выборка.Цена * Распределить; 
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрокаКорр, ДокКорректировка);
				НоваяСтрокаКорр.Причина = Перечисления.ПричиныКорректировкиСборки.Недостача;  
				
				ВКорректировку = ВКорректировку - Распределить;
				
			КонецЦикла;
			
		КонецЦикла;     // ВыборкаСерия.Следующий()
			
	КонецЦикла;
	
	Если ДокКорректировка.Товары.Количество() Тогда
		
		ДокКорректировка.ЗаказПокупателя = ДокЗаказ.Ссылка;
		
		Попытка
			ДокКорректировка.Записать(РежимЗаписиДокумента.Запись);  
		Исключение
			
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
			Отказ = Истина;
            Возврат;
			
		КонецПопытки;
		
		Попытка
			ДокКорректировка.Записать(РежимЗаписиДокумента.Проведение);  
		Исключение                       
			
			Отказ = Истина;
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
			
		КонецПопытки;
		
	КонецЕсли;   
	//-Шульман А. 21.02.2025 #UT10-5103

КонецПроцедуры

Функция ЕстьЗаказПоставщикуПоОбособленнойОтгрузке(ПромЗаказ) Экспорт
	
	ЗапросЗаказовПостащику = Новый Запрос;
	ЗапросЗаказовПостащику.УстановитьПараметр("ЗаказПокупателя", ПромЗаказ.Ссылка);
	ЗапросЗаказовПостащику.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|	ЕСТЬNULL(ЗаказыПокупателейОстатки.КоличествоОстаток, 0) КАК ОстатокЗаказано,
	|	0 КАК ОстатокРазмещено,
	|	0 КАК ОстатокВРезерве
	|ПОМЕСТИТЬ ОстаткиПоЗаказу
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПокупателя) КАК ЗаказыПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	0,
	|	ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0),
	|	0
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПокупателя) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	0,
	|	0,
	|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиПоЗаказу.ЗаказПокупателя,
	|	СУММА(ОстаткиПоЗаказу.ОстатокЗаказано) КАК ОстатокЗаказано,
	|	СУММА(ОстаткиПоЗаказу.ОстатокРазмещено) КАК ОстатокРазмещено,
	|	СУММА(ОстаткиПоЗаказу.ОстатокВРезерве) КАК ОстатокВРезерве
	|ПОМЕСТИТЬ ИтогоОстатки
	|ИЗ
	|	ОстаткиПоЗаказу КАК ОстаткиПоЗаказу
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПоЗаказу.ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтогоОстатки.ЗаказПокупателя,
	|	ИтогоОстатки.ОстатокЗаказано,
	|	ИтогоОстатки.ОстатокРазмещено,
	|	ИтогоОстатки.ОстатокВРезерве
	|ИЗ
	|	ИтогоОстатки КАК ИтогоОстатки
	|ГДЕ
	|	ИтогоОстатки.ОстатокЗаказано > 0
	|	И (ИтогоОстатки.ОстатокРазмещено > 0
	|			ИЛИ ИтогоОстатки.ОстатокВРезерве > 0)";
	
	РезультатЗапросаЗаказов = ЗапросЗаказовПостащику.Выполнить();
	
	Возврат НЕ РезультатЗапросаЗаказов.Пустой();	

КонецФункции


