Процедура УстановитьСвойствоОтправленоВСтороннююБазу(Документ) Экспорт
//+Белов А. 23.10.2025 #UT10-5464				
	УстановитьПривилегированныйРежим(Истина);
	
	Свойство = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	Свойство.Отбор.Объект.Установить(Документ);
	Свойство.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.АвтоматическиСозданКорПТУВСторБазе
	);	
	Свойство.Прочитать();
	
	Если Свойство.Количество() = 0 Тогда
		
		НовыйСвойство = Свойство.Добавить();
		НовыйСвойство.Объект = Документ;
		НовыйСвойство.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.АвтоматическиСозданКорПТУВСторБазе;
		
	Иначе
		НовыйСвойство = Свойство[0];
	КонецЕсли;
	
	НовыйСвойство.Значение = Истина;
	
	Свойство.Записать();

//-Белов А. 23.10.2025 #UT10-5464			
КонецПроцедуры

