
Процедура ПриЗаписи(Отказ)
	 Возврат;
	// Пока не использую наработки БИТ
	
	МассивЗаданий = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Новый Структура("Метаданные","бит_ЗаданиеОбменаСПорталом"));
	
	Для Каждого Задание Из МассивЗаданий Цикл
		Задание.Удалить();
	КонецЦикла;
	
	Если ИспользоватьПериодическийОбмен Тогда
		Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание("бит_ЗаданиеОбменаСПорталом");
		Задание.Расписание.ПериодПовтораДней = 1;
		Задание.Расписание.ПериодПовтораВТечениеДня = ИнтервалОбмена;	
		Задание.Использование = Истина;
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры
