
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение Тогда

Процедура СоздатьИОбновитьПодпискиНаОчереди() Экспорт 
	
	Обработчики = ПолучениеСообщенийСлужебный.ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщений(Обработчики);
	СоздатьПодпискиНаОчереди(Обработчики, Ложь);
	
	Обработчики = ПолучениеСообщенийСлужебный.ПолучитьКоллекциюРегистрацииОбработчиков();
	ПолучениеСообщенийПереопределяемый.ПриРегистрацииОбработчиковСообщенийАсинх(Обработчики);
	СоздатьПодпискиНаОчереди(Обработчики, Истина);
	
КонецПроцедуры

Функция СоздатьПодпискиНаОчереди(Обработчики, Асинхронно = Ложь)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПодпискиНаОчередиСообщений.ИмяОчереди КАК ИмяОчереди
	|ИЗ
	|	Справочник.ПодпискиНаОчередиСообщений КАК ПодпискиНаОчередиСообщений
	|ГДЕ
	|	ПодпискиНаОчередиСообщений.ПометкаУдаления = ЛОЖЬ";
	
	ОчередиСПодписками = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОчередиСПодписками[Выборка.ИмяОчереди] = Истина;
	КонецЦикла;
	
	Для Каждого Обработчик Из Обработчики Цикл
		
		Если ОчередиСПодписками[Обработчик.Ключ] = Неопределено Тогда
			
			Подписка = Справочники.ПодпискиНаОчередиСообщений.СоздатьЭлемент();
			Подписка.Наименование = Обработчик.Ключ;
			Подписка.ИмяОчереди = Обработчик.Ключ;
			Подписка.Активно = Истина;
			Подписка.ИнтервалОжиданияСобытия = 10;
			Подписка.Асинхронно = Асинхронно;
						
			Расписание = Новый РасписаниеРегламентногоЗадания;
			Расписание.ПериодПовтораДней = 1;
			Расписание.ПериодПовтораВТечениеДня = 30;
			Если Асинхронно = Истина Тогда 
				Расписание.ПаузаПовтора = 3;
		    КонецЕсли;
			Подписка.РасписаниеЗадания = Новый ХранилищеЗначения(Расписание);
			
			Подписка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

#КонецЕсли