
Функция СтатусФНСКонтрагентаКорректный(Контрагент, Организация, ДоговорКонтрагента) Экспорт
	
	//+Сёмин Р. 17.12.2025 #UT10-5590
	Результат = Истина;
	
	Если Контрагент.СтатусФНСКонтрагента <> Справочники.СтатусыФНСКонтрагента.КонтрагентЕстьВБазеФНС Тогда
		
		Если Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
			
			Если НЕ ДоговорКонтрагента.ЛицевойСчет И НЕ ДоговорКонтрагента.РозничнаяПродажа Тогда
				Результат = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	//-Сёмин Р. 17.12.2025 #UT10-5590
	
КонецФункции

Функция ПолучитьСвоихПоставщиков() Экспорт
	
	//+Сёмин Р. 21.01.2026 #UT10-5615
	СвоиПоставщики = Новый Массив;
	
	СвоиПоставщики.Добавить(Константы.ОсновнойПоставщик.Получить());
	СвоиПоставщики.Добавить(Константы.ДопПоставщик.Получить());
	СвоиПоставщики.Добавить(Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", Константы.КодКонтрагента.Получить()));
	СвоиПоставщики.Добавить(Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", Константы.КодКонтрагента.Получить()));
	
	Возврат СвоиПоставщики;
	//-Сёмин Р. 21.01.2026 #UT10-5615
	
КонецФункции