Перем мОснование;

// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено; 
		КодМДМ = "";

	КонецЕсли;

КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КПП                    = Основание.КПП;
		КодПоОКПО              = Основание.КодПоОКПО;
		мОснование             = Основание;
		
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда 
		МаксимальноеКоличествоПрайсовВДень = 1;
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	Перем мСсылкаНового;
	
	Если НЕ ОбменДанными.Загрузка  И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("НеВыполнятьПроверкиПриЗаписи") Тогда
		
		Если НЕ ЭтоГруппа Тогда 
			
			// Проверим основной вид деятельности контрагента
			Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
				ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(РасписаниеРаботыСтрокой) И  НЕ ЗначениеЗаполнено(ИНН) Тогда 
				
				Сообщить("Не заполнено поле 'Расписание работы строкой'!");
				Отказ = Истина;
				
			КонецЕсли;
		
			Если ЭтоНовый() И Не ЗначениеЗаполнено(ИсточникКонтакта) Тогда 
				
				Сообщить("Не заполнено поле 'Источник контакта'!");
				Отказ = Истина;
				
			КонецЕсли;
			
			ИмяБазы = Константы.База.Получить();
			
			Если СокрЛП(ИНН) <> "" И ИмяБазы  <> Перечисления.НазваниеБазы.Казань 
				И ИмяБазы  <> Перечисления.НазваниеБазы.Воронеж Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Контрагенты.Ссылка
				|ИЗ
				|	Справочник.Контрагенты КАК Контрагенты
				|ГДЕ
				|	Контрагенты.ИНН = &ИНН
				|	И НЕ Контрагенты.ЭтоГруппа
				|	И Контрагенты.Ссылка <> &Ссылка";
				
				Запрос.УстановитьПараметр("ИНН", ИНН);
				
				Если ЭтоНовый() Тогда 
					Запрос.Текст = СтрЗаменить(Запрос.Текст,"И Контрагенты.Ссылка <> &Ссылка", "");
				Иначе
					Запрос.УстановитьПараметр("Ссылка", Ссылка);
				КонецЕсли;
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Сообщить("В системе существуют контрагенты с ИНН " + ИНН + ". Запрещено создавать контрагентов с дублирующимися ИНН!");
					Отказ = Истина;
					Прервать;
					
				КонецЦикла;
				
			КонецЕсли;  			

			Если ЗначениеЗаполнено(ИнтервалДоОкончанияОчереди) ИЛИ ЗначениеЗаполнено(МинимальноеКоличествоТваровГотовыхКСборке) Тогда
				
				Если НЕ ЗначениеЗаполнено(ИнтервалДоОкончанияОчереди) Тогда
					
					Сообщить("Не заполнено поле 'Интервал до окончания очереди'!"); 
					Отказ = Истина;
					
				КонецЕсли;
				
				Если НЕ ЗначениеЗаполнено(МинимальноеКоличествоТваровГотовыхКСборке) Тогда
					
					Сообщить("Не заполнено поле 'Минимальное количество товаров готовых к сборке'!"); 
					Отказ = Истина;
					
				КонецЕсли;
				
			КонецЕсли;			
			
			НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);
			
			// установим головного контрагента если он не заполнен
			Если НЕ ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
				
				Если ЭтоНовый() Тогда
					ГоловнойКонтрагент = мСсылкаНового;
				Иначе
					ГоловнойКонтрагент = Ссылка;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
		Если СертифицированнаяТорговаяТочка и СертификатыТорговыхТочек.Количество() = 0 Тогда
			
			Сообщить("Не выбран ни один сертификат торговой точки!"); 
			Отказ = Истина;
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда
			
			Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Контрагент " + СокрЛП(ГоловнойКонтрагент) + " не может быть выбран головным, 
								|так как для него уже был назначен головной контрагент " + СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент) + "!");
				Отказ = Истина;
				Возврат;
				
			Иначе
				
				// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
				// в качестве головного у другого контрагента.
				ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
				
				Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
					
					СообщениеОНевозможностиЗаписи = "Контрагент " + СокрЛП(ЭтотОбъект) + " не может иметь головного контрагента!
													|Этот контрагент уже установлен головным для: ";
					
					Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
						СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
					КонецЦикла;
					
					ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
					Отказ = Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(мОснование) Тогда
			
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Контрагент = Ссылка;
			ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
			ЗаписьРегистра.Объект     = мОснование;
			НаборЗаписей.Записать(Ложь);
			мОснование = "";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа ИЛИ НЕ РассылатьПрайс Тогда 
		
		НепроверяемыеРеквизиты = Новый Массив;
		НепроверяемыеРеквизиты.Добавить("ТипЦеныПрайса");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);	
		
	КонецЕсли;
	
КонецПроцедуры
