Функция ПолучитьДанныеПоЗаказам(Запрос) 
	
	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьДанныеПоЗаказамСервер(Запрос.ПараметрыЗапроса);	
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
				"Данные заказов не получены. Причина: не указаны обязательные параметры запроса "
				+ " - ИдентификаторДокумента или ИдентификаторКонтрагента, ДатаНачала, ДатаОкончания"); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеПоВозвратам(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьДанныеПоВозвратамСервер(Запрос.ПараметрыЗапроса);			
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
				"Данные возвратов не получены. Причина: не указаны обязательные параметры запроса "
				+ " - ИдентификаторДокумента или ИдентификаторКонтрагента, ДатаНачала, ДатаОкончания"); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьБалансПокупателя(Запрос)   
	
	Ответ = Новый HTTPСервисОтвет(200);  
	
	Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
		СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьБалансПокупателяСервер(Запрос.ПараметрыЗапроса);	
	Иначе 	
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
		"Баланс не получен. Причина: не задан параметр запроса ИдентификаторКонтрагента"); 
	КонецЕсли;         
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеДокументаОтгрузки(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200); 
		
	Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
		СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьДанныеДокументаОтгрузкиСервер(Запрос.ПараметрыЗапроса);	   
		
	Иначе 	
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
		"Товары не получены. Причина: не задан параметр запроса ИдентификаторДокумента"); 
	КонецЕсли;
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции    

Функция ПолучитьВедомостьВзаиморасчетов(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200); 
	
	Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
		СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьВедомостьВзаиморасчетовСервер(Запрос.ПараметрыЗапроса);			
	Иначе 	
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
		"Ведомость не получена. Причина: не задан параметр запроса ИдентификаторКонтрагента"); 
	КонецЕсли;
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции  

Функция ПолучитьИсториюПлатежей(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200); 
		
	Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
		СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьИсториюПлатежейСервер(Запрос.ПараметрыЗапроса);			
	Иначе 	
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
		"История платежей не получена. Причина: не задан параметр запроса ИдентификаторКонтрагента"); 
	КонецЕсли;
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСписокРеализацийДляОплаты(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьСписокРеализацийДляОплатыСервер(Запрос.ПараметрыЗапроса);			
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
				"Список реализаций для оплаты не получен. Причина: не указаны обязательные параметры запроса "
				+ " - ИдентификаторКонтрагента, ДатаНачала, ДатаОкончания"); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьСуммуДляОплатыПоРеализации(Запрос)

	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьСуммуДляОплатыПоРеализацииСервер(Запрос.ПараметрыЗапроса);			
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, 
				"Сумма для оплаты не получена. Причина: не указан обязательный параметр запроса ИдентификаторДокумента"); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;

КонецФункции

Функция СоздатьЗаказ(Запрос)
			
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда
				
				СтруктураОтвета = Новый Структура("Результат, Сообщение", Ложь, "");
				
				МассивЗапросов = РазбитьТекстЗапроса(ТекстЗапроса);
				
				Для каждого ТекущийЗапрос Из МассивЗапросов Цикл
					
					ТелоОтвета = МодульИнтеграцииСПорталом.СозданиеЗаказаСервер(ТекущийЗапрос);	 
					
					ТекущийОтветСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ТелоОтвета); 
					
					//Если хотя бы один заказ был создан
					Если ТекущийОтветСтруктура.Результат Тогда
						СтруктураОтвета.Результат = Истина;	
					КонецЕсли; 
					
					СтруктураОтвета.Сообщение = СтруктураОтвета.Сообщение + ?(ЗначениеЗаполнено(СтруктураОтвета.Сообщение), Символы.ПС, "") + ТекущийОтветСтруктура.Сообщение;
					
				КонецЦикла;  
				
				ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
	
	Возврат Ответ;  
	
КонецФункции

Функция РазбитьТекстЗапроса(ТекстЗапроса)

	МассивТекстов = Новый Массив;
	
	СтруктураЗапроса = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ТекстЗапроса);
		
	МассивИдентификаторов = Новый Массив;
	
	Для каждого СтрокаТовара Из СтруктураЗапроса.Строки Цикл
		
		Если МассивИдентификаторов.Найти(СтрокаТовара.ИдентификаторСклад) = Неопределено Тогда
			МассивИдентификаторов.Добавить(СтрокаТовара.ИдентификаторСклад);		
		КонецЕсли;
		
	КонецЦикла;              
	
	МассивКлючейИсключения = Новый Массив;
	МассивКлючейИсключения.Добавить("Строки");
	
	Для каждого ИдентификаторСклад Из МассивИдентификаторов Цикл                
		
		СтруктураЗапросаРазбитая = СкопироватьСтруктуру(СтруктураЗапроса, МассивКлючейИсключения);
		СтруктураЗапросаРазбитая.Шапка.Вставить("ИдентификаторСклад", ИдентификаторСклад);
		СтруктураЗапросаРазбитая.Вставить("Строки", Новый Массив());
		
		Для каждого СтрокаТовара Из СтруктураЗапроса.Строки Цикл
			
			Если СтрокаТовара.ИдентификаторСклад <> ИдентификаторСклад Тогда
				Продолжить;
			КонецЕсли;     
			
			СтруктураСтроки = СкопироватьСтруктуру(СтрокаТовара);			
			СтруктураЗапросаРазбитая.Строки.Добавить(СтруктураСтроки);
			
		КонецЦикла;
		
		МассивТекстов.Добавить(ОбщегоНазначения.ВернутьJSON(СтруктураЗапросаРазбитая));
		
	КонецЦикла;	
	
	Возврат МассивТекстов;

КонецФункции

Функция СкопироватьСтруктуру(Структура, МассивКлючейИсключения = Неопределено)
	
	СкопированнаяСтруктура = Новый Структура;
	
	Для каждого Свойство Из Структура Цикл
		
		Если МассивКлючейИсключения <>Неопределено И МассивКлючейИсключения.Найти(Свойство.Ключ) <> Неопределено Тогда
			Продолжить;	
		КонецЕсли;   
		
		СкопированнаяСтруктура.Вставить(Свойство.Ключ, Свойство.Значение);
		
	КонецЦикла;
	
	Возврат СкопированнаяСтруктура;
		
КонецФункции

Функция ОтменитьВозвратПокупателя(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.ОтменитьВозвратПокупателяСервер(ТекстЗапроса);			
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
	
	Возврат Ответ;
	
КонецФункции

Функция СкорректироватьТоварЗаказа(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				
				СтруктураОтвета = МодульИнтеграцииСПорталом.СкорректироватьТоварЗаказаСервер(ТекстЗапроса);		
				
				Если СтруктураОтвета.КодОтвета <> 200 Тогда
					Ответ = Новый HTTPСервисОтвет(СтруктураОтвета.КодОтвета);	
				КонецЕсли;     

				СтруктураОтвета.Удалить("КодОтвета");
				
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
                                        
	Возврат Ответ;
                                        	
КонецФункции   

Функция ОтменитьРезервЗаказа(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.ОтменитьРезервЗаказаСервер(ТекстЗапроса);			
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
                                        
	Возврат Ответ;
	
КонецФункции

Функция ЗакрытьЗаказПокупателя(Запрос) 
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.ЗакрытьЗаказПокупателяСервер(ТекстЗапроса);			
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
                                        
	Возврат Ответ;
	
КонецФункции   

Функция СоздатьЗаявкуНаВозврат(Запрос)   
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.СозданиеЗаявкиНаВозвратСервер(ТекстЗапроса);	
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
	
	Возврат Ответ;  
	
КонецФункции

Функция ЗаблокироватьРеализацию(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.ЗаблокироватьРеализациюСервер(ТекстЗапроса);			
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
	
	Возврат Ответ;  
	
КонецФункции

Функция СоздатьОплатуПлатежнойКартой(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
				
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
		ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
		
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);  
			
			Если ЗначениеЗаполнено(ТекстЗапроса) Тогда 
				ТелоОтвета = МодульИнтеграцииСПорталом.СоздатьОплатуПлатежнойКартойСервер(ТекстЗапроса);			
			Иначе 	
				
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан Текст запроса к ресурсу"); 
				ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
				
			КонецЕсли;	                                   
			
		Иначе  
			
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
			ТелоОтвета 		= ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);                
	
	Возврат Ответ;  
	
КонецФункции

Функция ПолучитьФайлыДокументов(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьФайлыДокументов(Запрос.ПараметрыЗапроса);			
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;

КонецФункции

Функция ПолучитьПараметрыСчетаНаОплату(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);     
	
	Если Запрос.Заголовки.Получить("Api-Token") = Неопределено Тогда 
		СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, "Не указан ""Api-Token"" подключения к ресурсу"); 
	Иначе
		
		ТокенДоступа 	= СокрЛП(Запрос.Заголовки.Получить("Api-Token"));   		
		ДанныеПроверки 	= МодульИнтеграцииСПорталом.ПроверитьТокенДоступа(ТокенДоступа); 
		
		Если ДанныеПроверки.СообщениеОшибки = "" Тогда  
						
			Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
				СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьПараметрыСчетаНаОплату(Запрос.ПараметрыЗапроса);			
			Иначе 	
				СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ""); 
			КонецЕсли;	                                   
			
		Иначе  
			СтруктураОтвета = Новый Структура("Результат, Данные, Сообщение", Ложь, Неопределено, ДанныеПроверки.СообщениеОшибки); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	
КонецФункции


Функция ПолучитьНоменклатурыДляВозврата(Запрос)
	
	//+Сёмин Р.И. 26.03.2026 #UT10-5775
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если ЗначениеЗаполнено(Запрос.ПараметрыЗапроса) Тогда 
		СтруктураОтвета = МодульИнтеграцииСПорталом.ПолучитьДоступныеНоменклатурыДляВозвратаСервер(Запрос.ПараметрыЗапроса);	   
	Иначе
		
		СтруктураОтвета = Новый Структура(
			"Результат, Данные, Сообщение",
			Ложь,
			Неопределено,
			"Товары для возврата не получены. Причина: не задан параметр запроса ИдентификаторДокумента"
		);
		
	КонецЕсли;
	
	ТелоОтвета = ОбщегоНазначения.ВернутьJSON(СтруктураОтвета);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	
	Возврат Ответ;
	//-Сёмин Р.И. 26.03.2026 #UT10-5775
	
КонецФункции
