
Процедура ОчиститьКратность() Экспорт
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.Текст =
	"ВЫБРАТЬ
	|	Константы.ОсновнойСклад
	|ПОМЕСТИТЬ КонстантаОсновнойСклад
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ПОМЕСТИТЬ СпрНоменклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.НеОчищатьКратностьПриНулевыхОстатках
	|	И НЕ Номенклатура.КратностьФилиала = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	СпрНоменклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							СпрНоменклатура.Ссылка
	|						ИЗ
	|							СпрНоменклатура КАК СпрНоменклатура)
	|					И Склад В
	|						(ВЫБРАТЬ
	|							КонстантаОсновнойСклад.ОсновнойСклад
	|						ИЗ
	|							КонстантаОсновнойСклад КАК КонстантаОсновнойСклад)) КАК ТоварыНаСкладахОстатки
	|		ПО СпрНоменклатура.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Ссылка  КАК Товар
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.Остаток = 0"; 
	РезультаЗапросаТоваров = ЗапросТоваров.Выполнить();
	Если НЕ РезультаЗапросаТоваров.Пустой() Тогда
		ВыборкаТоваров = РезультаЗапросаТоваров.Выбрать();
		Пока  ВыборкаТоваров.Следующий() Цикл
			ТоварОбъект = ВыборкаТоваров.Товар.Получитьобъект();
			ТоварОбъект.ОбменДанными.Загрузка = Истина;
			ТоварОбъект.КратностьФилиала = 0 ;
			ТоварОбъект.Записать();			
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
