Процедура ВыполнитьПроверку() Экспорт 
	
	Запрос  = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПоступлениеТоваровУслуг.Ссылка КАК ДокументОснование,
	                |	СчетФактураПолученный.Ссылка КАК СчетФактура,
	                |	""Отсутствует счет-фактура"" КАК ТекстОшибка
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                |		ПО (СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка)
	                |ГДЕ
	                |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	                |	И ПоступлениеТоваровУслуг.Проведен
	                |	И СчетФактураПолученный.Ссылка ЕСТЬ NULL 
	                |	И ПоступлениеТоваровУслуг.Организация = &Организация
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПоступлениеТоваровУслуг.Ссылка,
	                |	СчетФактураПолученный.Ссылка,
	                |	""Счет-фактура не проведена""
	                |ИЗ
	                |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	                |		ПО (СчетФактураПолученный.ДокументОснование = ПоступлениеТоваровУслуг.Ссылка)
	                |ГДЕ
	                |	ПоступлениеТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	                |	И ПоступлениеТоваровУслуг.Проведен
	                |	И НЕ СчетФактураПолученный.Ссылка ЕСТЬ NULL 
	                |	И НЕ СчетФактураПолученный.Проведен
	                |	И ПоступлениеТоваровУслуг.Организация = &Организация";
	
	
	Запрос.УстановитьПараметр("ДатаН",НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаК",КонецДня(ДатаОкончания));
	
	ТекущаяБаза = Константы.База.Получить();
	Если ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Казань Тогда 
		Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	Иначе      
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПоступлениеТоваровУслуг.Организация = &Организация","");
	КонецЕсли;
	
	ТЗОшибок = Запрос.Выполнить().Выгрузить();
	
	Если ТЗОшибок.Количество()<> 0 Тогда 
		
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		ТабДокумент.АвтоМасштаб  = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Ландшафт;
		
		Макет       = ПолучитьМакет("ОшибкиСФ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.ДатаН = Формат(ДатаНачала,"ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ДатаК = Формат(ДатаОкончания,"ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		Для Каждого ТекСтрока Из ТЗОшибок Цикл
			
			ОбластьМакета.Параметры.Заполнить(ТекСтрока);
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.Показать();
		
	КонецЕсли;	
	
КонецПроцедуры	