
Процедура СформирватьДанныеДляОтправки(ДниОтчета = 1) Экспорт
	
	//+Сундуков Н. 19.07.2023 #UT11-4245
	ЗаписьЖурналаРегистрации("Выгрузка данных отчета ""СводныйОтчетПриемкиРазмещения"". Начало", УровеньЖурналаРегистрации.Информация);
		
	Для СчетчикДней = 1 По ДниОтчета Цикл
		
		ДатаФормирования = КонецДня(ТекущаяДата()) - (86400 * СчетчикДней);
				
		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных_КХД");
		
		КомпоновщикНастроекНастройки = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроекНастройки.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
		КомпоновщикНастроекНастройки.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию); 
		
		//+Гавриленков В. 27.03.2024 #UT10-4339
		//КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 	НачалоМесяца(ДатаФормирования));
		//КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(ДатаФормирования));  
		КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачала", 	НачалоДня(ДатаФормирования));
		КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ДатаФормирования)); 
		//-Гавриленков В. 27.03.2024 #UT10-4339
		КомпоновщикНастроекНастройки.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склад", 		Константы.ОсновнойСклад.Получить());
		
		КомпоновщикМакета 		= Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки 		= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроекНастройки.Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки 	= Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода 		= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений; 
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаДанных);
		
		ПроцессорВывода.Вывести(ПроцессорКомпоновки);  
		
		Если ТаблицаДанных.Количество() > 0 Тогда 
			
			СтрокаКолонок = "";
			Для Каждого ТекКолонка Из ТаблицаДанных.Колонки Цикл
				СтрокаКолонок = СтрокаКолонок + ТекКолонка.Имя + ",";
			КонецЦикла;	 
			
			СтрокаКолонок = Лев(СтрокаКолонок, СтрДлина(СтрокаКолонок) - 1);
			ТаблицаДанных.Свернуть("", СтрокаКолонок);    
			
			Для Каждого ТекКолонка Из ТаблицаДанных.Колонки Цикл
				
				Точность = 0;
				СтрокаТаблицы = ТаблицаДанных[0];
				
				Если Найти(ВРЕГ(ТекКолонка.Имя), "ВЕС") ИЛИ Найти(ВРЕГ(ТекКолонка.Имя), "ОБЪЕМ") Тогда
					Точность = 3;	
				ИначеЕсли ТекКолонка.Имя = "РасчетОборачиваемость" ИЛИ ТекКолонка.Имя = "РасчетДоляВычерка" Тогда
					Точность = 2;
				КонецЕсли;	
				
				СтрокаТаблицы[ТекКолонка.Имя] = ОКР(СтрокаТаблицы[ТекКолонка.Имя], Точность);	
				
			КонецЦикла;
			
			СтуктураДанныхОтчета = Новый Структура(СтрокаКолонок + ",ДатаОтчет"); 
			ЗаполнитьЗначенияСвойств(СтуктураДанныхОтчета, ТаблицаДанных[0]); 
			
		Иначе 
			
			Для Каждого ЭлементСтруктуры из СтуктураДанныхОтчета Цикл 
				СтуктураДанныхОтчета.Вставить(ЭлементСтруктуры.Ключ, 0);
			КонецЦикла;
			
		КонецЕсли;                
		
		СтуктураДанныхОтчета.Вставить("ДатаОтчет", 				Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"));
		
		СтуктураДанных = Новый Структура;
		СтуктураДанных.Вставить("ДатаОтправки", 		ТекущаяДата());
		СтуктураДанных.Вставить("СтуктураДанныхОтчета", СтуктураДанныхОтчета);
		
		СтруктураОтправкиДанных = СформироватьСтруктуруСообщенияОтчета(СтуктураДанных);
		
		СоздатьИсходящееСообщение(СтруктураОтправкиДанных);
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Выгрузка данных отчета ""СводныйОтчетПриемкиРазмещения"". Завершение", УровеньЖурналаРегистрации.Информация);
	
	//-Сундуков Н. 19.07.2023 #UT11-4245
КонецПроцедуры

Функция СформироватьСтруктуруСообщенияОтчета(ДанныеСообщения)
	
	//+Сундуков Н. 19.07.2023 #UT11-4245
	ID = Новый УникальныйИдентификатор();
	
	Заголовки = Новый СписокЗначений;                          
	Заголовки.Добавить("document_type", "СкладскиеОперацииФилиалы");
	Заголовки.Добавить("message_ver", 	"1.0");
	Заголовки.Добавить("warehouse_id", 	Константы.ОсновнойСклад.Получить().КодМДМ);
		
	Свойства = Новый СписокЗначений;    
	Свойства.Добавить("ТипСодержимого",	"application/json");   	
	Свойства.Добавить("ОтметкаВремени",	AMQP_РаботаСДокументами.ДатуВTimestamp(ДанныеСообщения.ДатаОтправки));   	
	Свойства.Добавить("Тип",			"status");
	Свойства.Добавить("ИмяПриложения", 	Строка(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
	Свойства.Добавить("РежимДоставки",	2);
	Свойства.Добавить("НомерСообщения",	Строка(ID));	
	
	СтруктураОтправки = Новый Структура;
	СтруктураОтправки.Вставить("ДатаОтправки", 	ДанныеСообщения.ДатаОтправки);  
	СтруктураОтправки.Вставить("Сообщение", 	ОбщегоНазначения.ВернутьJSON(ДанныеСообщения.СтуктураДанныхОтчета));  
	СтруктураОтправки.Вставить("Свойства", 		Свойства);      
	СтруктураОтправки.Вставить("Заголовки", 	Заголовки);
	СтруктураОтправки.Вставить("ID", 			ID);

	Возврат СтруктураОтправки;	
	//-Сундуков Н. 19.07.2023 #UT11-4245
КонецФункции		                                 

Процедура СоздатьИсходящееСообщение(СтуктураОтправки)
	
	//-Сундуков Н. 19.07.2023 #UT11-4245
	ДатаОтправки = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка 	= Истина;
	НовоеСообщение.ДатаВремяСобытия 		= СтуктураОтправки.ДатаОтправки;
	НовоеСообщение.ТочкаПубликации 			= Константы.AMQP_Exchange.Получить(); 
	НовоеСообщение.Объект					= "СкладскиеОперацииФилиалы";
	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(СтуктураОтправки.ID));
	
	НовоеСообщение.Сообщение = СтуктураОтправки.Сообщение;	
	
	Для Каждого ЗначенияСвойства Из СтуктураОтправки.Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование 	= ЗначенияСвойства.Значение;
		НоваяСтрока.Значение 		= ЗначенияСвойства.Представление;
		
	КонецЦикла;   	
	
	Если ЗначениеЗаполнено(СтуктураОтправки.Заголовки) Тогда
		
		Для Каждого ЗначениеЗаголовока Из СтуктураОтправки.Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование 	= ЗначениеЗаголовока.Значение;
			НоваяСтрока.Значение 		= ЗначениеЗаголовока.Представление;
			
		КонецЦикла;   
		
	КонецЕсли;        
	
	НовоеСообщение.Записать();
	//-Сундуков Н. 19.07.2023 #UT11-4245
	
КонецПроцедуры	

