///////////////////Регламентные процедуры///////////////////
&НаСервере
Процедура ОтправкаДокументовЭДО() Экспорт  
	
	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Отправка документов ЭДО", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;
		
	МодульИнтеграции = Обработки.МодульИнтеграцииDiState.Создать();
	
	ПараметрыВозврата = МодульИнтеграции.АвторизацияПоЛогинуИПаролю(Константы.ЭДО_Адрес.Получить(), Константы.ЭДО_Логин.Получить(), Константы.ЭДО_Пароль.Получить());
	Если ПараметрыВозврата.ОшибкаАвторизации Тогда
		
		ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Отправка документов ЭДО" + Символы.ПС + ПараметрыВозврата.ТекстОшибки);
		Возврат;
		
	КонецЕсли;
	
	ПараметрыВозврата = МодульИнтеграции.ЗакончитьПроцессАвторизации(ПараметрыВозврата);
	
	Если ПараметрыВозврата.Свойство("ОтпечатокСертификата") И ЗначениеЗаполнено(ПараметрыВозврата.ОтпечатокСертификата) Тогда
		МодульИнтеграции.ОтпечатокСертификата = ПараметрыВозврата.ОтпечатокСертификата;		
	Иначе
		
		ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Отправка документов ЭДО" + Символы.ПС + "Не заполнен отпечаток сертификата при подключении к DiState");
		Возврат;
		
	КонецЕсли;

	МодульИнтеграции.ВерсияСервера = 6;
	
	МодульИнтеграции.Организация = Константы.ОсновнаяОрганизация.Получить();
	
	ДатаНачалаВыгрузкиДокументовЭДО = Константы.ДатаНачалаВыгрузкиДокументовЭДО.Получить();
	
	КонецПериода = ТекущаяДата();   
	
	Если Не ЗначениеЗаполнено(ДатаНачалаВыгрузкиДокументовЭДО) Тогда
		НачалоПериода = ТекущаяДата() - 86400 * 14;   		
	Иначе
		НачалоПериода = ДатаНачалаВыгрузкиДокументовЭДО;
	КонецЕсли;
	
	Попытка
		
		Валюты = МодульИнтеграции.ВыполнитьСинхронизациюВалют();
		МодульИнтеграции.СправочникВалюты.Загрузить(Валюты);
		
		Регионы = МодульИнтеграции.ВыполнитьСинхронизациюРегионов();
		МодульИнтеграции.СправочникРегионы.Загрузить(Регионы);
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
	ВидыДляОтправки = Новый Массив;
	ВидыДляОтправки.Добавить("Универсальный передаточный документ");
	ВидыДляОтправки.Добавить("Универсальный корректировочный документ");
	
	//+Белов А. 25.08.2026 #
	Если Константы.ЭДО_ВыгружатьЗаказЗаявки.Получить() Тогда		
		ВидыДляОтправки.Добавить("Заказ-заявка");           	
	КонецЕсли; 
	
	Если Константы.ЭДО_ВыгружатьТранспортныеНакладные.Получить() Тогда		
		ВидыДляОтправки.Добавить("Транспортная накладная");           	
	КонецЕсли;
	//-Белов А. 25.08.2026 #
	
	Для каждого ВидОтправки ИЗ ВидыДляОтправки Цикл
		
		УПД = Истина;

		Если ВидОтправки = "Транспортная накладная" ИЛИ ВидОтправки = "Заказ-заявка" Тогда
			УПД = Ложь;	
		КонецЕсли;

		ТаблицаДанных = МодульИнтеграции.ПолучитьДокументы(ВидОтправки, Неопределено, НачалоПериода, КонецПериода, Истина, "", УПД);
		
		Если ТипЗнч(ТаблицаДанных) = Тип("Строка") Тогда
			
			ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Внутренняя ошибка работы при выполнении регламентного задания Отправка документов ЭДО " + ТаблицаДанных);
			Продолжить; 
			
		КонецЕсли;
		
		Если ТаблицаДанных.Количество() = 0 Тогда
			
			Сообщить("Нет данных для выгрузки из 1С по установленным отборам");
			Продолжить;
			
		КонецЕсли;
		
		МодульИнтеграции.ИсходящиеДокументы.Загрузить(ТаблицаДанных);
		
		Для каждого СтрИсходящий ИЗ МодульИнтеграции.ИсходящиеДокументы Цикл
			СтрИсходящий.Отправлять = Истина;
		КонецЦикла;
				
		СоздатьИПодписатьДокументыПродолжение(МодульИнтеграции);
	
	КонецЦикла;
				
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСтатусовДокументовЭДО() Экспорт

	Если НЕ МСК.ПроверитьПараметрыПодключения() Тогда 
		
		ЗаписьЖурналаРегистрации("Обновление статусов документов ЭДО", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Отменена работа регламентного задания из-за несоответствия параметров подключения к ИБ");
		Возврат;
		
	КонецЕсли;   
	
	ОбновитьСтатусыПоПараметрамПодключения(Константы.ЭДО_Адрес.Получить(), Константы.ЭДО_Логин.Получить(), Константы.ЭДО_Пароль.Получить());   
	
	Если Константы.ЭДО_ОбновлятьСтатусыПоРезервномуАдресу.Получить() Тогда
		ОбновитьСтатусыПоПараметрамПодключения(Константы.ЭДО_Адрес_Резерв.Получить(), Константы.ЭДО_Логин_Резерв.Получить(), Константы.ЭДО_Пароль_Резерв.Получить());   	
	КонецЕсли;
				
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыПоПараметрамПодключения(ЭДО_Адрес, ЭДО_Логин, ЭДО_Пароль)
	
	ЛимитДокументовПриОбновленииСтатусовДокументов = Константы.ЭДО_ЛимитДокументовПриОбновленииСтатусовДокументов.Получить();
	
	Если Не ЗначениеЗаполнено(ЛимитДокументовПриОбновленииСтатусовДокументов) Тогда
    	ЛимитДокументовПриОбновленииСтатусовДокументов = 500;
	КонецЕсли;
	
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СтатусыОбменаЭДО.Отправка);
	МассивСтатусов.Добавить(Перечисления.СтатусыОбменаЭДО.ОжидаетПодписания); 
	
	//+Белов А. 25.10.2023 #
	МассивСтатусов.Добавить(Перечисления.СтатусыОбменаЭДО.ОжидаетПодписанияАннулирования);
	МассивСтатусов.Добавить(Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования);   
	//-Белов А. 25.10.2023 #
	
	ТаблицаОтправленыхДокументов = ПолучитьДокументыПоСтатусам(МассивСтатусов);

	//Если нет документов для обновления статуса, то возвращаем
	Если ТаблицаОтправленыхДокументов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МодульИнтеграции = Обработки.МодульИнтеграцииDiState.Создать();
	
	ПараметрыВозврата = МодульИнтеграции.АвторизацияПоЛогинуИПаролю(ЭДО_Адрес, ЭДО_Логин, ЭДО_Пароль);
	Если ПараметрыВозврата.ОшибкаАвторизации Тогда
		
		ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Обновление статусов документов ЭДО" + Символы.ПС + ПараметрыВозврата.ТекстОшибки);
		Возврат; 
		
	КонецЕсли;
	
	ТаблицаКПодписаниюДокументовЭДО = МодульИнтеграции.ПолучитьДокументыОжидающиеПодписи(ТекущаяДата() - (86400 * 365) * 2, ТекущаяДата(), ЛимитДокументовПриОбновленииСтатусовДокументов);
	
	ОбновитьСтатусыДокументов(ТаблицаОтправленыхДокументов.Скопировать(Новый Структура("Статус", Перечисления.СтатусыОбменаЭДО.Отправка)), ТаблицаКПодписаниюДокументовЭДО, Перечисления.СтатусыОбменаЭДО.ОжидаетПодписания, МодульИнтеграции);
	
	ТаблицаЗавершенныхДокументовЭДО = МодульИнтеграции.ПолучитьДокументыЗавершенные(ТекущаяДата() - (86400 * 365) * 2, ТекущаяДата(), ЛимитДокументовПриОбновленииСтатусовДокументов);
	
	ОбновитьСтатусыДокументов(ТаблицаОтправленыхДокументов, ТаблицаЗавершенныхДокументовЭДО, Перечисления.СтатусыОбменаЭДО.Завершен, МодульИнтеграции);
	
	//+Белов А. 25.10.2023 #
	ОбновитьСтатусыДокументов(ТаблицаОтправленыхДокументов.Скопировать(Новый Структура("Статус", Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования)), ТаблицаКПодписаниюДокументовЭДО, Перечисления.СтатусыОбменаЭДО.ОжидаетПодписанияАннулирования, МодульИнтеграции);	
	//-Белов А. 25.10.2023 #
	
КонецПроцедуры

&НаСервере
Процедура ОбновлениеСтатусовВходящихДокументовЭДО() Экспорт 
	
	//+Макрушин Е. 17.03.2026 #UT10-5658
	Если Константы.ЭДО_ОбновлятьСтатусыПоРезервномуАдресу.Получить() Тогда
		СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции(Истина);                 
	Иначе
		СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции();                 
	КонецЕсли;
	
	Если СтруктураВозвратаМодуля.Результат Тогда
		МодульИнтеграции = СтруктураВозвратаМодуля.МодульИнтеграции;
	Иначе
		
		ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Обновление статусов входящих документов ЭДО" + Символы.ПС + СтруктураВозвратаМодуля.Сообщение);
		Возврат;
		
	КонецЕсли; 
	
	ЛимитДокументовПриОбновленииСтатусовВходящихДокументов = Константы.ЭДО_ЛимитДокументовПриОбновленииСтатусовВходящихДокументов.Получить();
	
	Если Не ЗначениеЗаполнено(ЛимитДокументовПриОбновленииСтатусовВходящихДокументов) Тогда
		ЛимитДокументовПриОбновленииСтатусовВходящихДокументов = 1000;
	КонецЕсли;
	
	//Обновление статусов поступлений 
	Если Константы.ОбновлятьСтатусыПоступленийЭДО.Получить() Тогда
		
		ТаблицаДокументовЭДО = МодульИнтеграции.ПолучитьДокументыВходящиеОжидающиеПодписи(ТекущаяДата() - (86400 * 180), ТекущаяДата(), "connector_utd_invoice_and_waybill", ЛимитДокументовПриОбновленииСтатусовВходящихДокументов); 
		
		ТаблицаПоступлений = Новый ТаблицаЗначений; 
		ТаблицаПоступлений.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30)));
		ТаблицаПоступлений.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		ТаблицаПоступлений.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));   
		ТаблицаПоступлений.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));   
		ТаблицаПоступлений.Колонки.Добавить("ИдентификаторОтправителя", Новый ОписаниеТипов("Число")); 
		ТаблицаПоступлений.Колонки.Добавить("ДанныеДокумента");
		
		Для каждого СтрокаТаблицы Из ТаблицаДокументовЭДО Цикл
			
			Если СтрокаТаблицы.ГруппаПроцессинга = "universal_invoice_connector_utd_invoice_and_waybill" Тогда
				
				Если ЗначениеЗаполнено(СтрокаТаблицы.Отправитель) 
					И ТипЗнч(СтрокаТаблицы.Отправитель) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
					И СтрокаТаблицы.Отправитель.ДатаНачалаОбменаЭДО <= СтрокаТаблицы.Дата Тогда
					
					НСтр = ТаблицаПоступлений.Добавить();        
					ЗаполнитьЗначенияСвойств(НСтр, СтрокаТаблицы);
					НСтр.Идентификатор = СтрокаТаблицы.ИдентификаторДокумента;
					НСтр.ИдентификаторОтправителя = СтрокаТаблицы.ИдентификаторОтправителя;
					
				КонецЕсли;
				
			КонецЕсли;		
			
		КонецЦикла; 
		
		Если ТаблицаПоступлений.Количество() > 0 Тогда
			ОбработатьВходящиеПоступлений(ТаблицаПоступлений, МодульИнтеграции);		
		КонецЕсли;   
		
	КонецЕсли; 
	//-Макрушин Е. 17.03.2026 #UT10-5658      
	
	//+Белов А. 25.09.2026 #UT10-6055
	//Обновление статусов транспортных накладных 
	Если Константы.ОбновлятьСтатусыТранспортныхНакладныхЭДО.Получить() Тогда
		
		ТаблицаДокументовЭДО = МодульИнтеграции.ПолучитьДокументыВходящиеОжидающиеПодписи(ТекущаяДата() - (86400 * 180), ТекущаяДата(), "electronic_waybill", ЛимитДокументовПриОбновленииСтатусовВходящихДокументов, "_consignee"); 
		
		ТаблицаТН = Новый ТаблицаЗначений; 
		ТаблицаТН.Колонки.Добавить("Номер", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30)));
		ТаблицаТН.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
		ТаблицаТН.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число"));   
		ТаблицаТН.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));   
		ТаблицаТН.Колонки.Добавить("ИдентификаторОтправителя", Новый ОписаниеТипов("Число")); 
		
		Для каждого СтрокаТаблицы Из ТаблицаДокументовЭДО Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТаблицы.Отправитель)
				Или ЗначениеЗаполнено(СтрокаТаблицы.Отправитель)
				И Не ТипЗнч(СтрокаТаблицы.Отправитель) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				Или ЗначениеЗаполнено(СтрокаТаблицы.Отправитель) 
				И ТипЗнч(СтрокаТаблицы.Отправитель) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
				И СтрокаТаблицы.Отправитель.ДатаНачалаОбменаЭДО <= СтрокаТаблицы.Дата
				Тогда			
				
				НСтр = ТаблицаТН.Добавить();        
				ЗаполнитьЗначенияСвойств(НСтр, СтрокаТаблицы);
				НСтр.Идентификатор = СтрокаТаблицы.ИдентификаторДокумента;
				
			КонецЕсли;		
			
		КонецЦикла;
		
		ОбработатьВходящиеТН_Грузополучатель(ТаблицаТН, МодульИнтеграции);
		
	КонецЕсли;       
	//-Белов А. 25.09.2026 #UT10-6055
	
КонецПроцедуры  

&НаСервере
Процедура ОчисткаРегистраДокументовТребующихОбработки() Экспорт
	
	//+Макрушин Е. 20.03.2026 #UT10-5658
	УстановитьПривилегированныйРежим(Истина);
	
	Дата = ТекущаяДата() - 365*86400;     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыЭДОТребующиеОбработки.Идентификатор
	|ИЗ
	|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
	|ГДЕ
	|	ДокументыЭДОТребующиеОбработки.Дата < &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		МенеджерЗаписи = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
		МенеджерЗаписи.Удалить();
		
	КонецЦикла; 
	
	УстановитьПривилегированныйРежим(Ложь);
	//-Макрушин Е. 20.03.2026 #UT10-5658
	
КонецПроцедуры

///////////////////Процедуры для отправки документов в ЭДО///////////////////
&НаСервере
Процедура СоздатьИПодписатьДокументыПродолжение(Объект, ДополнительныеПараметры = Неопределено)
	
	ПорцияОтправки = 10;
	
	КоличествоДокументовКОтправке = Объект.ИсходящиеДокументы.Количество();
	СписокДокументовКОчистке = Новый Массив;	
	МаксКоличествоКОтправке = ПолучитьКоличествоДокументовКОтправке(Объект);
	СчетчикВыгруженных = 0;	
					
	МассивДокументов = Новый Массив;
	
	Для НомерДокумента = 1 По КоличествоДокументовКОтправке Цикл
		
		СтрокаТаблицы = Объект.ИсходящиеДокументы.Получить(НомерДокумента - 1);
		
		Если Объект.ИсходящиеДокументы.Получить(НомерДокумента - 1).Отправлять Тогда
			
			КонтентДляПодписи = СоздатьИВернутьДляПодписиДокумент(НомерДокумента, Объект);  
			
			Если ТипЗнч(КонтентДляПодписи) = Тип("Соответствие") Тогда
				
				Если КонтентДляПодписи.Получить("success") <> Неопределено И КонтентДляПодписи.Получить("success") Тогда
					
					СтрокаКонтента = КонтентДляПодписи.Получить("content");	
					ЗаписатьИсториюОбменаЭДО(СтрокаТаблицы.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыОбменаЭДО.Подготовка"),,"Документ успешно подготовлен", Истина); //Белов
					
				ИначеЕсли КонтентДляПодписи.Получить("success") <> Неопределено Тогда
					Объект.ИсходящиеДокументы.Получить(НомерДокумента - 1).ОписаниеОшибки = КонтентДляПодписи.Получить("codeDescription")
					+ Символы.ПС + ВернутьРазобранныйСписокПроблем(КонтентДляПодписи.Получить("violations"));
					
					ЗаписатьИсториюОбменаЭДО(СтрокаТаблицы.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыОбменаЭДО.Подготовка"), СтрокаТаблицы.ОписаниеОшибки, "Ошибка при подготовке документа к отправке", Истина); //Белов
					
					Продолжить;
				КонецЕсли;
				
			Иначе
				
				СтрокаКонтента = КонтентДляПодписи.content;	
				ЗаписатьИсториюОбменаЭДО(СтрокаТаблицы.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыОбменаЭДО.Подготовка"),,"Документ успешно подготовлен", Истина); //Белов
				
			КонецЕсли;
			
			Попытка
				
				ДвоичныеДанныеДокумента = Base64Значение(СтрокаКонтента);
				
				Если Объект.ОтпечатокСертификата = Неопределено Тогда
					Возврат;
				КонецЕсли;
				
				СтрокаПодписи = "";
				//СтрокаПодписи = ПодписатьДокументЭП(ДвоичныеДанныеДокумента, СтрокаПароля); 
				
				МассивДокументов.Добавить(ПодготовитьСтруктуруЗапросаНаСоздание(НомерДокумента, СтрокаКонтента, СтрокаПодписи, Объект) );
				
				СчетчикВыгруженных = СчетчикВыгруженных + 1;
				
				Если СчетчикВыгруженных % ПорцияОтправки = 0 ИЛИ СчетчикВыгруженных = МаксКоличествоКОтправке Тогда						
					
					ОтправитьМассивНовыхДокументов(МассивДокументов, Объект);
					МассивДокументов.Очистить();  
					
				КонецЕсли;  
				
			Исключение
				
				Сообщить(ИнформацияОбОшибке().Описание);
				Объект.ЗапомнитьПароль = Ложь; 
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивДокументов.Количество() > 0 Тогда
		
		ОтправитьМассивНовыхДокументов(МассивДокументов, Объект);
		МассивДокументов.Очистить(); 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДокументовКОтправке(Объект)
	
	Количество = 0;
	
	Для Каждого СтрокаТЧ Из Объект.ИсходящиеДокументы Цикл
		
		Если СтрокаТЧ.Отправлять Тогда
			Количество = Количество + 1;	
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат Количество; 
	
КонецФункции

&НаСервере
Функция СоздатьИВернутьДляПодписиДокумент(НомерДокумента, Объект)

	Если ЗначениеЗаполнено(НомерДокумента) Тогда
		
		СтрокаТаблицы = Объект.ИсходящиеДокументы[НомерДокумента-1];
		СтруктураСтрокиТЧ = Новый Структура("Ссылка,УПД, СФ");
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиТЧ, СтрокаТаблицы);
		
		Возврат Объект.СоздатьXMLДокументаИВернутьДляПодписания(СтруктураСтрокиТЧ);
		
	КонецЕсли;  
	
КонецФункции

&НаСервере
Функция ВернутьРазобранныйСписокПроблем(МассивОшибок)

	СтрокаТекста = "";
	Если НЕ ЗначениеЗаполнено(МассивОшибок) Тогда
		Возврат СтрокаТекста;
	КонецЕсли;
	
	Если ТипЗнч(МассивОшибок) = Тип("Массив") Тогда
		
		Для Каждого Ошибка Из МассивОшибок Цикл
			
			Если ЗначениеЗаполнено(СтрокаТекста) Тогда
				СтрокаТекста = СтрокаТекста + Символы.ПС;
			КонецЕсли; 
			
			Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
				СтрокаТекста = СтрокаТекста + Ошибка;	
			Иначе
				
				Если Ошибка.Получить("propertyPath") <> Неопределено Тогда
					СтрокаТекста = СтрокаТекста + Ошибка.Получить("propertyPath") + ": ";
				КонецЕсли;
				
				Если Ошибка.Получить("violation") <> Неопределено Тогда
					СтрокаТекста = СтрокаТекста + Ошибка.Получить("violation");
				КонецЕсли;  
				
			КонецЕсли; 
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(МассивОшибок) = Тип("Соответствие") Тогда
		
		Если МассивОшибок.Получить("violations") <> Неопределено Тогда
			СтрокаТекста = ВернутьРазобранныйСписокПроблем(МассивОшибок.Получить("violations"));
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат СтрокаТекста;
	
КонецФункции

&НаСервере
Функция ПодготовитьСтруктуруЗапросаНаСоздание(НомерДокумента, Контент, Подпись, Объект)
	
	СтрокаДанных = Объект.ИсходящиеДокументы.Получить(НомерДокумента - 1);
	ТипДокумента = ВыдатьКорректныйТипДокумента(СтрокаДанных);
	
	СтруктураЗапроса = Новый Структура("Контрагент,ТипДокумента,Контент,Подпись,СсылкаНаДокумент");
		
	СтруктураЗапроса.Контрагент = Объект.ПолучитьКонтрагентаПоОбъектуЗаполнения(СтрокаДанных.Ссылка);//Белов СтрокаДанных.Контрагент;
	СтруктураЗапроса.ТипДокумента = ТипДокумента;
	СтруктураЗапроса.Контент = Контент;
	СтруктураЗапроса.Подпись = Подпись;
	СтруктураЗапроса.СсылкаНаДокумент = СтрокаДанных.Ссылка;
	
	Возврат СтруктураЗапроса;
	
КонецФункции

&НаСервере
Функция ВыдатьКорректныйТипДокумента(СтрокаДанных)
	
	ТипДокумента = СтрокаДанных.Тип;
	
	Если СтрокаДанных.УПД И НЕ Найти(ТипДокумента, "Счет на оплату") Тогда
		
		Если ТипДокумента <> "Акт сверки" Тогда
			
			Если НЕ Найти(Строка(СтрокаДанных.Ссылка), "фактур")  Тогда
				
				Если Найти(ТипДокумента, "коррект") Тогда
					ТипДокумента = "УКД";
				Иначе
					ТипДокумента = "УПД";
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли;   
		
	КонецЕсли;
	
	Возврат ТипДокумента;
	
КонецФункции

&НаСервере
Функция ОтправитьМассивНовыхДокументов(МассивДокументов, Объект)
	
	РезультатОбработки = Объект.МассовоСоздатьДокументыВЭДО(МассивДокументов);
	
	Если ТипЗнч(РезультатОбработки) = Тип("Массив") Тогда
		
		Для Каждого ЭлементОшибка Из РезультатОбработки Цикл
			
			РезультатОтправки = ЭлементОшибка.Результат;
			МассивСтрокТаблицы = Объект.ИсходящиеДокументы.НайтиСтроки(Новый Структура("Ссылка", ЭлементОшибка.Ссылка));
			
			Если МассивСтрокТаблицы.Количество() = 1 Тогда
				
				СтрокаДанных = МассивСтрокТаблицы[0];
				
				Если РезультатОтправки.Получить("success") = Истина Тогда
					СтрокаДанных.Статус = "Документ отправлен";
					СтрокаДанных.Идентификатор = РезультатОтправки.Получить("documentId");
					
					ЗаписатьИсториюОбменаЭДО(СтрокаДанных.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыОбменаЭДО.Отправка"),, "Документ успешно отправлен: " + Символы.ПС + "Идентификатор документа: " + СтрокаДанных.Идентификатор, Истина); //Белов
			
					
				ИначеЕсли РезультатОтправки.Получить("success") = Ложь Тогда
					СтрокаДанных.ОписаниеОшибки = РезультатОтправки.Получить("codeDescription") 
										+ Символы.ПС + ВернутьРазобранныйСписокПроблем(РезультатОтправки.Получить("details") );
										
					ЗаписатьИсториюОбменаЭДО(СтрокаДанных.Ссылка, ПредопределенноеЗначение("Перечисление.СтатусыОбменаЭДО.Отправка"), СтрокаДанных.ОписаниеОшибки, "Ошибка при отправке документа", Истина); //Белов
					
				КонецЕсли;
				
		   КонецЕсли;
		   
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура АннулированиеДокументовЭДО() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	//+Гавриленков В. 13.11.2025 #UT10-5499
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	//|	ЕСТЬNULL(Идентификатор.Значение, 0) КАК Идентификатор,
	//|	Состояние.Значение КАК Состояние
	//|ПОМЕСТИТЬ ВТ_Реализации
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Идентификатор
	//|		ПО РеализацияТоваровУслуг.Ссылка = Идентификатор.Объект
	//|			И (Идентификатор.Свойство = &Свойство)
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Состояние
	//|		ПО РеализацияТоваровУслуг.Ссылка = Состояние.Объект
	//|			И (Состояние.Свойство = &Состояние)
	//|ГДЕ
	//|	РеализацияТоваровУслуг.ПометкаУдаления
	//|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВЫРАЗИТЬ(ИсторияОбменовЭДО.Объект КАК Документ.РеализацияТоваровУслуг) КАК Реализация,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсторияОбменовЭДО.Период) КАК КоличествоПопыток
	//|ПОМЕСТИТЬ ВТ_ПопыткиАннулирования
	//|ИЗ
	//|	РегистрСведений.ИсторияОбменовЭДО КАК ИсторияОбменовЭДО
	//|ГДЕ
	//|	ИсторияОбменовЭДО.Объект В
	//|			(ВЫБРАТЬ
	//|				ВТ_Реализации.Реализация
	//|			ИЗ
	//|				ВТ_Реализации)
	//|	И ИсторияОбменовЭДО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбменаЭДО.ПодготовкаАннулирования)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫРАЗИТЬ(ИсторияОбменовЭДО.Объект КАК Документ.РеализацияТоваровУслуг)
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Реализации.Реализация,
	//|	ВТ_Реализации.Идентификатор
	//|ИЗ
	//|	ВТ_Реализации КАК ВТ_Реализации
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПопыткиАннулирования КАК ВТ_ПопыткиАннулирования
	//|		ПО ВТ_Реализации.Реализация = ВТ_ПопыткиАннулирования.Реализация
	//|ГДЕ
	//|	ВТ_Реализации.Состояние В(&МассивСостояний)
	//|	И ЕСТЬNULL(ВТ_ПопыткиАннулирования.КоличествоПопыток, 0) <= 2"; 
	
	
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Документ,
	|	ЕСТЬNULL(Идентификатор.Значение, 0) КАК Идентификатор,
	|	Состояние.Значение КАК Состояние,
	|	1 КАК Порядок
	|ПОМЕСТИТЬ ВТ_Документы
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Идентификатор
	|		ПО РеализацияТоваровУслуг.Ссылка = Идентификатор.Объект
	|			И (Идентификатор.Свойство = &Свойство)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Состояние
	|		ПО РеализацияТоваровУслуг.Ссылка = Состояние.Объект
	|			И (Состояние.Свойство = &Состояние)
	|ГДЕ
	|	РеализацияТоваровУслуг.ПометкаУдаления
	|	И РеализацияТоваровУслуг.Дата >= &ДатаНачала
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	ЕСТЬNULL(Идентификатор.Значение, 0),
	|	Состояние.Значение,
	|	2
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Идентификатор
	|		ПО КорректировкаРеализации.Ссылка = Идентификатор.Объект
	|			И (Идентификатор.Свойство = &Свойство)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК Состояние
	|		ПО КорректировкаРеализации.Ссылка = Состояние.Объект
	|			И (Состояние.Свойство = &Состояние)
	|ГДЕ
	|	КорректировкаРеализации.ПометкаУдаления
	|	И КорректировкаРеализации.Дата >= &ДатаНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсторияОбменовЭДО.Объект КАК Документ,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ИсторияОбменовЭДО.Период) КАК КоличествоПопыток
	|ПОМЕСТИТЬ ВТ_ПопыткиАннулирования
	|ИЗ
	|	РегистрСведений.ИсторияОбменовЭДО КАК ИсторияОбменовЭДО
	|ГДЕ
	|	ИсторияОбменовЭДО.Объект В
	|			(ВЫБРАТЬ
	|				ВТ_Документы.Документ
	|			ИЗ
	|				ВТ_Документы)
	|	И ИсторияОбменовЭДО.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбменаЭДО.ПодготовкаАннулирования)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияОбменовЭДО.Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Документы.Документ,
	|	ВТ_Документы.Идентификатор
	|ИЗ
	|	ВТ_Документы КАК ВТ_Документы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПопыткиАннулирования КАК ВТ_ПопыткиАннулирования
	|		ПО ВТ_Документы.Документ = ВТ_ПопыткиАннулирования.Документ
	|ГДЕ
	|	ВТ_Документы.Состояние В(&МассивСостояний)
	|	И ЕСТЬNULL(ВТ_ПопыткиАннулирования.КоличествоПопыток, 0) <= 2
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Документы.Порядок";
	//-Гавриленков В. 13.11.2025 #UT10-5499
	
	
	Запрос.УстановитьПараметр("ДатаНачала", Константы.ЭДО_ДатаНачалаАннулированияДокументов.Получить());     
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("DS_Документ_ID"));
	Запрос.УстановитьПараметр("Состояние", ПланыВидовХарактеристик.СвойстваОбъектов.СостояниеЭДО);	
	
	МассивСостояний = Новый Массив;
	МассивСостояний.Добавить(Перечисления.СостояниеЭДО.Отправлен);
	МассивСостояний.Добавить(Перечисления.СостояниеЭДО.Подписан);
	
	Запрос.УстановитьПараметр("МассивСостояний", МассивСостояний);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		
		МодульИнтеграции = Обработки.МодульИнтеграцииDiState.Создать();       
		
		ПараметрыВозврата = МодульИнтеграции.АвторизацияПоЛогинуИПаролю(Константы.ЭДО_Адрес.Получить(), Константы.ЭДО_Логин.Получить(), Константы.ЭДО_Пароль.Получить());
		Если ПараметрыВозврата.ОшибкаАвторизации Тогда
			
			ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Отправка аннулирований" + Символы.ПС + ПараметрыВозврата.ТекстОшибки);
			Возврат; 
			
		КонецЕсли; 
		
		ПараметрыВозврата = МодульИнтеграции.ЗакончитьПроцессАвторизации(ПараметрыВозврата);
		
		Если ПараметрыВозврата.Свойство("ОтпечатокСертификата") И ЗначениеЗаполнено(ПараметрыВозврата.ОтпечатокСертификата) Тогда
			МодульИнтеграции.ОтпечатокСертификата = ПараметрыВозврата.ОтпечатокСертификата;		
		Иначе 
			
			ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при выполнении регламентного задания Отправка аннулирований" + Символы.ПС + "Не заполнен отпечаток сертификата при подключении к DiState");
			Возврат; 
			
		КонецЕсли;
		
		МодульИнтеграции.ВерсияСервера = 6;	
		МодульИнтеграции.Организация = Константы.ОсновнаяОрганизация.Получить();
			
		Пока Выборка.Следующий() Цикл  
			//+Гавриленков В. 13.11.2025 #UT10-5499
			//Аннулировать(Выборка.Реализация, Выборка.Идентификатор, МодульИнтеграции);
			Аннулировать(Выборка.Документ, Выборка.Идентификатор, МодульИнтеграции);
			//-Гавриленков В. 13.11.2025 #UT10-5499
		КонецЦикла; 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Аннулировать(ДокументАннулирования, ИдентификаторДокумента, МодульИнтеграции)
 			
	СтруктураАннулирования = Новый Структура;
	СтруктураАннулирования.Вставить("ПричинаАннулирования", "Отказ клиента");  
	СтруктураАннулирования.Вставить("Ссылка", ДокументАннулирования);
	СтруктураАннулирования.Вставить("Идентификатор", Число(ИдентификаторДокумента));
	
	КонтентДляПодписи = МодульИнтеграции.СоздатьXMLКвитанциюОбАннулированииИВернутьДляПодписания(СтруктураАннулирования);
	
	Если КонтентДляПодписи <> Неопределено И КонтентДляПодписи.Получить("success") <> Неопределено И КонтентДляПодписи.Получить("success") Тогда 		
		
		СтрокаКонтента = КонтентДляПодписи.Получить("content"); 
		
		ЭДО.ЗаписатьИсториюОбменаЭДО(ДокументАннулирования, Перечисления.СтатусыОбменаЭДО.ПодготовкаАннулирования,,"Квитанция для аннулирования была успешно подготовлена");
		
		Результат = МодульИнтеграции.ОтправитьПодписаннуюКвитанцию(ИдентификаторДокумента, СтрокаКонтента, "", "Аннулировать");     
		
		Если Результат <> Неопределено И Результат.Получить("success") <> Неопределено И Результат.Получить("success") Тогда			
			ЭДО.ЗаписатьИсториюОбменаЭДО(ДокументАннулирования, Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования,,"Квитанция для аннулирования была успешно отправлена",,1); 
		Иначе   
			
			Ошибка = "Возникла ошибка при подписании квитанции";
			
			Если Результат.Получить("details") <> Неопределено Тогда
				Ошибка = Ошибка + ": " + Результат.Получить("details");	
			КонецЕсли;
			
			Если Результат.Получить("code") <> Неопределено Тогда
				Ошибка = Ошибка + " (" + Результат.Получить("code") + ")";	
			КонецЕсли;
			
			ЭДО.ЗаписатьИсториюОбменаЭДО(ДокументАннулирования, Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования, Ошибка,, Истина, 1); 
			
		КонецЕсли;
		
	Иначе    
		
		Ошибка = "Не был создан контент для подписи"; 
		
		Если КонтентДляПодписи <> Неопределено Тогда
			
			Если КонтентДляПодписи.Получить("details") <> Неопределено Тогда
				Ошибка = Ошибка + ": " + Результат.Получить("details");	
			КонецЕсли;
			
			Если КонтентДляПодписи.Получить("code") <> Неопределено Тогда
				Ошибка = Ошибка + " (" + Результат.Получить("code") + ")";	
			КонецЕсли; 
			
		КонецЕсли;
	
		ЭДО.ЗаписатьИсториюОбменаЭДО(ДокументАннулирования, Перечисления.СтатусыОбменаЭДО.ПодготовкаАннулирования, Ошибка,, Истина);
		
	КонецЕсли; 

КонецПроцедуры

 &НаСервере
Процедура ОтправитьФормализованныйДокументПоЭдо(Документ) Экспорт
	
	//+Макрушин Е. 06.04.2026 #UT10-5800
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Документ);
	
	ОтправитьФормализованныеДокументыПоЭдо(МассивДокументов);
	//-Макрушин Е. 06.04.2026 #UT10-5800
		 
КонецПроцедуры

 &НаСервере
Процедура ОтправитьФормализованныеДокументыПоЭдо(МассивДокументов)
	
	//+Макрушин Е. 06.04.2026 #UT10-5800
	Если Константы.ЭДО_ОбновлятьСтатусыПоРезервномуАдресу.Получить() Тогда
		СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции(Истина);           
	Иначе
		СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции();  
	КонецЕсли;
	
	Если СтруктураВозвратаМодуля.Результат Тогда
		МодульИнтеграции = СтруктураВозвратаМодуля.МодульИнтеграции;
	Иначе          
		ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при отправке документов по ЭДО" + Символы.ПС + СтруктураВозвратаМодуля.Сообщение);
		Возврат;
	КонецЕсли;
	
	Для каждого Документ Из МассивДокументов Цикл
			
		НСтр = МодульИнтеграции.ИсходящиеДокументы.Добавить();
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
			НСтр.Тип = "Торг-2";                                     
		КонецЕсли;
		
		НСтр.Ссылка = Документ; 
		НСтр.Отправлять = Истина;
		
	КонецЦикла;      
	
	СоздатьИПодписатьДокументыПродолжение(МодульИнтеграции);
	//-Макрушин Е. 06.04.2026 #UT10-5800
	
КонецПроцедуры

///////////////////Процедуры для обновления статусов документов в ЭДО///////////////////
&НаСервере
Функция ПолучитьДокументыПоСтатусам(МассивСтатусов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияОбменовЭДОСрезПоследних.Объект,
	               |	МАКСИМУМ(ИсторияОбменовЭДОСрезПоследних.Статус) КАК Статус
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	РегистрСведений.ИсторияОбменовЭДО.СрезПоследних КАК ИсторияОбменовЭДОСрезПоследних
	               |ГДЕ
	               |	ИсторияОбменовЭДОСрезПоследних.Ошибка ПОДОБНО """"
	               |	И ИсторияОбменовЭДОСрезПоследних.Статус В (&СписокСтатусов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИсторияОбменовЭДОСрезПоследних.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Объект КАК Документ,
	               |	МАКСИМУМ(ДополнительныеСведения.Значение) КАК ИдентификаторДокумента,
	               |	МАКСИМУМ(ВТ_Документы.Статус) КАК Статус
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ДополнительныеСведения
	               |		ПО ВТ_Документы.Объект = ДополнительныеСведения.Объект
	               |			И (ДополнительныеСведения.Свойство = &Свойство)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Документы.Объект";
	
	СписокСтатусов = Новый СписокЗначений;
	
	Если ТипЗнч(МассивСтатусов) = Тип("Массив") Тогда
		СписокСтатусов.ЗагрузитьЗначения(МассивСтатусов);
	Иначе
		СписокСтатусов.Добавить(МассивСтатусов);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("DS_Документ_ID"));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;

КонецФункции

&НаСервере
Функция ПолучитьСтатусДокумента(Документ) Экспорт
	
	СтруктураВозврата = Новый Структура("Статус, Комментарий", Перечисления.СтатусыОбменаЭДО.ПустаяСсылка(), "");
	
//+Макрушин Е. 09.04.2026 #UT10-5800
    СтруктураВозврата.Вставить("Ошибка", "");
//-Макрушин Е. 09.04.2026 #UT10-5800
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияОбменовЭДОСрезПоследних.Статус,
	|	ИсторияОбменовЭДОСрезПоследних.Комментарий
//+Макрушин Е. 09.04.2026 #UT10-5800
	|	,ИсторияОбменовЭДОСрезПоследних.Ошибка
//-Макрушин Е. 09.04.2026 #UT10-5800
	|ИЗ
	|	РегистрСведений.ИсторияОбменовЭДО.СрезПоследних(, Объект = &Документ) КАК ИсторияОбменовЭДОСрезПоследних";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыДокументов(ТаблицаДокументов, ТаблицаДокументовЭДО, Статус, МодульИнтеграции) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДокументов.Документ,
	               |	ТаблицаДокументов.ИдентификаторДокумента
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	&ТаблицаДокументов КАК ТаблицаДокументов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДокументовЭДО.ОжидаемыеДействия,
	               |	ТаблицаДокументовЭДО.ИдентификаторДокумента
	               |ПОМЕСТИТЬ ВТ_ДокументыЭДО
	               |ИЗ
	               |	&ТаблицаДокументовЭДО КАК ТаблицаДокументовЭДО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.Документ,
	               |	МАКСИМУМ(ВТ_ДокументыЭДО.ОжидаемыеДействия) КАК ОжидаемыеДействия,
	               |	ВТ_ДокументыЭДО.ИдентификаторДокумента
	               |ИЗ
	               |	ВТ_ДокументыЭДО КАК ВТ_ДокументыЭДО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |		ПО ВТ_ДокументыЭДО.ИдентификаторДокумента = ВТ_Документы.ИдентификаторДокумента
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Документы.Документ,
	               |	ВТ_ДокументыЭДО.ИдентификаторДокумента";
	
	Запрос.УстановитьПараметр("ТаблицаДокументов", ТаблицаДокументов);
	Запрос.УстановитьПараметр("ТаблицаДокументовЭДО", ТаблицаДокументовЭДО);
	
	ТаблицаДляОбновленияСтатусов = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТаблицаДляОбновленияСтатусов Цикл
		
		//+Белов А. 07.09.2026 #UT10-6034
		Если ТипЗнч(Стр.Документ) = Тип("ДокументСсылка.ЗаказЗаявка")
			И Статус = Перечисления.СтатусыОбменаЭДО.Завершен 
			И ТипЗнч(Стр.Документ.Организация) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СтруктураВозврата = МодульИнтеграции.ЭДО_ПолучитьДанныеДокументаJSON(Стр.ИдентификаторДокумента); 
			
			Если ЗначениеЗаполнено(СтруктураВозврата.Контент) И СтруктураВозврата.Контент.Получить("carrierResponse") <> Неопределено Тогда
				
				Об = Стр.Документ.ПолучитьОбъект(); 
				Об.ОтветПеревозчика = ОбщегоНазначения.ВернутьJSON(СтруктураВозврата.Контент.Получить("carrierResponse"));
				Об.ОбменДанными.Загрузка = Истина;               
				Об.Записать();
				
			Иначе
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		//-Белов А. 07.09.2026 #UT10-6034
		
		ЭДО.ЗаписатьИсториюОбменаЭДО(Стр.Документ, Статус, "", Стр.ОжидаемыеДействия);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусДокументаЭДО(Документ, СостояниеЭДО)
	
	Если НЕ Найти(СостояниеЭДО,"Документ успешно отправлен") = 0 Тогда
		ТекСостояние = "Отправлен";
	ИначеЕсли СостояниеЭДО = "Документооборот завершен" Тогда
		ТекСостояние = "Подписан";
	ИначеЕсли СостояниеЭДО = "Документ отклонен" Тогда
		ТекСостояние = "Отклонен";
	ИначеЕсли СостояниеЭДО = "annulled" Тогда
		ТекСостояние = "Аннулирован"; 
	//+Белов А. 13.10.2023 #
	ИначеЕсли СостояниеЭДО = "Квитанция для аннулирования была успешно отправлена" Тогда
	//-Белов А. 13.10.2023 #  
		ТекСостояние = "ОтправленоАннулирование";
	КонецЕсли;
	
	Если СокрЛП(ТекСостояние) = "" Тогда 
		Возврат; 
	КонецЕсли;   
	
	ТекСостояниеЭДО = Перечисления.СостояниеЭДО[ТекСостояние]; 
	
	ЗаписатьСостояниеЭДО(Документ, ТекСостояниеЭДО);
	
	Если Документ.Метаданные().Имя = "РеализацияТоваровУслуг" Тогда
		
		Если ТекСостояниеЭДО = Перечисления.СостояниеЭДО.Аннулирован  Тогда 

			Рег = РегистрыСведений.ВозвращенныеДокументы.СоздатьНаборЗаписей();
			Рег.Отбор.Коробка.Установить(Справочники.КоробкиХраненияДокументов.КоробкаЭДО);
			Рег.Отбор.Документ.Установить(Документ);
			Рег.Отбор.НеАктуально.Установить(Ложь);
			Рег.Прочитать();
			
			Если Рег.Количество() = 0 Тогда 
				
				Запись = Рег.Добавить();
				запись.Документ = Документ;
				Запись.Коробка = Справочники.КоробкиХраненияДокументов.КоробкаЭДО;
				Запись.ОригиналыПолучены = Истина;
				Запись.ДатаПолучения = ТекущаяДата();
				Запись.НомерПоПорядку = Обработки.ВозвращенныеДокументы.Создать().ПолучитьМаксимальныйНомерПоПорядку(Справочники.КоробкиХраненияДокументов.КоробкаЭДО);
				
			Иначе
				Запись = Рег[0];
			КонецЕсли;
			
			Запись.НасУстраивает = Ложь; 
			Запись.НетПечати = Ложь;
			Запись.ФИО = "";
			Запись.СуммаДокумента = Документ.СуммаДокумента;
			Запись.ДатаПоследнегоИзменения = ТекущаяДата();
			Рег.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ЗаписатьСостояниеЭДО(Документ, Статус) Экспорт 
		
	МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Документ;
	МенеджерЗаписи.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СостояниеЭДО;
	МенеджерЗаписи.Значение = Статус;
	МенеджерЗаписи.Записать(Истина);	 
	
КонецФункции

///////////////////Процедуры для обновления статусов входящих документов в ЭДО//////////////////
&НаСервере
Функция ПолучитьТаблицуДействийНадПоступлением()
	
	//+Макрушин Е. 18.03.2026 #UT10-5658
	ТаблицаДействий = Новый ТаблицаЗначений;
	ТаблицаДействий.Колонки.Добавить("Действие");
	ТаблицаДействий.Колонки.Добавить("ПредставлениеДействия"); 
	ТаблицаДействий.Колонки.Добавить("Ошибка"); 
	ТаблицаДействий.Колонки.Добавить("Успешно", Новый ОписаниеТипов("Булево"));  
	
	НСтр = ТаблицаДействий.Добавить();   
	НСтр.Действие = "НайтиСоответствие";
	НСтр.ПредставлениеДействия = "Найти соответствующий документ в базе 1С"; 
	
	НСтр = ТаблицаДействий.Добавить();   
	НСтр.Действие = "ПроставитьПризнакПолучен";
	НСтр.ПредставлениеДействия = "Проставить у документа признак Документ получен";  
	
	НСтр = ТаблицаДействий.Добавить();   
	НСтр.Действие = "ПроставитьПризнакВЭлектронномВидеУСчетФактурыПолученной";
	НСтр.ПредставлениеДействия = "Проставить признак 'В электронном виде' у Счет-фактуры полученной";   
	
	Если Константы.АвтоматическиПодписыватьПоступленияЭДО.Получить() Тогда
		
		НСтр = ТаблицаДействий.Добавить();   
		НСтр.Действие = "ПодписатьДокумент";
		НСтр.ПредставлениеДействия = "Подписать документ в ЭДО";
		
	КонецЕсли;
	
	Возврат ТаблицаДействий;
	//-Макрушин Е. 18.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Процедура ОбработатьВходящиеПоступлений(ТаблицаПоступлений, МодульИнтеграции)
	
	//+Макрушин Е. 17.03.2026 #UT10-5658
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыЭДОТребующиеОбработки.Идентификатор
	|ИЗ
	|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
	|ГДЕ
	|	ДокументыЭДОТребующиеОбработки.Идентификатор В(&МассивИдентификаторов)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", ТаблицаПоступлений.ВыгрузитьКолонку("Идентификатор")); 
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаПоиска = ТаблицаПоступлений.Найти(Выборка.Идентификатор, "Идентификатор");
		
		Если СтрокаПоиска <> Неопределено Тогда
			ТаблицаПоступлений.Удалить(СтрокаПоиска);
		КонецЕсли;
			
	КонецЦикла;
	
	Если ТаблицаПоступлений.Количество() > 0 Тогда
		
		ТаблицаПоискаДокументов = Новый ТаблицаЗначений;
		ТаблицаПоискаДокументов.Колонки.Добавить("НомерВходящегоДокумента", Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(30)));
		ТаблицаПоискаДокументов.Колонки.Добавить("ДатаВходящегоДокумента", Новый ОписаниеТипов("Дата"));
		ТаблицаПоискаДокументов.Колонки.Добавить("СуммаСНДС", Новый ОписаниеТипов("Число"));
		ТаблицаПоискаДокументов.Колонки.Добавить("СуммаНДС", Новый ОписаниеТипов("Число"));
		ТаблицаПоискаДокументов.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Число")); 
		ТаблицаПоискаДокументов.Колонки.Добавить("Отправитель", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));   
		ТаблицаПоискаДокументов.Колонки.Добавить("ИдентификаторОтправителя", Новый ОписаниеТипов("Число"));
		
		Для каждого СтрокаТаблицы Из ТаблицаПоступлений Цикл
			
			СтруктураВозврата = МодульИнтеграции.ЭДО_ПолучитьДанныеДокументаJSON(СтрокаТаблицы.Идентификатор);
			
			Если ЗначениеЗаполнено(СтруктураВозврата.Контент) Тогда
				
				Попытка
					
					ДанныеДокумента = СтруктураВозврата.Контент; 
					
					ДанныеТаблицы = ДанныеДокумента.Получить("table").Получить("total"); 
					
					РасхождениеСНДС = 0;
					НДСРасхождения = 0;
					
					СуммаСНДС = Число(ДанныеТаблицы.Получить("totalCostAfterTax"));
					СуммаНДС = Число(ДанныеТаблицы.Получить("totalAmountOfTax"));
					
					НСтр = ТаблицаПоискаДокументов.Добавить();
					НСтр.НомерВходящегоДокумента = СтрокаТаблицы.Номер;
					НСтр.ДатаВходящегоДокумента = СтрокаТаблицы.Дата;
					НСтр.СуммаСНДС = СуммаСНДС;
					НСтр.СуммаНДС = СуммаНДС;     			
					НСтр.Идентификатор = СтрокаТаблицы.Идентификатор; 
					НСтр.Отправитель = СтрокаТаблицы.Отправитель; 
					НСтр.ИдентификаторОтправителя = СтрокаТаблицы.ИдентификаторОтправителя; 
					
					СтрокаТаблицы.ДанныеДокумента = ДанныеДокумента;
					
				Исключение   
					Продолжить;
				КонецПопытки;
				
			КонецЕсли;                                       		                                      
			
		КонецЦикла;  
		
		Если ТаблицаПоискаДокументов.Количество() > 0 Тогда
			
			Запрос = Новый Запрос;
			//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Таблица.НомерВходящегоДокумента,
			|	Таблица.ДатаВходящегоДокумента,
			|	Таблица.СуммаСНДС,
			|	Таблица.СуммаНДС,
			|	Таблица.Идентификатор,
			|	Таблица.Отправитель,
			|	Таблица.ИдентификаторОтправителя
			|ПОМЕСТИТЬ ВТ_Таблица
			|ИЗ
			|	&Таблица КАК Таблица
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДокументыЭДОТребующиеОбработки.Документ КАК Поступление
			|ПОМЕСТИТЬ ВТ_ПоступленияВРегистре
			|ИЗ
			|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
			|ГДЕ
			|	ДокументыЭДОТребующиеОбработки.Документ ССЫЛКА Документ.ПоступлениеТоваровУслуг
			|
			|СГРУППИРОВАТЬ ПО
			|	ДокументыЭДОТребующиеОбработки.Документ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Поступление
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслуг.Ссылка КАК Поступление,
			|	ВТ_Таблица.СуммаСНДС,
			|	ВТ_Таблица.СуммаНДС,
			|	ВТ_Таблица.Идентификатор,
			|	ВТ_Таблица.Отправитель,
			|	ВТ_Таблица.НомерВходящегоДокумента,
			|	ВТ_Таблица.ДатаВходящегоДокумента
			|ПОМЕСТИТЬ ВТ_ПоступленияПоТаблице
			|ИЗ
			|	ВТ_Таблица КАК ВТ_Таблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
			|		ПО ВТ_Таблица.ДатаВходящегоДокумента = ПоступлениеТоваровУслуг.ДатаВходящегоДокумента
			|			И ВТ_Таблица.ИдентификаторОтправителя = ПоступлениеТоваровУслуг.ДоговорКонтрагента.DS_Подразделение_ID
			|			И (ПоступлениеТоваровУслуг.Проведен)
			|			И (ПоступлениеТоваровУслуг.Организация = &Организация)
			|ГДЕ
			|	НЕ ПоступлениеТоваровУслуг.Ссылка В
			|				(ВЫБРАТЬ
			|					ВТ_ПоступленияВРегистре.Поступление
			|				ИЗ
			|					ВТ_ПоступленияВРегистре)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Ссылка КАК Поступление,
			|	СУММА(ВЫБОР
			|			КОГДА ПоступлениеТоваровУслугТовары.Ссылка.СуммаВключаетНДС
			|				ТОГДА ПоступлениеТоваровУслугТовары.Сумма
			|			ИНАЧЕ ПоступлениеТоваровУслугТовары.Сумма + ПоступлениеТоваровУслугТовары.СуммаНДС
			|		КОНЕЦ) КАК СуммаСНДС,
			|	СУММА(ПоступлениеТоваровУслугТовары.СуммаНДС) КАК СуммаНДС
			|ПОМЕСТИТЬ ВТ_СуммыПоПоступлениям
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|ГДЕ
			|	ПоступлениеТоваровУслугТовары.Ссылка В
			|			(ВЫБРАТЬ
			|				ВТ_ПоступленияПоТаблице.Поступление
			|			ИЗ
			|				ВТ_ПоступленияПоТаблице)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугТовары.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ВТ_СуммыПоПоступлениям.Поступление, НЕОПРЕДЕЛЕНО) КАК Поступление,
			|	ВТ_Таблица.Отправитель,
			|	ВТ_Таблица.Идентификатор,
			|	ВТ_Таблица.СуммаНДС,
			|	ВТ_Таблица.СуммаСНДС,
			|	МАКСИМУМ(ВЫБОР
			|			КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|					И ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|					И ВТ_СуммыПоПоступлениям.СуммаНДС = ВТ_Таблица.СуммаНДС
			|				ТОГДА """"
			|			ИНАЧЕ ""Несоответствие"" + ВЫБОР
			|					КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) <> СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|						ТОГДА "" номера входящего документа""
			|					ИНАЧЕ """"
			|				КОНЕЦ + ВЫБОР
			|					КОГДА ВТ_СуммыПоПоступлениям.СуммаСНДС <> ВТ_Таблица.СуммаСНДС
			|						ТОГДА ВЫБОР
			|								КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) <> СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|									ТОГДА "" и""
			|								ИНАЧЕ """"
			|							КОНЕЦ + "" суммы документа (Всего с НДС)""
			|					ИНАЧЕ """"
			|				КОНЕЦ + ВЫБОР
			|					КОГДА ВТ_СуммыПоПоступлениям.СуммаНДС <> ВТ_Таблица.СуммаНДС
			|						ТОГДА ВЫБОР
			|								КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) <> СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|										ИЛИ ВТ_СуммыПоПоступлениям.СуммаСНДС <> ВТ_Таблица.СуммаСНДС
			|									ТОГДА "" и""
			|								ИНАЧЕ """"
			|							КОНЕЦ + "" суммы НДС""
			|					ИНАЧЕ """"
			|				КОНЕЦ
			|		КОНЕЦ) КАК ТекстОшибки,
			|	ВТ_Таблица.НомерВходящегоДокумента КАК Номер,
			|	ВТ_Таблица.ДатаВходящегоДокумента КАК Дата,
			|	ВЫБОР
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|				И ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|				И ВТ_СуммыПоПоступлениям.СуммаНДС = ВТ_Таблица.СуммаНДС
			|			ТОГДА 1
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|				И ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|			ТОГДА 2
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|			ТОГДА 3
			|		ИНАЧЕ 4
			|	КОНЕЦ КАК Приоритет,
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.СтатусПриемки, ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ПустаяССылка)) КАК СтатусПриемки,
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.ДокументПодписан, ЛОЖЬ) КАК ДокументПодписан,
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.ДокументПолучен, ЛОЖЬ) КАК ДокументПолучен
			|ИЗ
			|	ВТ_Таблица КАК ВТ_Таблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыПоПоступлениям КАК ВТ_СуммыПоПоступлениям
			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|				ВТ_СуммыПоПоступлениям.Поступление КАК Поступление,
			|				ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ПустаяССылка)) КАК СтатусПриемки,
			|				ВЫБОР
			|					КОГДА КатегорииОбъектовДокументПодписан.Объект ЕСТЬ NULL
			|						ТОГДА ЛОЖЬ
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ КАК ДокументПодписан,
			|				ВЫБОР
			|					КОГДА КатегорииОбъектовДокументПолучен.Объект ЕСТЬ NULL
			|						ТОГДА ЛОЖЬ
			|					ИНАЧЕ ИСТИНА
			|				КОНЕЦ КАК ДокументПолучен
			|			ИЗ
			|				ВТ_СуммыПоПоступлениям КАК ВТ_СуммыПоПоступлениям
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|					ПО ВТ_СуммыПоПоступлениям.Поступление = ЗначенияСвойствОбъектов.Объект
			|						И (ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусПриемки))
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовДокументПодписан
			|					ПО ВТ_СуммыПоПоступлениям.Поступление = КатегорииОбъектовДокументПодписан.Объект
			|						И (КатегорииОбъектовДокументПодписан.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ДокументПодписан))
			|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектовДокументПолучен
			|					ПО ВТ_СуммыПоПоступлениям.Поступление = КатегорииОбъектовДокументПолучен.Объект
			|						И (КатегорииОбъектовДокументПолучен.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ДокументПолучен))) КАК ЗапросСтатусыПоПоступлениям
			|			ПО ВТ_СуммыПоПоступлениям.Поступление = ЗапросСтатусыПоПоступлениям.Поступление
			|		ПО (СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|				ИЛИ ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|				ИЛИ ВТ_СуммыПоПоступлениям.СуммаНДС = ВТ_Таблица.СуммаНДС)
			|			И ВТ_Таблица.ДатаВходящегоДокумента = ВТ_СуммыПоПоступлениям.Поступление.ДатаВходящегоДокумента
			|			И ВТ_Таблица.ИдентификаторОтправителя = ВТ_СуммыПоПоступлениям.Поступление.ДоговорКонтрагента.DS_Подразделение_ID
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Таблица.Отправитель,
			|	ВТ_Таблица.Идентификатор,
			|	ВТ_Таблица.СуммаНДС,
			|	ВТ_Таблица.СуммаСНДС,
			|	ВТ_Таблица.НомерВходящегоДокумента,
			|	ВТ_Таблица.ДатаВходящегоДокумента,
			|	ВЫБОР
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|				И ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|				И ВТ_СуммыПоПоступлениям.СуммаНДС = ВТ_Таблица.СуммаНДС
			|			ТОГДА 1
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|				И ВТ_СуммыПоПоступлениям.СуммаСНДС = ВТ_Таблица.СуммаСНДС
			|			ТОГДА 2
			|		КОГДА СОКРЛП(ВТ_Таблица.НомерВходящегоДокумента) = СОКРЛП(ВТ_СуммыПоПоступлениям.Поступление.НомерВходящегоДокумента)
			|			ТОГДА 3
			|		ИНАЧЕ 4
			|	КОНЕЦ,
			|	ЕСТЬNULL(ВТ_СуммыПоПоступлениям.Поступление, НЕОПРЕДЕЛЕНО),
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.ДокументПодписан, ЛОЖЬ),
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.ДокументПолучен, ЛОЖЬ),
			|	ЕСТЬNULL(ЗапросСтатусыПоПоступлениям.СтатусПриемки, ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ПустаяССылка))
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет";
			
			Запрос.УстановитьПараметр("Таблица", ТаблицаПоискаДокументов); 
			Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());	
			
			МассивОбработанныхПоступлений = Новый Массив;
			МассивСверенныхИдентификаторов = Новый Массив;
			
			Выборка = Запрос.Выполнить().Выбрать(); 
						
			Пока Выборка.Следующий() Цикл 
				
				ТаблицаДействий = ПолучитьТаблицуДействийНадПоступлением();
				
				Поступление = Выборка.Поступление; 
				
				Если МассивОбработанныхПоступлений.Найти(Поступление) <> Неопределено Тогда
					Продолжить;	
				КонецЕсли;     
				
				Если МассивСверенныхИдентификаторов.Найти(Выборка.Идентификатор) <> Неопределено Тогда
					Продолжить;	
				КонецЕсли;   				
				
				Если Не ЗначениеЗаполнено(Поступление) И (ТекущаяДата() - Выборка.Дата) / 86400 < Константы.КоличествоДнейОжиданияПоступленияЭДО.Получить() Тогда
					
					// не сопоставленные берем после даты из константы
					Продолжить;
					
				ИначеЕсли ЗначениеЗаполнено(Поступление) Тогда
					
					// сопоставленные должны иметь статусы для загрузки	
					Если НЕ ЗначениеЗаполнено(Выборка.СтатусПриемки) 
						ИЛИ Выборка.СтатусПриемки = Перечисления.СтатусыПриемки.ВПути 
						ИЛИ Выборка.ДокументПолучен 
						ИЛИ Выборка.ДокументПодписан Тогда
						
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				ДанныеДокументаЭДО = Неопределено;
				
				СтрокаТаблицыПоступлений = ТаблицаПоступлений.Найти(Выборка.Идентификатор, "Идентификатор");  
				
				Если СтрокаТаблицыПоступлений <> Неопределено Тогда
					ДанныеДокументаЭДО = СтрокаТаблицыПоступлений.ДанныеДокумента;	
				КонецЕсли;
				
				ТекстОшибки = Выборка.ТекстОшибки;
				
				СтруктураВозврата = ИННПокупателяПоступленияСоответствует(ДанныеДокументаЭДО, Поступление);
				
				Если НЕ СтруктураВозврата.Результат Тогда
					ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СтруктураВозврата.Сообщение;	
				КонецЕсли;
				
				МенеджерЗаписи = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
				МенеджерЗаписи.ВидДокумента = "Поступление";
				МенеджерЗаписи.Дата = ТекущаяДата();                             
				
				ДанныеДокументаСтруктура = Новый Структура("Идентификатор, Номер, Дата, СуммаСНДС, СуммаНДС");
				ЗаполнитьЗначенияСвойств(ДанныеДокументаСтруктура, Выборка);      
				
				МенеджерЗаписи.ДатаВходящегоЭДО = ДанныеДокументаСтруктура.Дата;
				МенеджерЗаписи.НомерВходящегоЭДО = ДанныеДокументаСтруктура.Номер;  
	
				Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
					ВыполнитьДействияНадВходящимДокументом(Поступление, ТаблицаДействий, ДанныеДокументаСтруктура, МодульИнтеграции);
				КонецЕсли;
				
				Если ТаблицаДействий.НайтиСтроки(Новый Структура("Успешно", Ложь)).Количество() = 0 Тогда
					МенеджерЗаписи.Отработан = Истина;
				Иначе     	
					
					Если Не ЗначениеЗаполнено(Поступление) Тогда
						МенеджерЗаписи.ТекстОшибки = "Не найден документ соответствия";	
					ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда	
						МенеджерЗаписи.ТекстОшибки = ТекстОшибки;	
					Иначе
						
						Для каждого СтрДействие Из ТаблицаДействий Цикл     
							
							Если СтрДействие.Успешно Тогда
								Продолжить;	
							КонецЕсли;
							
							МенеджерЗаписи.ТекстОшибки = СтрДействие.Ошибка;	
							
							Прервать;
							
						КонецЦикла;
						
					КонецЕсли;
					
				КонецЕсли; 
				
				//СтруктураВозврата = КПППокупателяПоступленияСоответствует(ДанныеДокументаЭДО, Поступление);
				//
				//Если НЕ СтруктураВозврата.Результат Тогда
				//	ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + СтруктураВозврата.Сообщение;	
				//	МенеджерЗаписи.ТекстОшибки = ТекстОшибки;	
				//КонецЕсли;
				
				МенеджерЗаписи.Документ = Поступление;  
				
				Если ЗначениеЗаполнено(Выборка.Поступление) Тогда 
					
					МенеджерЗаписи.Контрагент = Выборка.Поступление.Контрагент;
					МенеджерЗаписи.Договор = Выборка.Поступление.ДоговорКонтрагента; 
					
				ИначеЕсли ЗначениеЗаполнено(Выборка.Отправитель) Тогда 
					//+Гавриленков В. 15.04.2026 #UT10-5830
					//МенеджерЗаписи.Контрагент = Выборка.Отправитель.Контрагент;
					МенеджерЗаписи.Контрагент = Выборка.Отправитель.Владелец;
					//-Гавриленков В. 15.04.2026 #UT10-5830
				КонецЕсли; 
				
				МенеджерЗаписи.ДанныеДокумента = ЗначениеВСтрокуВнутр(ДанныеДокументаСтруктура);
				МенеджерЗаписи.Действия = ЗначениеВСтрокуВнутр(ТаблицаДействий);
				МенеджерЗаписи.Записать(Истина);      
				
				МассивОбработанныхПоступлений.Добавить(Поступление);   
				МассивСверенныхИдентификаторов.Добавить(Выборка.Идентификатор);
					
			КонецЦикла;         			
			
		КонецЕсли;
				
	КонецЕсли;                                           
	//-Макрушин Е. 17.03.2026 #UT10-5658
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьДействияНадВходящимДокументомИзУправляемойФормы(Документ, ТаблицаДействий, ДанныеДокумента, ВидДокумента = Неопределено) Экспорт
	
	ВыполнитьДействияНадВходящимДокументом(Документ, ТаблицаДействий, ДанныеДокумента,, ВидДокумента);
	
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьДействияНадВходящимДокументом(Документ, ТаблицаДействий, ДанныеДокумента, МодульИнтеграции = Неопределено, ВидДокумента = Неопределено) Экспорт
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	//+Белов А. 28.09.2026 #UT10-6070 добавил ИЛИ ВидДокумента = "Транспортная накладная" 
	Если ЗначениеЗаполнено(Документ) ИЛИ ВидДокумента = "Транспортная накладная" Тогда 
		
		Для каждого СтрДействия Из ТаблицаДействий Цикл
			
			Если СтрДействия.Успешно Тогда
				Продолжить;				
			КонецЕсли;
			
			Попытка	
				
				Если СтрДействия.Действие = "НайтиСоответствие" Тогда 
					
					//Если передан Документ, то действие автоматически успешное!
					
				ИначеЕсли СтрДействия.Действие = "ПроставитьВходящиеДанные" Тогда				
					
					ОбДокумент = Документ.ПолучитьОбъект();
					ОбДокумент.НомерВходящегоДокумента = ДанныеДокумента.Номер;
					ОбДокумент.ДатаВходящегоДокумента = ДанныеДокумента.Дата;   
					ОбДокумент.ОбменДанными.Загрузка = Истина;			
					ОбДокумент.Записать(); 	  				
					
				ИначеЕсли СтрДействия.Действие = "ПроставитьПризнакПолучен" Тогда	
					
					ПроставитьПризнакПолученУДокумента(Документ);      
					
				//+Белов А. 28.09.2026 #UT10-6070
				ИначеЕсли СтрДействия.Действие = "СоздатьТитул3" Тогда
					
					СтруктураВозврата = ОтправитьВходящийДокументНаПодпись(ДанныеДокумента.Идентификатор, Документы.ТранспортнаяНакладная.ПустаяСсылка(), МодульИнтеграции, ДанныеДокумента);  
					
					Если НЕ СтруктураВозврата.Результат Тогда
						ВызватьИсключение СтруктураВозврата.Сообщение;						
					КонецЕсли;  
				//-Белов А. 28.09.2026 #UT10-6070
					
				ИначеЕсли СтрДействия.Действие = "ПодписатьДокумент" Тогда
					
					СтатусПриемкиПоДокументу = МСКWEB.ЗначениеДопСвойства(Документ, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
					ДокументПолучен = Справочники.КатегорииОбъектов.КатегорияОбъектаУстановлена(Документ, Справочники.КатегорииОбъектов.ДокументПолучен);
					ДокументПодписан = Справочники.КатегорииОбъектов.КатегорияОбъектаУстановлена(Документ, Справочники.КатегорииОбъектов.ДокументПодписан);
					
					Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
						И ЗначениеЗаполнено(СтатусПриемкиПоДокументу) И СтатусПриемкиПоДокументу <> Перечисления.СтатусыПриемки.ВПути
						И ДокументПолучен
						И НЕ ДокументПодписан Тогда
						
						//+Макрушин Е. 02.04.2026 #UT11-5849
						ИнициализированМодульИнтеграции = Ложь;
						//-Макрушин Е. 02.04.2026 #UT11-5849
						
						Если МодульИнтеграции = Неопределено Тогда
			
							Если Константы.ЭДО_ОбновлятьСтатусыПоРезервномуАдресу.Получить() Тогда
								СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции(Истина);                 
							Иначе
								СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции();                 
							КонецЕсли;
							
							Если СтруктураВозвратаМодуля.Результат Тогда
								МодульИнтеграции = СтруктураВозвратаМодуля.МодульИнтеграции;
							Иначе
								
								ТекОшибка = "Не удалось инициировать модуль интеграции DiState при отправке на документа подпись. " + Символы.ПС + СтруктураВозвратаМодуля.Сообщение;
								ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, ТекОшибка);
								ВызватьИсключение ТекОшибка; 
								
							КонецЕсли;
							
							//+Макрушин Е. 02.04.2026 #UT11-5849
							ИнициализированМодульИнтеграции = Истина;
							//-Макрушин Е. 02.04.2026 #UT11-5849
						КонецЕсли;
						
						СтруктураВозврата = ОтправитьВходящийДокументНаПодпись(ДанныеДокумента.Идентификатор, Документ, МодульИнтеграции);   
						
						//+Макрушин Е. 02.04.2026 #UT11-5849
						Если ИнициализированМодульИнтеграции Тогда
							МодульИнтеграции = Неопределено;
						КонецЕсли;
						//-Макрушин Е. 02.04.2026 #UT11-5849
						
						Если НЕ СтруктураВозврата.Результат Тогда
							ВызватьИсключение СтруктураВозврата.Сообщение;						
						КонецЕсли;
						
					Иначе
						Продолжить;
					КонецЕсли;
					
				ИначеЕсли СтрДействия.Действие = "ПроставитьПризнакВЭлектронномВидеУСчетФактурыПолученной" Тогда
					
					СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(Документ, "СчетФактураПолученный",, Истина);
					
					Если ЗначениеЗаполнено(СчетФактура) Тогда
						
						СчетФактураОбъект = СчетФактура.ПолучитьОбъект();
						СчетФактураОбъект.ОбменДанными.Загрузка = Истина;
						СчетФактураОбъект.КодСпособаПолучения = 2; 						
						СчетФактураОбъект.Записать();
						
					Иначе
						ВызватьИсключение "Не найден СФ полученный по " + Документ;
					КонецЕсли;
					
				КонецЕсли;
				
				СтрДействия.Успешно = Истина;
				СтрДействия.Ошибка = "";
				
			Исключение      
				
				Инфо = ИнформацияОбОшибке();
				
				Если Инфо.Причина <> Неопределено Тогда		
					ТекстОшибки = ОписаниеОшибки();    		
				Иначе		
					ТекстОшибки = Инфо.Описание;		
				КонецЕсли;
					
				СтрДействия.Ошибка = ТекстОшибки;  
				
				Прервать;  
				
			КонецПопытки;    
			
		КонецЦикла;		
				
	КонецЕсли;         
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецПроцедуры  

&НаСервере
Процедура ОбработатьВходящиеТН_Грузополучатель(ТаблицаТН, МодульИнтеграции)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыЭДОТребующиеОбработки.Идентификатор
	|ИЗ
	|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
	|ГДЕ
	|	ДокументыЭДОТребующиеОбработки.Идентификатор В(&МассивИдентификаторов)
	|	И ДокументыЭДОТребующиеОбработки.Титул = ""3""";
	
	Запрос.УстановитьПараметр("МассивИдентификаторов", ТаблицаТН.ВыгрузитьКолонку("Идентификатор")); 
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Пока Выборка.Следующий() Цикл 
		
		СтрокаПоиска = ТаблицаТН.Найти(Выборка.Идентификатор, "Идентификатор");
		
		Если СтрокаПоиска <> Неопределено Тогда
			ТаблицаТН.Удалить(СтрокаПоиска);
		КонецЕсли;      
			
	КонецЦикла;
	
	Если ТаблицаТН.Количество() > 0 Тогда 
		
		ТаблицаДействий = ПолучитьТаблицуДействийНадТН();
		
		Для каждого Выборка Из ТаблицаТН Цикл
			
			МенеджерЗаписи = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Идентификатор = Выборка.Идентификатор;
			МенеджерЗаписи.ВидДокумента = "Транспортная накладная";
			МенеджерЗаписи.Дата = ТекущаяДата();                             		
			МенеджерЗаписи.ДатаВходящегоЭДО = Выборка.Дата;
			МенеджерЗаписи.НомерВходящегоЭДО = Выборка.Номер; 
			МенеджерЗаписи.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Отправитель, "Владелец");
			МенеджерЗаписи.Договор = Выборка.Отправитель; 
			МенеджерЗаписи.Титул = "3";
			
			ДанныеДокументаСтруктура = ПолучитьДанныеВходящейТН(Выборка.Идентификатор, МодульИнтеграции);
			
			Если Не ЗначениеЗаполнено(МенеджерЗаписи.Договор) Тогда
				МенеджерЗаписи.ТекстОшибки = "Не найден грузоотправитель.";
			КонецЕсли;
			
			МенеджерЗаписи.ДанныеДокумента = ЗначениеВСтрокуВнутр(ДанныеДокументаСтруктура);
			МенеджерЗаписи.Действия = ЗначениеВСтрокуВнутр(ТаблицаДействий);
			МенеджерЗаписи.Записать(Истина);
			
		КонецЦикла;
				
	КонецЕсли;                                           
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьТаблицуДействийНадТН()
	
	ТаблицаДействий = Новый ТаблицаЗначений;
	ТаблицаДействий.Колонки.Добавить("Действие");
	ТаблицаДействий.Колонки.Добавить("ПредставлениеДействия"); 
	ТаблицаДействий.Колонки.Добавить("Ошибка"); 
	ТаблицаДействий.Колонки.Добавить("Успешно", Новый ОписаниеТипов("Булево"));  
	
	НСтр = ТаблицаДействий.Добавить();   
	НСтр.Действие = "СоздатьТитул3";
	НСтр.ПредставлениеДействия = "Создать титул 3 (грузополучателя)";
	
	Возврат ТаблицаДействий;
	
КонецФункции


&НаСервере
Функция ПолучитьДанныеВходящейТН(Знач пИдентификатор, пМодульИнтеграции)

	ТекРезультат = Новый Структура("Идентификатор", пИдентификатор);
	
	ТекКоличествоМест = 0;
	ТекВес = 0;
	ТекСуммаГруза = 0;
	
	ТекСлужебныеДанные = Новый Структура;
	
	ТекСведенияОГрузоотправителе = Неопределено;
	ТекСведенияОПеревозчике = Неопределено;
	ТекСведенияОЗаказчике = Неопределено;
	ТекСведенияАдресДоставки = Неопределено;
	ТекСведенияГруз = Неопределено; 
	ТекСведенияСопрДокументы = Неопределено;
	
	ТекОтвет = пМодульИнтеграции.ЭДО_ПолучитьДанныеДокументаJSON(пИдентификатор);
	
	Если ЗначениеЗаполнено(ТекОтвет.Контент) Тогда
		
		Если ТипЗнч(ТекОтвет.Контент) = Тип("Соответствие") Тогда
			
			Текwaybill = ТекОтвет.Контент.Получить("waybill");
			
			Если ТипЗнч(Текwaybill) = Тип("Соответствие") Тогда
				
				ТекКоличествоМест = Текwaybill.Получить("placesCount");
				
				ТекВес = Текwaybill.Получить("grossWeight");
				
				ТекСуммаГруза = Текwaybill.Получить("cargoValue"); 
				
				ТекСведенияОГрузоотправителе = Текwaybill.Получить("consignor");
				ТекСведенияОПеревозчике = Текwaybill.Получить("carrier");
				ТекСведенияОЗаказчике = Текwaybill.Получить("consignee"); 
				
				ТекСведенияГруз = Текwaybill.Получить("cargo");
				ТекСведенияСопрДокументы = Текwaybill.Получить("accompanyingDocuments");
				
				ТекСведенияАдресДоставки = Новый Структура("АдрТекст, АдрСтруктура", ТекСведенияОЗаказчике.Получить("address"), Неопределено);
								
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	ТекРезультат.Вставить("КоличествоМест", ТекКоличествоМест);
	ТекРезультат.Вставить("Вес", ТекВес);
	ТекРезультат.Вставить("СуммаГруза", ТекСуммаГруза);
	
	Если ЗначениеЗаполнено(ТекСведенияАдресДоставки) Тогда                      
		
		Если ТекСведенияАдресДоставки.АдрСтруктура <> Неопределено Тогда
			ТекРезультат.Вставить("АдресДоставки", ТекСведенияАдресДоставки.АдрСтруктура);			
		Иначе
			ТекРезультат.Вставить("АдресДоставки", ТекСведенияАдресДоставки.АдрТекст);		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекСведенияОГрузоотправителе) Тогда
		
		ТекРезультат.Вставить("ГрузоотправительИНН", ТекСведенияОГрузоотправителе.Получить("inn"));
		ТекРезультат.Вставить("ГрузоотправительНаименование", ТекСведенияОГрузоотправителе.Получить("name"));
		
		Если ЗначениеЗаполнено(ТекСведенияОГрузоотправителе.Получить("kpp")) Тогда
			ТекРезультат.Вставить("ГрузоотправительКПП", ТекСведенияОГрузоотправителе.Получить("kpp"));    
		КонецЕсли;
	
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекСведенияОПеревозчике) Тогда
		
		ТекРезультат.Вставить("ПеревозчикИНН", ТекСведенияОПеревозчике.Получить("inn"));
		ТекРезультат.Вставить("ПеревозчикНаименование", ТекСведенияОПеревозчике.Получить("name"));
		
		Если ЗначениеЗаполнено(ТекСведенияОПеревозчике.Получить("kpp")) Тогда
			ТекРезультат.Вставить("ПеревозчикКПП", ТекСведенияОПеревозчике.Получить("kpp"));	
		КонецЕсли; 	
	
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекСведенияОЗаказчике) Тогда
		
		ТекРезультат.Вставить("ЗаказчикИНН", ТекСведенияОЗаказчике.Получить("inn"));
		ТекРезультат.Вставить("ЗаказчикНаименование", ТекСведенияОЗаказчике.Получить("name"));
		
		Если ЗначениеЗаполнено(ТекСведенияОЗаказчике.Получить("kpp")) Тогда
			ТекРезультат.Вставить("ЗаказчикКПП", ТекСведенияОЗаказчике.Получить("kpp")); 
		КонецЕсли;
	
	КонецЕсли;   
	
	Если ЗначениеЗаполнено(ТекСведенияГруз) Тогда 	
		ТекРезультат.Вставить("Груз", ТекСведенияГруз);	
	КонецЕсли;    
	
	Если ЗначениеЗаполнено(ТекСведенияСопрДокументы) Тогда
		ТекРезультат.Вставить("СопроводительныеДокументы", ТекСведенияСопрДокументы);		
	КонецЕсли;
		
	Возврат ТекРезультат;
	
КонецФункции 

&НаСервере
Функция ИННПокупателяПоступленияСоответствует(ДанныеДокументаЭДО, Документ)
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, ""); 
	
	Если ДанныеДокументаЭДО = Неопределено ИЛИ Не ЗначениеЗаполнено(Документ) Тогда
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	Инвойс = ДанныеДокументаЭДО["invoice"];
	
	Если ТипЗнч(Инвойс) = Тип("Соответствие") Тогда
		
		Покупатели = Инвойс.Получить("buyers");     
		
		Если ТипЗнч(Покупатели) = Тип("Массив") Тогда
			
			Для каждого СтрПокупатель Из Покупатели Цикл 
				
				ИНН = СтрПокупатель.Получить("inn");  
				
				Если ИНН <> Документ.Организация.ИНН Тогда
					
					СтруктураВозврата.Сообщение = "ИНН организации документа не соответствует ИНН покупателя (" + ИНН + ") в УПД";
					СтруктураВозврата.Результат = Ложь;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Функция КПППокупателяПоступленияСоответствует(ДанныеДокументаЭДО, Документ) 
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Истина, "");
	
	Если ДанныеДокументаЭДО = Неопределено ИЛИ Не ЗначениеЗаполнено(Документ) Тогда
		Возврат СтруктураВозврата;	
	КонецЕсли;
	
	Инвойс = ДанныеДокументаЭДО["invoice"];
	
	Если ТипЗнч(Инвойс) = Тип("Соответствие") Тогда
		
		Покупатели = Инвойс.Получить("buyers");    
		
		Если ТипЗнч(Покупатели) = Тип("Массив") Тогда
			
			Для каждого СтрПокупатель Из Покупатели Цикл 
				
				КПП = СтрПокупатель.Получить("kpp");  
				
				Если КПП <> Документ.Организация.КПП Тогда
					
					СтруктураВозврата.Сообщение = "КПП организации документа не соответствует КПП покупателя (" + КПП + ") в УПД";
					СтруктураВозврата.Результат = Ложь;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;	 
	
	Возврат СтруктураВозврата;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Функция ОтправитьВходящийДокументНаПодпись(Идентификатор, Документ, МодульИнтеграции, ДанныеДокумента = Неопределено) Экспорт
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Если МодульИнтеграции = Неопределено Тогда
		
		СтруктураВозвратаМодуля = ПолучитьМодульИнтеграции();  
		
		Если СтруктураВозвратаМодуля.Результат Тогда
			МодульИнтеграции = СтруктураВозвратаМодуля.МодульИнтеграции;
		Иначе
			
			СтруктураВозврата.Сообщение = СтруктураВозвратаМодуля.Сообщение;
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Ссылка", Документ);
	СтруктураДанных.Вставить("Идентификатор", Идентификатор);
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		СтруктураДанных.Вставить("Тип", "Универсальный корректировочный документ");
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		СтруктураДанных.Вставить("Тип", "УПД");  
	//+Белов А. 28.09.2026 #UT10-6070
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда
		СтруктураДанных.Вставить("Тип", "Транспортная накладная");
		СтруктураДанных.Ссылка = ДанныеДокумента;		
	//-Белов А. 28.09.2026 #UT10-6070
	Иначе
		ВызватьИсключение "Для данного типа документа не поддерживается подписание";
	КонецЕсли; 
	
	Результат = МодульИнтеграции.СоздатьXMLКвитанциюОПриемеИВернутьДляПодписания(СтруктураДанных);  
	
	Если Результат <> Неопределено И Результат.Получить("success") <> Неопределено И Результат.Получить("success") Тогда
		
		СтрокаКонтента = Результат.Получить("content"); 
		
		РезультатПодписания = МодульИнтеграции.ОтправитьПодписаннуюКвитанцию(Идентификатор, СтрокаКонтента, "", "Принять"); 
		
		Если РезультатПодписания <> Неопределено И РезультатПодписания.Получить("success") <> Неопределено И РезультатПодписания.Получить("success") Тогда 
			
			СтруктураВозврата.Результат = Истина; 
			
			//+Белов А. 28.09.2026 #UT10-6070			
			Если ЗначениеЗаполнено(Документ) Тогда
			//-Белов А. 28.09.2026 #UT10-6070
				
				ДопСвойство = ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("DS_Документ_ID");
				
				Если ДопСвойство <> Неопределено Тогда
					МСКWEB.УстановитьЗначениеДопСвойства(Документ, ДопСвойство, Идентификатор);
				КонецЕсли;	
				
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
					РезультатУстановкиДокументПодписан = Справочники.КатегорииОбъектов.УстановитьКатегориюОбъекта(Документ, Справочники.КатегорииОбъектов.ДокументПодписан);
				КонецЕсли;	
				
				ЗаписатьИсториюОбменаЭДО(Документ, Перечисления.СтатусыОбменаЭДО.Подписан, "", "Успешно подписан входящий документ");
				
			КонецЕсли;
			
		Иначе   							
			
			СтруктураВозврата.Сообщение = ПолучитьТекстОшибкиИзРезультата(РезультатПодписания);	
			
		КонецЕсли; 
		
	Иначе					
		
		СтруктураВозврата.Сообщение = ПолучитьТекстОшибкиИзРезультата(Результат);	
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Процедура ПроставитьПризнакПолученУДокумента(Документ)
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		РезультатУстановкиДокументПолучен = Справочники.КатегорииОбъектов.УстановитьКатегориюОбъекта(Документ, Справочники.КатегорииОбъектов.ДокументПолучен);
		
		Если НЕ РезультатУстановкиДокументПолучен.ВыполненоУспешно Тогда
			
			СтрокаОшибка = "Ошибка при установке категории ДокументПолучен " + РезультатУстановкиДокументПолучен.ОписаниеОшибки;     
			ВызватьИсключение СтрокаОшибка;
			
		КонецЕсли;
		
	КонецЕсли; 	
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецПроцедуры

///////////////////Процедуры общие///////////////////
&НаСервере
Функция ЗаписатьИсториюОбменаЭДО(Объект, Статус, Ошибка = "", Комментарий = "", ЗаписыватьОшибкиВЖурнал = Ложь, ПрибавитьКПериоду = 0) Экспорт
	
	Менеджер = РегистрыСведений.ИсторияОбменовЭДО.СоздатьМенеджерЗаписи();
	Менеджер.Период = ТекущаяДата() + ПрибавитьКПериоду;
	Менеджер.Объект = Объект;
	Менеджер.Статус = Статус;
	Менеджер.Ошибка = Ошибка;
	Менеджер.Комментарий = Комментарий;
	Менеджер.Записать(Истина);       
	
	Если Статус = Перечисления.СтатусыОбменаЭДО.Подготовка Тогда		
		ЗаписатьСостояниеЭДО(Объект, Перечисления.СостояниеЭДО.ВПроцессеОтправки);		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ошибка) Тогда
		
		Если ЗаписыватьОшибкиВЖурнал Тогда
			ЗаписьЖурналаРегистрации("ЭДО.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка при переводе документа " + Объект +  " в статус: " + Строка(Статус) + Символы.ПС + Ошибка);		
		КонецЕсли;         
		
	Иначе
		
		Если (Объект.Метаданные().Имя = "РеализацияТоваровУслуг" ИЛИ Объект.Метаданные().Имя = "КорректировкаРеализации")
			И Не ЗначениеЗаполнено(Ошибка) Тогда  
			
			Если (Статус = Перечисления.СтатусыОбменаЭДО.Завершен И (Комментарий = "Документооборот завершен" ИЛИ Комментарий = "Документ отклонен" ИЛИ Комментарий = "annulled"))
				ИЛИ (Статус = Перечисления.СтатусыОбменаЭДО.Отправка И Найти(Комментарий, "Документ успешно отправлен") > 0)
				ИЛИ Статус = Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования И Найти(Комментарий, "Квитанция для аннулирования была успешно отправлена") > 0 Тогда	
				ОбновитьСтатусДокументаЭДО(Объект, Комментарий); 
			КонецЕсли; 
			
			//+Белов А. 18.11.2024 #
			Если Менеджер.Статус = Перечисления.СтатусыОбменаЭДО.Завершен 
				ИЛИ Менеджер.Статус = Перечисления.СтатусыОбменаЭДО.Отправка
				ИЛИ Менеджер.Статус = Перечисления.СтатусыОбменаЭДО.ОжидаетПодписания
				ИЛИ Менеджер.Статус = Перечисления.СтатусыОбменаЭДО.ОтправкаАннулирования
				ИЛИ Менеджер.Статус = Перечисления.СтатусыОбменаЭДО.ОжидаетПодписанияАннулирования Тогда
				AMQP_РаботаСДокументами_ver2.СформироватьСообщениеСостояниеЭДО(Объект, Менеджер);				
			КонецЕсли;   
			//-Белов А. 18.11.2024 # 
			
			//+Белов А. 03.09.2026 #UT10-6035 
		ИначеЕсли Объект.Метаданные().Имя = "ЗаказЗаявка" Тогда			
			
			Если (Статус = Перечисления.СтатусыОбменаЭДО.Завершен И (Комментарий = "Документооборот завершен" ИЛИ Комментарий = "Документ отклонен" ИЛИ Комментарий = "annulled"))
				ИЛИ (Статус = Перечисления.СтатусыОбменаЭДО.Отправка И Найти(Комментарий, "Документ успешно отправлен") > 0) Тогда  
				ОбновитьСтатусДокументаЭДО(Объект, Комментарий); 
			КонецЕсли;         	
			
			Если ТипЗнч(Объект.Организация) = Тип("СправочникСсылка.Контрагенты") И Статус = Перечисления.СтатусыОбменаЭДО.Завершен Тогда
				AMQP_РаботаСДокументами_ver2.СформироватьСообщениеЗаказЗаявка(Объект, Менеджер);	
			КонецЕсли;					
	
		ИначеЕсли Объект.Метаданные().Имя = "ТранспортнаяНакладная" Тогда
			
			Если (Статус = Перечисления.СтатусыОбменаЭДО.Завершен И (Комментарий = "Документооборот завершен" ИЛИ Комментарий = "Документ отклонен" ИЛИ Комментарий = "annulled"))
				ИЛИ (Статус = Перечисления.СтатусыОбменаЭДО.Отправка И Найти(Комментарий, "Документ успешно отправлен") > 0) Тогда
				ОбновитьСтатусДокументаЭДО(Объект, Комментарий); 			
			КонецЕсли;
					
		//-Белов А. 03.09.2026 #UT10-6035			
		КонецЕсли;		
	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстОшибкиИзРезультата(Результат) Экспорт
	
	//+Макрушин Е. 19.03.2026 #UT10-5658
	ТекстОшибки = ""; 
	
	Если ЗначениеЗаполнено(Результат) И ТипЗнч(Результат) = Тип("Соответствие") Тогда
		
		Если Результат.Получить("details") <> Неопределено Тогда
			ТекстОшибки = Результат.Получить("details");		
		КонецЕсли;   
		
		Если Результат.Получить("codeDescription") <> Неопределено Тогда
			
			ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + Результат.Получить("codeDescription");	
			
			Если Результат.Получить("code") <> Неопределено Тогда
				ТекстОшибки = ТекстОшибки + " (код " + Результат.Получить("code") + ")";		
			КонецЕсли;  
			
		КонецЕсли;   
		
		//+Белов А. 28.09.2026 #UT10-6070
		Если Не ЗначениеЗаполнено(ТекстОшибки) И Результат.Получить("error") <> Неопределено Тогда
			ТекстОшибки = Результат.Получить("error");	
		КонецЕсли; 
		//-Белов А. 28.09.2026 #UT10-6070
		
	Иначе
		
		ТекстОшибки = "Не заполнена структура результата"	
		
	КонецЕсли; 
	
	Возврат ТекстОшибки;
	//-Макрушин Е. 19.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Функция ПолучитьМодульИнтеграции(Резерв = Ложь)
	
	//+Макрушин Е. 17.03.2026 #UT10-5658
	СтруктураВозврата = Новый Структура("Результат, Сообщение, МодульИнтеграции", Ложь, "", Неопределено);
	
	МодульИнтеграции = Обработки.МодульИнтеграцииDiState.Создать();
	
	Если Резерв Тогда
		ПараметрыВозврата = МодульИнтеграции.АвторизацияПоЛогинуИПаролю(Константы.ЭДО_Адрес_Резерв.Получить(), Константы.ЭДО_Логин_Резерв.Получить(), Константы.ЭДО_Пароль_Резерв.Получить());
	Иначе
		ПараметрыВозврата = МодульИнтеграции.АвторизацияПоЛогинуИПаролю(Константы.ЭДО_Адрес.Получить(), Константы.ЭДО_Логин.Получить(), Константы.ЭДО_Пароль.Получить());
	КонецЕсли;
	
	Если ПараметрыВозврата.ОшибкаАвторизации Тогда
		
		СтруктураВозврата.Сообщение = ПараметрыВозврата.ТекстОшибки; 
		Возврат СтруктураВозврата;
		
	КонецЕсли; 
	
	ПараметрыВозврата = МодульИнтеграции.ЗакончитьПроцессАвторизации(ПараметрыВозврата); 
	
	Если ПараметрыВозврата.Свойство("ОтпечатокСертификата") И ЗначениеЗаполнено(ПараметрыВозврата.ОтпечатокСертификата) Тогда
		МодульИнтеграции.ОтпечатокСертификата = ПараметрыВозврата.ОтпечатокСертификата;		
	Иначе
		
		СтруктураВозврата.Сообщение = "Не заполнен отпечаток сертификата при подключении к DiState"; 
		Возврат СтруктураВозврата;
		
	КонецЕсли;
	
	МодульИнтеграции.ВерсияСервера = 6; 
	
	МодульИнтеграции.Организация = Константы.ОсновнаяОрганизация.Получить(); 
	
	СтруктураВозврата.МодульИнтеграции = МодульИнтеграции; 
	
	СтруктураВозврата.Результат = Истина;
	
   	Возврат СтруктураВозврата;
	//-Макрушин Е. 17.03.2026 #UT10-5658
	
КонецФункции

&НаСервере
Функция ПолучитьЗначениеАтрибутаДОМ(Знач пЭлементДОМ, Знач пИмяАтрибута)
//+Бычков О. 07.09.2026 #UT11-6030
// Вставка
	
	ТекРезультат = Неопределено;
	
	Если ТипЗнч(пЭлементДОМ) = Тип("ЭлементDOM") Тогда
		
		ТекАтрибут = пЭлементДОМ.Атрибуты.ПолучитьИменованныйЭлемент(пИмяАтрибута);
		
		Если ТипЗнч(ТекАтрибут) = Тип("АтрибутDOM") Тогда
			ТекРезультат = ТекАтрибут.Значение;
		КонецЕсли;

	КонецЕсли;
	
	Возврат ТекРезультат;
	
//-Бычков О. 07.09.2026 #UT11-6030	
КонецФункции

&НаСервере
Функция ПолучитьДОМИзТекстаXML(пТекстXML)

	ЧтениеXML = Новый ЧтениеXML;
	
	ЧтениеXML.УстановитьСтроку(пТекстXML);
	
	ТекПостроительDOM = Новый ПостроительDOM;
	
	ТекРезультат = ТекПостроительDOM.Прочитать(ЧтениеXML);
	
	Возврат ТекРезультат;

КонецФункции

&НаСервере
Функция ПолучитьДОМИсходногоXML(пXMLВBase64)

	ТекРезультат = Неопределено;
	
	ТекТекстXML = ПолучитьТекстИсходногоXML(пXMLВBase64);

	Если ЗначениеЗаполнено(ТекТекстXML) Тогда
		ТекРезультат = ПолучитьДОМИзТекстаXML(ТекТекстXML);
	КонецЕсли;
	
	Возврат ТекРезультат;

КонецФункции 

&НаСервере
Функция ПолучитьТекстИсходногоXML(пXMLВBase64)

    ТекРезультат = Неопределено;
	
	Если ЗначениеЗаполнено(пXMLВBase64) Тогда
		
		ТекДвоичныйXML = Base64Значение(пXMLВBase64);
		
		ТекТекстовыйДокумент = Новый ТекстовыйДокумент;
		
		ТекТекстовыйДокумент.Прочитать(ТекДвоичныйXML.ОткрытьПотокДляЧтения());
		
		ТекРезультат = ТекТекстовыйДокумент.ПолучитьТекст();
		
	КонецЕсли;

	Возврат ТекРезультат;

КонецФункции


