Функция Печать(Объединение, ТЕ, СразуНаПринтер = Истина, ВернутьДокумент = Ложь, Принтер = "") Экспорт

	Если НЕ ТЕ.Проведен Тогда
		
		Сообщить("Документ Транспортная единица не проведен !");
		Возврат Неопределено;  
		
	КонецЕсли;
	
	Если СразуНаПринтер Тогда
		
		Принтер = ПолучитьИмяПринтераЭтикеток();
		
		Если Не ЗначениеЗаполнено(Принтер) Тогда
			
			Сообщить("В базе не настроен принтер этикеток для текущего рабочего места");
			Возврат Неопределено; 
			
		КонецЕсли;
		
	КонецЕсли;     
	
	Грузополучатель = ТЕ.Объединение.Грузополучатель;
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	
	База = Константы.База.Получить();
	
	//Если База = Перечисления.НазваниеБазы.Казань Тогда
		Макет = Документы.ТранспортнаяЕдиница.ПолучитьМакет("ТЕ_9х20");
	//Иначе
	//	Макет = Документы.ТранспортнаяЕдиница.ПолучитьМакет("ТЕ_А4");
	//КонецЕсли;
		
	ТабличныйДокумент.КлючПараметровПечати = "Печать_Этикеток_ТЕ";	
	ОбластьШтрихкода = Макет.ПолучитьОбласть("Штрихкод");	

	ОбластьШтрихкода.Параметры.Транзит = ?(Грузополучатель.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка И Грузополучатель.ТранзитЧерезТомилино, "ТРАНЗИТ", "");
	ОбластьШтрихкода.Параметры.Маршрут = Грузополучатель.МаршрутДоставки;
	ОбластьШтрихкода.Параметры.Получатель = Грузополучатель;			
	ОбластьШтрихкода.Параметры.ДатаДокумента = Формат(ТЕ.Дата, "ДФ=dd.MM.yyyy");
	ОбластьШтрихкода.Параметры.АдресДоставки = МСК.ПолучитьАдресДоставки(Грузополучатель);
	ОбластьШтрихкода.Параметры.Отправитель = Строка(Константы.ОсновнаяОрганизация.Получить()) + " (" + Строка(Константы.База.Получить()) + ")";
	//+Гавриленков В. 07.05.2025 #UT10-5230 Добавлен "Срочный Транзит"
	ОбластьШтрихкода.Параметры.НомерТЕ = "№ТЕ:" + Прав(ТЕ.Номер, 6) + Символы.ПС + "СРОЧНЫЙ ТРАНЗИТ"; 
	ОбластьШтрихкода.Параметры.ВесТЕ = "Вес:" + Формат(ТЕ.ГрузовыеМеста.Итог("Вес"), "ЧРД=,; ЧРГ=; ЧН='Не введено'") + " кг.";
	
	ОбластьШтрихкода.Рисунки.КартинкаШтрихкода.Картинка = ШтрихкодированиеПечатныхФорм.ПолучитьКартинкуШКДляРисунка(ОбластьШтрихкода.Рисунки.КартинкаШтрихкода, ТЕ.Штрихкод, 4, Истина, 21);
	
	ТабличныйДокумент.ПолеСлева = 2;
	ТабличныйДокумент.ПолеСправа = 2;
	ТабличныйДокумент.Вывести(ОбластьШтрихкода);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПринтера = Принтер;
	
	Если ВернутьДокумент Тогда  	
		Возврат ТабличныйДокумент;		
	Иначе
		
		Если СразуНаПринтер Тогда
			ТабличныйДокумент.Напечатать(); 
		Иначе
			ТабличныйДокумент.Показать();
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьИмяПринтераЭтикеток()  
	
	//+Гавриленков В. 05.04.2025 #
	НаименованиеПринтера = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиПринтеровПечати, "Печать ТЕ");
	
	Если Не НаименованиеПринтера = Неопределено Тогда
		Возврат НаименованиеПринтера;
	КонецЕсли;
	//-Гавриленков В. 05.04.2025 #
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РабочиеМестаОборудование.Значение
	                      |ИЗ
	                      |	Справочник.РабочиеМеста.Оборудование КАК РабочиеМестаОборудование
	                      |ГДЕ
	                      |	РабочиеМестаОборудование.Ссылка.Код = &Идентификатор
	                      |	И РабочиеМестаОборудование.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыТорговогоОборудования.ПринтерЭтикеток)");
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторКлиента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьЗначениеТипаШтрихкодаДляЭУ(ТипКода)

	Перем Значение;
	
	Если ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Значение = 0;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Значение = 1;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Значение = 2;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Значение = 3;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Значение = 4;
	Иначе
		Значение = -1;
	КонецЕсли;
	
	Возврат Значение;  
	
КонецФункции 

Функция ПолучитьШтрихкодТЕ(ТЕ) Экспорт
	
	Возврат "TE" + Прав(Константы.AMQP_Exchange.Получить(), 3) + Формат(ТЕ.ДатаШтрихкода, "ДФ=ddMMyyyy") + "00" + Формат(Число(ТЕ.Номер), "ЧЦ=10; ЧВН=; ЧГ=0"); 									
		
КонецФункции