
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда  
		
		Если ЭтоНовый() И ПустаяСтрока(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;   
		
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			
			ДатаШтрихкода = ТекущаяДата();
			Штрихкод = Документы.ТранспортнаяЕдиница.ПолучитьШтрихкодТЕ(ЭтотОбъект); 
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Штрихкод = "";
	ДатаШтрихкода = Неопределено;
	
КонецПроцедуры
