/////////////////Методы веб сервисов//////////////////
Функция PM_6951_FOR_PORTAL(ПараметрыОтбора) Экспорт
	
	пДатаНачалаОтчета	  = Дата(ПараметрыОтбора.BEGIN_DATE_);
	пДатаКонцаОтчета	  = Дата(ПараметрыОтбора.END_DATE_);
	пКодКонтрагентаПортал = ПараметрыОтбора.KONTRAGENT_; 	 

	пФилиалы			  = СокрЛП(ПараметрыОтбора.FILIALS); 
	пСписокФилиалов = Новый Массив;

	Если ЗначениеЗаполнено(пФилиалы) И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда
		пСписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пФилиалы), ",");
	КонецЕсли;
	
	ИДАвардаКонтрагента = СтрЗаменить(СокрЛП(пКодКонтрагентаПортал), Символы.НПП, "");

	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6951_FOR_PORTAL.ПространствоИмен, "RS_PM_6951_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6951_FOR_PORTAL.ПространствоИмен, "Out_PM_6951_FOR_PORTAL");  
	
	ИскатьПоКодуМДМ = СтрДлина(ИДАвардаКонтрагента) = 36;
	
	Если ИскатьПоКодуМДМ Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",ИДАвардаКонтрагента);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда",ИДАвардаКонтрагента);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Или НЕ пСписокФилиалов.Количество() = 0 Тогда
		
		ЗапросЗаказовПоСтатусам = Новый Запрос;
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400 * 14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда", ИДАвардаКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД", пСписокФилиалов);
		
		Если пСписокФилиалов.Количество() <> 0 Тогда
			
			ТекстЗапроса = 			
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ИДАварда
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.IDАварда = &IDАварда
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(Контрагенты.IDФилиала В(&СписокИД) ИЛИ Контрагенты.КодМДМ В(&СписокИД))
			|	И Контрагенты.ГоловнойКонтрагент В
			|			(ВЫБРАТЬ
			|				ИДАварда.Ссылка
			|			ИЗ
			|				ИДАварда КАК ИДАварда)
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|";    
			
		Иначе      
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ПОМЕСТИТЬ ТаблицаКлиентов
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
			|ИНДЕКСИРОВАТЬ ПО
			|	Ссылка
			|";           
			
		КонецЕсли;
		
		Если ИскатьПоКодуМДМ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
		КонецЕсли;
		
		ЗапросЗаказовПоСтатусам.Текст = ТекстЗапроса;          
		
		//расчет полей в зависимости от константы ДатаОтправкиСтатусаДоставкиНаПортал
		//Доставлено = РН Продажи, где у Документа продажи (РТУ) установлено свойство Товар передан
		//На доставке = Колво из документа Грузовое место (проведен и V Погружено) - Доставлено
		//Готово к погрузке = РН Собрано по заказу - ?(На доставке> 0, На доставке, Доставлено)
		
		ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал = Константы.ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал.Получить();
		
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал) Тогда
			ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал);
		Иначе
			ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", Дата("22000101"));
		КонецЕсли;			                                                                        
		
		ЗапросЗаказовПоСтатусам.Текст = ЗапросЗаказовПоСтатусам.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА СобственныеСклады.Ссылка ЕСТЬ NULL
		|					ИЛИ СобственныеСклады.Ссылка = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
		|					ИЛИ НЕ СобственныеСклады.ИсключитьИзОбщегоЭкспресса
		|				ТОГДА """"
		|			ИНАЧЕ СобственныеСклады.СкладПоставщикаДляСтатусовНаПортале
		|		КОНЕЦ) КАК СкладДляПортала
		|ПОМЕСТИТЬ СгруппТаблЧасть
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|			ПО ЗаказПокупателя.Ссылка = ЗаказПокупателяТовары.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СобственныеСклады КАК СобственныеСклады
		|			ПО ЗаказПокупателя.IDСклада = СобственныеСклады.Идентификатор
		|		ПО ТаблицаКлиентов.Ссылка = ЗаказПокупателя.Грузополучатель
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка.Проведен
		|	И ЗаказПокупателяТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т1.Заказ,
		|	Т1.Номенклатура,
		|	МАКСИМУМ(Т1.Количество) КАК Количество,
		|	МИНИМУМ(ЕСТЬNULL(Т2.Статус, """")) КАК СтатусAvarda,
		|	МИНИМУМ(ВЫБОР
		|			КОГДА НЕ Т1.СкладДляПортала = """"
		|				ТОГДА Т1.СкладДляПортала
		|			ИНАЧЕ ВЫБОР
		|					КОГДА Константы.ДопПоставщик = Т2.Документ.Контрагент
		|						ТОГДА Константы.СкладДопПоставщикаДляСтатусовНаПортале
		|					ИНАЧЕ ""ЦС в Москве""
		|				КОНЕЦ
		|		КОНЕЦ) КАК СтатусПоДопПостащику
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	СгруппТаблЧасть КАК Т1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК Т2
		|		ПО Т1.Заказ = Т2.ЗаказПокупателя
		|			И Т1.Номенклатура = Т2.Номенклатура,
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА Константы.ОтправлятьЗаказыВСтророннююУТ11
		|				ТОГДА Константы.ДопПоставщик
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		КОНЕЦ КАК ДопПоставщик,
		|		Константы.СкладДопПоставщикаДляСтатусовНаПортале КАК СкладДопПоставщикаДляСтатусовНаПортале
		|	ИЗ
		|		Константы КАК Константы) КАК Константы
		|
		|СГРУППИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказПоставщика.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказПоставщика.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказПоставщика,
		|	0 КАК КоличествоИстекСрок,
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказПоставщика
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказПоставщика
		|ГДЕ
		|	(ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недопоставка)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недостача)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Пересорт))
		|	И (ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя, ЗаказыПокупателейОтказПоставщика.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА ЗаказыПокупателейИстекСрок.Количество * -1
		|				ИНАЧЕ ЗаказыПокупателейИстекСрок.Количество
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЗаказыПокупателейИстекСрок.ЗаказПокупателя,
		|	ЗаказыПокупателейИстекСрок.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейИстекСрок
		|ГДЕ
		|	(ЗаказыПокупателейИстекСрок.ЗаказПокупателя, ЗаказыПокупателейИстекСрок.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейИстекСрок.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказКлиента.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказКлиента.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказКлиента,
		|	СУММА(0) КАК КоличествоОшибкаКратности,
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ) КАК Закрыт
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказКлиента
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказКлиента
		|ГДЕ
		|	(ЗаказыПокупателейОтказКлиента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		|			ИЛИ ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей)
		|	И (ЗаказыПокупателейОтказКлиента.ЗаказПокупателя, ЗаказыПокупателейОтказКлиента.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОшибкаКратности.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОшибкаКратности.Количество
		|				КОНЕЦ
		|		КОНЕЦ),
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура,
		|	МАКСИМУМ(ЛОЖЬ)
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОшибкаКратности
		|ГДЕ
		|	(ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя, ЗаказыПокупателейОшибкаКратности.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейОшибкаКратности.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОшибкаКратности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Номенклатура КАК Номенклатура,
		|	ГрузовоеМестоТовары.Заказ КАК Заказ,
		|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоПереданноеНаДоставку
		|ПОМЕСТИТЬ ТабПереданныеНаДоставку
		|ИЗ
		|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Проведен = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Погружено = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Дата >= &ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал
		|	И (ГрузовоеМестоТовары.Заказ, ГрузовоеМестоТовары.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобраноПоЗаказуОбороты.Заказ КАК Заказ,
		|	СобраноПоЗаказуОбороты.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(СобраноПоЗаказуОбороты.КоличествоОборот, 0)) КАК Количество
		|ПОМЕСТИТЬ ВТСобраноПоЗаказу
		|ИЗ
		|	РегистрНакопления.СобраноПоЗаказу.Обороты(
		|			&ДатаНач,
		|			,
		|			,
		|			(Заказ, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТаблЧасть.Заказ,
		|					ТаблЧасть.Номенклатура
		|				ИЗ
		|					ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	СобраноПоЗаказуОбороты.Номенклатура,
		|	СобраноПоЗаказуОбороты.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТСобраноПоЗаказу.Заказ КАК Заказ,
		|	ВТСобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(ВТСобраноПоЗаказу.Количество, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК КоличествоСобранноеПоЗаказу
		|ПОМЕСТИТЬ ТабСобраноПоЗаказу
		|ИЗ
		|	ВТСобраноПоЗаказу КАК ВТСобраноПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки КАК ТоварыВСборкеОстатки
		|		ПО ВТСобраноПоЗаказу.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И ВТСобраноПоЗаказу.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТСобраноПоЗаказу.Заказ,
		|	ВТСобраноПоЗаказу.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Заказ,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) - ЕСТЬNULL(ТабПродажи.КоличествоПродажи, 0) КАК Заказано,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0)
		|	КОНЕЦ КАК ЗаказаноПоставщику,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) - ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0) КАК Зарезервированно,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
		|	КОНЕЦ КАК Собрано,
		|	ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Собирается,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) КАК ОтказПоставщика,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК ОтказИстекСрок,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) КАК ОтказКлиента,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) КАК ОтказОшибкаКратности,
		|	ЕСТЬNULL(ТабПоступило.Поступило, 0) КАК Поступило,
		|	ЕСТЬNULL(ТабПродажи.КоличествоПродажи, 0) КАК Выполнен,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.Закрыт, ЛОЖЬ) КАК Закрыт,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(СобраноПоЗаказуОбороты.КоличествоОборот, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСборка,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОбороты.КоличествоОборот, 0) > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьЗаказ,
		|	ЕСТЬNULL(ТабПродажи.КоличествоДоставлено, 0) КАК Доставлено,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НаДоставке,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0)
		|		ИНАЧЕ ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|	КОНЕЦ КАК ГотовоКПогрузке,
		|	ТаблЧасть.СтатусAvarda КАК СтатусAvarda,
		|	ТаблЧасть.СтатусПоДопПостащику
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
		|				,
		|				(ДокументРезерва, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ДокументРезерва,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТаблЧасть.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
		|			И ТаблЧасть.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ЗаказПокупателя,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОстатки
		|		ПО ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ТоварыВСборкеОстатки
		|		ПО ТаблЧасть.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказПоставщика КАК ЗаказыПокупателейОтказПоставщика
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказПоставщика.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказКлиента КАК ЗаказыПокупателейОтказКлиента
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказКлиента.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказКлиента.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РазмещениеЗаказовПокупателейОстаткиИОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			РазмещениеЗаказовПокупателейОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ВЫБОР
		|					КОГДА НЕ РазмещениеЗаказовПокупателейОстаткиИОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
		|						ТОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОстаткиИОбороты.КоличествоРасход, 0)
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК Поступило
		|		ИЗ
		|			РегистрНакопления.РазмещениеЗаказовПокупателей.ОстаткиИОбороты(
		|					&ДатаНач,
		|					,
		|					Регистратор,
		|					,
		|					(ЗаказПокупателя, Номенклатура) В
		|						(ВЫБРАТЬ
		|							ТаблЧасть.Заказ,
		|							ТаблЧасть.Номенклатура КАК ЗаказПокупателя
		|						ИЗ
		|							ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОстаткиИОбороты
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РазмещениеЗаказовПокупателейОстаткиИОбороты.Номенклатура,
		|			РазмещениеЗаказовПокупателейОстаткиИОбороты.ЗаказПокупателя) КАК ТабПоступило
		|		ПО ТаблЧасть.Заказ = ТабПоступило.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ТабПоступило.Номенклатура
		|			И ТаблЧасть.Заказ = ТабПоступило.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Номенклатура КАК НоменклатураПродажи,
		|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателяПродажи,
		|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоПродажи,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставлено,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													И ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|											ТОГДА ПродажиОбороты.КоличествоОборот
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставленоДоКорректировок
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(
		|					&ДатаНач,
		|					,
		|					Регистратор,
		|					(ЗаказПокупателя, Номенклатура) В
		|						(ВЫБРАТЬ
		|							ТаблЧасть.Заказ,
		|							ТаблЧасть.Номенклатура
		|						ИЗ
		|							ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗначенияСвойствОбъектов.Объект КАК Объект,
		|					ЗначенияСвойствОбъектов.Значение КАК Значение
		|				ИЗ
		|					РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ГДЕ
		|					ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|				ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПродажиОбороты.Номенклатура,
		|			ПродажиОбороты.ЗаказПокупателя) КАК ТабПродажи
		|		ПО ТаблЧасть.Заказ = ТабПродажи.ЗаказПокупателяПродажи
		|			И ТаблЧасть.Номенклатура = ТабПродажи.НоменклатураПродажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПереданныеНаДоставку КАК ТабПереданныеНаДоставку
		|		ПО ТаблЧасть.Заказ = ТабПереданныеНаДоставку.Заказ
		|			И ТаблЧасть.Номенклатура = ТабПереданныеНаДоставку.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСобраноПоЗаказу КАК ТабСобраноПоЗаказу
		|		ПО ТаблЧасть.Заказ = ТабСобраноПоЗаказу.Заказ
		|			И ТаблЧасть.Номенклатура = ТабСобраноПоЗаказу.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СобраноПоЗаказу.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(Заказ, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказуОбороты
		|		ПО ТаблЧасть.Заказ = СобраноПоЗаказуОбороты.Заказ
		|			И ТаблЧасть.Номенклатура = СобраноПоЗаказуОбороты.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ КАК ЗаказПокупателя,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОбороты
		|		ПО ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			РазмещениеЗаказовПокупателейОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателейОбороты.КоличествоОборот, 0) * -1) КАК КоличествоВПути
		|		ИЗ
		|			РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(
		|					,
		|					,
		|					Регистратор,
		|					(ЗаказПокупателя, Номенклатура) В
		|						(ВЫБРАТЬ
		|							ТаблЧасть.Заказ КАК Заказ,
		|							ТаблЧасть.Номенклатура
		|						ИЗ
		|							ТаблЧасть КАК ТаблЧасть)) КАК РазмещениеЗаказовПокупателейОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ПО РазмещениеЗаказовПокупателейОбороты.Регистратор = ЗначенияСвойствОбъектов.Объект
		|					И (ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
		|		ГДЕ
		|			НЕ ЗначенияСвойствОбъектов.Значение ЕСТЬ NULL
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя,
		|			РазмещениеЗаказовПокупателейОбороты.Номенклатура) КАК ТоварыВПути
		|		ПО ТаблЧасть.Номенклатура = ТоварыВПути.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВПути.ЗаказПокупателя
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ЗаказПокупателя,
		|	ПродажиОбороты.ДокументПродажи
		|ПОМЕСТИТЬ ПрОб
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			,
		|			,
		|			,
		|			(ЗаказПокупателя, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТаблЧасть.Заказ,
		|					ТаблЧасть.Номенклатура
		|				ИЗ
		|					ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Заказ,
		|	ТаблЗаказа.Номенклатура,
		|	МАКСИМУМ(ТаблЗаказа.Заказано) КАК Заказано,
		|	МАКСИМУМ(ТаблЗаказа.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	МАКСИМУМ(ТаблЗаказа.Зарезервированно) КАК Зарезервированно,
		|	МАКСИМУМ(ТаблЗаказа.Собрано) КАК Собрано,
		|	МАКСИМУМ(ТаблЗаказа.Собирается) КАК Собирается,
		|	СУММА(ТаблЗаказа.ОтказПоставщика) КАК ОтказПоставщика,
		|	СУММА(ТаблЗаказа.ОтказИстекСрок) КАК ОтказИстекСрок,
		|	СУММА(ТаблЗаказа.ОтказКлиента) КАК ОтказКлиента,
		|	СУММА(ТаблЗаказа.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		|	МАКСИМУМ(ТаблЗаказа.Поступило) КАК Поступило,
		|	МАКСИМУМ(ТаблЗаказа.Выполнен) КАК Выполнен,
		|	МАКСИМУМ(ТаблЗаказа.Закрыт) КАК Закрыт,
		|	МАКСИМУМ(ТаблЗаказа.ЕстьСборка) КАК ЕстьСборка,
		|	МАКСИМУМ(ТаблЗаказа.ЕстьЗаказ) КАК ЕстьЗаказ,
		|	МАКСИМУМ(ТаблЗаказа.Доставлено) КАК Доставлено,
		|	МАКСИМУМ(ТаблЗаказа.НаДоставке) КАК НаДоставке,
		|	МАКСИМУМ(ТаблЗаказа.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		|	МАКСИМУМ(ТаблицаКлиентов.Ссылка.Наименование) КАК ГрузополучательНаименование,
		|	МАКСИМУМ(Склады.Наименование) КАК СкладНаименование,
		|	МИНИМУМ(ТаблЗаказа.СтатусAvarda) КАК СтатусAvarda,
		|	ТаблЗаказа.СтатусПоДопПостащику,
		|	ТаблЗаказа.Заказ.Организация.Наименование КАК Организация,
		|	ТаблЗаказа.Заказ.СуммаДокумента КАК СуммаДокумента,
		|	ПрОб.ДокументПродажи,
		|	ЕСТЬNULL(Грузоместа.Ссылка, 0) КАК КолГрузомест
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
		|		ПО ТаблЗаказа.Заказ.СкладГруппа = Склады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ПО ТаблЗаказа.Заказ.Грузополучатель = ТаблицаКлиентов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПрОб КАК ПрОб
		|		ПО ТаблЗаказа.Заказ = ПрОб.ЗаказПокупателя
		|			И ТаблЗаказа.Номенклатура = ПрОб.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМестоТовары.Ссылка) КАК Ссылка,
		|			ГрузовоеМестоТовары.Заказ КАК Заказ
		|		ИЗ
		|			ПрОб КАК ПрОб
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|				ПО ПрОб.ЗаказПокупателя = ГрузовоеМестоТовары.Заказ
		|					И ПрОб.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		|					И ПрОб.ДокументПродажи = ГрузовоеМестоТовары.Ссылка.РеализацияСамовывоза
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрузовоеМестоТовары.Заказ) КАК Грузоместа
		|		ПО ТаблЗаказа.Заказ = Грузоместа.Заказ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Заказ,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.Заказ.Организация.Наименование,
		|	ТаблЗаказа.Заказ.СуммаДокумента,
		|	ТаблЗаказа.СтатусПоДопПостащику,
		|	ПрОб.ДокументПродажи,
		|	ЕСТЬNULL(Грузоместа.Ссылка, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Заказ КАК Ссылка,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.Заказ.Номер КАК DCODE,
		|	ИтоговаяТаблица.ГрузополучательНаименование КАК FILIAL_NAME,
		|	ИтоговаяТаблица.Заказ.Комментарий КАК DNOTE,
		|	""RUB"" КАК VALUTA_NAME,
		|	ИтоговаяТаблица.Заказ.ДоговорКонтрагента.Наименование КАК DOGOVOR_NAME,
		|	ИтоговаяТаблица.СкладНаименование КАК SKLAD_NAME,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Организация КАК СТРОКА(80)) КАК OUR_FIRM,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.СуммаДокумента КАК ЧИСЛО(15, 2)) КАК REZERV_SUM,
		|	ИтоговаяТаблица.Заказ.Дата КАК DATE_TIMESTAMP,
		|	ИтоговаяТаблица.Заказано КАК Заказано,
		|	ИтоговаяТаблица.Зарезервированно КАК Зарезервированно,
		|	ИтоговаяТаблица.ЗаказаноПоставщику КАК ЗаказаноПоставщику,
		|	ИтоговаяТаблица.Поступило КАК Поступило,
		|	ИтоговаяТаблица.Собрано КАК Собрано,
		|	ИтоговаяТаблица.Собирается КАК Собирается,
		|	ИтоговаяТаблица.ОтказКлиента КАК ОтказКлиента,
		|	ИтоговаяТаблица.ОтказОшибкаКратности КАК ОтказОшибкаКратности,
		|	ИтоговаяТаблица.ОтказПоставщика КАК ОтказПоставщика,
		|	ИтоговаяТаблица.ОтказИстекСрок КАК ОтказИстекСрок,
		|	ИтоговаяТаблица.Выполнен КАК Выполнен,
		|	ИтоговаяТаблица.Закрыт КАК Закрыт,
		|	ИтоговаяТаблица.ЕстьСборка КАК ЕстьСборка,
		|	ИтоговаяТаблица.ЕстьЗаказ КАК ЕстьЗаказ,
		|	ИтоговаяТаблица.Доставлено КАК Доставлено,
		|	ИтоговаяТаблица.НаДоставке КАК НаДоставке,
		|	ИтоговаяТаблица.ГотовоКПогрузке КАК ГотовоКПогрузке,
		|	ИтоговаяТаблица.СтатусAvarda КАК СтатусAvarda,
		|	ИтоговаяТаблица.СтатусПоДопПостащику КАК СтатусПоДопПостащику,
		|	ИтоговаяТаблица.Заказ.ТаксиДоставка КАК ТаксиДоставка,
		|	ИтоговаяТаблица.ДокументПродажи КАК ДокументПродажи,
		|	ИтоговаяТаблица.КолГрузомест КАК КолГрузомест
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	DATE_TIMESTAMP УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(FILIAL_NAME),
		|	МАКСИМУМ(VALUTA_NAME),
		|	МАКСИМУМ(SKLAD_NAME),
		|	МАКСИМУМ(OUR_FIRM),
		|	МАКСИМУМ(REZERV_SUM),
		|	СУММА(Заказано),
		|	СУММА(Зарезервированно),
		|	СУММА(ЗаказаноПоставщику),
		|	СУММА(Поступило),
		|	СУММА(Собрано),
		|	СУММА(Собирается),
		|	СУММА(ОтказКлиента),
		|	СУММА(ОтказОшибкаКратности),
		|	СУММА(ОтказПоставщика),
		|	СУММА(ОтказИстекСрок),
		|	СУММА(Выполнен),
		|	МАКСИМУМ(Закрыт),
		|	МАКСИМУМ(ЕстьСборка),
		|	МАКСИМУМ(ЕстьЗаказ),
		|	СУММА(Доставлено),
		|	СУММА(НаДоставке),
		|	СУММА(ГотовоКПогрузке),
		|	МИНИМУМ(СтатусAvarda),
		|	МИНИМУМ(СтатусПоДопПостащику),
		|	МАКСИМУМ(ТаксиДоставка),
		|	МАКСИМУМ(ДокументПродажи),
		|	МАКСИМУМ(КолГрузомест)
		|ПО
		|	Ссылка";       
		
		РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить(); 
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда           
			
			ВыборкаРезультата = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата);
				СтрокаВозврата.DCODE = СокрЛП(СтрокаВозврата.DCODE) + "(" +? (ВыборкаРезультата.Ссылка.ТаксиДоставка, "Такси",
				                      СтрЗаменить(ВыборкаРезультата.Ссылка.СпособДоставки, "Наша д", "Д")) + ")";	

				СтрокаВозврата.DDATE1 = Формат(ВыборкаРезультата.DATE_TIMESTAMP, "ДФ='dd.MM.yyyy HH:mm'");
				СтрокаВозврата.DID    = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());
				СтрокаСтатус = "";                       
				
				Если ВыборкаРезультата.Заказано > 0 Тогда 
					СтрокаСтатус = СтрокаСтатус + "20;заказан;"+СокрЛП(ВыборкаРезультата.Заказано) + ",";
				КонецЕсли;				

				Если ВыборкаРезультата.Зарезервированно > 0 Тогда 
					СтрокаСтатус = СтрокаСтатус + "10;зарезервирован;"+СокрЛП(ВыборкаРезультата.Зарезервированно) + ",";
				КонецЕсли;
				
				Если ВыборкаРезультата.ЗаказаноПоставщику > 0 Тогда
					
					ИмяПоля      = "ЗаказаноПоставщику";
					Количество   = ВыборкаРезультата.ЗаказаноПоставщику;					
					КодСообщения = 10;                                              
					СообщениеДляПортала = СформироватьСообщениеДляПортала(ИмяПоля, Количество, ВыборкаРезультата.СтатусAvarda, КодСообщения, Истина,
					                    ?(ВыборкаРезультата.СтатусПоДопПостащику = "", "ЦС в Москве", ВыборкаРезультата.СтатусПоДопПостащику));
					СтрокаСтатус = СтрокаСтатус + СообщениеДляПортала + СокрЛП(ВыборкаРезультата.ЗаказаноПоставщику) + ",";
					
				КонецЕсли;         
				
				Если ВыборкаРезультата.Собирается <> 0 Тогда
					СтрокаСтатус = СтрокаСтатус + "10;на подборе;" + СокрЛП(ВыборкаРезультата.Собирается) + ",";
				КонецЕсли;       
				
				Если ВыборкаРезультата.ГотовоКПогрузке > 0 Тогда
					СтрокаСтатус = СтрокаСтатус + "40;готов к отгрузке;" + СокрЛП(ВыборкаРезультата.ГотовоКПогрузке) + ",";
				КонецЕсли;

				Если ВыборкаРезультата.ОтказКлиента > 0 ИЛИ ВыборкаРезультата.Закрыт Тогда
					СтрокаСтатус = СтрокаСтатус + "100;отказ покупателя;" + СокрЛП(ВыборкаРезультата.ОтказКлиента) + ",";
				КонецЕсли;     
				
				Если ВыборкаРезультата.ОтказПоставщика > 0 Тогда 
					СтрокаСтатус = СтрокаСтатус + ?(ВыборкаРезультата.ссылка.ТаксиДоставка, "110;нет на складе;", "110;отказ поставщика;")
					              + СокрЛП(ВыборкаРезультата.ОтказПоставщика) + ",";
				КонецЕсли;               
							  
				Если ВыборкаРезультата.ОтказИстекСрок > 0 Тогда 
					СтрокаСтатус = СтрокаСтатус + "110;истек срок резервирования;" + СокрЛП(ВыборкаРезультата.ОтказИстекСрок) + ",";
				КонецЕсли;                
				
				Если ВыборкаРезультата.ОтказОшибкаКратности > 0 И ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая() Тогда 
					СтрокаСтатус = СтрокаСтатус + "110;ошибка кратности;" + СокрЛП(ВыборкаРезультата.ОтказОшибкаКратности) + ",";
				КонецЕсли;            
				
				Если ВыборкаРезультата.НаДоставке > 0 Тогда 
					СтрокаСтатус = СтрокаСтатус + "50;на доставке;" + СокрЛП(ВыборкаРезультата.НаДоставке) + ",";
				КонецЕсли; 
				
				Если ВыборкаРезультата.Доставлено > 0 Тогда
					СтрокаСтатус = СтрокаСтатус + ?(ВыборкаРезультата.ТаксиДоставка И КонецДня(ВыборкаРезультата.ДокументПродажи.Дата) = КонецДня(ТекущаяДата()),
					               "60;Такси доставка " + ?(ВыборкаРезультата.КолГрузомест = 0 , "", "(" + СокрЛП(ВыборкаРезультата.КолГрузомест) + " гр.мест)") 
					             + ";", "60;выполнен;") + СокрЛП(ВыборкаРезультата.Доставлено) + ",";
				КонецЕсли;
							
				СтрокаВозврата.STATUS = СокрЛП(СтрокаСтатус);
				
				мМожноКорректировать = Истина;	
				
				Если Найти(СтрокаСтатус, "40;готов к отгрузке") > 0 
					ИЛИ Найти(СтрокаСтатус, "50;на доставке") > 0 
					ИЛИ Найти(СтрокаСтатус, "60;") > 0 
					ИЛИ Найти(СтрокаСтатус, "100;отказ покупателя") > 0 
					ИЛИ Найти(СтрокаСтатус, "110;отказ поставщика") > 0
					ИЛИ Найти(СтрокаСтатус, "110;нет на складе") > 0
					ИЛИ Найти(СтрокаСтатус, "110;истек срок резервирования") > 0 
					Тогда 
					мМожноКорректировать = Ложь;
				ИначеЕсли СтрокаСтатус = "10;на подборе" Тогда
					мМожноКорректировать = ПроверитьСтатусСборки(ВыборкаРезультата.Ссылка, ВыборкаРезультата.Номенклатура);
				Иначе
					мМожноКорректировать = Ложь;
				КонецЕсли;                         
				
				Если мМожноКорректировать Тогда 
					мМожноКорректировать = НЕ Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить().Пустая();
				КонецЕсли;                                                           
				
				Если мМожноКорректировать Тогда 
					мМожноКорректировать = ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая();
				КонецЕсли;                                                        
				
				СтрокаВозврата.FLAG_1 = ПолучитьСписокДействийСЗаказом(ВыборкаРезультата.Ссылка, ВыборкаРезультата.ЕстьСборка, ВыборкаРезультата.ЕстьЗаказ,мМожноКорректировать);
				
				РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);   
				
			КонецЦикла;		
			
		КонецЕсли;		
		
		ДобавитьНеСозданныеЗаказыПокупателей(РезультатДляВозвратаПорталу, пДатаНачалаОтчета, пДатаКонцаОтчета, ИДАвардаКонтрагента, ТипСтрокаОтвета); 
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция PM_GET_ZP_PORTAL(ПараметрыОтбора) Экспорт
	
	пЗаказКлиента	  = СокрЛП(ПараметрыОтбора.DID_ZP);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_ZP_PORTAL.ПространствоИмен, "RS_PM_GET_ZP_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_ZP_PORTAL.ПространствоИмен, "Out_PM_GET_ZP_PORTAL");  
	
	Если НЕ ДокументЗаказКлиента.Пустая() Тогда
		
		ЗапросПоШапкеЗаказа = Новый Запрос;
		ЗапросПоШапкеЗаказа.УстановитьПараметр("ЗаказПараметр", ДокументЗаказКлиента);
		ЗапросПоШапкеЗаказа.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Ссылка.Номер КАК DOC_NUM,
		|	ЗаказПокупателяТовары.Ссылка.Дата КАК DOC_DATE,
		|	ЗаказПокупателяТовары.Ссылка.Контрагент.Наименование КАК FILIAL,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
		|				ИЛИ ЗаказПокупателяТовары.Ссылка.Контрагент.IDАварда = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.КодМДМ
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.Контрагент.IDАварда
		|	КОНЕЦ КАК FILIAL_ID,
		|	ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.Наименование КАК KONTRAGENT,
		|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.Наименование КАК DOGOVOR,
		|	ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Наименование, """") = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Идентификатор
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.СкладГруппа.Наименование
		|	КОНЕЦ КАК SKLAD,
		|	ЗаказПокупателяТовары.Ссылка.ВалютаДокумента.Наименование КАК VALUTA,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
		|				ИЛИ ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.КодМДМ
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда
		|	КОНЕЦ КАК KONTRAGENT_ID,
		|	МАКСИМУМ(ЗаказПокупателяТовары.НомерСтроки) КАК KOL_VO_STROK,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК KOL_VO_POS,
		|	НЕ ЕСТЬNULL(ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Наименование, """") = """" КАК Стор
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Ссылка.Номер,
		|	ЗаказПокупателяТовары.Ссылка.Дата,
		|	ЗаказПокупателяТовары.Ссылка.Контрагент.Наименование,
		|	ЗаказПокупателяТовары.Ссылка.ДоговорКонтрагента.Наименование,
		|	ЗаказПокупателяТовары.Ссылка.ВалютаДокумента.Наименование,
		|	ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.Наименование,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
		|				ИЛИ ЗаказПокупателяТовары.Ссылка.Контрагент.IDАварда = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.КодМДМ
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.Контрагент.IDАварда
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
		|				ИЛИ ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.КодМДМ
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда
		|	КОНЕЦ,
		|	НЕ ЕСТЬNULL(ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Наименование, """") = """",
		|	ВЫБОР
		|		КОГДА НЕ ЕСТЬNULL(ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Наименование, """") = """"
		|			ТОГДА ЗаказПокупателяТовары.Ссылка.IDСклада_СтороннийСклад.Идентификатор
		|		ИНАЧЕ ЗаказПокупателяТовары.Ссылка.СкладГруппа.Наименование
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка.Дата УБЫВ";
		
		РезультатЗапросаШапкиЗаказа = ЗапросПоШапкеЗаказа.Выполнить();
		
		ЕстьСборка = ЕстьСборка(ДокументЗаказКлиента);
		ЕстьЗаказ = ЕстьЗаказПоставщику(ДокументЗаказКлиента);
		
		Если НЕ РезультатЗапросаШапкиЗаказа.Пустой() Тогда
			
			ВыборкаРезультата = РезультатЗапросаШапкиЗаказа.Выбрать();
			
			Пока ВыборкаРезультата.Следующий()Цикл
				
				СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата, , "FILIAL_ID, KONTRAGENT_ID,SKLAD");
				СтрокаВозврата.DOC_NUM = СокрЛП(СтрокаВозврата.DOC_NUM) + "("
				                       + ?(ВыборкаРезультата.Ссылка.ТаксиДоставка, "Такси", СтрЗаменить(ВыборкаРезультата.Ссылка.СпособДоставки, "Наша д", "Д")) + ")";	
					
				СтрокаВозврата.FILIAL_ID =  СокрЛП(ВыборкаРезультата.FILIAL_ID);
				СтрокаВозврата.KONTRAGENT_ID = СокрЛП(ВыборкаРезультата.KONTRAGENT_ID);
				СтрокаВозврата.SKLAD = ?(ВыборкаРезультата.Стор, "Стор ", "") + СокрЛП(ВыборкаРезультата.SKLAD); 
				
				Если ДокументЗаказКлиента.ТолькоРезерв Тогда
					ДействияВДесятичномВиде = "0010";
				Иначе					
					ДействияВДесятичномВиде = "0010";
				КонецЕсли;  
				
				СтрокаВозврата.FLAG_1 = ДвоичноеВДесятичное(ДействияВДесятичномВиде);
				
				РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция PM_GET_RNS_STR_FOR_PORTAL(ПараметрыОтбора) Экспорт
	
	пЗаказКлиента	  = СокрЛП(ПараметрыОтбора.DID_6951);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_RNS_STR_FOR_PORTAL.ПространствоИмен, "RS_PM_GET_RNS_STR_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_RNS_STR_FOR_PORTAL.ПространствоИмен, "Out_PM_GET_RNS_STR_FOR_PORTAL"); 
	
	Если НЕ ДокументЗаказКлиента.Пустая() Тогда
		
		ЗапросПоСтрокамЗаказа = Новый Запрос;
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("ЗаказПараметр", ДокументЗаказКлиента);
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНач", ДокументЗаказКлиента.Дата);
		
		//Расчет полей в зависимости от константы ДатаОтправкиСтатусаДоставкиНаПортал
		//Доставлено = РН Продажи, где у Документа продажи (РТУ) установлено свойство Товар передан
		//На доставке = Колво из документа Грузовое место (проведен и V Погружено) - Доставлено
		//Готово к погрузке = РН Собрано по заказу - ?(На доставке> 0, На доставке, Доставлено)
		
		ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал = Константы.ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал.Получить();
		
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал) Тогда
			ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал);
		Иначе
			ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", Дата("22000101"));
		КонецЕсли;			
		
		РазрешеноРедактироватьЗаказ = Ложь;           
		
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("РазрешеноРедактироватьЗаказ", РазрешеноРедактироватьЗаказ);
		ЗапросПоСтрокамЗаказа.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателяТовары.Цена,
		|	МАКСИМУМ(ЗаказПокупателяТовары.Комментарий) КАК Комментарий,
		|	ВЫБОР
		|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК IDLIN
		|ПОМЕСТИТЬ СгруппТаблЧасть
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Цена,
		|	ВЫБОР
		|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура,
		|	МИНИМУМ(ИсторияХраненияИзмененийЗагружСтатусов.Статус) КАК СтатусAvarda
		|ПОМЕСТИТЬ ИсторияСтатусовAvarda
		|ИЗ
		|	РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК ИсторияХраненияИзмененийЗагружСтатусов
		|ГДЕ
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя = &ЗаказПараметр
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т1.Заказ,
		|	Т1.Номенклатура,
		|	Т1.Количество,
		|	Т1.Цена,
		|	Т1.Комментарий,
		|	Т1.IDLIN,
		|	ЕСТЬNULL(Т2.СтатусAvarda, """") КАК СтатусAvarda
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	СгруппТаблЧасть КАК Т1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСтатусовAvarda КАК Т2
		|		ПО Т1.Заказ = Т2.ЗаказПокупателя
		|			И Т1.Номенклатура = Т2.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказПоставщика.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказПоставщика.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказПоставщика,
		|	0 КАК КоличествоИстекСрок,
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказПоставщика
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказПоставщика
		|ГДЕ
		|	(ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недопоставка)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недостача)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Пересорт))
		|	И (ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя, ЗаказыПокупателейОтказПоставщика.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА ЗаказыПокупателейИстекСрок.Количество * -1
		|				ИНАЧЕ ЗаказыПокупателейИстекСрок.Количество
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЗаказыПокупателейИстекСрок.ЗаказПокупателя,
		|	ЗаказыПокупателейИстекСрок.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейИстекСрок
		|ГДЕ
		|	(ЗаказыПокупателейИстекСрок.ЗаказПокупателя, ЗаказыПокупателейИстекСрок.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейИстекСрок.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказКлиента.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказКлиента.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказКлиента,
		|	СУММА(0) КАК КоличествоОшибкаКратности,
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказКлиента
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказКлиента
		|ГДЕ
		|	(ЗаказыПокупателейОтказКлиента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		|			ИЛИ ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей)
		|	И (ЗаказыПокупателейОтказКлиента.ЗаказПокупателя, ЗаказыПокупателейОтказКлиента.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОшибкаКратности.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОшибкаКратности.Количество
		|				КОНЕЦ
		|		КОНЕЦ),
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОшибкаКратности
		|ГДЕ
		|	(ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя, ЗаказыПокупателейОшибкаКратности.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейОшибкаКратности.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОшибкаКратности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ КАК Заказ,
		|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоПереданноеНаДоставку
		|ПОМЕСТИТЬ ТабПереданныеНаДоставку
		|ИЗ
		|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Проведен = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Погружено = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Дата >= &ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал
		|	И (ГрузовоеМестоТовары.Заказ, ГрузовоеМестоТовары.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	КоличествоПереданноеНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобраноПоЗаказу.Заказ КАК Заказ,
		|	СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(СобраноПоЗаказу.Количество, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК КоличествоСобранноеПоЗаказу
		|ПОМЕСТИТЬ ТабСобраноПоЗаказу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СобраноПоЗаказу.Заказ КАК Заказ,
		|		СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|		СУММА(ЕСТЬNULL(СобраноПоЗаказу.КоличествоОборот, 0)) КАК Количество
		|	ИЗ
		|		РегистрНакопления.СобраноПоЗаказу.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(Заказ, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказу
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СобраноПоЗаказу.Номенклатура,
		|		СобраноПоЗаказу.Заказ) КАК СобраноПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		|		ПО СобраноПоЗаказу.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И СобраноПоЗаказу.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	СобраноПоЗаказу.Заказ,
		|	СобраноПоЗаказу.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Заказ КАК Заказ,
		|	ТаблЧасть.Номенклатура КАК Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) - ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК Заказано,
		|	ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Зарезервированно,
		|	ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) КАК ЗаказаноПоставщику,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
		|	КОНЕЦ КАК Собрано,
		|	ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Собирается,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) КАК ОтказПоставщика,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК ОтказИстекСрок,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) КАК ОтказКлиента,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) КАК ОтказОшибкаКратности,
		|	ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) КАК Выполнен,
		|	ТаблЧасть.Комментарий,
		|	ЕСТЬNULL(ТабПродажи.КоличествоДоставлено, 0) КАК Доставлено,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НаДоставке,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0)
		|		ИНАЧЕ ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|	КОНЕЦ КАК ГотовоКПогрузке,
		|	ТаблЧасть.IDLIN,
		|	ТаблЧасть.СтатусAvarda
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПараметр) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК РазмещениеЗаказовПокупателейОстатки
		|		ПО ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказПоставщика КАК ЗаказыПокупателейОтказПоставщика
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказПоставщика.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказКлиента КАК ЗаказыПокупателейОтказКлиента
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказКлиента.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказКлиента.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставлено,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													И ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|											ТОГДА ПродажиОбороты.КоличествоОборот
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставленоДоКорректировок
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(&ДатаНач, , Регистратор, ЗаказПокупателя = &ЗаказПараметр) КАК ПродажиОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗначенияСвойствОбъектов.Объект КАК Объект,
		|					ЗначенияСвойствОбъектов.Значение КАК Значение
		|				ИЗ
		|					РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ГДЕ
		|					ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|				ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПродажиОбороты.Номенклатура,
		|			ПродажиОбороты.ЗаказПокупателя) КАК ТабПродажи
		|		ПО ТаблЧасть.Заказ = ТабПродажи.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ТабПродажи.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПереданныеНаДоставку КАК ТабПереданныеНаДоставку
		|		ПО ТаблЧасть.Заказ = ТабПереданныеНаДоставку.Заказ
		|			И ТаблЧасть.Номенклатура = ТабПереданныеНаДоставку.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСобраноПоЗаказу КАК ТабСобраноПоЗаказу
		|		ПО ТаблЧасть.Заказ = ТабСобраноПоЗаказу.Заказ
		|			И ТаблЧасть.Номенклатура = ТабСобраноПоЗаказу.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Заказ КАК Заказ,
		|	ТаблЗаказа.Номенклатура КАК Номенклатура,
		|	ТаблЗаказа.Цена,
		|	МАКСИМУМ(ТаблЗаказа.Заказано) КАК Заказано,
		|	МАКСИМУМ(ТаблЗаказа.Зарезервированно) КАК Зарезервированно,
		|	МАКСИМУМ(ТаблЗаказа.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	МАКСИМУМ(ТаблЗаказа.Собрано) КАК Собрано,
		|	МАКСИМУМ(ТаблЗаказа.Собирается) КАК Собирается,
		|	СУММА(ТаблЗаказа.ОтказПоставщика) КАК ОтказПоставщика,
		|	СУММА(ТаблЗаказа.ОтказКлиента) КАК ОтказКлиента,
		|	СУММА(ТаблЗаказа.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		|	МАКСИМУМ(ТаблЗаказа.Выполнен) КАК Выполнен,
		|	ТаблЗаказа.Комментарий,
		|	МАКСИМУМ(ТаблЗаказа.Доставлено) КАК Доставлено,
		|	МАКСИМУМ(ТаблЗаказа.НаДоставке) КАК НаДоставке,
		|	МАКСИМУМ(ТаблЗаказа.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		|	ТаблЗаказа.IDLIN,
		|	МИНИМУМ(ТаблЗаказа.СтатусAvarda) КАК СтатусAvarda,
		|	СУММА(ТаблЗаказа.ОтказИстекСрок) КАК ОтказИстекСрок
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Заказ,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.Цена,
		|	ТаблЗаказа.Комментарий,
		|	ТаблЗаказа.IDLIN
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Заказ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка) КАК СФ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата) КАК ДатаДок,
		|	ИтоговаяТаблица.Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|							ТОГДА ПродажиОбороты.КоличествоОборот
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|		КОНЕЦ) КАК ДоставленоПоСФ,
		|	СчетФактураВыданный.ДокументПродажи
		|ПОМЕСТИТЬ СФВыданный
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|			ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПродажиОбороты.Номенклатура КАК Номенклатура,
		|				ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|				ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		|				СчетФактураВыданный.Ссылка КАК СФ
		|			ИЗ
		|				РегистрНакопления.Продажи.Обороты(
		|						,
		|						,
		|						Регистратор,
		|						(ЗаказПокупателя, Номенклатура) В
		|							(ВЫБРАТЬ
		|								ТаблЧасть.Заказ,
		|								ТаблЧасть.Номенклатура
		|							ИЗ
		|								ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|					ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументОснование
		|			ГДЕ
		|				СчетФактураВыданный.Проведен = ИСТИНА) КАК СчетФактураВыданный
		|			ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументПродажи
		|		ПО ИтоговаяТаблица.Заказ = ПродажиОбороты.ЗаказПокупателя
		|			И ИтоговаяТаблица.Номенклатура = ПродажиОбороты.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Заказ,
		|	ИтоговаяТаблица.Номенклатура,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка),
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата),
		|	СчетФактураВыданный.ДокументПродажи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СФВыданный.Заказ,
		|	СФВыданный.СФ,
		|	СФВыданный.ДатаДок,
		|	СФВыданный.ДоставленоПоСФ,
		|	СФВыданный.ДокументПродажи КАК ДокументПродажи,
		|	ВЫБОР
		|		КОГДА СФВыданный.ДокументПродажи.ТаксиДоставка
		|			ТОГДА ЕСТЬNULL(Грузоместа.Ссылка, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КолГрузомест
		|ПОМЕСТИТЬ СФВыданныйИтог
		|ИЗ
		|	СФВыданный КАК СФВыданный,
		|	(ВЫБРАТЬ
		|		СФВыданный.ДокументПродажи КАК ДокументПродажи,
		|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовыеМеста.Ссылка) КАК Ссылка
		|	ИЗ
		|		СФВыданный КАК СФВыданный
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто КАК ГрузовыеМеста
		|			ПО СФВыданный.ДокументПродажи = ГрузовыеМеста.РеализацияСамовывоза
		|				И (ГрузовыеМеста.Проведен)
		|				И (ГрузовыеМеста.Погружено)
		|				И СФВыданный.ДокументПродажи = ГрузовыеМеста.РеализацияСамовывоза
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СФВыданный.ДокументПродажи) КАК Грузоместа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.Заказ КАК Ссылка,
		|	СФВыданныйИтог.СФ КАК СсылкаНаСф,
		|	СправочникНоменклатура.Код КАК INV_NUM,
		|	ИтоговаяТаблица.Заказ.ВалютаДокумента.Наименование КАК VALUTA,
		|	СправочникНоменклатура.ЕдиницаХраненияОстатков.Коэффициент КАК KOEF,
		|	0 КАК KOL_VO,
		|	ИтоговаяТаблица.Цена КАК PRICE,
		|	0 КАК SUMMA,
		|	СправочникНоменклатура.КодПроизводителя КАК ARTICUL,
		|	СправочникНоменклатура.Наименование КАК TOVAR_NAME,
		|	ВЫБОР
		|		КОГДА СправочникНоменклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|			ТОГДА """"
		|		ИНАЧЕ СправочникНоменклатура.Родитель.Наименование
		|	КОНЕЦ КАК BREND,
		|	СправочникНоменклатура.ЕдиницаХраненияОстатков.Наименование КАК ED_IZM,
		|	"" "" КАК STATUS,
		|	ИтоговаяТаблица.Заказано КАК Заказано,
		|	ИтоговаяТаблица.ЗаказаноПоставщику КАК ЗаказаноПоставщику,
		|	ИтоговаяТаблица.Зарезервированно КАК Зарезервированно,
		|	ИтоговаяТаблица.Собирается КАК Собирается,
		|	ИтоговаяТаблица.Собрано КАК Собрано,
		|	ИтоговаяТаблица.ОтказКлиента КАК ОтказКлиента,
		|	ИтоговаяТаблица.ОтказОшибкаКратности КАК ОтказОшибкаКратности,
		|	ИтоговаяТаблица.ОтказПоставщика КАК ОтказПоставщика,
		|	ИтоговаяТаблица.ОтказИстекСрок КАК ОтказИстекСрок,
		|	ИтоговаяТаблица.Выполнен КАК Выполнен,
		|	ИтоговаяТаблица.Заказано - ИтоговаяТаблица.Выполнен КАК KOL_VO_MINUS,
		|	ИтоговаяТаблица.Заказ.ДатаОтгрузки КАК PLAN_DATE,
		|	ИтоговаяТаблица.Комментарий КАК Комментарий,
		|	ЕСТЬNULL(СФВыданныйИтог.ДатаДок, """") КАК ДатаДок,
		|	ИтоговаяТаблица.Доставлено КАК Доставлено,
		|	ИтоговаяТаблица.НаДоставке КАК НаДоставке,
		|	ИтоговаяТаблица.ГотовоКПогрузке КАК ГотовоКПогрузке,
		|	ЕСТЬNULL(СФВыданныйИтог.ДоставленоПоСФ, 0) КАК ДоставленоПоСФ,
		|	ИтоговаяТаблица.IDLIN КАК IDLIN,
		|	ИтоговаяТаблица.СтатусAvarda КАК СтатусAvarda,
		|	СФВыданныйИтог.ДокументПродажи,
		|	СФВыданныйИтог.КолГрузомест КАК КолГрузомест,
		|	ИтоговаяТаблица.Заказ.ТаксиДоставка КАК ТаксиДоставка
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ИтоговаяТаблица.Номенклатура = СправочникНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ СФВыданныйИтог КАК СФВыданныйИтог
		|		ПО ИтоговаяТаблица.Заказ = СФВыданныйИтог.Заказ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	TOVAR_NAME
		|ИТОГИ
		|	МАКСИМУМ(INV_NUM),
		|	МАКСИМУМ(VALUTA),
		|	МАКСИМУМ(KOEF),
		|	МАКСИМУМ(KOL_VO),
		|	МАКСИМУМ(PRICE),
		|	МАКСИМУМ(SUMMA),
		|	МАКСИМУМ(ARTICUL),
		|	МАКСИМУМ(TOVAR_NAME),
		|	МАКСИМУМ(BREND),
		|	МАКСИМУМ(ED_IZM),
		|	МАКСИМУМ(STATUS),
		|	МАКСИМУМ(Заказано),
		|	МАКСИМУМ(ЗаказаноПоставщику),
		|	МАКСИМУМ(Зарезервированно),
		|	МАКСИМУМ(Собирается),
		|	МАКСИМУМ(Собрано),
		|	МАКСИМУМ(ОтказКлиента),
		|	МАКСИМУМ(ОтказОшибкаКратности),
		|	МАКСИМУМ(ОтказПоставщика),
		|	МАКСИМУМ(ОтказИстекСрок),
		|	МАКСИМУМ(Выполнен),
		|	МАКСИМУМ(KOL_VO_MINUS),
		|	МАКСИМУМ(PLAN_DATE),
		|	МАКСИМУМ(Комментарий),
		|	МАКСИМУМ(Доставлено),
		|	МАКСИМУМ(НаДоставке),
		|	МАКСИМУМ(ГотовоКПогрузке),
		|	СУММА(ДоставленоПоСФ),
		|	МАКСИМУМ(IDLIN),
		|	МИНИМУМ(СтатусAvarda),
		|	СУММА(КолГрузомест),
		|	МАКСИМУМ(ТаксиДоставка)
		|ПО
		|	Номенклатура";
		
		РезультатПоСтрокамЗаказа = ЗапросПоСтрокамЗаказа.Выполнить();       
		
		Если НЕ РезультатПоСтрокамЗаказа.Пустой() Тогда
			
			ВыборкаРезультата = РезультатПоСтрокамЗаказа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
			
			Пока ВыборкаРезультата.Следующий() Цикл
				
				Если ВыборкаРезультата.Заказано > 0 Тогда                     
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.Заказано, "20;заказан");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);  
					
				КонецЕсли;
				
				Если ВыборкаРезультата.Зарезервированно > 0 Тогда        
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.Зарезервированно, "10;зарезервирован");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата); 
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ЗаказаноПоставщику > 0 Тогда 
					
					ИмяПоля      = "ЗаказаноПоставщику";
					Количество   = ВыборкаРезультата.ЗаказаноПоставщику;	
					КодСообщения = 10;
					СообщениеДляПортала = СформироватьСообщениеДляПортала(ИмяПоля, Количество, ВыборкаРезультата.СтатусAvarda, КодСообщения);
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ЗаказаноПоставщику, СообщениеДляПортала );
					
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);  
					
				КонецЕсли;
				
				Если ВыборкаРезультата.Собирается > 0 Тогда      
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.Собирается, "10;на подборе");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);    
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ГотовоКПогрузке > 0 Тогда
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ГотовоКПогрузке, "40;готов к отгрузке");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);   
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ОтказКлиента > 0 Тогда            
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ОтказКлиента, "100;отказ покупателя");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);   
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ОтказПоставщика > 0 Тогда          
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ОтказПоставщика, 
					                ?(ВыборкаРезультата.Ссылка.ТаксиДоставка, "110;нет на складе;", "110;отказ поставщика;"));
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);            
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ОтказИстекСрок > 0 Тогда     
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ОтказИстекСрок, "110;истек срок резервирования");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата); 
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ОтказОшибкаКратности > 0 И ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая() Тогда 
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.ОтказОшибкаКратности, "110;ошибка кратности");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);	
					
				КонецЕсли;
				
				Если ВыборкаРезультата.НаДоставке > 0 Тогда      
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.НаДоставке, "50;на доставке");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата); 
					
				КонецЕсли;
				
				Если (ВыборкаРезультата.Доставлено-ВыборкаРезультата.ДоставленоПоСФ) > 0 Тогда	//если есть отгруженные товары без СФ (предусматриваем все, что возможно) 
					
					СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, ВыборкаРезультата.Доставлено-ВыборкаРезультата.ДоставленоПоСФ, "60;выполнен");
					РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
					
				КонецЕсли;
				
				Если ВыборкаРезультата.ДоставленоПоСФ > 0 Тогда   
					
					ВыборкаРезультатаПоСФ = ВыборкаРезультата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);  
					
					Пока ВыборкаРезультатаПоСФ.Следующий() Цикл
						
						Если ВыборкаРезультатаПоСФ.ДоставленоПоСФ > 0 Тогда
							
							СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультатаПоСФ, ВыборкаРезультатаПоСФ.ДоставленоПоСФ, "60;выполнен");
							РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
							
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЕсли; 	
	
	Возврат РезультатДляВозвратаПорталу;   
	
КонецФункции

Функция PM_GET_RNS_STR_FOR_PORTAL_2021(ПараметрыОтбора) Экспорт      
	
	пЗаказКлиента	  = СокрЛП(ПараметрыОтбора.DID_6951);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_RNS_STR_FOR_PORTAL.ПространствоИмен, "RS_PM_GET_RNS_STR_FOR_PORTAL_2021");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_RNS_STR_FOR_PORTAL.ПространствоИмен, "Out_PM_GET_RNS_STR_FOR_PORTAL_2021"); 
	
	Если НЕ ДокументЗаказКлиента.Пустая() Тогда         
		
		ЗапросПоСтрокамЗаказа = Новый Запрос;
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("ЗаказПараметр", ДокументЗаказКлиента);
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНач", ДокументЗаказКлиента.Дата);
		
		ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал = Константы.ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал.Получить();   
		
		Если ЗначениеЗаполнено(ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал) Тогда
			ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал);
		Иначе
			ЗапросПоСтрокамЗаказа.УстановитьПараметр("ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал", Дата("22000101"));
		КонецЕсли;	
		
		РазрешеноРедактироватьЗаказ = Ложь;
		
		ЗапросПоСтрокамЗаказа.УстановитьПараметр("РазрешеноРедактироватьЗаказ", РазрешеноРедактироватьЗаказ);     
		ЗапросПоСтрокамЗаказа.Текст = 
		//+Кабанов А.В. 04.12.2024 #UT10-4970
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателяТовары.Цена,
		|	МАКСИМУМ(ЗаказПокупателяТовары.Комментарий) КАК Комментарий,
		|	ВЫБОР
		|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК IDLIN,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СобственныеСклады.Ссылка ЕСТЬ NULL
		|					ИЛИ СобственныеСклады.Ссылка = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
		|					ИЛИ НЕ СобственныеСклады.ИсключитьИзОбщегоЭкспресса
		|				ТОГДА """"
		|			ИНАЧЕ СобственныеСклады.СкладПоставщикаДляСтатусовНаПортале
		|		КОНЕЦ) КАК СкладДляПортала
		|ПОМЕСТИТЬ СгруппТаблЧасть
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СобственныеСклады КАК СобственныеСклады
		|		ПО ЗаказПокупателяТовары.Ссылка.IDСклада = СобственныеСклады.Идентификатор
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
		|	И НЕ ЗаказПокупателяТовары.ТолькоРезерв
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Цена,
		|	ВЫБОР
		|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		|		ИНАЧЕ """"
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура,
		|	МИНИМУМ(ИсторияХраненияИзмененийЗагружСтатусов.Статус) КАК СтатусAvarda,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Документ.Контрагент
		|ПОМЕСТИТЬ ИсторияСтатусовAvarda
		|ИЗ
		|	РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК ИсторияХраненияИзмененийЗагружСтатусов
		|ГДЕ
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя = &ЗаказПараметр
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Документ.Контрагент
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Т1.Заказ,
		|	Т1.Номенклатура,
		|	Т1.Количество,
		|	Т1.Цена,
		|	Т1.Комментарий,
		|	Т1.IDLIN,
		|	ЕСТЬNULL(Т2.СтатусAvarda, """") КАК СтатусAvarda,
		|	ВЫБОР
		|		КОГДА НЕ Т1.СкладДляПортала = """"
		|			ТОГДА Т1.СкладДляПортала
		|		ИНАЧЕ ВЫБОР
		|				КОГДА Константы.ДопПоставщик = Т2.ДокументКонтрагент
		|					ТОГДА Константы.СкладДопПоставщикаДляСтатусовНаПортале
		|				ИНАЧЕ ""ЦС в Москве""
		|			КОНЕЦ
		|	КОНЕЦ КАК СтатусПоДопПостащику
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	СгруппТаблЧасть КАК Т1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСтатусовAvarda КАК Т2
		|		ПО Т1.Заказ = Т2.ЗаказПокупателя
		|			И Т1.Номенклатура = Т2.Номенклатура,
		|	(ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА Константы.ОтправлятьЗаказыВСтророннююУТ11
		|				ТОГДА Константы.ДопПоставщик
		|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|		КОНЕЦ КАК ДопПоставщик,
		|		Константы.СкладДопПоставщикаДляСтатусовНаПортале КАК СкладДопПоставщикаДляСтатусовНаПортале
		|	ИЗ
		|		Константы КАК Константы) КАК Константы
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Т1.Заказ,
		|	Т1.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказПоставщика.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказПоставщика.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказПоставщика,
		|	0 КАК КоличествоИстекСрок,
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказПоставщика
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказПоставщика
		|ГДЕ
		|	(ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недопоставка)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недостача)
		|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Пересорт))
		|	И (ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя, ЗаказыПокупателейОтказПоставщика.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказПоставщика.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ВЫБОР
		|		КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					ТОГДА ЗаказыПокупателейИстекСрок.Количество * -1
		|				ИНАЧЕ ЗаказыПокупателейИстекСрок.Количество
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ЗаказыПокупателейИстекСрок.ЗаказПокупателя,
		|	ЗаказыПокупателейИстекСрок.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейИстекСрок
		|ГДЕ
		|	(ЗаказыПокупателейИстекСрок.ЗаказПокупателя, ЗаказыПокупателейИстекСрок.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейИстекСрок.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОтказКлиента.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОтказКлиента.Количество
		|				КОНЕЦ
		|		КОНЕЦ) КАК КоличествоОтказКлиента,
		|	СУММА(0) КАК КоличествоОшибкаКратности,
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ЗаказыПокупателейОтказКлиента
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказКлиента
		|ГДЕ
		|	(ЗаказыПокупателейОтказКлиента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		|			ИЛИ ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей)
		|	И (ЗаказыПокупателейОтказКлиента.ЗаказПокупателя, ЗаказыПокупателейОтказКлиента.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя,
		|	ЗаказыПокупателейОтказКлиента.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СУММА(0),
		|	СУММА(ВЫБОР
		|			КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|						ТОГДА ЗаказыПокупателейОшибкаКратности.Количество * -1
		|					ИНАЧЕ ЗаказыПокупателейОшибкаКратности.Количество
		|				КОНЕЦ
		|		КОНЕЦ),
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОшибкаКратности
		|ГДЕ
		|	(ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя, ЗаказыПокупателейОшибкаКратности.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|	И ЗаказыПокупателейОшибкаКратности.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОшибкаКратности)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказПокупателя,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ КАК Заказ,
		|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоПереданноеНаДоставку
		|ПОМЕСТИТЬ ТабПереданныеНаДоставку
		|ИЗ
		|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|ГДЕ
		|	ГрузовоеМестоТовары.Ссылка.Проведен = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Погружено = ИСТИНА
		|	И ГрузовоеМестоТовары.Ссылка.Дата >= &ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал
		|	И (ГрузовоеМестоТовары.Заказ, ГрузовоеМестоТовары.Номенклатура) В
		|			(ВЫБРАТЬ
		|				ТаблЧасть.Заказ,
		|				ТаблЧасть.Номенклатура
		|			ИЗ
		|				ТаблЧасть КАК ТаблЧасть)
		|
		|СГРУППИРОВАТЬ ПО
		|	ГрузовоеМестоТовары.Номенклатура,
		|	ГрузовоеМестоТовары.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	КоличествоПереданноеНаДоставку
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СобраноПоЗаказу.Заказ КАК Заказ,
		|	СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|	СУММА(ЕСТЬNULL(СобраноПоЗаказу.Количество, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК КоличествоСобранноеПоЗаказу
		|ПОМЕСТИТЬ ТабСобраноПоЗаказу
		|ИЗ
		|	(ВЫБРАТЬ
		|		СобраноПоЗаказу.Заказ КАК Заказ,
		|		СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		|		СУММА(ЕСТЬNULL(СобраноПоЗаказу.КоличествоОборот, 0)) КАК Количество
		|	ИЗ
		|		РегистрНакопления.СобраноПоЗаказу.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(Заказ, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказу
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СобраноПоЗаказу.Номенклатура,
		|		СобраноПоЗаказу.Заказ) КАК СобраноПоЗаказу
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		|		ПО СобраноПоЗаказу.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|			И СобраноПоЗаказу.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	СобраноПоЗаказу.Заказ,
		|	СобраноПоЗаказу.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Заказ КАК Заказ,
		|	ТаблЧасть.Номенклатура КАК Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) - ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК Заказано,
		|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) - ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0) КАК Зарезервированно,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0) < 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТоварыВПути.КоличествоВПути, 0)
		|	КОНЕЦ КАК ЗаказаноПоставщику,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА 0
		|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
		|	КОНЕЦ КАК Собрано,
		|	ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Собирается,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) КАК ОтказПоставщика,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК ОтказИстекСрок,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) КАК ОтказКлиента,
		|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) КАК ОтказОшибкаКратности,
		|	ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) КАК Выполнен,
		|	ТаблЧасть.Комментарий,
		|	ЕСТЬNULL(ТабПродажи.КоличествоДоставлено, 0) КАК Доставлено,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК НаДоставке,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		|			ТОГДА ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0)
		|		ИНАЧЕ ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		|	КОНЕЦ КАК ГотовоКПогрузке,
		|	ТаблЧасть.IDLIN,
		|	ТаблЧасть.СтатусAvarda,
		|	ТаблЧасть.СтатусПоДопПостащику
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПараметр) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК РазмещениеЗаказовПокупателейОстатки
		|		ПО ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		|		ПО ТаблЧасть.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказПоставщика КАК ЗаказыПокупателейОтказПоставщика
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказПоставщика.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказКлиента КАК ЗаказыПокупателейОтказКлиента
		|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказКлиента.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказКлиента.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварДоставляется)
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставлено,
		|			СУММА(ВЫБОР
		|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		|						ТОГДА ВЫБОР
		|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|									ТОГДА ВЫБОР
		|											КОГДА (ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварДоставляется))
		|													И ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|												ТОГДА ПродажиОбороты.КоличествоОборот
		|											ИНАЧЕ 0
		|										КОНЕЦ
		|								ИНАЧЕ ВЫБОР
		|										КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|											ТОГДА ПродажиОбороты.КоличествоОборот
		|										ИНАЧЕ 0
		|									КОНЕЦ
		|							КОНЕЦ
		|					ИНАЧЕ 0
		|				КОНЕЦ) КАК КоличествоДоставленоДоКорректировок
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(&ДатаНач, , Регистратор, ЗаказПокупателя = &ЗаказПараметр) КАК ПродажиОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|					ЗначенияСвойствОбъектов.Объект КАК Объект,
		|					ЗначенияСвойствОбъектов.Значение КАК Значение
		|				ИЗ
		|					РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ГДЕ
		|					ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|				ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПродажиОбороты.Номенклатура,
		|			ПродажиОбороты.ЗаказПокупателя) КАК ТабПродажи
		|		ПО ТаблЧасть.Заказ = ТабПродажи.ЗаказПокупателя
		|			И ТаблЧасть.Номенклатура = ТабПродажи.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПереданныеНаДоставку КАК ТабПереданныеНаДоставку
		|		ПО ТаблЧасть.Заказ = ТабПереданныеНаДоставку.Заказ
		|			И ТаблЧасть.Номенклатура = ТабПереданныеНаДоставку.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСобраноПоЗаказу КАК ТабСобраноПоЗаказу
		|		ПО ТаблЧасть.Заказ = ТабСобраноПоЗаказу.Заказ
		|			И ТаблЧасть.Номенклатура = ТабСобраноПоЗаказу.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|			РазмещениеЗаказовПокупателейОбороты.Номенклатура КАК Номенклатура,
		|			СУММА(ЕСТЬNULL(РазмещениеЗаказовПокупателейОбороты.КоличествоОборот, 0) * -1) КАК КоличествоВПути
		|		ИЗ
		|			РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(, , Регистратор, ЗаказПокупателя = &ЗаказПараметр) КАК РазмещениеЗаказовПокупателейОбороты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|				ПО РазмещениеЗаказовПокупателейОбороты.Регистратор = ЗначенияСвойствОбъектов.Объект
		|					И (ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыПриемки.ВПути))
		|		ГДЕ
		|			НЕ ЗначенияСвойствОбъектов.Значение ЕСТЬ NULL
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РазмещениеЗаказовПокупателейОбороты.Номенклатура,
		|			РазмещениеЗаказовПокупателейОбороты.ЗаказПокупателя) КАК ТоварыВПути
		|		ПО ТаблЧасть.Номенклатура = ТоварыВПути.Номенклатура
		|			И ТаблЧасть.Заказ = ТоварыВПути.ЗаказПокупателя
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Заказ КАК Заказ,
		|	ТаблЗаказа.Номенклатура КАК Номенклатура,
		|	ТаблЗаказа.Цена,
		|	МАКСИМУМ(ТаблЗаказа.Заказано) КАК Заказано,
		|	МАКСИМУМ(ТаблЗаказа.Зарезервированно) КАК Зарезервированно,
		|	МАКСИМУМ(ТаблЗаказа.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	МАКСИМУМ(ТаблЗаказа.Собрано) КАК Собрано,
		|	МАКСИМУМ(ТаблЗаказа.Собирается) КАК Собирается,
		|	СУММА(ТаблЗаказа.ОтказПоставщика) КАК ОтказПоставщика,
		|	СУММА(ТаблЗаказа.ОтказКлиента) КАК ОтказКлиента,
		|	СУММА(ТаблЗаказа.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		|	МАКСИМУМ(ТаблЗаказа.Выполнен) КАК Выполнен,
		|	ТаблЗаказа.Комментарий,
		|	МАКСИМУМ(ТаблЗаказа.Доставлено) КАК Доставлено,
		|	МАКСИМУМ(ТаблЗаказа.НаДоставке) КАК НаДоставке,
		|	МАКСИМУМ(ТаблЗаказа.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		|	ТаблЗаказа.IDLIN,
		|	МИНИМУМ(ТаблЗаказа.СтатусAvarda) КАК СтатусAvarda,
		|	СУММА(ТаблЗаказа.ОтказИстекСрок) КАК ОтказИстекСрок,
		|	ТаблЗаказа.СтатусПоДопПостащику
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Заказ,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.Цена,
		|	ТаблЗаказа.Комментарий,
		|	ТаблЗаказа.IDLIN,
		|	ТаблЗаказа.СтатусПоДопПостащику
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Заказ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка) КАК СФ,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата) КАК ДатаДок,
		|	ИтоговаяТаблица.Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		|							ТОГДА ПродажиОбороты.КоличествоОборот
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			ИНАЧЕ ПродажиОбороты.КоличествоОборот
		|		КОНЕЦ) КАК ДоставленоПоСФ,
		|	СчетФактураВыданный.ДокументПродажи,
		|	ЕСТЬNULL(СчетФактураВыданный.ДокументПродажи.ТаксиДоставка, ЛОЖЬ) КАК ТаксиДоставка
		|ПОМЕСТИТЬ СФВыданный
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		|				&ДатаНач,
		|				,
		|				,
		|				(ЗаказПокупателя, Номенклатура) В
		|					(ВЫБРАТЬ
		|						ТаблЧасть.Заказ,
		|						ТаблЧасть.Номенклатура
		|					ИЗ
		|						ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		|				ЗначенияСвойствОбъектов.Значение КАК Значение
		|			ИЗ
		|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		|			ГДЕ
		|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		|			ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				ПродажиОбороты.Номенклатура КАК Номенклатура,
		|				ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		|				ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		|				СчетФактураВыданный.Ссылка КАК СФ
		|			ИЗ
		|				РегистрНакопления.Продажи.Обороты(
		|						,
		|						,
		|						Регистратор,
		|						(ЗаказПокупателя, Номенклатура) В
		|							(ВЫБРАТЬ
		|								ТаблЧасть.Заказ,
		|								ТаблЧасть.Номенклатура
		|							ИЗ
		|								ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|					ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументОснование
		|			ГДЕ
		|				СчетФактураВыданный.Проведен = ИСТИНА) КАК СчетФактураВыданный
		|			ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументПродажи
		|		ПО ИтоговаяТаблица.Заказ = ПродажиОбороты.ЗаказПокупателя
		|			И ИтоговаяТаблица.Номенклатура = ПродажиОбороты.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Заказ,
		|	ИтоговаяТаблица.Номенклатура,
		|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка),
		|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата),
		|	СчетФактураВыданный.ДокументПродажи,
		|	ЕСТЬNULL(СчетФактураВыданный.ДокументПродажи.ТаксиДоставка, ЛОЖЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СФВыданный.Заказ,
		|	СФВыданный.СФ,
		|	СФВыданный.ДатаДок,
		|	СФВыданный.Номенклатура,
		|	СФВыданный.ДоставленоПоСФ,
		|	СФВыданный.ДокументПродажи,
		|	ВЫБОР
		|		КОГДА СФВыданный.ТаксиДоставка
		|			ТОГДА ЕСТЬNULL(Грузоместа.Ссылка, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК КолГрузомест,
		|	СФВыданный.ТаксиДоставка
		|ПОМЕСТИТЬ СФВыданныйИтог
		|ИЗ
		|	СФВыданный КАК СФВыданный
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМестоТовары.Ссылка) КАК Ссылка,
		|			ГрузовоеМестоТовары.Заказ КАК Заказ
		|		ИЗ
		|			СФВыданный КАК СФВыданный
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		|				ПО СФВыданный.Заказ = ГрузовоеМестоТовары.Заказ
		|					И СФВыданный.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		|					И СФВыданный.ДокументПродажи = ГрузовоеМестоТовары.Ссылка.РеализацияСамовывоза
		|					И (ГрузовоеМестоТовары.Ссылка.Проведен)
		|					И (ГрузовоеМестоТовары.Ссылка.Погружено)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрузовоеМестоТовары.Заказ) КАК Грузоместа
		|		ПО СФВыданный.Заказ = Грузоместа.Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ИтоговаяТаблица.Заказ) КАК Ссылка,
		|	МАКСИМУМ(СФВыданныйИтог.СФ) КАК СсылкаНаСф,
		|	МАКСИМУМ(СправочникНоменклатура.Код) КАК INV_NUM,
		|	МАКСИМУМ(ИтоговаяТаблица.Заказ.ВалютаДокумента.Наименование) КАК VALUTA,
		|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК KOEF,
		|	МАКСИМУМ(0) КАК KOL_VO,
		|	МИНИМУМ(ИтоговаяТаблица.Цена) КАК PRICE,
		|	МАКСИМУМ(0) КАК SUMMA,
		|	МАКСИМУМ(СправочникНоменклатура.КодПроизводителя) КАК ARTICUL,
		|	МАКСИМУМ(СправочникНоменклатура.Наименование) КАК TOVAR_NAME,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СправочникНоменклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА """"
		|			ИНАЧЕ СправочникНоменклатура.Родитель.Наименование
		|		КОНЕЦ) КАК BREND,
		|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков.Наименование) КАК ED_IZM,
		|	МАКСИМУМ("" "") КАК STATUS,
		|	МАКСИМУМ(ИтоговаяТаблица.Заказано) КАК Заказано,
		|	МАКСИМУМ(ИтоговаяТаблица.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		|	МАКСИМУМ(ИтоговаяТаблица.Зарезервированно - ИтоговаяТаблица.Заказано - ИтоговаяТаблица.Выполнен) КАК Зарезервированно,
		|	МАКСИМУМ(ИтоговаяТаблица.Собирается) КАК Собирается,
		|	МАКСИМУМ(ИтоговаяТаблица.Собрано) КАК Собрано,
		|	МАКСИМУМ(ИтоговаяТаблица.ОтказКлиента) КАК ОтказКлиента,
		|	МАКСИМУМ(ИтоговаяТаблица.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		|	МАКСИМУМ(ИтоговаяТаблица.ОтказПоставщика) КАК ОтказПоставщика,
		|	МАКСИМУМ(ИтоговаяТаблица.ОтказИстекСрок) КАК ОтказИстекСрок,
		|	МАКСИМУМ(ИтоговаяТаблица.Выполнен) КАК Выполнен,
		|	МАКСИМУМ(ИтоговаяТаблица.Заказано - ИтоговаяТаблица.Выполнен) КАК KOL_VO_MINUS,
		|	МАКСИМУМ(ИтоговаяТаблица.Заказ.ДатаОтгрузки) КАК PLAN_DATE,
		|	МАКСИМУМ(ИтоговаяТаблица.Комментарий) КАК Комментарий,
		|	ЕСТЬNULL(СФВыданныйИтог.ДатаДок, """") КАК ДатаДок,
		|	МАКСИМУМ(ИтоговаяТаблица.Доставлено) КАК Доставлено,
		|	МАКСИМУМ(ИтоговаяТаблица.НаДоставке) КАК НаДоставке,
		|	МАКСИМУМ(ИтоговаяТаблица.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		|	СУММА(ЕСТЬNULL(СФВыданныйИтог.ДоставленоПоСФ, 0)) КАК ДоставленоПоСФ,
		|	МАКСИМУМ(ИтоговаяТаблица.IDLIN) КАК IDLIN,
		|	МАКСИМУМ(ИтоговаяТаблица.СтатусAvarda) КАК СтатусAvarda,
		|	МАКСИМУМ(ИтоговаяТаблица.СтатусПоДопПостащику) КАК СтатусПоДопПостащику,
		|	СФВыданныйИтог.ДокументПродажи,
		|	СУММА(СФВыданныйИтог.КолГрузомест) КАК КолГрузомест,
		|	МАКСИМУМ(СФВыданныйИтог.ТаксиДоставка) КАК ТаксиДоставка
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ИтоговаяТаблица.Номенклатура = СправочникНоменклатура.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ СФВыданныйИтог КАК СФВыданныйИтог
		|		ПО ИтоговаяТаблица.Заказ = СФВыданныйИтог.Заказ
		|			И ИтоговаяТаблица.Номенклатура = СФВыданныйИтог.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтоговаяТаблица.Номенклатура,
		|	ЕСТЬNULL(СФВыданныйИтог.ДатаДок, """"),
		|	СФВыданныйИтог.ДокументПродажи
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	TOVAR_NAME";
		//"ВЫБРАТЬ
		//|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		//|	ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
		//|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		//|	ЗаказПокупателяТовары.Цена,
		//|	МАКСИМУМ(ЗаказПокупателяТовары.Комментарий) КАК Комментарий,
		//|	ВЫБОР
		//|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		//|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		//|		ИНАЧЕ """"
		//|	КОНЕЦ КАК IDLIN,
		//|	МАКСИМУМ(ВЫБОР
		//|			КОГДА СобственныеСклады.Ссылка ЕСТЬ NULL
		//|					ИЛИ СобственныеСклады.Ссылка = ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
		//|					ИЛИ НЕ СобственныеСклады.ИсключитьИзОбщегоЭкспресса
		//|				ТОГДА """"
		//|			ИНАЧЕ СобственныеСклады.СкладПоставщикаДляСтатусовНаПортале
		//|		КОНЕЦ) КАК СкладДляПортала
		//|ПОМЕСТИТЬ СгруппТаблЧасть
		//|ИЗ
		//|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СобственныеСклады КАК СобственныеСклады
		//|		ПО ЗаказПокупателяТовары.Ссылка.IDСклада = СобственныеСклады.Идентификатор
		//|ГДЕ
		//|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
		//|	И НЕ ЗаказПокупателяТовары.ТолькоРезерв
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказПокупателяТовары.Ссылка,
		//|	ЗаказПокупателяТовары.Номенклатура,
		//|	ЗаказПокупателяТовары.Цена,
		//|	ВЫБОР
		//|		КОГДА &РазрешеноРедактироватьЗаказ = ИСТИНА
		//|			ТОГДА ЗаказПокупателяТовары.КлючСтроки
		//|		ИНАЧЕ """"
		//|	КОНЕЦ
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Заказ,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		//|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура,
		//|	МИНИМУМ(ИсторияХраненияИзмененийЗагружСтатусов.Статус) КАК СтатусAvarda,
		//|	ИсторияХраненияИзмененийЗагружСтатусов.Документ.Контрагент
		//|ПОМЕСТИТЬ ИсторияСтатусовAvarda
		//|ИЗ
		//|	РегистрСведений.ИсторияХраненияИзмененийЗагружСтатусов КАК ИсторияХраненияИзмененийЗагружСтатусов
		//|ГДЕ
		//|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя = &ЗаказПараметр
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		//|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура,
		//|	ИсторияХраненияИзмененийЗагружСтатусов.Документ.Контрагент
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ИсторияХраненияИзмененийЗагружСтатусов.ЗаказПокупателя,
		//|	ИсторияХраненияИзмененийЗагружСтатусов.Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	Т1.Заказ,
		//|	Т1.Номенклатура,
		//|	Т1.Количество,
		//|	Т1.Цена,
		//|	Т1.Комментарий,
		//|	Т1.IDLIN,
		//|	ЕСТЬNULL(Т2.СтатусAvarda, """") КАК СтатусAvarda,
		//|	ВЫБОР
		//|		КОГДА НЕ Т1.СкладДляПортала = """"
		//|			ТОГДА Т1.СкладДляПортала
		//|		ИНАЧЕ ВЫБОР
		//|				КОГДА Константы.ДопПоставщик = Т2.ДокументКонтрагент
		//|					ТОГДА Константы.СкладДопПоставщикаДляСтатусовНаПортале
		//|				ИНАЧЕ ""ЦС в Москве""
		//|			КОНЕЦ
		//|	КОНЕЦ КАК СтатусПоДопПостащику
		//|ПОМЕСТИТЬ ТаблЧасть
		//|ИЗ
		//|	СгруппТаблЧасть КАК Т1
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ИсторияСтатусовAvarda КАК Т2
		//|		ПО Т1.Заказ = Т2.ЗаказПокупателя
		//|			И Т1.Номенклатура = Т2.Номенклатура,
		//|	(ВЫБРАТЬ
		//|		ВЫБОР
		//|			КОГДА Константы.ОтправлятьЗаказыВСтророннююУТ11
		//|				ТОГДА Константы.ДопПоставщик
		//|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		//|		КОНЕЦ КАК ДопПоставщик,
		//|		Константы.СкладДопПоставщикаДляСтатусовНаПортале КАК СкладДопПоставщикаДляСтатусовНаПортале
		//|	ИЗ
		//|		Константы КАК Константы) КАК Константы
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Т1.Заказ,
		//|	Т1.Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения ЕСТЬ NULL
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫБОР
		//|					КОГДА ЗаказыПокупателейОтказПоставщика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		//|						ТОГДА ЗаказыПокупателейОтказПоставщика.Количество * -1
		//|					ИНАЧЕ ЗаказыПокупателейОтказПоставщика.Количество
		//|				КОНЕЦ
		//|		КОНЕЦ) КАК КоличествоОтказПоставщика,
		//|	0 КАК КоличествоИстекСрок,
		//|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	ЗаказыПокупателейОтказПоставщика.Номенклатура КАК Номенклатура
		//|ПОМЕСТИТЬ ЗаказыПокупателейОтказПоставщика
		//|ИЗ
		//|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказПоставщика
		//|ГДЕ
		//|	(ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказПоставщика)
		//|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недопоставка)
		//|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Недостача)
		//|			ИЛИ ЗаказыПокупателейОтказПоставщика.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.Пересорт))
		//|	И (ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя, ЗаказыПокупателейОтказПоставщика.Номенклатура) В
		//|			(ВЫБРАТЬ
		//|				ТаблЧасть.Заказ,
		//|				ТаблЧасть.Номенклатура
		//|			ИЗ
		//|				ТаблЧасть КАК ТаблЧасть)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя,
		//|	ЗаказыПокупателейОтказПоставщика.Номенклатура
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	0,
		//|	ВЫБОР
		//|		КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения ЕСТЬ NULL
		//|			ТОГДА 0
		//|		ИНАЧЕ ВЫБОР
		//|				КОГДА ЗаказыПокупателейИстекСрок.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		//|					ТОГДА ЗаказыПокупателейИстекСрок.Количество * -1
		//|				ИНАЧЕ ЗаказыПокупателейИстекСрок.Количество
		//|			КОНЕЦ
		//|	КОНЕЦ,
		//|	ЗаказыПокупателейИстекСрок.ЗаказПокупателя,
		//|	ЗаказыПокупателейИстекСрок.Номенклатура
		//|ИЗ
		//|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейИстекСрок
		//|ГДЕ
		//|	(ЗаказыПокупателейИстекСрок.ЗаказПокупателя, ЗаказыПокупателейИстекСрок.Номенклатура) В
		//|			(ВЫБРАТЬ
		//|				ТаблЧасть.Заказ,
		//|				ТаблЧасть.Номенклатура
		//|			ИЗ
		//|				ТаблЧасть КАК ТаблЧасть)
		//|	И ЗаказыПокупателейИстекСрок.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ИстекСрокРезервирования)
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ЗаказПокупателя,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	СУММА(ВЫБОР
		//|			КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения ЕСТЬ NULL
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫБОР
		//|					КОГДА ЗаказыПокупателейОтказКлиента.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		//|						ТОГДА ЗаказыПокупателейОтказКлиента.Количество * -1
		//|					ИНАЧЕ ЗаказыПокупателейОтказКлиента.Количество
		//|				КОНЕЦ
		//|		КОНЕЦ) КАК КоличествоОтказКлиента,
		//|	СУММА(0) КАК КоличествоОшибкаКратности,
		//|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя КАК ЗаказПокупателя,
		//|	ЗаказыПокупателейОтказКлиента.Номенклатура КАК Номенклатура
		//|ПОМЕСТИТЬ ЗаказыПокупателейОтказКлиента
		//|ИЗ
		//|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОтказКлиента
		//|ГДЕ
		//|	(ЗаказыПокупателейОтказКлиента.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОтказКлиента)
		//|			ИЛИ ЗаказыПокупателейОтказКлиента.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей)
		//|	И (ЗаказыПокупателейОтказКлиента.ЗаказПокупателя, ЗаказыПокупателейОтказКлиента.Номенклатура) В
		//|			(ВЫБРАТЬ
		//|				ТаблЧасть.Заказ,
		//|				ТаблЧасть.Номенклатура
		//|			ИЗ
		//|				ТаблЧасть КАК ТаблЧасть)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказыПокупателейОтказКлиента.ЗаказПокупателя,
		//|	ЗаказыПокупателейОтказКлиента.Номенклатура
		//|
		//|ОБЪЕДИНИТЬ ВСЕ
		//|
		//|ВЫБРАТЬ
		//|	СУММА(0),
		//|	СУММА(ВЫБОР
		//|			КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения ЕСТЬ NULL
		//|				ТОГДА 0
		//|			ИНАЧЕ ВЫБОР
		//|					КОГДА ЗаказыПокупателейОшибкаКратности.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		//|						ТОГДА ЗаказыПокупателейОшибкаКратности.Количество * -1
		//|					ИНАЧЕ ЗаказыПокупателейОшибкаКратности.Количество
		//|				КОНЕЦ
		//|		КОНЕЦ),
		//|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		//|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		//|ИЗ
		//|	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателейОшибкаКратности
		//|ГДЕ
		//|	(ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя, ЗаказыПокупателейОшибкаКратности.Номенклатура) В
		//|			(ВЫБРАТЬ
		//|				ТаблЧасть.Заказ,
		//|				ТаблЧасть.Номенклатура
		//|			ИЗ
		//|				ТаблЧасть КАК ТаблЧасть)
		//|	И ЗаказыПокупателейОшибкаКратности.Причина = ЗНАЧЕНИЕ(Перечисление.ПричиныКорректировкиСборки.ОшибкаКратности)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ЗаказыПокупателейОшибкаКратности.ЗаказПокупателя,
		//|	ЗаказыПокупателейОшибкаКратности.Номенклатура
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ЗаказПокупателя,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ГрузовоеМестоТовары.Номенклатура,
		//|	ГрузовоеМестоТовары.Заказ КАК Заказ,
		//|	СУММА(ГрузовоеМестоТовары.Количество) КАК КоличествоПереданноеНаДоставку
		//|ПОМЕСТИТЬ ТабПереданныеНаДоставку
		//|ИЗ
		//|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		//|ГДЕ
		//|	ГрузовоеМестоТовары.Ссылка.Проведен = ИСТИНА
		//|	И ГрузовоеМестоТовары.Ссылка.Погружено = ИСТИНА
		//|	И ГрузовоеМестоТовары.Ссылка.Дата >= &ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал
		//|	И (ГрузовоеМестоТовары.Заказ, ГрузовоеМестоТовары.Номенклатура) В
		//|			(ВЫБРАТЬ
		//|				ТаблЧасть.Заказ,
		//|				ТаблЧасть.Номенклатура
		//|			ИЗ
		//|				ТаблЧасть КАК ТаблЧасть)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ГрузовоеМестоТовары.Номенклатура,
		//|	ГрузовоеМестоТовары.Заказ
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Заказ,
		//|	КоличествоПереданноеНаДоставку
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	СобраноПоЗаказу.Заказ КАК Заказ,
		//|	СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		//|	СУММА(ЕСТЬNULL(СобраноПоЗаказу.Количество, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0)) КАК КоличествоСобранноеПоЗаказу
		//|ПОМЕСТИТЬ ТабСобраноПоЗаказу
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		СобраноПоЗаказу.Заказ КАК Заказ,
		//|		СобраноПоЗаказу.Номенклатура КАК Номенклатура,
		//|		СУММА(ЕСТЬNULL(СобраноПоЗаказу.КоличествоОборот, 0)) КАК Количество
		//|	ИЗ
		//|		РегистрНакопления.СобраноПоЗаказу.Обороты(
		//|				&ДатаНач,
		//|				,
		//|				,
		//|				(Заказ, Номенклатура) В
		//|					(ВЫБРАТЬ
		//|						ТаблЧасть.Заказ,
		//|						ТаблЧасть.Номенклатура
		//|					ИЗ
		//|						ТаблЧасть КАК ТаблЧасть)) КАК СобраноПоЗаказу
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		СобраноПоЗаказу.Номенклатура,
		//|		СобраноПоЗаказу.Заказ) КАК СобраноПоЗаказу
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		//|		ПО СобраноПоЗаказу.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		//|			И СобраноПоЗаказу.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	СобраноПоЗаказу.Заказ,
		//|	СобраноПоЗаказу.Номенклатура
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Заказ,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТаблЧасть.Заказ КАК Заказ,
		//|	ТаблЧасть.Номенклатура КАК Номенклатура,
		//|	ТаблЧасть.Цена,
		//|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) - ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) - ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК Заказано,
		//|	ТаблЧасть.Количество - ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0) - ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Зарезервированно,
		//|	ЕСТЬNULL(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток, 0) КАК ЗаказаноПоставщику,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		//|			ТОГДА 0
		//|		ИНАЧЕ ЕСТЬNULL(ТоварыВСборкеОстатки.СобраноОстаток, 0)
		//|	КОНЕЦ КАК Собрано,
		//|	ЕСТЬNULL(ТоварыВСборкеОстатки.КСборкеОстаток, 0) КАК Собирается,
		//|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоОтказПоставщика, 0) КАК ОтказПоставщика,
		//|	ЕСТЬNULL(ЗаказыПокупателейОтказПоставщика.КоличествоИстекСрок, 0) КАК ОтказИстекСрок,
		//|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОтказКлиента, 0) КАК ОтказКлиента,
		//|	ЕСТЬNULL(ЗаказыПокупателейОтказКлиента.КоличествоОшибкаКратности, 0) КАК ОтказОшибкаКратности,
		//|	ЕСТЬNULL(ТабПродажи.КоличествоОборот, 0) КАК Выполнен,
		//|	ТаблЧасть.Комментарий,
		//|	ЕСТЬNULL(ТабПродажи.КоличествоДоставлено, 0) КАК Доставлено,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		//|			ТОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК НаДоставке,
		//|	ВЫБОР
		//|		КОГДА ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0) > 0
		//|			ТОГДА ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПереданныеНаДоставку.КоличествоПереданноеНаДоставку, 0)
		//|		ИНАЧЕ ЕСТЬNULL(ТабСобраноПоЗаказу.КоличествоСобранноеПоЗаказу, 0) - ЕСТЬNULL(ТабПродажи.КоличествоДоставленоДоКорректировок, 0)
		//|	КОНЕЦ КАК ГотовоКПогрузке,
		//|	ТаблЧасть.IDLIN,
		//|	ТаблЧасть.СтатусAvarda,
		//|	ТаблЧасть.СтатусПоДопПостащику
		//|ПОМЕСТИТЬ ТаблЗаказа
		//|ИЗ
		//|	ТаблЧасть КАК ТаблЧасть
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПараметр) КАК ТоварыВРезервеНаСкладахОстатки
		//|		ПО ТаблЧасть.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		//|			И ТаблЧасть.Заказ = ТоварыВРезервеНаСкладахОстатки.ДокументРезерва
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК РазмещениеЗаказовПокупателейОстатки
		//|		ПО ТаблЧасть.Номенклатура = РазмещениеЗаказовПокупателейОстатки.Номенклатура
		//|			И ТаблЧасть.Заказ = РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВСборке.Остатки(, ЗаказПокупателя = &ЗаказПараметр) КАК ТоварыВСборкеОстатки
		//|		ПО ТаблЧасть.Номенклатура = ТоварыВСборкеОстатки.Номенклатура
		//|			И ТаблЧасть.Заказ = ТоварыВСборкеОстатки.ЗаказПокупателя
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказПоставщика КАК ЗаказыПокупателейОтказПоставщика
		//|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказПоставщика.ЗаказПокупателя
		//|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказПоставщика.Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПокупателейОтказКлиента КАК ЗаказыПокупателейОтказКлиента
		//|		ПО ТаблЧасть.Заказ = ЗаказыПокупателейОтказКлиента.ЗаказПокупателя
		//|			И ТаблЧасть.Номенклатура = ЗаказыПокупателейОтказКлиента.Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		//|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
		//|			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		//|			СУММА(ВЫБОР
		//|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		//|						ТОГДА ВЫБОР
		//|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		//|									ТОГДА ВЫБОР
		//|											КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		//|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварДоставляется)
		//|												ТОГДА ПродажиОбороты.КоличествоОборот
		//|											ИНАЧЕ 0
		//|										КОНЕЦ
		//|								ИНАЧЕ ПродажиОбороты.КоличествоОборот
		//|							КОНЕЦ
		//|					ИНАЧЕ 0
		//|				КОНЕЦ) КАК КоличествоДоставлено,
		//|			СУММА(ВЫБОР
		//|					КОГДА ПродажиОбороты.ДокументПродажи <> ЗНАЧЕНИЕ(Документ.РеализациятОваровУслуг.ПустаяСсылка)
		//|						ТОГДА ВЫБОР
		//|								КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		//|									ТОГДА ВЫБОР
		//|											КОГДА (ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		//|													ИЛИ ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварДоставляется))
		//|													И ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		//|												ТОГДА ПродажиОбороты.КоличествоОборот
		//|											ИНАЧЕ 0
		//|										КОНЕЦ
		//|								ИНАЧЕ ВЫБОР
		//|										КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		//|											ТОГДА ПродажиОбороты.КоличествоОборот
		//|										ИНАЧЕ 0
		//|									КОНЕЦ
		//|							КОНЕЦ
		//|					ИНАЧЕ 0
		//|				КОНЕЦ) КАК КоличествоДоставленоДоКорректировок
		//|		ИЗ
		//|			РегистрНакопления.Продажи.Обороты(&ДатаНач, , Регистратор, ЗаказПокупателя = &ЗаказПараметр) КАК ПродажиОбороты
		//|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|					ЗначенияСвойствОбъектов.Объект КАК Объект,
		//|					ЗначенияСвойствОбъектов.Значение КАК Значение
		//|				ИЗ
		//|					РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		//|				ГДЕ
		//|					ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		//|				ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ПродажиОбороты.Номенклатура,
		//|			ПродажиОбороты.ЗаказПокупателя) КАК ТабПродажи
		//|		ПО ТаблЧасть.Заказ = ТабПродажи.ЗаказПокупателя
		//|			И ТаблЧасть.Номенклатура = ТабПродажи.Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПереданныеНаДоставку КАК ТабПереданныеНаДоставку
		//|		ПО ТаблЧасть.Заказ = ТабПереданныеНаДоставку.Заказ
		//|			И ТаблЧасть.Номенклатура = ТабПереданныеНаДоставку.Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ ТабСобраноПоЗаказу КАК ТабСобраноПоЗаказу
		//|		ПО ТаблЧасть.Заказ = ТабСобраноПоЗаказу.Заказ
		//|			И ТаблЧасть.Номенклатура = ТабСобраноПоЗаказу.Номенклатура
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Заказ,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТаблЗаказа.Заказ КАК Заказ,
		//|	ТаблЗаказа.Номенклатура КАК Номенклатура,
		//|	ТаблЗаказа.Цена,
		//|	МАКСИМУМ(ТаблЗаказа.Заказано) КАК Заказано,
		//|	МАКСИМУМ(ТаблЗаказа.Зарезервированно) КАК Зарезервированно,
		//|	МАКСИМУМ(ТаблЗаказа.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		//|	МАКСИМУМ(ТаблЗаказа.Собрано) КАК Собрано,
		//|	МАКСИМУМ(ТаблЗаказа.Собирается) КАК Собирается,
		//|	СУММА(ТаблЗаказа.ОтказПоставщика) КАК ОтказПоставщика,
		//|	СУММА(ТаблЗаказа.ОтказКлиента) КАК ОтказКлиента,
		//|	СУММА(ТаблЗаказа.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		//|	МАКСИМУМ(ТаблЗаказа.Выполнен) КАК Выполнен,
		//|	ТаблЗаказа.Комментарий,
		//|	МАКСИМУМ(ТаблЗаказа.Доставлено) КАК Доставлено,
		//|	МАКСИМУМ(ТаблЗаказа.НаДоставке) КАК НаДоставке,
		//|	МАКСИМУМ(ТаблЗаказа.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		//|	ТаблЗаказа.IDLIN,
		//|	МИНИМУМ(ТаблЗаказа.СтатусAvarda) КАК СтатусAvarda,
		//|	СУММА(ТаблЗаказа.ОтказИстекСрок) КАК ОтказИстекСрок,
		//|	ТаблЗаказа.СтатусПоДопПостащику
		//|ПОМЕСТИТЬ ИтоговаяТаблица
		//|ИЗ
		//|	ТаблЗаказа КАК ТаблЗаказа
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТаблЗаказа.Заказ,
		//|	ТаблЗаказа.Номенклатура,
		//|	ТаблЗаказа.Цена,
		//|	ТаблЗаказа.Комментарий,
		//|	ТаблЗаказа.IDLIN,
		//|	ТаблЗаказа.СтатусПоДопПостащику
		//|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	Заказ,
		//|	Номенклатура
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ИтоговаяТаблица.Заказ,
		//|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка) КАК СФ,
		//|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата) КАК ДатаДок,
		//|	ИтоговаяТаблица.Номенклатура,
		//|	МАКСИМУМ(ВЫБОР
		//|			КОГДА НАЧАЛОПЕРИОДА(ПродажиОбороты.ДокументПродажи.Дата, ДЕНЬ) >= НАЧАЛОПЕРИОДА(&ДатаНачалаВыгрузкиСтатусаДоставкиНаПортал, ДЕНЬ)
		//|				ТОГДА ВЫБОР
		//|						КОГДА ЕСТЬNULL(ЗначенияСвойствОбъектов.Значение, ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварПередан)
		//|							ТОГДА ПродажиОбороты.КоличествоОборот
		//|						ИНАЧЕ 0
		//|					КОНЕЦ
		//|			ИНАЧЕ ПродажиОбороты.КоличествоОборот
		//|		КОНЕЦ) КАК ДоставленоПоСФ,
		//|	СчетФактураВыданный.ДокументПродажи,
		//|	ЕСТЬNULL(СчетФактураВыданный.ДокументПродажи.ТаксиДоставка, ЛОЖЬ) КАК ТаксиДоставка
		//|ПОМЕСТИТЬ СФВыданный
		//|ИЗ
		//|	ИтоговаяТаблица КАК ИтоговаяТаблица
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		//|				&ДатаНач,
		//|				,
		//|				,
		//|				(ЗаказПокупателя, Номенклатура) В
		//|					(ВЫБРАТЬ
		//|						ТаблЧасть.Заказ,
		//|						ТаблЧасть.Номенклатура
		//|					ИЗ
		//|						ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ЗначенияСвойствОбъектов.Объект КАК Объект,
		//|				ЗначенияСвойствОбъектов.Значение КАК Значение
		//|			ИЗ
		//|				РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		//|			ГДЕ
		//|				ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ЗначенияСвойствОбъектов
		//|			ПО ПродажиОбороты.ДокументПродажи = ЗначенияСвойствОбъектов.Объект
		//|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|				ПродажиОбороты.Номенклатура КАК Номенклатура,
		//|				ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
		//|				ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		//|				СчетФактураВыданный.Ссылка КАК СФ
		//|			ИЗ
		//|				РегистрНакопления.Продажи.Обороты(
		//|						,
		//|						,
		//|						Регистратор,
		//|						(ЗаказПокупателя, Номенклатура) В
		//|							(ВЫБРАТЬ
		//|								ТаблЧасть.Заказ,
		//|								ТаблЧасть.Номенклатура
		//|							ИЗ
		//|								ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		//|					ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		//|					ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументОснование
		//|			ГДЕ
		//|				СчетФактураВыданный.Проведен = ИСТИНА) КАК СчетФактураВыданный
		//|			ПО ПродажиОбороты.ДокументПродажи = СчетФактураВыданный.ДокументПродажи
		//|		ПО ИтоговаяТаблица.Заказ = ПродажиОбороты.ЗаказПокупателя
		//|			И ИтоговаяТаблица.Номенклатура = ПродажиОбороты.Номенклатура
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ИтоговаяТаблица.Заказ,
		//|	ИтоговаяТаблица.Номенклатура,
		//|	ЕСТЬNULL(СчетФактураВыданный.СФ, ПродажиОбороты.ДокументПродажи.Ссылка),
		//|	ЕСТЬNULL(СчетФактураВыданный.СФ.Дата, ПродажиОбороты.ДокументПродажи.Дата),
		//|	СчетФактураВыданный.ДокументПродажи,
		//|	ЕСТЬNULL(СчетФактураВыданный.ДокументПродажи.ТаксиДоставка, ЛОЖЬ)
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	СФВыданный.Заказ,
		//|	СФВыданный.СФ,
		//|	СФВыданный.ДатаДок,
		//|	СФВыданный.Номенклатура,
		//|	СФВыданный.ДоставленоПоСФ,
		//|	СФВыданный.ДокументПродажи,
		//|	ВЫБОР
		//|		КОГДА СФВыданный.ТаксиДоставка
		//|			ТОГДА ЕСТЬNULL(Грузоместа.Ссылка, 0)
		//|		ИНАЧЕ 0
		//|	КОНЕЦ КАК КолГрузомест,
		//|	СФВыданный.ТаксиДоставка
		//|ПОМЕСТИТЬ СФВыданныйИтог
		//|ИЗ
		//|	СФВыданный КАК СФВыданный
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМестоТовары.Ссылка) КАК Ссылка,
		//|			ГрузовоеМестоТовары.Заказ КАК Заказ
		//|		ИЗ
		//|			СФВыданный КАК СФВыданный
		//|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
		//|				ПО СФВыданный.Заказ = ГрузовоеМестоТовары.Заказ
		//|					И СФВыданный.Номенклатура = ГрузовоеМестоТовары.Номенклатура
		//|					И СФВыданный.ДокументПродажи = ГрузовоеМестоТовары.Ссылка.РеализацияСамовывоза
		//|					И (ГрузовоеМестоТовары.Ссылка.Проведен)
		//|					И (ГрузовоеМестоТовары.Ссылка.Погружено)
		//|		
		//|		СГРУППИРОВАТЬ ПО
		//|			ГрузовоеМестоТовары.Заказ) КАК Грузоместа
		//|		ПО СФВыданный.Заказ = Грузоместа.Заказ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ РАЗЛИЧНЫЕ
		//|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		//|	МАКСИМУМ(ИтоговаяТаблица.Заказ) КАК Ссылка,
		//|	МАКСИМУМ(СФВыданныйИтог.СФ) КАК СсылкаНаСф,
		//|	МАКСИМУМ(СправочникНоменклатура.Код) КАК INV_NUM,
		//|	МАКСИМУМ(ИтоговаяТаблица.Заказ.ВалютаДокумента.Наименование) КАК VALUTA,
		//|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков.Коэффициент) КАК KOEF,
		//|	МАКСИМУМ(0) КАК KOL_VO,
		//|	МИНИМУМ(ИтоговаяТаблица.Цена) КАК PRICE,
		//|	МАКСИМУМ(0) КАК SUMMA,
		//|	МАКСИМУМ(СправочникНоменклатура.КодПроизводителя) КАК ARTICUL,
		//|	МАКСИМУМ(СправочникНоменклатура.Наименование) КАК TOVAR_NAME,
		//|	МАКСИМУМ(ВЫБОР
		//|			КОГДА СправочникНоменклатура.Родитель = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		//|				ТОГДА """"
		//|			ИНАЧЕ СправочникНоменклатура.Родитель.Наименование
		//|		КОНЕЦ) КАК BREND,
		//|	МАКСИМУМ(СправочникНоменклатура.ЕдиницаХраненияОстатков.Наименование) КАК ED_IZM,
		//|	МАКСИМУМ("" "") КАК STATUS,
		//|	МАКСИМУМ(ИтоговаяТаблица.Заказано) КАК Заказано,
		//|	МАКСИМУМ(ИтоговаяТаблица.ЗаказаноПоставщику) КАК ЗаказаноПоставщику,
		//|	МАКСИМУМ(ИтоговаяТаблица.Зарезервированно - ИтоговаяТаблица.Заказано - ИтоговаяТаблица.Выполнен) КАК Зарезервированно,
		//|	МАКСИМУМ(ИтоговаяТаблица.Собирается) КАК Собирается,
		//|	МАКСИМУМ(ИтоговаяТаблица.Собрано) КАК Собрано,
		//|	МАКСИМУМ(ИтоговаяТаблица.ОтказКлиента) КАК ОтказКлиента,
		//|	МАКСИМУМ(ИтоговаяТаблица.ОтказОшибкаКратности) КАК ОтказОшибкаКратности,
		//|	МАКСИМУМ(ИтоговаяТаблица.ОтказПоставщика) КАК ОтказПоставщика,
		//|	МАКСИМУМ(ИтоговаяТаблица.ОтказИстекСрок) КАК ОтказИстекСрок,
		//|	МАКСИМУМ(ИтоговаяТаблица.Выполнен) КАК Выполнен,
		//|	МАКСИМУМ(ИтоговаяТаблица.Заказано - ИтоговаяТаблица.Выполнен) КАК KOL_VO_MINUS,
		//|	МАКСИМУМ(ИтоговаяТаблица.Заказ.ДатаОтгрузки) КАК PLAN_DATE,
		//|	МАКСИМУМ(ИтоговаяТаблица.Комментарий) КАК Комментарий,
		//|	ЕСТЬNULL(СФВыданныйИтог.ДатаДок, """") КАК ДатаДок,
		//|	МАКСИМУМ(ИтоговаяТаблица.Доставлено) КАК Доставлено,
		//|	МАКСИМУМ(ИтоговаяТаблица.НаДоставке) КАК НаДоставке,
		//|	МАКСИМУМ(ИтоговаяТаблица.ГотовоКПогрузке) КАК ГотовоКПогрузке,
		//|	СУММА(ЕСТЬNULL(СФВыданныйИтог.ДоставленоПоСФ, 0)) КАК ДоставленоПоСФ,
		//|	МАКСИМУМ(ИтоговаяТаблица.IDLIN) КАК IDLIN,
		//|	МАКСИМУМ(ИтоговаяТаблица.СтатусAvarda) КАК СтатусAvarda,
		//|	МАКСИМУМ(ИтоговаяТаблица.СтатусПоДопПостащику) КАК СтатусПоДопПостащику,
		//|	СФВыданныйИтог.ДокументПродажи,
		//|	СУММА(СФВыданныйИтог.КолГрузомест) КАК КолГрузомест,
		//|	МАКСИМУМ(СФВыданныйИтог.ТаксиДоставка) КАК ТаксиДоставка
		//|ИЗ
		//|	ИтоговаяТаблица КАК ИтоговаяТаблица
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		//|		ПО ИтоговаяТаблица.Номенклатура = СправочникНоменклатура.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ СФВыданныйИтог КАК СФВыданныйИтог
		//|		ПО ИтоговаяТаблица.Заказ = СФВыданныйИтог.Заказ
		//|			И ИтоговаяТаблица.Номенклатура = СФВыданныйИтог.Номенклатура
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ИтоговаяТаблица.Номенклатура,
		//|	ЕСТЬNULL(СФВыданныйИтог.ДатаДок, """"),
		//|	СФВыданныйИтог.ДокументПродажи
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Ссылка,
		//|	TOVAR_NAME";        
        //-Кабанов А.В. 04.12.2024 #UT10-4970
		
		РезультатПоСтрокамЗаказа = ЗапросПоСтрокамЗаказа.Выполнить();  
		
		Если НЕ РезультатПоСтрокамЗаказа.Пустой() Тогда
			ТаблицаРезультата = РезультатПоСтрокамЗаказа.Выгрузить();
		Иначе                                                        
			
			ЗапросПоСтрокамЗаказа.Текст =
			"ВЫБРАТЬ
			|	ЗаказПокупателяТовары.Ссылка,
			|	ЗаказПокупателяТовары.КлючСтроки КАК IDLIN,
			|	ЗаказПокупателяТовары.Ссылка.Дата КАК ДатаДок,
			|	"""" КАК СсылкаНаСф,
			|	ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки КАК PLAN_DATE,
			|	ЗаказПокупателяТовары.Номенклатура,
			|	ЗаказПокупателяТовары.Цена КАК PRICE,
			|	ЗаказПокупателяТовары.Комментарий,
			|	0 КАК ЗаказаноПоставщику,
			|	0 КАК Заказано,
			|	0 КАК Собирается,
			|	0 КАК Собрано,
			|	0 КАК Зарезервированно,
			|	0 КАК KOL_VO_MINUS,
			|	ЗаказПокупателяТовары.Номенклатура.Родитель.Наименование КАК BREND,
			|	ЗаказПокупателяТовары.Номенклатура.Наименование КАК TOVAR_NAME,
			|	ЗаказПокупателяТовары.Номенклатура.КодПроизводителя КАК ARTICUL
			|ИЗ
			|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
			|ГДЕ
			|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
			|	И ЗаказПокупателяТовары.ТолькоРезерв";   
			
			ТаблицаРезультата = ЗапросПоСтрокамЗаказа.Выполнить().Выгрузить();  
			
		КонецЕсли;       
		
		ЗапросПоСтрокамЗаказаРезерв = Новый Запрос;
		ЗапросПоСтрокамЗаказаРезерв.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.КлючСтроки КАК IDLIN,
		|	ЗаказПокупателяТовары.Ссылка.Дата КАК ДатаДок,
		|	"""" КАК СсылкаНаСф,
		|	ЗаказПокупателяТовары.Ссылка.ДатаОтгрузки КАК PLAN_DATE,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.Цена КАК PRICE,
		|	ЗаказПокупателяТовары.Комментарий,
		|	0 КАК ЗаказаноПоставщику,
		|	0 КАК Заказано,
		|	0 КАК Собирается,
		|	0 КАК Собрано,
		|	0 КАК Зарезервированно,
		|	0 КАК KOL_VO_MINUS,
		|	ЗаказПокупателяТовары.Номенклатура.Родитель.Наименование КАК BREND,
		|	ЗаказПокупателяТовары.Номенклатура.Наименование КАК TOVAR_NAME,
		|	ЗаказПокупателяТовары.Номенклатура.КодПроизводителя КАК ARTICUL
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &ЗаказПараметр
		|	И ЗаказПокупателяТовары.ТолькоРезерв";  
		
		ЗапросПоСтрокамЗаказаРезерв.УстановитьПараметр("ЗаказПараметр", ДокументЗаказКлиента);
		ТаблицаРезультатаРезерв = ЗапросПоСтрокамЗаказаРезерв.Выполнить().Выгрузить(); 
		
		Для Каждого СтрокаТаблЧасти Из ДокументЗаказКлиента.Товары Цикл      
			
			ПромКолПоСтроке = СтрокаТаблЧасти.Количество;         
			
			Если СтрокаТаблЧасти.ТолькоРезерв Тогда              
				
				ВыборкаРезультата = ТаблицаРезультатаРезерв.Найти(СтрокаТаблЧасти.Номенклатура, "Номенклатура");
				
				Если НЕ ВыборкаРезультата = Неопределено Тогда   
					
					ПромКолПоСтроке = СтрокаТаблЧасти.Количество;
					ВыборкаРезультата.IDLIN = СтрокаТаблЧасти.КлючСтроки;
					ВыборкаРезультата.KOL_VO_MINUS = ?(ВыборкаРезультата.KOL_VO_MINUS < 0, 0, ВыборкаРезультата.KOL_VO_MINUS);     
					
					Если СтрокаТаблЧасти.ТолькоРезерв Тогда     
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, СтрокаТаблЧасти.Количество, "10;в резерве", Истина, Истина);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						Продолжить;       
						
					КонецЕсли;  
					
				КонецЕсли;	
				
			Иначе				  
				
				ВыборкаРезультата = ТаблицаРезультата.Найти(СтрокаТаблЧасти.Номенклатура, "Номенклатура");    
				
				Если НЕ ВыборкаРезультата = Неопределено Тогда 					 
					
					ВыборкаРезультата.IDLIN = СтрокаТаблЧасти.КлючСтроки;
					ВыборкаРезультата.KOL_VO_MINUS = ?(ВыборкаРезультата.KOL_VO_MINUS<0, 0, ВыборкаРезультата.KOL_VO_MINUS);
					
					Если ВыборкаРезультата.ЗаказаноПоставщику > 0 И НЕ ЗначениеЗаполнено(СтрокаТаблЧасти.Размещение) И НЕ ПромКолПоСтроке = 0 Тогда 
																		
						ИмяПоля      = "ЗаказаноПоставщику";
						Количество   = ВыборкаРезультата.ЗаказаноПоставщику;	
						КодСообщения = 10;                                                                                                         
						СообщениеДляПортала = СформироватьСообщениеДляПортала(ИмяПоля, Количество, ВыборкаРезультата.СтатусAvarda, КодСообщения, Ложь,
						                   ?(ВыборкаРезультата.СтатусПоДопПостащику = "", "ЦС в Москве", ВыборкаРезультата.СтатусПоДопПостащику));

						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ЗаказаноПоставщику, ПромКолПоСтроке), 
						                  СообщениеДляПортала, Истина, СтрокаТаблЧасти.ТолькоРезерв);   
										  
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ЗаказаноПоставщику = ?(ВыборкаРезультата.ЗаказаноПоставщику <= ПромКолПоСтроке, 0, ВыборкаРезультата.ЗаказаноПоставщику - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;    
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли; 
						
					КонецЕсли;
					
					Если ВыборкаРезультата.Доставлено > 0 И НЕ ПромКолПоСтроке = 0 Тогда	
						
						//если есть отгруженные товары без СФ (предусматриваем все, что возможно)                                    
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, 
						                  Мин(ВыборкаРезультата.Доставлено, ПромКолПоСтроке), 
										 ?(ВыборкаРезультата.ТаксиДоставка И КонецДня(ВыборкаРезультата.ДокументПродажи.Дата) = КонецДня(ТекущаяДата()), "60;Такси доставка " 
										  + ?(ВыборкаРезультата.КолГрузомест = 0 , "", "(" + СокрЛП(ВыборкаРезультата.КолГрузомест) + " гр.мест)") + "", "60;выполнен"),
										  Истина, СтрокаТаблЧасти.ТолькоРезерв);  
										  
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.Доставлено = ?(ВыборкаРезультата.Доставлено<=ПромКолПоСтроке, 0, ВыборкаРезультата.Доставлено - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;    
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;   
						
					КонецЕсли;
					
					Если ВыборкаРезультата.Собирается > 0 И НЕ ПромКолПоСтроке = 0 Тогда  
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.Собирается, ПромКолПоСтроке), 
						                 "30;на подборе" , Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.Собирается = ?(ВыборкаРезультата.Собирается <= ПромКолПоСтроке, 0, ВыборкаРезультата.Собирается - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;   
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;  
						
					КонецЕсли;
					
					
					Если ВыборкаРезультата.ОтказКлиента > 0 И НЕ ПромКолПоСтроке = 0 Тогда      
						
						СтрокаВозврата = ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ОтказКлиента, ПромКолПоСтроке), 
						                 "100;отказ покупателя", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ОтказКлиента = ?(ВыборкаРезультата.ОтказКлиента <= ПромКолПоСтроке, 0, ВыборкаРезультата.ОтказКлиента - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;   
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;  
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказПоставщика > 0 И НЕ ПромКолПоСтроке = 0 Тогда 
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ОтказПоставщика, ПромКолПоСтроке), 
						             ?(ВыборкаРезультата.ссылка.ТаксиДоставка, "110;нет на складе", "110;отказ поставщика"), Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ОтказПоставщика = ?(ВыборкаРезультата.ОтказПоставщика <= ПромКолПоСтроке, 0, ВыборкаРезультата.ОтказПоставщика - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказИстекСрок > 0 И НЕ ПромКолПоСтроке = 0 Тогда    
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ОтказИстекСрок, ПромКолПоСтроке), 
						                 "110;истек срок резервирования", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ОтказИстекСрок = ?(ВыборкаРезультата.ОтказИстекСрок <= ПромКолПоСтроке, 0, ВыборкаРезультата.ОтказИстекСрок - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;        
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;  
						
					КонецЕсли;
					
					Если ВыборкаРезультата.ОтказОшибкаКратности > 0 И ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая() И НЕ ПромКолПоСтроке = 0 Тогда
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ОтказОшибкаКратности, ПромКолПоСтроке), 
						                 "110;ошибка кратности", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ОтказОшибкаКратности = ?(ВыборкаРезультата.ОтказОшибкаКратности <= ПромКолПоСтроке, 0, 
						                                        ВыборкаРезультата.ОтказОшибкаКратности - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;         
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить; 
						КонецЕсли; 
						
					КонецЕсли;
					
					Если ВыборкаРезультата.НаДоставке > 0 И НЕ ПромКолПоСтроке = 0 Тогда  
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.НаДоставке, ПромКолПоСтроке), 
						                 "50;на доставке", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.НаДоставке = ?(ВыборкаРезультата.НаДоставке<=ПромКолПоСтроке, 0, ВыборкаРезультата.НаДоставке - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;  
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда
							Продолжить;  
						КонецЕсли; 
						
					КонецЕсли;
					
					
					Если ВыборкаРезультата.ГотовоКПогрузке > 0 И НЕ ПромКолПоСтроке = 0 Тогда    
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.ГотовоКПогрузке, ПромКолПоСтроке), 
						                  "40;готов к отгрузке", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.ГотовоКПогрузке = ?(ВыборкаРезультата.ГотовоКПогрузке <= ПромКолПоСтроке, 0, ВыборкаРезультата.ГотовоКПогрузке - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;         
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;   
						
					КонецЕсли;
					
					Если ВыборкаРезультата.Зарезервированно > 0 И НЕ ПромКолПоСтроке = 0 Тогда    
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.Зарезервированно, ПромКолПоСтроке), 
						                 "10;зарезервирован", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.Зарезервированно = ?(ВыборкаРезультата.Зарезервированно<=ПромКолПоСтроке, 0, ВыборкаРезультата.Зарезервированно - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;  
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;
						
					КонецЕсли;    
					
					Если ВыборкаРезультата.Заказано > 0 И НЕ ПромКолПоСтроке = 0 Тогда  
						
						СтрокаВозврата =  ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Мин(ВыборкаРезультата.Заказано, ПромКолПоСтроке), 
						                 "20;заказан", Истина, СтрокаТаблЧасти.ТолькоРезерв);
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						ВыборкаРезультата.Заказано = ?(ВыборкаРезультата.Заказано <= ПромКолПоСтроке, 0, ВыборкаРезультата.Заказано - ПромКолПоСтроке);
						ПромКолПоСтроке = ПромКолПоСтроке - СтрокаВозврата.KOL_VO;                   
						
						Если СтрокаВозврата.KOL_VO = СтрокаТаблЧасти.Количество Тогда 
							Продолжить;  
						КонецЕсли;	
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли;   
			
		КонецЦикла;		
		
	КонецЕсли;     
	
	Возврат РезультатДляВозвратаПорталу; 
	
КонецФункции

Функция PM_6051_DOC_FOR_PORTAL(ПараметрыОтбора) Экспорт  
		
	пРеализация = СокрЛП(ПараметрыОтбора.DID);
	
	//Теперь на входе СФ входящая, но также оставляю вариант если придет реализация	
	НашлиДокумент = Ложь;
	НашлиДокументСФ = Ложь;
	ДокументСФКлиента = Документы.СчетФактураВыданный.ПолучитьСсылку(Новый УникальныйИдентификатор(пРеализация));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданный.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСФКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда        
		
		ДокументРеализацияКлиента = ДокументСФКлиента.ДокументОснование;
		НашлиДокумент = Истина;
		НашлиДокументСФ = Истина;   
		
	Иначе
		
		// пробуем найти реализацию
		ДокументРеализацияКлиента = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(пРеализация));
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И РеализацияТоваровУслуг.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументРеализацияКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
		
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
			НашлиДокумент = Истина;
		КонецЕсли;              
		
	КонецЕсли;
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6051_DOC_FOR_PORTAL.ПространствоИмен, "RS_PM_6051_DOC_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_6051_DOC_FOR_PORTAL.ПространствоИмен, "Out_PM_6051_DOC_FOR_PORTAL"); 
	
	Если НашлиДокумент Тогда	             
		
		ЗапросПоШапкеРеализация = Новый Запрос;
		ЗапросПоШапкеРеализация.УстановитьПараметр("РеализацияПараметр", ДокументРеализацияКлиента);
		ЗапросПоШапкеРеализация.Текст =  
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Ссылка.Номер КАК DCODE,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.Ссылка.Контрагент.ГоловнойКонтрагент.НеИспользоватьИдентификаторАвардыДляСвязиСПорталом
		|				ИЛИ РеализацияТоваровУслуг.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда = """"
		|			ТОГДА РеализацияТоваровУслуг.Ссылка.Контрагент.ГоловнойКонтрагент.КодМДМ
		|		ИНАЧЕ РеализацияТоваровУслуг.Ссылка.Контрагент.ГоловнойКонтрагент.IDАварда
		|	КОНЕЦ КАК IDKLIENT,
		|	РеализацияТоваровУслуг.Ссылка.Контрагент.ГоловнойКонтрагент.Наименование КАК KLIENT,
		|	РеализацияТоваровУслуг.Ссылка.Дата КАК DDATE1,
		|	РеализацияТоваровУслуг.Ссылка.Контрагент.Наименование КАК FILIAL,
		|	РеализацияТоваровУслуг.Ссылка.ВалютаДокумента.Наименование КАК VALUTA,
		|	""Отгружен"" КАК DSTATE,
		|	РеализацияТоваровУслуг.Ссылка.СуммаДокумента КАК DNUM1,
		|	ЕСТЬNULL(РеализацияТоваровУслуг.Водитель.Наименование, """") КАК VODITEL_NAME,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК MOBILE_VODITEL,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.ТаксиДоставка
		|			ТОГДА ЕСТЬNULL(Грузоместа.Грузоместо, 0)
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Грузомест,
		|	ВЫБОР
		|		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.РозничнаяПродажа
		|				ИЛИ РеализацияТоваровУслуг.ДоговорКонтрагента.ЛицевойСчет
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК FLAGS
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО РеализацияТоваровУслуг.Водитель = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный))
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ГрузовоеМесто.РеализацияСамовывоза КАК Реализация,
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрузовоеМесто.Ссылка) КАК Грузоместо
		|		ИЗ
		|			Документ.ГрузовоеМесто КАК ГрузовоеМесто
		|		ГДЕ
		|			ГрузовоеМесто.РеализацияСамовывоза = &РеализацияПараметр
		|			И ГрузовоеМесто.Проведен
		|			И ГрузовоеМесто.Погружено
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ГрузовоеМесто.РеализацияСамовывоза) КАК Грузоместа
		|		ПО РеализацияТоваровУслуг.Ссылка = Грузоместа.Реализация
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &РеализацияПараметр";	       
		
		РезультатЗапросаШапкиРеализация = ЗапросПоШапкеРеализация.Выполнить(); 
		
		Если НЕ РезультатЗапросаШапкиРеализация.Пустой() Тогда            
			
			ВыборкаРезультата = РезультатЗапросаШапкиРеализация.Выбрать();  
			
			Пока ВыборкаРезультата.Следующий()Цикл                      
				
				СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата);
				
				СтрокаВозврата.IDDOC     = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());				
				СтрокаВозврата.PLAN_DATE_DOSTAVKA = Формат(ВыборкаРезультата.DDATE1, "ДФ=dd.MM.yyyy");
				
				Если НашлиДокументСФ Тогда 
					
					СтрокаВозврата.DCODE = ОбщегоНазначения.ПолучитьНомерНаПечать(ДокументСФКлиента,,,Истина);						
                    //+Кабанов А.В. 16.04.2025 # UT10-5193
					//СтрокаВозврата.FLAGS = 1; 
					СтрокаВозврата.FLAGS = ВыборкаРезультата.FLAGS;
					//-Кабанов А.В. 16.04.2025 # UT10-5193
					
				КонецЕсли;	
				
				
				Если КонецДня(ВыборкаРезультата.Ссылка.Дата) = КонецДня(ТекущаяДата()) И ВыборкаРезультата.Ссылка.ТаксиДоставка И НЕ ВыборкаРезультата.Грузомест = 0 Тогда
					 СтрокаВозврата.DSTATE = "Такси доставка (" + СокрЛП(ВыборкаРезультата.Грузомест) + " гр.мест)";
				 КонецЕсли;	
				 
				РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);          
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;               
	
	Возврат РезультатДляВозвратаПорталу;     
	
КонецФункции

Функция RA_R_RN_LIN(ПараметрыОтбора) Экспорт     
	
	пРеализация = СокрЛП(ПараметрыОтбора.IDDOC);
	
	//Теперь на входе СФ входящая, но также оставляю вариант если придет реализация
	НашлиДокумент = Ложь;
	ДокументСФКлиента = Документы.СчетФактураВыданный.ПолучитьСсылку(Новый УникальныйИдентификатор(пРеализация));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураВыданный.Ссылка
	|ИЗ
	|	Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|ГДЕ
	|	СчетФактураВыданный.Ссылка = &Ссылка
	|	И СчетФактураВыданный.Проведен";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСФКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		
		ДокументРеализацияКлиента = ДокументСФКлиента.ДокументОснование;
		НашлиДокумент = Истина;             
		
	Иначе
		
		// пробуем найти реализацию
		ДокументРеализацияКлиента = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(пРеализация));
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Ссылка = &Ссылка
		|	И РеализацияТоваровУслуг.Проведен";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументРеализацияКлиента);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();  
		
		Если  ВыборкаДетальныеЗаписи.Следующий() Тогда 
			НашлиДокумент = Истина;
		КонецЕсли;       
		
	КонецЕсли;
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.RA_R_RN_LIN.ПространствоИмен, "RS_RA_R_RN_LIN");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.RA_R_RN_LIN.ПространствоИмен, "Out_RA_R_RN_LIN"); 
	
	Если НашлиДокумент Тогда                       
		
		Для Каждого СтрокаРеализации ИЗ ДокументРеализацияКлиента.Товары Цикл  
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.EID = СтрокаРеализации.НомерСтроки;
			СтрокаВозврата.EID2 = СокрЛП(СтрокаРеализации.Номенклатура.Код);
			СтрокаВозврата.PROIZV = СокрЛП(СтрокаРеализации.Номенклатура.Родитель.Наименование);
			СтрокаВозврата.ARTICLE = СокрЛП(СтрокаРеализации.Номенклатура.КодПроизводителя);
			СтрокаВозврата.TOVAR_NAME = СокрЛП(СтрокаРеализации.Номенклатура.Наименование);
			СтрокаВозврата.TOVAR_KOL_V_ED_IZM = СтрокаРеализации.ЕдиницаИзмерения.Коэффициент * СтрокаРеализации.Количество;
			СтрокаВозврата.KOEF_EDIZM = СтрокаРеализации.ЕдиницаИзмерения.Коэффициент;
			СтрокаВозврата.TOVAR_KOL = СтрокаРеализации.Количество;
			СтрокаВозврата.TOVAR_EDIZM = СокрЛП(СтрокаРеализации.ЕдиницаИзмерения.Наименование);
			СтрокаВозврата.TOVAR_PRICE = СтрокаРеализации.Цена;
			СтрокаВозврата.TOVAR_SUMMA = СтрокаРеализации.Сумма;
			СтрокаВозврата.TOVAR_PRIMECH = "";
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);    
			
		КонецЦикла;	
		
	КонецЕсли;  
	
	Возврат РезультатДляВозвратаПорталу; 
	
КонецФункции

Функция PM_GET_BALANCE_FOR_PORTAL(ПараметрыОтбора) Экспорт
	
	пКодКонтрагентаПортал = СтрЗаменить(СокрЛП(ПараметрыОтбора.ID), Символы.НПП, ""); 	
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_BALANCE_FOR_PORTAL.ПространствоИмен, "RS_PM_GET_BALANCE_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_BALANCE_FOR_PORTAL.ПространствоИмен, "Out_PM_GET_BALANCE_FOR_PORTAL");  
	
	Если СтрДлина(пКодКонтрагентаПортал) = 36 Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", пКодКонтрагентаПортал);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", пКодКонтрагентаПортал);	
	КонецЕсли;	
	
	Если НЕ пКонтрагент.Пустая() Тогда                        
		
		Договор = пКонтрагент.ОсновнойДоговорКонтрагента;     
		
		Если ЗначениеЗаполнено(Договор) Тогда   
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	-ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
			|			,
			|			Контрагент = &Контрагент
			|				И ДоговорКонтрагента = &Договор) КАК ВзаиморасчетыСКонтрагентамиОстатки"; 
			
			Запрос.УстановитьПараметр("Контрагент", пКонтрагент);
			Запрос.УстановитьПараметр("Договор", Договор);        
			
			Выб = Запрос.Выполнить().Выбрать();
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Summa_RUB = 0;             
			
			Если Выб.Следующий() Тогда
				СтрокаВозврата.Summa_RUB = Выб.СуммаВзаиморасчетовОстаток;
			КонецЕсли;                       
			
			СтрокаВозврата.Summa_EUR = 0;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			
		Иначе                    
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			СтрокаВозврата.Summa_RUB = 0;
			СтрокаВозврата.Summa_EUR = 0;
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
			
		КонецЕсли; 
		
	КонецЕсли;   
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция PM_CALCULATION_FOR_PORTAL(ПараметрыОтбора) Экспорт
	
	пКодКонтрагентаПортал = СтрЗаменить(СокрЛП(ПараметрыОтбора.KONTRAGENT_ID), Символы.НПП, ""); 	
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_BALANCE_FOR_PORTAL.ПространствоИмен, "RS_PM_CALCULATION_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_GET_BALANCE_FOR_PORTAL.ПространствоИмен, "Out_PM_CALCULATION_FOR_PORTAL");  
	
	Если СтрДлина(пКодКонтрагентаПортал) = 36 Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", пКодКонтрагентаПортал);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", пКодКонтрагентаПортал);	
	КонецЕсли;	
	
	ДатаНач = ?(ЗначениеЗаполнено(ПараметрыОтбора.BDATE), Дата(ПараметрыОтбора.BDATE), Дата("20010101000000"));
	ДатаКон = ?(ЗначениеЗаполнено(ПараметрыОтбора.EDATE), Дата(ПараметрыОтбора.EDATE), Дата("20990101000000"));
	
	ДатаКон = КонецДня(ДатаКон);
	
	Если НЕ пКонтрагент.Пустая() Тогда   
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	0 КАК DID,
		|	ПРЕДСТАВЛЕНИЕ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор.Номер) КАК DCODE, 
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Период КАК DDATE1,
		|	ПРЕДСТАВЛЕНИЕ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент) КАК KONTRAGENT,
		|	ПРЕДСТАВЛЕНИЕ(ТИПЗНАЧЕНИЯ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор)) КАК DOC_TYPE,
		|	""               "" КАК DOC_STATE,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ОплатаПоДоговоруНаличными
		|			ТОГДА ""Нал""
		|		ИНАЧЕ ""Б/Н""
		|	КОНЕЦ КАК FORMA_OPLATY,
		|	ПРЕДСТАВЛЕНИЕ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ВалютаВзаиморасчетов) КАК VALUTA,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход + ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход КАК SUMMA_DOC,
		|	0 КАК DOLG,
		|	"" "" КАК PRIVAZ,
		|	ПРЕДСТАВЛЕНИЕ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент) КАК FILIAL,
		|	0 КАК RASHOD_EURO,
		|	0 КАК PRIHOD_EURO,
		|	0 КАК SALDO_EURO,
		|	""               "" КАК SF,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовРасход КАК PRIHOD_RUB,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовПриход КАК RASHOD_RUB,
		|	-ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток КАК SALDO_RUB,
		|	0 КАК RASHOD_RUB_NAL,
		|	0 КАК PRIHOD_RUB_NAL,
		|	0 КАК SALDO_RUB_NAL,
		|	0 КАК I,
		|	ДОБАВИТЬКДАТЕ(ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор.Дата, ДЕНЬ, ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности - 1) КАК DDATE2,
		|	0 КАК IS_DEBIT,
		|	0 КАК IS_NAL,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор,
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДопустимоеЧислоДнейЗадолженности,
		|	СчетФактураВыданный.Ссылка КАК СчетФактура,
		|	СчетФактураВыданный.Номер КАК СчетФактураНомер
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.ОстаткиИОбороты(&ДатаНач, &ДатаКон, Регистратор, , Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Регистратор = СчетФактураВыданный.ДокументОснование
		|ГДЕ
		|	ВзаиморасчетыСКонтрагентамиОстаткиИОбороты.Контрагент = &Контрагент"; 
		
		Запрос.УстановитьПараметр("Контрагент", пКонтрагент);
		Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
		Запрос.УстановитьПараметр("ДатаКон", ДатаКон); 
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		ДополнитьТаблицу(ТЗ,пКонтрагент,ДатаНач,ДатаКон);
		
		Если ПараметрыОтбора.IS_SORT_BY_DOC_DATE = "1" Тогда
			ТЗ.Сортировать("DDATE1 Возр");
		Иначе
			ТЗ.Сортировать("DDATE2 Возр");
		КонецЕсли;                             
		
		Если Константы.СпособКонтроляДнейЗадолженности.Получить() = Перечисления.СпособыКонтроляДнейЗадолженности.ПоРабочимДням Тогда
			РД = Истина;
		Иначе
			РД = Ложь;
		КонецЕсли;      
		
		Для каждого строка из ТЗ Цикл    
			
			Если ЗначениеЗаполнено(Строка.DCODE) Тогда    
				
				СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, Строка);  
				
				Если РД Тогда     
					
					// считаем по производственному календарю
					ДнейЗадолженности	=	?(строка.ДопустимоеЧислоДнейЗадолженности >= 1,строка.ДопустимоеЧислоДнейЗадолженности, 0);
					СтрокаВозврата.DDATE2 = ?(ДнейЗадолженности = 0, строка.DDATE1,  ЗаполнениеДокументов.ОпределитьДату(строка.DDATE1, ДнейЗадолженности));
					
				КонецЕсли;

				РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция PM_PAYMENTS_FOR_PORTAL(ПараметрыОтбора) Экспорт
	
	пКодКонтрагентаПортал = СтрЗаменить(СокрЛП(ПараметрыОтбора.ID), Символы.НПП, ""); 	
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_PAYMENTS_FOR_PORTAL.ПространствоИмен, "RS_PM_PAYMENTS_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PM_PAYMENTS_FOR_PORTAL.ПространствоИмен, "Out_PM_PAYMENTS_FOR_PORTAL");  
	
	ТаблВозврат = Новый ТаблицаЗначений;
	ТаблВозврат.Колонки.Добавить("DATE_OPLATY");
	ТаблВозврат.Колонки.Добавить("DATE_OPLATY_DATE",);
	ТаблВозврат.Колонки.Добавить("VALUTA");
	ТаблВозврат.Колонки.Добавить("SUMMA");
	ТаблВозврат.Колонки.Добавить("VALUTA_ID");
	
	Если СтрДлина(пКодКонтрагентаПортал) = 36 Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", пКодКонтрагентаПортал);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", пКодКонтрагентаПортал);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Тогда
		
		ПоКалендарнымДням = Ложь;        
		
		Если Константы.СпособКонтроляДнейЗадолженности.Получить() = Перечисления.СпособыКонтроляДнейЗадолженности.ПоКалендарнымДням Тогда 
			ПоКалендарнымДням = Истина;
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетовОстаток,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата КАК Дата,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.ВалютаДокумента КАК Валюта,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ДнейЗадолженности,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.ВалютаДокумента.Код КАК КодВалюты
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(, Контрагент = &Контрагент) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки";
		
		Запрос.УстановитьПараметр("Контрагент", пКонтрагент);
		ТЗ = Запрос.Выполнить().Выгрузить();
		
		Для каждого строка из ТЗ Цикл 	
			
			Если ПоКалендарнымДням Тогда 
				ДатаОплаты =   ЗаполнениеДокументов.ОпределитьДатуКалендарныхДней(строка.Дата, строка.ДнейЗадолженности);
				
			Иначе
				ДнейЗадолженности	=	?(строка.ДнейЗадолженности >= 1,строка.ДнейЗадолженности, 0);
				ДатаОплаты 			=	?(ДнейЗадолженности = 0, строка.Дата,  ЗаполнениеДокументов.ОпределитьДату(строка.Дата, ДнейЗадолженности));
				
			КонецЕсли;	
			
			Если НЕ ДатаОплаты =  Неопределено 
				И НЕ ДатаОплаты =  Null
				Тогда 
				
				СтрВозврат = ТаблВозврат.Добавить();      
				СтрВозврат.DATE_OPLATY 		= Строка(Формат(ДатаОплаты, "ДЛФ=Д"));
				СтрВозврат.DATE_OPLATY_DATE = НачалоДня(ДатаОплаты);
				СтрВозврат.VALUTA 			= Строка(Строка.Валюта);
				СтрВозврат.SUMMA 			= Строка.СуммаВзаиморасчетовОстаток;
				СтрВозврат.VALUTA_ID 		= Строка(Строка.КодВалюты);   
				
			КонецЕсли;  
			
		КонецЦикла;
		
		ТаблВозврат.Свернуть("DATE_OPLATY,DATE_OPLATY_DATE,VALUTA,VALUTA_ID", "SUMMA");
		ТаблВозврат.Сортировать("DATE_OPLATY_DATE");  
		
		Для каждого строка из ТаблВозврат Цикл     
			
			СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
			ЗаполнитьЗначенияСвойств(СтрокаВозврата, Строка);
			РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);  
			
		КонецЦикла;    
		
	КонецЕсли;    
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция RA_MOVE_DOC_FOR_PORTAL(Параметры) Экспорт
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL_MSK.ПространствоИмен, "RS_RA_MOVE_DOC_FOR_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	пЗаказКлиента	  = СокрЛП(Параметры.IDDOC);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	Если ДокументЗаказКлиента.Пустая() Тогда	
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Не найден заказ клиента с таким ID";	
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;
	
	ОбъектЗаказа = ДокументЗаказКлиента.ПолучитьОбъект();
	ОбъектЗаказа.ТолькоРезерв = Ложь;
	
	Попытка		
		
		ОбъектЗаказа.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);
		
		РезультатДляВозвратаПорталу.RN_ID = Строка(ДокументЗаказКлиента.УникальныйИдентификатор());
		РезультатДляВозвратаПорталу.RN_DCODE = ДокументЗаказКлиента.Номер;
		РезультатДляВозвратаПорталу.RESULT = 1;
		РезультатДляВозвратаПорталу.MSG = "Заказ успешно снят с резерва и готов к сборке";		
		
	Исключение 		
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Возникла ошибка при записи заказа" + Символы.ПС + ОписаниеОшибки();		
		
	КонецПопытки;  	
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция AZ_A_DOC_6951_DEL_PORTAL(Параметры) Экспорт
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL_MSK.ПространствоИмен, "RS_AZ_A_DOC_6951_DEL_PORTAL");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	пЗаказКлиента	  = СокрЛП(Параметры.DID);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	Если ДокументЗаказКлиента.Пустая() Тогда	
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Не найден заказ клиента с таким ID";	
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;   	
	
	Если МСКWEB.ЕстьСборка(ДокументЗаказКлиента) Тогда
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Заказ уже отправлен на сборку";	
		Возврат РезультатДляВозвратаПорталу;	
		
	КонецЕсли;
	
	Если МСКWEB.ЕстьЗаказПоставщику(ДокументЗаказКлиента) Тогда
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "По заказу уже сформирован заказ поставщику";	
		Возврат РезультатДляВозвратаПорталу;	
		
	КонецЕсли;         		
	
	Попытка	  		
		
		ДокументЗакрытия = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
		ДокументЗакрытия.Заполнить(ДокументЗаказКлиента);
		ДокументЗакрытия.Дата = ТекущаяДата();
		ДокументЗакрытия.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
		ДокументЗакрытия.Комментарий = "Документ сформирован через интернет-портал";
		ДокументЗакрытия.Записать(РежимЗаписиДокумента.Проведение);
		
		Если МСКWEB.ЕстьСборка(ДокументЗаказКлиента) Тогда
			
			ДокументЗакрытия.УстановитьПометкуУдаления(Истина);
			РезультатДляВозвратаПорталу.RESULT = 0;
			РезультатДляВозвратаПорталу.MSG = "Заказ уже отправлен на сборку";
			
		Иначе
			
			РезультатДляВозвратаПорталу.RESULT = 1;
			РезультатДляВозвратаПорталу.MSG = "Заказ успешно отменен!";	 
			
		КонецЕсли;

	Исключение 		
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Возникла ошибка при записи документа снятия резервов" + Символы.ПС + ОписаниеОшибки();		
		
	КонецПопытки;  	
	
	Возврат РезультатДляВозвратаПорталу;

КонецФункции

Функция RA_INS_UPDATE_STROKA_IZ_PORTALA(Параметры) Экспорт
		
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL_MSK.ПространствоИмен, "RS_RA_INS_UPDATE_STROKA_IZ_PORTALA");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	пЗаказКлиента	  = СокрЛП(Параметры.IDDOC);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	Если ДокументЗаказКлиента.Пустая() Тогда	
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Не найден заказ клиента с таким ID";	
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли; 
	
	Если МСКWEB.ЕстьСборка(ДокументЗаказКлиента) Тогда
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Заказ уже отправлен на сборку";
		Возврат РезультатДляВозвратаПорталу;	
		
	КонецЕсли;
	
	Если МСКWEB.ЕстьЗаказПоставщику(ДокументЗаказКлиента) Тогда
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "По заказу уже оформлен заказ поставщику";	
		Возврат РезультатДляВозвратаПорталу;	
		
	КонецЕсли;
	
	пТовар = СокрЛП(Параметры.IDTOVAR); 
	пКоличествоКорректировки = Число(Параметры.KOL);
	
	Попытка
		пНомерСтроки = Число(Параметры.IDLIN);
	Исключение
		пНомерСтроки = Неопределено;
	КонецПопытки;
	
	ИсходноеКоличествоВЗаказе = 0;	
	
	СтруктураОтбора = Новый Структура;
	
	Если ЗначениеЗаполнено(пНомерСтроки) Тогда
		СтруктураОтбора.Вставить("КлючСтроки", пНомерСтроки);
	Иначе
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Не заполнен ID строки";	
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;
	
	СтрокиПоиска = ДокументЗаказКлиента.Товары.НайтиСтроки(СтруктураОтбора);
	
	ДобавляемНовыйТоварЧерезКорректировку = Ложь;
	
	Если СтрокиПоиска.Количество() = 0 Тогда
		
		ДобавляемНовыйТоварЧерезКорректировку = Истина;	
		
		ТоварКорректировки = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(пТовар));
		
		Если ТоварКорректировки.Пустая() Тогда	
			
			РезультатДляВозвратаПорталу.RESULT = 0;
			РезультатДляВозвратаПорталу.MSG = "Не найден товар с таким ID";	
			Возврат РезультатДляВозвратаПорталу;
			
		КонецЕсли;  
		
	ИначеЕсли СтрокиПоиска.Количество() > 1 Тогда
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "В заказе несколько строк с товарами, которые имеют одинаковый ID. Не удается идентифицировать строку корректировки";	
		Возврат РезультатДляВозвратаПорталу;		
		
	Иначе
		
		ИсходноеКоличествоВЗаказе = СтрокиПоиска[0].Количество;
		ТоварКорректировки = СтрокиПоиска[0].Номенклатура;
		
	КонецЕсли;  
	
	Попытка	 
		
		ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
		ДокументКорректировки.Заполнить(ДокументЗаказКлиента);
		ДокументКорректировки.Дата = ТекущаяДата();
		ДокументКорректировки.Комментарий = "Документ сформирован через интернет-портал" + ?(ЗначениеЗаполнено(СокрЛП(Параметры.PRIMECH)), ": " + СокрЛП(Параметры.PRIMECH), "");
		
		СтрокиДляУдаления = Новый СписокЗначений;
		НужнаяСтрокаИзменена = Ложь;
		
		Если Не ДобавляемНовыйТоварЧерезКорректировку Тогда
			
			Для каждого Стр ИЗ ДокументКорректировки.Товары Цикл		
				
				Если Не НужнаяСтрокаИзменена Тогда
					
					Если Стр.Номенклатура <> ТоварКорректировки Тогда
						СтрокиДляУдаления.Добавить(Стр);
					Иначе
						
						Стр.Количество = пКоличествоКорректировки - ИсходноеКоличествоВЗаказе;
						НужнаяСтрокаИзменена = Истина;
						
						ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(Стр, ДокументКорректировки);
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(Стр, ДокументКорректировки);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Стр, ДокументКорректировки);
						
					КонецЕсли;  				
					
				Иначе
					СтрокиДляУдаления.Добавить(Стр);	
				КонецЕсли; 
				
			КонецЦикла;
			
		Иначе
			
			ДокументКорректировки.Товары.Очистить();
			
			НоваяСтрока = ДокументКорректировки.Товары.Добавить();
			НоваяСтрока.Номенклатура = ТоварКорректировки;
			НоваяСтрока.Количество = пКоличествоКорректировки;
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказКлиента;
			
			мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
			
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);
			
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
			ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПродажиТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета, 
			ДокументКорректировки.ЗаказПокупателя.ВалютаДокумента);
			
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);
			
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
			
		КонецЕсли;
		
		Для каждого СтрУ Из СтрокиДляУдаления Цикл  		
			ДокументКорректировки.Товары.Удалить(СтрУ.Значение); 			
		КонецЦикла;
		
		ДокументКорректировки.Услуги.Очистить();
		ДокументКорректировки.ВозвратнаяТара.Очистить();
		
		ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение);
		
		РезультатДляВозвратаПорталу.RESULT = 1;
		РезультатДляВозвратаПорталу.MSG = "Заказ клиента успешно изменен";		
		
	Исключение 		
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Возникла ошибка при записи документа корректировки заказа" + Символы.ПС + ОписаниеОшибки();		
		
	КонецПопытки;  	

	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция PM_GET_CHANGES_FOR_ORDER(Header,Lines) Экспорт 
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL_MSK.ПространствоИмен, "RS_PM_GET_CHANGES_FOR_ORDER");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	пЗаказКлиента	  = СокрЛП(Header.OrderID);
	ДокументЗаказКлиента = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(пЗаказКлиента));
	
	Если ДокументЗаказКлиента.Пустая() Тогда	
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "Не найден заказ клиента с таким ID";	
		Возврат РезультатДляВозвратаПорталу;
		
	КонецЕсли;
	
	БылиОшибки = Ложь;
	
	СтрокиЗаказа = Lines.Row;
	
	// 1.Снятие резерва
	ЗаказКлиентаОбъект = ДокументЗаказКлиента.ПолучитьОбъект();
	БылиИзменения = Ложь;

	Если НЕ ЗаказКлиентаОбъект.СкладскойЗаказ Тогда

		Для Каждого СтрокаЗаказа ИЗ СтрокиЗаказа Цикл
			
			Попытка 
				пНомерСтроки = Число(СтрокаЗаказа.IDLIN);
			Исключение 
				пНомерСтроки = Неопределено; 
			КонецПопытки;                 
			
			Попытка 
				пСнятьРезерв = Число(СтрокаЗаказа.UNRESERVE);
			Исключение 
				пСнятьРезерв = Неопределено; 
			КонецПопытки;                           
			
			Если НЕ пНомерСтроки = Неопределено И пСнятьРезерв = 1 Тогда
				
				ЕстьСтрокаВДокументе = ЗаказКлиентаОбъект.Товары.Найти(пНомерСтроки, "КлючСтроки");
				
				Если НЕ ЕстьСтрокаВДокументе = Неопределено Тогда
					
					ЕстьСтрокаВДокументе.ТолькоРезерв = Ложь;
					БылиИзменения = Истина;
					
				КонецЕсли;			
				
			КонецЕсли;	
		КонецЦикла;
		
		Если БылиИзменения Тогда 
			
			Попытка
				
				ЕстьТолькоРезервВСтроках = Ложь;
				
				Для Каждого СтрокиТоваров Из ЗаказКлиентаОбъект.Товары Цикл     
					
					Если СтрокиТоваров.ТолькоРезерв Тогда 
						ЕстьТолькоРезервВСтроках = Истина;
						Прервать;
					КонецЕсли; 
					
				КонецЦикла;  
				
				ЗаказКлиентаОбъект.ТолькоРезерв = ЕстьТолькоРезервВСтроках;
				ЗаказКлиентаОбъект.Записать(РежимЗаписиДокумента.Проведение); 
				
			Исключение 
				
				БылиОшибки  = Истина;
				ТекстОшибки = ОписаниеОшибки()
				
			КонецПопытки;
			
		КонецЕсли;

	КонецЕсли;  
	
	//2.Корректировка количества       	
	ТестОшибкиКратности = "";
	ТаблицаТовараДляКратности = Новый ТаблицаЗначений;
	ТаблицаТовараДляКратности.Колонки.Добавить("IDTOVAR");	
	ТаблицаТовараДляКратности.Колонки.Добавить("Номенклатура");
	ТаблицаТовараДляКратности.Колонки.Добавить("Количество");
	ТаблицаТовараДляКратности.Колонки.Добавить("ЕстьНарушение");
	ТаблицаТовараДляКратности.Колонки.Добавить("КлючСтроки");	
	
	Для Каждого СтрокаЗаказа Из СтрокиЗаказа Цикл
		
		Попытка 
			пНомерСтроки = Число(СтрокаЗаказа.IDLIN);
		Исключение 
			пНомерСтроки = Неопределено; 
		КонецПопытки;
		
		ПромТоварЗаказа = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(СтрокаЗаказа.IDTOVAR)));
		
		Если НЕ ПромТоварЗаказа.Получитьобъект() = Неопределено Тогда
			
			Если НЕ Константы.ИспользоватьКорректировкуГрузомест.Получить() Тогда				
				
				Если НЕ МСКWEB.ПроверитьСтатусСборки(ДокументЗаказКлиента, ПромТоварЗаказа) Тогда
					
					БылиОшибки = Истина;
					ТекстОшибки = ?(ТекстОшибки = "", "", "   ") + "Товар из строки № " + СокрЛП(СтрокаЗаказа.IDLIN) + " уже собран";
					Продолжить;
					
				КонецЕсли;
				
			Иначе
				
				Если ДокументЗаказКлиента.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда
					
					Если НЕ МСКWEB.ПроверитьСтатусОтгрузки(ДокументЗаказКлиента, ПромТоварЗаказа) Тогда
						
						БылиОшибки = Истина;
						ТекстОшибки = ?(ТекстОшибки = "", "", "   ") + "Товар из строки № " + СокрЛП(СтрокаЗаказа.IDLIN) + " уже погружен в машину";
						Продолжить;
						
					КонецЕсли; 				
					
				Иначе
					
					Если НЕ МСКWEB.ПроверитьСтатусСборки(ДокументЗаказКлиента, ПромТоварЗаказа) Тогда
						
						БылиОшибки = Истина;
						ТекстОшибки = ?(ТекстОшибки = "", "", "   ") + "Товар из строки № " + СокрЛП(СтрокаЗаказа.IDLIN) + " уже собран";
						Продолжить;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если НЕ пНомерСтроки = Неопределено Тогда
				
				ЕстьСтрокаВДокументе = ЗаказКлиентаОбъект.Товары.Найти(пНомерСтроки, "КлючСтроки");
				
				Если НЕ ЕстьСтрокаВДокументе = Неопределено Тогда
					
					ТеОстатокПоСтроке = ПолучитьОстатокПоСтроке(ЗаказКлиентаОбъект.Ссылка,пНомерСтроки);
					ПромКол  =  ТеОстатокПоСтроке - СтрокаЗаказа.KOL;
					
				КонецЕсли;			
				
			КонецЕсли;
			
			Если ПромКол > 0 Тогда 
				
				НоваяСтрокаКратности = ТаблицаТовараДляКратности.Добавить();
				НоваяСтрокаКратности.IDTOVAR      = СтрокаЗаказа.IDTOVAR;
				НоваяСтрокаКратности.Номенклатура = ПромТоварЗаказа.Ссылка;
				НоваяСтрокаКратности.Количество   = ПромКол;
				НоваяСтрокаКратности.ЕстьНарушение = Ложь;  
				НоваяСтрокаКратности.КлючСтроки = пНомерСтроки;   
				
			КонецЕсли;
			
		Иначе
			
			БылиОшибки = Истина;
			ТекстОшибки = ?(ТекстОшибки = "", "", "   ") + "Не найден товар из строки № " + СокрЛП(СтрокаЗаказа.IDLIN);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ТаблицаТовараДляКратности.Количество() = 0 Тогда
		
		ТаблицаТовараДляКратности.Свернуть("IDTOVAR, Номенклатура, ЕстьНарушение, КлючСтроки", "Количество");
		
		Для Каждого СтрокаТаблКратности Из ТаблицаТовараДляКратности Цикл

			Если НЕ МСК.ПроверкаНоменклатурыНаКратность(СтрокаТаблКратности.Номенклатура, СтрокаТаблКратности.Количество) Тогда
				СтрокаТаблКратности.ЕстьНарушение = Истина;
			КонецЕсли;	
			
		КонецЦикла;
		
		Для Каждого СтрокаЗаказа ИЗ СтрокиЗаказа Цикл
			
			Попытка 
				пНомерСтроки = Число(СтрокаЗаказа.IDLIN);
			Исключение 
				пНомерСтроки = Неопределено; 
			КонецПопытки;
			
			Если НЕ пНомерСтроки = Неопределено Тогда
				
				ЕстьСтрокаВДокументе = ЗаказКлиентаОбъект.Товары.Найти(пНомерСтроки, "КлючСтроки");   
				СтрокаВТаблПроверки  = ТаблицаТовараДляКратности.Найти(пНомерСтроки, "КлючСтроки");
				
				Если СтрокаВТаблпроверки.ЕстьНарушение Тогда
					
					БылиОшибки = Истина;
					ТестОшибкиКратности = ?(ТестОшибкиКратности = "", "", Символы.ПС) + "Нарушена кратность у товара  " + СокрЛП(СтрокаВТаблпроверки.Номенклатура.Наименование);				
					
				Иначе								
					
					Если НЕ ЕстьСтрокаВДокументе = Неопределено Тогда
						
						РегЗапросИзменений = РегистрыСведений.ЗапросыИзмененияКоличестваВЗаказах.СоздатьМенеджерЗаписи();
						РегЗапросИзменений.ЗаказПокупателя = ДокументЗаказКлиента;
						РегЗапросИзменений.Номенклатура    = СтрокаВТаблпроверки.Номенклатура;
						РегЗапросИзменений.КлючСтроки      = Число(СтрокаЗаказа.IDLIN);
						РегЗапросИзменений.Количество      = СтрокаВТаблпроверки.Количество;
						РегЗапросИзменений.ДатаЗапроса     = ТекущаяДата();
						РегЗапросИзменений.Записать(Истина);	
						
					Иначе
						
						БылиОшибки = Истина;
						ТекстОшибки = ?(ТекстОшибки = "", "", "   ") + "Не найден товар из строки № " + СокрЛП(СтрокаЗаказа.IDLIN);					
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если БылиОшибки Тогда	
		
		РезультатДляВозвратаПорталу.RESULT = 0;
		РезультатДляВозвратаПорталу.MSG = "" + ТекстОшибки + " " + ТестОшибкиКратности;		
		
	Иначе
		
		РезультатДляВозвратаПорталу.RESULT = 1;
		РезультатДляВозвратаПорталу.MSG = "Заказ клиента успешно изменен";
		
	КонецЕсли;	  	
	
	Возврат РезультатДляВозвратаПорталу;

КонецФункции


/////////////////Вспомогательные процедуры методов веб сервисов//////////////////
Функция ПолучитьСтруктуруСтатусовПортала()
	
	СтруктураСтатусов = Новый Соответствие;	
	СтруктураСтатусов.Вставить(10, "10; зарезервирован");
	СтруктураСтатусов.Вставить(20, "20; ожидание оплаты");
	СтруктураСтатусов.Вставить(30, "30; на подборе");
	СтруктураСтатусов.Вставить(40, "40; готов к отгрузке");
	СтруктураСтатусов.Вставить(50, "50; на доставке");
	СтруктураСтатусов.Вставить(60, "60; выполнен");
	СтруктураСтатусов.Вставить(70, "70; не определен");
	СтруктураСтатусов.Вставить(80, "80; не определен");
	СтруктураСтатусов.Вставить(90, "90; не определен");
	СтруктураСтатусов.Вставить(100, "100; отказ клиента");
	СтруктураСтатусов.Вставить(110, "110; недостача при сборке");
	
	Возврат СтруктураСтатусов;

КонецФункции	

Функция СформироватьОтветДляПортала(ПараметрыОтбора) Экспорт
	
	пДатаНачалаОтчета	  = Дата(ПараметрыОтбора.BEGIN_DATE_);
	пДатаКонцаОтчета	  = Дата(ПараметрыОтбора.END_DATE_);
	пКодКонтрагентаПортал = СтрЗаменить(СокрЛП(ПараметрыОтбора.KONTRAGENT_), Символы.НПП, "");
	пСтатусСостояния	  = ПараметрыОтбора.DSTATE_;
	
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL.ПространствоИмен, "RS");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.PORTAL.ПространствоИмен, "OutgoingSettings");  
	
	Если СтрДлина(пКодКонтрагентаПортал) = 36 Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ",пКодКонтрагентаПортал);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда",пКодКонтрагентаПортал);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Тогда
		
		ЗапросСтрокПоСтатусам = Новый Запрос;
		ЗапросСтрокПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоНедели(ТекущаяДата())));
		ЗапросСтрокПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросСтрокПоСтатусам.УстановитьПараметр("Клиент", пКонтрагент);

		ЗапросСтрокПоСтатусам.Текст =
		"ВЫБРАТЬ
		|	ПродажиОбороты.Номенклатура.Код КАК ID_TOVAR,
		|	ПродажиОбороты.Номенклатура.Родитель.Наименование КАК BREND,
		|	ПродажиОбороты.Номенклатура.Артикул КАК ARTICUL,
		|	ПродажиОбороты.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ED_IZM_6951,
		|	1 КАК KOEF_6951,
		|	0 КАК KOL_VO_6951,
		|	0 КАК RESRV_6951,
		|	0 КАК OTGRUJENO_6951,
		|	ПродажиОбороты.Номенклатура.Наименование КАК TOVAR_NAME,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
		|			ТОГДА ПродажиОбороты.СтоимостьОборот
		|		ИНАЧЕ ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот
		|	КОНЕЦ КАК PRICE_6951,
		|	ЕСТЬNULL(ПродажиОбороты.СтоимостьБезСкидокОборот, 0) КАК SUMMA_6951,
		|	ПродажиОбороты.ЗаказПокупателя.Номер КАК DID_6951,
		|	ПродажиОбороты.ДокументПродажи.Номер КАК DID_6501,
		|	ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ED_IZM_6501,
		|	ПродажиОбороты.КоличествоОборот КАК KOL_VO_6501,
		|	1 КАК KOEF_6501,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0) = 0
		|			ТОГДА ПродажиОбороты.СтоимостьОборот
		|		ИНАЧЕ ПродажиОбороты.СтоимостьОборот / ПродажиОбороты.КоличествоОборот
		|	КОНЕЦ КАК PRICE_6501,
		|	ПродажиОбороты.СтоимостьОборот КАК SUMMA_6501,
		|	0 КАК NEDOS,
		|	0 КАК VOZVRAT
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, , ) КАК ПродажиОбороты";   
		
		РезультатЗапросаСтрок = ЗапросСтрокПоСтатусам.Выполнить();   
		
		Если Не РезультатЗапросаСтрок.Пустой() Тогда         
			
			ВыборкаРезультата = РезультатЗапросаСтрок.Выбрать(); 
			
			Пока ВыборкаРезультата.Следующий()Цикл              
				
				СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
				ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата);
				РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);    
				
			КонецЦикла;	      
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;  
	
КонецФункции

Функция СформироватьСообщениеДляПортала(ИмяПоля, Количество, СтатусAvarda, КодСообщения, ДобавитьТочкуСЗапятой = Ложь, СтатусПоДопПостащику = "ЦС в Москве") Экспорт
	
	Результат = "";
	
	Если ИмяПоля = "ЗаказаноПоставщику" И Количество > 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(СтатусAvarda)  Тогда
			Результат = "10;заказано поставщику"			
		Иначе

			Если СтатусAvarda = "10; составлен" Тогда                   
				Результат = Строка(КодСообщения) + ";размещен на складе " + СокрЛП(СтатусПоДопПостащику);//  ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "10; зарезервирован" Тогда                    
				Результат = Строка(КодСообщения) + ";зарезервирован на складе " + СокрЛП(СтатусПоДопПостащику);// ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "30; на подборе" Тогда                     
				Результат = Строка(КодСообщения) + ";подбирается на складе " + СокрЛП(СтатусПоДопПостащику);// ЦС В Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "40; подобрано" Тогда                     
				Результат = Строка(КодСообщения) + ";подобрано на складе " + СокрЛП(СтатусПоДопПостащику);// ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "40; готов к отгрузке" Тогда                    
				Результат = Строка(КодСообщения) + ";готов к отгрузке со склада " + СокрЛП(СтатусПоДопПостащику);// ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "50; на доставке" Тогда
				Результат = Строка(КодСообщения) + ";отгружено со склада " + СокрЛП(СтатусПоДопПостащику);// ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "300; принят в работу" Тогда
				Результат = Строка(КодСообщения) + ";размещен у поставщика";
			КонецЕсли; 
			
			Если СтатусAvarda = "310; размещен у поставщика" Тогда
				Результат = Строка(КодСообщения) + ";размещен у поставщика";
			КонецЕсли; 
			
			Если СтатусAvarda = "320; подтвежден поставщиком" Тогда
				Результат = Строка(КодСообщения) + ";подтвержден поставщиком";
			КонецЕсли; 
			
			Если СтатусAvarda = "320; в пути на склад" Тогда
				Результат = Строка(КодСообщения) + ";в пути на склад ЦС в Москве";
			КонецЕсли; 
			
			Если СтатусAvarda = "330; поступило на склад" Тогда
				Результат = Строка(КодСообщения) + ";поступило на склад ЦС  в Москве";
			КонецЕсли; 
			
			Если Результат = "" Тогда
				Результат = "10;заказано поставщику";				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если ДобавитьТочкуСЗапятой Тогда
		Результат = Результат + ";";
	КонецЕсли; 
	
	Возврат Результат ;
	
КонецФункции

Функция ЗаполнитьСтрокуВозврата(ТипСтрокаОтвета, ВыборкаРезультата, Значение_KOL_VO, Значение_STATUS, ДобавитьФлаг = Ложь, ТолькоРезерв = Ложь)
	
	СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
	ЗаполнитьЗначенияСвойств(СтрокаВозврата, ВыборкаРезультата);
	СтрокаВозврата.INV_NUM = СокрЛП(ВыборкаРезультата.Номенклатура.УникальныйИдентификатор());
	СтрокаВозврата.DDATE1 = ?(ЗначениеЗаполнено(ВыборкаРезультата.ДатаДок), Формат(ВыборкаРезультата.ДатаДок, "ДФ=dd.MM.yyyy"), "");
	
	СтрокаВозврата.DID = ?(ЗначениеЗаполнено(ВыборкаРезультата.СсылкаНаСф), СокрЛП(ВыборкаРезультата.СсылкаНаСф.УникальныйИдентификатор()), "");				
	
	НомерНаПечатьСтрокой = "";    
	
	Если ЗначениеЗаполнено(ВыборкаРезультата.СсылкаНаСф) И (НЕ Найти(Значение_STATUS, "60;") = 0) Тогда 
		
		Если Константы.База.Получить() = Перечисления.НазваниеБазы.Казань ИЛИ Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж Тогда 
			УдалятьВедущиеНули = Истина;
		Иначе
			
			Если ВыборкаРезультата.СсылкаНаСф.Дата > Дата(2016, 01, 01) Тогда
				УдалятьВедущиеНули = Истина;
			Иначе
				УдалятьВедущиеНули = Ложь;
			КонецЕсли;	
			
		КонецЕсли;	
		
		НомерНаПечатьСтрокой = ОбщегоНазначения.ПолучитьНомерНаПечать(ВыборкаРезультата.СсылкаНаСф,,, УдалятьВедущиеНули); 
		
	КонецЕсли;           
	
	СтрокаВозврата.DCODE = НомерНаПечатьСтрокой;				
	
	Если (ТолькоРезерв ИЛИ НЕ ВыборкаРезультата.ЗаказаноПоставщику = 0  
		ИЛИ НЕ ВыборкаРезультата.Заказано = 0 
		ИЛИ НЕ ВыборкаРезультата.Собирается = 0 
		ИЛИ НЕ ВыборкаРезультата.Собрано = 0 
		ИЛИ НЕ ВыборкаРезультата.Зарезервированно = 0) Тогда
		СтрокаВозврата.PLAN_DATE = ?(ЗначениеЗаполнено(ВыборкаРезультата.PLAN_DATE), Формат(ВыборкаРезультата.PLAN_DATE, "ДФ=dd.MM.yyyy"), "");
	Иначе
		СтрокаВозврата.PLAN_DATE = "";
	КонецЕсли;	                       
	
	Если ЕстьЗапросНаКорректировку(ВыборкаРезультата.Ссылка, ВыборкаРезультата.IDLIN) Тогда  
		
		МожноКорректировать = Ложь;
		СтрокаВозврата.STATUS = Значение_STATUS + "(запрос на изменение количества)";  
		
	Иначе                          
		
		МожноКорректировать = Истина;

		Если Значение_STATUS = "50;на доставке"
			ИЛИ НЕ Найти(Значение_STATUS, "60;") = 0  
			ИЛИ Значение_STATUS = "100;отказ покупателя"
			ИЛИ Значение_STATUS = "110;отказ поставщика"
			ИЛИ Значение_STATUS = "110;нет на складе"
			ИЛИ Значение_STATUS = "110;истек срок резервирования"
			Тогда
			МожноКорректировать = Ложь;
		ИначеЕсли Значение_STATUS = "30;на подборе" Тогда
			МожноКорректировать = МСКWEB.ПроверитьСтатусСборки(ВыборкаРезультата.Ссылка, ВыборкаРезультата.Номенклатура);  
		ИначеЕсли Значение_STATUS = "40;готов к отгрузке" Тогда
			МожноКорректировать = МСКWEB.ПроверитьСтатусОтгрузки(ВыборкаРезультата.Ссылка, ВыборкаРезультата.Номенклатура); 
		КонецЕсли;              
		
		СтрокаВозврата.STATUS = Значение_STATUS;  
		
	КонецЕсли;	                                
	
	Если МожноКорректировать Тогда 
		МожноКорректировать = НЕ Константы.ЯчейкаДляПеремещенияОтказовКлиентов.Получить().Пустая(); 
	КонецЕсли;            
	
	Если МожноКорректировать Тогда 
		МожноКорректировать = ВыборкаРезультата.Ссылка.IDСклада_СтороннийСклад.Пустая(); 
	КонецЕсли;                                  
	
	Если МожноКорректировать И ТолькоРезерв Тогда 
		МожноКорректировать = Ложь; 
	КонецЕсли;                               
	
	СтрокаВозврата.KOL_VO = Значение_KOL_VO;
	СтрокаВозврата.SUMMA = Значение_KOL_VO*ВыборкаРезультата.PRICE;	  
	СтрокаВозврата.TOVAR_PRIMECH = СокрЛП(ВыборкаРезультата.Комментарий);
	
	Если ДобавитьФлаг Тогда        
		
		ДействияВДесятичномВиде = ?(ТолькоРезерв, "1", "0") + "0"+ ?(МожноКорректировать, "1", "0") + "0";
		СтрокаВозврата.FLAG_1 = ДвоичноеВДесятичное(ДействияВДесятичномВиде);
		
	КонецЕсли;

	Возврат СтрокаВозврата;
	
КонецФункции // ЗаполнитьСтрокуВозврата()

Функция ЕстьЗапросНаКорректировку(Заказ, Строка)  
	
	ЗапросКорректировки = Новый Запрос;
	ЗапросКорректировки.УстановитьПараметр("ЗаказПокупателя", Заказ);
	ЗапросКорректировки.УстановитьПараметр("КлючСтроки", Строка); 
	
	ЗапросКорректировки.Текст =
	"ВЫБРАТЬ
	|	ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя
	|ИЗ
	|	РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|ГДЕ
	|	ВЫБОР
	|			КОГДА НЕ ВЫРАЗИТЬ(ЗапросыИзмененияКоличестваВЗаказах.ДокументКорректировки КАК Документ.КорректировкаГрузовогоМеста) ЕСТЬ NULL
	|				ТОГДА НЕ ЗапросыИзмененияКоличестваВЗаказах.ДокументКорректировки.Исполнено
	|			ИНАЧЕ НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано
	|		КОНЕЦ
	|	И ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя = &ЗаказПокупателя
	|	И ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки = &КлючСтроки"; 
	
	Возврат НЕ ЗапросКорректировки.Выполнить().Пустой();       
	
КонецФункции

Функция ПроверитьСтатусСборки(ПромЗаказ, ПромТовар) Экспорт  
	
	ЗапросНаличияСборки = Новый Запрос;
	ЗапросНаличияСборки.УстановитьПараметр("Заказ", ПромЗаказ);
	ЗапросНаличияСборки.УстановитьПараметр("Товар", ПромТовар); 
	
	ЗапросНаличияСборки.Текст = 
	"ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Сборка.Ссылка,
	|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(
	|			,
	|			ЗаказПокупателя = &Заказ ";      
	
	Если НЕ ПромТовар = NULL Тогда
		ЗапросНаличияСборки.Текст = ЗапросНаличияСборки.Текст + "
		|				И Номенклатура = &Товар";
	КонецЕсли;               
	
	ЗапросНаличияСборки.Текст = ЗапросНаличияСборки.Текст + " 
	|) КАК ТоварыВСборкеОстатки";    
	
	Если НЕ ЗапросНаличияСборки.Выполнить().Пустой() Тогда	
		
		ЗапросСтатусаСборки = Новый Запрос;
		ЗапросСтатусаСборки.УстановитьПараметр("Заказ", ПромЗаказ);
		ЗапросСтатусаСборки.УстановитьПараметр("Товар", ПромТовар); 
		
		ЗапросСтатусаСборки.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВСборкеОстатки.Сборка.Ссылка,
		|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки
		|ИЗ
		|	РегистрНакопления.ТоварыВСборке.Остатки(
		|			,
		|			ЗаказПокупателя = &Заказ ";   
		
		Если НЕ ПромТовар = NULL Тогда
			ЗапросСтатусаСборки.Текст = ЗапросСтатусаСборки.Текст +"
			|				И Номенклатура = &Товар";
		КонецЕсли;                        
		
		ЗапросСтатусаСборки.Текст = ЗапросСтатусаСборки.Текст +"		
		|) КАК ТоварыВСборкеОстатки
		|ГДЕ
		|	ТоварыВСборкеОстатки.Сборка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";   
		
		Возврат НЕ ЗапросСтатусаСборки.Выполнить().Пустой();  
		
	Иначе
		Возврат Истина;
	КонецЕсли;      
	
КонецФункции

Функция ПроверитьСтатусОтгрузки(ПромЗаказ, ПромТовар) Экспорт    
	
	Если НЕ Константы.ИспользоватьКорректировкуГрузомест.Получить() Тогда 
		Возврат Ложь; 
	КонецЕсли;          
	
	Если ПромЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка Тогда  
		
		ЗапросСтатусаОтгрузки = Новый Запрос;
		ЗапросСтатусаОтгрузки.УстановитьПараметр("Заказ", ПромЗаказ);
		ЗапросСтатусаОтгрузки.УстановитьПараметр("Товар", ПромТовар);
		
		ЗапросСтатусаОтгрузки.Текст =	
		"ВЫБРАТЬ
		|	СборкаЗаказовПокупателяЗаказано.Ссылка КАК ДокСборка
		|ПОМЕСТИТЬ Сборки
		|ИЗ
		|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
		|ГДЕ
		|	СборкаЗаказовПокупателяЗаказано.Заказ = &Заказ
		|	И СборкаЗаказовПокупателяЗаказано.Номенклатура = &Товар
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаданиеНаДоставкуДоставка.Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
		|ГДЕ
		|	ЗаданиеНаДоставкуДоставка.ДокументСборки В
		|			(ВЫБРАТЬ
		|				Сборки.ДокСборка
		|			ИЗ
		|				Сборки)
		|	И НЕ ЗаданиеНаДоставкуДоставка.Ссылка.ПометкаУдаления"; 
		
		РезультатЗапросаСтатусаОтгрузки = ЗапросСтатусаОтгрузки.Выполнить();
		Возврат РезультатЗапросаСтатусаОтгрузки.Пустой();   
		
	Иначе 	
		Возврат Ложь;
	КонецЕсли;    
	
КонецФункции

Функция СоздатьНовуюНоменклатуру(Стр, НоменклатураРодитель, Товар, ЭтоНашТовар, Комментарий = "", EMailЗаказ = Ложь) Экспорт
	
	Если EMailЗаказ Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Попытка
		
		Если НоменклатураРодитель = Справочники.Номенклатура.ПустаяСсылка() Тогда
			
			ИскомаяГруппа = Справочники.Номенклатура.НайтиПоНаименованию(ВРег(стр.Brand), Истина);
			
			Если ИскомаяГруппа = Неопределено Тогда 
				
				НоменклатураРодитель = Справочники.Номенклатура.СоздатьГруппу();
				НоменклатураРодитель.ВидНоменклатуры = Константы.ВидНоменклатурыПоУмолчанию.Получить();
				НоменклатураРодитель.Наименование = ВРег(стр.Brand);
				НоменклатураРодитель.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
				НоменклатураРодитель.Записать();   
				
			Иначе 
				НоменклатураРодитель = ИскомаяГруппа;
			КонецЕсли;        
			
		КонецЕсли;
		
		НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
		НовыйЭлемент.ВестиУчетПоСериям 				= Истина;
		НовыйЭлемент.Наименование 					= стр.Name;
		НовыйЭлемент.ВидНоменклатуры 				= Константы.ВидНоменклатурыПоУмолчанию.Получить();  
		//+Гавриленков В. 10.12.2025 #UT10-5574
		//НовыйЭлемент.СтавкаНДС 						= ?(ТекущаяДата() >= Дата("20190101000000"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18);
		НовыйЭлемент.СтавкаНДС 						= ?(ТекущаяДата() >= Дата("20260101000000"), Перечисления.СтавкиНДС.НДС22, ?(ТекущаяДата() >= Дата("20190101000000"), Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.НДС18));
		//-Гавриленков В. 10.12.2025 #UT10-5574

		Если НЕ ЭтоНашТовар Тогда 
			НовыйЭлемент.НаименованиеПолное 			= СтрЗаменить(стр.Articul + " " + стр.Name, "'", "");	
		Иначе
			НовыйЭлемент.НаименованиеПолное 			= стр.Articul + " " + стр.Name;
		КонецЕсли;                          
		
		НовыйЭлемент.КодПроизводителя				= стр.Articul;
		НовыйЭлемент.ВестиПартионныйУчетПоСериям 	= Истина;
		НовыйЭлемент.БазоваяЕдиницаИзмерения 		= Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду("796");
		НовыйЭлемент.Комментарий 					= Комментарий;
		НовыйЭлемент.НеПодлежитВозврату 			= Ложь; 
		НовыйЭлемент.Кратность 						= 1;
		НовыйЭлемент.Родитель 						= НоменклатураРодитель.Ссылка; 
		
		Если ЭтоНашТовар Тогда           
			
			НовыйЭлемент.Артикул                    = СокрЛП(стр.NumberInv);
			НовыйЭлемент.КодПоБазеМоскоречье        = СокрЛП(стр.NumberInv);   
			
		КонецЕсли;    
		
		НовыйЭлемент.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.Прочее;
		НовыйЭлемент.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
		НовыйЭлемент.Записать();
		
		НоваяЕдиница 							= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
		НоваяЕдиница.Владелец 					= НовыйЭлемент.Ссылка ;
		НоваяЕдиница.Наименование 				= НовыйЭлемент.БазоваяЕдиницаИзмерения.Наименование;
		НоваяЕдиница.ЕдиницаПоКлассификатору 	= НовыйЭлемент.БазоваяЕдиницаИзмерения;
		НоваяЕдиница.Коэффициент 				= 1;
		НоваяЕдиница.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
		НоваяЕдиница.Записать();
		
		НовыйЭлемент.ЕдиницаХраненияОстатков		= НоваяЕдиница.Ссылка;
		НовыйЭлемент.ЕдиницаДляОтчетов			= НоваяЕдиница.Ссылка;
		НовыйЭлемент.ЕдиницаИзмеренияМест         = НоваяЕдиница.Ссылка;
		НовыйЭлемент.ДополнительныеСвойства.Вставить("ПропуститьПроверкуAMQP", Истина);	
		НовыйЭлемент.Записать();
		
		Товар = НовыйЭлемент.Ссылка;
		Возврат Истина;
		
	Исключение
		
		Товар = Неопределено;
		Возврат Ложь;								
		
	КонецПопытки;      
	
КонецФункции

Функция ПолучитьЗаказыСПортала(Шапка, Строки, EMailЗаказ = Ложь, НовыйЗаказ = Неопределено, ТипЦенЗаказа = Неопределено) Экспорт
	
	Если EMailЗаказ Тогда
		ЗаписьЖурналаРегистрации("Запрос данных с эл почты", УровеньЖурналаРегистрации.Информация,,, "TransmitOrderFromEMail начало ");	
	КонецЕсли;
	
	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitOrderFromPortal.ПространствоИмен, "OutForPortal");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.TransmitOrderFromPortal.ПространствоИмен, "OutLine");
	СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
	
	ТекДата = ТекущаяДата();
	
	НовыйДокЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	НовыйДокЗаказ.Дата 	 = ТекДата;
	НовыйДокЗаказ.Портал = Истина; 	
	ДопИнформация = "";
	
	//Определим есть ли передаваемый заказ в списке ранее загруженных
	Если EMailЗаказ Тогда
		
		Если Справочники.НеСозданныеЗаказыПокупателей.НайтиПоРеквизиту("ИдентификаторСообщения", 
			 СокрЛП(Шапка.ИдентификаторСообщения)) <> Справочники.НеСозданныеЗаказыПокупателей.ПустаяСсылка() Тогда     
			 
			Если Константы.База.Получить() = Перечисления.НазваниеБазы.Казань Тогда 
				СтрокаВозврата.Status = "1";
			Иначе
				СтрокаВозврата.Status = "3";
			КонецЕсли;                              
			
			РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);
			ЗаписьЖурналаРегистрации("EMail-заказ", УровеньЖурналаРегистрации.Предупреждение,,, "Письмо " + СокрЛП(Шапка.ИдентификаторСообщения) 
			+ " было загружено ранее (см. справочник Несозданные заказы)");
			Возврат РезультатДляВозвратаПорталу;       
			
		КонецЕсли;
			
	ИначеЕсли НЕ Справочники.НеСозданныеЗаказыПокупателей.НайтиПоКоду(СокрЛП(Шапка.OrderID)) = Справочники.НеСозданныеЗаказыПокупателей.ПустаяСсылка() Тогда
		
		Если Константы.База.Получить() = Перечисления.НазваниеБазы.Казань Тогда 
			СтрокаВозврата.Status = "1";
		Иначе
			СтрокаВозврата.Status = "3";
		КонецЕсли;                       
		
		РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);	
		ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,,
		"В базе данных уже есть Несозданный заказ с ID " + СокрЛП(Шапка.OrderID) + ". На портал возвращается статус " + СтрокаВозврата.Status + ".");
		
		Возврат РезультатДляВозвратаПорталу;		
		
	КонецЕсли;	
	
	НеСоздаватьНоменклатуруВУТ10 = Константы.НеСоздаватьНоменклатуруВУТ10.Получить(); 
	НеСозданныйЗП = Справочники.НеСозданныеЗаказыПокупателей.СоздатьЭлемент();
	НеСозданныйЗП.Дата = ТекДата;
	НеСозданныйЗП.Addres = Шапка.Addres;
	НеСозданныйЗП.AddresFakt = СокрЛП(Шапка.AddresFakt);
	НеСозданныйЗП.AddresFaktID = Шапка.AddresFaktID;
	НеСозданныйЗП.Comment = Шапка.Comment;
	НеСозданныйЗП.DogovorID = Шапка.DogovorID;	
	НеСозданныйЗП.FirmID = Шапка.FirmID;
	НеСозданныйЗП.KontragentID = Шапка.KlientID;
	НеСозданныйЗП.FilialID = Шапка.FilialID;
	НеСозданныйЗП.TipDost = Шапка.TipDost;
	НеСозданныйЗП.ValutaID = СокрЛП(Шапка.ValutaID);
	НеСозданныйЗП.Код = СокрЛП(Шапка.OrderID);
	НеСозданныйЗП.Наименование = Шапка.Name;
	НеСозданныйЗП.INN = СокрЛП(Шапка.INN);
	НеСозданныйЗП.KPP = СокрЛП(Шапка.KPP);
	НеСозданныйЗП.SkladID = СокрЛП(Шапка.SkladID);
	НеСозданныйЗП.PaymentType = СокрЛП(Шапка.PaymentType);   
	
	Если НЕ EMailЗаказ Тогда                                 
		
		Если НЕ Шапка.Свойства().Получить("OrderSource") = Неопределено Тогда
			НеСозданныйЗП.OrderSource = СокрЛП(Шапка.OrderSource);
		КонецЕсли;       
		
	Иначе
		НеСозданныйЗП.OrderSource = 6;
	КонецЕсли;
	
	ИспользоватьДатуОтгрузкиИзЗаказа = Константы.ИспользоватьДатуОтгрузкиИзЗаказа.Получить(); 
	
	Если ИспользоватьДатуОтгрузкиИзЗаказа И НЕ EMailЗаказ Тогда  
		
		Если  НЕ Шапка.Свойства().Получить("Dostavka") = Неопределено Тогда   
			
			Если  СтрДлина(Шапка.Dostavka) = 19 Тогда        
				
				стр1 = СтрЗаменить(СокрЛП(Шапка.Dostavka), "-", "");
				стр1 = СтрЗаменить(стр1, ":", "");
				стр1 = СтрЗаменить(стр1, "T", "");
				Дата = Дата(стр1);
				
				//+Белов А. 05.02.2026 #UT10-5641
				////+Кабанов А.В. 19.05.2025 # UT10-5247 
				//ЧасовойПоясФилиала = Константы.ЧасовойПоясФилиала.Получить();
				//Дата               = Дата - ЧасовойПоясФилиала*3600 ;				
				////+Кабанов А.В. 19.05.2025 # UT10-5247
				//-Белов А. 05.02.2026 #UT10-5641

				НеСозданныйЗП.Dostavka = Дата;
				НовыйДокЗаказ.ДатаОтгрузки = Дата;
				
			Иначе                                
				
				НеСозданныйЗП.Dostavka = ТекущаяДата();
				НовыйДокЗаказ.ДатаОтгрузки = ТекущаяДата();
				
			КонецЕсли;
		КонецЕсли;                   
		
	ИначеЕсли ИспользоватьДатуОтгрузкиИзЗаказа И EMailЗаказ Тогда  
		
		НеСозданныйЗП.Dostavka = ТекущаяДата();
		НовыйДокЗаказ.ДатаОтгрузки = ТекущаяДата();   
		
	КонецЕсли;	            
	
	Если EMailЗаказ Тогда    
		
		НеСозданныйЗП.EMailЗаказ = Истина;		
		НеСозданныйЗП.ИдентификаторСообщения = Шапка.ИдентификаторСообщения;  
		СтрПараметры = 
		"OrderID_ = '"	    + СокрЛП(Шапка.OrderID) + "';" +
		"Addres_ = '"	    + СокрЛП(Шапка.Addres)+ "';" +
		"AddresFakt_ = '"	+ СокрЛП(Шапка.AddresFakt) + "';" +
		"DogovorID_ = '"	+ Строка(Шапка.DogovorID) + "';" +
		"FirmID_ = '"		+ Строка(Шапка.FirmID) + "';" +
		"KontragentID_ = '"	+ Строка(Шапка.KlientID) + "';" +
		"FilialID_ = '"		+ Строка(Шапка.FilialID) + "';" +
		"TipDost_ = '"		+ Строка(Шапка.TipDost) + "';" +
		"INN_ = '"		    + СокрЛП(Шапка.INN) + "';" +
		"SkladID_ = '"		+ СокрЛП(Шапка.SkladID) + "';" +
		"PaymentType_ = '"	+ СокрЛП(Шапка.PaymentType) + "';";
		
		Если НЕ EMailЗаказ Тогда                   
			
			Если НЕ Шапка.Свойства().Получить("OrderSource") = Неопределено Тогда
				СтрПараметры =  СтрПараметры + "OrderSource_ = '"	+ СокрЛП(Шапка.OrderSource) + "';";
			КонецЕсли;         
			
		КонецЕсли;          
		
		СтрПараметры = СтрПараметры + "ИД_Сообщения_ = '" + СокрЛП(Шапка.ИдентификаторСообщения) +"';";  	
		ЗаписьЖурналаРегистрации("Оформление заказа через EMail", УровеньЖурналаРегистрации.Информация,,, "TransmitOrderFromEMail " + Символы.ПС + СтрПараметры);	
		
	КонецЕсли;
	
	Причина = "";
	
	////////////////////Заполнение контрагента///////////////////////////
	Контрагент 		  = НайтиКонтрагентаПоКодуИзПортала(СокрЛП(Шапка.KlientID));
	ФилиалКонтрагента = НайтиФилиалПоКодуИзПортала(СокрЛП(Шапка.FilialID));
	
	Если EMailЗаказ Тогда    
		
		Если Не ЗначениеЗаполнено(Контрагент) и ЗначениеЗаполнено(Шапка.Контрагент) Тогда
			Контрагент = Шапка.Контрагент;
		КонецЕсли;          
		
		Если Не ЗначениеЗаполнено(ФилиалКонтрагента) и ЗначениеЗаполнено(Шапка.ФилиалКонтрагента) Тогда
			ФилиалКонтрагента = Шапка.ФилиалКонтрагента;
		КонецЕсли;   
		
	КонецЕсли;
	
	Если НЕ ФилиалКонтрагента  = Неопределено Тогда
		НовыйДокЗаказ.Контрагент = ФилиалКонтрагента;
	ИначеЕсли НЕ Контрагент = Неопределено Тогда
		НовыйДокЗаказ.Контрагент = Контрагент;
	Иначе                             
		
		Причина = Причина + "Не найден клиент";		
		
		Если Не EMailЗаказ Тогда
			ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,,
			"Не найдены контрагент по ID " + СокрЛП(Шапка.KlientID) + " и филиал по ID " + СокрЛП(Шапка.FilialID) + ".");
		КонецЕсли;      
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) И ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент) 
		И НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент <> НовыйДокЗаказ.Контрагент Тогда  
		
		НовыйДокЗаказ.Грузополучатель = НовыйДокЗаказ.Контрагент;
		НовыйДокЗаказ.Контрагент =   НовыйДокЗаказ.Контрагент.ГоловнойКонтрагент;  
		
	ИначеЕсли Не EMailЗаказ или ЗначениеЗаполнено(ФилиалКонтрагента) Тогда 
		НовыйДокЗаказ.Грузополучатель = НовыйДокЗаказ.Контрагент;		
	КонецЕсли;                                            
	
	////////////////////Заполнение способа доставки///////////////////////////
	//Значения "TipDost" из портала:
	//0 - только резерв
	//1 - самовывоз
	//2 - экспресс доставка
	//3 - трансп компания
	//4 - стандартная доставка
	//5 - такси доставка 	
	ТипДоставки = Число(Шапка.TipDost);

	Если ТипДоставки = 1 ИЛИ ТипДоставки = 5 Тогда  
		
		Если ТипДоставки = 5 И Константы.ТаксиДоставка.Получить() Тогда  
			
			НовыйДокЗаказ.УпаковыватьСамовывоз = Истина;
			НовыйДокЗаказ.ТаксиДоставка        = Истина; 
			
		КонецЕсли;       
		
		НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;  
		
	ИначеЕсли ТипДоставки = 2 ИЛИ ТипДоставки = 3 ИЛИ ТипДоставки = 4 Тогда 	
		НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка; 	 
		
	ИначеЕсли ТипДоставки = 0 и ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) Тогда
		
		НовыйДокЗаказ.ТолькоРезерв  = Истина;                      
		
		Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель.СпособДоставки) Тогда
			НовыйДокЗаказ.СпособДоставки = НовыйДокЗаказ.Грузополучатель.СпособДоставки;
		Иначе      
			
			Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель.МаршрутДоставки) Тогда
				НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка;
			Иначе
				НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз;
			КонецЕсли;   
			
		КонецЕсли;	
		
	Иначе	
		Причина = ?(Причина = "", Причина, Причина + ", ") + "Не указан способ доставки";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) Тогда
		Причина = ?(Причина = "", Причина, Причина + ", ") + "Не заполнен филиал контрагента (выберите из справочника)";	
	КонецЕсли;
	
	Если НЕ EMailЗаказ Тогда      
		
		Если НЕ Шапка.Свойства().Получить("OrderSource") = Неопределено Тогда
			ПромКодИсточника = Число(Шапка.OrderSource);
		Иначе
			ПромКодИсточника = 0;
		КонецЕсли;      
		
	Иначе         
		
		ПромКодИсточника = 6;                    
		
		Если ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель) И НовыйДокЗаказ.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
			
			НеСозданныйЗП.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Истина;
			НеСозданныйЗП.SkladID = "0";
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Обособленная отгрузка ГМ , выбор склада";
			
		КонецЕсли;
		
	КонецЕсли;                                  
	
	НовыйДокЗаказ.ИсточникЗаказа =  Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", ПромКодИсточника); 

	//////////////////////////////////////////////////
	
	Если Константы.ЗагружатьДоговораСПортала.Получить() Тогда
		
		СтруктураВозврата = НайтиДоговорПоКодуИзПортала(СокрЛП(Шапка.DogovorID), НовыйДокЗаказ.СпособДоставки);
		Договор = СтруктураВозврата.ДоговорКонтрагента;
		НовыйДокЗаказ.ОплатаНаличными = СтруктураВозврата.ОплатаНаличными;
		
		Если СтрДлина(СокрЛП(Шапка.DogovorID)) > 36 Тогда
			
			МассивСтр = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(Шапка.DogovorID), "|");
			
			Если МассивСтр.Количество() > 3 Тогда
				
				КлючСтрокиУсловий = МассивСтр[3];
				
				Попытка
					НовыйДокЗаказ.КлючСтрокиУсловий = Число(КлючСтрокиУсловий);
				Исключение
				КонецПопытки;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе 
		
		Если EMailЗаказ Тогда
			Договор = ?(ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор),
			          НовыйДокЗаказ.Контрагент.EMailЗаказ_Договор, НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента);
		Иначе 
			Договор = НовыйДокЗаказ.Контрагент.ОсновнойДоговорКонтрагента;
		КонецЕсли;    
		
		НовыйДокЗаказ.ОплатаНаличными = Договор.ОплатаПоДоговоруНаличными; 
		
	КонецЕсли;                                          
	
	Если Контрагент = Константы.ОсновнойПоставщик.Получить() 
		И (НовыйДокЗаказ.ИсточникЗаказа.КодИсточника = 2 ИЛИ НовыйДокЗаказ.ИсточникЗаказа.КодИсточника = 3) Тогда   
		
		ПромДоговорАПИ = Константы.ДоговорДляЗаказаЧерезАПИДляОсновногоПоставщика.Получить();    
		
		Если НЕ ПромДоговорАПИ.Пустая() Тогда
			Договор = ПромДоговорАПИ;
		КонецЕсли;	
		
	КонецЕсли;        
	
	НовыйДокЗаказ.ДоговорКонтрагента = Договор;
	
	Если ЗначениеЗаполнено(Договор) Тогда  
		
		НовыйДокЗаказ.ВалютаДокумента = Договор.ВалютаВзаиморасчетов;
		НеСозданныйЗП.ТипЦенЗаказ = ?(ТипЦенЗаказа = Неопределено ИЛИ ТипЦенЗаказа.Пустая(), Договор.ТипЦен, ТипЦенЗаказа);   
		
		Если Договор.Потенциальный Тогда
			Причина = ?(Причина = "", Причина, Причина + ", ") + "В договоре установлен признак Потенциальный";	
		КонецЕсли;		
		
	Иначе                                                          
		
		Причина = ?(Причина = "", Причина, Причина + ", ") + "Не найден основной договор с покупателем";  
		
		Если EMailЗаказ Тогда
			ЗаписьЖурналаРегистрации("Оформление заказа через EMail", УровеньЖурналаРегистрации.Предупреждение,,, "Не найден договор при создании Заказа");
		Иначе
			ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Предупреждение,,, "Не найден договор при создании Заказа");
		КонецЕсли;   
		
	КонецЕсли;       
	
	НовыйДокЗаказ.Комментарий   = СокрЛП(Шапка.Comment);
	
	Попытка
		
		НовыйДокЗаказ.IDСклада = Число(СокрЛП(Шапка.SkladID));
		НовыйДокЗаказ.IDСклада_СтороннийСклад = МСК.НайтиСтороннийСкладПоID(НовыйДокЗаказ.IDСклада, Истина);		
		
	Исключение
	КонецПопытки;
	
	ЭтоСтороннийСклад = ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад); 

	Если НЕ ЭтоСтороннийСклад И ПустойСтороннийСклад(НовыйДокЗаказ) Тогда		
		ЭтоСтороннийСклад = Истина;	 	
	КонецЕсли; 	
	
	Попытка
		НовыйДокЗаказ.IDЗаказаПортал = СокрЛП(Шапка.OrderID);	
	Исключение
	КонецПопытки;
	
	//+Белов А. 22.10.2024 UT10-4825#
	Если ЭтоСтороннийСклад И ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда
		НовыйДокЗаказ.IDСклада = НовыйДокЗаказ.IDСклада_СтороннийСклад.IDСклада;		
	КонецЕсли;
	//-Белов А. 22.10.2024 #UT10-4825
	
	//////////////Если в карточке клиента указано не использовать цены из портала Тогда заказ попадает в не созданные!!!!!!!!!!!!!!!////////////
	Если ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) И НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала 
		И НЕ Константы.ОформлятьВсеЗаказыСПортала.Получить() Тогда   
		
		Если ЭтоСтороннийСклад Тогда 
			// для сторонних складов берем цены портала
		Иначе
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Не портальная цена; ";
		КонецЕсли;          
		
	КонецЕсли;	
	/////////////////////////////////
	
	Если ЗначениеЗаполнено(Договор) Тогда
		НовыйДокЗаказ.Организация = Договор.Организация;
	Иначе
		
		Если Найти(Причина, "Не найден основной договор с покупателем") = 0 Тогда
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Не найден основной договор с покупателем";
		КонецЕсли;  
		
	КонецЕсли;
	
	Если СокрЛП(НовыйДокЗаказ.Контрагент.ИНН) = "" Тогда 
		
		Если (Константы.База.Получить() = Перечисления.НазваниеБазы.Казань или Константы.База.Получить() = Перечисления.НазваниеБазы.Воронеж) 
			И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() Тогда 
		Иначе
			Причина = ?(Причина = "", Причина, Причина + ", ") + "Нет ИНН контрагента";
		КонецЕсли;
		
	КонецЕсли;

	Если (НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.Самовывоз И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель))
		И (НЕ ТипДоставки = 5 ИЛИ (ТипДоставки = 5 И НЕ Константы.ТаксиДоставка.Получить())) Тогда		    
		НовыйДокЗаказ.УпаковыватьСамовывоз = НовыйДокЗаказ.Грузополучатель.УпаковыватьСамовывоз;		
	КонецЕсли;	
	
	//____________Строка ниже отработает только в клиент-серверном варианте
	ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйДокЗаказ, глЗначениеПеременной("глТекущийПользователь"), 
	НовыйДокЗаказ.мВалютаРегламентированногоУчета, "Продажа", Неопределено, Неопределено, НовыйДокЗаказ.мСтруктураПараметровДляПолученияДоговора);
	//~~~~~~~~~~
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.КлючСтрокиУсловий) Тогда
		
		Попытка
			
			СтрокаСКлючем = НовыйДокЗаказ.ДоговорКонтрагента.Условия.Найти(НовыйДокЗаказ.КлючСтрокиУсловий, "КлючСтроки");
			
			Если СтрокаСКлючем <> Неопределено И ЗначениеЗаполнено(СтрокаСКлючем.ТипЦен) Тогда
				НовыйДокЗаказ.ТипЦен = СтрокаСКлючем.ТипЦен;
			КонецЕсли;
			
		Исключение
		КонецПопытки                                        		
		
	КонецЕсли;
	
	Если НЕ НовыйДокЗаказ.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		Причина = ?(Причина = "", Причина, Причина + ", ") + "Вид основного договора не с покупателем";	
	КонецЕсли;	
	
	НовыйДокЗаказ.УчитыватьНДС = Истина;
	НовыйДокЗаказ.СуммаВключаетНДС = Истина;
	
	НовыйДокЗаказ.ВалютаДокумента = НовыйДокЗаказ.мВалютаРегламентированногоУчета;
	//Ниже курс и кратность указаны для рублей
	НовыйДокЗаказ.КратностьВзаиморасчетов = 1;
	НовыйДокЗаказ.КурсВзаиморасчетов = 1;
	
	НовыйДокЗаказ.СкладГруппа = Константы.ОсновнойСклад.Получить();
	НовыйДокЗаказ.Комментарий = СокрЛП(Шапка.Comment);
	
	Если EMailЗаказ Тогда
		
		НеСозданныйЗП.Контрагент = НовыйДокЗаказ.Контрагент;
		НеСозданныйЗП.ФилиалКонтрагента = НовыйДокЗаказ.Грузополучатель;
		
	КонецЕсли;
	
	//#############################Заполнение табличной части Заказа ###########################
	ДокСумма = 0;
	
	СтрокиЗаказа = ?(EMailЗаказ, Строки, Строки.Lines);  
	
	Для Каждого стр из СтрокиЗаказа Цикл
		
		НоваяСтрокаНеСозданныйЗП = НеСозданныйЗП.Товары.Добавить();
		НоваяСтрокаНеСозданныйЗП.Articul   = стр.Articul;
		НоваяСтрокаНеСозданныйЗП.Brand     = стр.Brand;
		НоваяСтрокаНеСозданныйЗП.Comment   = стр.Comment;
		НоваяСтрокаНеСозданныйЗП.Count     = стр.Count;
		НоваяСтрокаНеСозданныйЗП.РазрешеноКОтгрузке = стр.Count;
		НоваяСтрокаНеСозданныйЗП.Name      = стр.Name;
		НоваяСтрокаНеСозданныйЗП.NumberInv = стр.NumberInv;
		НоваяСтрокаНеСозданныйЗП.Price     = стр.Price;	
		НоваяСтрокаНеСозданныйЗП.Price_Zak = стр.Price_Zak;
		
		Попытка
			НоваяСтрокаНеСозданныйЗП.ПроизводительПоставщика = стр.PROIZV_SUPPLIER;
		Исключение
		КонецПопытки;
		
		
		НоваяСтрокаНеСозданныйЗП.Кратность = 1;// По умолчанию кратность ставим равной 1
		
		Артикул = СокрЛП(стр.NumberInv);
		Товар = ?(ЗначениеЗаполнено(Артикул), НайтиТоварПоАртикулу(Артикул), Неопределено);  
		
		Если Товар = Неопределено Тогда

			ОчищенныйПроизводитель = "";
			СтрокаПроверки = ВРег(СокрЛП(стр.Brand));
			Длина = СтрДлина(СтрокаПроверки);  
			
			Для а = 1 По Длина Цикл            
				
				Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", 
					Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
					ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
				КонецЕсли;                                                                      
				
			КонецЦикла;	
			
			ОчищенныйКодПроизводителя = "";
			СтрокаПроверки = СокрЛП(стр.Articul);
			Длина = СтрДлина(СтрокаПроверки);    
			
			Для а = 1 По Длина Цикл   
				
				Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
					ОчищенныйКодПроизводителя = ОчищенныйКодПроизводителя + Сред(СтрокаПроверки, а, 1);
				КонецЕсли;     
				
			КонецЦикла;
			
			СтрокаПоиска = ОчищенныйПроизводитель+ОчищенныйКодПроизводителя;
			
			Если Не ПустаяСтрока(СтрокаПоиска) Тогда   
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Номенклатура.Ссылка
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.НормализованныйКод = &СтрокаПоиска
				|	И НЕ Номенклатура.ПометкаУдаления";
				
				Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
				Выборка = Запрос.Выполнить().Выбрать();                   
				
				Если Выборка.Количество() >= 1 И Выборка.Следующий() Тогда
					Товар = Выборка.Ссылка;
				Иначе 
					Товар = Неопределено;	
				КонецЕсли;         
				
			КонецЕсли;
			
			Если Товар = Неопределено Тогда     
				
				// ищем бренд в синонимах
				Запрос = Новый Запрос;   
				
				//Запрос сделан аналогично запросу при отправке номенклатуры в МДМ
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
				|	СинонимыПроизводителей.Производитель КАК Производитель,
				|	СинонимыПроизводителей.СинонимПроизводителя
				|ИЗ
				|	РегистрСведений.СинонимыПроизводителей КАК СинонимыПроизводителей
				|ГДЕ
				|	СинонимыПроизводителей.СинонимПроизводителя = &СинонимПроизводителя";
				
				Запрос.УстановитьПараметр("СинонимПроизводителя", ВРег(СокрЛП(стр.Brand)));
				Выборка = Запрос.Выполнить().Выбрать();         
				
				Если Выборка.Количество() >= 1 И Выборка.Следующий() Тогда 
					
					// новое : 
					ОчищенныйПроизводитель = "";
					СтрокаПроверки = ВРег(СокрЛП(Выборка.Производитель));
					Длина = СтрДлина(СтрокаПроверки);   
					
					Для а = 1 По Длина Цикл                       
						
						Если Найти("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyzАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯабвгдеёжзийклмнопрстуфхцчшщъыьэюя", 
							Сред(СтрокаПроверки, а, 1)) <> 0 Тогда
							ОчищенныйПроизводитель = ОчищенныйПроизводитель + Сред(СтрокаПроверки, а, 1);
						КонецЕсли;            
						
					КонецЦикла;			
					
					СтрокаПоиска = ОчищенныйПроизводитель+ОчищенныйКодПроизводителя;
					
					Если Не ПустаяСтрока(СтрокаПоиска) Тогда  
						
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	Номенклатура.Ссылка
						|ИЗ
						|	Справочник.Номенклатура КАК Номенклатура
						|ГДЕ
						|	Номенклатура.НормализованныйКод = &СтрокаПоиска
						|	И НЕ Номенклатура.ПометкаУдаления";
						
						Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
						ВыборкаТовар = Запрос.Выполнить().Выбрать();  
						
						Если ВыборкаТовар.Количество() >= 1 И ВыборкаТовар.Следующий() Тогда
							Товар = ВыборкаТовар.Ссылка;
						Иначе                              
							
							Если НеСоздаватьНоменклатуруВУТ10 Тогда
								
								Товар = Неопределено;
								Причина = ?(Причина = "", Причина, Причина + ", ") + "Товар : не найден по нормализованному коду: " + СтрокаПоиска;    
								
							Иначе                 
								
								Комментарий = "Создана автоматически при загрузке Заказа покупателя с портала";       
								
								Если НЕ СоздатьНовуюНоменклатуру(Стр, Выборка.Производитель, Товар, Ложь, Комментарий, НЕ ЭтоСтороннийСклад или EMailЗаказ) Тогда   
									
									Причина = ?(Причина = "", Причина, Причина + ", ") + "Товар : не найден по нормализованному коду: " + СтрокаПоиска;
									Товар = Неопределено;   
									
								КонецЕсли;  
								
							КонецЕсли;								
						КонецЕсли;
					Иначе
						
						Причина = ?(Причина = "", Причина, Причина + ", ") + "Товар не найден" + СтрокаПоиска;
						Товар = Неопределено;
						
					КонецЕсли;
					
				Иначе
					
					Если НеСоздаватьНоменклатуруВУТ10 Тогда
						
						Товар = Неопределено;
						Причина = ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
						
					Иначе
						
						Комментарий = "Создана автоматически при загрузке Заказа покупателя с портала"; 
						
						Если НЕ СоздатьНовуюНоменклатуру(Стр, Справочники.Номенклатура.ПустаяСсылка(), Товар, Ложь, Комментарий, НЕ ЭтоСтороннийСклад или EMailЗаказ) Тогда
							Причина = ?(Причина = "", Причина, Причина + ", ") + ?(EMailЗаказ, "Товар не найден", "Товар : не найден по нормализованному коду: " + СтрокаПоиска);
						КонецЕсли;
						
					КонецЕсли;						
					
				КонецЕсли;							
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Товар = неопределено Тогда		
			
			Если НеСоздаватьНоменклатуруВУТ10 Тогда  
				
				НеСозданныйЗП.НеНайденаНоменклатура = Истина; 
				НоваяСтрокаНеСозданныйЗП.НеНайденаНоменклатура = Истина; 
				
			КонецЕсли;		
			
			Продолжить;		
			
		ИначеЕсли EMailЗаказ Тогда      
			
			НоваяСтрокаНеСозданныйЗП.NumberInv = Товар.Артикул;
			НоваяСтрокаНеСозданныйЗП.Articul = Товар.КодПроизводителя;
			НоваяСтрокаНеСозданныйЗП.Name = Товар.Наименование;
			НоваяСтрокаНеСозданныйЗП.Brand = СокрЛП(Товар.Родитель.Наименование);
			НоваяСтрокаНеСозданныйЗП.Кратность = МСК.ПолучитьКратностьНоменклатуры(Товар);   
			
		КонецЕсли;
		
		НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();	
		НоваяСтрока.Номенклатура = Товар;
		НоваяСтрока.ЦенаЗакупки = стр.Price_Zak;
		
		СоздаемНоменклатуруСкладаВМДМ = Ложь;   
		
		Если НЕ ЭтоСтороннийСклад Тогда
			СоздаемНоменклатуруСкладаВМДМ = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).СоздаватьНоменклатуруВМДМ;
		КонецЕсли;		                    
		
		Если ЭтоСтороннийСклад ИЛИ СоздаемноменклатуруСкладаВМДМ И НЕ EMailЗаказ Тогда 
			НоваяСтрока.ПроизводительПоставщика = стр.PROIZV_SUPPLIER; 
		КонецЕсли;
		
		//________
		НовыйДокЗаказ.ПриИзмененииНоменклатурыТоваров(НоваяСтрока);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, НовыйДокЗаказ);
		//~~~~~~~
		НоваяСтрока.ЕдиницаИзмерения = Товар.ЕдиницаХраненияОстатков;
		НоваяСтрока.Количество = Число(СтрЗаменить(СокрЛП(стр.Count), Символы.НПП, ""));   
		
		Если EMailЗаказ Тогда          
			
			Если НЕ МСК.ПроверкаНоменклатурыНаКратность(Товар, НоваяСтрока.Количество) Тогда 
				
				Причина = ?(Причина = "", Причина, Причина + ", ") + "Нарушена кратность";
				НоваяСтрокаНеСозданныйЗП.Причина = ?( НоваяСтрокаНеСозданныйЗП.Причина = "", НоваяСтрокаНеСозданныйЗП.Причина, НоваяСтрокаНеСозданныйЗП.Причина + ", ") 
				                                 + "Нарушена кратность";
				НоваяСтрокаНеСозданныйЗП.РазрешеноКОтгрузке = 0 ;
				
			КонецЕсли;
			
		КонецЕсли;		
		
		Если НЕ НовыйДокЗаказ.Контрагент.НеИспользоватьЦеныПортала ИЛИ ЭтоСтороннийСклад ИЛИ EMailЗаказ Тогда 
			НоваяСтрока.Цена = Число(СтрЗаменить(СокрЛП(стр.Price), Символы.НПП, ""));
		КонецЕсли;	
		
		СтрСумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		НоваяСтрока.Сумма = СтрСумма;
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
		
		НоваяСтрока.Комментарий = стр.Comment;
		
		ДокСумма = ДокСумма+СтрСумма;    
		
	КонецЦикла;                                           	
	
	Если EMailЗаказ и ЗначениеЗаполнено(НовыйДокЗаказ.Контрагент) и ЗначениеЗаполнено(НовыйДокЗаказ.ДоговорКонтрагента) Тогда
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Цена");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Цена КАК ЦенаКлиента
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТипыЦенНоменклатуры.Рассчитывается
		|			ТОГДА ТипыЦенНоменклатуры.БазовыйТипЦен
		|		ИНАЧЕ ТипыЦенНоменклатуры.Ссылка
		|	КОНЕЦ КАК ТипЦенЗаказ,
		|	ВЫБОР
		|		КОГДА ТипыЦенНоменклатуры.Рассчитывается
		|			ТОГДА 1 + ТипыЦенНоменклатуры.ПроцентСкидкиНаценки / 100
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Коэффициент
		|ПОМЕСТИТЬ ВТ_ТипЦены
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|ГДЕ
		|	ТипыЦенНоменклатуры.Ссылка = &ТипЦенЗаказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ЕСТЬNULL(ТаблицаНоменклатура.ЦенаКлиента, 0) КАК ЦенаКлиента,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТ_ТипЦены.Коэффициент * ЦеныНоменклатурыСрезПоследних.Цена КАК ЧИСЛО(15, 2)), 0) КАК ЦенаПоДоговору
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ТаблицаНоменклатура.Номенклатура
		|						ИЗ
		|							ТаблицаНоменклатура)
		|					И ТипЦен В
		|						(ВЫБРАТЬ
		|							ВТ_ТипЦены.ТипЦенЗаказ
		|						ИЗ
		|							ВТ_ТипЦены)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура,
		|	ВТ_ТипЦены КАК ВТ_ТипЦены";
		
		Запрос.УстановитьПараметр("ТипЦенЗаказ", ?(ТипЦенЗаказа = Неопределено ИЛИ ТипЦенЗаказа.Пустая(), НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен, ТипЦенЗаказа));
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		ПроцентОтклонения = НовыйДокЗаказ.Контрагент.EMailЗаказ_КонтролироватьРасхождениеЦенВПроцентах;   
		
		Для Каждого СтрРезультата Из Результат Цикл
			
			Отбор = Новый Структура("Articul,NumberInv,Price", СтрРезультата.Номенклатура.КодПроизводителя, СтрРезультата.Номенклатура.Артикул, СтрРезультата.ЦенаКлиента);
			СтрокиНеСоздЗП = НесозданныйЗП.Товары.НайтиСтроки(Отбор);
			
			//Если в файле клиента нет цены
			Если (СтрРезультата.ЦенаКлиента = 0) и ЗначениеЗаполнено(СтрРезультата.ЦенаПоДоговору) Тогда  
				
				СтрокиДок = НовыйДокЗаказ.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрРезультата.Номенклатура)); 
				
				Для Каждого СтрДок Из СТрокиДок Цикл          
					
					СтрДок.Цена = СтрРезультата.ЦенаПоДоговору;
					СтрДок.Сумма = СтрДок.Цена * СтрДок.Количество;
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрДок, НовыйДокЗаказ);
					ДокСумма = НовыйДокЗаказ.Товары.Итог("Сумма");   
					
				КонецЦикла;                  
				
				Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл
					СтрНеСоздЗП.Price = СтрРезультата.ЦенаПоДоговору;
				КонецЦикла;
				
			Иначе           
				
				СтрПричина = "";
				ОтклонениеЦены = Ложь;  
				
				Если СтрРезультата.ЦенаПоДоговору = 0 Тогда  
					
					СтрПричина = "Не задана цена по договору";  
					
					Если Найти(Причина, "Не задана цена по договору") = 0 Тогда
						Причина = ?(Причина = "", Причина, Причина + ", ") + "Не задана цена по договору для товара(ов)";
					КонецЕсли;              
					
				ИначеЕсли (СтрРезультата.ЦенаКлиента > 0) И (СтрРезультата.ЦенаКлиента < Окр(СтрРезультата.ЦенаПоДоговору * (1 - ПроцентОтклонения / 100), 2)) Тогда
					
					СтрПричина = Строка(Окр(СтрРезультата.ЦенаПоДоговору * (1 - ПроцентОтклонения / 100), 2));
					ОтклонениеЦены = Истина;                  
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрПричина) Тогда       
					
					Для Каждого СтрНеСоздЗП Из СтрокиНеСоздЗП Цикл    
						
						Если СтрНеСоздЗП.Причина <> СтрПричина Тогда   
							
							СтрНеСоздЗП.Причина = ?(СтрНеСоздЗП.Причина = "", СтрНеСоздЗП.Причина, СтрНеСоздЗП.Причина + ", ") + "Откл. цены";
							СтрНеСоздЗП.ЦенаОтгрузки = СтрПричина;
							СтрНеСоздЗП.РазрешеноКОтгрузке = 0;      
							
							Если ОтклонениеЦены И Найти(Причина, "Отклонение цены") = 0 Тогда
								Причина = ?(Причина = "", Причина, Причина + ", ") + "Отклонение цены более " + Строка(ПроцентОтклонения) + "%";
							КонецЕсли;    
							
						КонецЕсли;	
						
					КонецЦикла; 
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЦикла;    
		
	КонецЕсли;
	///
	
	Если НЕ СокрЛП(Причина) = "" Или ПустойСтороннийСклад(НовыйДокЗаказ) Тогда  
		
		НеСозданныйЗП.Причина = Причина;
		
		Если ПустойСтороннийСклад(НовыйДокЗаказ) Тогда
			НеСозданныйЗП.Причина = ?( НеСозданныйЗП.Причина = "", "", НеСозданныйЗП.Причина + ", ") + "Отсутствует сторонний склад -> Запрет создания сторонних складов";
		КонецЕсли; 
		
		НеСозданныйЗП.Записать();
		НовыйЗаказ = НеСозданныйЗП.Ссылка;
		
		СтрокаВозврата.Status = "1";
		РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата); 
		
		Если Не EMailЗаказ Тогда
			ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,, "Записан несозданный заказ (код " + СокрЛП(НеСозданныйЗП.Код) + ")");
		КонецЕсли;                       
		
		Возврат РезультатДляВозвратаПорталу;    
		
	КонецЕсли;	                          
	
	НовыйДокЗаказ.СуммаДокумента = ДокСумма;
	
	//_Заполнить и провести
	ВидимостьСерии = Истина;
	Авторезервирование = Истина;
	Авторазмещение = Ложь;
	СтратегияАвторезервированияПоЗаказам = Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидимостьСерии",     ВидимостьСерии);
	СтруктураПараметров.Вставить("Авторезервирование", Авторезервирование);
	СтруктураПараметров.Вставить("Авторазмещение",     Авторазмещение);
	СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", СтратегияАвторезервированияПоЗаказам);
	
	НовыйДокЗаказ.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);
	
	//Флаг обособленной отгрузки заполняем именно здесь, если выше, то размещение не заполнится 
	//+Шульман А. 20.10.2025 #UT10-5457
	Если Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) Тогда  
		НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Ложь;    
	//-Шульман А. 20.10.2025 #UT10-5457
	Иначе
	
		Если НовыйДокЗаказ.СпособДоставки = Перечисления.СпособДоставки.НашаДоставка 
			И ЗначениеЗаполнено(НовыйДокЗаказ.Грузополучатель)   
			И НовыйДокЗаказ.Грузополучатель.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
			НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Справочники.СобственныеСклады.IDСоответстуетОбособленнойОтгрузке(НовыйДокЗаказ.IDСклада);
		КонецЕсли;	
		
	КонецЕсли;
	
	СкладФильтр = Константы.ОсновнойСклад.Получить(); 
	
	Для каждого Стр Из НовыйДокЗаказ.Товары Цикл	
		
		Если НЕ Стр.Размещение = СкладФильтр ИЛИ НЕ ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда					
			Стр.Размещение = "";    
		КонецЕсли; 
		
	КонецЦикла; 
		
	Если ТекущаяДата() >= Константы.РезервированиеЗаказовСУчетомЯчеек.Получить() Тогда      
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура,Размещение", "Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
		|ПОМЕСТИТЬ КонстКратности
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Размещение <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Остаток,
		|	1 КАК Поле1
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыГотовыеКСборкеОстатки.Номенклатура,
		|	-ТоварыГотовыеКСборкеОстатки.КоличествоОстаток,
		|	3
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	СУММА(Остатки.Остаток) КАК Остаток,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонстКратности.ЗначениеКонстанты
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
		|							ТОГДА Остатки.Номенклатура.КратностьФилиала
		|						ИНАЧЕ Остатки.Номенклатура.Кратность
		|					КОНЕЦ
		|			ИНАЧЕ Остатки.Номенклатура.Кратность
		|		КОНЕЦ) КАК Кратность
		|ПОМЕСТИТЬ ОстаткиГруппа
		|ИЗ
		|	Остатки КАК Остатки,
		|	КонстКратности КАК КонстКратности
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиГруппа.Номенклатура,
		|	СУММА(ОстаткиГруппа.Остаток) КАК Остаток,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиГруппа.Остаток > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ОстаткиГруппа.Кратность > ОстаткиГруппа.Остаток
		|							ТОГДА 0
		|						ИНАЧЕ ВЫБОР
		|								КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|									ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|								ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|						ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|					ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))
		|				КОНЕЦ
		|		КОНЕЦ) КАК ОстатокПоКратности
		|ПОМЕСТИТЬ ОстаткиИтог
		|ИЗ
		|	ОстаткиГруппа КАК ОстаткиГруппа
		|ГДЕ
		|	ОстаткиГруппа.Остаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиГруппа.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0)
		|	КОНЕЦ КАК Нехватка_,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
		|	КОНЕЦ КАК Нехватка
		|ПОМЕСТИТЬ Рез
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИтог КАК ОстаткиИтог
		|		ПО ТаблицаНоменклатура.Номенклатура = ОстаткиИтог.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рез.Номенклатура,
		|	Рез.Нехватка
		|ИЗ
		|	Рез КАК Рез
		|ГДЕ
		|	Рез.Нехватка > 0";         
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("ПустоеРазмещение", Неопределено);
		Табл = Запрос.Выполнить().Выгрузить();    
		
		Для каждого стр из Табл Цикл          
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Стр.Номенклатура);
			НайдСтроки = НовыйДокЗаказ.Товары.НайтиСтроки(Отбор);
			КУменьшению = Стр.Нехватка;          
			
			Для каждого строка из НайдСтроки Цикл  
				
				Если КУменьшению > 0 Тогда          
					
					Если Строка.Количество > КУменьшению Тогда   
						
						НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
						Строка.Количество = Строка.Количество - КУменьшению;
						НоваяСтрока.Количество = КУменьшению;
						НоваяСтрока.Размещение = "";
						НоваяСтрока.СерияНоменклатуры = "";
						
						КУменьшению = 0;
						СтрСумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
						НоваяСтрока.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
						
						СтрСумма = Строка.Количество * Строка.Цена;
						Строка.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, НовыйДокЗаказ);  
						
					Иначе                                             
						
						КУменьшению = КУменьшению - Строка.Количество;
						Строка.Размещение = "";
						Строка.СерияНоменклатуры = "";   
						
					КонецЕсли;
					
				КонецЕсли;   
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	//---
	
	СобственныйСкладКакСторонний = Ложь;   
	
	Если НЕ ЭтоСтороннийСклад Тогда
		СобственныйСкладКакСторонний = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).ИсключитьИзОбщегоЭкспресса;
	КонецЕсли;	
	
	Если ЭтоСтороннийСклад ИЛИ СобственныйСкладКакСторонний Тогда  
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура, Цена, Коэффициент, Размещение, СерияНоменклатуры", "Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
    	"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Цена КАК ЦенаПортал,
		|	ТЗ.Коэффициент КАК Коэффициент,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение,
		|	ТЗ.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЦенаПортал,
		|	СправочникНоменклатура.Кратность КАК Коэффициент,
		|	ТаблицаНоменклатура.Количество,
		|	ТаблицаНоменклатура.Размещение,
		|	ТаблицаНоменклатура.СерияНоменклатуры
		|ПОМЕСТИТЬ ТабОстатков
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТаблицаНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	ТаблицаНоменклатура.СерияНоменклатуры <> &ПустаяСерия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабОстатков.Номенклатура,
		|	ТабОстатков.ЦенаПортал,
		|	ТабОстатков.Количество,
		|	ТабОстатков.Коэффициент,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаПоДоговору,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 3)) КАК Дробное,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Целое
		|ИЗ
		|	ТабОстатков КАК ТабОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ТабОстатков.Номенклатура
		|						ИЗ
		|							ТабОстатков КАК ТабОстатков)
		|					И ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТабОстатков.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦенЗаказ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Рубль) КАК КурсРубля
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПроверкаЦенСебестоимости
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ТабОстатков.ЦенаПортал >= ВЫБОР
		|					КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|						ТОГДА 0
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|								ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|							ИНАЧЕ ВЫБОР
		|									КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|											И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|											И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|											И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|										ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|									ИНАЧЕ 0
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 3))) = (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 0)))";
		
		Запрос.УстановитьПараметр("ТипЦенЗаказ", НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен);
		Запрос.УстановитьПараметр("Рубль", Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяСерия", Справочники.СерииНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		ПроверкаЦенСебестоимости = ЗначениеЗаполнено(Константы.МинимальнаяНаценкаНаСебестоимость.Получить()) 
		               И ЗначениеЗаполнено(Константы.ЦенаСебестоимость.Получить()) И СобственныйСкладКакСторонний; 
		Запрос.УстановитьПараметр("ПроверкаЦенСебестоимости", ПроверкаЦенСебестоимости);

		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда          
			
			Для Каждого Стр Из НовыйДокЗаказ.Товары Цикл  
				
				Стр.Размещение = "";
				Стр.СерияНоменклатуры = "";     
				
			КонецЦикла;      
			
		Иначе
			
			Для Каждого Стр Из НовыйДокЗаказ.Товары Цикл   
				
				СтрРезультат = Результат.Найти(Стр.Номенклатура, "Номенклатура"); 
				
				Если СтрРезультат = Неопределено  Тогда   
					
					Стр.Размещение = "";
					Стр.СерияНоменклатуры = "";         
					
				ИначеЕсли СтрРезультат.ЦенаПоДоговору = 0 И НЕ ПроверкаЦенСебестоимости Тогда
					Стр.Размещение = "";
				КонецЕсли;     
				
			КонецЦикла;   
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыйДокЗаказ.ТолькоРезерв Тогда   
		
		ПромТабличнаяЧасть = НовыйДокЗаказ.Товары.Выгрузить();
		ПромТабличнаяЧасть.ЗаполнитьЗначения(НовыйДокЗаказ.ТолькоРезерв, "ТолькоРезерв");
		НовыйДокЗаказ.Товары.Загрузить(ПромТабличнаяЧасть); 
		
	КонецЕсли;
	
	ОбработатьРезервОбособленнойОтгрузки(НовыйДокЗаказ);
	
	ПроверитьЦеныПоИсключительнымСкладам(НовыйДокЗаказ);
	
	Попытка
		
		//+Белов А. 10.03.2026 #UT10-5729
		ВыделитьМаркировкуВОтдельныйЗаказ = Ложь;
		
		//Если основная организация
		Если НовыйДокЗаказ.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
			ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Константы.ВыделятьТоварыСМаркировкойПоОснОрганизацииВОтдельныйЗаказ.Получить() И МСКWEB.ПоДоворуНужноВыделениеЗаказаСМаркировкойВОтдельный(НовыйДокЗаказ.ДоговорКонтрагента);		
		Иначе
			//Если управленческая организация	
			ВыделитьМаркировкуВОтдельныйЗаказ = Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) И Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить();  				
		КонецЕсли;
		
		Если ВыделитьМаркировкуВОтдельныйЗаказ Тогда
			
			СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
			НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;  
			
		Иначе
			НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
		КонецЕсли;
		
		////+Белов А. 25.12.2025 #UT10-5586
		//Если Не Константы.НеВыделятьТоварыСМаркировкойПоУпрОрганизацииВОтдельныйЗаказ.Получить() 
		//	И НовыйДокЗаказ.Организация <> Константы.ОсновнаяОрганизация.Получить() 
		//	И Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) Тогда
		//	
		//	СтруктураВыделения = МСКWEB.ВыделитьМаркировкуВОтдельныйЗаказ(НовыйДокЗаказ);	
		//	НовыйДокЗаказ = СтруктураВыделения.ЗаказИсходныйОбъект;
		//	
		////-Белов А. 25.12.2025 #UT10-5586	
		//Иначе
		//	
		//	НовыйДокЗаказ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
		//КонецЕсли;  
		//-Белов А. 10.03.2026 #UT10-5729
		
		СтрокаВозврата.OrderNumber = НовыйДокЗаказ.Номер;	
		СтрокаВозврата.Status = "0";
		РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);			
		НовыйЗаказ = НовыйДокЗаказ.Ссылка;
			
	Исключение 
		
		НеСозданныйЗП.Причина = ?( НеСозданныйЗП.Причина = "", "", НеСозданныйЗП.Причина + ", ") + "Ошибка при проведении заказа покупателя"; 
		НеСозданныйЗП.Записать();
		СтрокаВозврата.Status = "1";
		РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);	
		ЗаписьЖурналаРегистрации("Оформление заказа с портала", УровеньЖурналаРегистрации.Информация,,, 
		"Ошибка при проведении заказа покупателя (" + ОписаниеОшибки() + "). Записан Несозданный заказ (код " + СокрЛП(НеСозданныйЗП.Код) + ")");
		
		Возврат РезультатДляВозвратаПорталу;
		
	КонецПопытки;	
	
	Коментарий = "Документ сформирован автоматически при загрузке заказа покупателя из портала";  
	
	Если Не ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда
		
		Если МСК.НеобходимоПроверятьКратностьВЗаказе(НовыйДокЗаказ) Тогда     
			
			СтруктураВозврата = СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ, , Коментарий);  
			
			Если ЗначениеЗаполнено(СтруктураВозврата.Ошибка) Тогда  
				
				СтрокаВозврата.Status = "3";
				РезультатДляВозвратаПорталу.OutForPortalLines.Добавить(СтрокаВозврата);	
				
			КонецЕсли;       
			
		КонецЕсли;		
		
	КонецЕсли;  
	
	Если EMailЗаказ Тогда
		ЗаписьЖурналаРегистрации("Запрос данных с эл почты", УровеньЖурналаРегистрации.Информация,,, "TransmitOrderFromEMail окончание ");	
	Иначе
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции 

Функция ВыделитьМаркировкуВОтдельныйЗаказ(ЗаказОбъект) Экспорт
	//+Белов А. 25.12.2025 #UT10-5586
	
	СтруктураВозврата = Новый Структура("ЗаказИсходныйОбъект, ЗаказМаркировкаОбъект", Неопределено, Неопределено);
	СтруктураВозврата.ЗаказИсходныйОбъект = ЗаказОбъект;
	
	ДоговорМаркировки = ПолучитьДоговорДляМаркированныхТоваров(ЗаказОбъект.Контрагент);
	
	Если ЗначениеЗаполнено(ДоговорМаркировки) Тогда
		
		ЗаказСМаркировкой = Документы.ЗаказПокупателя.СоздатьДокумент(); 
		ЗаполнитьЗначенияСвойств(ЗаказСМаркировкой, ЗаказОбъект,,"Номер,Ссылка");
		
		ЗаказСМаркировкой.ДоговорКонтрагента = ДоговорМаркировки;
		ЗаказСМаркировкой.Организация = ДоговорМаркировки.Организация;
		
		СтрокиУдаления = Новый Массив;
		
		Для каждого Стр Из ЗаказОбъект.Товары Цикл
			
			Если Стр.Номенклатура.ТребуетсяМаркировка Тогда
				СтрокиУдаления.Добавить(Стр);		
			КонецЕсли;
			
		КонецЦикла; 
		
		Для каждого СтрУдаления Из СтрокиУдаления Цикл
			
			НСтр = ЗаказСМаркировкой.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, СтрУдаления); 
			
			ЗаказОбъект.Товары.Удалить(СтрУдаления);
			
		КонецЦикла;
		
		Попытка
			
			//Может так случиться, что все товары в заказе с маркировкой
			Если ЗаказОбъект.Товары.Количество() > 0 Тогда
				
				НачатьТранзакцию();
				
				ЗаказСМаркировкой.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 	
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
				
				ЗафиксироватьТранзакцию();
				
				СтруктураВозврата.ЗаказМаркировкаОбъект = ЗаказСМаркировкой;
				
			Иначе
				
				ЗаказСМаркировкой.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
				СтруктураВозврата.ЗаказИсходныйОбъект = ЗаказСМаркировкой;
									
			КонецЕсли;   
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();	
			КонецЕсли;      
			
			ВызватьИсключение("Произошла ошибка: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	//Если договор не найден, вводим корректировку заказа
	Иначе 
		
		Попытка
			
			НачатьТранзакцию();
			
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 
			
			//+Белов А. 02.03.2026 #UT10-5729
			Если ЗаказОбъект.Организация = Константы.ОсновнаяОрганизация.Получить() Тогда
				КорректировкаОбъект = СоздатьКорректировкуПоМаркированнымТоварам(ЗаказОбъект.Ссылка, "Маркированные товары нужно выделять в отдельный заказ. Розничный или лицевой договор у клиента не найден"); 
			Иначе
			//-Белов А. 02.03.2026 #UT10-5729
				КорректировкаОбъект = СоздатьКорректировкуПоМаркированнымТоварам(ЗаказОбъект.Ссылка, "Маркированные товары нельзя отгружать по упр организации. Розничный или лицевой договор у клиента не найден"); 
			КонецЕсли;	
			
			КорректировкаОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаСтороннийСклад", Истина);
			КорректировкаОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный); 				
			
			ЗафиксироватьТранзакцию();  
			
		Исключение
			
			Если ТранзакцияАктивна() Тогда
				ОтменитьТранзакцию();	
			КонецЕсли;      
			
			ВызватьИсключение("Произошла ошибка: " + ОписаниеОшибки()); 		
			
		КонецПопытки;     
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
	//-Белов А. 25.12.2025 #UT10-5586
КонецФункции

Функция СоздатьКорректировкуПоМаркированнымТоварам(ЗаказСсылка, Комментарий = "") 
	
	ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ДокументКорректировки.Заполнить(ЗаказСсылка);
	ДокументКорректировки.Дата = ТекущаяДата();
	ДокументКорректировки.Комментарий = Комментарий;
	ДокументКорректировки.ВалютаДокумента = ЗаказСсылка.ВалютаДокумента; 
	
	ДокументКорректировки.Товары.Очистить();
	ДокументКорректировки.Услуги.Очистить();                               
	ДокументКорректировки.ВозвратнаяТара.Очистить();
	
	Номенклатура = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	СерияНоменклатуры = Неопределено;
	
	Для каждого Стр Из ЗаказСсылка.Товары Цикл
		
		Если Не Стр.Номенклатура.ТребуетсяМаркировка Тогда
			Продолжить;
		КонецЕсли;	
		
		НоваяСтрока = ДокументКорректировки.Товары.Добавить();		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);	
		
		НоваяСтрока.Количество = -1 * Стр.Количество;	
		НоваяСтрока.Причина = ?(ЗаказСсылка.ТаксиДоставка, Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика, Перечисления.ПричиныКорректировкиСборки.ОтказКлиента);
		
		мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
		
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);	
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);	
		ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
		
	КонецЦикла; 
	
	ДокументКорректировки.СуммаДокумента = ДокументКорректировки.Товары.Итог("Сумма");
	
	Возврат ДокументКорректировки;
		
КонецФункции

Функция ПолучитьДоговорДляМаркированныхТоваров(Контрагент)
//+Белов А. 25.12.2025 #UT10-5586

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ЛицевойСчет
	|			ТОГДА 1
	|		КОГДА ДоговорыКонтрагентов.РозничнаяПродажа
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И (ДоговорыКонтрагентов.ЛицевойСчет
	|			ИЛИ ДоговорыКонтрагентов.РозничнаяПродажа)
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;                 
	
	Возврат Неопределено;

	//-Белов А. 25.12.2025 #UT10-5586
КонецФункции

Функция ПоДоворуНужноВыделениеЗаказаСМаркировкойВОтдельный(ДоговорКонтрагента) Экспорт
	//+Белов А. 02.03.2026 #UT10-5729
	
	МассивУсловий = Новый Массив;
	МассивУсловий.Добавить(Перечисления.УсловияРаботыСЧЗ.НеПокупаетТоварыЧЗ);
	МассивУсловий.Добавить(Перечисления.УсловияРаботыСЧЗ.НеКлассифицирован);
	МассивУсловий.Добавить(Перечисления.УсловияРаботыСЧЗ.ТоварыЧЗВРозницу);
	МассивУсловий.Добавить(Перечисления.УсловияРаботыСЧЗ.ПустаяСсылка());
	
	УсловияРаботыСЧЗ = ДоговорКонтрагента.УсловияРаботыСЧЗ;
	
	Если МассивУсловий.Найти(УсловияРаботыСЧЗ) <> Неопределено
		И Не ДоговорКонтрагента.ЛицевойСчет
		И Не ДоговорКонтрагента.РозничнаяПродажа Тогда
		Возврат Истина;	
	КонецЕсли;         
	
	Возврат Ложь;
	
	//-Белов А. 02.03.2026 #UT10-5729		
КонецФункции


Процедура ОбработатьРезервОбособленнойОтгрузки(НовыйДокЗаказ) Экспорт
	
	//+Шульман А. 20.10.2025 #UT10-5457
	Если НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала И Маркировка.ЕстьНоменклатураТребующаяМаркировки(НовыйДокЗаказ.Товары.Выгрузить()) Тогда  
		
		НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Ложь;     
		Возврат;
		
	КонецЕсли;
	//-Шульман А. 20.10.2025 #UT10-5457
	
	Если НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
		
		ПоВсемТоварамВсталРезерв = Истина;
		
		Для Каждого Стр Из НовыйДокЗаказ.Товары Цикл
			
			Если Не ЗначениеЗаполнено(Стр.Размещение) Тогда
				
				ПоВсемТоварамВсталРезерв = Ложь;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Не ПоВсемТоварамВсталРезерв Тогда
			
			Для Каждого Стр Из НовыйДокЗаказ.Товары Цикл
				Стр.Размещение = "";  			
			КонецЦикла;
			
		Иначе   
			НовыйДокЗаказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала = Ложь;	
		КонецЕсли;  
		
	КонецЕсли;
	
КонецПроцедуры   

Процедура ПроверитьЦеныПоИсключительнымСкладам(НовыйДокЗаказ) Экспорт
//+Гавриленков В. 23.11.2024 #UT10-4934       

	Если ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада) И Справочники.СобственныеСклады.IDСоответстуетИсключительномуСкладу(НовыйДокЗаказ.IDСклада) Тогда 
	
		Если ЗначениеЗаполнено(Константы.МинимальнаяНаценкаНаСебестоимость.Получить()) И ЗначениеЗаполнено(Константы.ЦенаСебестоимость.Получить()) Тогда
			
			ЗапросСоответствияЦен = Новый Запрос;
			ЗапросСоответствияЦен.Текст =
			"ВЫБРАТЬ
			|	ТаблФильтр.Номенклатура,
			|	ТаблФильтр.Цена
			|ПОМЕСТИТЬ ВТ_Товары
			|ИЗ
			|	&ТаблФильтр КАК ТаблФильтр
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВТ_Товары.Номенклатура КАК Номенклатура,
			|	МИНИМУМ(ВТ_Товары.Цена) КАК Цена,
			|	МАКСИМУМ(Константы.ЦенаСебестоимость) КАК Себестоимость,
			|	МАКСИМУМ(Константы.МинимальнаяНаценкаНаСебестоимость) КАК МинимальнаяНаценка
			|ПОМЕСТИТЬ ВТ_ТоварыЗаказа
			|ИЗ
			|	Константы КАК Константы,
			|	ВТ_Товары КАК ВТ_Товары
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТ_Товары.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
			|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0)) КАК ЦенаСебестоимость
			|ПОМЕСТИТЬ ВТ_ЦеныСебестоимости
			|ИЗ
			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|			,
			|			Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТ_ТоварыЗаказа.Номенклатура
			|					ИЗ
			|						ВТ_ТоварыЗаказа)
			|				И ТипЦен В
			|					(ВЫБРАТЬ
			|						ВТ_ТоварыЗаказа.Себестоимость
			|					ИЗ
			|						ВТ_ТоварыЗаказа)) КАК ЦеныНоменклатурыСрезПоследних
			|
			|СГРУППИРОВАТЬ ПО
			|	ЦеныНоменклатурыСрезПоследних.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТоварыЗаказа.Номенклатура,
			|	ВТ_ТоварыЗаказа.Цена КАК ЦенаЗаказа,
			|	ЕСТЬNULL(ВТ_ЦеныСебестоимости.ЦенаСебестоимость, 0) * ВТ_ТоварыЗаказа.МинимальнаяНаценка / 100 + ЕСТЬNULL(ВТ_ЦеныСебестоимости.ЦенаСебестоимость, 0) КАК МинимальнаяЦена
			|ПОМЕСТИТЬ ВТ_Итог
			|ИЗ
			|	ВТ_ТоварыЗаказа КАК ВТ_ТоварыЗаказа
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныСебестоимости КАК ВТ_ЦеныСебестоимости
			|		ПО ВТ_ТоварыЗаказа.Номенклатура = ВТ_ЦеныСебестоимости.Номенклатура
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Итог.Номенклатура,
			|	ВТ_Итог.ЦенаЗаказа,
			|	ВТ_Итог.МинимальнаяЦена
			|ИЗ
			|	ВТ_Итог КАК ВТ_Итог
			|ГДЕ
			|	(ВТ_Итог.ЦенаЗаказа < ВТ_Итог.МинимальнаяЦена
			|			ИЛИ ВТ_Итог.МинимальнаяЦена = 0)";
			
			ТаблицаФильтра = НовыйДокЗаказ.Товары.Выгрузить(,"Номенклатура, Размещение, Цена");
			
			сч = 0;
			
			Пока сч < ТаблицаФильтра.Количество() Цикл 
				
				ТекСтрока = ТаблицаФильтра.Получить(сч); 
				
				Если ЗначениеЗаполнено(ТекСтрока.Размещение) Тогда
					сч = сч + 1;
				Иначе
					ТаблицаФильтра.Удалить(ТекСтрока);
				КонецЕсли;
				
			КонецЦикла;   
			
			Если ТаблицаФильтра.Количество() = 0 Тогда
				Возврат;
			КонецЕсли;
			
			ТаблицаФильтра.Свернуть("Номенклатура,Цена");
			ЗапросСоответствияЦен.УстановитьПараметр("ТаблФильтр",ТаблицаФильтра);
			
			Выборка = ЗапросСоответствияЦен.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				СтруктураПоиска = Новый Структура("Номенклатура, Цена", Выборка.Номенклатура, Выборка.ЦенаЗаказа);
				МассивНайденных = НовыйДокЗаказ.Товары.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого НайденнаяСтрока Из МассивНайденных Цикл
					НайденнаяСтрока.Размещение = Неопределено;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
	
	КонецЕсли;

//-Гавриленков В. 23.11.2024 #UT10-4934
КонецПроцедуры

Функция ПустойСтороннийСклад(НовыйДокЗаказ)    
	
	Результат = Ложь;
	
	// Проверяем значение НовыйДокЗаказ.IDСклада, что это Собственный Склад	
	Если НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад) Тогда 
		
		Результат = МСК.ЭтоСтороннийСклад(НовыйДокЗаказ.IDСклада);	
		
		Если НЕ Результат Тогда
			Возврат Результат;
		КонецЕсли;    
		
	КонецЕсли; 
	
	
	Если ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада) И НЕ ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад)
		И Константы.НеСоздаватьСтороннийСклад.Получить() Тогда
		Результат = Истина;	   
	КонецЕсли;		
	
	Возврат Результат;  
	
КонецФункции

Процедура ОбработкаРазмещенияИЦенЗаказаПокупателя(НовыйДокЗаказ) Экспорт
	
	ЭтоСтороннийСклад = ЗначениеЗаполнено(НовыйДокЗаказ.IDСклада_СтороннийСклад); 	
	
	СкладФильтр = Константы.ОсновнойСклад.Получить();  
	
	Для каждого Стр Из НовыйДокЗаказ.Товары Цикл	 
		
		Если НЕ Стр.Размещение = СкладФильтр ИЛИ НЕ ЗначениеЗаполнено(Стр.СерияНоменклатуры) Тогда					
			Стр.Размещение = "";
		КонецЕсли;        
		
	КонецЦикла;
	
	Если ТекущаяДата() >= Константы.РезервированиеЗаказовСУчетомЯчеек.Получить() Тогда   
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура, Размещение", "Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
		|ПОМЕСТИТЬ КонстКратности
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.Размещение <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОстатки.Номенклатура,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Остаток,
		|	1 КАК Поле1
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
		|ГДЕ
		|	ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТоварыГотовыеКСборкеОстатки.Номенклатура,
		|	-ТоварыГотовыеКСборкеОстатки.КоличествоОстаток,
		|	3
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
		|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.Номенклатура,
		|	СУММА(Остатки.Остаток) КАК Остаток,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА КонстКратности.ЗначениеКонстанты
		|				ТОГДА ВЫБОР
		|						КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
		|							ТОГДА Остатки.Номенклатура.КратностьФилиала
		|						ИНАЧЕ Остатки.Номенклатура.Кратность
		|					КОНЕЦ
		|			ИНАЧЕ Остатки.Номенклатура.Кратность
		|		КОНЕЦ) КАК Кратность
		|ПОМЕСТИТЬ ОстаткиГруппа
		|ИЗ
		|	Остатки КАК Остатки,
		|	КонстКратности КАК КонстКратности
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиГруппа.Номенклатура,
		|	СУММА(ОстаткиГруппа.Остаток) КАК Остаток,
		|	СУММА(ВЫБОР
		|			КОГДА ОстаткиГруппа.Остаток > 0
		|				ТОГДА ВЫБОР
		|						КОГДА ОстаткиГруппа.Кратность > ОстаткиГруппа.Остаток
		|							ТОГДА 0
		|						ИНАЧЕ ВЫБОР
		|								КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|									ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|								ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))
		|							КОНЕЦ
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
		|						ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
		|					ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))
		|				КОНЕЦ
		|		КОНЕЦ) КАК ОстатокПоКратности
		|ПОМЕСТИТЬ ОстаткиИтог
		|ИЗ
		|	ОстаткиГруппа КАК ОстаткиГруппа
		|ГДЕ
		|	ОстаткиГруппа.Остаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиГруппа.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0)
		|	КОНЕЦ КАК Нехватка_,
		|	ВЫБОР
		|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0) > ТаблицаНоменклатура.Количество
		|			ТОГДА ТаблицаНоменклатура.Количество
		|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
		|	КОНЕЦ КАК Нехватка
		|ПОМЕСТИТЬ Рез
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИтог КАК ОстаткиИтог
		|		ПО ТаблицаНоменклатура.Номенклатура = ОстаткиИтог.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рез.Номенклатура,
		|	Рез.Нехватка
		|ИЗ
		|	Рез КАК Рез
		|ГДЕ
		|	Рез.Нехватка > 0";      
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		Запрос.УстановитьПараметр("ПустоеРазмещение", Неопределено);
		
		Табл = Запрос.Выполнить().Выгрузить();  
		
		Для каждого стр из Табл Цикл   
			
			Отбор = Новый Структура;
			Отбор.Вставить("Номенклатура", Стр.Номенклатура);
			Строки = НовыйДокЗаказ.Товары.НайтиСтроки(Отбор);
			КУменьшению = Стр.Нехватка;     
			
			Для каждого строка из Строки Цикл   
				
				Если КУменьшению > 0 Тогда      
					
					Если Строка.Количество > КУменьшению Тогда   
						
						НоваяСтрока = НовыйДокЗаказ.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка,, "КлючСтроки");
						Строка.Количество = Строка.Количество - КУменьшению;
						НоваяСтрока.Количество = КУменьшению;
						НоваяСтрока.Размещение = "";
						НоваяСтрока.СерияНоменклатуры = "";
						
						КУменьшению = 0;
						СтрСумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
						НоваяСтрока.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, НовыйДокЗаказ);
						
						СтрСумма = Строка.Количество * Строка.Цена;
						Строка.Сумма = СтрСумма;
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, НовыйДокЗаказ);  
						
					Иначе                      
						
						КУменьшению = КУменьшению - Строка.Количество;
						Строка.Размещение = "";
						Строка.СерияНоменклатуры = "";   
						
					КонецЕсли; 
					
				КонецЕсли;  
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;        
	
	СобственныйСкладКакСторонний = Ложь;    
	
	Если НЕ ЭтоСтороннийСклад Тогда
		СобственныйСкладКакСторонний = Справочники.СобственныеСклады.НайтиПоРеквизиту("Идентификатор", НовыйДокЗаказ.IDСклада).ИсключитьИзОбщегоЭкспресса; 
	КонецЕсли;	
	
	Если ЭтоСтороннийСклад ИЛИ СобственныйСкладКакСторонний Тогда   
		
		ТЗ = НовыйДокЗаказ.Товары.Выгрузить();
		ТЗ.Свернуть("Номенклатура, Цена, Коэффициент, Размещение, СерияНоменклатуры", "Количество");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Цена КАК ЦенаПортал,
		|	ТЗ.Коэффициент КАК Коэффициент,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.Размещение КАК Размещение,
		|	ТЗ.СерияНоменклатуры КАК СерияНоменклатуры
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЦенаПортал,
		|	СправочникНоменклатура.Кратность КАК Коэффициент,
		|	ТаблицаНоменклатура.Количество,
		|	ТаблицаНоменклатура.Размещение,
		|	ТаблицаНоменклатура.СерияНоменклатуры
		|ПОМЕСТИТЬ ТабОстатков
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
		|		ПО ТаблицаНоменклатура.Номенклатура = СправочникНоменклатура.Ссылка
		|ГДЕ
		|	ТаблицаНоменклатура.СерияНоменклатуры <> &ПустаяСерия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабОстатков.Номенклатура,
		|	ТабОстатков.ЦенаПортал,
		|	ТабОстатков.Количество,
		|	ТабОстатков.Коэффициент,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|			ТОГДА 0
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|					ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|				ИНАЧЕ ВЫБОР
		|						КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|								И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|							ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|						ИНАЧЕ 0
		|					КОНЕЦ
		|			КОНЕЦ
		|	КОНЕЦ КАК ЦенаПоДоговору,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 1)) КАК Дробное,
		|	ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|			КОГДА ТабОстатков.Коэффициент > 0
		|				ТОГДА ТабОстатков.Коэффициент
		|			ИНАЧЕ 1
		|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Целое
		|ИЗ
		|	ТабОстатков КАК ТабОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				Номенклатура В
		|						(ВЫБРАТЬ
		|							ТабОстатков.Номенклатура
		|						ИЗ
		|							ТабОстатков КАК ТабОстатков)
		|					И ТипЦен = &ТипЦенЗаказ) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО ТабОстатков.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &ТипЦенЗаказ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, ) КАК КурсыВалютСрезПоследних
		|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютСрезПоследних.Валюта)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Рубль) КАК КурсРубля
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ТабОстатков.ЦенаПортал >= ВЫБОР
		|			КОГДА ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЦеныНоменклатурыСрезПоследних.Валюта = &Рубль
		|						ТОГДА ЦеныНоменклатурыСрезПоследних.Цена
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) > 0
		|									И ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) > 0
		|									И ЕСТЬNULL(КурсРубля.Кратность, 0) > 0
		|									И ЕСТЬNULL(КурсРубля.Курс, 0) > 0
		|								ТОГДА ЦеныНоменклатурыСрезПоследних.Цена * (КурсыВалютСрезПоследних.Курс * КурсРубля.Кратность / (КурсРубля.Курс * КурсыВалютСрезПоследних.Кратность))
		|							ИНАЧЕ 0
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 1))) = (ВЫРАЗИТЬ(ТабОстатков.Количество / ВЫБОР
		|				КОГДА ТабОстатков.Коэффициент > 0
		|					ТОГДА ТабОстатков.Коэффициент
		|				ИНАЧЕ 1
		|			КОНЕЦ КАК ЧИСЛО(15, 0)))";
		
		
		Запрос.УстановитьПараметр("ТипЦенЗаказ", НовыйДокЗаказ.ДоговорКонтрагента.ТипЦен);
		Запрос.УстановитьПараметр("Рубль", Константы.ВалютаРегламентированногоУчета.Получить());
		Запрос.УстановитьПараметр("ПустаяСерия", Справочники.СерииНоменклатуры.ПустаяСсылка());
		Запрос.УстановитьПараметр("ТЗ", ТЗ);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
		Если Результат.Количество() = 0 Тогда    
			
			Для каждого Стр Из НовыйДокЗаказ.Товары Цикл      
				
				Стр.Размещение = "";
				Стр.СерияНоменклатуры = "";   
				
			КонецЦикла;     
			
		Иначе
			
			Для каждого Стр Из НовыйДокЗаказ.Товары Цикл  
				
				Если Результат.Найти(Стр.Номенклатура, "Номенклатура") = Неопределено Тогда  
					
					Стр.Размещение = "";
					Стр.СерияНоменклатуры = "";    
					
				Иначе
					// возможно меняем цену на нашу ?
				КонецЕсли; 
				
			КонецЦикла;   
			
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры

Функция НайтиКонтрагентаПоКодуИзПортала(ID) Экспорт
	
	Если Не ЗначениеЗаполнено(ID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИскатьПоКодуМДМ = СтрДлина(ID) = 36;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.IDАварда = &KontragentID
	|	И НЕ Контрагенты.ПометкаУдаления
	|	И (Контрагенты.IDФилиала = NULL
	|			ИЛИ Контрагенты.IDФилиала = """")";
	
	Если ИскатьПоКодуМДМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("KontragentID",ID);
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;		
	
КонецФункции

Функция НайтиДоговорПоКодуИзПортала(ID, СпособДоставки) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДоговорКонтрагента", Неопределено);
	СтруктураВозврата.Вставить("ОплатаНаличными", Ложь);
	
	Если Не ЗначениеЗаполнено(ID) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если СтрДлина(ID) >= 36 Тогда
		
		Если СтрДлина(ID) = 36 Тогда
			КодМДМДоговора = ID;
		Иначе
			КодМДМДоговора = Лев(ID, 36);			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
		|	ДоговорыКонтрагентов.ОплатаПоДоговоруНаличными КАК ОплатаНаличными
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.КодМДМ = &КодМДМ";
		
		Запрос.УстановитьПараметр("КодМДМ", КодМДМДоговора);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыАварды.ДоговорКонтрагента,
		|	ДоговорыАварды.ОплатаНаличными
		|ИЗ
		|	РегистрСведений.ДоговорыАварды КАК ДоговорыАварды
		|ГДЕ
		|	ДоговорыАварды.КодАварда = &КодАварда";
		
		Запрос.УстановитьПараметр("КодАварда",ID);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда    
		
		Если СпособДоставки = Перечисления.СпособДоставки.Самовывоз И Выборка.ДоговорКонтрагента.Организация <> Константы.ОсновнаяОрганизация.Получить() Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Ссылка
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.Владелец = &Владелец
			|	И ДоговорыКонтрагентов.Организация = &Организация
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДоговорыКонтрагентов.РозничнаяПродажа УБЫВ";

			Запрос.УстановитьПараметр("Владелец", Выборка.ДоговорКонтрагента.Владелец);
			Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить()); 			
			
			Если НЕ Константы.СамовывозУправленческий.Получить() Тогда 
				
				Выб = Запрос.Выполнить().Выбрать();      
				
				Если Выб.Следующий() Тогда
					СтруктураВозврата.ДоговорКонтрагента = Выб.Ссылка; 
				КонецЕсли;          
				
			Иначе
				
				Если НЕ Выборка.ДоговорКонтрагента.Владелец.СамовывозУправленческий Тогда    
					
					Выб = Запрос.Выполнить().Выбрать();  
					
					Если Выб.Следующий() Тогда
						СтруктураВозврата.ДоговорКонтрагента = Выб.Ссылка; 
					КонецЕсли; 	
					
				Иначе          
					
					СтруктураВозврата.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
					СтруктураВозврата.ОплатаНаличными = Выборка.ОплатаНаличными;	
					
				КонецЕсли;	
				
			КонецЕсли; 
			
		Иначе         
			
			СтруктураВозврата.ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
			СтруктураВозврата.ОплатаНаличными = Выборка.ОплатаНаличными;   
			
		КонецЕсли;  
		
	КонецЕсли;	 
	
	Возврат СтруктураВозврата; 
	
КонецФункции

Функция НайтиФилиалПоКодуИзПортала(ID) Экспорт
	
	Если Не ЗначениеЗаполнено(ID) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИскатьПоКодуМДМ = СтрДлина(ID) = 36;     
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.IDФилиала = &FilialID
	|	И НЕ Контрагенты.ПометкаУдаления";
	
	Если ИскатьПоКодуМДМ Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDФилиала", ".КодМДМ");
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("FilialID",ID);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;	
	
КонецФункции	

Функция НайтиТоварПоАртикулу(ИнвНомер) Экспорт
	
	Если Не ЗначениеЗаполнено(ИнвНомер) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &ИнвНомер
	|	И НЕ Номенклатура.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИнвНомер",ИнвНомер);
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Количество()= 1 И Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе 
		Возврат Неопределено;	
	КонецЕсли;	
	
КонецФункции

Процедура ДополнитьТаблицу(ТЗ, К, ДН, ДК)  
	
	Если К.ОсновнойДоговорКонтрагента.ОплатаПоДоговоруНаличными Тогда
		Нал = Истина;
	Иначе
		Нал = Ложь;
	КонецЕсли;
	
	ПоКалендарнымДням = Ложь; 
	
	Если Константы.СпособКонтроляДнейЗадолженности.Получить() = Перечисления.СпособыКонтроляДнейЗадолженности.ПоКалендарнымДням Тогда 
		ПоКалендарнымДням = Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты.СуммаВзаиморасчетовКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Контрагент = &Контр) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Контр", К);
	Запрос.УстановитьПараметр("ДатаНач", ДН);
	Запрос.УстановитьПараметр("ДатаКон", ДК);
	
	Табл = Запрос.Выполнить().Выгрузить();
	Сч = 1;
	
	Для каждого строка Из ТЗ Цикл   
		
		Если НЕ ПоКалендарнымДням И строка.ДопустимоеЧислоДнейЗадолженности > 0 Тогда 
			строка.DDATE2 = ЗаполнениеДокументов.ОпределитьДату(строка.DDATE1, строка.ДопустимоеЧислоДнейЗадолженности);
		КонецЕсли;
		
		Для каждого стр1 из Табл Цикл      
			
			Если Строка.Регистратор = Стр1.ДокументРасчетовСКонтрагентом Тогда
				
				Строка.DOLG = Стр1.СуммаВзаиморасчетовКонечныйОстаток;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Строка.I = Сч;
		Сч = Сч + 1;
		
		Если Строка.DOC_TYPE <> "Реализация товаров и услуг" Тогда
			Строка.DDATE2 = Строка.DDATE1;
		КонецЕсли;

		Если ЗначениеЗаполнено(Строка.СчетФактура) Тогда
			Строка.SF = Строка.СчетФактураНомер;
		КонецЕсли;
		
		Если Нал Тогда
			
			Строка.RASHOD_RUB_NAL = Строка.RASHOD_RUB;
			Строка.RASHOD_RUB = 0;
			Строка.PRIHOD_RUB_NAL = Строка.PRIHOD_RUB;
			Строка.PRIHOD_RUB = 0;
			Строка.SALDO_RUB_NAL = Строка.SALDO_RUB;
			Строка.SALDO_RUB = 0;
			Строка.IS_NAL = 1;
			
		КонецЕсли;
		
		Если Строка.RASHOD_RUB_NAL > 0 или Строка.RASHOD_RUB > 0 Тогда
			Строка.IS_DEBIT = 1;
		КонецЕсли;
		
		Если Строка.DOC_TYPE = "Реализация товаров и услуг" Тогда
			Строка.DOC_STATE = "Доставлена";
		ИначеЕсли Строка.DOC_TYPE = "Платежное поручение входящее" Тогда
			Строка.DOC_STATE = "Зачислено";
		ИначеЕсли Строка.DOC_TYPE = "Возврат товаров от покупателя" Тогда
			Строка.DOC_STATE = "Принят";
		КонецЕсли;   
		
	КонецЦикла;  
	
КонецПроцедуры

Функция ПолучитьОстатокПоСтроке(ЗаказКлиента, НомерСтроки)
	
	ЗапросОстатка = Новый Запрос;
	ЗапросОстатка.УстановитьПараметр("ДокЗаказ", ЗаказКлиента);
	ЗапросОстатка.УстановитьПараметр("КлючСтроки", НомерСтроки);
	
	ЗапросОстатка.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.КлючСтроки,
	|	ЗаказПокупателяТовары.Количество,
	|	ЗаказПокупателяТовары.СерияНоменклатуры
	|ПОМЕСТИТЬ ТаблицаИзменение
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ДокЗаказ
	|	И ЗаказПокупателяТовары.КлючСтроки = &КлючСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПокупателейОстатки.ЗаказПокупателя,
	|	ЗаказыПокупателейОстатки.Номенклатура,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК ЗаказаноПокупателем
	|ПОМЕСТИТЬ ТаблицаРезультат
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(
	|			,
	|			(ЗаказПокупателя, Номенклатура) В
	|				(ВЫБРАТЬ
	|					ТаблицаИзменение.ЗаказПокупателя,
	|					ТаблицаИзменение.Номенклатура
	|				ИЗ
	|					ТаблицаИзменение КАК ТаблицаИзменение)) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРезультат.ЗаказПокупателя,
	|	ТаблицаРезультат.Номенклатура,
	|	СУММА(ТаблицаРезультат.ЗаказаноПокупателем) КАК ЗаказаноПокупателем,
	|	ТаблицаИзменение.КлючСтроки,
	|	ТаблицаИзменение.СерияНоменклатуры
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТаблицаИзменение КАК ТаблицаИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаРезультат КАК ТаблицаРезультат
	|		ПО ТаблицаИзменение.ЗаказПокупателя = ТаблицаРезультат.ЗаказПокупателя
	|			И ТаблицаИзменение.Номенклатура = ТаблицаРезультат.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРезультат.Номенклатура,
	|	ТаблицаРезультат.ЗаказПокупателя,
	|	ТаблицаИзменение.Номенклатура,
	|	ТаблицаИзменение.КлючСтроки,
	|	ТаблицаИзменение.СерияНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИтоговаяТаблица.ЗаказПокупателя,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.ЗаказаноПокупателем,
	|	ТаблицаИзменение.КлючСтроки,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.ЗаказаноПокупателем >= ТаблицаИзменение.Количество
	|			ТОГДА ТаблицаИзменение.Количество
	|		ИНАЧЕ ИтоговаяТаблица.ЗаказаноПокупателем
	|	КОНЕЦ КАК Количество,
	|	ИтоговаяТаблица.СерияНоменклатуры
	|ПОМЕСТИТЬ Итог
	|ИЗ
	|	ТаблицаИзменение КАК ТаблицаИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ПО ТаблицаИзменение.ЗаказПокупателя = ИтоговаяТаблица.ЗаказПокупателя
	|			И (ИтоговаяТаблица.Номенклатура = ТаблицаИзменение.Номенклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Итог.Номенклатура,
	|	Итог.ЗаказаноПокупателем,
	|	ВЫБОР
	|		КОГДА Итог.Количество - ЕСТЬNULL(ЗапросыИзмененияКоличестваВЗаказах.Количество, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ Итог.Количество - ЕСТЬNULL(ЗапросыИзмененияКоличестваВЗаказах.Количество, 0)
	|	КОНЕЦ КАК Остаток
	|ИЗ
	|	Итог КАК Итог
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗапросыИзмененияКоличестваВЗаказах КАК ЗапросыИзмененияКоличестваВЗаказах
	|		ПО Итог.ЗаказПокупателя = ЗапросыИзмененияКоличестваВЗаказах.ЗаказПокупателя
	|			И Итог.КлючСтроки = ЗапросыИзмененияКоличестваВЗаказах.КлючСтроки
	|			И (НЕ ЗапросыИзмененияКоличестваВЗаказах.Обработано)
	|ГДЕ
	|	Итог.ЗаказаноПокупателем > 0";
	
	Результат = ЗапросОстатка.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Результат[0].Остаток;
	КонецЕсли;	

КонецФункции

Функция ПолучитьСписокДействийСЗаказом(Заказ, ЕстьСборка, ЕстьЗаказПоставщику,МожноКорректировать = Ложь) Экспорт
	
	ДействияВДесятичномВиде = "";
	ДействияВДесятичномВиде = ?(Заказ.ТолькоРезерв, "1", "0") + "0"+ ?(МожноКорректировать, "1", "0") + "0";
	
	Возврат ДвоичноеВДесятичное(ДействияВДесятичномВиде);
	
КонецФункции

Функция ЕстьСборка(Заказ) Экспорт
	
	ЕстьСборка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(СобраноПоЗаказуОбороты.КоличествоОборот) КАК Количество
	|ИЗ
	|	РегистрНакопления.СобраноПоЗаказу.Обороты(, , , Заказ = &Заказ) КАК СобраноПоЗаказуОбороты";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Количество <> NULL И Выборка.Количество > 0 Тогда
			ЕстьСборка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьСборка;
	
КонецФункции

Функция ЕстьЗаказПоставщику(Заказ) Экспорт
	
	ЕстьЗаказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(РазмещениеЗаказовПокупателейОбороты.КоличествоПриход) КАК Количество
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Обороты(, , , ЗаказПокупателя = &Заказ) КАК РазмещениеЗаказовПокупателейОбороты";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.Количество <> NULL И Выборка.Количество > 0 Тогда
			ЕстьЗаказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЕстьЗаказ;
	
КонецФункции

Функция ЕстьЗакрытие(Заказ) Экспорт
	
	ЕстьОтказ = Ложь;
	ЗапросЗакрытия = Новый Запрос;
	ЗапросЗакрытия.Текст = 
	"ВЫБРАТЬ
	|	ЗакрытиеЗаказовПокупателейЗаказы.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы
	|ГДЕ
	|	ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя = &Заказ
	|	И ЗакрытиеЗаказовПокупателейЗаказы.Ссылка.Проведен";
	
	ЗапросЗакрытия.УстановитьПараметр("Заказ",Заказ);
	РезультатЗакрытия = ЗапросЗакрытия.Выполнить();
	
	Если НЕ РезультатЗакрытия.Пустой() Тогда 		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(, ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0";
		
		Запрос.УстановитьПараметр("Заказ", Заказ);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			ЕстьОтказ = Истина;
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат ЕстьОтказ;	

КонецФункции

//+Гавриленков В. 19.05.2026 #UT10-5868 Добавлен параметр Адрес
Функция СоздатьПодключение(УТ11 = Ложь, ВидОперации = "", Склад = Неопределено, АдресСервиса = "") Экспорт
	
	//+Гавриленков В. 19.05.2026 #UT10-5868
	Если ЗначениеЗаполнено(АдресСервиса) Тогда 
		КонстантаАдрес = АдресСервиса;
	Иначе// Алгоритм без изменений 
		
		Если УТ11 Тогда
			
			Если НЕ Склад = Неопределено Тогда
				
				КонстантаАдрес = СокрЛП(Склад.АдресВебСервиса);
				ВСПользователь = "";
				ВСПароль = "";  			
				
			Иначе
				
				Если ВидОперации = "СторонниеСкладыВыбор" Тогда 
					КонстантаАдрес = Константы.АдресВебСервисаУТ11.Получить();
				ИначеЕсли ВидОперации = "СторонниеСкладыПарал" Тогда  
					КонстантаАдрес = Константы.АдресWebServiceСторСклады.Получить();
				Иначе 
					КонстантаАдрес = Константы.АдресВебСервисаУТ11.Получить();		
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ВидОперации = "Экспрессы" Или ВидОперации = "ГорючиеЖидкости" Тогда
			КонстантаАдрес = Константы.АдресВебСервисаУТ10.Получить();
		Иначе
			
			Если НЕ Склад = Неопределено Тогда
				КонстантаАдрес = СокрЛП(Склад.АдресВебСервиса);
			Иначе
				КонстантаАдрес = Константы.АдресВебСервиса.Получить();
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЕсли;
	
	АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/GoodsReserve.1cws?wsdl";
	ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "GoodsReserve", "GoodsReserveSoap");
	
	Возврат  ВСПрокси;	
	
КонецФункции

Функция ЗарезервироватьТоварыВСтороннейБазе(ТЗНоменклатуры, УТ11 = Ложь, ВидОперации = "", Склад = Неопределено) Экспорт
	
	Результат = Новый Структура("Загружен",Ложь);
	СтруктураДанных = Новый Структура;
	КодСоглашения = "";

	Если УТ11 Тогда 
		
		КодКонтрагента = Константы.КодКонтрагента.Получить();
		КодСоглашения = Константы.КодСоглашения.Получить(); 
		СтрУТ = "УТ11";		
		
	ИначеЕсли ВидОперации = "Экспрессы" Тогда
		
		КодКонтрагента = Константы.КодКонтрагентаЭкспрессУТ10Восток.Получить(); 
		СтрУТ = "УТ10";
		
	ИначеЕсли ВидОперации = "ГорючиеЖидкости" Тогда
		
		КодКонтрагента = Константы.КодКонтрагентаКроссДокинг.Получить(); 
		СтрУТ = "УТ10";     
		КодСоглашения = Константы.КодДоговораКроссДокингМасла.Получить(); 
		
	ИначеЕсли ВидОперации = "ПополнениеОП" Тогда
		
		Если НЕ Склад = Неопределено Тогда
			
			КодКонтрагента = Склад.КодКонтрагента;
			КодСоглашения  = Склад.КодДоговора;
			
		Иначе  			
			
			КодКонтрагента = Константы.КодКонтрагентаВстороннейУТ10Пополнение.Получить();			
			КодСоглашения  = Константы.КодМДМвСтороннейУТ10.Получить(); 
			
		КонецЕсли;
		
		СтрУТ = "УТ10";
		
	Иначе

		Если Константы.ОтправлятьЗаказыВСтророннююУТ.Получить() Тогда			
			КодСоглашения = СокрЛП(Константы.КодМДМвСтороннейУТ10.Получить());
		КонецЕсли;

		КодКонтрагента = Константы.КодКонтрагентаВстороннейУТ10.Получить();
		СтрУТ = "УТ10";	
		
	КонецЕсли;
	
	Попытка		
		
		//+Гавриленков В. 19.05.2026 #UT10-5868
		Если (Склад = Неопределено) ИЛИ ((ТипЗнч(Склад) = Тип("СправочникСсылка.СобственныеСклады")) И (Не ЗначениеЗаполнено(Склад.ВебСервис))) Тогда 
			// Алгоритм без изменений
			
			ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад);
			СтруктураДанных.Вставить("ТЗНоменклатуры", ТаблицуВМассив(ТЗНоменклатуры));
			СтруктураДанных.Вставить("КодМДМдоговора", КодСоглашения);
			
			Если Константы.ИспользоватьКонтрольВыгрузкиВУТ11ПоНоменклатуре.Получить() Тогда 
				СтруктураДанных.Вставить("ВидОперации", ВидОперации);
			КонецЕсли;                                                
			
			СтруктураДанных.Вставить("КодСоглашения", Константы.КодСоглашения.Получить());
			
			Если НЕ Склад = Неопределено И Склад.ВэбСервисУТ11 Тогда
				
				СтруктураДанных.Вставить("УИДмск", ТЗНоменклатуры[0].ГУИДЗаказаУТ10); 
				ТЗНоменклатуры.Колонки.Удалить("ГУИДЗаказаУТ10");
				
			КонецЕсли;
			
			Данные = ДанныеВJSONХранилище(СтруктураДанных);
			ЗаписьЖурналаРегистрации("Отправка заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.отправка_заказа");
			
			Если УТ11 Тогда
				Ответ = ВСПрокси.ЗарезервироватьТовары(Данные, КодКонтрагента, КодСоглашения);
			Иначе
				Ответ = ВСПрокси.ЗарезервироватьТовары(Данные, КодКонтрагента);
			КонецЕсли;
			
		Иначе   
			
			ТаблицаАдресов = ПолучитьАдресаСервиса(Склад.ВебСервис);
			
			Если ТаблицаАдресов.Количество() = 0 Тогда
				ЗаписьЖурналаРегистрации("Отправка заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Ошибка,,, "Не установлены веб-сервисы для склада " + Строка(Склад));
			Иначе
				
				ОтветПолучен = Ложь;
				
				Для Каждого СтрокаАдрес Из ТаблицаАдресов Цикл
					
					Если ОтветПолучен Тогда
						Прервать;
					КонецЕсли;  
					
					//+Гавриленков В. 27.05.2026 #UT10-5880 Создание подключение в попытке
					Попытка
						ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад, СтрокаАдрес.АдресСервиса);
					Исключение 
						
						ЗаписьЖурналаРегистрации("Получение статусов из сторонней базы", УровеньЖурналаРегистрации.Ошибка,,, "Не установлено соединение с веб-сервисом по адресу " + СтрокаАдрес.АдресСервиса + ", склад " + Строка(Склад));	
						Продолжить;
						
					КонецПопытки;
					
					СтруктураДанных.Вставить("ТЗНоменклатуры", ТаблицуВМассив(ТЗНоменклатуры));
					СтруктураДанных.Вставить("КодМДМдоговора", КодСоглашения);
					
					Если Константы.ИспользоватьКонтрольВыгрузкиВУТ11ПоНоменклатуре.Получить() Тогда 
						СтруктураДанных.Вставить("ВидОперации", ВидОперации);
					КонецЕсли;                                                
					
					СтруктураДанных.Вставить("КодСоглашения", Константы.КодСоглашения.Получить());
					
					Если НЕ Склад = Неопределено И Склад.ВэбСервисУТ11 Тогда
						
						СтруктураДанных.Вставить("УИДмск", ТЗНоменклатуры[0].ГУИДЗаказаУТ10); 
						ТЗНоменклатуры.Колонки.Удалить("ГУИДЗаказаУТ10");
						
					КонецЕсли;
					
					Данные = ДанныеВJSONХранилище(СтруктураДанных);
					ЗаписьЖурналаРегистрации("Отправка заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.отправка_заказа");
					
					Попытка 
						
						Если УТ11 Тогда  
							
							Ответ = ВСПрокси.ЗарезервироватьТовары(Данные, КодКонтрагента, КодСоглашения);
							ОтветПолучен = Истина;
							
						Иначе 
							
							Ответ = ВСПрокси.ЗарезервироватьТовары(Данные, КодКонтрагента);
							ОтветПолучен = Истина; 
							
						КонецЕсли; 
						
					Исключение  
						
						ОтветПолучен = Ложь;
						ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Ошибка,,, "Веб-сервис " + СтрокаАдрес.АдресСервиса + " недоступен. " + ОписаниеОшибки());
						
					КонецПопытки;
					
				КонецЦикла; 
				
				Если ОтветПолучен Тогда
					
					ЗаписьЖурналаРегистрации("Получен ответ после отправки заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.получение_заказа");
					Результат = ОбработкаОтвета(Ответ, Результат);	
					Возврат Результат;
					
				Иначе           
					
					ЗаписьЖурналаРегистрации("Отправка заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Ошибка,,, "Не получен ответ ни по одному веб-сервису для склада " + Строка(Склад));
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки заказа в стороннюю " + СтрУТ, УровеньЖурналаРегистрации.Ошибка,,, 
		"GoodsReserve.получение_заказа " + ОписаниеОшибки());
		
		Сообщить(ОписаниеОшибки());
		
		РаботаСАвардой.СоздатьОповещениеОбОшибкеОтправкиВАварду("Ошибка получения ответа после отправки заказа в стороннюю " + СтрУТ,
		"" + СокрЛП(Константы.База.Получить()) + ". GoodsReserve.получение_заказа " + ОписаниеОшибки());

		Возврат Результат;
		
	КонецПопытки;
	
	Результат = ОбработкаОтвета(Ответ, Результат);	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьРеализацииВСтороннейБазе(УТ11 = Ложь , ВидОперации = "" , Склад = Неопределено) Экспорт 
	
	Результат = Новый Структура("Загружен",Ложь); 
	КодМДМКонтрагента = "";
	
	Если УТ11 Тогда 
		
		КодКонтрагента = Константы.КодКонтрагента.Получить();
		КодСоглашения  = Константы.КодСоглашения.Получить();
		КроссДокинг    = ?(ВидОперации = "ГорючиеЖидкости", Истина, Ложь);
		мКодФилиала    = СокрЛП(Константы.КодФилиала.Получить());
		КодФилиала     = ?(мКодФилиала = "", Неопределено,мКодФилиала);

	ИначеЕсли ВидОперации = "Экспрессы" Тогда
		КодКонтрагента = Константы.КодКонтрагентаЭкспрессУТ10Восток.Получить();
	ИначеЕсли ВидОперации = "ГорючиеЖидкости" Тогда
		КодКонтрагента = Константы.КодКонтрагентаКроссДокинг.Получить();
	Иначе
		
		Если Склад = Неопределено Тогда
			КодМДМдоговора = Константы.КодМДМвСтороннейУТ10.Получить();
		Иначе
			
			КодМДМдоговора = Склад.КодДоговора;
			КодМДМКонтрагента = Склад.КодКонтрагента;		
			
		КонецЕсли;

	КонецЕсли;
	
	Попытка	
		
		//+Гавриленков В. 19.05.2026 #UT10-5868
		Если (Склад = Неопределено) ИЛИ ((ТипЗнч(Склад) = Тип("СправочникСсылка.СобственныеСклады")) И (Не ЗначениеЗаполнено(Склад.ВебСервис))) Тогда 
			// Алгоритм без изменений
			
			ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад);
			
			Если УТ11 Тогда
				
				Если НЕ Склад = Неопределено ИЛИ КодФилиала = Неопределено Тогда
					Ответ = ВСПрокси.ПолучитьРеализации(КодКонтрагента, КодСоглашения, КроссДокинг);
				Иначе
					Ответ = ВСПрокси.ПолучитьРеализацииПоФилиалу(КодКонтрагента, КодСоглашения, КроссДокинг,КодФилиала);	
				КонецЕсли;
				
			Иначе			
				Ответ = ВСПрокси.ПолучитьРеализацииVer2(КодМДМдоговора, КодМДМКонтрагента);
			КонецЕсли; 
			
		Иначе     
			
			ТаблицаАдресов = ПолучитьАдресаСервиса(Склад.ВебСервис);
			
			Если ТаблицаАдресов.Количество() = 0 Тогда
				ЗаписьЖурналаРегистрации("Получение реализаций сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Не установлены веб-сервисы для склада " + Строка(Склад));
			Иначе
				
				ОтветПолучен = Ложь;
				
				Для Каждого СтрокаАдрес Из ТаблицаАдресов Цикл
					
					Если ОтветПолучен Тогда
						Прервать;
					КонецЕсли;   
					
					//+Гавриленков В. 27.05.2026 #UT10-5880 Создание подключение в попытке
					Попытка
						ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад, СтрокаАдрес.АдресСервиса);
					Исключение 
						
						ЗаписьЖурналаРегистрации("Получение статусов из сторонней базы", УровеньЖурналаРегистрации.Ошибка,,, "Не установлено соединение с веб-сервисом по адресу " + СтрокаАдрес.АдресСервиса + ", склад " + Строка(Склад));	
						Продолжить;
						
					КонецПопытки;
					
					
					Если УТ11 Тогда
						
						Попытка
							
							Если КодФилиала = Неопределено Тогда
								
								Ответ = ВСПрокси.ПолучитьРеализации(КодКонтрагента, КодСоглашения, КроссДокинг); 
								ОтветПолучен = Истина;
								
							Иначе   
								
								Ответ = ВСПрокси.ПолучитьРеализацииПоФилиалу(КодКонтрагента, КодСоглашения, КроссДокинг,КодФилиала);
								ОтветПолучен = Истина;
								
							КонецЕсли;  
							
						Исключение
							ОтветПолучен = Ложь;
						КонецПопытки;
						
					Иначе		
						
						Попытка  
							
							Ответ = ВСПрокси.ПолучитьРеализацииVer2(КодМДМдоговора, КодМДМКонтрагента);
							ОтветПолучен = Истина;
							
						Исключение
							ОтветПолучен = Ложь;
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ОтветПолучен Тогда
					
					Результат = ОбработкаОтвета(Ответ, Результат);	
					Возврат Результат; 
					
				Иначе
					
					ЗаписьЖурналаРегистрации("Получение реализаций сторонней базе", УровеньЖурналаРегистрации.Ошибка,,, "Не получен ответ ни по одному веб-сервису для склада " + Строка(Склад));
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;

	Исключение
		
		Сообщить(ОписаниеОшибки());		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат = ОбработкаОтвета(Ответ, Результат);	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтатусыИзСтороннейБазы(ДатаНТ, ДатаКТ, УТ11 = Ложь, ВидОперации = "", Склад = Неопределено) Экспорт 
	
	Результат = Новый Структура("Загружен", Ложь);
	
	Если УТ11 Тогда 
		
		КодКонтрагента = Константы.КодКонтрагента.Получить();
		КодСоглашения = Константы.КодСоглашения.Получить(); 
		
	ИначеЕсли ВидОперации = "Экспрессы" Тогда
		КодКонтрагента = Константы.КодКонтрагентаЭкспрессУТ10Восток.Получить();
	ИначеЕсли ВидОперации = "ГорючиеЖидкости" Тогда
		КодКонтрагента = Константы.КодКонтрагентаКроссДокинг.Получить(); 
	Иначе

		Если Склад = Неопределено Тогда
			
			КодКонтрагента = Константы.КодКонтрагентаВстороннейУТ10.Получить();
			КодКонтрагентаПополнение = Константы.КодКонтрагентаВстороннейУТ10Пополнение.Получить();

		Иначе
			КодКонтрагента = Склад.КодКонтрагента;
		КонецЕсли;

	КонецЕсли;
	
	Попытка		
		
		//+Гавриленков В. 19.05.2026 #UT10-5868
		Если (Склад = Неопределено) ИЛИ ((ТипЗнч(Склад) = Тип("СправочникСсылка.СобственныеСклады")) И (Не ЗначениеЗаполнено(Склад.ВебСервис))) Тогда 
			// Алгоритм без изменений
			
			ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад);
			
			Если УТ11 Тогда
				
				Если ВидОперации = "СторонниеСклады" Тогда
					Ответ = ВСПрокси.ПолучитьСтатусыЗаказовСторСкладов(ДатаНТ, ДатаКТ, КодКонтрагента, КодСоглашения);	
				Иначе
					Ответ = ВСПрокси.ПолучитьСтатусыЗаказов(ДатаНТ, ДатаКТ, КодКонтрагента, КодСоглашения);
				КонецЕсли;
				
			Иначе
				
				Ответ = ВСПрокси.ПолучитьСтатусыЗаказов(ДатаНТ, ДатаКТ, КодКонтрагента, ВидОперации);
				
				Если Склад = Неопределено И ВидОперации = "ПополнениеОП" Тогда
					Ответ = ВСПрокси.ПолучитьСтатусыЗаказов(ДатаНТ, ДатаКТ, КодКонтрагентаПополнение, ВидОперации);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ТаблицаАдресов = ПолучитьАдресаСервиса(Склад.ВебСервис);
			
			Если ТаблицаАдресов.Количество() = 0 Тогда
				ЗаписьЖурналаРегистрации("Получение статусов из сторонней базы", УровеньЖурналаРегистрации.Ошибка,,, "Не установлены веб-сервисы для склада " + Строка(Склад));
			Иначе
				
				ОтветПолучен = Ложь;
				
				Для Каждого СтрокаАдрес Из ТаблицаАдресов Цикл
					
					Если ОтветПолучен Тогда
						Прервать;
					КонецЕсли;
					
					//+Гавриленков В. 27.05.2026 #UT10-5880 Создание подключение в попытке
					Попытка
						ВСПрокси = СоздатьПодключение(УТ11, ВидОперации, Склад, СтрокаАдрес.АдресСервиса); 
					Исключение 
						
						ЗаписьЖурналаРегистрации("Получение статусов из сторонней базы", УровеньЖурналаРегистрации.Ошибка,,, "Не установлено соединение с веб-сервисом по адресу " + СтрокаАдрес.АдресСервиса + ", склад " + Строка(Склад));	
						Продолжить;
						
					КонецПопытки;
						
					Если УТ11 Тогда
						
						Попытка    
							
							Если ВидОперации = "СторонниеСклады" Тогда 
								
								Ответ = ВСПрокси.ПолучитьСтатусыЗаказовСторСкладов(ДатаНТ, ДатаКТ, КодКонтрагента, КодСоглашения);
								ОтветПолучен = Истина;
								
							Иначе   
								
								Ответ = ВСПрокси.ПолучитьСтатусыЗаказов(ДатаНТ, ДатаКТ, КодКонтрагента, КодСоглашения);
								ОтветПолучен = Истина;
								
							КонецЕсли; 
							
						Исключение 
							ОтветПолучен = Ложь;
						КонецПопытки;
						
					Иначе
						
						Попытка 
							
							Ответ = ВСПрокси.ПолучитьСтатусыЗаказов(ДатаНТ, ДатаКТ, КодКонтрагента, ВидОперации);
							ОтветПолучен = Истина;
							
						Исключение
							ОтветПолучен = Ложь;
						КонецПопытки;
						
					КонецЕсли; 
					
				КонецЦикла;
				
				Если ОтветПолучен Тогда
					
					Результат = ОбработкаОтвета(Ответ, Результат);	
					Возврат Результат;
					
				Иначе
					
					ЗаписьЖурналаРегистрации("Получение статусов из сторонней базы", УровеньЖурналаРегистрации.Ошибка,,, "Не получен ответ ни от одного веб-сервиса для склада " + Строка(Склад));
					Возврат Результат;
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	Исключение
		
		Сообщить(ОписаниеОшибки());		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат = ОбработкаОтвета(Ответ, Результат);	
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьЭтапыЭкспертизы(ТаблицаСсылок) Экспорт 

	Результат = Новый Структура("Загружен", Ложь);
	СтруктураДанных = Новый Структура;

	Попытка		
		
		ВСПрокси = СоздатьПодключение(Истина , "" , Неопределено);
		СтруктураДанных.Вставить("ТЗЗаявокНаВозврат", ТаблицуВМассив(ТаблицаСсылок));
		Данные = ДанныеВJSONХранилище(СтруктураДанных);

		Ответ = ВСПрокси.ПолучитьЭтапыЭкспертизы(Данные);

	Исключение
		
		Сообщить(ОписаниеОшибки());		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат = ОбработкаОтвета(Ответ, Результат);	
	
	Возврат Результат;

КонецФункции

Функция ПолучитьДанныеДляСлужебныхЗаписокВходящих(ТаблицаСсылок) Экспорт

	Результат = Новый Структура("Загружен", Ложь);
	СтруктураДанных = Новый Структура;

	Попытка		
		
		ВСПрокси = СоздатьПодключение(Истина, "", Неопределено);
		СтруктураДанных.Вставить("ТЗЗаявокНаВозврат", ТаблицуВМассив(ТаблицаСсылок));
		Данные = ДанныеВJSONХранилище(СтруктураДанных);

		Ответ = ВСПрокси.ПолучитьДанныеДляСлужебныхЗаписокВходящих(Данные);

	Исключение
		
		Сообщить(ОписаниеОшибки());		
		Возврат Результат;
		
	КонецПопытки;
	
	Результат = ОбработкаОтвета(Ответ, Результат);	
	
	Возврат Результат;

КонецФункции

Процедура ЗаполнитьУИДвСтрокахЗаказа(ТЗНоменклатуры, ГУИДЗаказаПокупателя) Экспорт
	
	СтруктураДанных = Новый Структура;
	
	Попытка		
		
		ВСПрокси = СоздатьПодключение();
		СтруктураДанных.Вставить("ТЗНоменклатуры", ТаблицуВМассив(ТЗНоменклатуры));
		Данные = ДанныеВJSONХранилище(СтруктураДанных);
		Ответ = ВСПрокси.ЗаполнитьУИДвСтрокахЗаказа(Данные, ГУИДЗаказаПокупателя);				
		
	Исключение
		Сообщить(ОписаниеОшибки());		
	КонецПопытки;
	
КонецПроцедуры

Функция ОбработкаОтвета(Ответ, Результат) Экспорт
	
	Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда		
		
		Данные = ХранилищеJSONВСтруктуру(Ответ);		
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда			
			
			Результат.Вставить("СписокДанных",Данные.СписокДанных);
			
			Если Результат.СписокДанных.Количество() > 0 Тогда
				Результат.Загружен = Истина;
			Иначе
				Результат.Загружен = Ложь;
			КонецЕсли;			 
			
			//+Шульман А. 21.02.2025 #UT10-5103  
			Если Данные.Свойство("ДанныеРезультат") Тогда       
				Результат.Вставить("ДанныеРезультат", Данные.ДанныеРезультат);
			КонецЕсли;
			//-Шульман А. 21.02.2025 #UT10-5103
			
			//+Макрушин Е. 24.09.2025 #UT10-5430 
			Если Данные.Свойство("ДополнительныеДанные") Тогда       
				Результат.Вставить("ДополнительныеДанные", Данные.ДополнительныеДанные);
			КонецЕсли;
			//-Макрушин Е. 24.09.2025 #UT10-5430
			
		КонецЕсли;		
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьНоменклатуруВМДМ(ТЗНоменклатуры) Экспорт
	
	КонстантаАдрес = Константы.АдресВебСервисаМДМ.Получить();
	
	АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/NomenclatureCreation.1cws?wsdl";
	//http:// 1c-ut.moskvorechie.ru/mdmdemo3/ws/NomenclatureCreation.1cws?wsdl
	
	ВСОпределение = Новый WSОпределения(АдресВебСервиса,,,,10);
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "NomenclatureCreation", "NomenclatureCreationSoap");
	//ВСПрокси.Пользователь = "Администратор";
	//ВСПрокси.Пароль = "20kbanthif18";
	
	СтруктураДанных = Новый Структура;
	Ответ = Ложь;
	
	Попытка		
		
		СтруктураДанных.Вставить("ТЗНоменклатуры", ТаблицуВМассив(ТЗНоменклатуры));
		Данные = ДанныеВJSONХранилище(СтруктураДанных);
		ЗаписьЖурналаРегистрации("Отправка списка номенклатуры в МДМ", УровеньЖурналаРегистрации.Информация,,, "NomenclatureCreation.отправка_номенклатуры");
		
		Ответ = ВСПрокси.ЗаписатьНоменклатуруВРегистр(Данные);
		ЗаписьЖурналаРегистрации("Получен ответ после отправки номенклатуры в МДМ", УровеньЖурналаРегистрации.Информация,,, 
		"NomenclatureCreation.отправка_номенклатуры.получение_ответа");		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки номенклатуры в МДМ", УровеньЖурналаРегистрации.Ошибка,,, 
		"GoodsReserve.отправка_номенклатуры.получение_ответа " + ОписаниеОшибки());
		Сообщить(ОписаниеОшибки());		
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДанныеПоСкидкамНаБренды(Договор) Экспорт
//+Белов А. 09.12.2025 #UT10-5562

	КонстантаАдрес = Константы.АдресВебСервисаМДМ.Получить();
	
	АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/NomenclatureCreation.1cws?wsdl";
	
	ВСОпределение = Новый WSОпределения(АдресВебСервиса,,,,10);
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "NomenclatureCreation", "NomenclatureCreationSoap");
		
	Ответ = ВСПрокси.ПолучитьДанныеПоСкидкамНаБренды(Договор);
	
	Возврат ОбщегоНазначения.ВернутьСтруктуруИзJSON(Ответ);
	
//-Белов А. 09.12.2025 #UT10-5562	
КонецФункции

Функция СинхронизироватьКодАвардыСМДМ(ТЗНоменклатуры) Экспорт
	
	КонстантаАдрес = Константы.АдресВебСервисаМДМ.Получить();
	
	АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/NomenclatureCreation.1cws?wsdl";
	//http:// 1c-ut.moskvorechie.ru/mdmdemo3/ws/NomenclatureCreation.1cws?wsdl
	
	ВСОпределение = Новый WSОпределения(АдресВебСервиса,,,,10);
	ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "NomenclatureCreation", "NomenclatureCreationSoap");
	//ВСПрокси.Пользователь = "Администратор";
	//ВСПрокси.Пароль = "20kbanthif18";
	
	СтруктураДанных = Новый Структура;
	Ответ = Ложь;
	
	Попытка		
		
		СтруктураДанных.Вставить("ТЗНоменклатуры", ТаблицуВМассив(ТЗНоменклатуры));
		Данные = ДанныеВJSONХранилище(СтруктураДанных);
		ЗаписьЖурналаРегистрации("Отправка кода Аварды в МДМ", УровеньЖурналаРегистрации.Информация,,, "NomenclatureCreation.синхронизация_КодаАварды");
		
		Ответ = ВСПрокси.СинхронизацияРеквизитовНоменклатуры(Данные);
		ЗаписьЖурналаРегистрации("Получен ответ после отправки кода Аварды в МДМ", УровеньЖурналаРегистрации.Информация,,, 
		"NomenclatureCreation.синхронизация_КодаАварды.получение_ответа");		
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки кода Аварды в МДМ", УровеньЖурналаРегистрации.Ошибка,,, 
		"GoodsReserve.синхронизация_КодаАварды.получение_ответа " + ОписаниеОшибки());
		Сообщить(ОписаниеОшибки());		
		
	КонецПопытки;
	
	Возврат Ответ;
	
КонецФункции

Функция ИзменитьСтатусПТУВУТ11(ГУИДДокумента, НовыйСтатус, ДатаПриходаТовараНаСклад = Неопределено, КоличествоПринятыхМест = 0) Экспорт 
	
	Ответ = Новый Структура("Результат",Ложь);
	
	Попытка
		
		КонстантаАдрес = Константы.АдресВебСервисаУТ11.Получить();		
		АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/UT11_SetStatusPTU.1cws?wsdl";
		//ВСОпределение = Новый WSОпределения(АдресВебСервиса, "webadmin", "web",,30); 
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,,30);
		ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "UT11_SetStatusPTU", "UT11_SetStatusPTUSoap");
		//ВСПрокси.Пользователь = "webadmin"; 
		//ВСПрокси.Пароль = "web";
		
	Исключение
		
		Ответ.Вставить("ТекстОшибки", "Не удалось подключиться к УТ11 !" + ОписаниеОшибки());
		Возврат Ответ;
		
	КонецПопытки;
	
	Попытка
		
		ИндексСтатуса = Перечисления.СтатусыПТУ.Индекс(НовыйСтатус);
		НовыйСтатусТекст = Метаданные.Перечисления.СтатусыПТУ.ЗначенияПеречисления[ИндексСтатуса].Имя; 
		ОтветУТ11 = ВСПрокси.ИзменитьСтатусПТУПоПеремещению(ГУИДДокумента, НовыйСтатусТекст, ДатаПриходаТовараНаСклад, КоличествоПринятыхМест); 

		Если ТипЗнч(ОтветУТ11) = Тип("ХранилищеЗначения") Тогда		
			Ответ = ХранилищеJSONВСтруктуру(ОтветУТ11);			
		КонецЕсли;		
		
	Исключение
		
		Ответ.Результат = Ложь;
		Ответ.Вставить("ТекстОшибки",ОписаниеОшибки()); 		
		
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция ОбработатьСкладскойЗаказВУТ11(ДокЗаказ) Экспорт
	
	Результат = Новый Структура("Обработан",Ложь);
	СтруктураДанных = Новый Структура;	
	КодКонтрагента = Константы.КодКонтрагента.Получить();
	КодСоглашения = Константы.КодСоглашения.Получить();
	
	Попытка		
		
		ВСПрокси = СоздатьПодключение(Истина, "ОбработкаСкладскихЗаказов");		
		
		СтруктураДанных.Вставить("ГУИДЗаказаПокупателя", СокрЛП(ДокЗаказ.ГУИДЗаказаПокупателя));
		СтруктураДанных.Вставить("СкладскойЗаказ"      , ДокЗаказ.СкладскойЗаказ);
		СтруктураДанных.Вставить("ПометкаУдаления"     , ДокЗаказ.ПометкаУдаления);
		Данные = ДанныеВJSONХранилище(СтруктураДанных);
		
		ЗаписьЖурналаРегистрации("Отправка заказа в стороннюю УТ11", УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.Обработка_складских_заказов");
		
		Ответ = ВСПрокси.ОбработкаСкладскихЗаказов(Данные, КодКонтрагента, КодСоглашения);	
		ЗаписьЖурналаРегистрации("Получен ответ после отправки заказа в стороннюю УТ11", УровеньЖурналаРегистрации.Информация,,, "GoodsReserve.Обработка_складских_заказов");
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Ошибка получения ответа после отправки заказа в стороннюю УТ11", УровеньЖурналаРегистрации.Ошибка,,, 
		"GoodsReserve.Обработка_складских_заказов " + ОписаниеОшибки());
		
		Сообщить(ОписаниеОшибки());
		РаботаСАвардой.СоздатьОповещениеОбОшибкеОтправкиВАварду("Ошибка получения ответа после отправки заказа в стороннюю УТ11",
		"GoodsReserve.Обработка_складских_заказов " + ОписаниеОшибки());
		Возврат Результат;
		
	КонецПопытки;
	
	Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда		
		
		Данные = ХранилищеJSONВСтруктуру(Ответ);		
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда			
			
			Результат.Вставить("Описание", Данные.СписокДанных.ОписаниеОтвета);
			Результат.Обработан = Данные.СписокДанных.Результат;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ДобавитьНеСозданныеЗаказыПокупателей(РезультатДляВозвратаПорталу, пДатаНачалаОтчета, пДатаКонцаОтчета, ИДАвардаКонтрагента, ТипСтрокаОтвета)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СУММА(НеСозданныеЗаказыПокупателейТовары.Price * НеСозданныеЗаказыПокупателейТовары.Count) КАК SUMMA,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Ссылка,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата КАК DATE_TIMESTAMP,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Наименование КАК FILIAL_NAME,
	|	ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment КАК СТРОКА(100)) КАК DNOTE,
	|	""RUB"" КАК VALUTA_NAME,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.FirmID КАК OUR_FIRM
	|ИЗ
	|	Справочник.НеСозданныеЗаказыПокупателей.Товары КАК НеСозданныеЗаказыПокупателейТовары
	|ГДЕ
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.KontragentID = &KontragentID
	|	И НеСозданныеЗаказыПокупателейТовары.Ссылка.ЗаказПокупателяСсылка = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.FirmID,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Ссылка,
	|	НеСозданныеЗаказыПокупателейТовары.Ссылка.Дата,
	|	ВЫРАЗИТЬ(НеСозданныеЗаказыПокупателейТовары.Ссылка.Comment КАК СТРОКА(100)),
	|	ПРЕДСТАВЛЕНИЕ(НеСозданныеЗаказыПокупателейТовары.Ссылка.ФилиалКонтрагента)
	|
	|УПОРЯДОЧИТЬ ПО
	|	DATE_TIMESTAMP");
	
	Запрос.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400 * 14)));
	Запрос.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("KontragentID", ИДАвардаКонтрагента);
	
	РезЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрРез Из РезЗапроса Цикл
		
		СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);		
		
		СтрокаВозврата.DATE_TIMESTAMP = СтрРез.DATE_TIMESTAMP;		
		СтрокаВозврата.FILIAL_NAME = СтрРез.FILIAL_NAME;
		СтрокаВозврата.DNOTE = СтрРез.DNOTE;
		СтрокаВозврата.VALUTA_NAME = СтрРез.VALUTA_NAME;
		СтрокаВозврата.DOGOVOR_NAME = "";
		СтрокаВозврата.SKLAD_NAME = "";
		СтрокаВозврата.OUR_FIRM = СтрРез.OUR_FIRM;		
		
		СтрокаВозврата.DID = СокрЛП(СтрРез.Ссылка.УникальныйИдентификатор());
		СтрокаВозврата.DDATE1 = Формат(СтрРез.DATE_TIMESTAMP, "ДФ='dd.MM.yyyy HH:mm'");
		СтрокаВозврата.DCODE = "Заказ от " + СтрокаВозврата.DDATE1;
		СтрокаВозврата.STATUS = "10; принят в работу";
		СтрокаВозврата.REZERV_SUM = СтрРез.SUMMA;
		
		СтрокаВозврата.FLAG_1 = "0000";
		
		РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
		
	КонецЦикла;		
	
КонецПроцедуры

Функция ПроверитьКратностьИСоздатьКорректировкуЗаказаПокупателя(НовыйДокЗаказ, Комментарий = "", ПараметрРежимПроведенияДокумента = Неопределено) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Документ", "");
	СтруктураВозврата.Вставить("Ошибка", "");
	
	ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ДокументКорректировки.Заполнить(НовыйДокЗаказ.Ссылка);
	ДокументКорректировки.Дата = ТекущаяДата();
	ДокументКорректировки.Комментарий = Комментарий;
	ДокументКорректировки.ВалютаДокумента = НовыйДокЗаказ.ВалютаДокумента; 
	
	ДокументКорректировки.Товары.Очистить();
	ДокументКорректировки.Услуги.Очистить();                               
	ДокументКорректировки.ВозвратнаяТара.Очистить();
	
	Для Каждого СтрТовары Из НовыйДокЗаказ.Товары Цикл 

		РезультатДеления = СтрТовары.Количество / ?(СтрТовары.Номенклатура.Кратность = 0, 1, СтрТовары.Номенклатура.Кратность);
		ЦелаяЧасть = Цел(РезультатДеления);   
		
		Если НЕ РезультатДеления = ЦелаяЧасть Тогда

			НоваяСтрока = ДокументКорректировки.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТовары);	
			НоваяСтрока.Количество = -НоваяСтрока.Количество;
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОшибкаКратности;
			
			мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
			
		КонецЕсли;   
		
	КонецЦикла;
	
	ДокументКорректировки.СуммаДокумента = ДокументКорректировки.Товары.Итог("Сумма");
	
	Если ДокументКорректировки.Товары.Количество() > 0 Тогда  
		
		Попытка
			
			Если ПараметрРежимПроведенияДокумента = Неопределено Тогда
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);		
			Иначе
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, ПараметрРежимПроведенияДокумента);		
			КонецЕсли; 		
			
			СтруктураВозврата.Документ = ДокументКорректировки;			
			
		Исключение
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			СтруктураВозврата.Ошибка = ОписаниеОшибки();
			Возврат СтруктураВозврата;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ОтправитьПТУВУТ11(Док) Экспорт
	
	Результат = Новый Структура("Загружен, ОписаниеОшибки, Текст, ИДДокументаВСмежнойБазе, НомерДокументаУТ11, ДатаДокументаУТ11", Ложь, "", "", "", "", Дата(1,1,1));
	СтруктураДанных = Новый Структура;

	//Проверка, был ли ранее отправлен документ в УТ11
	Если (ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
		и ЗначениеЗаполнено(МСКWEB.ЗначениеДопСвойства(Док.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.IDИнвойса)))
		или (ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровНаОтветственноеХранение") и ЗначениеЗаполнено(Док.Ссылка.ИдДокументаВСмежнойБазе)) Тогда
		
		Возврат Результат;
		
	КонецЕсли;

	Попытка
		
		СтруктураДанных.Вставить("ВидОперации", "Транзит4");
		СтруктураДанных.Вставить("КодКонтрагента", Док.Контрагент.КодМДМ);
		СтруктураДанных.Вставить("ДатаПоДаннымПоставщика", Док.ДатаВходящегоДокумента);
		СтруктураДанных.Вставить("НомерПоДаннымПоставщика", Док.НомерВходящегоДокумента);
		СтруктураДанных.Вставить("ДатаПоступления", Док.ДатаПриходаТовараНаСклад);
		СтруктураДанных.Вставить("Валюта", Док.ВалютаДокумента.Код);

		Если ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровНаОтветственноеХранение") И ЗначениеЗаполнено(Док.ГрузополучательТОХ) Тогда
			СтруктураДанных.Вставить("КодФилиала", Док.ГрузополучательТОХ.КодМДМГрузополучателяУТ11);
		Иначе			
			СтруктураДанных.Вставить("КодФилиала", Константы.КодФилиала.Получить());
		КонецЕсли;

		СтруктураДанных.Вставить("КодКонтрагентаКонечногоПокупателя", Константы.КодКонтрагента.Получить());
		СтруктураДанных.Вставить("СуммаДокумента", Док.СуммаДокумента);
		СтруктураДанных.Вставить("СуммаНДС", ?(ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("СуммаНДС", Док.Метаданные(), "Товары"), Док.Товары.Выгрузить().Итог("СуммаНДС"), 0));
		СтруктураДанных.Вставить("Сумма", Док.Товары.Выгрузить().Итог("Сумма"));
		СтруктураДанных.Вставить("СуммаВключаетНДС", ?(ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаВключаетНДС", Док.Метаданные()), Док.СуммаВключаетНДС, Ложь));
		СтруктураДанных.Вставить("КурсВзаиморасчетов", Док.КурсВзаиморасчетов);
		СтруктураДанных.Вставить("Дата", Док.Дата);
		СтруктураДанных.Вставить("Номер", Док.Номер);
		СтруктураДанных.Вставить("Ответственный", Строка(Док.Ответственный));
		СтруктураДанных.Вставить("ОтветственноеХранение", ТипЗнч(Док) = Тип("ДокументСсылка.ПоступлениеТоваровНаОтветственноеХранение"));
		СтруктураДанных.Вставить("Филиал", СокрЛП(Константы.База.Получить()));
		
		//+Белов А. 13.01.2025 #UT10-5006
		Если ТипЗнч(Док.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			СтруктураДанных.Вставить("ТранспортныеЕдиницы", ТаблицуВМассив(Док.УпаковочныеЛисты.Выгрузить()));	                  
		КонецЕсли;
		//-Белов А. 13.01.2025 #UT10-5006   
		
		//+Шульман А. 01.04.2025 #UT10-5173 
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ПремиальнаяПерекупка", Док.Метаданные()) Тогда
			СтруктураДанных.Вставить("ПремиальнаяПерекупка", Док.ПремиальнаяПерекупка);
		КонецЕсли;
		//-Шульман А. 01.04.2025 #UT10-5173
		
		КодГрузоотправителяУТ11 = "";       
		
		Если ОбщегоНазначения.ЕстьРеквизитТабЧастиДокумента("ЗаказПоставщику",Док.Метаданные(), "Товары") Тогда			
			
			Для Каждого СтрТов Из Док.Товары Цикл			
				
				Если ЗначениеЗаполнено(СтрТов.ЗаказПоставщику.IDСкладаСобственныйСклад) Тогда					
					
					КодГрузоотправителяУТ11 = СтрТов.ЗаказПоставщику.IDСкладаСобственныйСклад.КодГрузоотправителяУТ11;
					Прервать;
					
				КонецЕсли;				
				
			КонецЦикла;			
			
		КонецЕсли;	        
		
		СтруктураДанных.Вставить("КодГрузоотправителя", КодГрузоотправителяУТ11);
		
		Данные = ДанныеВJSONХранилище(СтруктураДанных);
		ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьИнвойсПо4Транзиту", УровеньЖурналаРегистрации.Информация,,, "Отправка ПТУ в стороннюю УТ11");
		
		ВСПрокси = СоздатьПодключение(Истина);
		Ответ = ВСПрокси.СоздатьИнвойсПоТранзиту4(Данные);
		ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьИнвойсПо4Транзиту", УровеньЖурналаРегистрации.Информация,,, "Получен ответ после отправки ПТУ в стороннюю УТ11");
		
	Исключение
		
		ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьИнвойсПо4Транзиту", УровеньЖурналаРегистрации.Ошибка,,, 
		"Ошибка получения ответа после отправки ПТУ в стороннюю УТ11: " + ОписаниеОшибки());
		
		Сообщить(ОписаниеОшибки());
		РаботаСАвардой.СоздатьОповещениеОбОшибкеОтправкиВАварду("Ошибка получения ответа после отправки ПТУ в стороннюю УТ11",
		"GoodsReserve.СоздатьИнвойсПо4Транзиту " + ОписаниеОшибки());
		Результат.ОписаниеОшибки = ОписаниеОшибки();
		
		Возврат Результат;
		
	КонецПопытки;

	Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда		
		
		Данные = ХранилищеJSONВСтруктуру(Ответ);		
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
			ЗаполнитьЗначенияСвойств(Результат, Данные);
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Результат.Загружен Тогда     
		
		IDИнвойса = Результат.ИДДокументаВСмежнойБазе;
		ДокПоступление = Док.ПолучитьОбъект();
		ДокПоступление.Комментарий = ДокПоступление.Комментарий + ?(ЗначениеЗаполнено(ДокПоступление.Комментарий), ". ", "") 
		+ СтрШаблон("В УТ11 Инвойс %1 от %2", Результат.НомерДокументаУТ11, Формат(Результат.ДатаДокументаУТ11, "ДФ=dd.MM.yyyy"));
		
		Если ТипЗнч(ДокПоступление.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровНаОтветственноеХранение") Тогда
			
			ДокПоступление.ИДДокументаВСмежнойБазе = IDИнвойса;
			ДокПоступление.Статус = Перечисления.СтатусыПТОХ.ОтправленИнвойс;

		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если ТипЗнч(ДокПоступление.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			УстановитьЗначениеДопСвойства(ДокПоступление.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.IDИнвойса, IDИнвойса);
		КонецЕсли;

	КонецЕсли;
	///
	
	Возврат Результат;
	
КонецФункции

Функция ПеренестиДатуПеремещенияТоваровВУТ11(ПТУ) Экспорт
	
	//+Сёмин Р. 16.02.2026 #UT10-5677
	Подключение = СоздатьПодключение(Истина);
	
	СтруктураПараметры = Новый Структура("ТранзитнаяПоставка", ПТУ.ТранзитнаяПоставка);
	
	РезультатХранилищеЗначения = Подключение.ПеренестиПеремещениеТоваровНаТекущийМесяц(
		Строка(ПТУ.ИДДокументаВСмежнойБазе),
		ДанныеВJSONХранилище(СтруктураПараметры)
	);
	
	Результат = ХранилищеJSONВСтруктуру(РезультатХранилищеЗначения);
	
	Если Результат.ОперацияВыполнена Тогда
		лУровеньЖурналаРегистрации = УровеньЖурналаРегистрации.Информация;
	Иначе
		лУровеньЖурналаРегистрации = УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(
		"МСКWEB.ПеренестиДатуПеремещенияТоваровУТ11",
		лУровеньЖурналаРегистрации,
		Метаданные.Документы.ПоступлениеТоваровУслуг,
		ПТУ,
		"УТ 11: " + Результат.ТекстСообщения
	);
	
	Возврат Результат;
	//-Сёмин Р. 16.02.2026 #UT10-5677
	
КонецФункции

Функция ПолучитьДанныеИзУТ11ОПодписиПТУВЭДО(МассивГУИДыПТУ) Экспорт
	
	//+Сёмин Р.И. 14.07.2026 #UT10-5945
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ГУИДыПТУ", МассивГУИДыПТУ);
	
	ВСПрокси = СоздатьПодключение(Истина);
	
	РезультатХранилищеЗначения = ВСПрокси.ПолучитьПодписанныеПоступления(ДанныеВJSONХранилище(СтруктураПараметры));
	Результат = ХранилищеJSONВСтруктуру(РезультатХранилищеЗначения);
	
	Возврат Результат;
	//-Сёмин Р.И. 14.07.2026 #UT10-5945
	
КонецФункции

Функция ПолучитьАдресаСервиса(Настройка) Экспорт
//+Гавриленков В. 19.05.2026 #UT10-5868
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АдресаСервисов.АдресСервиса
	|ИЗ
	|	Справочник.ВнешниеСервисы.АдресаСервисов КАК АдресаСервисов
	|ГДЕ
	|	АдресаСервисов.Ссылка = &Ссылка
	|	И НЕ (ВЫРАЗИТЬ(АдресаСервисов.АдресСервиса КАК СТРОКА(256))) = """"";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
//-Гавриленков В. 19.05.2026 #UT10-5868	
КонецФункции

/////////////////Создание документов//////////////////
Функция СоздатьАктОРасхожденииВУТ11(ГУИДДокумента,ГУИДПТУ, СтатусПТУ,ДокументАкт) Экспорт 
	
	Ответ = Новый Структура("Результат",Ложь);  
	
	Попытка
		
		КонстантаАдрес = Константы.АдресВебСервисаУТ11.Получить();		
		АдресВебСервиса = "http://" + КонстантаАдрес + "/ws/CreateVarianceAct.1cws?wsdl";
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);
		ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "CreateVarianceAct", "CreateVarianceActSoap");
		
	Исключение
		
		Ответ.Вставить("ТекстОшибки", "Не удалось подключиться к УТ11 !" + ОписаниеОшибки());
		Возврат Ответ;
		
	КонецПопытки;
	
	ЗапросТабличнойЧасти = Новый Запрос;
	ЗапросТабличнойЧасти.УстановитьПараметр("ДокАкт", ДокументАкт);
	ЗапросТабличнойЧасти.Текст =
	"ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.КодМДМ КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.Брак,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество,
//+Макрушин Е. 28.04.2026 #UT10-5838
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоРасхождения > 0
	|				И АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу = 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИзлишек,	
//-Макрушин Е. 28.04.2026 #UT10-5838
	|	АктОРасхожденияхПослеПриемкиТовары.КомментарийМенеджера,
	|	АктОРасхожденияхПослеПриемкиТовары.КомментарийПоставщика,
	|	АктОРасхожденияхПослеПриемкиТовары.КлючСтроки
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &ДокАкт"; 

	//+Макрушин Е. 29.01.2026 #UT10-5635
	//ПромТабличнаяЧасть = ЗапросТабличнойЧасти.Выполнить().Выгрузить();
	
	ЗапросТабличнойЧасти.Текст = ЗапросТабличнойЧасти.Текст + "
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Номенклатура.КодМДМ КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.КодМаркировки.КодМаркировки КАК КодМаркировки,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Недостача,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Излишек
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.РасхожденияКМ КАК АктОРасхожденияхПослеПриемкиРасхожденияКМ
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Ссылка = &ДокАкт
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатПоАкту = ЗапросТабличнойЧасти.ВыполнитьПакет();
	
	ПромТабличнаяЧасть = РезультатПоАкту[0].Выгрузить();
	
	тзРасхожденияКМ = РезультатПоАкту[1].Выгрузить();
	мРасхожденияКМ = ТаблицуВМассив(тзРасхожденияКМ);
	//-Макрушин Е. 29.01.2026 #UT10-5635

	ТабличнаяЧасть= ТаблицуВМассив(ПромТабличнаяЧасть);
	
	//+Макрушин Е. 23.01.2026 #UT10-5634
	Если ЗначениеЗаполнено(СтатусПТУ) Тогда
	//-Макрушин Е. 23.01.2026 #UT10-5634
	
		ИндексСтатуса = Перечисления.СтатусыПТУ.Индекс(СтатусПТУ);
		НовыйСтатусТекст = Метаданные.Перечисления.СтатусыПТУ.ЗначенияПеречисления[ИндексСтатуса].Имя;
		
		//+Макрушин Е. 23.01.2026 #UT10-5634
	Иначе
		НовыйСтатусТекст = "";
	КонецЕсли;	
	//-Макрушин Е. 23.01.2026 #UT10-5634
	
	Попытка

		ПараметрыСтруктура = Новый Структура("ГУИДДокумента,ГУИДПТУ, СтатусПТУ, ТабличнаяЧасть,Комментарий,ДатаДокумента, НомерДокумента",
								ГУИДДокумента, ГУИДПТУ, НовыйСтатусТекст, ТабличнаяЧасть, СокрЛП(ДокументАкт.Комментарий), ДокументАкт.Дата, СокрЛП(ДокументАкт.Номер));
								
		//+Макрушин Е. 28.01.2026 #UT10-5634
		ПараметрыСтруктура.Вставить("ТранзитнаяПоставка", ДокументАкт.ТранзитнаяПоставка);
		ПараметрыСтруктура.Вставить("ВидОперации", "" + ВРег(ДокументАкт.ВидОперации));
		//-Макрушин Е. 28.01.2026 #UT10-5634
		
		//+Макрушин Е. 29.01.2026 #UT10-5635
		ПараметрыСтруктура.Вставить("РасхожденияКМ", мРасхожденияКМ);
		//-Макрушин Е. 29.01.2026 #UT10-5635
		
		ОтветУТ11 = ВСПрокси.СоздатьАктОРасхожденияхПослеПриемки(ДанныеВJSONХранилище(ПараметрыСтруктура));
		
		Если ТипЗнч(ОтветУТ11) = Тип("ХранилищеЗначения") Тогда		
			Ответ = ХранилищеJSONВСтруктуру(ОтветУТ11);			
		КонецЕсли;		
		
	Исключение
		
		Ответ.Результат = Ложь;
		Ответ.Вставить("ТекстОшибки",ОписаниеОшибки()); 		
		
	КонецПопытки;
	
	Возврат Ответ;

КонецФункции

Функция ОтправитьАктОРасхожденииВУТ10(ГУИДДокумента,ГУИДПТУ, СтатусПТУ,ДокументАкт) Экспорт 
	
	//+Макрушин Е. 10.02.2026 #UT10-5665
	// выгрузка акта о расхождениях в соседнюю УТ10 для дальнейшей обработки
	Ответ = Новый Структура("Результат",Ложь);  
	
	Попытка
		
		IDСкладаСобственныйСклад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументАкт, "IDСкладаСобственныйСклад");
				
		//АдресВебСервиса = "http://" + IDСкладаСобственныйСклад.АдресВебСервисаCreateVarianceAct + "/ws/CreateVarianceAct.1cws?wsdl";
		АдресВебСервиса = IDСкладаСобственныйСклад.АдресВебСервисаCreateVarianceAct;
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);
		ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "CreateVarianceAct", "CreateVarianceActSoap");
		
	Исключение
		
		Ответ.Вставить("ТекстОшибки", "Не удалось подключиться к УТ10!" + ОписаниеОшибки());
		Возврат Ответ;
		
	КонецПопытки;
	
	
	IDСклада = Константы.FTPВыгрузкаОстатковКаталог.Получить();
	
	Если Не значениеЗаполнено(IDСклада) Тогда
		
		Ответ.Вставить("Ошибка при отправке акта. В константах не проставлен IDСклада!" + ОписаниеОшибки());
		Возврат Ответ;
		
	КонецЕсли;
	
	ЗапросТабличнойЧасти = Новый Запрос;
	ЗапросТабличнойЧасти.УстановитьПараметр("ДокАкт", ДокументАкт);
	ЗапросТабличнойЧасти.Текст =
	"ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.КодМДМ КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.Брак,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество,
	|	АктОРасхожденияхПослеПриемкиТовары.КомментарийМенеджера,
	|	АктОРасхожденияхПослеПриемкиТовары.КомментарийПоставщика,
	|	АктОРасхожденияхПослеПриемкиТовары.КлючСтроки
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка = &ДокАкт"; 

	ЗапросТабличнойЧасти.Текст = ЗапросТабличнойЧасти.Текст + "
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Номенклатура.КодМДМ КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.КодМаркировки.КодМаркировки КАК КодМаркировки,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Недостача,
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Излишек
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.РасхожденияКМ КАК АктОРасхожденияхПослеПриемкиРасхожденияКМ
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.Ссылка = &ДокАкт
	|
	|УПОРЯДОЧИТЬ ПО
	|	АктОРасхожденияхПослеПриемкиРасхожденияКМ.НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатПоАкту = ЗапросТабличнойЧасти.ВыполнитьПакет();
	
	ПромТабличнаяЧасть = РезультатПоАкту[0].Выгрузить();
	ТабличнаяЧасть= ТаблицуВМассив(ПромТабличнаяЧасть);
	
	тзРасхожденияКМ = РезультатПоАкту[1].Выгрузить();
	мРасхожденияКМ = ТаблицуВМассив(тзРасхожденияКМ);

	Если ЗначениеЗаполнено(СтатусПТУ) Тогда
	
		ИндексСтатуса = Перечисления.СтатусыПТУ.Индекс(СтатусПТУ);
		НовыйСтатусТекст = Метаданные.Перечисления.СтатусыПТУ.ЗначенияПеречисления[ИндексСтатуса].Имя;
		
	Иначе
		НовыйСтатусТекст = "";
	КонецЕсли;	
	
	Попытка

		ПараметрыСтруктура = Новый Структура("ГУИДДокумента,ГУИДПТУ, СтатусПТУ, ТабличнаяЧасть,Комментарий,ДатаДокумента, НомерДокумента",
								ГУИДДокумента, ГУИДПТУ, НовыйСтатусТекст, ТабличнаяЧасть, СокрЛП(ДокументАкт.Комментарий), ДокументАкт.Дата, СокрЛП(ДокументАкт.Номер));
								
		ПараметрыСтруктура.Вставить("ТранзитнаяПоставка", ДокументАкт.ТранзитнаяПоставка);
		ПараметрыСтруктура.Вставить("ВидОперации", "" + ВРег(ДокументАкт.ВидОперации));
		ПараметрыСтруктура.Вставить("РасхожденияКМ", мРасхожденияКМ);
		ПараметрыСтруктура.Вставить("IDСклада", IDСклада);
		ПараметрыСтруктура.Вставить("ИДДокументаВСмежнойБазеУТ11", ПараметрыСтруктура.ГУИДДокумента);
		
		ОтветУТ10 = ВСПрокси.СоздатьАктОРасхожденияхПослеОтгрузки(ДанныеВJSONХранилище(ПараметрыСтруктура));
		
		Если ТипЗнч(ОтветУТ10) = Тип("ХранилищеЗначения") Тогда		
			Ответ = ХранилищеJSONВСтруктуру(ОтветУТ10);			
		КонецЕсли;		
		
	Исключение
		
		Ответ.Результат = Ложь;
		Ответ.Вставить("ТекстОшибки",ОписаниеОшибки()); 		
		
	КонецПопытки;
	
	Возврат Ответ;
    //-Макрушин Е. 10.02.2026 #UT10-5665
	
КонецФункции 

Функция ИзменитьСтатусАктаОРасхожденияхВСмежнойУТ10(АктСсылка) Экспорт
	
	//+Макрушин Е. 12.02.2026 #UT10-5665
	Результат = Новый Структура("Результат, ТекстОшибки", Ложь, "");
	
	ИндексСтатуса = Перечисления.СтатусыАктаОРасхождениях.Индекс(АктСсылка.Статус);
	НовыйСтатусТекст = Метаданные.Перечисления.СтатусыАктаОРасхождениях.ЗначенияПеречисления[ИндексСтатуса].Имя;
	
	РеквизитыАкта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АктСсылка, "ДокументОснование, ИДДокументаВСмежнойБазе, Товары");
	ДокОснованиеАкта = РеквизитыАкта.ДокументОснование;
	
	Если Не ЗначениеЗаполнено(ДокОснованиеАкта) Тогда
		
		Результат.ТекстОшибки = "Не найден документ основание акта " + АктСсылка;
		Возврат Результат; 
		
	КонецЕсли;
	
	ТоварыАкта = РеквизитыАкта.Товары.Выгрузить();
	
	ТЧТовары = Новый ТаблицаЗначений;
	ТЧТовары.Колонки.Добавить("Номенклатура");
	ТЧТовары.Колонки.Добавить("Действие");
	ТЧТовары.Колонки.Добавить("КомментарийПоставщика");
	ТЧТовары.Колонки.Добавить("Количество");
	ТЧТовары.Колонки.Добавить("КоличествоПоДокументу");
	ТЧТовары.Колонки.Добавить("Цена");

	Для Каждого Стр Из ТоварыАкта Цикл
		
		НовСтр = ТЧТовары.Добавить();
		НовСтр.Номенклатура = Стр.Номенклатура.КодМДМ;
		
		Если ЗначениеЗаполнено(Стр.Действие) Тогда
			
			ИндексДействия = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.Индекс(Стр.Действие);
			НовСтр.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПолучитьПарноеЗначениеПеречисленияУТ10(Стр.Действие); 
			
		Иначе
			НовСтр.Действие = "";
		КонецЕсли; 
		
		НовСтр.КомментарийПоставщика = Стр.КомментарийМенеджера;
		
		НовСтр.КоличествоПоДокументу = Стр.КоличествоПоДокументу;
		НовСтр.Количество = Стр.Количество; 
		НовСтр.Цена = Стр.Цена;
		
	КонецЦикла;
	
	ДанныеТЧТовары = ДанныеВJSONХранилище(ТаблицуВМассив(ТЧТовары));
	
	ДопПараметры = Новый Структура("ТекстОшибки", "");
	
	Ответ = Новый Структура("Результат",Ложь);
	
	Попытка
		
		IDСкладаСобственныйСклад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АктСсылка, "IDСкладаСобственныйСклад");
				
		//АдресВебСервиса = "http://" + IDСкладаСобственныйСклад.АдресВебСервисаCreateVarianceAct + "/ws/CreateVarianceAct.1cws?wsdl";
		АдресВебСервиса = IDСкладаСобственныйСклад.АдресВебСервисаUpdateVarianceAct;
		ВСОпределение = Новый WSОпределения(АдресВебСервиса, , ,, 30);
		ВСПрокси = Новый WSПрокси(ВСОпределение, "Data", "UpdateVarianceAct", "UpdateVarianceActSoap");

	Исключение
		
		Ответ.Вставить("ТекстОшибки", "Не удалось подключиться к веб-сервису UpdateVarianceAct в УТ10! " + ОписаниеОшибки());
		Возврат Ответ;
		
	КонецПопытки;
	
	Попытка
		
		ОтветУТ10 = ВСПрокси.ИзменитьСтатусАктаОРасхождении(Строка(АктСсылка.ИДДокументаВСмежнойБазе),Строка(ДокОснованиеАкта.УникальныйИдентификатор()), 
		                             "КОРРЕКТИРОВКАОСТАТКАВУТ10", НовыйСтатусТекст, ДанныеТЧТовары, ""); 
		
		Если ТипЗнч(ОтветУТ10) = Тип("ХранилищеЗначения") Тогда		
			Ответ = ХранилищеJSONВСтруктуру(ОтветУТ10);			
		КонецЕсли;		
		
	Исключение
		
		Ответ.Результат = Ложь;
		Ответ.Вставить("ТекстОшибки",ОписаниеОшибки()); 		
		
	КонецПопытки;
	
	Возврат Ответ;
	
	//-Макрушин Е. 12.02.2026 #UT10-5665
	
КонецФункции

Функция СоздатьАктОРасхожденияхПослеОтгрузкиВебСервисУТ10(Документ, ТаблТов, ДопПараметры = Неопределено) Экспорт

	//+Макрушин Е. 11.02.2026 #UT10-5665
	//Документ - Реализация товаров и услуг
	ДокАкт = Документы.АктОРасхожденияхПослеОтгрузки.ПустаяСсылка();
	
	Если Документ <> Неопределено тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "Склад");
		
		Если ЗначениеЗаполнено(ДопПараметры) и ДопПараметры.Свойство("ДокАкт") Тогда
			
			ДокАкт = ДопПараметры.ДокАкт.ПолучитьОбъект();
			ДокАкт.Товары.Очистить();
			
		Иначе
			ДокАкт = Документы.АктОРасхожденияхПослеОтгрузки.СоздатьДокумент();
			ДокАкт.Дата = ТекущаяДата();
		КонецЕсли;
		
		ДокАкт.Заполнить(Документ);

		ДокАкт.Статус = Перечисления.СтатусыАктаОРасхождениях.НаСогласовании;
		ДокАкт.Комментарий = ДопПараметры.Комментарий;
		ДокАкт.ИДДокументаВСмежнойБазе = ДопПараметры.ИДДокументаВСмежнойБазе;

		ДокАкт.IDСкладаСобственныйСклад = Справочники.СобственныеСклады.ПолучитьСобственныйСкладПоИдентификатору(МСК.СтрокаВЧисло(ДопПараметры.IDСклада));
		
		ДокАкт.ДатаВСтороннейБазе = МСК.СтрокаВДату(ДопПараметры.ДатаДокумента);
		ДокАкт.НомерВСтороннейБазе = ДопПараметры.НомерДокумента;
		
		Если Не ЗначениеЗаполнено(ДокАкт.Номер) Тогда
			ДокАкт.УстановитьНовыйНомер(ДокАкт.Организация.Префикс);
		КонецЕсли;		
		
		// определяем первый доступный заказ для излишка, а далее оставляем его, если нет более подходящего с учетом номенклатуры
		ЗаказДляИзлишкаПервый = Документы.ЗаказПокупателя.ПустаяСсылка();
		
		Для Каждого СтрокаАкта Из  ДокАкт.Товары Цикл
			
			СтрокаАкта.Количество = 0;
			
			Если ЗначениеЗаполнено(СтрокаАкта.ЗаказПокупателя) И НЕ ЗначениеЗаполнено(ЗаказДляИзлишкаПервый) Тогда
				ЗаказДляИзлишкаПервый = СтрокаАкта.ЗаказПокупателя;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого Строка Из ТаблТов Цикл
			
			НоменклатураДляПоиска = Строка.Номенклатура;
			КоличествоПринято = Строка.Количество;
			
			ЗаказДляИзлишкаПоНоменклатуре = Документы.ЗаказПокупателя.ПустаяСсылка();
			
			Отбор = Новый Структура("Номенклатура", НоменклатураДляПоиска);
			СтрокиАкта = ДокАкт.Товары.НайтиСтроки(Отбор);
			
			Для Каждого СтрокаАкта Из СтрокиАкта Цикл
				
				Если ЗначениеЗаполнено(СтрокаАкта.ЗаказПокупателя) И НЕ ЗначениеЗаполнено(ЗаказДляИзлишкаПоНоменклатуре) Тогда
					ЗаказДляИзлишкаПоНоменклатуре = СтрокаАкта.ЗаказПокупателя;
				КонецЕсли;
				
				КоличествоДляЗачета = Мин(СтрокаАкта.КоличествоПоДокументу, КоличествоПринято);
				СтрокаАкта.Количество = СтрокаАкта.Количество + КоличествоДляЗачета;
				КоличествоПринято = КоличествоПринято - КоличествоДляЗачета;
				
				Если КоличествоПринято = 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если КоличествоПринято > 0 Тогда 
				
				СтрокаАкта = ДокАкт.Товары.Добавить();
				СтрокаАкта.Номенклатура = НоменклатураДляПоиска;
				СтрокаАкта.ЕдиницаИзмерения = СтрокаАкта.Номенклатура.ЕдиницаХраненияОстатков;
				СтрокаАкта.Коэффициент      = СтрокаАкта.ЕдиницаИзмерения.Коэффициент;
				СтрокаАкта.Количество = КоличествоПринято;
				СтрокаАкта.ЗаказПокупателя = ?(ЗначениеЗаполнено(ЗаказДляИзлишкаПоНоменклатуре), ЗаказДляИзлишкаПоНоменклатуре, ЗаказДляИзлишкаПервый);
				СтрокаАкта.Цена = 0.07;
				
				//СтрокаАкта.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтрокаАкта.Номенклатура, ДокАкт.Дата);
				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаАкта, ДокАкт, "Реализация");
				
				СтрокаАкта.Склад = РеквизитыДокумента.Склад;
				
			КонецЕсли;
						
		КонецЦикла;
		
		// финально подбиваем количество и проверяем нужно ли вообще записывать акт
		НужноЗаписатьАкт = Ложь;
		
		Для Каждого СтрокаАкта Из  ДокАкт.Товары Цикл
			
			СтрокаАкта.КоличествоРасхождения = СтрокаАкта.Количество - СтрокаАкта.КоличествоПоДокументу;
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаАкта, ДокАкт);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаАкта, ДокАкт);
			
			ОбработкаТабличныхЧастей.РассчитатьСуммуРасхожденияТабЧасти(СтрокаАкта, ДокАкт);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСРасхожденияТабЧасти(СтрокаАкта, ДокАкт);
			
			Если СтрокаАкта.КоличествоПоДокументу > СтрокаАкта.Количество тогда
				СтрокаАкта.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ДопоставкаНеТребуется;
			ИначеЕсли СтрокаАкта.КоличествоПоДокументу < СтрокаАкта.Количество тогда
				СтрокаАкта.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеОтгрузки.ПокупкаПерепоставленного;
			КонецЕсли;
			
			Если СтрокаАкта.Количество <> СтрокаАкта.КоличествоПоДокументу Тогда
				НужноЗаписатьАкт = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НужноЗаписатьАкт Тогда
			
			// если есть, фиксируем в отдельной тч Расхождения кодов маркировки
			ДокАкт.РасхожденияКМ.Очистить();
			
			Если ЗначениеЗаполнено(ДопПараметры) и ДопПараметры.Свойство("ТаблРасхожденияКМ") Тогда
				
				ТаблРасхожденияКМ = ДопПараметры.ТаблРасхожденияКМ;
				
				Для Каждого СтрокаРасхожденияКМ Из ТаблРасхожденияКМ Цикл
					
					НовСтрокаРасхожденияКМ = ДокАкт.РасхожденияКМ.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрокаРасхожденияКМ, СтрокаРасхожденияКМ);
					
				КонецЦикла;
				
			КонецЕсли;
			
			ДокАкт.ЗаполнитьРасхожденияКМ();			
			
			// собственно запись
			ДокАкт.Записать(РежимЗаписиДокумента.Запись);
			
			Попытка
				ДокАкт.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ЗаписьЖурналаРегистрации("Ошибка проведения документа " + ДокАкт.Ссылка, УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
			Конецпопытки;
			
		Иначе
			ДокАкт = Документы.АктОРасхожденияхПослеОтгрузки.ПустаяСсылка();
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат ДокАкт.Ссылка;
    //-Макрушин Е. 11.02.2026 #UT10-5665
	
КонецФункции

Функция СоздатьКорректировкаЗаказаПокупателя(НовыйДокЗаказ, ПараметрРежимПроведенияДокумента = Неопределено, Комментарий = "") Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Документ", "");
	СтруктураВозврата.Вставить("Ошибка", "");         
	
	ТоварыТолькоСоСклада = НовыйДокЗаказ.Грузополучатель.ТоварыТолькоСоСклада ИЛИ НовыйДокЗаказ.ТаксиДоставка; 
	
	Если Не ТоварыТолькоСоСклада Тогда 
		
		Если Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала.Получить()Тогда
			Возврат СоздатьКорректировкаЗаказаПокупателяПоКратностиФилиала(НовыйДокЗаказ,, Комментарий = "")	
		Иначе 			
			Возврат СтруктураВозврата;	
		КонецЕсли;     	
		
	КонецЕсли;      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.НомерСтроки,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Ссылка.СкладГруппа КАК Склад,
	|	ЗаказПокупателяТовары.Количество
	|ПОМЕСТИТЬ ТабЗакПокуп
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Склад,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ТабТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗакПокуп.Ссылка,
	|	ТабЗакПокуп.НомерСтроки,
	|	ТабЗакПокуп.Номенклатура КАК Номенклатура,
	|	ТабЗакПокуп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакПокуп.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТабЗакПокуп.Склад,
	|	ТабЗакПокуп.Количество,
	|	ЕСТЬNULL(ТабТоварыВРезерве.КоличествоВРезерве, 0) КАК КоличествоВРезерве
	|ИЗ
	|	ТабЗакПокуп КАК ТабЗакПокуп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТоварыВРезерве КАК ТабТоварыВРезерве
	|		ПО ТабЗакПокуп.Ссылка = ТабТоварыВРезерве.ДокументРезерва
	|			И ТабЗакПокуп.Номенклатура = ТабТоварыВРезерве.Номенклатура
	|			И ТабЗакПокуп.ХарактеристикаНоменклатуры = ТабТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ТабЗакПокуп.СерияНоменклатуры = ТабТоварыВРезерве.СерияНоменклатуры
	|			И ТабЗакПокуп.Склад = ТабТоварыВРезерве.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ХарактеристикаНоменклатуры,
	|	СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", НовыйДокЗаказ.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат СтруктураВозврата;                                                    
	КонецЕсли; 
	
	ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ДокументКорректировки.Заполнить(НовыйДокЗаказ.Ссылка);
	ДокументКорректировки.Дата = ТекущаяДата();
	ДокументКорректировки.Комментарий = Комментарий;
	ДокументКорректировки.ВалютаДокумента = НовыйДокЗаказ.ВалютаДокумента; 
	
	ДокументКорректировки.Товары.Очистить();
	ДокументКорректировки.Услуги.Очистить();                               
	ДокументКорректировки.ВозвратнаяТара.Очистить();
	
	Номенклатура = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	СерияНоменклатуры = Неопределено;
	
	КоличествоВРезерве = 0;                
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если Номенклатура <> РезультатЗапроса.Номенклатура Или 
			
			ХарактеристикаНоменклатуры <> РезультатЗапроса.ХарактеристикаНоменклатуры Или 
			СерияНоменклатуры <> РезультатЗапроса.СерияНоменклатуры Тогда
			
			ХарактеристикаНоменклатуры = РезультатЗапроса.ХарактеристикаНоменклатуры;
			СерияНоменклатуры = РезультатЗапроса.СерияНоменклатуры;
			Номенклатура = РезультатЗапроса.Номенклатура;
			
			КоличествоВРезерве = РезультатЗапроса.КоличествоВРезерве;
			
		КонецЕсли; 
		
		
		Если РезультатЗапроса.Количество <= КоличествоВРезерве Тогда
			КоличествоВРезерве = КоличествоВРезерве - РезультатЗапроса.Количество;
		Иначе
			
			НоваяСтрока = ДокументКорректировки.Товары.Добавить();
			КоличествоКорректировки = РезультатЗапроса.Количество - КоличествоВРезерве;
			КоличествоВРезерве = 0;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1]);	
			
			НоваяСтрока.Количество = -1 * КоличествоКорректировки;
			НоваяСтрока.Цена = НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1].Цена;	
			НоваяСтрока.Причина = ?(НовыйДокЗаказ.ТаксиДоставка, Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика, Перечисления.ПричиныКорректировкиСборки.ОтказКлиента);
			мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
			
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДокументКорректировки.СуммаДокумента = ДокументКорректировки.Товары.Итог("Сумма");

	Если НЕ ДокументКорректировки.Товары.Количество() = 0 Тогда
		
		Попытка
			
			Если ПараметрРежимПроведенияДокумента = Неопределено Тогда
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);		
			Иначе
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, ПараметрРежимПроведенияДокумента);		
			КонецЕсли; 		
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			
		Исключение
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			СтруктураВозврата.Ошибка = ОписаниеОшибки();
			Возврат СтруктураВозврата;
			
		КонецПопытки;

	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция СоздатьКорректировкаЗаказаПокупателяПоТоварамТОХ(НовыйДокЗаказ, ПараметрРежимПроведенияДокумента = Неопределено, Комментарий = "") Экспорт
	
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Документ", "");
	СтруктураВозврата.Вставить("Ошибка", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.СерияНоменклатуры,
	|	Товары.Количество
	|ПОМЕСТИТЬ ТаблТовары
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК ОстатокСклад,
	|	СУММА(ЕСТЬNULL(ТоварыОтветственногоХраненияОстатки.КоличествоОстаток, 0)) КАК ОстатокТОХ,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ТаблОстатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Дата,
	|			(Номенклатура, СерияНоменклатуры) В
	|				(ВЫБРАТЬ
	|					ТаблТовары.Номенклатура,
	|					ТаблТовары.СерияНоменклатуры
	|				ИЗ
	|					ТаблТовары КАК ТаблТовары)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	|				&Дата,
	|				(Номенклатура, СерияНоменклатуры) В
	|					(ВЫБРАТЬ
	|						ТаблТовары.Номенклатура,
	|						ТаблТовары.СерияНоменклатуры
	|					ИЗ
	|						ТаблТовары КАК ТаблТовары)) КАК ТоварыОтветственногоХраненияОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыОтветственногоХраненияОстатки.Номенклатура
	|			И ТоварыНаСкладахОстатки.СерияНоменклатуры = ТоварыОтветственногоХраненияОстатки.СерияНоменклатуры
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблТовары.НомерСтроки,
	|	ТаблТовары.Номенклатура,
	|	ТаблТовары.СерияНоменклатуры,
	|	СУММА(ТаблТовары.Количество) КАК Количество,
	|	СУММА(ТаблОстатки.ОстатокСклад) КАК ОстатокСклад,
	|	СУММА(ТаблОстатки.ОстатокТОХ) КАК ОстатокТОХ,
	|	СУММА(ВЫБОР
	|			КОГДА ТаблОстатки.ОстатокСклад - ТаблОстатки.ОстатокТОХ < 0
	|				ТОГДА 0
	|			ИНАЧЕ ТаблОстатки.ОстатокСклад - ТаблОстатки.ОстатокТОХ
	|		КОНЕЦ) КАК ОстатокСкладБезТОХ
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТаблТовары КАК ТаблТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблОстатки КАК ТаблОстатки
	|		ПО (ТаблОстатки.Номенклатура = ТаблТовары.Номенклатура)
	|			И (ТаблОстатки.СерияНоменклатуры = ТаблТовары.СерияНоменклатуры)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблТовары.Номенклатура,
	|	ТаблТовары.СерияНоменклатуры,
	|	ТаблТовары.НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.НомерСтроки,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.СерияНоменклатуры,
	|	ИтоговаяТаблица.Количество КАК КоличествоВДокументе,
	|	ВЫБОР
	|		КОГДА ИтоговаяТаблица.ОстатокСкладБезТОХ >= ИтоговаяТаблица.Количество
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ > ИтоговаяТаблица.ОстатокТОХ
	|					ТОГДА ИтоговаяТаблица.ОстатокТОХ
	|				ИНАЧЕ ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ
	|			КОНЕЦ
	|	КОНЕЦ КАК Количество,
	|	ИтоговаяТаблица.ОстатокСклад,
	|	ИтоговаяТаблица.ОстатокТОХ,
	|	ИтоговаяТаблица.ОстатокСкладБезТОХ
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ИтоговаяТаблица.ОстатокСкладБезТОХ >= ИтоговаяТаблица.Количество
	|				ТОГДА 0
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ > ИтоговаяТаблица.ОстатокТОХ
	|						ТОГДА ИтоговаяТаблица.ОстатокТОХ
	|					ИНАЧЕ ИтоговаяТаблица.Количество - ИтоговаяТаблица.ОстатокСкладБезТОХ
	|				КОНЕЦ
	|		КОНЕЦ > 0";
	
	
	ТаблТоваров = НовыйДокЗаказ.Товары.Выгрузить();
	ТаблТоваров.Свернуть("НомерСтроки, Номенклатура, СерияНоменклатуры", "Количество");  
	
	Запрос.УстановитьПараметр("Товары", ТаблТоваров); 
	Запрос.УстановитьПараметр("Дата", Новый Граница(НовыйДокЗаказ.Дата, ВидГраницы.Исключая));

	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат СтруктураВозврата;                                                    
	КонецЕсли; 
	
	ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ДокументКорректировки.Заполнить(НовыйДокЗаказ.Ссылка);
	ДокументКорректировки.Дата = ТекущаяДата();
	ДокументКорректировки.Комментарий = Комментарий;
	ДокументКорректировки.ВалютаДокумента = НовыйДокЗаказ.ВалютаДокумента; 
	
	ДокументКорректировки.Товары.Очистить();
	ДокументКорректировки.Услуги.Очистить();                               
	ДокументКорректировки.ВозвратнаяТара.Очистить();
	
	Номенклатура = Неопределено;
	СерияНоменклатуры = Неопределено;
	
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		НоваяСтрока = ДокументКорректировки.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1]);	
		НоваяСтрока.Количество = -1 * РезультатЗапроса.Количество;
		НоваяСтрока.Цена = НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1].Цена;	
		НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика;
		мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
		
		ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);	
		ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
		ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);	
		ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
		
	КонецЦикла; 
	
	ДокументКорректировки.СуммаДокумента = ДокументКорректировки.Товары.Итог("Сумма");

	Если НЕ ДокументКорректировки.Товары.Количество() = 0 Тогда
		
		Попытка
			
			Если ПараметрРежимПроведенияДокумента = Неопределено Тогда
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);		
			Иначе
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, ПараметрРежимПроведенияДокумента);		
			КонецЕсли; 		
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			
		Исключение
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			СтруктураВозврата.Ошибка = ОписаниеОшибки();
			Возврат СтруктураВозврата;
			
		КонецПопытки;

	КонецЕсли;

	Возврат СтруктураВозврата;

КонецФункции

Функция СоздатьКорректировкаЗаказаПокупателяПоКратностиФилиала(НовыйДокЗаказ, ПараметрРежимПроведенияДокумента = Неопределено, Комментарий = "") Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Документ", "");
	СтруктураВозврата.Вставить("Ошибка", "");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.НомерСтроки,
	|	ЗаказПокупателяТовары.Номенклатура,
	|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
	|	ЗаказПокупателяТовары.СерияНоменклатуры,
	|	ЗаказПокупателяТовары.Ссылка.СкладГруппа КАК Склад,
	|	ЗаказПокупателяТовары.Количество
	|ПОМЕСТИТЬ ТабЗакПокуп
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка = &ЗаказПокупателя
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВРезервеНаСкладахОстатки.Склад,
	|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва,
	|	ТоварыВРезервеНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ТабТоварыВРезерве
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ДокументРезерва = &ЗаказПокупателя) КАК ТоварыВРезервеНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабЗакПокуп.Ссылка,
	|	ТабЗакПокуп.НомерСтроки,
	|	ТабЗакПокуп.Номенклатура КАК Номенклатура,
	|	ТабЗакПокуп.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ТабЗакПокуп.СерияНоменклатуры КАК СерияНоменклатуры,
	|	ТабЗакПокуп.Склад,
	|	ТабЗакПокуп.Количество,
	|	ЕСТЬNULL(ТабТоварыВРезерве.КоличествоВРезерве, 0) КАК КоличествоВРезерве
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТабЗакПокуп КАК ТабЗакПокуп
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабТоварыВРезерве КАК ТабТоварыВРезерве
	|		ПО ТабЗакПокуп.Ссылка = ТабТоварыВРезерве.ДокументРезерва
	|			И ТабЗакПокуп.Номенклатура = ТабТоварыВРезерве.Номенклатура
	|			И ТабЗакПокуп.ХарактеристикаНоменклатуры = ТабТоварыВРезерве.ХарактеристикаНоменклатуры
	|			И ТабЗакПокуп.СерияНоменклатуры = ТабТоварыВРезерве.СерияНоменклатуры
	|			И ТабЗакПокуп.Склад = ТабТоварыВРезерве.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Ссылка,
	|	ИтоговаяТаблица.НомерСтроки,
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.ХарактеристикаНоменклатуры,
	|	ИтоговаяТаблица.СерияНоменклатуры,
	|	ИтоговаяТаблица.Склад,
	|	ИтоговаяТаблица.Количество,
	|	ИтоговаяТаблица.КоличествоВРезерве
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	ИтоговаяТаблица.КоличествоВРезерве = 0
	|	И НЕ ИтоговаяТаблица.Номенклатура.НеОчищатьКратностьПриНулевыхОстатках
	|	И ВЫБОР
	|			КОГДА НЕ ЦЕЛ(ИтоговаяТаблица.Количество / ИтоговаяТаблица.Номенклатура.Кратность) = ИтоговаяТаблица.Количество / ИтоговаяТаблица.Номенклатура.Кратность
	|					И НЕ ИтоговаяТаблица.Номенклатура.Кратность = ИтоговаяТаблица.Номенклатура.КратностьФилиала
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", НовыйДокЗаказ.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат СтруктураВозврата;                                                    
	КонецЕсли; 
	
	ДокументКорректировки = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
	ДокументКорректировки.Заполнить(НовыйДокЗаказ.Ссылка);
	ДокументКорректировки.Дата = ТекущаяДата();
	ДокументКорректировки.Комментарий = Комментарий;
	ДокументКорректировки.ВалютаДокумента = НовыйДокЗаказ.ВалютаДокумента; 
	ДокументКорректировки.Товары.Очистить();
	ДокументКорректировки.Услуги.Очистить();                               
	ДокументКорректировки.ВозвратнаяТара.Очистить();
	
	Номенклатура = Неопределено;
	ХарактеристикаНоменклатуры = Неопределено;
	СерияНоменклатуры = Неопределено;
	КоличествоВРезерве = 0;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		Если Номенклатура <> РезультатЗапроса.Номенклатура Или 
			ХарактеристикаНоменклатуры <> РезультатЗапроса.ХарактеристикаНоменклатуры Или 
			СерияНоменклатуры <> РезультатЗапроса.СерияНоменклатуры Тогда
			
			ХарактеристикаНоменклатуры = РезультатЗапроса.ХарактеристикаНоменклатуры;
			СерияНоменклатуры = РезультатЗапроса.СерияНоменклатуры;
			Номенклатура = РезультатЗапроса.Номенклатура;
			
			КоличествоВРезерве = РезультатЗапроса.КоличествоВРезерве;
			
		КонецЕсли; 
		
		Если РезультатЗапроса.Количество <= КоличествоВРезерве Тогда
			КоличествоВРезерве = КоличествоВРезерве - РезультатЗапроса.Количество;
		Иначе
			
			НоваяСтрока = ДокументКорректировки.Товары.Добавить();
			КоличествоКорректировки = РезультатЗапроса.Количество - КоличествоВРезерве;
			КоличествоВРезерве = 0;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1]);	
			НоваяСтрока.Количество = -1 * КоличествоКорректировки;
			НоваяСтрока.Цена = НовыйДокЗаказ.Товары[РезультатЗапроса.НомерСтроки - 1].Цена;	
			НоваяСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика; 		
			мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();	
			
			ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(НоваяСтрока, ДокументКорректировки, "Реализация");
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НоваяСтрока, ДокументКорректировки);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокументКорректировки);	
			ОбработкаТабличныхЧастей.РассчитатьПлановуюСебестоимостьВСтрокеТабЧасти(НоваяСтрока, ДокументКорректировки, мВалютаРегламентированногоУчета);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ДокументКорректировки.СуммаДокумента = ДокументКорректировки.Товары.Итог("Сумма");
	
	Если НЕ ДокументКорректировки.Товары.Количество() = 0 Тогда
		
		Попытка
			
			Если ПараметрРежимПроведенияДокумента = Неопределено Тогда
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);		
			Иначе
				ДокументКорректировки.Записать(РежимЗаписиДокумента.Проведение, ПараметрРежимПроведенияДокумента);		
			КонецЕсли; 		
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			
		Исключение
			
			СтруктураВозврата.Документ = ДокументКорректировки;
			СтруктураВозврата.Ошибка = ОписаниеОшибки();
			Возврат СтруктураВозврата;
			
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;

КонецФункции

Функция СозданиеЗаказПокупателя(ДанныеШапки, ДанныеТЧТовары) Экспорт
	
	//+Шульман А. 21.01.2025 #UT10-5059  
	Результат = Новый Структура("Результат, ТекстОшибки, ГУИДЗаказа, НомерЗаказа, Создан, Проведен, ПомеченНаУдаление, ДанныеТЧТовары", 
	Ложь, "", "", "", Ложь, Ложь, Ложь, Неопределено);  
	
	ВидыПроцессов = Новый Соответствие();
	ВидыПроцессов.Вставить("Возврат неликвида ТОХ через WMS", Перечисления.ВидыПроцессов.ВозвратНеликвидаТОХчерезWMS);  
	ВидыПроцессов.Вставить("Возврат неликвида ТОХ напрямую поставщику", Перечисления.ВидыПроцессов.ВозвратНеликвидаТОХНапрямуюПоставщику);  
	
	СтрШапка = ХранилищеJSONВСтруктуру(ДанныеШапки);
	
	ГУИДДокумента = СтрШапка.ГУИДДокумента;
	
	МассивДанных = ХранилищеJSONВСтруктуру(ДанныеТЧТовары);   
	тзДанныеТЧТовары = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(МассивДанных);
	
	ДокСсылка = Неопределено;        
	СкладГруппа = Константы.ОсновнойСклад.Получить();
	
	Если Не ПустаяСтрока(ГУИДДокумента) И СтрДлина(ГУИДДокумента) = 36 Тогда   
		
		Попытка
			ДокСсылка = Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИДДокумента));
		Исключение
			
			Результат.ТекстОшибки = "Ошибка при получении заказа с ГУИД " + ГУИДДокумента + ". " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			Возврат Результат;
			
		КонецПопытки;
	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокСсылка) Тогда
		
		
		ДокОбъект = Документы.ЗаказПокупателя.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();
		ДокОбъект.Организация = Константы.ОсновнаяОрганизация.Получить();
		ДокОбъект.КроссДокинг = СтрШапка.КроссДокинг;  
		ДокОбъект.ВидПроцесса = ВидыПроцессов.Получить(СтрШапка.ВидПроцесса);    
		
		Если ЗначениеЗаполнено(СтрШапка.КонтрагентКодМДМ) Тогда
			ДокОбъект.Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СтрШапка.КонтрагентКодМДМ);           
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрШапка.ДоговорКонтрагентаКодМДМ) Тогда
			ДокОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", СтрШапка.ДоговорКонтрагентаКодМДМ);
		КонецЕсли;      
		
		ДокОбъект.Грузополучатель = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", СтрШапка.ПартнерКодМДМ); 
		ДокОбъект.СпособДоставки = ДокОбъект.Грузополучатель.СпособДоставки;
		ДокОбъект.ИсточникЗаказа        	= Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", 5);   
		ДокОбъект.ВалютаДокумента 			= ДокОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов; 

		ДокОбъект.КурсВзаиморасчетов 		= 1;
		ДокОбъект.КратностьВзаиморасчетов 	= 1;
		ДокОбъект.СуммаВключаетНДС 			= Истина;
		ДокОбъект.УчитыватьНДС 				= Истина;
		ДокОбъект.СкладГруппа				= СкладГруппа;   
		ДокОбъект.Подразделение = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь, "ОсновноеПодразделение");
		ДокОбъект.Ответственный         	= ПараметрыСеанса.ТекущийПользователь;
		
		ДокОбъект.Комментарий = СтрШапка.Комментарий;  
		
		Результат.Создан = Истина;
		
	Иначе                                  
		
		ДокОбъект = ДокСсылка.ПолучитьОбъект();   
		ДокОбъект.ПометкаУдаления = Ложь;  
		
	КонецЕсли;     
	
	// Полученные товары сравниваются с остатками и распределяются по сериям.
	// Превышение остатка заносится в корректировку заказа
	Запрос = Новый Запрос;     
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзДанныеТЧТовары.НоменклатураКодМДМ,
	|	тзДанныеТЧТовары.Количество,
	|	тзДанныеТЧТовары.Цена,
	|	тзДанныеТЧТовары.КлючСтроки
	|ПОМЕСТИТЬ ВТ_ДанныеТЧТовары
	|ИЗ
	|	&тзДанныеТЧТовары КАК тзДанныеТЧТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(Номенклатура.ЕдиницаХраненияОстатков, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,  
	|	ЕСТЬNULL(Номенклатура.СтавкаНДС, ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)) КАК СтавкаНДС,
	|	ВТ_ДанныеТЧТовары.НоменклатураКодМДМ,
	|	ВТ_ДанныеТЧТовары.Количество,
	|	ВТ_ДанныеТЧТовары.Цена,
	|	ВТ_ДанныеТЧТовары.КлючСтроки,
	|	ВЫБОР
	|		КОГДА Номенклатура.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК НайденаНоменклатура
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	ВТ_ДанныеТЧТовары КАК ВТ_ДанныеТЧТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (Номенклатура.КодМДМ = ВТ_ДанныеТЧТовары.НоменклатураКодМДМ)
	|        И  НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
	|	ПартииТоваровНаСкладахОстатки.СерияНоменклатуры,
	|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток,
	|	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток,
	|	ВТ_Товары.Количество КАК Количество,
	|	ВТ_Товары.Цена КАК Цена,
	|	ВТ_Товары.КлючСтроки КАК КлючСтроки,
	|	ВТ_Товары.НайденаНоменклатура КАК НайденаНоменклатура
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|				&МоментДокумента,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Номенклатура
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары
	|					ГДЕ
	|						ВТ_Товары.НайденаНоменклатура)) КАК ПартииТоваровНаСкладахОстатки
	|		ПО ВТ_Товары.Номенклатура = ПартииТоваровНаСкладахОстатки.Номенклатура
	|			И (ВТ_Товары.НайденаНоменклатура)
	|ГДЕ
	|	ПартииТоваровНаСкладахОстатки.КоличествоОстаток > 0";
	
	ТЧТовары = Новый ТаблицаЗначений;
	ТЧТовары.Колонки.Добавить("НоменклатураКодМДМ", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТЧТовары.Колонки.Добавить("КлючСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(5, 0, ДопустимыйЗнак.Неотрицательный));
	ТЧТовары.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));	
	ТЧТовары.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2, ДопустимыйЗнак.Неотрицательный));	
	
	Для каждого тзСтрока Из тзДанныеТЧТовары Цикл
		
		ДобСтрока = ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока);
		
	КонецЦикла; 
	
	Запрос.УстановитьПараметр("тзДанныеТЧТовары", ТЧТовары);    
	Запрос.УстановитьПараметр("МоментДокумента", ?(ЗначениеЗаполнено(ДокСсылка), ДокСсылка.МоментВремени(), Неопределено));
	
	ОстаткиПартий = Запрос.Выполнить().Выгрузить();  
	ТаблицаРаспределения = Запрос.МенеджерВременныхТаблиц.Таблицы["ВТ_Товары"].ПолучитьДанные().Выгрузить();
	
	ДокОбъект.Товары.Очистить(); 
	
	ТЧТовары = Новый ТаблицаЗначений;    
	ТЧТовары.Колонки.Добавить("Номенклатура");
	ТЧТовары.Колонки.Добавить("НоменклатураКодМДМ", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТЧТовары.Колонки.Добавить("КодСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(5, 0, ДопустимыйЗнак.Неотрицательный));
	ТЧТовары.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));	
	
	Для Каждого СтрокаТовара из ТаблицаРаспределения Цикл 
		
		СтруктураОтбора 	= Новый Структура("Номенклатура", СтрокаТовара.Номенклатура);
		МассивСтрокПартий 	= ОстаткиПартий.НайтиСтроки(СтруктураОтбора); 
		
		Распределить = СтрокаТовара.Количество;
		
		Для каждого СтрокаПартия из МассивСтрокПартий Цикл                      
			
			Если Распределить <= 0 Тогда 
				Прервать;
			КонецЕсли;    
			
			Если СтрокаПартия.КоличествоОстаток <= 0 Тогда 
				Продолжить;
			КонецЕсли;	
			
			МожноРаспределить 	= Мин(Распределить, СтрокаПартия.КоличествоОстаток);
			
			НоваяСтрока = ДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура 		= СтрокаТовара.Номенклатура; 
			НоваяСтрока.ЕдиницаИзмерения    = СтрокаТовара.ЕдиницаИзмерения;  
			НоваяСтрока.ЕдиницаИзмеренияМест = СтрокаТовара.ЕдиницаИзмерения;
			//+Гавриленков В. 18.12.2025 #UT10-5598
			//НоваяСтрока.СтавкаНДС           = СтрокаТовара.СтавкаНДС;
			НоваяСтрока.СтавкаНДС           = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтрокаТовара.Номенклатура, ?(ЗначениеЗаполнено(ДокСсылка), ДокСсылка.Дата, Неопределено));
			//-Гавриленков В. 18.12.2025 #UT10-5598
			НоваяСтрока.Коэффициент         = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;
			НоваяСтрока.СерияНоменклатуры 	= СтрокаПартия.СерияНоменклатуры;
			НоваяСтрока.Количество 			= МожноРаспределить;     
			НоваяСтрока.КоличествоМест		= МожноРаспределить;
			НоваяСтрока.Цена 				= СтрокаТовара.Цена;
			НоваяСтрока.Сумма 				= СтрокаТовара.Цена * МожноРаспределить;        
			НоваяСтрока.КлючСтроки          = СтрокаПартия.КлючСтроки;
			НоваяСтрока.Размещение 			= СкладГруппа;
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокОбъект);

			ДобСтрока = ТЧТовары.Добавить();     
			ДобСтрока.Номенклатура = СтрокаТовара.Номенклатура;     
			ДобСтрока.НоменклатураКодМДМ = СтрокаТовара.НоменклатураКодМДМ;     
			ДобСтрока.Количество = МожноРаспределить;
			ДобСтрока.КодСтроки = СтрокаТовара.КлючСтроки;
			
			Распределить = Распределить - МожноРаспределить; 
			
			СтрокаПартия.КоличествоОстаток = СтрокаПартия.КоличествоОстаток - МожноРаспределить;
			
		КонецЦикла;      
			
		//+Шульман А. 21.02.2025 #UT10-5103  
		// Количество, превышающее остаток, заносится в док.Заказ
		Если Распределить > 0 Тогда
			
			НоваяСтрока = ДокОбъект.Товары.Добавить();
			НоваяСтрока.Номенклатура 		= СтрокаТовара.Номенклатура; 
			НоваяСтрока.ЕдиницаИзмерения    = СтрокаТовара.ЕдиницаИзмерения;  
			НоваяСтрока.ЕдиницаИзмеренияМест = СтрокаТовара.ЕдиницаИзмерения;
			//+Гавриленков В. 18.12.2025 #UT10-5598
			//НоваяСтрока.СтавкаНДС           = СтрокаТовара.СтавкаНДС;
			НоваяСтрока.СтавкаНДС           = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтрокаТовара.Номенклатура, ?(ЗначениеЗаполнено(ДокСсылка), ДокСсылка.Дата, Неопределено));
			//-Гавриленков В. 18.12.2025 #UT10-5598
			НоваяСтрока.Коэффициент         = СтрокаТовара.ЕдиницаИзмерения.Коэффициент;   
			НоваяСтрока.Количество 			= Распределить;     
			НоваяСтрока.КоличествоМест		= Распределить;
			НоваяСтрока.Цена 				= СтрокаТовара.Цена;
			НоваяСтрока.Сумма 				= СтрокаТовара.Цена * Распределить;        
			НоваяСтрока.Размещение 			= "";
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НоваяСтрока, ДокОбъект);
			
			ДобСтрока = ТЧТовары.Добавить();          
			ДобСтрока.Номенклатура = СтрокаТовара.Номенклатура;     
			ДобСтрока.НоменклатураКодМДМ = СтрокаТовара.НоменклатураКодМДМ;     
			ДобСтрока.Количество = Распределить;
			ДобСтрока.КодСтроки = СтрокаТовара.КлючСтроки;
			
		КонецЕсли;
		//-Шульман А. 21.02.2025 #UT10-5103
		
	КонецЦикла;	       
	
	//+Шульман А. 21.02.2025 #UT10-5103
	ТЧТовары.Свернуть("Номенклатура, НоменклатураКодМДМ, КодСтроки", "Количество");
	//-Шульман А. 21.02.2025 #UT10-5103
	
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		
		Результат.Создан = Ложь;
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Возврат Результат;
		
	КонецПопытки;
	
	Если ДокОбъект.Товары.Количество() Тогда
		
		Попытка
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);  
			Результат.Проведен = Истина;  
			
		Исключение
			Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	Иначе
		
		Попытка

			ДокОбъект.УстановитьПометкуУдаления(Истина);
			Результат.ПомеченНаУдаление = Истина;   
			Результат.Проведен = Истина;
		
		Исключение
			Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЕсли;   
	
	//+Шульман А. 21.02.2025 #UT10-5103   
	// Создается сборка    
	Если ДокОбъект.Проведен Тогда
	
		ТекстОшибкиСборка = "";
		ОтказСборка  = Ложь;
		
		МассивСборок = Документы.СборкаЗаказовПокупателя.СоздатьСборкиПоЗаказуПокупателя(ДокОбъект.Ссылка, ТекстОшибкиСборка, ОтказСборка);
		
		// Заполняется корректировка ЗП с учетом сборок        
		Если Не ОтказСборка Тогда        
			
			ТекстОшибкиКорректировка = "";    
			ОтказКорректировка = Ложь;    
			ДокКорректировка = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();

			Документы.КорректировкаЗаказаПокупателя.ЗаполнитьКорректировкуЗаказовПокупателяСУчетомСборки(ДокОбъект, ДокКорректировка, МассивСборок, ТекстОшибкиКорректировка, ОтказКорректировка);
			
			Если Не ПустаяСтрока(ТекстОшибкиКорректировка) Тогда
				Результат.ТекстОшибки = ТекстОшибкиКорректировка;    
			Иначе
				
				// Изменить количество в ТЧТовары в связи с корректировкой
				тзКорр = ДокКорректировка.Товары.Выгрузить();
				тзКорр.Свернуть("Номенклатура", "Количество");
				
				Для каждого тзСтрока Из тзКорр Цикл
					
					МассивСтрок = ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура", тзСтрока.Номенклатура));  
					
					Для каждого тзСтрокаТЧ Из МассивСтрок Цикл              
						
						НовоеКоличество = тзСтрокаТЧ.Количество + тзСтрока.Количество;
						тзСтрокаТЧ.Количество = НовоеКоличество;         
						тзСтрока.Количество = тзСтрока.Количество + НовоеКоличество;
					
					КонецЦикла;
				
				КонецЦикла;  
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;                 
	
	ТЧТовары.Колонки.Удалить("Номенклатура");
	//-Шульман А. 21.02.2025 #UT10-5103
	
	Результат.ГУИДЗаказа = Строка(ДокОбъект.Ссылка.УникальныйИдентификатор());
	Результат.НомерЗаказа = ДокОбъект.Номер;             
	
	Результат.ДанныеТЧТовары = МодульРегламентныхЗаданий.ТаблицуВМассив(ТЧТовары);
	
	Результат.Результат = Истина;
	
	Возврат Результат;
	//-Шульман А. 21.01.2025 #UT10-5059

КонецФункции

/////////////////Вспомогательные процедуры//////////////////
Функция ТаблицуВМассив(Таблица)
	
	МассивДанных = Новый Массив;
	
	Для Каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для Каждого Колонка ИЗ Таблица.Колонки Цикл
			
			Если ЭтоСсылка(ТекСтрока[Колонка.Имя]) Тогда
				
				Если Колонка.Имя = "Номенклатура" ИЛИ Колонка.Имя = "Ссылка" Тогда
					СтруктураДанных.Вставить(Колонка.Имя, ?(ТекСтрока[Колонка.Имя] = NULL, "", Строка(ТекСтрока[Колонка.Имя].УникальныйИдентификатор())));
				Иначе
					СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
				КонецЕсли;
				
			Иначе
				СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивДанных;
	
КонецФункции

Функция ЭтоСсылка(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") 
	 ИЛИ ТипЗнч(Значение) = Тип("Булево") ИЛИ ТипЗнч(Значение) = Тип("Структура") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ХранилищеJSONВСтруктуру(Данные)Экспорт
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

Функция ДанныеВJSONХранилище(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

Функция ДвоичноеВДесятичное(Знач Стр2) Экспорт
	
	Стр = СокрЛП(Стр2);
	Рез = 0;
	
	Для Н = 1 по СтрДлина(Стр) Цикл
		Рез = Рез * 2 + Число(Сред(Стр, Н, 1));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции   

Функция ЗначениеДопСвойства(СсылкаНаОбъект, Свойство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект,
	               |	ЗначенияСвойствОбъектов.Свойство,
	               |	ЗначенияСвойствОбъектов.Значение
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Объект = &СсылкаНаОбъект
	               |	И ЗначенияСвойствОбъектов.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Свойство", Свойство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Значение;
		
	КонецЕсли;
	
КонецФункции

Функция УстановитьЗначениеДопСвойства(СсылкаНаОбъект, Свойство, Значение) Экспорт
	
	ЗаменаЗначения = Ложь;
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.Свойство.Установить(Свойство);
	
	УстановитьПривилегированныйРежим(Истина);	
	НаборЗаписей.Прочитать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		ЗаписьРегистра = НаборЗаписей.Добавить();
		ЗаписьРегистра.Объект = СсылкаНаОбъект;
		ЗаписьРегистра.Свойство = Свойство;
		
	Иначе
		
		ЗаписьРегистра = НаборЗаписей[0];
		ЗаменаЗначения = Истина;
		
	КонецЕсли;
	
	ЗаписьРегистра.Значение = Значение;
	УстановитьПривилегированныйРежим(Истина);	
	НаборЗаписей.Записать();
	УстановитьПривилегированныйРежим(Ложь); 
	
	//+Белов А. 07.05.2025 #UT10-5225
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		И Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки 
		И Значение = Перечисления.СтатусыПриемки.Завершено Тогда
		
		НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект);
		НаборЗаписей.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.ДатаИВремяЗакрытия);
		
		УстановитьПривилегированныйРежим(Истина);	
		НаборЗаписей.Прочитать();
		УстановитьПривилегированныйРежим(Ложь); 
		
		Если НаборЗаписей.Количество() = 0 Тогда
			
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Объект = СсылкаНаОбъект;
			ЗаписьРегистра.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ДатаИВремяЗакрытия;  
			ЗаписьРегистра.Значение = ТекущаяДата();
			
			УстановитьПривилегированныйРежим(Истина);	
			НаборЗаписей.Записать();
			УстановитьПривилегированныйРежим(Ложь); 
			
		КонецЕсли;     
						
	КонецЕсли;	
	//-Белов А. 07.05.2025 #UT10-5225
	
	Возврат ЗаменаЗначения;
	
КонецФункции

Функция ПолучитьОписаниеПараметровВэбСервиса(ПромПараметры) Экспорт

	СтрокаПараметровВэбСервиса = "";
	
	Попытка
		
		Если НЕ ПромПараметры.Свойства().Получить("Lines") = Неопределено ИЛИ НЕ ПромПараметры.Свойства().Получить("ROW") = Неопределено Тогда
			
			Если НЕ ПромПараметры.Свойства().Получить("Lines") = Неопределено  Тогда
				ПромСписок = ПромПараметры.ПолучитьСписок("Lines");
			Иначе
				ПромСписок = ПромПараметры.ПолучитьСписок("ROW");
			КонецЕсли;
			
			Для Каждого СтрокаСписка Из ПромСписок Цикл
				
				Для Каждого ПромСвойствоСтроки Из СтрокаСписка.Свойства() Цикл 
					СтрокаПараметровВэбСервиса = СтрокаПараметровВэбСервиса + """" + ПромСвойствоСтроки.Имя + ": """ + СтрокаСписка.Получить(ПромСвойствоСтроки) + ";"; 
				КонецЦикла;
				
				СтрокаПараметровВэбСервиса = СтрокаПараметровВэбСервиса+Символы.ПС;
				
			КонецЦикла;		
			
		Иначе		
			
			Для Каждого ПромСвойство Из ПромПараметры.Свойства() Цикл 
				СтрокаПараметровВэбСервиса = СтрокаПараметровВэбСервиса + """" + ПромСвойство.Имя + ": """ + ПромПараметры.Получить(ПромСвойство) + ";";
			КонецЦикла;  
			
		КонецЕсли;   
		
	Исключение  
	КонецПопытки;
	
	Возврат СтрокаПараметровВэбСервиса;

КонецФункции

Функция ОбработатьНеподдерживаемоеСвойствоJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат "";
	
КонецФункции

Процедура ЗаписатьJSONLines(Данные , ПутьКФайлу , Заголовок) Экспорт 
	//+Кабанов А.В. 19.03.2025 # UT10-5139	
	
	// Создаем объект записи текстового файла
	Запись              = Новый ЗаписьТекста(ПутьКФайлу, КодировкаТекста.UTF8);
	ЗаписьJSON          = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет,,Истина);
	
	Если ЗначениеЗаполнено(Заголовок) Тогда  
		
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON, Заголовок);
		JSONСтрока = ЗаписьJSON.Закрыть();	
		Запись.ЗаписатьСтроку(JSONСтрока);
		
	КонецЕсли;  
	
	Попытка
		
		// Для каждой записи в массиве данных
		Для Каждого Строка Из Данные Цикл
			// Записываем каждый объект как отдельную JSON строку
			ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
			
			// Создаем строку в памяти
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
			
			// Записываем объект в JSON
			ЗаписатьJSON(ЗаписьJSON, Строка);
			
			// Получаем строку JSON и записываем в файл
			JSONСтрока = ЗаписьJSON.Закрыть();
			Запись.ЗаписатьСтроку(JSONСтрока); 
			
		КонецЦикла;
		
	Исключение
		
		Запись.Закрыть();
		ВызватьИсключение; 
		
	КонецПопытки;
	
	Запись.Закрыть();
	
	//-Кабанов А.В. 19.03.2025 # UT10-5139	
КонецПроцедуры  

Процедура ЗаписатьТабличнуюЧастьВJSONLines(Объект , ИмяТЧ , ПутьКФайлу , Заголовок) Экспорт 
	//+Кабанов А.В. 19.03.2025 # UT10-5139	

    // Создаем объект записи текстового файла
    Запись              = Новый ЗаписьТекста(ПутьКФайлу , КодировкаТекста.UTF8);
    ЗаписьJSON          = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет , , Истина);
	
	Если ЗначениеЗаполнено(Заголовок) Тогда  
		
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON , Заголовок);
		JSONСтрока = ЗаписьJSON.Закрыть();	
		Запись.ЗаписатьСтроку(JSONСтрока);
		
	КонецЕсли;	

    Попытка
		
		// Перебираем строки табличной части
        Для Каждого СтрокаТЧ Из Объект[ИмяТЧ] Цикл
			
			// Создаем структуру для текущей строки
            СтруктураСтроки = Новый Структура;
            
            // Заполняем структуру значениями из строки табличной части
            Для Каждого Колонка Из Объект[ИмяТЧ].Выгрузить().Колонки Цикл
                СтруктураСтроки.Вставить(Колонка.Имя , СтрокаТЧ[Колонка.Имя]);
            КонецЦикла;
            
            // Записываем структуру в JSON и сразу в файл
            ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
            ЗаписатьJSON(ЗаписьJSON , СтруктураСтроки , , "ОбработатьНеподдерживаемоеСвойствоJSON" , ОбщегоНазначения);
            JSONСтрока = ЗаписьJSON.Закрыть();
            
            // Записываем строку в файл
            Запись.ЗаписатьСтроку(JSONСтрока); 
			
        КонецЦикла;
        
    Исключение
		
		Запись.Закрыть();
        ВызватьИсключение;
		
	КонецПопытки;
    
    Запись.Закрыть();

	//-Кабанов А.В. 19.03.2025 # UT10-5139	
КонецПроцедуры

Процедура ЗаписатьРезультатЗапросаВJSONLines(Результат , ПутьКФайлу , Заголовок) Экспорт 
	//+Кабанов А.В. 19.03.2025 # UT10-5139	

    // Создаем объект записи текстового файла
    Запись              = Новый ЗаписьТекста(ПутьКФайлу , КодировкаТекста.UTF8);
    ЗаписьJSON          = Новый ЗаписьJSON;
    ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет , , Истина);
	
	Если ЗначениеЗаполнено(Заголовок) Тогда  
		
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписатьJSON(ЗаписьJSON , Заголовок);
		JSONСтрока = ЗаписьJSON.Закрыть();	
		Запись.ЗаписатьСтроку(JSONСтрока);
		
	КонецЕсли;	
	 
	Попытка  
		
        Выборка = Результат.Выбрать();
        
        // Перебираем результаты запроса
        Пока Выборка.Следующий() Цикл
            // Создаем структуру для текущей строки
            СтруктураСтроки = Новый Структура;
            
            // Заполняем структуру значениями из результата запроса
            Для Каждого Колонка Из Результат.Колонки Цикл
                СтруктураСтроки.Вставить(Колонка.Имя , Выборка[Колонка.Имя]);
            КонецЦикла;
            
            // Записываем структуру в JSON и сразу в файл
            ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
            ЗаписатьJSON(ЗаписьJSON , СтруктураСтроки , , "ОбработатьНеподдерживаемоеСвойствоJSON" , ОбщегоНазначения);
            JSONСтрока = ЗаписьJSON.Закрыть();
            
            // Записываем строку в файл
            Запись.ЗаписатьСтроку(JSONСтрока);
			
        КонецЦикла;
        
    Исключение
		
		Запись.Закрыть();
        ВызватьИсключение;
		
    КонецПопытки;
    
    Запись.Закрыть(); 
	
	//-Кабанов А.В. 19.03.2025 # UT10-5139		
КонецПроцедуры
	
	