Функция ПолучитьМаксимальныйНомерПоПорядку(ТекущаяКоробка) Экспорт 
	
	МаксимальныйНомерПоПорядку  = 0;
	
	Если ЗначениеЗаполнено(ТекущаяКоробка) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(ВозвращенныеДокументы.НомерПоПорядку),0) КАК МаксимальныйНомерПоПорядку
		|ИЗ
		|	РегистрСведений.ВозвращенныеДокументы КАК ВозвращенныеДокументы
		|ГДЕ
		|	ВозвращенныеДокументы.Коробка = &Коробка";
		
		Запрос.УстановитьПараметр("Коробка", ТекущаяКоробка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МаксимальныйНомерПоПорядку = ВыборкаДетальныеЗаписи.МаксимальныйНомерПоПорядку;
			Возврат МаксимальныйНомерПоПорядку+1;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МаксимальныйНомерПоПорядку;
	
КонецФункции
