Процедура Печать(Объединение, СразуНаПринтер = Истина, Принтер = "") Экспорт

	Если НЕ Объединение.Проведен Тогда
		
		Сообщить("Документ Объединение ГМ в ТЕ не проведен !");
		Возврат;  
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объединение.Грузополучатель) Тогда   
		ГрузополучательПечать = Объединение.Контрагент;        
	Иначе                                           
		ГрузополучательПечать = Объединение.Грузополучатель;  
	КонецЕсли;          
	
	КодМаршрута = 0;
	
	Если Не ЗначениеЗаполнено(ГрузополучательПечать.МаршрутДоставки) ТОгда 
		МаршрутДоставки = "";          
	Иначе                           
		КодМаршрута = ГрузополучательПечать.МаршрутДоставки.Код; 
	КонецЕсли;
			
	ДокументШтрихКода = Объединение;
	
	ТабличныйДокумент	= Новый ТабличныйДокумент;
	Макет  = ПолучитьМакет("Объединение"); 
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.КодМаршрута	= ?(Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз, "", Число(КодМаршрута));
	ОбластьМакета.Параметры.Номер  = Объединение.Номер;
	ОбластьМакета.Параметры.Дата   = Формат(Объединение.Дата, "ДЛФ=D");
	
	ОбластьМакета.Параметры.Клиент = СокрЛП(ГрузополучательПечать);
	ОбластьМакета.Параметры.ДатаДоставки = Объединение.ДатаДоставкиКлиенту;
	
	Если Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
		ПечСпособДоставки = "Самовывоз";	
	Иначе 
		ПечСпособДоставки = СокрЛП(ГрузополучательПечать.МаршрутДоставки); 
	КонецЕсли; 
	
	ОбластьМакета.Параметры.МаршрутДоставки = ПечСпособДоставки; 
	
	ОбластьМакета.Параметры.Код  = СтрЗаменить(Строка(ГрузополучательПечать.Код), Символы.НПП, ""); 
	
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДокументШтрихКода); 
	
	ТабличныйДокумент.Вывести(ОбластьМакета);        
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	
	Сч = 0;
	
	Для каждого Стр Из Объединение.ТранспортныеЕдиницы Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ГрузовоеМесто) Тогда
			Продолжить;	
		КонецЕсли;     
		
		Сч = Сч + 1;
		
		ОбластьМакета.Параметры.Сч = Сч;
		ОбластьМакета.Параметры.ГрузовоеМесто = "ГМ" + Стр.ГрузовоеМесто.Номер;
		ОбластьМакета.Параметры.КодГрузовогоМеста = Документы.ГрузовоеМесто.ПолучитьШтрихкодГрузоместа(Стр.ГрузовоеМесто);  
		ОбластьМакета.Параметры.Назначение = Стр.ГрузовоеМесто.Сборка.Назначение;
		
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	
	Если Объединение.СпособДоставки = Перечисления.СпособДоставки.Самовывоз Тогда 
		
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.ШтрихМеста);
		ТабличныйДокумент.Вывести(ОбластьМакета);      
		
	Иначе  
			
		ОбластьМакета.Рисунки.ШтрихМеста.Картинка = ШтрихкодированиеПечатныхФорм.ПолучитьКартинкуШКДляРисунка(ОбластьМакета.Рисунки.ШтрихМеста, "1234567890128", 1, Истина);
		ТабличныйДокумент.Вывести(ОбластьМакета); 
		
		ОбластьМакетаДопСтрока = Макет.ПолучитьОбласть("ПодвалДоставка");
		ТабличныйДокумент.Вывести(ОбластьМакетаДопСтрока);    
		
	КонецЕсли; 

	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); 		
	
	ТабличныйДокумент.ПолеСверху = 0.1;
	ТабличныйДокумент.ПолеСлева = 1;
	ТабличныйДокумент.ПолеСнизу = 0.1;
	ТабличныйДокумент.ПолеСправа = 1;
	
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ИмяПринтера = Принтер;
	
	Если СразуНаПринтер Тогда
		ТабличныйДокумент.Напечатать(); 
	Иначе
		ТабличныйДокумент.Показать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьШтрихкодОбъединение(Объединение) Экспорт
	
	Возврат Формат(Объединение.ДатаШтрихкода, "ДФ=ddMMyyyyЧЧммсс") + "1" + Формат(Число(Объединение.Номер), "ЧЦ=10; ЧВН=; ЧГ=0"); 									
		
КонецФункции

Функция ПолучитьМассивСборокПоОбъединению(Объединение) Экспорт
	
	МассивОбъединений = Новый Массив;
	
	Если ТипЗнч(Объединение) = Тип("ДокументСсылка.ОбъединениеГМВТЕ") Тогда
		МассивОбъединений.Добавить(Объединение);
	Иначе
		МассивОбъединений = Объединение;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка КАК Сборка
	|ИЗ
	|	Документ.ОбъединениеГМВТЕ.ТранспортныеЕдиницы КАК ОбъединениеГМВТЕТранспортныеЕдиницы
	|ГДЕ
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.Ссылка В (&МассивОбъединений)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъединениеГМВТЕТранспортныеЕдиницы.ГрузовоеМесто.Сборка";
	
	Запрос.УстановитьПараметр("МассивОбъединений", МассивОбъединений);  
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сборка");
	
КонецФункции 

Функция ПолучитьМассивСборокПоЗаданиюНаДоставку(ЗаданиеНаДоставку) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки КАК Объединение
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставка.Ссылка = &Ссылка
	|	И ЗаданиеНаДоставкуДоставка.ДокументСборки ССЫЛКА Документ.ОбъединениеГМВТЕ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставка.ДокументСборки";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаданиеНаДоставку);  
	
	МассивОбъединений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объединение");
	
	Возврат Документы.ОбъединениеГМВТЕ.ПолучитьМассивСборокПоОбъединению(МассивОбъединений);	
	
КонецФункции

