
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не МожноЛиОтправлятьДокумент(ПараметрКоманды) Тогда
		Возврат;		
	КонецЕсли;
	
	ДопПараметры = Новый Структура("Документ", ПараметрКоманды);	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВопросаОНеобходимостиОтправки", ЭтотОбъект, ДопПараметры);
	
	//+Макрушин Е. 31.03.2026 #UT11-5849
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	//-Макрушин Е. 31.03.2026 #UT11-5849		
	
		ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите отправить неформализованный документ Т2 в ЭДО",РежимДиалогаВопрос.ДаНет, 60);
		
	//+Макрушин Е. 31.03.2026 #UT11-5849	
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
		ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите отправить документ Торг-2 в ЭДО", РежимДиалогаВопрос.ДаНет, 60);
	КонецЕсли;
	//-Макрушин Е. 31.03.2026 #UT11-5849
	
КонецПроцедуры 

&НаКлиенте
Процедура ОкончаниеВопросаОНеобходимостиОтправки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОтравитьПоЭдо(ДополнительныеПараметры.Документ);		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция МожноЛиОтправлятьДокумент(Документ)  
	
	//+Макрушин Е. 31.03.2026 #UT11-5849
	//Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") 
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
	//-Макрушин Е. 31.03.2026 #UT11-5849
	
		Если Не ЗначениеЗаполнено(Документ.Договор.DS_Подразделение_ID) Тогда
			Сообщить("В договоре у контрагента не заполнен идентификатор для отправки в ЭДО");
			Возврат Ложь;
		КонецЕсли; 
		
		СтруктураВозврат = ЭДО.ПолучитьСтатусДокумента(Документ);
		
		Если ЗначениеЗаполнено(СтруктураВозврат.Статус) И Не ЗначениеЗаполнено(СтруктураВозврат.Ошибка) Тогда
			Сообщить("Документ уже был отправлен в ЭДО");
			Возврат Ложь;
		КонецЕсли;       
		
		//Если Документ.Соглашение.СторонниеСклады Тогда
		//	Сообщить("Соглашение в документе имеет признак Сторонние склады. Такие документы будут отправлены в ЭДО автоматически, их нельзя отправлять вручную!");
		//	Возврат Ложь;	
		//КонецЕсли;
		
		Возврат Истина;
		
	Иначе
		
		Сообщить("Данный документ не предназначен для отправки в ЭДО");
		Возврат Ложь;
		
	КонецЕсли;                                                      
	
	Возврат Ложь;
		
КонецФункции

&НаСервере
Процедура ОтравитьПоЭдо(Документ)
	
	//+Макрушин Е. 31.03.2026 #UT11-5849
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
	//-Макрушин Е. 31.03.2026 #UT11-5849		
	
		ЭДО.ОтправитьНеформализованныйДокументПоЭдо(Документ);
		
	//+Макрушин Е. 31.03.2026 #UT11-5849	
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.АктОРасхожденияхПослеПриемки") Тогда
		ЭДО.ОтправитьФормализованныйДокументПоЭдо(Документ);
	КонецЕсли;
	//-Макрушин Е. 31.03.2026 #UT11-5849

	СтруктураВозврат = ЭДО.ПолучитьСтатусДокумента(Документ);
	
	Если ЗначениеЗаполнено(СтруктураВозврат.Статус) Тогда  
		
		Если НЕ ЗначениеЗаполнено(СтруктураВозврат.Ошибка) Тогда
			Сообщить("Документ был успешно отправлен в ЭДО");  	
		Иначе
			Сообщить("Возникли ошибки при отправке в ЭДО: " + Символы.ПС + СтруктураВозврат.Ошибка);
		КонецЕсли;
		
	Иначе
		
		Сообщить("Документ не был отправлен в ЭДО. Обратитесь к администратор!");
		
	КонецЕсли;
		
КонецПроцедуры

