
Процедура РегламентноеВыполнение() Экспорт 
	ПроверитьЭтапЭкспертизы();
КонецПроцедуры

Процедура ПроверитьЭтапЭкспертизы() Экспорт

	ЗапросЗаявокНаВозврат = Новый Запрос;
	ЗапросЗаявокНаВозврат.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкаНаВозвратТовары.Ссылка КАК ЗаявкаНаВозврат
	|ИЗ
	|	Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|ГДЕ
	|	ЗаявкаНаВозвратТовары.Ссылка.Проведен
	|	И ЗаявкаНаВозвратТовары.Тип = ""Рекламация""
	|	И ЗаявкаНаВозвратТовары.Ссылка.Статус = ""На экспертизе""
	//|	И НЕ ЗаявкаНаВозвратТовары.Ссылка.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.Подготовка)
	|	И НЕ ЗаявкаНаВозвратТовары.Ссылка.ЭтапЭкспертизы = ЗНАЧЕНИЕ(Перечисление.ЭтапыЭкспретизы.ПустаяСсылка)";
	
	РезультатЗапросаЗаявокНаВозврат = ЗапросЗаявокНаВозврат.Выполнить();
	
	Если НЕ РезультатЗапросаЗаявокНаВозврат.Пустой() Тогда
		
		ВыборкаЗаявокНаВозврат = РезультатЗапросаЗаявокНаВозврат.Выбрать();
		
		ТаблицаСсылок = Новый ТаблицаЗначений;
		ТаблицаСсылок.Колонки.Добавить("ГУИДЗаявкиНаВозврат");
		ТаблицаСсылок.Колонки.Добавить("ЭтапЭкспертизы");
		
		Пока ВыборкаЗаявокНаВозврат.Следующий() Цикл
			
			НоваяСтрокаТаблицы = ТаблицаСсылок.Добавить();
			НоваяСтрокаТаблицы.ГУИДЗаявкиНаВозврат = СокрЛП(ВыборкаЗаявокНаВозврат.ЗаявкаНаВозврат.УникальныйИдентификатор());
			
		КонецЦикла;
		
		Если НЕ ТаблицаСсылок.Количество() = 0 Тогда
			
			Результат = МСКWEB.ПолучитьЭтапыЭкспертизы(ТаблицаСсылок);
			
			Если Результат.Загружен Тогда 
				
				СписокДанных = Результат.СписокДанных;
				
				Для Каждого СтрокаСпискаДанных Из СписокДанных Цикл
					
					Если ЗначениеЗаполнено(СтрокаСпискаДанных.ЭтапЭкспертизы) Тогда
						
						ЕстьЭтапЭкспертизы = Перечисления.ЭтапыЭкспретизы[СтрокаСпискаДанных.ЭтапЭкспертизы]; 
						
						Если НЕ ЕстьЭтапЭкспертизы.Пустая() Тогда
							
							ДокументЗаявкаНаВозврат = Документы.ЗаявкаНаВозврат.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаСпискаДанных.ГУИДЗаявкиНаВозврат));
							
							Если НЕ ДокументЗаявкаНаВозврат.Пустая() И НЕ ДокументЗаявкаНаВозврат.ЭтапЭкспертизы = ЕстьЭтапЭкспертизы Тогда
								
								ОбъектЗаявкаНаВозврат = ДокументЗаявкаНаВозврат.ПолучитьОбъект();
								ОбъектЗаявкаНаВозврат.ЭтапЭкспертизы = ЕстьЭтапЭкспертизы;
								ОбъектЗаявкаНаВозврат.ДатаИзмененияЭтапаЭкспертизы = ТекущаяДата();
								
								Попытка
									ОбъектЗаявкаНаВозврат.Записать();
								Исключение
								КонецПопытки;
								
							КонецЕсли;
							
						КонецЕсли;						
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
