
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособИзготовления, СпособВводаВОборот");
	
	Заголовок = "Укажите реквизиты шапки документа";
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Заголовок = "Укажите реквизиты табличной части товары документа";

	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, GTIN, Количество ");

	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);

	Если Товары.Количество() = 0  Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Не заполнена табличная часть товары");
		Отказ = ИСТИНА;
		
	//+Марков И. 18.09.2025 #UT10-5427	
	ИначеЕсли Статус = Перечисления.СтатусыМаркировкиТоваров.ЗаказНаЭмиссию И Товары.Итог("КоличествоФакт") = 0 Тогда
		Статус = Перечисления.СтатусыМаркировкиТоваров.Завершен;	
	КонецЕсли;
	//-Марков И. 18.09.2025 #UT10-5427
	
	//+Кабанов А.В. 24.07.2025 # UT10-5343
	ЕстьРасхождения = НЕ Товары.Итог("КоличествоИзлишки") = 0;
	//-Кабанов А.В. 24.07.2025 # UT10-5343             
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Проведен Тогда 
		
		НаборОстаткиТоваров = РегистрыНакопления.ТоварыВРезервеНаСкладах.СоздатьНаборЗаписей();
		НаборОстаткиТоваров.Отбор.Регистратор.Установить(Ссылка);
		НаборОстаткиТоваров.Записать(); 
		
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Статус = Перечисления.СтатусыМаркировкиТоваров.ЗаказНаЭмиссию Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Ссылка
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗ
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Основание = &Основание
		|	И ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Проведен";
		
		Запрос.УстановитьПараметр("Основание", ЭтотОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			ДанныеЗаполнения = ЭтотОбъект;
			НовыйДокументЗНЭ = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.СоздатьДокумент();	
			НовыйДокументЗНЭ.Основание = ЭтотОбъект.Ссылка;
			ЗаполнитьЗначенияСвойств(НовыйДокументЗНЭ,ДанныеЗаполнения);
			НовыйДокументЗНЭ.Номер = "";
			НовыйДокументЗНЭ.Дата = ТекущаяДата();                               
			НовыйДокументЗНЭ.Статус = Перечисления.СтатусыЗаказаНаМаркировку.Отправлен;
			
			Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл   
				
				//+Марков И. 18.09.2025 #UT10-5427
				Если Не ЗначениеЗаполнено(СтрокаТовары.КоличествоФакт) Тогда
					Продолжить;										
				КонецЕсли;
				//-Марков И. 18.09.2025 #UT10-5427
				
				НоваяСтрокаТовары = НовыйДокументЗНЭ.Товары.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаТовары); 
				НоваяСтрокаТовары.Количество = СтрокаТовары.КоличествоФакт;
				
			КонецЦикла;
			
			НовыйДокументЗНЭ.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЕсли;    
	
	//+Кабанов А.В. 23.07.2025 # UT10-5343
	Если Статус = Перечисления.СтатусыМаркировкиТоваров.Перемещение Тогда

		мОсновнойСклад       = Константы.ОсновнойСклад.Получить(); 
		МассивНоменклатуры   = Товары.ВыгрузитьКолонку("Номенклатура");
		МассивСклады         = Новый Массив;
		МассивСклады.Добавить(мОсновнойСклад);
		
		ТаблицаСерий         = УправлениеЗапасами.ПолучитьТаблицуСвободныхОстатковПоСериям(МассивСклады, Организация, МассивНоменклатуры);
		
		НаборДвижений = Движения.ТоварыВРезервеНаСкладах;
		НаборДвижений.Записывать = Истина;
		
		мТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
		//+Кабанов А.В. 27.08.2025 # UT10-5395
		мТаблицаДвижений.Очистить();
		//-Кабанов А.В. 27.08.2025 # UT10-5395
		
		Для Каждого СтрокаТовары Из Товары Цикл 
			
			КолСписать = СтрокаТовары.Количество;
			
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("Номенклатура" , СтрокаТовары.Номенклатура);
			СтруктураОтбора.Вставить("Склад"        , мОсновнойСклад);
			
			НайденныеСтроки           = ТаблицаСерий.НайтиСтроки(СтруктураОтбора);
			
			КоличествоНераспределено  = СтрокаТовары.Количество;
			
			
			Для Каждого СтрокаОстаток Из НайденныеСтроки Цикл
				
				Если КоличествоНераспределено <= 0 Тогда
					Продолжить;
				КонецЕсли;	
				
				Если СтрокаОстаток.Остаток <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				КоличествоКСписанию = Мин(КоличествоНераспределено, СтрокаОстаток.Остаток);
				
				Если КоличествоКСписанию <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДвижений = мТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений,СтрокаТовары); 
				
                СтрокаДвижений.СерияНоменклатуры = СтрокаОстаток.СерияНоменклатуры; 
				СтрокаДвижений.Количество        = КоличествоКСписанию;
				
				КоличествоНераспределено = КоличествоНераспределено - КоличествоКСписанию;
				
			КонецЦикла;		
			
		КонецЦикла;
		
		СтруктТаблицДокумента = Новый Структура;
		СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", мТаблицаДвижений);
		
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
		
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "ДокументРезерва", Ссылка);
		ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", мОсновнойСклад, "ТаблицаПоТоварам");
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		
	КонецЕсли;	
	//-Кабанов А.В. 23.07.2025 # UT10-5343
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//+Кабанов А.В. 24.07.2025 # UT10-5343
	Дата          = ТекущаяДата();
	Кладовщик     = Справочники.ФизическиеЛица.ПустаяСсылка(); 
	Ответственный = глЗначениеПеременной("глТекущийПользователь");
	Комментарий   = "";
	Заказано.Очистить();

	Для Каждого СтрокаТовары Из Товары Цикл
		
		СтрокаТовары.КоличествоФакт    = 0 ;
		СтрокаТовары.КоличествоИзлишки = 0 ;
		
	КонецЦикла;	
	//-Кабанов А.В. 24.07.2025 # UT10-5343	
КонецПроцедуры
