
&НаКлиенте
Процедура ПутьККаталогуХраненияНачалоВыбора(Элемент = Неопределено, ДанныеВыбора = Неопределено, СтандартнаяОбработка = Неопределено)
	СтандартнаяОбработка = Ложь;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДиалогВыбора.Выбрать() Тогда
		ПутьККаталогуХранения = ДиалогВыбора.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаДанных = ОбработкаОбъект.ПолучитьСписокДоступныхМодулей();
	ТаблицаОбновлений.Загрузить(ТаблицаДанных);
КонецПроцедуры

&НаСервере
Функция ТаблицаОбновленийВыборНаСервере(ХешСумма)
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьНовуюВерсиюМодуля(ХешСумма);
КонецФункции

&НаКлиенте
Процедура ТаблицаОбновленийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОписаниеОповещения = Новый ОписаниеОповещения("ТаблицаОбновленийВыборПодтверждение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, "Вы уверены, что хотите сохранить эту версию?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры
&НаКлиенте
Процедура ТаблицаОбновленийВыборПодтверждение(Ответ, ДопПараметры) Экспорт
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Попытка
			ДвоичныеДанные = ТаблицаОбновленийВыборНаСервере(Элементы.ТаблицаОбновлений.ТекущиеДанные.ХешСумма);
		Исключение КонецПопытки;
		Если НЕ ЗначениеЗаполнено(ПутьККаталогуХранения) Тогда
			ПутьККаталогуХраненияНачалоВыбора();
		КонецЕсли;
		Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
			ИмяФайла = Элементы.ТаблицаОбновлений.ТекущиеДанные.ИмяВерсии + ".epf";
			ДвоичныеДанные.Записать(ПутьККаталогуХранения + "\" + ИмяФайла);
			Закрыть();
		КонецЕсли;
	КонецЕсли;		
КонецПроцедуры
