Функция КомплектПечатныхФорм(МассивСсылок) Экспорт
	
	Если ТипЗнч(МассивСсылок) = Тип("Массив") Тогда
		ТекДок = МассивСсылок[0].ПолучитьОбъект();
	Иначе
		ТекДок = МассивСсылок.ПолучитьОбъект();
	КонецЕсли;	
	
	СтруктураВнутреннихПечатныхФорм = ТекДок.ПолучитьСтруктуруПечатныхФорм();
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.ПодготовитьКомплектПечатныхФорм();	
	
	Для Каждого лПечатнаяФорма Из СтруктураВнутреннихПечатныхФорм Цикл
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, лПечатнаяФорма.Ключ, лПечатнаяФорма.Значение, 0);	
	КонецЦикла;
	
	Возврат КомплектПечатныхФорм;
	
КонецФункции