Процедура ОтправкаПисем() Экспорт 
	
	УчетнаяЗапись = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
	
	Если Константы.НеОтправлятьПочту.Получить() ИЛИ НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗапись);
	
	Почта = Новый ИнтернетПочта; 
	
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Возврат;  
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(КатегорииОбъектов.Объект КАК Справочник.ФизическиеЛица) КАК ФизЛицо
	|ПОМЕСТИТЬ ФизЛица
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьОтчетОТоварахБезЦены)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФизЛица.ФизЛицо,
	|	КонтактнаяИнформация.Представление КАК ЭлАдрес
	|ИЗ
	|	ФизЛица КАК ФизЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ФизЛица.ФизЛицо = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailРабочийФизическогоЛица))";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПолучателейПисьма = Запрос.Выполнить().Выгрузить();

	Макет = ПолучитьМакет("Письмо");
	ТабДок = Новый ТабличныйДокумент;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Константы.БазоваяЦена КАК ТипЦен
	|ПОМЕСТИТЬ ТипыЦен
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка35
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка36
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка37
	|ИЗ
	|	Константы КАК Константы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Константы.Скидка38
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад,
	|	ТипыЦен.ТипЦен,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
	|ПОМЕСТИТЬ Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекущаяДата, Склад = &ОсновнойСклад) КАК ТоварыНаСкладахОстатки,
	|	ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.Номенклатура.Артикул КАК Артикул,
	|	Остатки.Номенклатура.Родитель КАК Производитель,
	|	Остатки.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	Остатки.Склад,
	|	Остатки.Количество,
	|	Остатки.ТипЦен,
	|	Остатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТоварыБезЦен
	|ИЗ
	|	Остатки КАК Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|				&ТекущаяДата,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							Остатки.Номенклатура
	|						ИЗ
	|							Остатки)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ТипыЦен.ТипЦен
	|						ИЗ
	|							ТипыЦен)) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО Остатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И Остатки.ТипЦен = ЦеныНоменклатурыСрезПоследних.ТипЦен
	|ГДЕ
	|	ЦеныНоменклатурыСрезПоследних.Цена ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыБезЦен.Склад КАК Склад,
	|	ТоварыБезЦен.Количество КАК Количество,
	|	ТоварыБезЦен.ТипЦен.Наименование КАК ТипЦен,
	|	ТоварыБезЦен.Номенклатура КАК Номенклатура,
	|	ТоварыБезЦен.Номенклатура.Артикул КАК Артикул,
	|	ТоварыБезЦен.Номенклатура.Родитель КАК Производитель,
	|	ТоварыБезЦен.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	ЕСТЬNULL(ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена, 0) КАК Цена
	|ИЗ
	|	ТоварыБезЦен КАК ТоварыБезЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	|				&ТекущаяДата,
	|				Номенклатура В
	|						(ВЫБРАТЬ
	|							ТоварыБезЦен.Номенклатура
	|						ИЗ
	|							ТоварыБезЦен)
	|					И ТипЦен В
	|						(ВЫБРАТЬ
	|							ТипыЦен.ТипЦен
	|						ИЗ
	|							ТипыЦен)) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|		ПО ТоварыБезЦен.Номенклатура = ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура
	|			И ТоварыБезЦен.ТипЦен = ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(Количество)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ОсновнойСклад", Константы.ОсновнойСклад.Получить());
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.БазоваяЦена = "Существует";
		ОбластьМакета.Параметры.Скидка35 ="Существует";
		ОбластьМакета.Параметры.Скидка36 = "Существует";
		ОбластьМакета.Параметры.Скидка37 = "Существует";
		ОбластьМакета.Параметры.Скидка38 = "Существует";
		
		Выборка2 = Выборка.Выбрать();
		
		Пока Выборка2.Следующий() Цикл
			
			Если Выборка2.ТипЦен = "Базовая цена" Тогда
				ОбластьМакета.Параметры.БазоваяЦена = "Пусто";
			ИначеЕсли Выборка2.ТипЦен = "35% скидка" Тогда
				ОбластьМакета.Параметры.Скидка35 ="Пусто";
			ИначеЕсли Выборка2.ТипЦен = "36% cкидка" Тогда
				ОбластьМакета.Параметры.Скидка36 = "Пусто";
			ИначеЕсли Выборка2.ТипЦен = "37% cкидка" Тогда
				ОбластьМакета.Параметры.Скидка37 = "Пусто";
			ИначеЕсли Выборка2.ТипЦен = "38% cкидка" Тогда
				ОбластьМакета.Параметры.Скидка38 = "Пусто";
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
	
	ИмяВременногоКаталога = СокрЛП(Новый УникальныйИдентификатор);
	СоздатьКаталог(КаталогВременныхФайлов() + ИмяВременногоКаталога);
	ВременныйКаталог = КаталогВременныхФайлов() + ИмяВременногоКаталога + "\";
	ТабДок.Записать(ВременныйКаталог + "ТоварыБезЦен.XLSX", ТипФайлаТабличногоДокумента.XLSX);

	Для Каждого ТекСтр Из ТаблицаПолучателейПисьма Цикл
			
		Сообщение = Новый ИнтернетПочтовоеСообщение;
		Сообщение.Тема = "Товары без цен!";
		
		МылоКонтрагента = ТекСтр.ЭлАдрес ;
					
		МассивАдресов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(МылоКонтрагента, ";");
		
		Для каждого ТекАдрес Из МассивАдресов Цикл
			Сообщение.Получатели.Добавить(ТекАдрес); 
		КонецЦикла;
			
		Сообщение.Отправитель = УчетнаяЗапись.АдресЭлектроннойПочты;
		Сообщение.Вложения.Добавить(ВременныйКаталог + "ТоварыБезЦен.XLSX", ТипФайлаТабличногоДокумента.XLSX);
		
		Попытка
			
			Почта.Послать(Сообщение);
			Сообщение.Вложения.Очистить(); 
			ТекстСообщения = "Отправлено письмо " + ТекСтр.ФизЛицо + " на адрес " + МылоКонтрагента + " с уведомлением о товарах без цен";
			ЗаписьЖурналаРегистрации("Отправка электронной почты.Успешно", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);

		Исключение	  					
		КонецПопытки;
		
	КонецЦикла;
	Почта.Отключиться();
	
	Попытка
		УдалитьФайлы(ВременныйКаталог);
	Исключение  		
	КонецПопытки;
	
КонецПроцедуры
