Процедура ВыполнитьПроверку() Экспорт 
	
	Запрос  = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК ДокументОснование,
	|	СчетФактураВыданный.Ссылка КАК СчетФактура,
	|	""Отсутствует счет-фактура"" КАК ТекстОшибка
	|ПОМЕСТИТЬ ТаблицаДокументов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И РеализацияТоваровУслуг.Проведен
	|	И СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	СчетФактураВыданный.Ссылка,
	|	""Отсутствует счет-фактура""
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО КорректировкаРеализации.Ссылка = СчетФактураВыданный.ДокументОснование
	|ГДЕ
	|	КорректировкаРеализации.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И КорректировкаРеализации.Проведен
	|	И СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И КорректировкаРеализации.Организация = &Организация
	|	И КорректировкаРеализации.ОтражатьВБухгалтерскомУчете
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	СчетФактураВыданный.Ссылка,
	|	""Счет-фактура не проведена""
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И РеализацияТоваровУслуг.Проведен
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете
	|	И НЕ СчетФактураВыданный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	СчетФактураВыданный.Ссылка,
	|	""Счет-фактура не проведена""
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = КорректировкаРеализации.Ссылка)
	|ГДЕ
	|	КорректировкаРеализации.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И КорректировкаРеализации.Проведен
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И КорректировкаРеализации.Организация = &Организация
	|	И КорректировкаРеализации.ОтражатьВБухгалтерскомУчете
	|	И НЕ СчетФактураВыданный.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка,
	|	СчетФактураВыданный.Ссылка,
	|	""У счет-фактуры нет галочки 'выставлен'""
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = РеализацияТоваровУслуг.Ссылка)
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И РеализацияТоваровУслуг.Проведен
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И РеализацияТоваровУслуг.Организация = &Организация
	|	И РеализацияТоваровУслуг.ОтражатьВБухгалтерскомУчете
	|	И СчетФактураВыданный.Проведен
	|	И НЕ СчетФактураВыданный.Выставлен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка,
	|	СчетФактураВыданный.Ссылка,
	|	""У счет-фактуры нет галочки 'выставлен'""
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО (СчетФактураВыданный.ДокументОснование = КорректировкаРеализации.Ссылка)
	|ГДЕ
	|	КорректировкаРеализации.Дата МЕЖДУ &ДатаН И &ДатаК
	|	И КорректировкаРеализации.Проведен
	|	И НЕ СчетФактураВыданный.Ссылка ЕСТЬ NULL
	|	И КорректировкаРеализации.Организация = &Организация
	|	И КорректировкаРеализации.ОтражатьВБухгалтерскомУчете
	|	И СчетФактураВыданный.Проведен
	|	И НЕ СчетФактураВыданный.Выставлен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДокументов.ДокументОснование,
	|	ТаблицаДокументов.СчетФактура,
	|	ТаблицаДокументов.ТекстОшибка,
	|	ЕСТЬNULL(КорректировкаРеализацииТовары.ЗаказПокупателя.КроссДокинг, ЛОЖЬ) КАК КроссДокинг1,
	|	ЕСТЬNULL(РеализацияТоваровУслугТовары.ЗаказПокупателя.КроссДокинг, ЛОЖЬ) КАК КроссДокинг2
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТаблицаДокументов КАК ТаблицаДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|		ПО ТаблицаДокументов.ДокументОснование = РеализацияТоваровУслугТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Товары КАК КорректировкаРеализацииТовары
	|		ПО ТаблицаДокументов.ДокументОснование = КорректировкаРеализацииТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.ДокументОснование,
	|	ИтоговаяТаблица.СчетФактура,
	|	ИтоговаяТаблица.ТекстОшибка
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|ГДЕ
	|	НЕ ИтоговаяТаблица.КроссДокинг1
	|	И НЕ ИтоговаяТаблица.КроссДокинг2
	|	И НЕ ИтоговаяТаблица.ДокументОснование.Грузополучатель.ОформлятьРеализацииКакВнутреннееПеремещение
	|	И НЕ ИтоговаяТаблица.ДокументОснование.Грузополучатель.НеВводитьСчетФактуру";

	Запрос.УстановитьПараметр("ДатаН", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаК", КонецДня(ДатаОкончания));
	
	ТекущаяБаза = Константы.База.Получить();
	
	Если ТекущаяБаза = Перечисления.НазваниеБазы.Воронеж 
		ИЛИ ТекущаяБаза = Перечисления.НазваниеБазы.Казань Тогда 
		Запрос.УстановитьПараметр("Организация", Константы.ОсновнаяОрганизация.Получить());
	Иначе      
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И РеализацияТоваровУслуг.Организация = &Организация", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И КорректировкаРеализации.Организация = &Организация", "");
		
	КонецЕсли;
	
	ТЗОшибок = Запрос.Выполнить().Выгрузить();
	
	Если ТЗОшибок.Количество() > 0 Тогда 
		
		ТабДокумент = Новый ТабличныйДокумент;
		
		ТабДокумент.АвтоМасштаб  = Истина;
		ТабДокумент.ОтображатьСетку = Ложь;
		ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		Макет       = ПолучитьМакет("ОшибкиСФ");
		
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.ДатаН = Формат(ДатаНачала, "ДФ=dd.MM.yyyy");
		ОбластьМакета.Параметры.ДатаК = Формат(ДатаОкончания, "ДФ=dd.MM.yyyy");
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		
		Для Каждого ТекСтрока Из ТЗОшибок Цикл
			
			ОбластьМакета.Параметры.Заполнить(ТекСтрока);
			ТабДокумент.Вывести(ОбластьМакета);
			
		КонецЦикла;
		
		ТабДокумент.ТолькоПросмотр = Истина;
		ТабДокумент.Показать();
		
	КонецЕсли;	
	
КонецПроцедуры	