
#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВопроса(ТекстВопроса, ОписаниеОповещения)

	ПараметрыФормыВопроса = Новый Структура("ТекстВопроса", ТекстВопроса);
	ФормаВопроса = ПолучитьФорму(ПолучитьПутьКОбработке() + "ФормаВопроса", ПараметрыФормыВопроса, ЭтаФорма);
	ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВопроса.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции
&НаСервере
Функция ПолучитьПутьКОбработке()	
	ПутьКФормам = ПолучитьОбъектОбработки().Метаданные().ПолноеИмя() + ".Форма.";	
	Возврат ПутьКФормам;
КонецФункции
&НаКлиенте
Функция ПолучитьОбщийМодульКлиента()
	Возврат ПолучитьФорму(ПолучитьПутьКОбработке() + "ОбщийМодульКлиент");	
КонецФункции

&НаСервере
Процедура ВывестиУведомлениеПользователю(Знач ТекстСообщенияПользователю)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	ПолучитьОбъектОбработки().ДобавитьВЖурнал(ТекстСообщенияПользователю, "Модуль формы");
КонецПроцедуры

#КонецОбласти

#Область КриптоПровайдер

&НаКлиенте
Функция ПодписатьДокументЭП(ИмяВременногоФайла, ПарольКСертификату)
	Возврат ПолучитьОбщийМодульКлиента().ПодписатьДокументЭП(КриптоПровайдер, СертификатПользователя, ИмяВременногоФайла, ПарольКСертификату);
КонецФункции
&НаКлиенте
Функция ПроверитьПодписьДокумента(ЗначениеПодписи, Подпись)
	Возврат ПолучитьОбщийМодульКлиента().ПроверитьПодписьДокумента(КриптоПровайдер, СертификатПользователя, ЗначениеПодписи, Подпись);
КонецФункции
&НаСервере
Функция ПолучитьСписокКриптоПровайдеровWindows()
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокКриптоПровайдеров();
КонецФункции
&НаКлиенте
Функция ПолучитьСписокСертификатов()
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСписокСертификатов(КриптоПровайдер);
КонецФункции
&НаКлиенте
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	Возврат ПолучитьОбщийМодульКлиента().ПолучитьСертификатПоОтпечатку(КриптоПровайдер, Отпечаток);
КонецФункции
&НаКлиенте
Функция СформироватьИмяПоСертификату(Сертификат)
	Возврат ПолучитьОбщийМодульКлиента().СформироватьИмяПоСертификату(Сертификат);	
КонецФункции
&НаСервере
Функция ПолучитьСписокДоступныхСертификатов(МассивОтпечатков)
	Возврат ПолучитьОбъектОбработки().ПолучитьСписокДоступныхСертификатов(МассивОтпечатков);
КонецФункции

#КонецОбласти


#Область Служебные

&НаКлиентеНаСервереБезКонтекста
Функция ВернутьРазобранныйСписокПроблем(МассивОшибок)
	СтрокаТекста = "";
	Если НЕ ЗначениеЗаполнено(МассивОшибок) Тогда
		Возврат СтрокаТекста;
	КонецЕсли;
	
	Для Каждого Ошибка Из МассивОшибок Цикл
		Если ЗначениеЗаполнено(СтрокаТекста) Тогда
			СтрокаТекста = СтрокаТекста + Символы.ПС;
		КонецЕсли;
		Если ТипЗнч(Ошибка) = Тип("Строка") Тогда
			СтрокаТекста = СтрокаТекста + Ошибка;	
		Иначе
			Если Ошибка.Получить("propertyPath") <> Неопределено Тогда
				СтрокаТекста = СтрокаТекста + Ошибка.Получить("propertyPath") + ": ";
			КонецЕсли;
			Если Ошибка.Получить("violation") <> Неопределено Тогда
				СтрокаТекста = СтрокаТекста + Ошибка.Получить("violation");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат СтрокаТекста;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СписокПровайдеров = ПолучитьСписокКриптоПровайдеровWindows();
	Для Каждого Провайдер Из СписокПровайдеров Цикл
		Элементы.КриптоПровайдер.СписокВыбора.Добавить(Провайдер.Значение, Провайдер.Представление);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "КриптоПровайдер");
	ЗаполнитьЗначенияСвойств(ЭтаФорма.Объект, Параметры);
	
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	СправочникРегионов = ОбработкаОбъект.ВыполнитьСинхронизациюРегионов(Истина);
	Если ТипЗнч(СправочникРегионов) = Тип("ТаблицаЗначений") Тогда
		Элементы.Регион.СписокВыбора.Очистить();
		Для Каждого Регион Из СправочникРегионов Цикл
			Элементы.Регион.СписокВыбора.Добавить(Регион.КодРегиона, Регион.ИмяРегиона);		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписокДоступныхСертификатов();
	Элементы.ГруппаДанные.Видимость = Ложь;
	Элементы.ГруппаСведенияОбОрганизации.Видимость = Ложь;
КонецПроцедуры

#КонецОбласти


#Область ПанельУправления

&НаКлиенте
Процедура ОбновитьСписокДоступныхСертификатов(Команда = Неопределено)
	Элементы.СертификатПользователя.СписокВыбора.Очистить();
	СписокСертификатов = ПолучитьСписокСертификатов();
	Для Каждого Серт Из СписокСертификатов Цикл
		Элементы.СертификатПользователя.СписокВыбора.Добавить(Серт.Значение, Серт.Представление);	
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОсновнойИнтерфейс

&НаКлиенте
Процедура СертификатПользователяПриИзменении(Элемент)
	Элементы.ГруппаСведенияОбОрганизации.Видимость = ЗначениеЗаполнено(СертификатПользователя);
	ОрганизацияДляПодбора = Неопределено;
	ДанныеСертификата = ПолучитьСертификатПоОтпечатку(СертификатПользователя);
	СтруктураПоискаОрганизаций = Новый Структура("ИНН,ОГРН");
	Попытка
		СтруктураПоискаОрганизаций.ИНН = ДанныеСертификата.Субъект.OID1_2_643_3_131_1_1;	//ИНН
		Если ДанныеСертификата.Субъект.Свойство("OID1_2_643_100_1") Тогда
			СтруктураПоискаОрганизаций.ОГРН = ДанныеСертификата.Субъект.OID1_2_643_100_1;		//ОГРН
		ИначеЕсли ДанныеСертификата.Субъект.Свойство("OID1_2_643_100_5") Тогда
			СтруктураПоискаОрганизаций.ОГРН = ДанныеСертификата.Субъект.OID1_2_643_100_5;
		КонецЕсли;
		Если Лев(СтруктураПоискаОрганизаций.ИНН, 2) = "00" Тогда
			СтруктураПоискаОрганизаций.ИНН = Сред(СтруктураПоискаОрганизаций.ИНН, 3);
		КонецЕсли;
	Исключение
		Сообщить("Не удалось распознать поля в сертификате" + Символы.ПС + ИнформацияОбОшибке().Описание);
	КонецПопытки;
	СертификатПользователяПриИзмененииНаСервере(СтруктураПоискаОрганизаций);
	Если Элементы.ОрганизацияДляПодбора.СписокВыбора.Количество() > 0 Тогда
		ОрганизацияДляПодбора = Элементы.ОрганизацияДляПодбора.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	ОрганизацияДляПодбораПриИзменении(Элементы.ОрганизацияДляПодбора);
КонецПроцедуры
&НаСервере
Процедура СертификатПользователяПриИзмененииНаСервере(ДанныеПоиска)
	Элементы.ОрганизацияДляПодбора.СписокВыбора.Очистить();
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	МассивОрганизаций = ОбработкаОбъект.ПолучитьОрганизациюПоИННОГРН(ДанныеПоиска.ИНН, ДанныеПоиска.ОГРН, Истина);
	Для Каждого Организация Из МассивОрганизаций Цикл
		Элементы.ОрганизацияДляПодбора.СписокВыбора.Добавить(Организация, Организация.Наименование);	
	КонецЦикла;	
КонецПроцедуры
&НаКлиенте
Процедура ОрганизацияДляПодбораПриИзменении(Элемент)
	Элементы.ГруппаДанные.Видимость = Ложь;
	Элементы.Зарегистрироваться.Доступность = Ложь;
	Если ЗначениеЗаполнено(ОрганизацияДляПодбора) Тогда
		ЗаполнитьДанныеОрганизации();
		Элементы.ГруппаДанные.Видимость = Истина;
		Элементы.Зарегистрироваться.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьДанныеОрганизации()
	ИНН = ОрганизацияДляПодбора.ИНН;
	ОГРН = ОрганизацияДляПодбора.ОГРН;
	Попытка	КПП = ОрганизацияДляПодбора.КПП Исключение КонецПопытки;
	Попытка	ОКПО = ОрганизацияДляПодбора.КодПоОКПО Исключение КонецПопытки;
	Попытка	НомерИФНС = Лев(КПП, 4) Исключение КонецПопытки;
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	СтруктураБанка = ОбработкаОбъект.ПолучитьБанковскийСчетОрганизации(ОрганизацияДляПодбора);
	НомерСчета = СтруктураБанка.НомерСчета;
	БИК = СтруктураБанка.БИК;
	СтруктураАдреса = ОбработкаОбъект.ПолучитьСтруктуруАдресаОрганизации(ОрганизацияДляПодбора);
	Попытка	КодРегиона = Число(СтруктураАдреса.КодРегиона) Исключение КонецПопытки;
	Попытка	Страна = "643" Исключение КонецПопытки;
	Попытка	Индекс = СтруктураАдреса.Индекс Исключение КонецПопытки;
	Попытка	Город = ?(ЗначениеЗаполнено(СтруктураАдреса.Город), СтруктураАдреса.Город, СтруктураАдреса.Регион) Исключение КонецПопытки;
	Попытка	Улица = СтруктураАдреса.Улица Исключение КонецПопытки;
	Попытка	Дом = СтруктураАдреса.Дом Исключение КонецПопытки;
	Попытка	Квартира = СтруктураАдреса.Квартира Исключение КонецПопытки;
КонецПроцедуры



#КонецОбласти

#Область Регистрация

&НаКлиенте
Процедура Зарегистрироваться(Команда)
	Если ПроверитьЗаполнение() И (СтрДлина(ИНН) > 10 ИЛИ ЗначениеЗаполнено(КПП) ) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗарегистрироватьсяЗавершение", ЭтаФорма);
		ОткрытьФорму("ВнешняяОбработка.МодульИнтеграцииDiState.Форма.ФормаВводаПароля",,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ЗарегистрироватьсяЗавершение(СтрокаПароля, ДополнительныеПараметры = Неопределено) Экспорт
	ПарольКСертификату = СтрокаПароля;
	Подпись = ПодписатьМагическуюФразу();
	
	Если ЗначениеЗаполнено(Подпись) И ПроверитьПодписьМагическойФразы(Подпись) Тогда
		СтруктураДанных = СформироватьСтруктуруКРегистрации();
		Результат = ОсуществитьРегистрациюНаСервере(СтруктураДанных, Подпись);
		Если Результат Тогда
			ПоказатьОповещениеПользователя("Регистрация",,"Компания успешно зарегистрирована в системе. Ожидайте активации");
			Закрыть();
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
&НаКлиенте
Функция ПодписатьМагическуюФразу()
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст("please give me a sign");
	ТекстовыйДокумент.Записать(ИмяВременногоФайла,"CESU-8");
	Возврат ПодписатьДокументЭП(ИмяВременногоФайла, ПарольКСертификату);
КонецФункции
&НаКлиенте
Функция ПроверитьПодписьМагическойФразы(Подпись)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст("please give me a sign");
	ТекстовыйДокумент.Записать(ИмяВременногоФайла,"CESU-8");
	Возврат ПроверитьПодписьДокумента(ИмяВременногоФайла, Подпись);	
КонецФункции
&НаСервере
Функция ОсуществитьРегистрациюНаСервере(СтруктураДанных, Подпись)
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	Результат = ОбработкаОбъект.ЗарегистрироватьсяВЭДО(СтруктураДанных, Подпись);
	Если Результат.Получить("success") <> Неопределено Тогда
		Если Результат.Получить("success") = Истина Тогда
			Возврат Истина;
		Иначе
			СписокПроблем = ВернутьРазобранныйСписокПроблем(Результат.Получить("violations") );
			Сообщить( Результат.Получить("codeDescription") + ?(ЗначениеЗаполнено(СписокПроблем), Символы.ПС + СписокПроблем, "") );
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
&НаСервере
Функция СформироватьСтруктуруКРегистрации()
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	СтруктураДанных = ОбработкаОбъект.СформироватьСтруктуруДляРегистрации();
	Если СтруктураДанных.Свойство("Компания") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных.Компания, ЭтотОбъект);
	КонецЕсли;
	Если СтруктураДанных.Свойство("АдресКомпании") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных.АдресКомпании, ЭтотОбъект);
	КонецЕсли;
	Если СтруктураДанных.Свойство("Сотрудник") Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанных.Сотрудник, ЭтотОбъект);
	КонецЕсли;
	Возврат СтруктураДанных;
КонецФункции



#КонецОбласти

