
Функция RA_R_RN_LIN(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис RA_R_RN_LIN", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. RA_R_RN_LIN");
	
	Результат = МСКWEB.RA_R_RN_LIN(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис RA_R_RN_LIN", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. RA_R_RN_LIN " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат;

КонецФункции
