Процедура МаркировкаОбработкаПроведения(Источник, Отказ) Экспорт
	
	Если Не Источник.Проведен Тогда
		Возврат;
	КонецЕсли; 
	
	//+Шульман А. 02.10.2025 #UT10-5438                           
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда   
		СоздатьМаркировкуПриПоступлении(Источник.Ссылка);
	КонецЕсли;
	//-Шульман А. 02.10.2025 #UT10-5438 	
	
КонецПроцедуры

Процедура СоздатьМаркировкуПриПоступлении(ДокСсылка) Экспорт
	
	//+Шульман А. 02.10.2025 #UT10-5438   
	тзТовары = ПолучитьНоменклатуруДляМаркировкиПриПоступлении(ДокСсылка);  
	
	Если Не ЗначениеЗаполнено(тзТовары) Тогда
		Возврат;
	КонецЕсли;
	
	тзТовГруппы = тзТовары.Скопировать();
	тзТовГруппы.Свернуть("ВидПродукции, Кладовщик");   
	
	Для каждого тзСтрокаВидПродукции Из тзТовГруппы Цикл
		
		//+Шульман А. 08.10.2025 #UT10-5444 
		Если НачалоДня(ТекущаяДата()) >= тзСтрокаВидПродукции.ВидПродукции.ДатаОкончанияМаркировкиОстатков Тогда
			Продолжить;
		КонецЕсли;
		//-Шульман А. 08.10.2025 #UT10-5444 
		
		ДокОбъект = Документы.МаркировкаТоваровГИСМ.СоздатьДокумент();
		ДокОбъект.Дата = ТекущаяДата();           
		ДокОбъект.ВидПродукции = тзСтрокаВидПродукции.ВидПродукции;   
		ДокОбъект.ДокументОснование = ДокСсылка;
		ДокОбъект.Организация = ДокСсылка.Организация;    
		ДокОбъект.СпособВводаВОборот = Перечисления.СпособВводаВОборот.МаркировкаОстатков;   
		ДокОбъект.СпособИзготовления = Перечисления.ВидыСервисПровайдеровСУЗ.Самостоятельно;
		ДокОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;                 
		ДокОбъект.Кладовщик = тзСтрокаВидПродукции.Кладовщик;
		ДокОбъект.Комментарий = "Создан при проведении поступления товаров " + ТекущаяДата();
	    ДокОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.ЗаказНаЭмиссию;    
		
		МассивСтрок = тзТовары.НайтиСтроки(Новый Структура("ВидПродукции", тзСтрокаВидПродукции.ВидПродукции));
		
		Для каждого тзСтрока Из МассивСтрок Цикл
		
			ДобСтрока = ДокОбъект.Товары.Добавить();
			ДобСтрока.Номенклатура = тзСтрока.Номенклатура;
			ДобСтрока.GTIN = тзСтрока.Номенклатура.GTIN;
			ДобСтрока.Количество = тзСтрока.Количество; 
			ДобСтрока.КоличествоФакт = тзСтрока.Количество;
		
		КонецЦикла;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		
		КонецПопытки; 

	КонецЦикла;
	//-Шульман А. 02.10.2025 #UT10-5438 
	
КонецПроцедуры // ()

// ДокСсылка - ДокументСсылка.ПоступлениеТоваровУслуг
Функция ПолучитьНоменклатуруДляМаркировкиПриПоступлении(ДокСсылка)  
	
	//+Шульман А. 02.10.2025 #UT10-5438   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровГИСМТовары.Номенклатура,
		|	СУММА(МаркировкаТоваровГИСМТовары.КоличествоФакт) КАК Количество
		|ПОМЕСТИТЬ ВТ_Маркировка
		|ИЗ
		|	Документ.МаркировкаТоваровГИСМ.Товары КАК МаркировкаТоваровГИСМТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаркировкаТоваровГИСМ КАК МаркировкаТоваровГИСМ
		|		ПО МаркировкаТоваровГИСМТовары.Ссылка = МаркировкаТоваровГИСМ.Ссылка
		|ГДЕ
		|	МаркировкаТоваровГИСМ.Проведен
		|	И МаркировкаТоваровГИСМ.ДокументОснование = &ДокСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	МаркировкаТоваровГИСМТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВЯчейкахОбороты.Номенклатура,
		|	СУММА(ТоварыВЯчейкахОбороты.КоличествоПриход) КАК Количество,
		|	МАКСИМУМ(ТоварыВЯчейкахОбороты.Регистратор.Ответственный) КАК Кладовщик
		|ПОМЕСТИТЬ ВТ_ТоварыВЯчейках
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейках.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Ячейка = &ЯчейкаДляМаркировки
		|				И Номенклатура.ТребуетсяМаркировка) КАК ТоварыВЯчейкахОбороты
		|ГДЕ
		|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.РазмещениеПоЯчейкам
		|	И ТоварыВЯчейкахОбороты.Регистратор.ДокументОснование = &ДокСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВЯчейкахОбороты.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТоварыВЯчейках.Номенклатура,
		|	ВТ_ТоварыВЯчейках.Количество - ЕСТЬNULL(ВТ_Маркировка.Количество, 0) КАК Количество,
		|	ВТ_ТоварыВЯчейках.Номенклатура.ТоварнаяГруппаЧестногоЗнака КАК ВидПродукции,
		|	ВТ_ТоварыВЯчейках.Кладовщик
		|ИЗ
		|	ВТ_ТоварыВЯчейках КАК ВТ_ТоварыВЯчейках
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Маркировка КАК ВТ_Маркировка
		|		ПО ВТ_ТоварыВЯчейках.Номенклатура = ВТ_Маркировка.Номенклатура
		|ГДЕ
		|	ВТ_ТоварыВЯчейках.Количество - ЕСТЬNULL(ВТ_Маркировка.Количество, 0) > 0";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	Запрос.УстановитьПараметр("ЯчейкаДляМаркировки", Константы.ЯчейкаДляМаркировки.Получить());
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;     
	Иначе
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;
    //-Шульман А. 02.10.2025 #UT10-5438   

КонецФункции // ()

Процедура ОбработатьСообщениеПоМаркировке(ТекстСообщения, Отказ, Подписка, СвойстваСообщения = "", ВходящееСообщение = Неопределено, ПовторнаяОбработка = Ложь) Экспорт	
	
	ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	ИмяОчереди = "UT11.documents.Mark";
	
	СтруктураДокумента = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ТекстСообщения);
	ВидДокумента = "";
	СтруктураДокумента.Свойство("ВидДокумента", ВидДокумента);		
	
	ТекстОшибки = "";

	Если Не ЗначениеЗаполнено(ВидДокумента) Тогда
		
		Если ТипЗнч(СвойстваСообщения) = Тип("Структура") Тогда
		
			Заголовки = СвойстваСообщения.headers;
			ВидДокумента = Заголовки.Получить("document_type");
		
		ИначеЕсли ТипЗнч(СвойстваСообщения) = Тип("СправочникТабличнаяЧасть.Р_ВходящиеСообщения.Параметры") Тогда
			
			тзСтрока = СвойстваСообщения.Найти("document_type", "Имя");
			
			Если Не тзСтрока = Неопределено Тогда
				ВидДокумента = тзСтрока.Значение;
			КонецЕсли;  
			
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		
		Если ВидДокумента = "СостояниеЗаказаНаЭмиссию" Тогда
			ЗагрузитьЗаказНаМаркировку(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ, ТекстСообщения, ТекстОшибки);
		ИначеЕсли ВидДокумента = "СостояниеОтчетаОНанесении" Тогда
			ЗагрузитьОтчетОНанесении(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ, ТекстСообщения, ТекстОшибки);
		ИначеЕсли ВидДокумента = "СостояниеВводВОборот" Тогда
			ЗагрузитьВводВОборот(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ, ТекстСообщения, ТекстОшибки); 
		//+Белов А. 24.03.2026 #UT10-5761
		ИначеЕсли ВидДокумента = "СостояниеВыводаИзОборота" Тогда
			ЗагрузитьВыводИзОборота(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ, ТекстСообщения, ТекстОшибки);	
		//-Белов А. 24.03.2026 #UT10-5761
		//+Белов А. 02.06.2026 #UT10-5894
		ИначеЕсли ВидДокумента = "СостояниеОбработкиГИСМТ" Тогда
			ЗагрузитьОбработкуГИСМТ(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ, ТекстСообщения, ТекстОшибки);
		//-Белов А. 02.06.2026 #UT10-5894
		Иначе	
			ТекстОшибки = "Неизвестный тип сообщения";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			
			Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(ВходящееСообщение, ТекстОшибки);		
			Возврат;
			
		КонецЕсли;
		
		Справочники.Р_ВходящиеСообщения.ПометитьВходящееОбработанным(ВходящееСообщение);   
		
	Исключение
		
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстОшибки = "Не удалось загрузить!";
		КонецЕсли;
		
		Справочники.Р_ВходящиеСообщения.ЗаписатьОшибкуПоВходящемуСообщению(ВходящееСообщение, ТекстОшибки);		
		ЗаписьЖурналаРегистрации("ПолучениеСообщений.Прием", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецПопытки;	
	
КонецПроцедуры

Функция ЭтоОчередьПоМаркировке(ИмяОчереди) Экспорт

	Возврат ВРЕГ(Лев(ИмяОчереди, 4)) = "UT10" И ВРЕГ(Прав(ИмяОчереди, 15)) = ".DOCUMENTS.MARK";

КонецФункции // ()

Процедура ЗагрузитьЗаказНаМаркировку(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ = Ложь, ТекстСообщения = "", ТекстОшибки = "") Экспорт
	
	СтатусДокумента = Перечисления.СтатусыЗаказаНаМаркировку.Обработан;
	
	Попытка 
		
		ДокументЗагрузки = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДокумента.source_id)); 
		
		Если ДокументЗагрузки.ПолучитьОбъект() <> Неопределено Тогда
			
			Для Каждого СтрокаДетайл ИЗ СтруктураДокумента.Detail Цикл
				
				Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ",СтрокаДетайл.Product_mdm);
				
				Если СтрокаДетайл.Свойство("codes") Тогда
					
					Если ЗначениеЗаполнено(СтрокаДетайл.codes) Тогда
						
						Для Каждого СтрокаКодес ИЗ СтрокаДетайл.codes Цикл    
							
							ЗаписьПКМ = РегистрыСведений.ПулКодовМаркировкиСУЗ.СоздатьМенеджерЗаписи();
							ЗаписьПКМ.ДокументОснование = ДокументЗагрузки;
							ЗаписьПКМ.Организация = ДокументЗагрузки.Организация;
							ЗаписьПКМ.ВидПродукции = ДокументЗагрузки.ВидПродукции;
							
							//+Сёмин Р.И. 03.06.2026 #UT10-5906
							//ЗаписьПКМ.КодМаркировки = Лев(СтрокаКодес.km, 18) + Сред(СтрокаКодес.km, 19, 13);
							НомерПозицииПервогоРазделителяGS = Найти(СтрокаКодес.km, Символ(29));
							
							Если ЗначениеЗаполнено(НомерПозицииПервогоРазделителяGS) Тогда
								ЗаписьПКМ.КодМаркировки = Лев(СтрокаКодес.km, НомерПозицииПервогоРазделителяGS - 1);
							Иначе
								ЗаписьПКМ.КодМаркировки = Лев(СтрокаКодес.km, 18) + Сред(СтрокаКодес.km, 19, 13);
							КонецЕсли;
							//-Сёмин Р.И. 03.06.2026 #UT10-5906
							
							ЗаписьПКМ.СпособВводаВОборот = ДокументЗагрузки.СпособВводаВОборот;
							ЗаписьПКМ.ДатаЭмиссииУниверсальная = Дата(СтруктураДокумента.date);
							ЗаписьПКМ.ЗаказНаЭмиссию = ДокументЗагрузки; 
							ЗаписьПКМ.GTIN = Сред(СтрокаКодес.km, 3, 14);
							ЗаписьПКМ.ПолныйКодМаркировки = Новый ХранилищеЗначения(СтрокаКодес.km);
							
							//+Сёмин Р.И. 03.06.2026 #UT10-5906
							//ЗаписьПКМ.ХешСуммаКодаМаркировки = Прав(СтрокаКодес.km,СтрДлина(СтрокаКодес.km) - 32);
							
							Если ЗначениеЗаполнено(НомерПозицииПервогоРазделителяGS) Тогда
								ЗаписьПКМ.ХешСуммаКодаМаркировки = Прав(СтрокаКодес.km, СтрДлина(СтрокаКодес.km) - НомерПозицииПервогоРазделителяGS);
							Иначе
								ЗаписьПКМ.ХешСуммаКодаМаркировки = Прав(СтрокаКодес.km, СтрДлина(СтрокаКодес.km) - 32);
							КонецЕсли;
							//-Сёмин Р.И. 03.06.2026 #UT10-5906
							
							ЗаписьПКМ.Номенклатура = Номенклатура;   
							ЗаписьПКМ.Статус = Перечисления.СтатусыКодовМаркировкиСУЗ.Эмитирован;  
							
							СтрокаИзДокумента = ДокументЗагрузки.Товары.Найти(ЗаписьПКМ.GTIN, "GTIN");
							
							Если ЗначениеЗаполнено(ДокументЗагрузки.ВидПродукции) Тогда  
								ЗаписьПКМ.Шаблон = ДокументЗагрузки.ВидПродукции.ШаблонМаркировки;
							КонецЕсли;  
							
							ЗаписьПКМ.ТекстОшибки = СтрокаДетайл.error_text; 
							
							Если ЗначениеЗаполнено(ЗаписьПКМ.ТекстОшибки) Тогда
								СтатусДокумента = Перечисления.СтатусыЗаказаНаМаркировку.Ошибка;
							КонецЕсли;
							
							ЗаписьПКМ.Записать();
							
						КонецЦикла; 
						
					Иначе
						
						ТекстОшибки =  "Пустые данные в codes"; 
						СтатусДокумента = Перечисления.СтатусыЗаказаНаМаркировку.Ошибка;
						
					КонецЕсли;
					
				Иначе
					
					ТекстОшибки =  "Нет тега codes";
					СтатусДокумента = Перечисления.СтатусыЗаказаНаМаркировку.Ошибка;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			ТекстОшибки =  "Не найден заказ на маркировку по id - " + СтруктураДокумента.source_id;
            Возврат;
			
		КонецЕсли;
		
	Исключение
		СтатусДокумента = Перечисления.СтатусыЗаказаНаМаркировку.Ошибка;
	КонецПопытки;
	
	ОбъектДокумента = ДокументЗагрузки.ПолучитьОбъект();
	ОбъектДокумента.Статус = СтатусДокумента;
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗагрузитьОтчетОНанесении(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ = Ложь, ТекстСообщения = "", ТекстОшибки = "") Экспорт
	
	СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан;
	
	Попытка 
		
		ДокументЗагрузки = Документы.ОтчетОНанесенииКИЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДокумента.source_id)); 
		
		Если ДокументЗагрузки.ПолучитьОбъект() <> Неопределено Тогда
			
			Для Каждого СтрокаДетайл ИЗ СтруктураДокумента.Detail Цикл
				
				//+Сёмин Р.И. 04.06.2026 #UT10-5906
				//НайденныйШН = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", Лев(СтрокаДетайл.code, 18) + Сред(СтрокаДетайл.code, 19, 13));
				
				НомерПозицииПервогоРазделителяGS = Найти(СтрокаДетайл.code, Символ(29));
				
				Если ЗначениеЗаполнено(НомерПозицииПервогоРазделителяGS) Тогда
					НайденныйШН = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", Лев(СтрокаДетайл.code, НомерПозицииПервогоРазделителяGS - 1));
				Иначе
					НайденныйШН = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", Лев(СтрокаДетайл.code, 18) + Сред(СтрокаДетайл.code, 19, 13));
				КонецЕсли;
				//-Сёмин Р.И. 04.06.2026 #UT10-5906

				Если НЕ НайденныйШН.Пустая() Тогда
					
					НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Регистратор.Установить(ДокументЗагрузки);
					НаборЗаписей.Прочитать();
					
					Для Каждого ЗаписьСКМ ИЗ НаборЗаписей Цикл  
						
						Если ЗаписьСКМ.ШтрихКодНоменклатуры <> НайденныйШН Тогда
							Продолжить;
		 				КонецЕсли;
						
						ЗаписьСКМ.Документ = ДокументЗагрузки;
						ЗаписьСКМ.СостояниеКМ = Перечисления.СостоянияКодовМаркировки.Нанесен;    
						ЗаписьСКМ.Признак = Перечисления.ПризнакКодовМаркировки.СвойКИЗ;  
						ЗаписьСКМ.СтатусКМ = СтрокаДетайл.status_km;
						ЗаписьСКМ.Ошибка = СтрокаДетайл.error_text;
						ЗаписьСКМ.ИДДокументаЧЗ = СтрокаДетайл.report_id;  
						
					КонецЦикла;
					
					Если НаборЗаписей.Количество() > 0 Тогда
						НаборЗаписей.Записать();          
					КонецЕсли;
					
				Иначе
					
					СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка;
					ТекстОшибки =  "Не найден код маркировки в табличной части ";
					
				КонецЕсли;
				
			КонецЦикла;  
			
		Иначе
			
			СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка;
			ТекстОшибки =  "Не найден отчет о нанесении по id - " + СтруктураДокумента.source_id; 
			Возврат;
			
		КонецЕсли;
		
	Исключение
		СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка;
	КонецПопытки;
	
	ОбъектДокументаЗагрузки = ДокументЗагрузки.ПолучитьОбъект();  
	ОбъектДокумента = ОбъектДокументаЗагрузки;
	ОбъектДокумента.Статус = СтатусДокумента;
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗагрузитьВводВОборот(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ = Ложь, ТекстСообщения = "", ТекстОшибки = "") Экспорт
	
	СтатусДокумента = ""; 
	
	Если СтруктураДокумента.Свойство("status") Тогда
		
		Если СтруктураДокумента.status = "ERROR" Тогда 
			СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка; 
		ИначеЕсли СтруктураДокумента.status = "CHECKED_OK" Тогда 
			СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан; 
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка   
		
		Если СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан Тогда
			
			ДокументЗагрузки = Документы.ВводВОборотКИЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДокумента.source_id)); 
			
			Если ДокументЗагрузки.ПолучитьОбъект() <> Неопределено Тогда
				
				НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументЗагрузки);
				
				Для Каждого СтрокаДокументЗагрузки ИЗ ДокументЗагрузки.Товары Цикл
					
					ЗаписьСКМ = НаборЗаписей.Добавить();
					ЗаписьСКМ.Документ = ДокументЗагрузки;
					ЗаписьСКМ.ШтрихКодНоменклатуры = СтрокаДокументЗагрузки.ШтрихКодМаркировки;
					ЗаписьСКМ.СостояниеКМ = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;    
					ЗаписьСКМ.Признак = Перечисления.ПризнакКодовМаркировки.СвойКИЗ;  
					
				КонецЦикла;
				
				Если НаборЗаписей.Количество() > 0 Тогда
					НаборЗаписей.Записать();          
				КонецЕсли;
				
			Иначе
				
				СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка;
				ТекстОшибки =  "Не найден отчет о нанесении по id - " + СтруктураДокумента.source_id; 
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли;     
		
	Исключение
		СтатусДокумента = Перечисления.СтатусыОтчетОНанесенииКИЗ.Ошибка;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(СтатусДокумента) Тогда 
		
		ТекстОшибки =  "Неизвестный статус документа"; 
		Возврат;
		
	КонецЕсли;
	
	ОбъектДокументаЗагрузки = ДокументЗагрузки.ПолучитьОбъект();  
	ОбъектДокумента = ОбъектДокументаЗагрузки;
	ОбъектДокумента.Статус = СтатусДокумента;
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура ЗагрузитьВыводИзОборота(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ = Ложь, ТекстСообщения = "", ТекстОшибки = "") Экспорт
//+Белов А. 24.03.2026 #UT10-5761

	СтатусДокумента = ""; 
	
	Если СтруктураДокумента.Свойство("status") Тогда
		
		Если СтруктураДокумента.status = "ERROR" Тогда 
			СтатусДокумента = Перечисления.СтатусыВыводИзОборотаКИЗ.Ошибка; 
		ИначеЕсли СтруктураДокумента.status = "UNLOAD" Тогда 
			СтатусДокумента = Перечисления.СтатусыВыводИзОборотаКИЗ.Обработан; 
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка  
		
		ДокументЗагрузки = Документы.ВыводИзОборотаКИЗ.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураДокумента.source_id)); 
		
		Если ДокументЗагрузки.ПолучитьОбъект() = Неопределено Тогда
			
			СтатусДокумента = Перечисления.СтатусыВыводИзОборотаКИЗ.Ошибка;
			ТекстОшибки =  "Не найден вывод из оборота по id - " + СтруктураДокумента.source_id; 
			Возврат;
			
		КонецЕсли;
				
	Исключение
		СтатусДокумента = Перечисления.СтатусыВыводИзОборотаКИЗ.Ошибка;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено(СтатусДокумента) Тогда 
		
		ТекстОшибки =  "Неизвестный статус документа"; 
		Возврат;
		
	КонецЕсли;
	
	ОбъектДокументаЗагрузки = ДокументЗагрузки.ПолучитьОбъект();  
	ОбъектДокумента = ОбъектДокументаЗагрузки;
	
	Если СтатусДокумента = Перечисления.СтатусыВыводИзОборотаКИЗ.Ошибка Тогда
		
		Если ОбъектДокумента.Статус <> Перечисления.СтатусыВыводИзОборотаКИЗ.Обработан Тогда
			ОбъектДокумента.Статус = СтатусДокумента;	
		КонецЕсли;
		
	Иначе
		ОбъектДокумента.Статус = СтатусДокумента;
	КонецЕсли;
	
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);

//-Белов А. 24.03.2026 #UT10-5761	
КонецПроцедуры

Процедура ЗагрузитьОбработкуГИСМТ(СтруктураДокумента, ВидДокумента, ИмяОчереди, Отказ = Ложь, ТекстСообщения = "", ТекстОшибки = "") Экспорт
//+Белов А. 24.06.2026 #UT10-5894

	ДокументыМассив = СтруктураДокумента.docs;
	
	Для каждого Док Из ДокументыМассив Цикл
		
		Документ = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Док.sourceId));
		
		Если Документ.ПолучитьОбъект() <> Неопределено Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(ДокументыЭДОТребующиеОбработки.Идентификатор) КАК Идентификатор
			|ИЗ
			|	РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
			|ГДЕ
			|	ДокументыЭДОТребующиеОбработки.Документ = &Документ
			|	И ДокументыЭДОТребующиеОбработки.ОтправленНаПроверкуВЧЗ";
			
			Запрос.УстановитьПараметр("Документ", Документ);  
			
			Выборка = Запрос.Выполнить().Выбрать(); 
			
			Если Выборка.Следующий() Тогда
				
				Менеджер = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи();		
				Менеджер.Идентификатор = Выборка.Идентификатор;
				Менеджер.Прочитать();
				
				Если Менеджер.Выбран() Тогда
					
					Если НРег(Док.state) = "success" Тогда
						
						Менеджер.ПроверенВЧЗ = Истина;
						Менеджер.ТекстОшибкиЧЗ = "";  
						
					ИначеЕсли НРег(Док.state) = "failed" Тогда  
						
						Если Док.Свойство("errors") Тогда    
							
							//+Белов А. 14.07.2026 #UT10-5957							
							Если ЗначениеЗаполнено(Док.errors) Тогда
								Менеджер.ТекстОшибкиЧЗ = Док.errors;
							Иначе
								Менеджер.ТекстОшибкиЧЗ = "Неизвестная ошибка";	
							КонецЕсли;			             
							//-Белов А. 14.07.2026 #UT10-5957
							
						Иначе
							Менеджер.ТекстОшибкиЧЗ = "Неизвестная ошибка";
						КонецЕсли;                 					
						
					КонецЕсли;
					
					Менеджер.Записать();  
					
				КонецЕсли;
				
			КонецЕсли;              	
			
		КонецЕсли;
		
	КонецЦикла;                       

//-Белов А. 24.06.2026 #UT10-5894	
КонецПроцедуры

Процедура СоздатьИсходящееСообщениеМаркировка(Источник)  Экспорт
	
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	НовоеСообщение.Объект = Источник;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Источник.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Источник.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Источник.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Источник.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация,"КодМДМ")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Источник.ВидПродукции.Алиас);
	СтруктураДокумента.Вставить("СпособВыпускаВОборот",  СпособВыпускаВОборот(Источник.СпособВводаВОборот, 
		//+Шульман А. 08.10.2025 #UT10-5445
	    ТекущаяДата() >= Источник.ВидПродукции.ДатаОкончанияМаркировкиОстатков));    
		//-Шульман А. 08.10.2025 #UT10-5445
	СтруктураДокумента.Вставить("СпособИзготовления",  СпособИзготовленияКодовМаркировки(Источник.СпособИзготовления));

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("Количество",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("GTIN",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ТипСерийногоНомера",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ТипШаблона",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("ТипКодаМаркировки",СтрокаТип);  
	
	Для Каждого СтрокаТовары Из Источник.Товары Цикл

		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "КодМДМ"));
		НоваяСтрокаТТ.Количество = СтрокаТовары.Количество;
		НоваяСтрокаТТ.GTIN = Строка(СтрокаТовары.GTIN);
		НоваяСтрокаТТ.ТипСерийногоНомера = Строка("OPERATOR");
		НоваяСтрокаТТ.ТипШаблона = Источник.ВидПродукции.ШаблонМаркировки;
		НоваяСтрокаТТ.ТипКодаМаркировки = "UNIT";
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("Товары", МассивТоваров);
	
	//Запись в JSON
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть();	
	
	НовоеСообщение.Сообщение = JsonСтрока;
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("message_ver",  "2.0"); 
	Заголовки.Добавить("document_type",  "ЗаказНаЭмиссию");
	
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",            "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать(); 	 
	
КонецПроцедуры

Процедура СоздатьИсходящееСообщениеОтчетОНанесенииКИЗ(Источник)  Экспорт
	
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	НовоеСообщение.Объект = Источник;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Источник.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Источник.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Источник.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Источник.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация,"КодМДМ")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Источник.ВидПродукции.Алиас);

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ДатаТип = Новый ОписаниеТипов("Дата");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки", ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМаркировки", СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры", СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("ДатаПроизводства", СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("СрокГодности", СтрокаТип);
	
	Для Каждого СтрокаТовары Из Источник.Товары Цикл
		
		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "КодМДМ"));
		НоваяСтрокаТТ.КодМаркировки = СтрокаТовары.ШтрихКодМаркировки.КодМаркировки + СтрокаТовары.ШтрихКодМаркировки.Криптохвост;
		НоваяСтрокаТТ.ДатаПроизводства = Формат(СтрокаТовары.ШтрихКодМаркировки.ДатаПроизводства, "ДФ=dd.MM.yyyy");
		НоваяСтрокаТТ.СрокГодности = Формат(СтрокаТовары.ШтрихКодМаркировки.СрокГодности, "ДФ=dd.MM.yyyy");
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("КодыМаркировки", МассивТоваров);
	
	//Запись в JSON
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть();	
	
	НовоеСообщение.Сообщение = JsonСтрока;
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("message_ver",  "2.0"); 
	Заголовки.Добавить("document_type",  "ОтчетОНанесении");
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",            "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать(); 	 
	
КонецПроцедуры

Процедура СоздатьИсходящееСообщениеВводВОборотКИЗ(Источник)  Экспорт
	
	ДатаВремяСобытия = ТекущаяДата();
	
	НовоеСообщение = Справочники.ИсходящиеСообщения.СоздатьЭлемент();
	НовоеСообщение.ОбменДанными.Загрузка = Истина;
	НовоеСообщение.ДатаВремяСобытия = ДатаВремяСобытия;
	НовоеСообщение.ТочкаПубликации = Константы.AMQP_Exchange.Получить();
	НовоеСообщение.Объект = Источник;
	
	ID = Новый УникальныйИдентификатор();     	
	НовоеСообщение.УстановитьСсылкуНового(Справочники.ИсходящиеСообщения.ПолучитьСсылку(ID));
	
	СтруктураДокумента = Новый Структура;
	СтруктураДокумента.Вставить("УникальныйИдентификатор",  Строка(Источник.УникальныйИдентификатор()));
	СтруктураДокумента.Вставить("НомерДокумента", Источник.Номер);   
	СтруктураДокумента.Вставить("ДатаДокумента",  Формат(Источник.Дата, "ДЛФ=DT"));
	СтруктураДокумента.Вставить("ПометкаУдаления",  Источник.ПометкаУдаления);
	СтруктураДокумента.Вставить("КодОрганизацииМДМ",  Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Организация, "КодМДМ")));
	СтруктураДокумента.Вставить("ТоварнаяГруппа",  Источник.ВидПродукции.Алиас);
	СтруктураДокумента.Вставить("ТипДокумента",  "LP_INTRODUCE_OST");

	//Табличная часть 
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ЧислоТип = Новый ОписаниеТипов("Число");
	ДатаТип = Новый ОписаниеТипов("Дата");
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("КодСтроки",ЧислоТип);
	ТаблицаТоваров.Колонки.Добавить("КодМаркировки",СтрокаТип);
	ТаблицаТоваров.Колонки.Добавить("КодМДМНоменклатуры",СтрокаТип);
	
	Для Каждого СтрокаТовары Из Источник.Товары Цикл
		
		НоваяСтрокаТТ = ТаблицаТоваров.Добавить(); 
		НоваяСтрокаТТ.КодСтроки = СтрокаТовары.НомерСтроки;
		НоваяСтрокаТТ.КодМДМНоменклатуры = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТовары.Номенклатура, "КодМДМ"));
		НоваяСтрокаТТ.КодМаркировки = СтрокаТовары.ШтрихКодМаркировки.КодМаркировки;
		
	КонецЦикла;
	
	МассивТоваров = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	СтруктураДокумента.Вставить("КодыМаркировки", МассивТоваров);
	
	//Запись в JSON
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураДокумента);
	JsonСтрока = ЗаписьJSON.Закрыть();	
	
	НовоеСообщение.Сообщение = JsonСтрока;
	
	Заголовки = Новый СписокЗначений;
	Заголовки.Добавить("message_ver",  "2.0"); 
	Заголовки.Добавить("document_type", "ВводВоборот");
	
	Если ЗначениеЗаполнено(Заголовки) Тогда
		
		Для каждого Заголовок Из Заголовки Цикл
			
			НоваяСтрока = НовоеСообщение.Заголовки.Добавить();
			НоваяСтрока.Наименование = Заголовок.Значение;
			НоваяСтрока.Значение = Заголовок.Представление;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Свойства = Новый СписокЗначений;
	Свойства.Добавить("ТипСодержимого", "application/json"); 
	Свойства.Добавить("ОтметкаВремени", ДатуВTimestamp(НовоеСообщение.ДатаВремяСобытия));   	
	Свойства.Добавить("Тип",            "document"); 
	Свойства.Добавить("ИмяПриложения",  Константы.AMQP_ИдентификаторИнформацСистемы.Получить());
	Свойства.Добавить("РежимДоставки",  2);
	Свойства.Добавить("НомерСообщения", Строка(НовоеСообщение.ПолучитьСсылкуНового().УникальныйИдентификатор()));
	
	Для каждого Свойство Из Свойства Цикл
		
		НоваяСтрока = НовоеСообщение.Свойства.Добавить();
		НоваяСтрока.Наименование = Свойство.Значение;
		НоваяСтрока.Значение = Свойство.Представление;
		
	КонецЦикла; 	
	
	НовоеСообщение.Записать(); 	 
	
КонецПроцедуры

Процедура ОтправитьДокументыНаПроверкуВЧЗ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка,
	|	МАКСИМУМ(ЕСТЬNULL(ДокументыЭДОТребующиеОбработки.Идентификатор, НЕОПРЕДЕЛЕНО)) КАК Идентификатор
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|		ПО ПоступлениеТоваровУслуг.Ссылка = ЗначенияСвойствОбъектов.Объект
	|			И (ЗначенияСвойствОбъектов.Свойство = &СтатусПриемки)
	|			И (ЗначенияСвойствОбъектов.Значение В (&ЗначенияСтатусовОтправки))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЭДОТребующиеОбработки КАК ДокументыЭДОТребующиеОбработки
	|		ПО (ДокументыЭДОТребующиеОбработки.Документ = ПоступлениеТоваровУслуг.Ссылка)
	|ГДЕ
	|	ЕСТЬNULL(ДокументыЭДОТребующиеОбработки.Отработан, ИСТИНА) = ИСТИНА
	|	И ЕСТЬNULL(ДокументыЭДОТребующиеОбработки.КоличествоПопытокОтправкиНаПроверкуВЧЗ, 0) <= 3
	|	И ПоступлениеТоваровУслуг.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслуг.Ссылка";
	
	Запрос.УстановитьПараметр("СтатусПриемки", ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки);
	
	ЗначенияСтатусовОтправки = Новый Массив;
	ЗначенияСтатусовОтправки.Добавить(Перечисления.СтатусыПриемки.НаПроверкеВЧЗ);
	ЗначенияСтатусовОтправки.Добавить(Перечисления.СтатусыПриемки.НеНайденВЭДО);
	
	Запрос.УстановитьПараметр("ЗначенияСтатусовОтправки", ЗначенияСтатусовОтправки);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Идентификатор) Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(Выборка.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.НеНайденВЭДО);			
		Иначе
			
			Менеджер = РегистрыСведений.ДокументыЭДОТребующиеОбработки.СоздатьМенеджерЗаписи();		
			Менеджер.Идентификатор = Выборка.Идентификатор;
			Менеджер.Прочитать();
			
			Если Менеджер.Выбран() Тогда
				
				Если Не Менеджер.ОтправленНаПроверкуВЧЗ Тогда	
					
					Если ЗначениеЗаполнено(Выборка.Ссылка.file_id) Тогда
						
						РезультатОтправки = ОтправитьНаПроверкуВЧЗ(Выборка.Ссылка);
						
						Если РезультатОтправки.Результат Тогда 
							
							Менеджер.ОтправленНаПроверкуВЧЗ = Истина;
							Менеджер.ТекстОшибкиЧЗ = "";  
							
						Иначе       
							
							Менеджер.КоличествоПопытокОтправкиНаПроверкуВЧЗ = Менеджер.КоличествоПопытокОтправкиНаПроверкуВЧЗ + 1;
							Менеджер.ТекстОшибкиЧЗ = РезультатОтправки.Сообщение;	
	
						КонецЕсли;
						
						МСКWEB.УстановитьЗначениеДопСвойства(Выборка.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.НаПроверкеВЧЗ);			
						
					Иначе     					
						
						Менеджер.ТекстОшибкиЧЗ = "У поступления не заполнен реквизит file_id";	
						МСКWEB.УстановитьЗначениеДопСвойства(Выборка.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ОшибкаПроверкиЧЗ);					
						
					КонецЕсли;
					
					Менеджер.Записать(); 	
					
				Иначе
					
					Если Менеджер.ПроверенВЧЗ Тогда
						МСКWEB.УстановитьЗначениеДопСвойства(Выборка.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ПоступилНаСклад);				
					ИначеЕсли ЗначениеЗаполнено(Менеджер.ТекстОшибкиЧЗ) Тогда
						МСКWEB.УстановитьЗначениеДопСвойства(Выборка.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПриемки, Перечисления.СтатусыПриемки.ОшибкаПроверкиЧЗ);					
					КонецЕсли;
					
				КонецЕсли;     						
				
			КонецЕсли;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

Функция ОтправитьНаПроверкуВЧЗ(Документ) Экспорт
	
	СтруктураВозврата = Новый Структура("Результат, Сообщение", Ложь, "");
	
	Метод = "/api/v1/documents/status?orgId=" + Константы.ОсновнаяОрганизация.Получить().КодМДМГоловнойОрганизации + "&sourceName=" + Константы.AMQP_ИдентификаторИнформацСистемы.Получить();
	
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();
	Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;            
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Новый Структура("sourceId, fileId", Строка(Документ.УникальныйИдентификатор()), Документ.file_id));
	
	Тело = Новый Структура;
	Тело.Вставить("docs", МассивДокументов);
	
	АдресЗапроса = "http://" + АдресСервиса + Метод;
	
	ЗаписьЖурналаРегистрации("Проверка в ЧЗ.Подготовка", УровеньЖурналаРегистрации.Информация, , , "Подготовка запроса на проверку в ЧЗ: " + Символы.ПС + "Адрес запроса: " + АдресЗапроса + Символы.ПС + "Тело запроса: " + ОбщегоНазначения.ВернутьJSON(Тело));
	
	Попытка
		Ответ = OPI_ЗапросыHTTP.PostСТелом(АдресЗапроса, Тело,,,Истина,,1,10);	
	Исключение
		
		СтруктураВозврата.Сообщение = "Не удалось установить соединение: " + ОписаниеОшибки();	
		Возврат СтруктураВозврата;
		
	КонецПопытки;         
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ОтветСтрока = Ответ.ПолучитьТелоКакСтроку();
		
		ОтветСтруктура = ОбщегоНазначения.ВернутьСтруктуруИзJSON(ОтветСтрока);
		
		ЗаписьЖурналаРегистрации("Проверка в ЧЗ.Ответ", УровеньЖурналаРегистрации.Информация, , , "Был получен ответ при отправке на проверку: " + ОтветСтрока);
		
		Если ОтветСтруктура.Свойство("result") Тогда
			
			Если ОтветСтруктура.result Тогда
				
				СтруктураВозврата.Результат = Истина;  
				ЗаписьЖурналаРегистрации("Проверка в ЧЗ.Успешно", УровеньЖурналаРегистрации.Информация, , , "Был успешно выполнен запрос на проверку в ЧЗ");
				
			Иначе
				СтруктураВозврата.Сообщение = ОтветСтруктура.error;
			КонецЕсли;
			
		Иначе
			СтруктураВозврата.Сообщение = "При отправке запроса на проверку в ЧЗ не удалось получить результат. Ответ: " + ОтветСтрока;		
		КонецЕсли;
		
	Иначе		
		СтруктураВозврата.Сообщение = "Не удалось отправить запрос на проверку в ЧЗ. Код ответа: " + Строка(Ответ.КодСостояния);		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Преобразовывает текстовое представление типа документа в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска      - ПеречислениеСсылка.ВидыОперацийИСМП, Строка - значение для перекодировки.
//	ВидПродукции        - Неопределено, ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции.
//	ОбъемноСортовойУчет - Булево - Признак объемно-сортового учета.
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыОперацийИСМП, Строка - Тип документа.
Функция ВидОперации(Знач ЗначениеПоиска, ВидПродукции = Неопределено, ОбъемноСортовойУчет = Ложь) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "LP_INTRODUCE_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ;
		ИначеЕсли ЗначениеПоиска = "LP_GOODS_IMPORT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС;
		ИначеЕсли ЗначениеПоиска = "LP_FTS_INTRODUCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС;
		ИначеЕсли ЗначениеПоиска = "FURS_FTS_INTRODUCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех;
		ИначеЕсли ЗначениеПоиска = "LK_CONTRACT_COMMISSIONING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору;
		ИначеЕсли ЗначениеПоиска = "LK_INDI_COMMISSIONING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц;
		ИначеЕсли ЗначениеПоиска = "LP_INTRODUCE_OST" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков;
		ИначеЕсли ЗначениеПоиска = "CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля;
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_GOODS_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "EAS_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "EAS_GTIN_CROSSBORDER_ACCEPTANCE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_SHIP_RECEIPT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_CANCEL_SHIPMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_CANCEL_SHIPMENT_CROSSBORDER" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LP_ACCEPT_GOODS" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ПустаяСсылка();
		ИначеЕсли ЗначениеПоиска = "LK_REMARK" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.Перемаркировка;
		ИначеЕсли ЗначениеПоиска = "LK_KM_CANCELLATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки;
		ИначеЕсли ЗначениеПоиска = "LK_APPLIED_KM_CANCELLATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СписаниеВведенныхВОборотКодовМаркировки;
		ИначеЕсли ЗначениеПоиска = "AGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияСоздание;
		ИначеЕсли ЗначениеПоиска = "SETS_AGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора;
		ИначеЕсли ЗначениеПоиска = "DISAGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияУдаление;
		ИначеЕсли ЗначениеПоиска = "REAGGREGATION_DOCUMENT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АгрегацияИзменение;
		ИначеЕсли ЗначениеПоиска = "OST_DESCRIPTION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки;
		ИначеЕсли ЗначениеПоиска = "LP_RETURN" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриДистанционномСпособеПродажи;
		ИначеЕсли ЗначениеПоиска = "ATK_AGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКСоздание;
		ИначеЕсли ЗначениеПоиска = "ATK_TRANSFORMATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКИзменение;
		ИначеЕсли ЗначениеПоиска = "ATK_DISAGGREGATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.АТКУдаление;
		ИначеЕсли ЗначениеПоиска = "LK_GTIN_RECEIPT" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВыводИзОборота;
		ИначеЕсли ЗначениеПоиска = "LK_GTIN_RECEIPT_CANCEL" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование;
		ИначеЕсли ЗначениеПоиска = "LK_INDIVIDUALIZATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ИндивидуализацияКИЗ;
		ИначеЕсли ЗначениеПоиска = "CIRCULATION_INFORMATION" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот;
		ИначеЕсли ЗначениеПоиска = "CIRCULATION_INFORMATION_2" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот;
		ИначеЕсли ЗначениеПоиска = "REPORT_REWEIGHING" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании;
		ИначеЕсли ЗначениеПоиска = "CIS_INFORMATION_CHANGE" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ;
		ИначеЕсли ЗначениеПоиска = "CONNECT_TAP" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.ВскрытиеПотребительскойУпаковки;
		ИначеЕсли ЗначениеПоиска = "WRITE_OFF" Тогда
			Возврат Перечисления.ВидыОперацийИСМП.СписаниеКодовВыбывшихДоОбязательностиМаркировки;
		КонецЕсли;
	Иначе
		Если ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФ Тогда
			Возврат "LP_INTRODUCE_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС Тогда
			Возврат "LP_GOODS_IMPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС Тогда
			Возврат "LP_FTS_INTRODUCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТСМех Тогда
			Возврат "FURS_FTS_INTRODUCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговору
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоРФПоДоговоруНаСторонеЗаказчика Тогда
			Возврат "LK_CONTRACT_COMMISSIONING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц Тогда
			Возврат "LK_INDI_COMMISSIONING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
			Возврат "LP_INTRODUCE_OST";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля Тогда
			Возврат "CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ИндивидуализацияКИЗ Тогда
			Возврат "LK_INDIVIDUALIZATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаКомиссия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаАгент Тогда
			Возврат "LP_SHIP_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаБезвозмезднаяПередача
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаДляСобственныхНуждПокупателя
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаПриобретениеГосПредприятием Тогда
			Возврат "LP_SHIP_RECEIPT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаЕАЭССПризнаниемКИ Тогда
			Возврат "EAS_CROSSBORDER_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаВЕАЭСПриОСУ Тогда
			Возврат "EAS_GTIN_CROSSBORDER_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаТрансграничнаяТорговля Тогда
			Возврат "LP_SHIP_GOODS_CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаАннулирование Тогда
			Возврат "LP_CANCEL_SHIPMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтгрузкаТрансграничнаяТорговляАннулирование Тогда
			Возврат "LP_CANCEL_SHIPMENT_CROSSBORDER";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен // ОСУ
			И ЭтоМолочнаяПродукцияИСМП(ВидПродукции)
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭСПриОСУ Тогда
			Возврат "EAS_GTIN_CROSSBORDER_ACCEPTANCE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаТрансграничнаяТорговля
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаКомиссия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаБезвозмезднаяПередача
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаАгент
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаОтклонен
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ПриемкаИзЕАЭССПризнаниемКМ Тогда
			Возврат "LP_ACCEPT_GOODS";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.Перемаркировка Тогда
			Возврат "LK_REMARK";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировки
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеЭмитированныхКодовМаркировкиПриПоступлении Тогда
			Возврат "LK_KM_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеВведенныхВОборотКодовМаркировки Тогда
			Возврат "LK_APPLIED_KM_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияСоздание Тогда
			Возврат "AGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияСозданиеНабора Тогда
			Возврат "SETS_AGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияУдаление Тогда
			Возврат "DISAGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АгрегацияИзменение Тогда
			Возврат "REAGGREGATION_DOCUMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировкиЗапросGTINНаОстатки Тогда
			Возврат "OST_DESCRIPTION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков Тогда
			Возврат "LP_INTRODUCE_OST";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРозничнаяПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЭкспортВСтраныЕАЭС
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЭкспортЗаПределыСтранЕАЭС
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаВозвратФизическомуЛицу
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУтратаПовреждениеТовара
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУничтожениеТовара
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаКонфискацияТовара
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаЛиквидацияПредприятия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляСобственныхНуждПредприятия
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаДругое
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаОтзывСРынка
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоСделкеСоставляющейГосударственнуюТайну
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляПроизводственныхЦелей
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.УдалитьВыводИзОборотаПродажаПоОбразцамДистанционнаяПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоОбразцам
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаДистанционнаяПродажа
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаУтилизацияТовара
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаФасовка
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаЧерезВендинговыйАппарат
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПродажаПоГосударственномуКонтракту
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаБезвозмезднаяПередача
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИстечениеСрокаГодности
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаРеализацияНезарегистрированномуУчастнику
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляМедицинскогоПрименения
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаИспользованиеДляВетеринарногоПрименения
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаКорректировкаОстатковОСУ Тогда
			Если ОбъемноСортовойУчет Тогда
				Возврат "LK_GTIN_RECEIPT";
			Иначе
				Возврат "LK_RECEIPT";
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВыводИзОборотаПриОСУАннулирование Тогда
			Возврат "LK_GTIN_RECEIPT_CANCEL";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриДистанционномСпособеПродажи
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараПриобретавшегосяНеДляПродажи
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборотТовараВыведенногоДляПроизводственныхЦелей
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриРозничнойРеализации
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВозвратВОборотПриПродажеЧерезВендинговыйАппарат Тогда
			Возврат "LP_RETURN";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКСоздание Тогда
			Возврат "ATK_AGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКИзменение Тогда
			Возврат "ATK_TRANSFORMATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.АТКУдаление Тогда
			Возврат "ATK_DISAGGREGATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СведенияОКодахИдентификацииДляВводаВОборот Тогда
			Возврат "CIRCULATION_INFORMATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СведенияОРазрешительнойДокументацииДляВводаВОборот Тогда
			Возврат "CIRCULATION_INFORMATION_2";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ОтчетОПеревзвешивании Тогда
			Возврат "REPORT_REWEIGHING";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМ
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодности
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМСрокГодностиВСД
			Или ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.КорректировкаСведенийКМФактическийВес Тогда
			Возврат "CIS_INFORMATION_CHANGE";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.ВскрытиеПотребительскойУпаковки Тогда
			Возврат "CONNECT_TAP";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыОперацийИСМП.СписаниеКодовВыбывшихДоОбязательностиМаркировки Тогда
			Возврат  "WRITE_OFF";
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид операции: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление товарной группы в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.ВидыПродукцииИС, Строка - значение для перекодировки
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для уточнения неоднозначности 
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПродукцииИС, Строка - Товарная группа.
Функция ТоварнаяГруппа(Знач ЗначениеПоиска, ВидПродукции = Неопределено) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ЗначениеПоиска = НРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "lp" Или ЗначениеПоиска = "clothes" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность;
		ИначеЕсли ЗначениеПоиска = "shoes" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Обувь;
		ИначеЕсли ЗначениеПоиска = "perfumery" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Духи;
		ИначеЕсли ЗначениеПоиска = "tires" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Шины;
		ИначеЕсли ЗначениеПоиска = "electronics" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Фотоаппараты;
		ИначеЕсли ЗначениеПоиска = "milk" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
				Возврат Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "bicycle" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Велосипеды;
		ИначеЕсли ЗначениеПоиска = "wheelchairs" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.ТехническиеСредстваРеабилитации Тогда
				Возврат Перечисления.ВидыПродукцииИС.ТехническиеСредстваРеабилитации;
			ИначеЕсли ВидПродукции = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия Тогда
				Возврат Перечисления.ВидыПродукцииИС.МедицинскиеИзделия;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.КреслаКоляски;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "otp" Тогда
			Возврат Перечисления.ВидыПродукцииИС.АльтернативныйТабак;
		ИначеЕсли ЗначениеПоиска = "water" Тогда
			Возврат Перечисления.ВидыПродукцииИС.УпакованнаяВода;
		ИначеЕсли ЗначениеПоиска = "tobacco" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Табак;
		ИначеЕсли ЗначениеПоиска = "beer" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках Тогда
				Возврат Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.Пиво;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "ncp" Тогда
			Возврат Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция;
		ИначеЕсли ЗначениеПоиска = "bio" Тогда
			Возврат Перечисления.ВидыПродукцииИС.БАДы;
		ИначеЕсли ЗначениеПоиска = "antiseptic" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Антисептики;
		ИначеЕсли ЗначениеПоиска = "seafood" Тогда
			Возврат Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС;
		ИначеЕсли ЗначениеПоиска = "furs" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;
		ИначеЕсли ЗначениеПоиска = "softdrinks" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.БезалкогольныеНапитки Тогда
				Возврат Перечисления.ВидыПродукцииИС.БезалкогольныеНапитки;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.СоковаяПродукция;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "nabeer" Тогда
			Возврат Перечисления.ВидыПродукцииИС.БезалкогольноеПиво;
		ИначеЕсли ЗначениеПоиска = "petfood" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС Тогда
				Возврат Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "meat" Тогда
			Возврат Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС;
		ИначеЕсли ЗначениеПоиска = "vetpharma" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты;
		ИначеЕсли ЗначениеПоиска = "toys" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей;
		ИначеЕсли ЗначениеПоиска = "radio" Тогда
			Возврат Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция;
		ИначеЕсли ЗначениеПоиска = "titan" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция;
		ИначеЕсли ЗначениеПоиска = "conserve" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС Тогда
				Возврат Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "vegetableoil" Тогда
			Возврат Перечисления.ВидыПродукцииИС.РастительныеМасла;
		ИначеЕсли ЗначениеПоиска = "opticfiber" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция;
		ИначеЕсли ЗначениеПоиска = "chemistry" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия;
		ИначеЕсли ЗначениеПоиска = ПечатнаяПродукцияИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПечатнаяПродукция;
		ИначеЕсли ЗначениеПоиска = СтроительныеМатериалыИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.СтроительныеМатериалы;
		ИначеЕсли ЗначениеПоиска = ОтопительныеПриборыИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.ОтопительныеПриборы;
		ИначеЕсли ЗначениеПоиска = БакалеяИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.Бакалея;
		ИначеЕсли ЗначениеПоиска = АлкогольнаяПродукцияДо9ПроцентовИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов;
		ИначеЕсли ЗначениеПоиска = ТелефоныИНоутбукиИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.ТелефоныИНоутбуки;
		ИначеЕсли ЗначениеПоиска = ПиротехническиеИзделияИСредстваПожарнойБезопасностиИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПиротехническиеИзделияИСредстваПожарнойБезопасности;
		ИначеЕсли ЗначениеПоиска = КабельнаяПродукцияИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.КабельнаяПродукция;
		ИначеЕсли ЗначениеПоиска = МоторныеМаслаИмяТоварнойГруппы() Тогда
			Возврат Перечисления.ВидыПродукцииИС.МоторныеМасла;
		Иначе
			Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеПоиска) = Тип("ПеречислениеСсылка.ВидыПродукцииИС") Тогда
		Если ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность Тогда
			Возврат "lp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Обувь Тогда
			Возврат "shoes";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Духи Тогда
			Возврат "perfumery";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Шины Тогда
			Возврат "tires";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
			Возврат "electronics";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
				Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
			Возврат "milk";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
			Возврат "bicycle";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КреслаКоляски
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ТехническиеСредстваРеабилитации
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МедицинскиеИзделия Тогда
			Возврат "wheelchairs";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Возврат "otp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
			Возврат "water";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Табак Тогда
			Возврат "tobacco";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Пиво
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПивоВПотребительскихУпаковках Тогда
			Возврат "beer";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
			Возврат "ncp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БАДы Тогда
			Возврат "bio";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Антисептики Тогда
			Возврат "antiseptic";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
			Возврат "seafood";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			Возврат "furs";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.СоковаяПродукция
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БезалкогольныеНапитки Тогда
			Возврат "softdrinks";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
			Возврат "nabeer";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС Тогда
			Возврат "petfood";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС Тогда
			Возврат "meat";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты Тогда
			Возврат "vetpharma";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей Тогда
			Возврат "toys";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция Тогда
			Возврат "radio";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция Тогда
			Возврат "titan";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС Тогда
			Возврат "conserve";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РастительныеМасла Тогда
			Возврат "vegetableoil";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция Тогда
			Возврат "opticfiber";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
			Возврат "chemistry";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПечатнаяПродукция Тогда
			Возврат ПечатнаяПродукцияИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.СтроительныеМатериалы Тогда
			Возврат СтроительныеМатериалыИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ОтопительныеПриборы Тогда
			Возврат ОтопительныеПриборыИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Бакалея Тогда
			Возврат БакалеяИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.АлкогольнаяПродукцияДо9Процентов Тогда
			Возврат АлкогольнаяПродукцияДо9ПроцентовИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ТелефоныИНоутбуки Тогда
			Возврат ТелефоныИНоутбукиИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПиротехническиеИзделияИСредстваПожарнойБезопасности Тогда
			Возврат ПиротехническиеИзделияИСредстваПожарнойБезопасностиИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КабельнаяПродукция Тогда
			Возврат КабельнаяПродукцияИмяТоварнойГруппы();
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МоторныеМасла Тогда
			Возврат МоторныеМаслаИмяТоварнойГруппы();
		КонецЕсли;
	КонецЕсли;
	
	Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
	
КонецФункции

Функция ЕстьНоменклатураТребующаяМаркировки(тзТовары) Экспорт
	
	//+Шульман А. 20.10.2025 #UT10-5457
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(тзТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&тзТовары КАК тзТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|ГДЕ
		|	ВТ_Товары.Номенклатура.ТребуетсяМаркировка";
	
	Запрос.УстановитьПараметр("тзТовары", тзТовары);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
    //-Шульман А. 20.10.2025 #UT10-5457

КонецФункции // ()

Процедура ЗаполнениеРеквизитовВШтрихкодахМаркировки() Экспорт
	
	//+Макрушин Е. 28.11.2025 #UT10-5554
	// перенесено из УТ 11
	ИмяРегЗадания = "Заполнение реквизитов в штрихкодах маркировки";
	ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Начало", УровеньЖурналаРегистрации.Информация,,,);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихКодыНоменклатуры.КодМаркировки,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерПП
		|ПОМЕСТИТЬ ВТ_Коды
		|ИЗ
		|	Справочник.ШтрихКодыНоменклатуры КАК ШтрихКодыНоменклатуры
		|ГДЕ
		|	НЕ ШтрихКодыНоменклатуры.ПометкаУдаления
		|	И (ШтрихКодыНоменклатуры.ТипПоступления = 1 ИЛИ ШтрихКодыНоменклатуры.ТипПоступления = 2)
		|	И (ШтрихКодыНоменклатуры.СрокГодности = ДАТАВРЕМЯ(1, 1, 1)
		|	ИЛИ ШтрихКодыНоменклатуры.ДатаПроизводства = ДАТАВРЕМЯ(1, 1, 1))
		|	И НЕ ШтрихКодыНоменклатуры.КодМаркировки = """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦЕЛ(ВТ_Коды.НомерПП / 1000) КАК Порция,
		|	ВТ_Коды.КодМаркировки,
		|	ВТ_Коды.НомерПП
		|ИЗ
		|	ВТ_Коды КАК ВТ_Коды
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порция
		|ИТОГИ ПО
		|	Порция";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;  
	
	Метод = "/api/v1/km_info?orgId=" + Константы.ОсновнаяОрганизация.Получить().КодМДМ;
	
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();
	Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресСервиса,,,,,, ); //Новый ЗащищенноеСоединениеOpenSSL());
	
	ПараметрыЗапроса = Новый Структура();  
	
	ВыборкаПорция = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПорция.Следующий() Цикл
	
		МассивКодов = Новый Массив;  
		//МассивКодов.Добавить("010461001553774121e9(PGgjUFOghk");
		
		Выборка = ВыборкаПорция.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивКодов.Добавить(Выборка.КодМаркировки);
		КонецЦикла;     
		                            
		ПараметрыЗапроса.Вставить("codes", МассивКодов);
		
		Попытка

			СтрокаЗапроса = ОбщегоНазначения.ВернутьJSON(ПараметрыЗапроса);
			
			Заголовки = Новый Соответствие;  
			Заголовки.Вставить("Content-type", "application/json");
			Заголовки.Вставить("Cache-Control", "no-cache");  
			
			HTTPЗапрос = Новый HTTPЗапрос();  
			HTTPЗапрос.АдресРесурса = Метод;
			HTTPЗапрос.Заголовки = Заголовки;     

	    	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			
			Результат  = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
			
		Исключение
			
			ЗаписьЖурналаРегистрации(
				ИмяРегЗадания,
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Окончание", УровеньЖурналаРегистрации.Информация,,,);
			Возврат;
			
		КонецПопытки;
		
		//Ответ = ОбщегоНазначения.HTTPОтветВСтруктуру(Результат);
		
        Ответ = Результат;

		
		Если Не Ответ.КодСостояния = 200 Тогда
			
			ЗаписьЖурналаРегистрации(ИмяРегЗадания, УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при чтении данных");  
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Окончание", УровеньЖурналаРегистрации.Информация,,,);
			Возврат;
		
		КонецЕсли;    
	
		ОтветТелоСтрокой = Ответ.ПолучитьТелоКакСтроку();
		
		Попытка
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветТелоСтрокой);    
			
		Исключение
			
			ЗаписьЖурналаРегистрации(ИмяРегЗадания, УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при разборе JSON-данных"); 
			ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Окончание", УровеньЖурналаРегистрации.Информация,,,);
			Возврат;  
			
		КонецПопытки;
	
		СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь);     
		
		Если Не СтруктураДанных.Свойство("list") Тогда
			Продолжить;
		КонецЕсли;
		
		Для каждого ЭлементМассива Из СтруктураДанных.list Цикл
			
			Если ПустаяСтрока(ЭлементМассива.producedDate) И ПустаяСтрока(ЭлементМассива.expirationDate) Тогда
				Продолжить;
			КонецЕсли;  
			
			СпрШтрихкод = Справочники.ШтрихКодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", ЭлементМассива.cis);
			
			Если СпрШтрихкод.Пустая() Тогда
				Продолжить;
			КонецЕсли;   
			
			СпрОбъект = СпрШтрихкод.ПолучитьОбъект();     
			
			Если Не ПустаяСтрока(ЭлементМассива.producedDate) Тогда
				СпрОбъект.ДатаПроизводства = МСК.СтрокаВДату(Лев(ЭлементМассива.producedDate, 10));
			КонецЕсли;  
			
			Если Не ПустаяСтрока(ЭлементМассива.expirationDate) Тогда
				СпрОбъект.СрокГодности = МСК.СтрокаВДату(Лев(ЭлементМассива.expirationDate, 10));
			КонецЕсли;  
			
		    СпрОбъект.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
		
	ЗаписьЖурналаРегистрации(ИмяРегЗадания + ".Окончание", УровеньЖурналаРегистрации.Информация,,,);
	//-Макрушин Е. 28.11.2025 #UT10-5554
	
КонецПроцедуры

Функция ПроверитьКодыМаркировки(МассивКодов) Экспорт
		
	Метод = "/api/v1/km_check?orgId=" + Константы.ОсновнаяОрганизация.Получить().КодМДМГоловнойОрганизации;
	
	АдресСервиса = Константы.АдресСервераЧестныйЗнак.Получить();
	Если НЕ ЗначениеЗаполнено(АдресСервиса) Тогда
		АдресСервиса = "10.90.100.31:30209";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресСервиса,,,,,, ); //Новый ЗащищенноеСоединениеOpenSSL());
	
	ПараметрыЗапроса = Новый Структура(); 
	
	ПараметрыЗапроса.Вставить("codes", МассивКодов);
	
	Попытка
		
		СтрокаЗапроса = ОбщегоНазначения.ВернутьJSON(ПараметрыЗапроса);
		
		Заголовки = Новый Соответствие;  
		Заголовки.Вставить("Content-type", "application/json");
		Заголовки.Вставить("Cache-Control", "no-cache");  
		
		HTTPЗапрос = Новый HTTPЗапрос();  
		HTTPЗапрос.АдресРесурса = Метод;
		HTTPЗапрос.Заголовки = Заголовки;     
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		Результат  = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
	Исключение
		
		ЗаписьЖурналаРегистрации(
		"ПроверитьКодыМаркировки",
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
		ЗаписьЖурналаРегистрации("ПроверитьКодыМаркировки.Окончание", УровеньЖурналаРегистрации.Информация,,,);
		Возврат Неопределено;
		
	КонецПопытки;
	
	Ответ = Результат;
	
	
	Если Не Ответ.КодСостояния = 200 Тогда
		
		ЗаписьЖурналаРегистрации("ПроверитьКодыМаркировки", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при чтении данных");  
		ЗаписьЖурналаРегистрации("ПроверитьКодыМаркировки.Окончание", УровеньЖурналаРегистрации.Информация,,,);
		Возврат Неопределено;
		
	КонецЕсли;    
	
	ОтветТелоСтрокой = Ответ.ПолучитьТелоКакСтроку();
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ОтветТелоСтрокой);    
		
	Исключение
		
		ЗаписьЖурналаРегистрации("ПроверитьКодыМаркировки", УровеньЖурналаРегистрации.Ошибка, , , "Ошибка при разборе JSON-данных"); 
		ЗаписьЖурналаРегистрации("ПроверитьКодыМаркировки.Окончание", УровеньЖурналаРегистрации.Информация,,,);
		Возврат Неопределено;  
		
	КонецПопытки;
	
	СтруктураДанных = ПрочитатьJSON(ЧтениеJSON, Ложь);     
		
	Возврат СтруктураДанных.result; 
		
КонецФункции


#Область ИмяТоварнойГруппы

Функция ПечатнаяПродукцияИмяТоварнойГруппы()
	Возврат "books";
КонецФункции

Функция СтроительныеМатериалыИмяТоварнойГруппы()
	Возврат "construction";
КонецФункции

Функция ОтопительныеПриборыИмяТоварнойГруппы()
	Возврат "heater";
КонецФункции

Функция БакалеяИмяТоварнойГруппы()
	Возврат "grocery";
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовИмяТоварнойГруппы()
	Возврат "";
КонецФункции

Функция ТелефоныИНоутбукиИмяТоварнойГруппы()
	Возврат "";
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиИмяТоварнойГруппы()
	Возврат "fire";
КонецФункции

Функция КабельнаяПродукцияИмяТоварнойГруппы()
	Возврат "cableraw";
КонецФункции

Функция МоторныеМаслаИмяТоварнойГруппы()
	Возврат "autofluids";
КонецФункции

#КонецОбласти

//ДОПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ МОДУЛЯ
Функция ДатуВTimestamp(пДата = Неопределено) Экспорт
	
	Возврат Формат(Число(?(ТипЗнч(пДата) = Тип("Дата"), пДата, ТекущаяДата())-Дата("19700101")),"ЧН=0; ЧГ=0");
	
КонецФункции

// Перекодирует способ выпуска товаров в для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.СпособыВводаВОборотСУЗ - значение для перекодировки.
//  Назначение     - Строка - СУЗ, ИСМП или ОСТАТКИ
//
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.СпособыВводаВОборотСУЗ - Результат перекодирования.
//
Функция СпособВыпускаВОборот(Знач ЗначениеПоиска,  
	//+Шульман А. 08.10.2025 #UT10-5445
	ПревышенаДатаМаркировкиОстатков,   
	//-Шульман А. 08.10.2025 #UT10-5445
	Назначение = "СУЗ",
	//+Сёмин Р.И. 21.05.2026 #UT10-5862
	ТолькоПеремаркировка = Ложь) Экспорт
	//-Сёмин Р.И. 21.05.2026 #UT10-5862
	
	//+Шульман А. 08.10.2025 #UT10-5445
	//Если ЗначениеПоиска = Перечисления.СпособВводаВОборот.МаркировкаОстатков Тогда
	//	Результат = "REMAINS";    
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособВводаВОборот.Перемаркировка Тогда
	//	Результат = "REMARK";  
	//Иначе
	//	ВызватьИсключение
	//	СтрШаблон(
	//		НСтр("ru = 'Неизвестный способ выпуска в оборот: %1'"),
	//		ЗначениеПоиска);   
	//КонецЕсли;
	
	//+Сёмин Р.И. 21.05.2026 #UT10-5862
	//Если ПревышенаДатаМаркировкиОстатков Тогда
	Если ПревышенаДатаМаркировкиОстатков ИЛИ ТолькоПеремаркировка Тогда
	//+Сёмин Р.И. 21.05.2026 #UT10-5862
	
		Результат = "REAPPLY"// "REMARK";    //-Шульман А. 29.10.2025 #UT10-5486
	Иначе	
	    Результат = "REMAINS";
	КонецЕсли;
	//-Шульман А. 08.10.2025 #UT10-5445
	
	Возврат Результат;

	//Если ЗначениеПоиска = "PRODUCTION" Или ЗначениеПоиска = "LOCAL" Или ЗначениеПоиска = "PRODUCED_IN_RF" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.Производство;
	//ИначеЕсли ЗначениеПоиска = "IMPORT" Или ЗначениеПоиска = "FOREIGN" Или ЗначениеПоиска = "IMPORTED_INTO_RF" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.Импорт;
	//ИначеЕсли ЗначениеПоиска = "REMARK" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	//ИначеЕсли ЗначениеПоиска = "REMAINS" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
	//ИначеЕсли ЗначениеПоиска = "CROSSBORDER" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля;
	//ИначеЕсли ЗначениеПоиска = "COMMISSION" Тогда
	//	Результат = Перечисления.СпособыВводаВОборотСУЗ.Комиссия;
	//	
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "СУЗ" Тогда
	//	Результат = "PRODUCTION";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "ИСМП" Тогда
	//	Результат = "LOCAL";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Производство И Назначение = "ОСТАТКИ" Тогда
	//	Результат = "PRODUCED_IN_RF";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "СУЗ" Тогда
	//	Результат = "IMPORT";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "ИСМП" Тогда
	//	Результат = "FOREIGN";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Импорт И Назначение = "ОСТАТКИ" Тогда
	//	Результат = "IMPORTED_INTO_RF";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка Тогда
	//	Результат = "REMARK";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков Тогда
	//	Результат = "REMAINS";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля Тогда
	//	Результат = "CROSSBORDER";
	//ИначеЕсли ЗначениеПоиска = Перечисления.СпособыВводаВОборотСУЗ.Комиссия Тогда
	//	Результат = "COMMISSION";
	//Иначе
	//	ВызватьИсключение
	//	СтрШаблон(
	//		НСтр("ru = 'Неизвестный способ выпуска в оборот: %1'"),
	//		ЗначениеПоиска);
	//КонецЕсли;
	//
	//Возврат Результат;
	
КонецФункции

// Перекодирует вид сервис провайдера для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Неопределено - сервис-провайдер не используется, коды маркировки получаются самостоятельно,
//                   Строка, ПеречислениеСсылка.ВидыСервисПровайдеровСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ВидыСервисПровайдеровСУЗ - Результат перекодирования.
//
Функция СпособИзготовленияКодовМаркировки(ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Результат = "SELF_MADE";
	ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.Самостоятельно Тогда
		Результат =  "SELF_MADE";
		
	Иначе
		ВызватьИсключение
		СтрШаблон(
		НСтр("ru = 'Неизвестный вид сервис-провайдера: %1'"),
		ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
	Если ЗначениеПоиска = Неопределено Тогда
		Результат = "SELF_MADE";
	Иначе
		
		Если ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.ЦЭМ Тогда
			Результат =  "CEM";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.КонтрактноеПроизводство Тогда
			Результат =  "CM";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.ЛогистическийСклад Тогда
			Результат =  "CL";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка Тогда
			Результат =  "CA";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыСервисПровайдеровСУЗ.Самостоятельно Тогда
			Результат =  "SELF_MADE";
		ИначеЕсли ЗначениеПоиска = "CEM" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.ЦЭМ;
		ИначеЕсли ЗначениеПоиска = "CM" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.КонтрактноеПроизводство;
		ИначеЕсли ЗначениеПоиска = "CL" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.ЛогистическийСклад;
		ИначеЕсли ЗначениеПоиска = "CA" Тогда
			Результат = Перечисления.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка;
		Иначе
			ВызватьИсключение
			СтрШаблон(
			НСтр("ru = 'Неизвестный вид сервис-провайдера: %1'"),
			ЗначениеПоиска);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Перекодирует шаблон кода маркировки и тип кода для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - Результат перекодирования.
//
Функция ТипКодаМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ") Тогда
		
		ВидУпаковки = ВидУпаковкиПоШаблонуКодаМаркировки(ЗначениеПоиска);
		Если ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			Результат = "GROUP";
		ИначеЕсли ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор Тогда
			Результат = "SET";
		ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ДухиКомплект
			Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыКомплект
			Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьКомплект Тогда
			Результат = "BUNDLE";
		Иначе
			Результат = "UNIT";
		КонецЕсли;
	
	ИначеЕсли ЗначениеПоиска = "UNIT" Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Духи;
	ИначеЕсли ЗначениеПоиска = "BUNDLE" Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ДухиКомплект;
	ИначеЕсли ЗначениеПоиска = "GROUP" Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковка;
	ИначеЕсли ЗначениеПоиска = "SET" Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНабор;
	
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный тип кода маркировки: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Преобразовывает шаблона кода маркировки в вид упаковки
// 
// Параметры:
// 	Шаблон - ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - Шаблон кода маркировки.
// Возвращаемое значение:
// 	ПеречислениеСсылка.ВидыУпаковокИС - Вид упаковки.
Функция ВидУпаковкиПоШаблонуКодаМаркировки(Шаблон) Экспорт
	
	//Если ЗначениеЗаполнено(Шаблон) Тогда
	//	Если ИнтеграцияИСМПКлиентСервер.ШаблоныГрупповыхУпаковок().Найти(Шаблон) <> Неопределено Тогда
	//		Возврат ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Групповая");
	//	ИначеЕсли ИнтеграцияИСМПКлиентСервер.ШаблоныНаборов().Найти(Шаблон) <> Неопределено Тогда
	//		Возврат ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Набор");
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидыУпаковокИС.Потребительская");
	
КонецФункции

// Перекодирует шаблон кода маркировки для обмена с СУЗ ИС МП.
//
// Параметры:
//  ЗначениеПоиска - Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - значение для перекодировки.
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.ШаблоныКодовМаркировкиСУЗ - Результат перекодирования.
//
Функция ШаблонКодаМаркировки(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = 1 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь;
	ИначеЕсли ЗначениеПоиска = 3 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек;
	ИначеЕсли ЗначениеПоиска = 4 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка;
	ИначеЕсли ЗначениеПоиска = 6 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС;
	ИначеЕсли ЗначениеПоиска = 7 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Шины;
	ИначеЕсли ЗначениеПоиска = 8 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Фотоаппараты;
	ИначеЕсли ЗначениеПоиска = 10 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность;
	ИначеЕсли ЗначениеПоиска = 9 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Духи;
	ИначеЕсли ЗначениеПоиска = 11 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Велосипеды;
	ИначеЕсли ЗначениеПоиска = 12 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КреслаКоляски;
	ИначеЕсли ЗначениеПоиска = 14 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок;
	ИначеЕсли ЗначениеПоиска = 15 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачка;
	ИначеЕсли ЗначениеПоиска = 16 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВода;
	ИначеЕсли ЗначениеПоиска = 18 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Пиво;
	ИначеЕсли ЗначениеПоиска = 20 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС;
	ИначеЕсли ЗначениеПоиска = 21 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияБлок; // Блок и набор имеют одинаковый шаблон
	ИначеЕсли ЗначениеПоиска = 22 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка;
	ИначеЕсли ЗначениеПоиска = 23 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДы;
	ИначеЕсли ЗначениеПоиска = 25 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Антисептики;
	ИначеЕсли ЗначениеПоиска = 27 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МорепродуктыСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = 28 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.БезалкогольноеПиво;
	ИначеЕсли ЗначениеПоиска = 29 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.СоковаяПродукция;
	ИначеЕсли ЗначениеПоиска = 30 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = 31 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = 38 Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Морепродукты;
	ИначеЕсли ЗначениеПоиска = КормаДляЖивотныхПодконтрольныеВЕТИСКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотных;
	ИначеЕсли ЗначениеПоиска = КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИС;
	ИначеЕсли ЗначениеПоиска = КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИССтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Мясо;
	ИначеЕсли ЗначениеПоиска = МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ВетеринарныеПрепаратыКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепараты;
	ИначеЕсли ЗначениеПоиска = ВетеринарныеПрепаратыКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетей;
	ИначеЕсли ЗначениеПоиска = ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукция;
	ИначеЕсли ЗначениеПоиска = РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ТитановаяМеталлопродукцияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукция;
	ИначеЕсли ЗначениеПоиска = ТитановаяМеталлопродукцияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукция;
	ИначеЕсли ЗначениеПоиска = КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИС;
	ИначеЕсли ЗначениеПоиска = КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИССтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = РастительныеМаслаКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМасла;
	ИначеЕсли ЗначениеПоиска = РастительныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукция;
	ИначеЕсли ЗначениеПоиска = ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия;
	ИначеЕсли ЗначениеПоиска = ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ПечатнаяПродукцияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукция;
	ИначеЕсли ЗначениеПоиска = ПечатнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = СтроительныеМатериалыКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалы;
	ИначеЕсли ЗначениеПоиска = СтроительныеМатериалыКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ОтопительныеПриборыКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборы;
	ИначеЕсли ЗначениеПоиска = ОтопительныеПриборыКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = БакалеяКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.Бакалея;
	ИначеЕсли ЗначениеПоиска = БакалеяКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9Процентов;
	ИначеЕсли ЗначениеПоиска = АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ТелефоныИНоутбукиКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТелефоныИНоутбуки;
	ИначеЕсли ЗначениеПоиска = ТелефоныИНоутбукиКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТелефоныИНоутбукиСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасности;
	ИначеЕсли ЗначениеПоиска = ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = КабельнаяПродукцияКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукция;
	ИначеЕсли ЗначениеПоиска = КабельнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияСтандартныйКМ;
	ИначеЕсли ЗначениеПоиска = МоторныеМаслаКодШаблонаКодаМаркировки() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМасла;
	ИначеЕсли ЗначениеПоиска = МоторныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ() Тогда
		Результат = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаСтандартныйКМ;

	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Обувь Тогда
		Результат = 1;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БлокТабачныхПачек Тогда
		Результат = 3;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТабачнаяПачка Тогда
		Результат = 4;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезУказанияСроковГодностиВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СкоропортящаясяМолочнаяПродукцияВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИС Тогда
		Результат = 6;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Шины Тогда
		Результат = 7;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Фотоаппараты
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ФотоаппаратыНабор Тогда
		Результат = 8;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Духи
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ДухиНабор Тогда
		Результат = 9;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьКомплект
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьНабор Тогда
		Результат = 10;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Велосипеды Тогда
		Результат = 11;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КреслаКоляски
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КреслаКоляскиНабор
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КреслаКоляскиГрупповаяУпаковка Тогда
		Результат = 12;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачкаGS1 Тогда
		Результат = 14;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакБлок Тогда
		Результат = 14;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АльтернативныйТабакПачка Тогда
		Результат = 15;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВода
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.УпакованнаяВодаГрупповаяУпаковка Тогда
		Результат = 16;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Пиво
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПивоГрупповаяУпаковка Тогда
		Результат = 18;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияСерия6СимволовБезВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияПодконтрольнаяВЕТИСНабор
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МолочнаяПродукцияБезВЕТИСНабор Тогда
		Результат = 20;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияБлок
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияНабор Тогда
		Результат = 21;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.НикотиносодержащаяПродукцияПачка Тогда
		Результат = 22;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДы
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыНабор Тогда
		Результат = 23;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Антисептики
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНабор Тогда
		Результат = 25;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МорепродуктыСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МорепродуктыГрупповаяУпаковкаСтандартныйКМ Тогда
		Результат = 27;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БезалкогольноеПиво Тогда
		Результат = 28;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СоковаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СоковаяПродукцияНабор
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СоковаяПродукцияГрупповаяУпаковка Тогда
		Результат = 29;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БАДыНаборСтандартныйКМ Тогда
		Результат = 30;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АнтисептикиНаборСтандартныйКМ Тогда
		Результат = 31;
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Морепродукты
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МорепродуктыГрупповаяУпаковка Тогда
		Результат = 38;
	
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотных
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхНабор Тогда
		Результат = КормаДляЖивотныхПодконтрольныеВЕТИСКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхНаборСтандартныйКМ Тогда
		Результат = КормаДляЖивотныхПодконтрольныеВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИСГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИСНабор Тогда
		Результат = КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИССтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИСГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КормаДляЖивотныхБезВЕТИСНаборСтандартныйКМ Тогда
		Результат = КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Мясо
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоНабор Тогда
		Результат = МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МясоНаборСтандартныйКМ Тогда
		Результат = МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепараты
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыНабор Тогда
		Результат = ВетеринарныеПрепаратыКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ВетеринарныеПрепаратыНаборСтандартныйКМ Тогда
		Результат = ВетеринарныеПрепаратыКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетей
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейНабор Тогда
		Результат = ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ИгрыИИгрушкиДляДетейНаборСтандартныйКМ Тогда
		Результат = ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияНабор Тогда
		Результат = РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РадиоэлектроннаяПродукцияНаборСтандартныйКМ Тогда
		Результат = РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияНабор Тогда
		Результат = ТитановаяМеталлопродукцияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ТитановаяМеталлопродукцияНаборСтандартныйКМ Тогда
		Результат = ТитановаяМеталлопродукцияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияНабор Тогда
		Результат = КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияНаборСтандартныйКМ Тогда
		Результат = КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИС
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИСГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИСНабор Тогда
		Результат = КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИССтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИСГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КонсервированнаяПродукцияБезВЕТИСНаборСтандартныйКМ Тогда
		Результат = КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМасла
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаНабор Тогда
		Результат = РастительныеМаслаКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.РастительныеМаслаНаборСтандартныйКМ Тогда
		Результат = РастительныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияНабор Тогда
		Результат = ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОптоволокноИОптоволоконнаяПродукцияНаборСтандартныйКМ Тогда
		Результат = ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияНабор Тогда
		Результат = ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПарфюмерныеИКосметическиеСредстваИБытоваяХимияНаборСтандартныйКМ Тогда
		Результат = ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияНабор Тогда
		Результат = ПечатнаяПродукцияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПечатнаяПродукцияНаборСтандартныйКМ Тогда
		Результат = ПечатнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалы
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыНабор Тогда
		Результат = СтроительныеМатериалыКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.СтроительныеМатериалыНаборСтандартныйКМ Тогда
		Результат = СтроительныеМатериалыКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборы
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыНабор Тогда
		Результат = ОтопительныеПриборыКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ОтопительныеПриборыНаборСтандартныйКМ Тогда
		Результат = ОтопительныеПриборыКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.Бакалея
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяНабор Тогда
		Результат = БакалеяКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.БакалеяНаборСтандартныйКМ Тогда
		Результат = БакалеяКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9Процентов
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовНабор Тогда
		Результат = АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.АлкогольнаяПродукцияДо9ПроцентовНаборСтандартныйКМ Тогда
		Результат = АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасности
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиНабор Тогда
		Результат = ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиГрупповаяУпаковкаСтКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.ПиротехническиеИзделияИСредстваПожарнойБезопасностиНаборСтандартныйКМ Тогда
		Результат = ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукция
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияНабор Тогда
		Результат = КабельнаяПродукцияКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.КабельнаяПродукцияНаборСтандартныйКМ Тогда
		Результат = КабельнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМасла
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаГрупповаяУпаковка
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаНабор Тогда
		Результат = МоторныеМаслаКодШаблонаКодаМаркировки();
	ИначеЕсли ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаГрупповаяУпаковкаСтандартныйКМ
		Или ЗначениеПоиска = Перечисления.ШаблоныКодовМаркировкиСУЗ.МоторныеМаслаНаборСтандартныйКМ Тогда
		Результат = МоторныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ();
	Иначе
		ВызватьИсключение
			СтрШаблон(
				НСтр("ru = 'Неизвестный шаблон кода маркировки: %1'"),
				ЗначениеПоиска);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОстаткиНоменклатурыДляМаркировки(МассивНоменклатура, УсловиеЯчейки) Экспорт
	
	//+Шульман А. 01.10.2025 #UT10-5445   
	// Запрос взят из УправлениеЗапасами.ПолучитьДеревоОстатковНоменклатуры() и модифицирован
	Запрос = Новый Запрос;
	Запрос.Текст =         
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатуры,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК ТоварыНаСкладахОстатки,
	|	0 КАК ТоварыВРезервеСкладахОстатки,
	|	0 КАК ТоварыВЯчейкахОстатки,
	|	0 КАК ТоварыВСборкеОстатки
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В (&МассивНоменклатура)) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВРезервеСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеСкладахОстатки.Склад,
	|	0,
	|	СУММА(ТоварыВРезервеСкладахОстатки.КоличествоОстаток),
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Номенклатура В (&МассивНоменклатура)) КАК ТоварыВРезервеСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВРезервеСкладахОстатки.Номенклатура,
	|	ТоварыВРезервеСкладахОстатки.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Склад,
	|	0,
	|	0,
	|	СУММА(ТоварыВЯчейкахОстатки.КоличествоОстаток),
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(
	|			,
	|			Номенклатура В (&МассивНоменклатура)
	|				И &УсловиеЯчейки) КАК ТоварыВЯчейкахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВЯчейкахОстатки.Номенклатура,
	|	ТоварыВЯчейкахОстатки.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыВСборкеОстатки.Номенклатура,
	|	&ОсновнойСклад,
	|	0,
	|	0,
	|	0,
	|	СУММА(ТоварыВСборкеОстатки.КСборкеОстаток + ТоварыВСборкеОстатки.СобраноОстаток)
	|ИЗ
	|	РегистрНакопления.ТоварыВСборке.Остатки(, Номенклатура В (&МассивНоменклатура)) КАК ТоварыВСборкеОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВСборкеОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.Номенклатуры КАК Номенклатура,
	|	СУММА(ВТ_Остатки.ТоварыНаСкладахОстатки) КАК Общий,
	|	СУММА(ВТ_Остатки.ТоварыНаСкладахОстатки - ВТ_Остатки.ТоварыВРезервеСкладахОстатки) КАК Свободный,
	|	СУММА(ВЫБОР
	|			КОГДА &Перемаркировка
	|				ТОГДА ВТ_Остатки.ТоварыВЯчейкахОстатки
	|			ИНАЧЕ ВТ_Остатки.ТоварыВЯчейкахОстатки + ВТ_Остатки.ТоварыВСборкеОстатки - ВТ_Остатки.ТоварыВРезервеСкладахОстатки
	|		КОНЕЦ) КАК СвободныйСРазмещением,
	|	СУММА(ВТ_Остатки.ТоварыВРезервеСкладахОстатки) КАК ВРезерве
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.Номенклатуры
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВТ_Остатки.ТоварыНаСкладахОстатки - ВТ_Остатки.ТоварыВРезервеСкладахОстатки) >= 0";
	
	Запрос.УстановитьПараметр("ОсновнойСклад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("МассивНоменклатура", МассивНоменклатура);   
	Запрос.УстановитьПараметр("ЯчейкаДляПеремаркировки", Константы.ЯчейкаДляПеремаркировки.Получить());
	//+Марков И. 01.11.2025 #UT10-5488
	Запрос.УстановитьПараметр("Перемаркировка", НЕ ВРЕГ(СОКРЛП(УсловиеЯчейки)) = "ИСТИНА");
	//-Марков И. 01.11.2025 #UT10-5488
	
	Если ВРЕГ(СОКРЛП(УсловиеЯчейки)) = "ИСТИНА" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЯчейки", "НЕ Ячейка.НеУчитыватьВОперативномУчете");
	Иначе	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеЯчейки", УсловиеЯчейки);      
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	//-Шульман А. 01.10.2025 #UT10-5445

КонецФункции // ()

#Область КодШаблонаКодаМаркировки

Функция КормаДляЖивотныхПодконтрольныеВЕТИСКодШаблонаКодаМаркировки()
	Возврат 41;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировки()
	Возврат 41;
КонецФункции

Функция МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировки()
	Возврат 0;
КонецФункции

Функция ВетеринарныеПрепаратыКодШаблонаКодаМаркировки()
	Возврат 0;
КонецФункции

Функция ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировки()
	Возврат 59;
КонецФункции

Функция РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировки()
	Возврат 37;
КонецФункции

Функция ТитановаяМеталлопродукцияКодШаблонаКодаМаркировки()
	Возврат 39;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировки()
	Возврат 49;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировки()
	Возврат 49;
КонецФункции

Функция РастительныеМаслаКодШаблонаКодаМаркировки()
	Возврат 40;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировки()
	Возврат 45;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировки()
	Возврат 47;
КонецФункции

Функция ПечатнаяПродукцияКодШаблонаКодаМаркировки()
	Возврат 0;
КонецФункции

Функция СтроительныеМатериалыКодШаблонаКодаМаркировки()
	Возврат 53;
КонецФункции

Функция ОтопительныеПриборыКодШаблонаКодаМаркировки()
	Возврат 57;
КонецФункции

Функция БакалеяКодШаблонаКодаМаркировки()
	Возврат 43;
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к молочной продукции ИСМП.
//
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для анализа
// Возвращаемое значение:
//  Булево - Принадлежность к виду молочной продукции ИСМП.
//
Функция ЭтоМолочнаяПродукцияИСМП(ВидПродукции) Экспорт
	Возврат ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС");
КонецФункции


Функция АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировки()
	Возврат 0;
КонецФункции

Функция ТелефоныИНоутбукиКодШаблонаКодаМаркировки()
	Возврат 0;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировки()
	Возврат 55;
КонецФункции

Функция КабельнаяПродукцияКодШаблонаКодаМаркировки()
	Возврат 62;
КонецФункции

Функция МоторныеМаслаКодШаблонаКодаМаркировки()
	Возврат 60;
КонецФункции

#КонецОбласти

#Область КодШаблонаКодаМаркировкиСтандартныйКМ

Функция КормаДляЖивотныхПодконтрольныеВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 26;
КонецФункции

Функция КормаДляЖивотныхБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 26;
КонецФункции

Функция МясоПодконтрольноеВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 32;
КонецФункции

Функция ВетеринарныеПрепаратыКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 50;
КонецФункции

Функция ИгрыИИгрушкиДляДетейКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 34;
КонецФункции

Функция РадиоэлектроннаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 36;
КонецФункции

Функция ТитановаяМеталлопродукцияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 0;
КонецФункции

Функция КонсервированнаяПродукцияПодконтрольнаяВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 48;
КонецФункции

Функция КонсервированнаяПродукцияБезВЕТИСКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 48;
КонецФункции

Функция РастительныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 51;
КонецФункции

Функция ОптоволокноИОптоволоконнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 44;
КонецФункции

Функция ПарфюмерныеИКосметическиеСредстваИБытоваяХимияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 46;
КонецФункции

Функция ПечатнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 52;
КонецФункции

Функция СтроительныеМатериалыКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 54;
КонецФункции

Функция ОтопительныеПриборыКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 58;
КонецФункции

Функция БакалеяКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 42;
КонецФункции

Функция АлкогольнаяПродукцияДо9ПроцентовКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 0;
КонецФункции

Функция ТелефоныИНоутбукиКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 0;
КонецФункции

Функция ПиротехническиеИзделияИСредстваПожарнойБезопасностиКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 56;
КонецФункции

Функция КабельнаяПродукцияКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 63;
КонецФункции

Функция МоторныеМаслаКодШаблонаКодаМаркировкиСтандартныйКМ()
	Возврат 61;
КонецФункции

#КонецОбласти

