
&НаСервереБезКонтекста
Процедура ОтправитьСервер(НомерСообщения, Сообщение, Ответ);
    
    
    Получатель=ПараметрыСеанса.ТекущийПользователь;	
    
    УстановитьПривилегированныйРежим(Истина);
    
    Набор = РегистрыСведений.ОповещенияПользователей.СоздатьНаборЗаписей();
    Набор.Отбор.Получатель.Установить(Получатель);
    Набор.Отбор.НомерСообщения.Установить(НомерСообщения);
    Набор.Прочитать();
    
    Если Набор.Количество() > 0 Тогда
        
        НовыйНабор = Набор[0];
        
        НовыйНабор.ВремяПрочтения = Дата(1,1,1, час(ТекущаяДата()),Минута(ТекущаяДата()), Секунда(ТекущаяДата()));
        НовыйНабор.Прочитано = Истина;
        НовыйНабор.Ответ = Ответ;
        
        Набор.Записать();
    КонецЕсли;
    
    Если ПривилегированныйРежим() Тогда
        
        УстановитьПривилегированныйРежим(Ложь);
        
    КонецЕсли; 
    
КонецПроцедуры 


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    ПоказатьОповещениеПользователя (Заголовок,ПолучитьНавигационнуюСсылку(ЭтаФорма),Тема, БиблиотекаКартинок.РегламентноеЗадание);
    
    Если ТолькоПросмотр Тогда
        
        Элементы.Отправить.Доступность = Ложь;
        Элементы.ПрочитатьПозднее.Доступность = Ложь;
        Элементы.ЗакрытьПрограмму.Доступность = Ложь;
        
    Иначе
        
        ЗаписатьОповещениеОДоставкеНаСервере();
        
    КонецЕсли; 
    
    
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
    
    Если ЗавершитьРаботу = Истина Тогда
        
        ЗавершитьРаботуСистемы();
        
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти  



#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Прочитано(Команда)
    
    ОтправитьСервер(НомерСообщения,Сообщение, Ответ);
    
    ОчиститьСообщения();
    
    Оповестить("ОбновитьСписок");
    
    Закрыть();
    
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьПрограмму(Команда)
    
    ЗавершитьРаботу=Истина;
    
    Прочитано(Неопределено);	
    
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьПозднее(Команда)
    
    ЗаписатьОповещениеОДоставкеНаСервере();
    
    Закрыть();
    
КонецПроцедуры


#КонецОбласти  


#Область ДополнительныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьОповещениеОДоставкеНаСервере()
    
    ПараметрыЗаписиОДоставке = РегистрыСведений.ОповещенияПользователей.СтруктураОбработкиОповещения();
    
    ЗаполнитьЗначенияСвойств(ПараметрыЗаписиОДоставке,ЭтаФорма);
    
    РегистрыСведений.ОповещенияПользователей.ЗаписатьОповещениеОДоставке(ПараметрыЗаписиОДоставке);	
    
КонецПроцедуры


#КонецОбласти  
