
Функция ПолучитьТекстЗапросаПоКодамМаркировки() Экспорт	
	
	//+Макрушин Е. 29.01.2026 #UT10-5635
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаИзлишковИзАкта.КодМаркировки,
	|	0 КАК Передано,
	|	1 КАК Отсканировано
	|ПОМЕСТИТЬ ТаблицаИзлишковИзАкта
	|ИЗ
	|	&ТаблицаИзлишковИзАкта КАК ТаблицаИзлишковИзАкта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеТоваровУслугКодыМаркировки.КодМаркировки,
	|	1 КАК Передано,
	|	0 КАК Отсканировано
	|ПОМЕСТИТЬ ВТ_КодыПоПТУ
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.КодыМаркировки КАК ПоступлениеТоваровУслугКодыМаркировки
	|ГДЕ
	|	ПоступлениеТоваровУслугКодыМаркировки.Ссылка = &ПТУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.КодМаркировки,
	|	0,
	|	1
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.ОтсканированныеКодыМаркировки КАК ПоступлениеТоваровУслугОтсканированныеКодыМаркировки
	|ГДЕ
	|	ПоступлениеТоваровУслугОтсканированныеКодыМаркировки.Ссылка = &ПТУ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаИзлишковИзАкта.КодМаркировки,
	|	ТаблицаИзлишковИзАкта.Передано,
	|	ТаблицаИзлишковИзАкта.Отсканировано
	|ИЗ
	|	ТаблицаИзлишковИзАкта КАК ТаблицаИзлишковИзАкта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.КодМаркировки КАК КодМаркировки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Передано = ВложенныйЗапрос.Отсканировано
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принято,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Передано > ВложенныйЗапрос.Отсканировано
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Недостача,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Отсканировано > ВложенныйЗапрос.Передано
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Излишек,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Передано = ВложенныйЗапрос.Отсканировано
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоПринято,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Передано > ВложенныйЗапрос.Отсканировано
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Отсканировано > ВложенныйЗапрос.Передано
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоИзлишек,
//+Макрушин Е. 09.04.2026 #UT10-5800
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Передано > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Передано,
	|	ВложенныйЗапрос.Передано КАК КоличествоПередано
//-Макрушин Е. 09.04.2026 #UT10-5800
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_КодыПоПТУ.КодМаркировки.Номенклатура КАК Номенклатура,
	|		ВТ_КодыПоПТУ.КодМаркировки КАК КодМаркировки,
	|		СУММА(ВТ_КодыПоПТУ.Передано) КАК Передано,
	|		СУММА(ВТ_КодыПоПТУ.Отсканировано) КАК Отсканировано
	|	ИЗ
	|		ВТ_КодыПоПТУ КАК ВТ_КодыПоПТУ
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_КодыПоПТУ.КодМаркировки,
	|		ВТ_КодыПоПТУ.КодМаркировки.Номенклатура) КАК ВложенныйЗапрос
	|ГДЕ
	|	(&Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ИЛИ ВложенныйЗапрос.Номенклатура = &Номенклатура)
	|	И ВложенныйЗапрос.Номенклатура.ТребуетсяМаркировка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	Принято УБЫВ,
	|	Недостача УБЫВ,
	|	Излишек УБЫВ,
	|	КодМаркировки
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;
	//-Макрушин Е. 29.01.2026 #UT10-5635

КонецФункции	
	
Функция ПолучитьIDСкладаСобственныйСклад(ПТУ) Экспорт
	
	//+Макрушин Е. 10.02.2026 #UT10-5665
	Результат = Справочники.СобственныеСклады.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПоступлениеТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику,
	|	ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад КАК IDСкладаСобственныйСклад
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка = &ПТУ
	|	И ПоступлениеТоваровУслугТовары.ЗаказПоставщику <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
	|	И ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад <> ЗНАЧЕНИЕ(Справочник.СобственныеСклады.ПустаяСсылка)
	|	И ПоступлениеТоваровУслугТовары.ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";

	Запрос.УстановитьПараметр("ПТУ", ПТУ);

	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Если Выборка.Следующий() Тогда
		Результат = Выборка.IDСкладаСобственныйСклад;
	КонецЕсли;
	
	Возврат Результат;
	//-Макрушин Е. 10.02.2026 #UT10-5665
	
КонецФункции