

//	&НаКлиенте
//Процедура СписокЗаданий_Вверх(Команда)
//	Объект.СписокЗаданий_ТекСтрока = Объект.СписокЗаданий_ТекСтрока - 1;
//	Если Объект.СписокЗаданий_ТекСтрока = 0 Тогда
//		Объект.СписокЗаданий_ТекСтрока = СписокЗаданий_ПолучитьКоличествоСтрокНаСтранице();
//	КонецЕсли;
//	Элементы.СписокЗаданий.ТекущаяОбласть = СписокЗаданий.Область(Объект.СписокЗаданий_ТекСтрока + 1, 1, Объект.СписокЗаданий_ТекСтрока + 1, 5);
//КонецПроцедуры

//&НаКлиенте
//Процедура СписокЗаданий_Вниз(Команда)
//	Объект.СписокЗаданий_ТекСтрока = Объект.СписокЗаданий_ТекСтрока + 1;
//	Если Объект.СписокЗаданий_ТекСтрока = СписокЗаданий_ПолучитьКоличествоСтрокНаСтранице() + 1 Тогда
//		Объект.СписокЗаданий_ТекСтрока = 1;
//	КонецЕсли;
//	Элементы.СписокЗаданий.ТекущаяОбласть = СписокЗаданий.Область(Объект.СписокЗаданий_ТекСтрока + 1, 1, Объект.СписокЗаданий_ТекСтрока + 1, 5);
//КонецПроцедуры

	
	//Объект.ТекущаяДата = '20171014';
	//Объект.ТекущийВодитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Ахтареев Ренат Рамильевич", Истина);
	//СписокЗаданий.Очистить();
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЗаданиеНаДоставкуДоставка.Контрагент КАК Контрагент,
	//|	ЗаданиеНаДоставкуДоставка.Контрагент.ПриоритетВМаршруте КАК ПриоритетВМаршруте,
	//|	СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК Кол,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	//|				ТОГДА """"
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	//|						ТОГДА АдресДоставки.Представление
	//|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	//|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	//|								ТОГДА """"
	//|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	//|						КОНЕЦ + "" "" + ВЫБОР
	//|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	//|								ТОГДА """"
	//|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	//|						КОНЕЦ + """"
	//|				КОНЕЦ
	//|		КОНЕЦ КАК СТРОКА(999)) КАК АдресДоставки,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	//|				ТОГДА """"
	//|			ИНАЧЕ ТелефонКонтрагента.Представление
	//|		КОНЕЦ КАК СТРОКА(100)) КАК Тел,
	//|	ЗаданиеНаДоставкуДоставка.Ссылка
	//|ИЗ
	//|	Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	//|		ПО ЗаданиеНаДоставкуДоставка.Контрагент = АдресДоставки.Объект
	//|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	//|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	//|		ПО ЗаданиеНаДоставкуДоставка.Контрагент = ТелефонКонтрагента.Объект
	//|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	//|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	//|ГДЕ
	//|	НАЧАЛОПЕРИОДА(ЗаданиеНаДоставкуДоставка.Ссылка.Дата, ДЕНЬ) = &ТекущаяДата
	//|	И ЗаданиеНаДоставкуДоставка.Ссылка.Водитель = &ТекущийВодитель
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЗаданиеНаДоставкуДоставка.Контрагент,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	//|				ТОГДА """"
	//|			ИНАЧЕ ТелефонКонтрагента.Представление
	//|		КОНЕЦ КАК СТРОКА(100)),
	//|	ЗаданиеНаДоставкуДоставка.Контрагент.ПриоритетВМаршруте,
	//|	ВЫРАЗИТЬ(ВЫБОР
	//|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	//|				ТОГДА """"
	//|			ИНАЧЕ ВЫБОР
	//|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	//|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	//|						ТОГДА АдресДоставки.Представление
	//|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	//|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	//|								ТОГДА """"
	//|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	//|						КОНЕЦ + "" "" + ВЫБОР
	//|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	//|								ТОГДА """"
	//|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	//|						КОНЕЦ + """"
	//|				КОНЕЦ
	//|		КОНЕЦ КАК СТРОКА(999)),
	//|	ЗаданиеНаДоставкуДоставка.Ссылка
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ПриоритетВМаршруте,
	//|	Контрагент
	//|АВТОУПОРЯДОЧИВАНИЕ";
	//Запрос.УстановитьПараметр("ТекущаяДата", Объект.ТекущаяДата);
	//Запрос.УстановитьПараметр("ТекущийВодитель", Объект.ТекущийВодитель);
