Функция Печать() Экспорт
	
	ТабДок	=	Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = Формат(Дата, "ДЛФ=D");
	ОбластьМакета.Параметры.Водитель = Водитель;
	ОбластьМакета.Параметры.Маршрут = Маршрут;
	ТабДок.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	// (также в отчет должны попадать РТУ, в заказах которых Оплата наличными
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданиеНаДоставкуОбороты.ЗаданиеНаСборку,
	|	ЗаданиеНаДоставкуОбороты.Контрагент
	|ПОМЕСТИТЬ Сборки
	|ИЗ
	|	РегистрНакопления.ЗаданиеНаДоставку.Обороты(, , Регистратор, ) КАК ЗаданиеНаДоставкуОбороты
	|ГДЕ
	|	ЗаданиеНаДоставкуОбороты.Регистратор = &Регистратор
	|	И ЗаданиеНаДоставкуОбороты.Водитель = &Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Контрагент,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.СуммаДокумента,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента КАК Договор
	|ПОМЕСТИТЬ Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|ГДЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки В
	|			(ВЫБРАТЬ
	|				Т.ЗаданиеНаСборку
	|			ИЗ
	|				Сборки КАК Т)
	|	И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента.ОплатаПоДоговоруНаличными
	|	И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Реализации_ОплатаНаличными.Ссылка,
	|	Реализации_ОплатаНаличными.Ссылка.Контрагент,
	|	Реализации_ОплатаНаличными.Ссылка.СуммаДокумента,
	|	Реализации_ОплатаНаличными.Ссылка.ДоговорКонтрагента
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Ссылка,
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Контрагент КАК Контрагент,
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.СуммаДокумента КАК СуммаДокумента,
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ЕСТЬNULL(ПродажиОбороты.ЗаказПокупателя.ОплатаНаличными, ЛОЖЬ) КАК ОплатаНаличными
	|	ИЗ
	|		Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты КАК ПродажиОбороты
	|			ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = ПродажиОбороты.ДокументПродажи
	|	ГДЕ
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки В
	|				(ВЫБРАТЬ
	|					Т.ЗаданиеНаСборку
	|				ИЗ
	|					Сборки КАК Т)
	|		И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен) КАК Реализации_ОплатаНаличными
	|ГДЕ
	|	Реализации_ОплатаНаличными.ОплатаНаличными = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Реализации.Реализация,
	|	Реализации.Контрагент,
	|	Реализации.СуммаДокумента,
	|	Реализации.Договор,
	|	ЕСТЬNULL(ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток, 0) КАК Долг
	|ИЗ
	|	Реализации КАК Реализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
	|				&Д,
	|				Контрагент В
	|					(ВЫБРАТЬ
	|						Т.Контрагент.ГоловнойКонтрагент
	|					ИЗ
	|						Сборки КАК Т)) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|		ПО Реализации.Контрагент.ГоловнойКонтрагент = ВзаиморасчетыСКонтрагентамиОстатки.Контрагент
	|			И Реализации.Договор = ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента";
	
   	Запрос.УстановитьПараметр("Д", Дата);
	Запрос.УстановитьПараметр("Водитель", Водитель);
	Запрос.УстановитьПараметр("Регистратор", ЗаданиеНаДоставку);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Запрос.Текст = Запрос.Текст + "  ГДЕ Реализации.Реализация.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", Организация);
		
	КонецЕсли;
	
	Итого = 0;
	Сч   = 1; 
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда

		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данных нет!!");
		Возврат Неопределено;
		
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Сч = Сч;
		ОбластьМакета.Параметры.НомерДокумента = СокрЛП(Выборка.Реализация.Номер);
		ОбластьМакета.Параметры.НименованиеКонтрагента = Выборка.Контрагент;
		ОбластьМакета.Параметры.АдресДоставки = МСК.ПолучитьАдресДоставки(Выборка.Контрагент);
		ОбластьМакета.Параметры.ДатаДокумента = Формат(Выборка.Реализация.Дата, "ДЛФ=D");
		ОбластьМакета.Параметры.баланс = Выборка.Долг;
		
		ВсегоКОплате = ?(Выборка.СуммаДокумента = Цел(Выборка.СуммаДокумента), Выборка.СуммаДокумента, Цел(Выборка.СуммаДокумента) + 1);
		ОбластьМакета.Параметры.СуммаДок = ВсегоКОплате;
		Итого = Итого + ВсегоКОплате;
		
		ТабДок.Вывести(ОбластьМакета);
		Сч = Сч	+ 1;
		
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Итого = Формат(Итого, "ЧЦ=12; ЧДЦ=2");
	
	ТабДок.ИмяПараметровПечати=	"ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьПоНаличнымВзаиморасчетам";
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.Вывести(ОбластьМакета);
	
	Возврат ТабДок;
	
КонецФункции
	
	
	