
&НаСервере
Функция ОбработатьВыделенныеСтрокиНаСервере(МассивСообщений) 
	
	Результат = Новый Массив;
	
	Для каждого Сообщение Из МассивСообщений Цикл
		
		ИмяОчереди = Сообщение.Подписка.ИмяОчереди;
		
		Если Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Документ Тогда
			
			//+Шульман А. 21.11.2024 #UT10-4912 
			Если МСК.ЭтоОчередьПрайсПМ(ИмяОчереди) Тогда  
				
				Отказ = Ложь;  
				//+Шульман А. 01.04.2025 #UT10-5173
				//МСК.ОбработатьСообщениеPricePM(Сообщение, Отказ);    
				МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);
				//-Шульман А. 01.04.2025 #UT10-5173
				
			//-Шульман А. 21.11.2024 #UT10-4912 
			//+Белов А. 14.09.2026 #UT10-6038
			ИначеЕсли МСК.ЭтоОчередьУТ10ВУТ10(ИмяОчереди) Тогда
			   
				Отказ = Ложь;     
				МСК.ОбработатьСообщениеJSON(Сообщение, Отказ); 
			//-Белов А. 14.09.2026 #UT10-6038  
				
			Иначе	
			
				Отказ = Ложь;               
				
				//+Шульман А. 01.04.2025 #UT10-5173
				ТекстСообщения = Сообщение.Данные;
				ЭтоСообщениеJSON = Найти(ТекстСообщения, "/json") 
				//+Шульман А. 18.04.2025 #UT10-5201
				Или Найти(ВРЕГ(ТекстСообщения), "ID_EDI") 
				//-Шульман А. 18.04.2025 #UT10-5201  
				//+Шульман А. 02.07.2025 #UT10-5329
				Или Маркировка.ЭтоОчередьПоМаркировке(ИмяОчереди);  
				//-Шульман А. 02.07.2025 #UT10-5329
				
				Если ЭтоСообщениеJSON Тогда
					МСК.ОбработатьСообщениеJSON(Сообщение, Отказ);   
				//-Шульман А. 01.04.2025 #UT10-5173    
				Иначе
					МСК.ОбработатьСообщениеИзОчереди(ИмяОчереди, Сообщение.Данные, Отказ, Сообщение.КоличествоПопытокПовторнойОбработки);  
				КонецЕсли;
			
			КонецЕсли;
			
		//ИначеЕсли Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Регистр Тогда
			
			
		//ИначеЕсли Сообщение.ТипСообщения = Перечисления.Р_ТипыВходящихСообщений.Справочник Тогда
		//	
		//	Ссылка = Р_ЗагрузкаСправочников.ЗагрузитьСправочник(Сообщение); 
		//	
		//	Если ЗначениеЗаполнено(Ссылка) Тогда
		//		Результат.Добавить(Ссылка);
		//	КонецЕсли;
			
		Иначе
			Сообщить("Не определен тип сообщения у: " + Строка(Сообщение));
		КонецЕсли;
		
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыделенныеСтроки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВопросаООбработкеВыделенных", ЭтаФорма, Новый Структура("ВФоне", Ложь));
	
	ПоказатьВопрос(ОписаниеОповещения, "Вы действительно хотите запустить обработку выделенных строк?",РежимДиалогаВопрос.ДаНет, 60);
	
КонецПроцедуры


&НаКлиенте
Процедура ОкончаниеВопросаООбработкеВыделенных(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		МассивСообщений = Новый Массив;
		
		ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
		
		Для каждого Стр Из ВыделенныеСтроки Цикл
			
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(Стр);
			МассивСообщений.Добавить(ДанныеСтроки.Ссылка);
			
		КонецЦикла; 
		
		МассивЗагрузок = ОбработатьВыделенныеСтрокиНаСервере(МассивСообщений);
		
		Для Каждого Ссылка Из МассивЗагрузок Цикл  
			
			Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Тогда
				ПоказатьЗначение(, Ссылка);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Элемент") И ОбщегоНазначения.ЕстьРеквизитОбъекта("КодМДМ", Параметры.Элемент.Метаданные()) Тогда
		Список.Параметры.УстановитьЗначениеПараметра("КодИсточника", Параметры.Элемент.КодМДМ); 
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("КодИсточника", Неопределено); 
	КонецЕсли;	

КонецПроцедуры




