#Область СлужебныеПроцедуры

&НаКлиенте
Процедура ОткрытьОкноВопроса(ТекстВопроса, ОписаниеОповещения)

	ПараметрыФормыВопроса = Новый Структура("ТекстВопроса", ТекстВопроса);
	ФормаВопроса = ПолучитьФорму(ПолучитьПутьКОбработке() + "ФормаВопроса", ПараметрыФормыВопроса, ЭтаФорма);
	ФормаВопроса.ОписаниеОповещенияОЗакрытии = ОписаниеОповещения;
	ФормаВопроса.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаВопроса.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектОбработки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект;
КонецФункции
&НаСервере
Функция ПолучитьПутьКОбработке()	
	ПутьКФормам = ПолучитьОбъектОбработки().Метаданные().ПолноеИмя() + ".Форма.";	
	Возврат ПутьКФормам;
КонецФункции
&НаКлиенте
Функция ПолучитьОбщийМодульКлиента()
	Возврат ПолучитьФорму(ПолучитьПутьКОбработке() + "ОбщийМодульКлиент");	
КонецФункции

&НаСервере
Процедура ВывестиУведомлениеПользователю(Знач ТекстСообщенияПользователю)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.ПутьКДанным = "Объект";
	Сообщение.ИдентификаторНазначения = ЭтаФорма.УникальныйИдентификатор;
	
	Сообщение.Сообщить();
	ПолучитьОбъектОбработки().ДобавитьВЖурнал(ТекстСообщенияПользователю, "Модуль формы");
КонецПроцедуры


#КонецОбласти


#Область Интерфейс

&НаКлиенте
Процедура ТаблицаКонтрагентовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры
&НаКлиенте
Процедура ПригласитьКонтрагентов(Команда)
	ПригласитьКонтрагентовНаСервере();
	Оповестить("ОбновлениеСпискаКонтрагентов");
	Закрыть();
КонецПроцедуры


#КонецОбласти

#Область ОбщиеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(Объект, Параметры);
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	ТаблицаДанных = ОбработкаОбъект.ПолучитьВсехКонтрагентов(Истина);
	ТаблицаКонтрагентов.Загрузить(ТаблицаДанных);
КонецПроцедуры

&НаСервере
Процедура ПригласитьКонтрагентовНаСервере()
	ОбработкаОбъект = ПолучитьОбъектОбработки();
	Для Каждого Контрагент Из ТаблицаКонтрагентов Цикл
		Если Контрагент.НаличиеВЭДО И Контрагент.Пригласить Тогда
			ОбработкаОбъект.ОтправитьЗапросНаОбменСКонтрагентом(Контрагент.ИдентификаторКонтрагента);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры


#КонецОбласти




