

//Возвращает строковое представление документа для отображения в сообщениях
//Параметры
// 		Ссылка - ссылка на документ
// 		Номер - номер документа
// 		Дата - дата документа
Функция ПолучитьПредставлениеДокумента(Ссылка, Номер, Дата) Экспорт
	
	Возврат Ссылка.Метаданные().Синоним + 
		?(ЗначениеЗаполнено(Номер), " " + Номер, "") + 
		?(ЗначениеЗаполнено(Дата), " от " + Формат(Дата,"ДЛФ=D"), "");
	
КонецФункции


Функция ВернутьПредставлениеСчетФактуры(Реализация, Дата)
	
	СтруктураСДанными = Новый Структура;
	СтруктураСДанными.Вставить("Представление","");
	СтруктураСДанными.Вставить("Номер", ""  );
	СтруктураСДанными.Вставить("Дата", ""  );
	СтруктураСДанными.Вставить("ДатаСФ", '00010101');
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СчетФактураВыданныйДокументыОснования.Ссылка,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Дата,
	|	СчетФактураВыданныйДокументыОснования.Ссылка.Номер
	|ИЗ
	|	Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(СчетФактураВыданныйДокументыОснования.Ссылка.Дата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|	И СчетФактураВыданныйДокументыОснования.Ссылка.Проведен
	|	И СчетФактураВыданныйДокументыОснования.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДокументОснование", Реализация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		СтруктураСДанными.Вставить("Представление",ПолучитьПредставлениеДокумента(Выборка.Ссылка, Выборка.Номер,Выборка.Дата));
		СтруктураСДанными.Вставить("Номер",  ОбщегоНазначения.ПолучитьНомерНаПечать(Выборка.Ссылка) );
		СтруктураСДанными.Вставить("Дата", Формат(Выборка.Дата ,"ДФ=dd.MM.yyyy") );
		СтруктураСДанными.Вставить("ДатаСФ", Выборка.Дата);
		
	КонецЕсли;
	
	Возврат СтруктураСДанными;

КонецФункции
	
Функция ПолучитьКонтрактнуюИнформацию(Ссылка)
	
	глСоответствиеДомов = Новый Соответствие;
	глСоответствиеДомов.Вставить(Перечисления.ТипыДомов.Дом,"д.");
	глСоответствиеДомов.Вставить(Перечисления.ТипыДомов.Владение,"вл.");
	глСоответствиеДомов.Вставить(Перечисления.ТипыДомов.Домовладение,"дв.");
	глСоответствиеДомов.Вставить(Перечисления.ТипыДомов.Здание,"зд.");
	
	глСоответствиеКорпусов = Новый Соответствие;
	глСоответствиеКорпусов.Вставить(Перечисления.ТипыКорпусов.Корпус,"кор.");
	глСоответствиеКорпусов.Вставить(Перечисления.ТипыКорпусов.Строение,"ст.");
	глСоответствиеКорпусов.Вставить(Перечисления.ТипыКорпусов.Литера,"л.");
	глСоответствиеКорпусов.Вставить(Перечисления.ТипыКорпусов.Сооружение,"со.");
	глСоответствиеКорпусов.Вставить(Перечисления.ТипыКорпусов.Участок,"уч.");
	
	глСоответствиеКвартир = Новый Соответствие;
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Квартира,"кв.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Офис,"оф.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Бокс,"б.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Помещение,"п.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Комната,"ко.");
	глСоответствиеКвартир.Вставить(Перечисления.ТипыКвартир.Этаж,"эт.");
	
	СтруктураАдресов = Новый Структура;
	
	СтруктураАдресов.Вставить("АдресПродавца", "");
	СтруктураАдресов.Вставить("АдресПродавцаРФ", "");
	СтруктураАдресов.Вставить("АдресПродавца1", "");
	СтруктураАдресов.Вставить("АдресПродавца2", "");
	СтруктураАдресов.Вставить("АдресПродавца3", "");
	СтруктураАдресов.Вставить("АдресПродавца4", "");
	СтруктураАдресов.Вставить("АдресПродавца5", "");
	СтруктураАдресов.Вставить("АдресПродавца6", "");
	СтруктураАдресов.Вставить("АдресПродавца7", "");
	СтруктураАдресов.Вставить("АдресПродавца8", "");
	СтруктураАдресов.Вставить("АдресПродавца9", "");
	
	СтруктураАдресов.Вставить("АдресПокупателя", "");
	СтруктураАдресов.Вставить("АдресПокупателяРФ", "");
	СтруктураАдресов.Вставить("АдресПокупателя1", "");
	СтруктураАдресов.Вставить("АдресПокупателя2", "");
	СтруктураАдресов.Вставить("АдресПокупателя3", "");
	СтруктураАдресов.Вставить("АдресПокупателя4", "");
	СтруктураАдресов.Вставить("АдресПокупателя5", "");
	СтруктураАдресов.Вставить("АдресПокупателя6", "");
	СтруктураАдресов.Вставить("АдресПокупателя7", "");
	СтруктураАдресов.Вставить("АдресПокупателя8", "");
	СтруктураАдресов.Вставить("АдресПокупателя9", "");
	СтруктураАдресов.Вставить("ЭлАдресПокупателя", "");
	СтруктураАдресов.Вставить("ТелефонПокупателя", "");
	
	СтруктураАдресов.Вставить("АдресГрузоотправителя", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителяРФ", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя1", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя2", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя3", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя4", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя5", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя6", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя7", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя8", "");
	СтруктураАдресов.Вставить("АдресГрузоотправителя9", "");
	
	СтруктураАдресов.Вставить("АдресГрузополучателя", "");
	СтруктураАдресов.Вставить("АдресГрузополучателяРФ", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя1", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя2", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя3", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя4", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя5", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя6", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя7", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя8", "");
	СтруктураАдресов.Вставить("АдресГрузополучателя9", "");
	СтруктураАдресов.Вставить("ЭлАдресГрузополучателя", "");
	СтруктураАдресов.Вставить("ТелефонГрузополучателя", "");
	
	МассивТиповКИ = Новый Массив;
	МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	МассивТиповКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	МассивВидовКИ = Новый Массив;
	МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);
	МассивВидовКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	МассивВидовКИ1 = Новый Массив;
	МассивВидовКИ1.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
	МассивВидовКИ1.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
	МассивВидовКИ1.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыКонтрагентаДляОбменаДокументами);
	МассивВидовКИ1.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(ОрганизацииКонтактнаяИнформация.Представление КАК СТРОКА(256)) КАК Представление,
	|	ОрганизацииКонтактнаяИнформация.Тип,
	|	ОрганизацииКонтактнаяИнформация.Вид,
	|	ОрганизацииКонтактнаяИнформация.Поле1,
	|	ЕСТЬNULL(АдресныйКлассификатор.КодРегионаВКоде, """") КАК Поле2,
	|	ОрганизацииКонтактнаяИнформация.Поле3,
	|	ОрганизацииКонтактнаяИнформация.Поле4,
	|	ОрганизацииКонтактнаяИнформация.Поле5,
	|	ОрганизацииКонтактнаяИнформация.Поле6,
	|	ОрганизацииКонтактнаяИнформация.Поле7,
	|	ОрганизацииКонтактнаяИнформация.Поле8,
	|	ОрганизацииКонтактнаяИнформация.Поле9,
	|	ОрганизацииКонтактнаяИнформация.Поле10,
	|	ВЫРАЗИТЬ(ОрганизацииКонтактнаяИнформация.Комментарий КАК СТРОКА(256)) КАК Комментарий,
	|	ОрганизацииКонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	ОрганизацииКонтактнаяИнформация.ТипДома,
	|	ОрганизацииКонтактнаяИнформация.ТипКорпуса,
	|	ОрганизацииКонтактнаяИнформация.ТипКвартиры
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК ОрганизацииКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ПО ОрганизацииКонтактнаяИнформация.Поле1 = АдресныйКлассификатор.Индекс
	|ГДЕ
	|	ОрганизацииКонтактнаяИнформация.Объект = &Организация
	|	И ОрганизацииКонтактнаяИнформация.Тип В(&Тип)
	|	И ОрганизацииКонтактнаяИнформация.Вид В(&Вид)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(256)) КАК ЮрАдресКонтрагента,
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.Поле1,
	|	ЕСТЬNULL(АдресныйКлассификатор.КодРегионаВКоде, """") КАК Поле2,
	|	КонтрагентыКонтактнаяИнформация.Поле3,
	|	КонтрагентыКонтактнаяИнформация.Поле4,
	|	КонтрагентыКонтактнаяИнформация.Поле5,
	|	КонтрагентыКонтактнаяИнформация.Поле6,
	|	КонтрагентыКонтактнаяИнформация.Поле7,
	|	КонтрагентыКонтактнаяИнформация.Поле8,
	|	КонтрагентыКонтактнаяИнформация.Поле9,
	|	КонтрагентыКонтактнаяИнформация.Поле10,
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Комментарий КАК СТРОКА(256)) КАК Комментарий,
	|	КонтрагентыКонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтрагентыКонтактнаяИнформация.ТипДома,
	|	КонтрагентыКонтактнаяИнформация.ТипКорпуса,
	|	КонтрагентыКонтактнаяИнформация.ТипКвартиры
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ПО КонтрагентыКонтактнаяИнформация.Поле1 = АдресныйКлассификатор.Индекс
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Объект = &Контрагент
	|	И КонтрагентыКонтактнаяИнформация.Тип В(&Тип)
	|	И КонтрагентыКонтактнаяИнформация.Вид В(&Вид)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(256)) КАК ЮрАдресКонтрагента,
	|	КонтрагентыКонтактнаяИнформация.Тип,
	|	КонтрагентыКонтактнаяИнформация.Вид,
	|	КонтрагентыКонтактнаяИнформация.Поле1,
	|	ЕСТЬNULL(АдресныйКлассификатор.КодРегионаВКоде, """") КАК Поле2,
	|	КонтрагентыКонтактнаяИнформация.Поле3,
	|	КонтрагентыКонтактнаяИнформация.Поле4,
	|	КонтрагентыКонтактнаяИнформация.Поле5,
	|	КонтрагентыКонтактнаяИнформация.Поле6,
	|	КонтрагентыКонтактнаяИнформация.Поле7,
	|	КонтрагентыКонтактнаяИнформация.Поле8,
	|	КонтрагентыКонтактнаяИнформация.Поле9,
	|	КонтрагентыКонтактнаяИнформация.Поле10,
	|	ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Комментарий КАК СТРОКА(256)) КАК Комментарий,
	|	КонтрагентыКонтактнаяИнформация.ЗначениеПоУмолчанию,
	|	КонтрагентыКонтактнаяИнформация.ТипДома,
	|	КонтрагентыКонтактнаяИнформация.ТипКорпуса,
	|	КонтрагентыКонтактнаяИнформация.ТипКвартиры
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АдресныйКлассификатор КАК АдресныйКлассификатор
	|		ПО КонтрагентыКонтактнаяИнформация.Поле1 = АдресныйКлассификатор.Индекс
	|ГДЕ
	|	КонтрагентыКонтактнаяИнформация.Объект = &Грузополучатель
	|	И КонтрагентыКонтактнаяИнформация.Тип В(&Тип)
	|	И КонтрагентыКонтактнаяИнформация.Вид В(&Вид1)";
	
	Док	= Ссылка;
	
	Запрос.УстановитьПараметр("Организация", Док.Организация);
	Запрос.УстановитьПараметр("Контрагент", Док.Контрагент);
	Запрос.УстановитьПараметр("Грузополучатель", Док.Грузополучатель);
	
	Запрос.УстановитьПараметр("Тип", МассивТиповКИ);
	Запрос.УстановитьПараметр("Вид", МассивВидовКИ);
	Запрос.УстановитьПараметр("Вид1", МассивВидовКИ1);
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации тогда
			//	
			СтруктураАдресов.АдресПродавца =  Выборка.Представление;
			СтруктураАдресов.АдресПродавцаРФ = СтруктураАдресов.АдресПродавца;
			СтруктураАдресов.АдресПродавца1 = Выборка.Поле1;
			СтруктураАдресов.АдресПродавца2 = Прав("0" + Формат(Выборка.Поле2, "ЧГ=0"), 2);
			СтруктураАдресов.АдресПродавца3 = Выборка.Поле3;
			СтруктураАдресов.АдресПродавца4 = Выборка.Поле4;
			СтруктураАдресов.АдресПродавца5 = Выборка.Поле5;
			СтруктураАдресов.АдресПродавца6 = Выборка.Поле6;
			СтруктураАдресов.АдресПродавца7 = Выборка.Поле7;
			СтруктураАдресов.АдресПродавца8 = Выборка.Поле8;
			СтруктураАдресов.АдресПродавца9 = Выборка.Поле9;
			
		ИначеЕсли Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации тогда
			СтруктураАдресов.АдресГрузоотправителя =  Выборка.Представление;
			СтруктураАдресов.АдресГрузоотправителяРФ = СтруктураАдресов.АдресГрузоотправителя;
			СтруктураАдресов.АдресГрузоотправителя1 = Выборка.Поле1;
			СтруктураАдресов.АдресГрузоотправителя2 = Прав("0" + Формат(Выборка.Поле2, "ЧГ=0"), 2);
			СтруктураАдресов.АдресГрузоотправителя3 = Выборка.Поле3;
			СтруктураАдресов.АдресГрузоотправителя4 = Выборка.Поле4;
			СтруктураАдресов.АдресГрузоотправителя5 = Выборка.Поле5;
			СтруктураАдресов.АдресГрузоотправителя6 = Выборка.Поле6;
			СтруктураАдресов.АдресГрузоотправителя7 = Выборка.Поле7;
			СтруктураАдресов.АдресГрузоотправителя8 = Выборка.Поле8;
			СтруктураАдресов.АдресГрузоотправителя9 = Выборка.Поле9;
			
		КонецЕсли;
		
	КонецЦикла;
	
	//
	Выборка = Пакет[1].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
			
			ЗначениеВывод = "";
			
			СтруктураАдресов.АдресПокупателя 	=	Выборка.ЮрАдресКонтрагента;
			СтруктураАдресов.АдресПокупателяРФ	=	Выборка.ЮрАдресКонтрагента;
			СтруктураАдресов.АдресПокупателя1	=	Выборка.Поле1;
			СтруктураАдресов.АдресПокупателя2	=	Прав("0" + Формат(Выборка.Поле2, "ЧГ=0"), 2);
			СтруктураАдресов.АдресПокупателя3	=	Выборка.Поле3;
			СтруктураАдресов.АдресПокупателя4	=	Выборка.Поле4;
			СтруктураАдресов.АдресПокупателя5	=	Выборка.Поле5;
			СтруктураАдресов.АдресПокупателя6	=	Выборка.Поле6;
			СтруктураАдресов.АдресПокупателя7 = ?(ЗначениеЗаполнено(Выборка.Поле7), глСоответствиеДомов.Получить(Выборка.ТипДома) + СокрЛП(Выборка.Поле7), "");
			СтруктураАдресов.АдресПокупателя8 =	?(ЗначениеЗаполнено(Выборка.Поле8), глСоответствиеКорпусов.Получить(Выборка.ТипКорпуса) + СокрЛП(Выборка.Поле8), "");
			СтруктураАдресов.АдресПокупателя9 =	?(ЗначениеЗаполнено(Выборка.Поле9), глСоответствиеКвартир.Получить(Выборка.ТипКвартиры) + СокрЛП(Выборка.Поле9), "");
			
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда 
			СтруктураАдресов.ЭлАдресПокупателя = Выборка.ЮрАдресКонтрагента;
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
			СтруктураАдресов.ТелефонПокупателя = Выборка.ЮрАдресКонтрагента;
		КонецЕсли;
		
	КонецЦикла;
	
	Выборка = Пакет[2].Выбрать();
	
	АдресЗаполнен = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес Тогда 
			
			Если Не АдресЗаполнен И Выборка.Вид <> Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда 
				Продолжить;
			Иначе
				Если Выборка.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента тогда
					АдресЗаполнен = Истина;
				КонецЕсли;
			КонецЕсли;

			ЗначениеВывод = "";
			СтруктураАдресов.АдресГрузополучателя	=	Выборка.ЮрАдресКонтрагента;
			СтруктураАдресов.АдресГрузополучателяРФ	=	Выборка.ЮрАдресКонтрагента;
			СтруктураАдресов.АдресГрузополучателя1	=	Выборка.Поле1;
			СтруктураАдресов.АдресГрузополучателя2	=	Прав("0" + Формат(Выборка.Поле2, "ЧГ=0"), 2);
			СтруктураАдресов.АдресГрузополучателя3	=	Выборка.Поле3;
			СтруктураАдресов.АдресГрузополучателя4	=	Выборка.Поле4;
			СтруктураАдресов.АдресГрузополучателя5	=	Выборка.Поле5;
			СтруктураАдресов.АдресГрузополучателя6	=	Выборка.Поле6;
			СтруктураАдресов.АдресГрузополучателя7 = ?(ЗначениеЗаполнено(Выборка.Поле7), глСоответствиеДомов.Получить(Выборка.ТипДома) + СокрЛП(Выборка.Поле7), "");
			СтруктураАдресов.АдресГрузополучателя8 = ?(ЗначениеЗаполнено(Выборка.Поле8), глСоответствиеКорпусов.Получить(Выборка.ТипКорпуса) + СокрЛП(Выборка.Поле8), "");
			СтруктураАдресов.АдресГрузополучателя9 = ?(ЗначениеЗаполнено(Выборка.Поле9), глСоответствиеКвартир.Получить(Выборка.ТипКвартиры) + СокрЛП(Выборка.Поле9), "");
			
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда 
			СтруктураАдресов.ЭлАдресГрузополучателя = Выборка.ЮрАдресКонтрагента;
		ИначеЕсли Выборка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
			СтруктураАдресов.ТелефонГрузополучателя =  Выборка.ЮрАдресКонтрагента;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураАдресов;
	
КонецФункции

Функция ПечатьБланкаЭДО(Реализация) Экспорт 
	
	Контрагент					=	Реализация.Контрагент;
	Ссылка						=	Реализация.Ссылка;
	ДоговорКонтрагента			=	Реализация.ДоговорКонтрагента;
	Организация					=	Реализация.Организация;
	БанковскийСчетОрганизации	=	Реализация.БанковскийСчетОрганизации;
	Дата 						=	Реализация.Дата;
	Товары						=	Реализация.Товары;
	Грузополучатель				=	Реализация.Грузополучатель;
	Грузоотправитель			=	Реализация.Организация;
	СуммаВключаетНДС			=	Реализация.СуммаВключаетНДС;
	
	ПечататьПартнера = Контрагент.ОтправлятьУПДЧерезЭДО;
	
	ВыводитьСчет = НЕ Контрагент.НеОтправлятьСчетПоЭДО;
	
	СтруктураСКонтактнойИнформацией = ПолучитьКонтрактнуюИнформацию(Реализация);
	УИТ =  Ссылка.УникальныйИдентификатор();
	
	СтруктураДляПараметров = Новый Структура;
	СтруктураДляПараметров.Вставить("УИТ", УИТ);
	СтруктураДляПараметров.Вставить("ПоДоговору", "По договору "+ ДоговорКонтрагента.Наименование);
	СтруктураДляПараметров.Вставить("Продавец", Организация.НаименованиеПолное);
	СтруктураДляПараметров.Вставить("Покупатель", Контрагент.НаименованиеПолное);
	
	СтруктураДляПараметров.Вставить("ИННПродавца", Организация.ИНН);
	// 	СтруктураДляПараметров.Вставить("ИННПродавца", "7701302972");
	СтруктураДляПараметров.Вставить("КПППродавца", Организация.КПП);
	//	СтруктураДляПараметров.Вставить("КПППродавца", "772001001");
	СтруктураДляПараметров.Вставить("АдресПродавца", СтруктураСКонтактнойИнформацией.АдресПродавца);
	СтруктураДляПараметров.Вставить("АдресПродавцаРФ", СтруктураСКонтактнойИнформацией.АдресПродавцаРФ);
	СтруктураДляПараметров.Вставить("АдресПродавца1", СтруктураСКонтактнойИнформацией.АдресПродавца1);
	СтруктураДляПараметров.Вставить("АдресПродавца2", СтруктураСКонтактнойИнформацией.АдресПродавца2);
	СтруктураДляПараметров.Вставить("АдресПродавца3", СтруктураСКонтактнойИнформацией.АдресПродавца3);
	СтруктураДляПараметров.Вставить("АдресПродавца4", СтруктураСКонтактнойИнформацией.АдресПродавца4);
	СтруктураДляПараметров.Вставить("АдресПродавца5", СтруктураСКонтактнойИнформацией.АдресПродавца5);
	СтруктураДляПараметров.Вставить("АдресПродавца6", СтруктураСКонтактнойИнформацией.АдресПродавца6);
	СтруктураДляПараметров.Вставить("АдресПродавца7", СтруктураСКонтактнойИнформацией.АдресПродавца7);
	СтруктураДляПараметров.Вставить("АдресПродавца8", СтруктураСКонтактнойИнформацией.АдресПродавца8);
	СтруктураДляПараметров.Вставить("АдресПродавца9", СтруктураСКонтактнойИнформацией.АдресПродавца9);
	СтруктураДляПараметров.Вставить("БанкПродавца", БанковскийСчетОрганизации.Банк.Наименование);
	СтруктураДляПараметров.Вставить("БикБанкаПродавца", БанковскийСчетОрганизации.Банк.Код);
	СтруктураДляПараметров.Вставить("НомерСчетаПродавца", БанковскийСчетОрганизации.НомерСчета);
	СтруктураДляПараметров.Вставить("НомерКоррСчетаПродавца", БанковскийСчетОрганизации.Банк.КоррСчет);
	
	СтруктураДляПараметров.Вставить("ИННПокупателя", Контрагент.ИНН);
	СтруктураДляПараметров.Вставить("КПППокупателя", ?(ЗначениеЗаполнено(Грузополучатель) И ЗначениеЗаполнено(Грузополучатель.КПП) И Грузополучатель.ПодставлятьКППГрузополучателяВКППКонтрагента, Грузополучатель.КПП, Контрагент.КПП));
	СтруктураДляПараметров.Вставить("Мыло", СтруктураСКонтактнойИнформацией.ЭлАдресПокупателя);
	СтруктураДляПараметров.Вставить("Телефон", СтруктураСКонтактнойИнформацией.ТелефонПокупателя);
	СтруктураДляПараметров.Вставить("АдресПокупателя", СтруктураСКонтактнойИнформацией.АдресПокупателя);
	СтруктураДляПараметров.Вставить("АдресПокупателяРФ", СтруктураСКонтактнойИнформацией.АдресПокупателяРФ);
	СтруктураДляПараметров.Вставить("АдресПокупателя1", СтруктураСКонтактнойИнформацией.АдресПокупателя1);
	СтруктураДляПараметров.Вставить("АдресПокупателя2", СтруктураСКонтактнойИнформацией.АдресПокупателя2);
	СтруктураДляПараметров.Вставить("АдресПокупателя3", СтруктураСКонтактнойИнформацией.АдресПокупателя3);
	СтруктураДляПараметров.Вставить("АдресПокупателя4", СтруктураСКонтактнойИнформацией.АдресПокупателя4);
	СтруктураДляПараметров.Вставить("АдресПокупателя5", СтруктураСКонтактнойИнформацией.АдресПокупателя5);
	СтруктураДляПараметров.Вставить("АдресПокупателя6", СтруктураСКонтактнойИнформацией.АдресПокупателя6);
	СтруктураДляПараметров.Вставить("АдресПокупателя7", СтруктураСКонтактнойИнформацией.АдресПокупателя7);
	СтруктураДляПараметров.Вставить("АдресПокупателя8", СтруктураСКонтактнойИнформацией.АдресПокупателя8);
	СтруктураДляПараметров.Вставить("АдресПокупателя9", СтруктураСКонтактнойИнформацией.АдресПокупателя9);
	
	//	
	СтруктураСДаннымиСчетФактуры =  ВернутьПредставлениеСчетФактуры(Реализация, Дата);
	НомерДок1 =    СтруктураСДаннымиСчетФактуры.Номер;
	СтруктураДляПараметров.Вставить("НомерДокумента", НомерДок1);
	СтруктураДляПараметров.Вставить("СчетФак", "Счет-фактура " + СтруктураСДаннымиСчетФактуры.Номер + " от " + СтруктураСДаннымиСчетФактуры.Дата);
	СтруктураДляПараметров.Вставить("НомерСчетФактуры", СтруктураСДаннымиСчетФактуры.Номер);
	СтруктураДляПараметров.Вставить("НомерДокументаСчет", ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка));
	СтруктураДляПараметров.Вставить("НомерСчета1",	ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка));
	СтруктураДляПараметров.Вставить("ДатаСчетФактуры", СтруктураСДаннымиСчетФактуры.Дата);
	
	НомерДок2 = ОбщегоНазначения.ПолучитьНомерНаПечать(Ссылка);
	
	СтруктураДляПараметров.Вставить("СчетНомер", "Счет " + НомерДок2 + " от " + Формат(Дата, "ДФ=dd.MM.yyyy"));
	
	ИтогКоличество = СтрЗаменить(Строка(Товары.Итог("Количество")), Символы.НПП, "");
	ИтогКоличество = СтрЗаменить(Строка(Товары.Итог("Количество")), " ", "");
	ИтогКоличество = СтрЗаменить(Строка(Товары.Итог("Количество")), ",", ".");
	
	СтруктураДляПараметров.Вставить("ИтогКоличество", ИтогКоличество);
	
	Сумма = СтрЗаменить(Строка(Товары.Итог("Сумма") - Товары.Итог("СуммаНДС")), Символы.НПП, "");
	Сумма = СтрЗаменить(Сумма, " ", "");
	Сумма = СтрЗаменить(Сумма, ",", ".");
	СтруктураДляПараметров.Вставить("ИтогСуммаБезНДС", Сумма);
	//
	ИтогСУммаСНДС = СтрЗаменить(Строка(Товары.Итог("Сумма")), Символы.НПП, "");
	ИтогСУммаСНДС = СтрЗаменить(ИтогСУммаСНДС, " ", "");
	ИтогСУммаСНДС = СтрЗаменить(ИтогСУммаСНДС, ",", ".");
	СтруктураДляПараметров.Вставить("ИтогСУммаСНДС", ИтогСУммаСНДС);
	
	
	ИтогСумаНДС = СтрЗаменить(Строка(Товары.Итог("СуммаНДС")), Символы.НПП, "");
	ИтогСумаНДС = СтрЗаменить(ИтогСумаНДС, " ", "") ;
	ИтогСумаНДС = СтрЗаменить(ИтогСумаНДС, ",", ".") ;
	СтруктураДляПараметров.Вставить("ИтогСумаНДС", ИтогСумаНДС);
	
	СтруктураДляПараметров.Вставить("Грузоотправитель", Грузоотправитель.НаименованиеПолное);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителяРФ", СтруктураСКонтактнойИнформацией.АдресГрузоотправителяРФ);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя1", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя1);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя2", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя2);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя3", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя3);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя4", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя4);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя5", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя5);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя6", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя6);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя7", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя7);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя8", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя8);
	СтруктураДляПараметров.Вставить("АдресГрузоотправителя9", СтруктураСКонтактнойИнформацией.АдресГрузоотправителя9);
	//	
	СтруктураДляПараметров.Вставить("Грузополучатель", Грузополучатель.НаименованиеПолное);
	СтруктураДляПараметров.Вставить("ИННГрузополучателя", ?(ЗначениеЗаполнено(Грузополучатель.ГоловнойКонтрагент),Грузополучатель.ГоловнойКонтрагент.ИНН,Грузополучатель.ИНН));
	СтруктураДляПараметров.Вставить("КППГрузополучателя", ?(ЗначениеЗаполнено(Грузополучатель) И ЗначениеЗаполнено(Грузополучатель.КПП), Грузополучатель.КПП, Грузополучатель.ГоловнойКонтрагент.КПП));
	СтруктураДляПараметров.Вставить("МылоГрузополучателя", СтруктураСКонтактнойИнформацией.ЭлАдресГрузополучателя);
	СтруктураДляПараметров.Вставить("ТелефонГрузополучатель", СтруктураСКонтактнойИнформацией.ТелефонГрузополучателя);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя", СтруктураСКонтактнойИнформацией.АдресГрузополучателя);
	СтруктураДляПараметров.Вставить("АдресГрузополучателяРФ", СтруктураСКонтактнойИнформацией.АдресГрузополучателяРФ);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя1", СтруктураСКонтактнойИнформацией.АдресГрузополучателя1);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя2", СтруктураСКонтактнойИнформацией.АдресГрузополучателя2);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя3", СтруктураСКонтактнойИнформацией.АдресГрузополучателя3);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя4", СтруктураСКонтактнойИнформацией.АдресГрузополучателя4);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя5", СтруктураСКонтактнойИнформацией.АдресГрузополучателя5);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя6", СтруктураСКонтактнойИнформацией.АдресГрузополучателя6);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя7", СтруктураСКонтактнойИнформацией.АдресГрузополучателя7);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя8", СтруктураСКонтактнойИнформацией.АдресГрузополучателя8);
	СтруктураДляПараметров.Вставить("АдресГрузополучателя9", СтруктураСКонтактнойИнформацией.АдресГрузополучателя9);
	
	Если СтруктураСДаннымиСчетФактуры.ДатаСФ >= Дата(2021,07,1) Тогда
		
		СтруктураДляПараметров.Вставить("ДокументОснованиеДата", СтруктураСДаннымиСчетФактуры.Дата);
		СтруктураДляПараметров.Вставить("ДокументОснованиеНомер",  СтруктураСДаннымиСчетФактуры.Номер);
		СтруктураДляПараметров.Вставить("ДокументОснованиеНомераСтрок", "№ п/п 1-" + Формат(Реализация.Товары.Количество() + Реализация.Услуги.Количество(), "ЧГ=0") + "");
		
	КонецЕсли;
	
	СтруктураДляПараметров.Вставить("КодПодразделения", ?(ЗначениеЗаполнено(Грузополучатель), Формат(Грузополучатель.DS_Подразделение_ID, "ЧГ=0"), ""));
	СтруктураДляПараметров.Вставить("КодФилиала", ?(ЗначениеЗаполнено(СтруктураДляПараметров.КодПодразделения), 1, "")); 
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ЭДО");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("Договор");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("Продавец");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//
	
	//=====================================================================================
	
	ОбластьМакета = Макет.ПолучитьОбласть("СчетФак");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	
	
	//    4 строки для счет фактуры
	ОбластьМакета = Макет.ПолучитьОбласть("Продавец1_СЧетФак");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель1_СчетФак");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//	
	ОбластьМакета = Макет.ПолучитьОбласть("Продавец2_СЧетФак");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель2_СчетФак");
	ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
	ТабДок.Вывести(ОбластьМакета);
	//	
	
	НомДок =   СтруктураСДаннымиСчетФактуры.Номер;
	
	Для каждого ТекСтр Из Товары  Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.Номенклатура) тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.УИТ   = УИТ;
			
			ОбластьМакета.Параметры.НомерСтроки   = ТекСтр.НомерСтроки ;
			ОбластьМакета.Параметры.НаименованиеНоменклатуры   = ТекСтр.Номенклатура.Наименование;
			ОбластьМакета.Параметры.КодЕдИзм   = ТекСтр.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			ОбластьМакета.Параметры.НомДок   = НомДок;
			ОбластьМакета.Параметры.КодНоменклатуры   = ТекСтр.Номенклатура.КодПроизводителя;
			ОбластьМакета.Параметры.ЕдИзм   = ТекСтр.ЕдиницаИзмерения ;
			
			КоличествоУпаковок = СтрЗаменить(Строка(ТекСтр.Количество), Символы.НПП, "");
			КоличествоУпаковок = СтрЗаменить(КоличествоУпаковок, " ", "");
			ОбластьМакета.Параметры.Количество = СтрЗаменить(КоличествоУпаковок, ",", ".");
			
			СуммаБезНДСВрем = ?(СуммаВключаетНДС,ТекСтр.Сумма - ТекСтр.СуммаНДС, ТекСтр.Сумма);
			СуммаБезНДС   =  СтрЗаменить(Строка(СуммаБезНДСВрем), Символы.НПП, "") ;
			СуммаБезНДС   =  СтрЗаменить(СуммаБезНДС, " ", "");
			ОбластьМакета.Параметры.СуммаБезНДС = СтрЗаменить(СуммаБезНДС, ",", ".");
			
			ЦенаВрем = Окр(?(ЗначениеЗаполнено(ТекСтр.Количество), СуммаБезНДСВрем / ТекСтр.Количество, 0), 2);
			Цена = СтрЗаменить(Строка(ЦенаВрем), Символы.НПП, "");
			Цена = СтрЗаменить(Цена, " ", "");
			ОбластьМакета.Параметры.ЦенаУпд = СтрЗаменить(Цена, ",", ".");
			
			СуммаСНДС = СтрЗаменить(Строка(?(СуммаВключаетНДС, ТекСтр.Сумма, ТекСтр.Сумма + ТекСтр.СуммаНДС)), Символы.НПП, "");
			СуммаСНДС = СтрЗаменить(СуммаСНДС, " ", "");
			ОбластьМакета.Параметры.СуммаСНДС   = СтрЗаменить(СуммаСНДС, ",", ".");
			
			СумаНДС = СтрЗаменить(Строка(ТекСтр.СуммаНДС), Символы.НПП,"");
			СумаНДС = СтрЗаменить(СумаНДС," ","");
			ОбластьМакета.Параметры.СумаНДС = СтрЗаменить(СумаНДС, ",", ".");
			
			ОбластьМакета.Параметры.СтавкаНДС = ?(ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС18, 18, 10); 
			//+Гавриленков В. 10.12.2025 #UT10-5574
			//ОбластьМакета.Параметры.СтавкаНДС = ?(Дата >= Дата("20190101000000") И ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС20, 20, 10);
			Если Дата >= Дата("20260101000000") Тогда
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 22;
				КонецЕсли;
			ИначеЕсли Дата >= Дата("20190101000000") Тогда
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 20;
				КонецЕсли;
			Иначе
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 18;
				КонецЕсли;
			КонецЕсли; 
			
			ОбластьМакета.Параметры.СтавкаНДС = ТекЗначениеСтавкиНДС;
			//-Гавриленков В. 10.12.2025 #UT10-5574
			
			Если ЗначениеЗаполнено(ТекСтр.СерияНоменклатуры.СтранаПроисхождения) Тогда
				
				Если СокрЛП(ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Код) = "---" ИЛИ
					СокрЛП(ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Код) = "--" ИЛИ
					ТекСтр.СерияНоменклатуры.СтранаПроисхождения = Справочники.КлассификаторСтранМира.Россия
					Тогда
					
					НаименованиеСтраны	= "РОССИЯ";
					Код = "643";
					НомерГТД =	"-";
					
				ИначеЕсли СокрЛП(ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Код) = "ЕС" ИЛИ
					СокрЛП(ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Код) = "980"
					Тогда
					
					НаименованиеСтраны	=	"ЕС";
					Код = "980";
					НомерГТД = ?(ЗначениеЗаполнено(СокрЛП(ТекСтр.СерияНоменклатуры.НомерГТД.Код)), СокрЛП(ТекСтр.СерияНоменклатуры.НомерГТД.Код), "-");
					
				Иначе
					
					НаименованиеСтраны	= ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Наименование;
					Код = ТекСтр.СерияНоменклатуры.СтранаПроисхождения.Код;
					НомерГТД = ?(ЗначениеЗаполнено(СокрЛП(ТекСтр.СерияНоменклатуры.НомерГТД.Код)), СокрЛП(ТекСтр.СерияНоменклатуры.НомерГТД.Код), "-");
					
				КонецЕсли;
				
			Иначе
				
				НаименованиеСтраны	= "РОССИЯ";
				Код = "643";
				НомерГТД =	"-";
				
			КонецЕсли;
			
			ОбластьМакета.Параметры.НаименованиеСтраны	= НаименованиеСтраны;
			ОбластьМакета.Параметры.КодСтраны = Код;
			ОбластьМакета.Параметры.НомерГТД = НомерГТД;
			
			ТабДок.Вывести(ОбластьМакета);
			
		КонецЕсли;
		
	КонецЦикла; 
	//
	
	//    ===============================То же самое для счета!!!
	Если ВыводитьСчет тогда
		
		ОбластьМакета = Макет.ПолучитьОбласть("СчетФак1");
		ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
		ТабДок.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Продавец1_СЧет");
		ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
		ТабДок.Вывести(ОбластьМакета);
		//
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель1_Счет");
		ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
		ТабДок.Вывести(ОбластьМакета);
		//	
		ОбластьМакета = Макет.ПолучитьОбласть("Продавец2_СЧет");
		ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
		ТабДок.Вывести(ОбластьМакета);
		//
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель2_Счет");
		ОбластьМакета.Параметры.Заполнить(СтруктураДляПараметров); 
		ТабДок.Вывести(ОбластьМакета);
		
		//
		НомДок = НомерДок2;
		
		Для каждого ТекСтр Из Товары Цикл
			
			//
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.УИТ = УИТ;
			
			ОбластьМакета.Параметры.НомерСтроки = ТекСтр.НомерСтроки;
			ОбластьМакета.Параметры.НаименованиеНоменклатуры = ТекСтр.Номенклатура.Наименование;
			ОбластьМакета.Параметры.КодЕдИзм = ТекСтр.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код;
			ОбластьМакета.Параметры.НомДок   = НомДок;
			ОбластьМакета.Параметры.КодНоменклатуры = ТекСтр.Номенклатура.КодПроизводителя;
			ОбластьМакета.Параметры.ЕдИзм = ТекСтр.ЕдиницаИзмерения;
			
			КоличествоУпаковок = СтрЗаменить(Строка(ТекСтр.Количество), Символы.НПП, "");
			КоличествоУпаковок = СтрЗаменить(КоличествоУпаковок, " ", "");
			ОбластьМакета.Параметры.Количество = СтрЗаменить(КоличествоУпаковок, ",", ".");
			
			СуммаБезНДСВрем = ТекСтр.Сумма- ТекСтр.СуммаНДС;
			СуммаБезНДС = СтрЗаменить(Строка(СуммаБезНДСВрем), Символы.НПП, "");
			СуммаБезНДС = СтрЗаменить(СуммаБезНДС, " ", "") ;
			ОбластьМакета.Параметры.СуммаБезНДС = СтрЗаменить(СуммаБезНДС, ",", ".");
			
			ЦенаВрем = Окр(?(ЗначениеЗаполнено(ТекСтр.Количество), СуммаБезНДСВрем / ТекСтр.Количество, 0), 2);
			Цена = СтрЗаменить(Строка(ЦенаВрем), Символы.НПП, "");
			Цена = СтрЗаменить(Цена, " ", "");
			ОбластьМакета.Параметры.ЦенаУпд = СтрЗаменить(Цена, ",", ".");
			
			СуммаСНДС = СтрЗаменить(Строка(ТекСтр.Сумма), Символы.НПП, "") ;
			СуммаСНДС = СтрЗаменить(СуммаСНДС, " ", "");
			ОбластьМакета.Параметры.СуммаСНДС   = СтрЗаменить(СуммаСНДС, ",", ".");
			
			СумаНДС = СтрЗаменить(Строка(ТекСтр.СуммаНДС), Символы.НПП, "") ;
			СумаНДС = СтрЗаменить(СумаНДС, " ", "");
			ОбластьМакета.Параметры.СумаНДС = СтрЗаменить(СумаНДС, ",", ".");
			
			ОбластьМакета.Параметры.СтавкаНДС = ?(ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС18, 18, 10);
			//+Гавриленков В. 10.12.2025 #UT10-5574
			//ОбластьМакета.Параметры.СтавкаНДС = ?(Дата >= Дата("20190101000000") И ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС20, 20, 10);
			Если Дата >= Дата("20260101000000") Тогда
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 22;
				КонецЕсли;
			ИначеЕсли Дата >= Дата("20190101000000") Тогда
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 20;
				КонецЕсли;
			Иначе
				Если ТекСтр.Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
					ТекЗначениеСтавкиНДС = 10;
				Иначе
					ТекЗначениеСтавкиНДС = 18;
				КонецЕсли;
			КонецЕсли; 
			
			ОбластьМакета.Параметры.СтавкаНДС = ТекЗначениеСтавкиНДС;
			//-Гавриленков В. 10.12.2025 #UT10-5574
			
			ТабДок.Вывести(ОбластьМакета);
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ТабДок.ФиксацияСверху = 1;	
	Возврат ТабДок;
	
КонецФункции

Функция КомплектПечатныхФорм(МассивСсылок) Экспорт
	
	Если ТипЗнч(МассивСсылок) = Тип("Массив") Тогда
		ТекДок = МассивСсылок[0].ПолучитьОбъект();
	Иначе
		ТекДок = МассивСсылок.ПолучитьОбъект();
	КонецЕсли;	
	
	СтруктураВнутреннихПечатныхФорм = ТекДок.ПолучитьСтруктуруПечатныхФорм();
	КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.ПодготовитьКомплектПечатныхФорм();	
	
	Для Каждого лПечатнаяФорма Из СтруктураВнутреннихПечатныхФорм Цикл
		РегистрыСведений.НастройкиПечатиОбъектов.ДобавитьПечатнуюФормуВКомплект(КомплектПечатныхФорм, лПечатнаяФорма.Ключ, лПечатнаяФорма.Значение, 0);	
	КонецЦикла;
	
	Возврат КомплектПечатныхФорм;
	
КонецФункции

Функция СформироватьКомплектПечатныхФорм(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати) Экспорт
	
	Перем АдресКомплектаПечатныхФорм;
	
	Если ТипЗнч(ПараметрыПечати) = Тип("Структура") И ПараметрыПечати.Свойство("АдресКомплектаПечатныхФорм", АдресКомплектаПечатныхФорм) Тогда
		
		КомплектПечатныхФорм = ПолучитьИзВременногоХранилища(АдресКомплектаПечатныхФорм);
		
	Иначе

		КомплектПечатныхФорм = РегистрыСведений.НастройкиПечатиОбъектов.КомплектПечатныхФорм(
			Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя(),
			МассивОбъектов, Неопределено);
		
	КонецЕсли;
		
	Если КомплектПечатныхФорм = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураТипов = Новый Соответствие;
	СтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", МассивОбъектов);
	
	ИмяМакета = "Накладная";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьДокумента());
		
	КонецЕсли;
	
	ИмяМакета = "НакладнаяРуб";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьДокумента(Истина));
		
	КонецЕсли;
	
	ИмяМакета = "ТОРГ12";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(,"Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьТОРГ12());
		
	КонецЕсли;
	
	ИмяМакета = "ТОРГ12_БезУслуг";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьТОРГ12(Истина));
		
	КонецЕсли;
	
	ИмяМакета = "М15";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьМ15());
		
	КонецЕсли;
	
	ИмяМакета = "Акт";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьАктаОбОказанииУслуг());
		
	КонецЕсли;
	
	ИмяМакета = "АктРуб";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьАктаОбОказанииУслуг(Истина));
		
	КонецЕсли;
	
	ИмяМакета = "1Т";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьТТН());
		
	КонецЕсли;
	
	ИмяМакета = "_1Т";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьТТН());
		
	КонецЕсли;
	
	ИмяМакета = "СерийныеНомера";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			УчетСерийныхНомеров.ПечатьСерийныхНомеров(МассивОбъектов[0], "Товары"));
		
	КонецЕсли;
	
	ИмяМакета = "Бланк";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьБланк(Ложь));
		
	КонецЕсли;

	ИмяМакета = "Ячейки";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьЯчеек());
		
	КонецЕсли;
	
	ИмяМакета = "Чек";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().Чек());
		
	КонецЕсли;

	ИмяМакета = "Чек_Задолженность";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().Чек(Истина));
		
	КонецЕсли;
	
	ИмяМакета = "СчетЗаказ";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущийМассивОбъектов = ТаблицаСсылок.ВыгрузитьКолонку("Ссылка");
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущийМассивОбъектов = МассивОбъектов
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().НовыйСчет());
		
	КонецЕсли;
	
	ИмяМакета = "Долг";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().Долг());
		
	КонецЕсли;
	
	ИмяМакета = "РасходСРозничныхСкладовВЦенахАТТ";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			ЗаполнениеДокументов.НапечататьПриходРасходСРозничныхСкладовВЦенахАТТ(МассивОбъектов[0], глЗначениеПеременной("ВалютаРегламентированногоУчета"), Ложь));
		
	КонецЕсли;
	
	ИмяМакета = "УниверсальныйПередаточныйДокумент";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		//+Марков И. 13.08.2025 #UT10-5378
		ДокОбъект = МассивОбъектов[0].ПолучитьОбъект();
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм,
		ИмяМакета,
		ТекущийКомплект[0].Представление,
		ДокОбъект.ПечатьУниверсальногоПередаточногоДокумента());  
		
		Если Не ДокОбъект.БылаПечать Тогда
			
			Попытка
				
				ДокОбъект.БылаПечать = Истина;
				ДокОбъект.ДополнительныеСвойства.Вставить("НеФормироватьИсходящееСообщение"); 
				ДокОбъект.ОбменДанными.Загрузка = Истина;
				ДокОбъект.Записать();
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		//-Марков И. 13.08.2025 #UT10-5378
		
	КонецЕсли;
	
	ИмяМакета = "БланкКлиента";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
				
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьБланкаКлиента());
		
	КонецЕсли;
	
	ИмяМакета = "Ячейки";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
				
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьЯчеек());
		
	КонецЕсли;
	
	ИмяМакета = "ПечатьЭДО";
	ТекущийКомплект = КомплектПечатныхФорм.Скопировать(Новый Структура("Имя,Печатать,", ИмяМакета, Истина));
	
	Если ТекущийКомплект.Количество() > 0 Тогда
		
		Если ТекущийКомплект.Колонки.Найти("Ссылка") <> Неопределено И ЗначениеЗаполнено(ТекущийКомплект[0].Ссылка) Тогда
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекциюОдинЭкземпляр(КоллекцияПечатныхФорм, ИмяМакета);
			ТаблицаСсылок = ТекущийКомплект.Скопировать(, "Ссылка");
			ТаблицаСсылок.Свернуть("Ссылка");
			ТекущаяСтруктураТипов = Новый Соответствие;
			ТекущаяСтруктураТипов.Вставить("Документ.РеализацияТоваровУслуг", ТаблицаСсылок.ВыгрузитьКолонку("Ссылка"));
			
		Иначе
			
			РегистрыСведений.НастройкиПечатиОбъектов.СкопироватьПечатнуюФормуВКоллекцию(КоллекцияПечатныхФорм, ТекущийКомплект[0]);
			ТекущаяСтруктураТипов = СтруктураТипов;
			
		КонецЕсли;
		
		МСК.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			ИмяМакета,
			ТекущийКомплект[0].Представление,
			МассивОбъектов[0].ПолучитьОбъект().ПечатьБланкаЭДО());
		
	КонецЕсли;
	
	РегистрыСведений.НастройкиПечатиОбъектов.СформироватьКомплектВнешнихПечатныхФорм(
			"Документ.РеализацияТоваровУслуг",
			МассивОбъектов,
			ПараметрыПечати,
			КоллекцияПечатныхФорм,
			ОбъектыПечати);
	
КонецФункции

Функция РассчитатьДатуПлатежа(Документ) Экспорт

	ДатаПлатежа = НачалоДня(Документ.Дата);

	Если Документ.Товары.Количество() > 0 И ЗначениеЗаполнено(Документ.Товары[0].ЗаказПокупателя) Тогда 
		КлючСтрокиУсловий = Документ.Товары[0].ЗаказПокупателя.КлючСтрокиУсловий; 
	Иначе                                                                                      
		КлючСтрокиУсловий = 0;                                
	КонецЕсли;
	
	КоличествоДнейОтсрочки = Справочники.ДоговорыКонтрагентов.КоличествоДнейОтсрочки(Документ.ДоговорКонтрагента, КлючСтрокиУсловий);
	
	Если КоличествоДнейОтсрочки > 0 Тогда
		
		ДатаПлатежа = ЗаполнениеДокументов.ОпределитьДату(НачалоДня(Документ.Дата), КоличествоДнейОтсрочки);
		
		//Если Производственный календарь не заполнен, то считаем по календарным дням
		Если Не ЗначениеЗаполнено(ДатаПлатежа) Тогда
			ДатаПлатежа = НачалоДня(Документ.Дата) + КоличествоДнейОтсрочки * 86400;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДатаПлатежа;

КонецФункции

