Процедура ВнестиИзменения() Экспорт 
	
	//+Гавриленков В. 10.12.2025 #UT10-5603
	//Ставка20 =  Перечисления.СтавкиНДС.НДС20; 
	Ставка22 = Перечисления.СтавкиНДС.НДС22;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.СтавкаНДС = &СтавкаНДС";
	
	//Запрос.УстановитьПараметр("СтавкаНДС",Перечисления.СтавкиНДС.НДС18 );
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.НДС20);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Об = Выборка.Ссылка.ПолучитьОбъект();
		Об.СтавкаНДС = Ставка22;
		
		//+Гавриленков В. 23.12.2025 #UT10-5603
		Попытка 
			
			Об.ОбменДанными.Загрузка = Истина;
			Об.Записать(); 
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	//  И небольшой запрос по    регистру " ЗначенияДополнительныхПравПользователя"
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПользователей.Пользователь КАК Пользователь,
	|	НастройкиПользователей.Настройка КАК Настройка
	|ИЗ
	|	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	|ГДЕ
	|	НастройкиПользователей.Настройка = &Настройка
	|	И НЕ НастройкиПользователей.Значение = &Значение";
	
	Запрос.УстановитьПараметр("Настройка", ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяСтавкаНДС);
	Запрос.УстановитьПараметр("Значение", Ставка22);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей(); 
		
		НаборЗаписей.Отбор.Пользователь.Установить(Выборка.Пользователь); 
		НаборЗаписей.Отбор.Настройка.Установить(Выборка.Настройка);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Настройка  = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнаяСтавкаНДС; 
		НоваяЗапись.Пользователь = Выборка.Пользователь; 
		
		//НоваяЗапись.Значение =Ставка20 ;
		НоваяЗапись.Значение = Ставка22;
		
		НаборЗаписей.Записать(); 
		
	КонецЦикла;
	
КонецПроцедуры
