
Перем мВалютаРегламентированногоУчета Экспорт;


Процедура ЗаполнитьКоличествоНаСкладе() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	               |	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка
	               |ИЗ
	               |	РегистрНакопления.ТоварыВЯчейках.Остатки КАК ТоварыВЯчейкахОстатки
	               |ГДЕ
	               |	ТоварыВЯчейкахОстатки.Склад = &Склад
	               |	И ТоварыВЯчейкахОстатки.Ячейка В(&Ячейка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ТоварыВЯчейкахОстатки.Ячейка.ПриоритетСписывания";
		
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Результат = Запрос.Выполнить();     
    
    ТаблицаОстатков = Результат.Выгрузить();    

	
	Для Каждого ТекСтр Из ТаблицаОстатков Цикл
   		 НайденнаяСтрока = Товары.Найти(ТекСтр.Номенклатура,"Номенклатура");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока	=	Товары.Добавить();
				НоваяСтрока.Номенклатура	= ТекСтр.Номенклатура;
			КонецЕсли;
	КонецЦикла;

	
	
	
	
	Для Каждого ТекСтр Из Товары Цикл
		
		МомВрем = Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая);    
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыВЯчейкахОстатки.КоличествоОстаток
		               |ИЗ
		               |	РегистрНакопления.ТоварыВЯчейках.Остатки(&МомВрем, Склад = &Склад) КАК ТоварыВЯчейкахОстатки
		               |ГДЕ
		               |	ТоварыВЯчейкахОстатки.Номенклатура = &Номенклатура
		               |	И ТоварыВЯчейкахОстатки.Ячейка = &Ячейка";
			Запрос.УстановитьПараметр("Склад", Склад);
			Запрос.УстановитьПараметр("Номенклатура", ТекСтр.Номенклатура);
			Запрос.УстановитьПараметр("Ячейка", Ячейка);
			Запрос.УстановитьПараметр("МомВрем", МомВрем);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();

		    Выборка.Следующий();
		
		
		ТекСтр.КоличествоВЯчейке	= Выборка.КоличествоОстаток;
	КонецЦикла;
	
	Для Каждого ТекСтр Из Товары Цикл
		
		МомВрем = Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая);    
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	СборкаЗаказовПокупателяСобрано.Количество
		               |ИЗ
		               |	Документ.СборкаЗаказовПокупателя.Собрано КАК СборкаЗаказовПокупателяСобрано
		               |ГДЕ
		               |	СборкаЗаказовПокупателяСобрано.Номенклатура = &Номенклатура
		               |	И СборкаЗаказовПокупателяСобрано.Ячейка = &Ячейка
		               |	И СборкаЗаказовПокупателяСобрано.Ссылка.Проведен = ИСТИНА
		               |	И (СборкаЗаказовПокупателяСобрано.Ссылка.ВремяОкончанияСборки = ДАТАВРЕМЯ(1, 1, 1)
		               |			ИЛИ СборкаЗаказовПокупателяСобрано.Ссылка.ВремяОкончанияСборки > &ДАТАВ)";
		
			Запрос.УстановитьПараметр("Номенклатура", ТекСтр.Номенклатура);
			Запрос.УстановитьПараметр("Ячейка", Ячейка);
			Запрос.УстановитьПараметр("ДАТАВ", Ссылка.Дата);
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();

		    Выборка.Следующий();
		
		
		ТекСтр.КоличествоВСборке	= Выборка.Количество;
	КонецЦикла;
	
	Если Товары.Итог("КоличествоФакт")=Товары.Итог("КоличествоВЯчейке") тогда
		ИнвентаризацияУспешна	= Истина;	
	Иначе
	    ИнвентаризацияУспешна	= Ложь;	
	КонецЕсли;
	
	ЭтотОбъект.Записать();

КонецПроцедуры

