Процедура УстановитьЗначениеABC(НомерСтроки, ИмяПоляПоиска, ЗначениеABC, ИмяКолонкиТабПоля, ГруппаПроцентов, ТекущееКоличество)
	
	ТоварыСтрока = Товары.Найти(НомерСтроки, ИмяПоляПоиска);			
	
	Если ЗначениеЗаполнено(ТоварыСтрока) Тогда
		ТоварыСтрока[ИмяКолонкиТабПоля] = ЗначениеABC;				
	КонецЕсли; 
	
	ГруппаПроцентов = ГруппаПроцентов - МИН(ГруппаПроцентов, ТекущееКоличество);

КонецПроцедуры

Процедура РассчитатьABCВнутриПроизводителя(ТЗ, ИтогиПоГруппамТоваровТЗ) Экспорт
	
	ТЗ.Сортировать("ГруппаТоваров Возр,  КоличествоПродано Убыв");	
	
	Для каждого СтрокаИтоги Из ИтогиПоГруппамТоваровТЗ Цикл
		
		ГруппаПроцентов1 = Окр(СтрокаИтоги.КоличествоПродано * АКласс / 100, 0, 0);
		ГруппаПроцентов2 = Окр(СтрокаИтоги.КоличествоПродано * БКласс / 100, 0, 0);
		ГруппаПроцентов3 = Окр(СтрокаИтоги.КоличествоПродано * СКласс / 100, 0, 0);							
		
		Отбор = Новый Структура;
		Отбор.Вставить("ГруппаТоваров", СтрокаИтоги.ГруппаТоваров);
		ОтборСтроки = ТЗ.НайтиСтроки(Отбор);
		
		Для каждого Стр Из ОтборСтроки Цикл
			
			Если ГруппаПроцентов1 > 0 Тогда 			
				
				УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "A", "ABCВнутриПроизводителя", ГруппаПроцентов1, Стр.КоличествоПродано); 			
				Продолжить;
				
			КонецЕсли;
			
			Если ГруппаПроцентов2 > 0 Тогда 
				
				УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "B", "ABCВнутриПроизводителя", ГруппаПроцентов2, Стр.КоличествоПродано);			
				Продолжить;
				
			КонецЕсли;
			
			Если ГруппаПроцентов3 > 0 Тогда 
				
				УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCВнутриПроизводителя", ГруппаПроцентов3, Стр.КоличествоПродано);						
				Продолжить;
				
			КонецЕсли;
			
			Если ГруппаПроцентов3 <= 0 И ГруппаПроцентов2 <= 0 И ГруппаПроцентов1 <= 0 Тогда
				
				УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCВнутриПроизводителя", ГруппаПроцентов3, Стр.КоличествоПродано);						
				Продолжить;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура РасчитатьABCКоличествоКлиентов(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3) Экспорт
	
	ТЗ.Сортировать("КоличествоКлиентов Убыв");
	
	Для каждого Стр Из ТЗ Цикл   
		
		Если ГруппаПроцентов1 > 0 Тогда 			
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "A", "ABCКоличествоКлиентов", ГруппаПроцентов1, Стр.КоличествоКлиентов); 
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов2 > 0 Тогда 
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "B", "ABCКоличествоКлиентов", ГруппаПроцентов2, Стр.КоличествоКлиентов); 	
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов3 > 0 Тогда 
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCКоличествоКлиентов", ГруппаПроцентов3, Стр.КоличествоКлиентов); 		
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов3 <= 0 И ГруппаПроцентов2 <= 0 И ГруппаПроцентов1 <= 0 Тогда
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCКоличествоКлиентов", ГруппаПроцентов3, Стр.КоличествоКлиентов); 
			Продолжить;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуИзЗапроса(ТЗ)
	
	Для каждого Стр Из ТЗ Цикл   
		
		НоваяСтрока = Товары.Добавить();
		Стр.НомерСтроки = НоваяСтрока.НомерСтроки; 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		РассчитатьМинимальныйИМаксимальнойОстаток(НоваяСтрока, Стр);
		
	КонецЦикла;

КонецПроцедуры

Процедура РасчитатьABCКоличествоРеализаций(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3) Экспорт
	
	ТЗ.Сортировать("КоличествоРеализаций Убыв");
	
	Для каждого Стр Из ТЗ Цикл   
		
		Если ГруппаПроцентов1 > 0 Тогда 			
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "A", "ABCКоличествоРеализации", ГруппаПроцентов1, Стр.КоличествоРеализаций); 			
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов2 > 0 Тогда 
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "B", "ABCКоличествоРеализации", ГруппаПроцентов2, Стр.КоличествоРеализаций);			
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов3 > 0 Тогда 
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCКоличествоРеализации", ГруппаПроцентов3, Стр.КоличествоРеализаций);						
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов3 <= 0 И ГруппаПроцентов2 <= 0 И ГруппаПроцентов1 <= 0 Тогда
			
			УстановитьЗначениеABC(Стр.НомерСтроки, "НомерСтроки", "C", "ABCКоличествоРеализации", ГруппаПроцентов3, Стр.КоличествоРеализаций);						
			Продолжить;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьМинимальныйИМаксимальнойОстаток(НоваяСтрока, Стр)
	
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	
	// Теперь минимальный остаток...
	МО = Окр(НоваяСтрока.СреднееКоличествоПродано * (СкоростьОприходования + 1), 0, 1);
	СредГлубПродаж = Окр(НоваяСтрока.СредняяГлубинаПродаж, 0, 1);
	НужнаяОкругленнаяШтука = НайтиБлижайщую(МО, СредГлубПродаж);
	Кратность = Окр(НоваяСтрока.Кратность, 0, 1);
	НужнаяОкругленнаяШтука = НайтиБлижайщую(НужнаяОкругленнаяШтука, Кратность);
	
	Если НужнаяОкругленнаяШтука <= НоваяСтрока.Кратность Тогда 				
		НоваяСтрока.МинОстаток = НоваяСтрока.Кратность;
	Иначе 
		НоваяСтрока.МинОстаток = НайтиБлижайщую(НужнаяОкругленнаяШтука, Кратность, 1);
	КонецЕсли;
	
	// Теперь максимальный остаток...
	Если ЗначениеЗаполнено(Стр.КоличествоДнейВПродаже) Тогда
		
		Если Стр.КоличествоДнейВПродаже >= 100 Тогда
			МО = Окр(НоваяСтрока.СреднееКоличествоПроданоВариант2 * (ГлубинаЗаказа * 7 + СкоростьОприходования), 0, 1);	
		Иначе
			МО = Окр(НоваяСтрока.СреднееКоличествоПродано * (ГлубинаЗаказа * 7 + СкоростьОприходования), 0, 1);
		КонецЕсли;
		
	КонецЕсли;
	
	НужнаяОкругленнаяШтука = МО;
	
	Если НужнаяОкругленнаяШтука <= НоваяСтрока.Кратность Тогда 					
		НоваяСтрока.МаксОстаток = НоваяСтрока.Кратность;
	Иначе 
		
		Кратность = Окр(НоваяСтрока.Кратность, 0, 1);
		НоваяСтрока.МаксОстаток = НайтиБлижайщую(НужнаяОкругленнаяШтука, Кратность, 2);
		
	КонецЕсли;

КонецПроцедуры
	
Процедура РасчитатьABCКоличествоПродажи(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3) Экспорт
	
	Для каждого Стр Из ТЗ Цикл   
		
		НоваяСтрока = Товары.Добавить();
		
		Стр.НомерСтроки = НоваяСтрока.НомерСтроки; 

		// Расчет xyz
		СреднееКоличествоПроданоВМесяц = (Стр.КоличествоПродано - Стр.КоличествоВозвращенногоТовара) / КоличествоПериодов;
		
		Если СреднееКоличествоПроданоВМесяц <= 0 Тогда 
			
			СреднееКоличествоПроданоВМесяц = 0;
			НоваяСтрока.КоэффициентВариации = 0;
			
		Иначе	
			
			СтандартноеОтклонениеОбъемаПродаж = 0;
			
			Для сч = 1 по КоличествоПериодов Цикл
				
				СтандартноеОтклонениеОбъемаПродаж = СтандартноеОтклонениеОбъемаПродаж +
				(Стр["КоличествоОборот" + сч] - СреднееКоличествоПроданоВМесяц) * (Стр["КоличествоОборот" + сч] - СреднееКоличествоПроданоВМесяц);
				
			КонецЦикла;
			
			СтандартноеОтклонениеОбъемаПродаж = СтандартноеОтклонениеОбъемаПродаж / КоличествоПериодов;
			СтандартноеОтклонениеОбъемаПродаж = Sqrt(СтандартноеОтклонениеОбъемаПродаж);
			
			НоваяСтрока.КоэффициентВариации = Окр(СтандартноеОтклонениеОбъемаПродаж/СреднееКоличествоПроданоВМесяц * 100, 2, РежимОкругления.Окр15как20);
			
			Если НоваяСтрока.КоэффициентВариации >= 0 и НоваяСтрока.КоэффициентВариации <= Xпараметр Тогда 
				НоваяСтрока.XYZ = "X";
			ИначеЕсли НоваяСтрока.КоэффициентВариации > Xпараметр и НоваяСтрока.КоэффициентВариации <= Yпараметр Тогда
				НоваяСтрока.XYZ = "Y";					
			Иначе
				НоваяСтрока.XYZ = "Z";	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ГруппаПроцентов1 > 0 Тогда 
			
			НоваяСтрока.Класс = "A";
			
			РассчитатьМинимальныйИМаксимальнойОстаток(НоваяСтрока, Стр);
			
			ГруппаПроцентов1 = ГруппаПроцентов1 - МИН(ГруппаПроцентов1, Стр.КоличествоПродано);
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов2 > 0 Тогда 
			
			НоваяСтрока.Класс = "B";
			
			РассчитатьМинимальныйИМаксимальнойОстаток(НоваяСтрока, Стр);
			
			ГруппаПроцентов2 = ГруппаПроцентов2 - МИН(ГруппаПроцентов2, Стр.КоличествоПродано);
			Продолжить;
			
		КонецЕсли;
		
		Если ГруппаПроцентов3 > 0 Тогда 
			
			НоваяСтрока.Класс = "C";
			
			РассчитатьМинимальныйИМаксимальнойОстаток(НоваяСтрока, Стр);
			
			ГруппаПроцентов3 = ГруппаПроцентов3 - МИН(ГруппаПроцентов3, Стр.КоличествоПродано);
			Продолжить;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиБлижайщую(МО,СредГлубПродаж,Признак = 0) Экспорт
	
	Если Признак = 0 Тогда 
		
		КолЦифр = СтрДлина(МО);
		К = Pow(10, КолЦифр - 1);
		
		ППП = Окр(МО / К, 0, 1);           
		ППП = ППП * К;     // 109 -> 100;   находим ППП, равное округленному до старшего разряда МО
		
		Если СредГлубПродаж = 0 ИЛИ СредГлубПродаж > МО Тогда   // если МО маленькое, или СредГлубПродаж нулевое, то возврат МО без всяких преобразований
			Возврат МО;
		КонецЕсли;
		
		Если (ППП - СредГлубПродаж ) > СредГлубПродаж * 2 - ППП Тогда 
			
			//+Шульман А. 01.04.2024 #К
			//~М:
			//Промежуток1 = МО / СредГлубПродаж;
			//Промежуток2 = Окр(Промежуток1, 0, 1);
			//
			//Если Промежуток1 = Промежуток2 Тогда 
			//	Возврат МО;
			//Иначе 
			//	МО = МО + 1;
			//	Перейти ~М;
			//КонецЕсли; 
			
			Промежуток1 = МО / СредГлубПродаж;
			Промежуток2 = Окр(Промежуток1, 0, 1);
			
			Пока Не Промежуток1 = Промежуток2 Цикл
			
				МО = МО + 1;
				Промежуток1 = МО / СредГлубПродаж;
				Промежуток2 = Окр(Промежуток1, 0, 1);
				
			КонецЦикла;
			
			Возврат МО;
			//-Шульман А. 01.04.2024 #К
			
		Иначе 
			
			//+Шульман А. 01.04.2024 #К
			//~М1:
			//Промежуток1 = МО / СредГлубПродаж;
			//Промежуток2 = Окр(Промежуток1, 0, 1);
			//
			//Если Промежуток1 = Промежуток2 Тогда 
			//	Возврат МО;
			//Иначе 
			//	МО = МО - 1;
			//	Перейти ~М1;
			//КонецЕсли;	
			
			Промежуток1 = МО / СредГлубПродаж;
			Промежуток2 = Окр(Промежуток1, 0, 1);   
			
			Пока Не Промежуток1 = Промежуток2 Цикл
			
				МО = МО - 1;
				Промежуток1 = МО / СредГлубПродаж;
				Промежуток2 = Окр(Промежуток1, 0, 1);   
				
			КонецЦикла;
			
			Возврат МО;
			//-Шульман А. 01.04.2024 #К
			
		КонецЕсли;
		
	Иначе 
		
		КолЦифр = СтрДлина(МО);
		К = Pow(10, КолЦифр - 1);
		
		ППП = Окр(МО / К, 0, 1);
		ППП = ППП * К;
		
		Если СредГлубПродаж = 0 ИЛИ СредГлубПродаж > МО Тогда 
			Возврат МО;
		КонецЕсли;
		
		//+Шульман А. 01.04.2024 #К
		//~М3:
		//Промежуток1 = МО / СредГлубПродаж;
		//Промежуток2 = Окр(Промежуток1, 0, 1);
		//
		//Если Промежуток1 = Промежуток2 Тогда 
		//	Возврат МО;
		//Иначе 
		//	Если Признак = 1 Тогда 
		//		МО = МО - 1;
		//	ИначеЕсли Признак = 2 Тогда 
		//		МО = МО + 1;
		//	Иначе
		//		МО = МО + 1;
		//	КонецЕсли;
		//	Перейти ~М3;
		//КонецЕсли;
		
		Промежуток1 = МО / СредГлубПродаж;
		Промежуток2 = Окр(Промежуток1, 0, 1);
		
		Пока Не Промежуток1 = Промежуток2 Цикл
		
			Если Признак = 1 Тогда 
				МО = МО - 1;
			Иначе
				МО = МО + 1;
			КонецЕсли;
			
			Промежуток1 = МО / СредГлубПродаж;
			Промежуток2 = Окр(Промежуток1, 0, 1);
		
		КонецЦикла;

		Возврат МО;
		//-Шульман А. 01.04.2024 #К
		
	КонецЕсли;                                    

КонецФункции

Функция ПроверкаНаДваПервыхСимволаА(АВС_Москва) Экспорт 
	
	ДваПервыхСимволаА = Лев(АВС_Москва, 2);
	ДваПервыхСимволаА2 = Лев(АВС_Москва, 1);
	
	Если Врег(ДваПервыхСимволаА) = ВРег("aa") или Врег(ДваПервыхСимволаА) = ВРег("ab")
		или Врег(ДваПервыхСимволаА) = ВРег("nn") или Врег(ДваПервыхСимволаА2) = ВРег("a") Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ПроверкаНаДваПервыхСимвола(АВС_Москва) Экспорт
	
	ТретийСимвол = ВРег(Прав(Лев(АВС_Москва, 3), 1));
	ДваПервыхСимвола2 = ВРег(Лев(АВС_Москва, 1));
	ПодстрокаПервыхСимволов = "ZRES";
	ПодстрокаТретьихСимволов = "ABCND";
	
	Если Найти(ПодстрокаПервыхСимволов, ДваПервыхСимвола2) = 0 И Найти(ПодстрокаТретьихСимволов, ТретийСимвол) <> 0 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Функция ПроверкаНаПервыйСимвол(АВС_Москва) Экспорт
	
	ПервыйСимвол = Лев(АВС_Москва, 1);
	
	Если Врег(ПервыйСимвол) <> ВРег("z") или Врег(ПервыйСимвол) <> ВРег("r")
		или Врег(ПервыйСимвол) <> ВРег("e") или Врег(ПервыйСимвол) <> ВРег("s") Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;

КонецФункции

Функция ПроверкаНаДваПервыхСимволаВ(АВС_Москва) Экспорт
	
	ДваПервыхСимволаВ = Лев(АВС_Москва, 2);
	ДваПервыхСимволаВ2 = Лев(АВС_Москва, 1);
	
	Если Врег(ДваПервыхСимволаВ) = ВРег("aa") или Врег(ДваПервыхСимволаВ) = ВРег("ab")
		или Врег(ДваПервыхСимволаВ) = ВРег("bb") или Врег(ДваПервыхСимволаВ) = ВРег("nn") 
		или Врег(ДваПервыхСимволаВ2) = ВРег("c") или Врег(ДваПервыхСимволаВ2) = ВРег("a") или Врег(ДваПервыхСимволаВ2) = ВРег("b") Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;

КонецФункции

Процедура ЗаполнитьОтборПостроителя(ПостроительОтчета) Экспорт
КонецПроцедуры // ЗаполнитьОтборПостроителя()

// Создать и заполнить построитель для отбора
Процедура ИнициироватьПостроительДляОтбора(ПостроительОтчета) Экспорт
	
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(Товары.Выгрузить());
	ПостроительОтчета.ЗаполнитьНастройки();
	СтруктураПредставлениеПолей = Новый Структура;
	ЗаполнитьОтборПостроителя(ПостроительОтчета);

КонецПроцедуры

Процедура ВосстановитьНастройкиРегламентаИзСтруктуры(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Свойство("АКласс"					          , АКласс);
	СохраненнаяНастройка.Свойство("БКласс"					          , БКласс);		
	СохраненнаяНастройка.Свойство("СКласс"					          , СКласс);
	СохраненнаяНастройка.Свойство("ГлубинаЗаказа"				      , ГлубинаЗаказа);
	СохраненнаяНастройка.Свойство("СкоростьОприходования"		      , СкоростьОприходования);
	СохраненнаяНастройка.Свойство("КолСтрок"					      , КолСтрок);
	СохраненнаяНастройка.Свойство("Xпараметр"					      , Xпараметр);
	СохраненнаяНастройка.Свойство("Yпараметр"					      , Yпараметр);
	СохраненнаяНастройка.Свойство("КоличествоНедельВПериоде"          , КоличествоНедельВПериоде);
	СохраненнаяНастройка.Свойство("КоличествоПериодов"			      , КоличествоПериодов);
	СохраненнаяНастройка.Свойство("КоличествоДнейПериода"             , КоличествоДнейПериода);
	СохраненнаяНастройка.Свойство("КоличествоРеализацийБолее"	      , КоличествоРеализацийБолее);	
	СохраненнаяНастройка.Свойство("ПриводитьКМинимальнымУпаковкам"    , ПриводитьКМинимальнымУпаковкам);
	СохраненнаяНастройка.Свойство("Отсев"							  , Отсев);
	СохраненнаяНастройка.Свойство("ДокументыПровести"				  , ДокументыПровести);
	СохраненнаяНастройка.Свойство("ИсключатьНегабарит"			      , ИсключатьНегабарит);
	СохраненнаяНастройка.Свойство("ПрямойКонтракт"			          , ПрямойКонтракт);
	СохраненнаяНастройка.Свойство("Покупатель"			              , Покупатель);
	
	ВрБрендыОтборВключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("БрендыОтборВключить"		  , ВрБрендыОтборВключить) Тогда
		БрендыОтборВключить.Загрузить(ВрБрендыОтборВключить);
	КонецЕсли;
	
	ВрБрендыОтборИсключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("БрендыОтборИсключить"		  , ВрБрендыОтборИсключить) Тогда
		БрендыОтборИсключить.Загрузить(ВрБрендыОтборИсключить);
	КонецЕсли;
	
	ВрНоменклатурныеГруппыОтборВключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НоменклатурныеГруппыОтборВключить" , ВрНоменклатурныеГруппыОтборВключить) Тогда
		НоменклатурныеГруппыОтборВключить.Загрузить(ВрНоменклатурныеГруппыОтборВключить);
	КонецЕсли;
	
	ВрНоменклатурныеГруппыОтборИсключить = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НоменклатурныеГруппыОтборИсключить"		  , ВрНоменклатурныеГруппыОтборИсключить) Тогда
		НоменклатурныеГруппыОтборИсключить.Загрузить(ВрНоменклатурныеГруппыОтборИсключить);
	КонецЕсли;
	
	ВрПостроительОтчета = Неопределено;
	
	Если СохраненнаяНастройка.Свойство("НастройкаПостроителя"		          , ВрПостроительОтчета) Тогда	
		
		НастройкаПостроителя = ВрПостроительОтчета;
		ИнициироватьПостроительДляОтбора(ПостроительОтчета);
		ПостроительОтчета.УстановитьНастройки(НастройкаПостроителя);
		
	КонецЕсли;
	
	СохраненнаяНастройка.Свойство("ДатаДокумента"					          , ДатаДокумента);

КонецПроцедуры

Процедура СохранитьНастройкиРегламентаВСтруктуру(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Вставить("АКласс"						      , АКласс);
	СохраненнаяНастройка.Вставить("БКласс"						      , БКласс);
	СохраненнаяНастройка.Вставить("СКласс"   					      , СКласс);	
	СохраненнаяНастройка.Вставить("ГлубинаЗаказа"   			      , ГлубинаЗаказа);
	СохраненнаяНастройка.Вставить("СкоростьОприходования"   	      , СкоростьОприходования);
	СохраненнаяНастройка.Вставить("КолСтрок"   					      , КолСтрок);
	СохраненнаяНастройка.Вставить("Xпараметр"   				      , Xпараметр);
	СохраненнаяНастройка.Вставить("Yпараметр"   				      , Yпараметр);
	СохраненнаяНастройка.Вставить("КоличествоНедельВПериоде"   	      , КоличествоНедельВПериоде);
	СохраненнаяНастройка.Вставить("КоличествоПериодов"   		      , КоличествоПериодов); 	
	СохраненнаяНастройка.Вставить("КоличествоДнейПериода"             , КоличествоДнейПериода);
	СохраненнаяНастройка.Вставить("КоличествоРеализацийБолее"	      , КоличествоРеализацийБолее);
	СохраненнаяНастройка.Вставить("ПриводитьКМинимальнымУпаковкам"    , ПриводитьКМинимальнымУпаковкам);
	СохраненнаяНастройка.Вставить("ИсключатьНегабарит"			      , ИсключатьНегабарит);
	СохраненнаяНастройка.Вставить("Отсев"							  , Отсев);
	СохраненнаяНастройка.Вставить("ДокументыПровести"				  , ДокументыПровести);
	СохраненнаяНастройка.Вставить("БрендыОтборВключить"			      , БрендыОтборВключить.Выгрузить());
	СохраненнаяНастройка.Вставить("БрендыОтборИсключить"		      , БрендыОтборИсключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НоменклатурныеГруппыОтборВключить" , НоменклатурныеГруппыОтборВключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НоменклатурныеГруппыОтборИсключить", НоменклатурныеГруппыОтборИсключить.Выгрузить());
	СохраненнаяНастройка.Вставить("НастройкаПостроителя"			  , ПостроительОтчета.ПолучитьНастройки());
	СохраненнаяНастройка.Вставить("ДатаДокумента"					  , ДатаДокумента);
	СохраненнаяНастройка.Вставить("ПрямойКонтракт"					  , ПрямойКонтракт);
	СохраненнаяНастройка.Вставить("Покупатель"					      , Покупатель);

КонецПроцедуры

Процедура РегламентноеВыполнение() Экспорт
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Пользователь", Справочники.Пользователи.НайтиПоКоду("webadmin"));
	СтруктураНастройки.Вставить("ИмяОбъекта", "ОбработкаОбъект.АнализНеликвидногоТовараВФилиале");	
	СтруктураНастройки.Вставить("НаименованиеНастройки", "АнализНеликвидногоТовараРегламентное");
	
	Если УниверсальныеМеханизмы.ПолучитьНастройку(СтруктураНастройки) Тогда
		
		ЭтотОбъект.мТекущаяНастройка = СтруктураНастройки;
		ВосстановитьНастройкиРегламентаИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);
		
		КонПериода	  = ТекущаяДата();		
		НачПериода    = КонПериода - 86400 * (КоличествоДнейПериода - 1);
		
		ИнициироватьПостроительДляОтбора(ПостроительОтчета);
		ВыполнитьЗапрос();
		
		ЗаполнитьКолонкуВЗаказМодуль();
		МассивНовыхДокументов = Новый Массив;
		
		Если Не ПрямойКонтракт Тогда
			
			Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() Тогда
				
				Если ИсключатьНегабарит Тогда
					
					СоздатьДокументыМодуль(Ложь, МассивНовыхДокументов, Истина, Ложь);
					СоздатьДокументыМодуль(Ложь, МассивНовыхДокументов, Истина, Истина);
					СоздатьДокументыМодуль(Истина, МассивНовыхДокументов, Истина); 
					
				Иначе
					
					СоздатьДокументыМодуль(Неопределено, МассивНовыхДокументов, Истина, Ложь);
					СоздатьДокументыМодуль(Неопределено, МассивНовыхДокументов, Истина, Истина);
					
				КонецЕсли;		
				
			Иначе		
				
				Если ИсключатьНегабарит Тогда
					
					СоздатьДокументыМодуль(Ложь, МассивНовыхДокументов, Истина);
					СоздатьДокументыМодуль(Истина, МассивНовыхДокументов, Истина); 
					
				Иначе
					СоздатьДокументыМодуль(Неопределено, МассивНовыхДокументов, Истина);
				КонецЕсли; 
				
			КонецЕсли;  		
			
		Иначе
			
			Если ИсключатьНегабарит Тогда
				
				СоздатьДокументыМодуль(Ложь, МассивНовыхДокументов);
				СоздатьДокументыМодуль(Истина, МассивНовыхДокументов); 
				
			Иначе
				СоздатьДокументыМодуль(Неопределено,МассивНовыхДокументов);
			КонецЕсли;					
			
		КонецЕсли; 
		
	КонецЕсли; 	

КонецПроцедуры

Процедура СоздатьДокументыМодуль(мНегабарит = Неопределено,МассивНовыхДокументов,ЭтоРегламент = Ложь,ЗаказНаГорючиеЖидкости = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.ВЗаказ > 0 ";

	Если НЕ мНегабарит = Неопределено Тогда
		
		Запрос.Текст = Запрос.Текст +
		"  И ТаблицаТовары.Негабарит = &Негабарит ";
		Запрос.УстановитьПараметр("Негабарит", мНегабарит);
		
	КонецЕсли; 		
	
	Запрос.Текст = Запрос.Текст + "	
	|
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", Товары.Выгрузить());
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		#Если Клиент Тогда
		Предупреждение("Нет строк для переноса в документ!", 20);
		#КонецЕсли
		Возврат;
		
	Иначе	
		
		ДатаДокумента = ?(ДатаДокумента = Дата(1, 1, 1), ТекущаяДата(), ДатаДокумента);
		Грузополучатель = Покупатель;
		Контрагент = Покупатель.ГоловнойКонтрагент;

		ЗапросДоговора = Новый Запрос;
		ЗапросДоговора.Текст =
		"ВЫБРАТЬ
		|	Константы.ОсновнаяОрганизация
		|ПОМЕСТИТЬ КонстОснОрганизация
		|ИЗ
		|	Константы КАК Константы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Договор
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
		|	КонстОснОрганизация КАК КонстОснОрганизация
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Владелец
		|	И ДоговорыКонтрагентов.Организация = КонстОснОрганизация.ОсновнаяОрганизация
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
		
		ЗапросДоговора.УстановитьПараметр("Владелец", Контрагент);
		РезультатЗапросаДоговора = ЗапросДоговора.Выполнить().Выгрузить();
		
		Если НЕ РезультатЗапросаДоговора.Количество() = 0 Тогда
			ДоговорКонтагента = РезультатЗапросаДоговора[0].Договор;
		Иначе			 
			ДоговорКонтагента 	= Контрагент.ОсновнойДоговорКонтрагента;
		КонецЕсли;
		
	    Если ДоговорКонтагента.Пустая() Или НЕ ДоговорКонтагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			
			#Если Клиент Тогда
			Сообщить("Договор вида ""С Ппокупателем"" у контрагента " + """" + Контрагент + """ отсутствует или не выбран.", СтатусСообщения.ОченьВажное);			
			#КонецЕсли
			Возврат;
			
		КонецЕсли; 
		
		//+Шульман А. 16.12.2024 #UT10-4991
		ИспользоватьПроцессПеремещениеНеликвидаТОХвГП = Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина;
		//-Шульман А. 16.12.2024 #UT10-4991	
		
		Склад 				= Константы.ОсновнойСклад.Получить();
		СтрокВДокументе 	= 0; 
		ТекТовар 			= 0;
		
		Выборка = Результат.Выбрать();
		НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
	
		Пока Выборка.Следующий() Цикл
			
			ТекТовар 		= ТекТовар + 1;
			СтрокВДокументе	= СтрокВДокументе + 1;
			
			НоваяСтрокаТЧ 					= НовыйДокумент.Товары.Добавить();
			НоваяСтрокаТЧ.Номенклатура 		= Выборка.Номенклатура;
			НоваяСтрокаТЧ.ЕдиницаИзмерения 	= НоваяСтрокаТЧ.Номенклатура.ЕдиницаХраненияОстатков;
			НоваяСтрокаТЧ.Количество 		= Выборка.ВЗаказ;
			НоваяСтрокаТЧ.Коэффициент 		= НоваяСтрокаТЧ.ЕдиницаИзмерения.Коэффициент;
			//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
			//НоваяСтрокаТЧ.СтавкаНДС 		= НоваяСтрокаТЧ.Номенклатура.СтавкаНДС;
			НоваяСтрокаТЧ.СтавкаНДС 		= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НоваяСтрокаТЧ.Номенклатура, ДатаДокумента);
			//-Гавриленков В. 18.12.2025 #UT10-5598
			СтавкаНДС = УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаТЧ.СтавкаНДС);
			НоваяСтрокаТЧ.Цена 				= Выборка.ЗакупочнаяЦена;			
			
			Если СтрокВДокументе = КолСтрок ИЛИ ТекТовар= Выборка.Количество() Тогда 
				
				НовыйДокумент.Дата 					= ДатаДокумента;
				НовыйДокумент.Контрагент  			= Контрагент;
				НовыйДокумент.Грузополучатель       = Грузополучатель;
				НовыйДокумент.СпособДоставки        = Грузополучатель.СпособДоставки;  
				//+Пашкин О. 21.05.2025 #UT10-5188 
				Если ВидПроцесса = Перечисления.ВидыПроцессов.ВозвратТОХИзГППоставщику Тогда
					
					НовыйДокумент.ВидПроцесса = ВидПроцесса;  
					НовыйДокумент.ДоговорПоставщикаТОХ = ДоговорПоставщикаТОХ;
					
					Если ЗначениеЗаполнено(СпособДоставки) Тогда
						НовыйДокумент.СпособДоставки        = СпособДоставки;  
					КонецЕсли;
					
				КонецЕсли;	
				//-Пашкин О. 21.05.2025 #UT10-5188 
				НовыйДокумент.ИсточникЗаказа        = Справочники.ИсточникиЗаказов.НайтиПоРеквизиту("КодИсточника", 5);
				НовыйДокумент.ДоговорКонтрагента 	= ДоговорКонтагента; 
				НовыйДокумент.ВалютаДокумента 		= ДоговорКонтагента.ВалютаВзаиморасчетов;
				НовыйДокумент.КурсВзаиморасчетов 	= 1;
				НовыйДокумент.КратностьВзаиморасчетов = 1;
				НовыйДокумент.Организация 			= ДоговорКонтагента.Организация;
				НовыйДокумент.СуммаВключаетНДС 		= Истина;
				НовыйДокумент.УчитыватьНДС 			= Истина;
				НовыйДокумент.СкладГруппа			= Склад;
				НовыйДокумент.Ответственный         = ПараметрыСеанса.ТекущийПользователь;     
				
				//+Шульман А. 16.12.2024 #UT10-4991    
				Если ИспользоватьПроцессПеремещениеНеликвидаТОХвГП Тогда
					
					НовыйДокумент.ВидПроцесса = ВидПроцесса;  
					НовыйДокумент.ДоговорПоставщикаТОХ = ДоговорПоставщикаТОХ;
					
					//+Кабанов А.В. 23.06.2025 # UT10-5295 
					НовыйДокумент.ВозвратПоставщикуБезРазбораВГП = ВозвратПоставщикуБезРазбораВГП;
					//-Кабанов А.В. 23.06.2025 # UT10-5295     
					
				КонецЕсли;
				//-Шульман А. 16.12.2024 #UT10-4991
				
				Для Каждого СтрокаТЧ Из НовыйДокумент.Товары Цикл
					
					Если СтрокаТЧ.Цена = 0 Тогда
						СтрокаТЧ.Цена = 1;						
					КонецЕсли;
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, НовыйДокумент);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, НовыйДокумент);	
					
				КонецЦикла;				
				
				Если ЭтоРегламент Тогда
					НовыйДокумент.Комментарий = "Документ создан регламентным заданием Анализ неликвидного товара";
				КонецЕсли;
				
				//_Заполнить и провести
				ВидимостьСерии = Истина;
				Авторезервирование = Истина;
				Авторазмещение = Ложь;
				СтратегияАвторезервированияПоЗаказам = Перечисления.СтратегииАвторезервированияНоменклатуры.СначалаНаСкладахПотомВЗаказахПоставщикам;				
				
				СтруктураПараметров = Новый Структура;
				СтруктураПараметров.Вставить("ВидимостьСерии",     ВидимостьСерии);
				СтруктураПараметров.Вставить("Авторезервирование", Авторезервирование);
				СтруктураПараметров.Вставить("Авторазмещение",     Авторазмещение);
				СтруктураПараметров.Вставить("СтратегияАвторезервированияПоЗаказам", СтратегияАвторезервированияПоЗаказам);
				НовыйДокумент.ЗаполнитьТабличныеЧастиПередПроведениемУпр(СтруктураПараметров);
				
				//+Гавриленков В. 21.08.2025 #UT10-5390 
				сч = 0;
				Пока сч < НовыйДокумент.Товары.Количество() Цикл 
					
					ТекСтрока = НовыйДокумент.Товары.Получить(сч);
					
					Если Не ЗначениеЗаполнено(ТекСтрока.Размещение) Тогда
						НовыйДокумент.Товары.Удалить(ТекСтрока);
					Иначе
						сч = сч + 1;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТекущаяДата() >= Константы.РезервированиеЗаказовСУчетомЯчеек.Получить() Тогда      
					
					ТЗ = НовыйДокумент.Товары.Выгрузить();
					ТЗ.Свернуть("Номенклатура,Размещение", "Количество");
					
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	Константы.ИспользоватьАлгоритмПроверкиКратностиФилиала КАК ЗначениеКонстанты
					|ПОМЕСТИТЬ КонстКратности
					|ИЗ
					|	Константы КАК Константы
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТЗ.Номенклатура КАК Номенклатура,
					|	ТЗ.Количество КАК Количество,
					|	ТЗ.Размещение КАК Размещение
					|ПОМЕСТИТЬ ТаблицаНоменклатура
					|ИЗ
					|	&ТЗ КАК ТЗ
					|ГДЕ
					|	ТЗ.Размещение <> НЕОПРЕДЕЛЕНО
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТоварыВЯчейкахОстатки.Номенклатура,
					|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Остаток,
					|	1 КАК Поле1
					|ПОМЕСТИТЬ Остатки
					|ИЗ
					|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, НЕ Ячейка.НеУчитыватьВОперативномУчете) КАК ТоварыВЯчейкахОстатки
					|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыВЯчейкахОстатки.Номенклатура
					|ГДЕ
					|	ТоварыВЯчейкахОстатки.Ячейка.НеУчитыватьВОперативномУчете = ЛОЖЬ
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|
					|ВЫБРАТЬ
					|	ТоварыГотовыеКСборкеОстатки.Номенклатура,
					|	-ТоварыГотовыеКСборкеОстатки.КоличествоОстаток,
					|	3
					|ИЗ
					|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыГотовыеКСборке.Остатки(, ) КАК ТоварыГотовыеКСборкеОстатки
					|		ПО ТаблицаНоменклатура.Номенклатура = ТоварыГотовыеКСборкеОстатки.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Остатки.Номенклатура,
					|	СУММА(Остатки.Остаток) КАК Остаток,
					|	МАКСИМУМ(ВЫБОР
					|			КОГДА КонстКратности.ЗначениеКонстанты
					|				ТОГДА ВЫБОР
					|						КОГДА НЕ Остатки.Номенклатура.КратностьФилиала = 0
					|							ТОГДА Остатки.Номенклатура.КратностьФилиала
					|						ИНАЧЕ ВЫБОР
					|								КОГДА Остатки.Номенклатура.Кратность = 0
					|									ТОГДА 1
					|								ИНАЧЕ Остатки.Номенклатура.Кратность
					|							КОНЕЦ
					|					КОНЕЦ
					|			ИНАЧЕ Остатки.Номенклатура.Кратность
					|		КОНЕЦ) КАК Кратность
					|ПОМЕСТИТЬ ОстаткиГруппа
					|ИЗ
					|	Остатки КАК Остатки,
					|	КонстКратности КАК КонстКратности
					|
					|СГРУППИРОВАТЬ ПО
					|	Остатки.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ОстаткиГруппа.Номенклатура,
					|	СУММА(ОстаткиГруппа.Остаток) КАК Остаток,
					|	СУММА(ВЫБОР
					|			КОГДА ОстаткиГруппа.Остаток > 0
					|				ТОГДА ВЫБОР
					|						КОГДА ОстаткиГруппа.Кратность > ОстаткиГруппа.Остаток
					|							ТОГДА 0
					|						ИНАЧЕ ВЫБОР
					|								КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
					|									ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
					|								ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность - 0.5 КАК ЧИСЛО(15, 0))
					|							КОНЕЦ
					|					КОНЕЦ
					|			ИНАЧЕ ВЫБОР
					|					КОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность <= ОстаткиГруппа.Остаток
					|						ТОГДА (ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиГруппа.Кратность
					|					ИНАЧЕ ВЫРАЗИТЬ(ОстаткиГруппа.Остаток / ОстаткиГруппа.Кратность + 0.5 КАК ЧИСЛО(15, 0))
					|				КОНЕЦ
					|		КОНЕЦ) КАК ОстатокПоКратности,
					|	ОстаткиГруппа.Кратность
					|ПОМЕСТИТЬ ОстаткиИтог
					|ИЗ
					|	ОстаткиГруппа КАК ОстаткиГруппа
					|ГДЕ
					|	ОстаткиГруппа.Остаток > 0
					|
					|СГРУППИРОВАТЬ ПО
					|	ОстаткиГруппа.Номенклатура,
					|	ОстаткиГруппа.Кратность
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ТаблицаНоменклатура.Номенклатура,
					|	ВЫБОР
					|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0) > ТаблицаНоменклатура.Количество
					|			ТОГДА ТаблицаНоменклатура.Количество
					|		ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.Остаток, 0)
					|	КОНЕЦ КАК Нехватка_,
					|	ВЫБОР
					|		КОГДА ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0) > ТаблицаНоменклатура.Количество
					|			ТОГДА ТаблицаНоменклатура.Количество
					|		ИНАЧЕ ВЫБОР
					|				КОГДА ТаблицаНоменклатура.Количество < ОстаткиИтог.Кратность
					|					ТОГДА ТаблицаНоменклатура.Количество
					|				ИНАЧЕ ВЫБОР
					|						КОГДА ТаблицаНоменклатура.Количество < ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
					|							ТОГДА ТаблицаНоменклатура.Количество - (ВЫРАЗИТЬ(ТаблицаНоменклатура.Количество / ОстаткиИтог.Кратность - 0.5 КАК ЧИСЛО(15, 0))) * ОстаткиИтог.Кратность
					|						ИНАЧЕ ТаблицаНоменклатура.Количество - ЕСТЬNULL(ОстаткиИтог.ОстатокПоКратности, 0)
					|					КОНЕЦ
					|			КОНЕЦ
					|	КОНЕЦ КАК Нехватка
					|ПОМЕСТИТЬ Рез
					|ИЗ
					|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
					|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиИтог КАК ОстаткиИтог
					|		ПО ТаблицаНоменклатура.Номенклатура = ОстаткиИтог.Номенклатура
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Рез.Номенклатура,
					|	Рез.Нехватка
					|ИЗ
					|	Рез КАК Рез
					|ГДЕ
					|	Рез.Нехватка > 0";         
					
					Запрос.УстановитьПараметр("ТЗ", ТЗ);
					Табл = Запрос.Выполнить().Выгрузить();    
					
					Для каждого стр из Табл Цикл          
						
						Отбор = Новый Структура;
						Отбор.Вставить("Номенклатура", Стр.Номенклатура);
						НайдСтроки = НовыйДокумент.Товары.НайтиСтроки(Отбор);
						КУменьшению = Стр.Нехватка;          
						
						Для каждого Строка из НайдСтроки Цикл   
														
							Если КУменьшению > 0 Тогда          
								
								Если Строка.Количество > КУменьшению Тогда   
									
									Строка.Количество = Строка.Количество - КУменьшению;
									СтрСумма = Строка.Количество * Строка.Цена;
									Строка.Сумма = СтрСумма;
									ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(Строка, НовыйДокумент);  
									
									КУменьшению = 0;
									
								Иначе                                             
									
									КУменьшению = КУменьшению - Строка.Количество; 
									
									НовыйДокумент.Товары.Удалить(Строка);
									
								КонецЕсли;
								
							КонецЕсли;   
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если НовыйДокумент.Товары.Количество() > 0 Тогда 
				//-Гавриленков В. 21.08.2025 #UT10-5390
					Если ДокументыПровести  Тогда 
						НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
					Иначе 
						НовыйДокумент.Записать();
					КонецЕсли;  
					
					МассивНовыхДокументов.Добавить(НовыйДокумент);
				//+Гавриленков В. 21.08.2025 #UT10-5390
				КонецЕсли;
				//-Гавриленков В. 21.08.2025 #UT10-5390
				
				СтрокВДокументе = 0;
				
				Если ТекТовар <> Выборка.Количество() Тогда 
					НовыйДокумент = Документы.ЗаказПокупателя.СоздатьДокумент();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьЗапрос() Экспорт
	
	КоличествоДнейВВыбраномПериоде = (КонецДня(КонПериода) + 1 - НачалоДня(НачПериода)) / 86400;
	СредннейКоличествоДнейВПериоде = Окр(КоличествоДнейВВыбраномПериоде, 0, 1);
	
	// Запрос на продажи за период с сортировкой по убыванию
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	
	Если Отсев Тогда 
		ТекстЗапросаОграничениеПоНоменклатуре = " 
		|			 Номенклатура В
		|					(ВЫБРАТЬ
		|						Номенклатура.Ссылка
		|						ИЗ
		|							Справочник.Номенклатура КАК Номенклатура
		|						ГДЕ
		|					НЕ Номенклатура.НеЗаказыватьАвтоматом )";
	Иначе
		ТекстЗапросаОграничениеПоНоменклатуре = "";
	КонецЕсли;
	
	Если БрендыОтборВключить.Количество()> 0 Тогда
		
		МассивБрендов = БрендыОтборВключить.ВыгрузитьКолонку("Бренд");
		Запрос.УстановитьПараметр("МассивБрендов", МассивБрендов);
		
		Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
			
			ТекстЗапросаОграничениеПоНоменклатуре = " 
			|			Номенклатура.Родитель В (&МассивБрендов) ";
			
		Иначе
			ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
			+ " И Номенклатура.Родитель В (&МассивБрендов) ";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоменклатурныеГруппыОтборВключить.Количество() > 0 Тогда
		
		МассивНГ = НоменклатурныеГруппыОтборВключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("МассивНГ", МассивНГ);
		
		Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
			
			ТекстЗапросаОграничениеПоНоменклатуре = " 
			|			Номенклатура.НоменклатурнаяГруппа В (&МассивНГ) ";
			
		Иначе
			ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
			+ " И Номенклатура.НоменклатурнаяГруппа В (&МассивНГ) ";
		КонецЕсли;
		
	КонецЕсли;
	
	Если БрендыОтборИсключить.Количество() > 0 Тогда
		
		МассивБрендовИсключить = БрендыОтборИсключить.ВыгрузитьКолонку("Бренд");
		Запрос.УстановитьПараметр("МассивБрендовИсключить", МассивБрендовИсключить);
		
		Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
			
			ТекстЗапросаОграничениеПоНоменклатуре = " 
			|			Номенклатура.Родитель НЕ В (&МассивБрендовИсключить) ";
			
		Иначе
			ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
			+" И Номенклатура.Родитель НЕ В (&МассивБрендовИсключить) ";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НоменклатурныеГруппыОтборИсключить.Количество() > 0 Тогда
		
		МассивНГИсключить = НоменклатурныеГруппыОтборИсключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
		Запрос.УстановитьПараметр("МассивНГИсключить", МассивНГИсключить);
		
		Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
			
			ТекстЗапросаОграничениеПоНоменклатуре = " 
			|			Номенклатура.НоменклатурнаяГруппа НЕ В (&МассивНГИсключить) ";
			
		Иначе
			ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
			+ " И Номенклатура.НоменклатурнаяГруппа НЕ В (&МассивНГИсключить) ";
		КонецЕсли;
		
	КонецЕсли;
	
	ГруппаНоменклатурыУценка = Константы.ГруппаНоменклатурыУценка.Получить(); 
	
	Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() и ЗначениеЗаполнено(ГруппаНоменклатурыУценка) Тогда
		
		Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
			ТекстЗапросаУценка = "
			|			НЕ Номенклатура В ИЕРАРХИИ(&Уценка) ";
		Иначе 
			ТекстЗапросаУценка = "
			|			И НЕ Номенклатура В ИЕРАРХИИ(&Уценка) "; 				
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Уценка", ГруппаНоменклатурыУценка);
		
	Иначе
		ТекстЗапросаУценка = "";
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ПродажиОбороты.Регистратор.Грузополучатель
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		КОНЕЦ) КАК КоличествоКлиентов
	|ПОМЕСТИТЬ ПродажиКоличествоКлиентов
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Д1, &Д2, Авто, " + ТекстЗапросаОграничениеПоНоменклатуре + " " + ТекстЗапросаУценка + ") КАК ПродажиОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ПродажиОбороты.Регистратор.Грузополучатель
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		КОНЕЦ <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.КоличествоОборот > 0
	|				ТОГДА ПродажиОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоОборот,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоРеализаций,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|					ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоВозвратов,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.КоличествоОборот < 0
	|				ТОГДА ПродажиОбороты.КоличествоОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КолВозвратШт,
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|				ТОГДА ПродажиОбороты.КоличествоОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоПродажПоКонкретнойНакладной,
	|	СУММА(ЕСТЬNULL(ПродажиКоличествоКлиентов.КоличествоКлиентов, 0)) КАК КоличествоКлиентов,
	|	ПродажиОбороты.Регистратор
	|ПОМЕСТИТЬ ПродажиТоваров
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Д1, &Д2, Авто, " + ТекстЗапросаОграничениеПоНоменклатуре + " " + ТекстЗапросаУценка + ") КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиКоличествоКлиентов КАК ПродажиКоличествоКлиентов
	|		ПО ПродажиОбороты.Номенклатура = ПродажиКоличествоКлиентов.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиТоваров.Номенклатура,
	|	СУММА(ПродажиТоваров.КоличествоОборот) КАК КоличествоОборот,
	|	СУММА(ПродажиТоваров.КоличествоРеализаций) КАК КоличествоРеализаций,
	|	СУММА(ПродажиТоваров.КоличествоВозвратов) КАК КоличествоВозвратов,
	|	СУММА(ПродажиТоваров.КолВозвратШт) КАК КолВозвратШт,
	|	МАКСИМУМ(ПродажиТоваров.КоличествоПродажПоКонкретнойНакладной) КАК КоличествоПродажПоКонкретнойНакладной,
	|	МАКСИМУМ(ПродажиТоваров.КоличествоКлиентов) КАК КоличествоКлиентов
	|ПОМЕСТИТЬ ПродажиОбороты2
	|ИЗ
	|	ПродажиТоваров КАК ПродажиТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиТоваров.Номенклатура
	|
	| ИМЕЮЩИЕ 
	| СУММА(ПродажиТоваров.КоличествоРеализаций) >= &КоличествоРеализацийБолее
	|	
	|   
	|ИНДЕКСИРОВАТЬ ПО ПродажиТоваров.Номенклатура
	|;				   
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты2.Номенклатура,
	|	ПродажиОбороты2.КоличествоОборот,
	|	ПродажиОбороты2.КоличествоРеализаций,
	|	ПродажиОбороты2.КоличествоВозвратов,
	|	ПродажиОбороты2.КолВозвратШт,
	|	ПродажиОбороты2.КоличествоПродажПоКонкретнойНакладной,
	|	ПродажиОбороты2.КоличествоКлиентов,
	|	СправочникНоменклатура.КодПоБазеМоскоречье КАК Артикул,
	|	СправочникНоменклатура.ГруппаАВС КАК АВС_Москва,
	|	СправочникНоменклатура.Родитель КАК ГруппаТоваров,
	|	СправочникНоменклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	СправочникНоменклатура.КодПроизводителя КАК КодПроизводителя,
	|	ВЫБОР
	|		КОГДА СправочникНоменклатура.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ СправочникНоменклатура.Кратность
	|	КОНЕЦ КАК Кратность
	|ПОМЕСТИТЬ ПродажиОбороты3
	|ИЗ
	|	ПродажиОбороты2 КАК ПродажиОбороты2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО ПродажиОбороты2.Номенклатура = СправочникНоменклатура.Ссылка
	|   
	|ИНДЕКСИРОВАТЬ ПО ПродажиОбороты2.Номенклатура 
	|; ";
	
	
	ТекДата = НачПериода;
	ТекМесяц = 0;
	КоличествоПериодов = 0;
	
	Пока ТекДата < КонПериода Цикл 
		
		Если ТекМесяц <> Месяц(ТекДата) Тогда 
			
			ТекМесяц = Месяц(ТекДата);
			КоличествоПериодов = КоличествоПериодов + 1;
			ДатаНачалаПериода = НачалоМесяца(ТекДата);
			
			Если ТекМесяц = Месяц(КонПериода) и ГОД(ТекДата) = ГОД(КонПериода) Тогда 
				ДатаОкончанияПериода = КонПериода;
			Иначе
				ДатаОкончанияПериода = КонецМесяца(ТекДата);
			КонецЕсли; 
			
			Запрос.Текст =  Запрос.Текст + "
			|ВЫБРАТЬ
			|	ПродажиОбороты.Номенклатура КАК Номенклатура,
			|  СУММА(ВЫБОР
			|     	КОГДА ПродажиОбороты.КоличествоОборот > 0
			|		ТОГДА ПродажиОбороты.КоличествоОборот
			|	ИНАЧЕ 0
			|	КОНЕЦ) КАК КоличествоОборот" + КоличествоПериодов + "
			|ПОМЕСТИТЬ ПродажиПериод" + КоличествоПериодов + " 
			|ИЗ
			|	РегистрНакопления.Продажи.Обороты(&ДНач" + КоличествоПериодов + ", &ДКон" + КоличествоПериодов + ", , " 
			+ ТекстЗапросаОграничениеПоНоменклатуре + " " + ТекстЗапросаУценка + ") КАК ПродажиОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ПродажиОбороты.Номенклатура
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;";
			
			Запрос.УстановитьПараметр("ДНач" + КоличествоПериодов, НачалоДня(ДатаНачалаПериода));
			Запрос.УстановитьПараметр("ДКон" + КоличествоПериодов, КонецДня(ДатаОкончанияПериода));
			
		КонецЕсли;
		
		Если ТекМесяц = Месяц(КонПериода) Тогда 
			Прервать;
		КонецЕсли; 
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + 
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Скидка38ЦеныНоменклатуры.Номенклатура,
	|	Скидка38ЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &Скидка38
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					ПродажиТоваров.Номенклатура
	|				ИЗ
	|					ПродажиТоваров КАК ПродажиТоваров)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК Скидка38ЦеныНоменклатуры
	|		ПО Таблица2.ТипЦен = Скидка38ЦеныНоменклатуры.ТипЦен
	|			И Таблица2.Номенклатура = Скидка38ЦеныНоменклатуры.Номенклатура
	|			И Таблица2.Период = Скидка38ЦеныНоменклатуры.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Скидка38ЦеныНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗакупочнаяЦеныНоменклатуры.Номенклатура,
	|	ЗакупочнаяЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ ЗакупочнаяЦена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЦеныНоменклатуры.ТипЦен КАК ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|		МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|	ГДЕ
	|		ЦеныНоменклатуры.ТипЦен = &ЗакупочнаяЦена
	|		И ЦеныНоменклатуры.Номенклатура В
	|				(ВЫБРАТЬ
	|					ПродажиТоваров.Номенклатура
	|				ИЗ
	|					ПродажиТоваров КАК ПродажиТоваров)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЦеныНоменклатуры.ТипЦен,
	|		ЦеныНоменклатуры.Номенклатура) КАК Таблица2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЗакупочнаяЦеныНоменклатуры
	|		ПО Таблица2.ТипЦен = ЗакупочнаяЦеныНоменклатуры.ТипЦен
	|			И Таблица2.Номенклатура = ЗакупочнаяЦеныНоменклатуры.Номенклатура
	|			И Таблица2.Период = ЗакупочнаяЦеныНоменклатуры.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗакупочнаяЦеныНоменклатуры.Номенклатура
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	МИНИМУМ(ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата) КАК ЗаказПоставщикуДата
	|ПОМЕСТИТЬ МинимальныеДатыЗаказа
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(,
	|		Номенклатура В
	|			(ВЫБРАТЬ
	|				ПродажиТоваров.Номенклатура
	|			ИЗ
	|				ПродажиТоваров КАК ПродажиТоваров) ) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура
	|   
	|ИНДЕКСИРОВАТЬ ПО ЗаказыПоставщикамОстатки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МинимальныеДатыЗаказа.Номенклатура,
	|	МИНИМУМ(МинимальныеДатыЗаказа.ЗаказПоставщикуДата) КАК Дата,
	|	МИНИМУМ(ЗаказыПоставщикамОстатки.ЗаказПоставщику) КАК ЗаказПоставщику
	|ПОМЕСТИТЬ ЗаказыПоставщикуСМинимальнойДатой
	|ИЗ
	|	МинимальныеДатыЗаказа КАК МинимальныеДатыЗаказа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки(,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ПродажиТоваров.Номенклатура
	|				ИЗ
	|					ПродажиТоваров КАК ПродажиТоваров)) КАК ЗаказыПоставщикамОстатки
	|		ПО МинимальныеДатыЗаказа.Номенклатура = ЗаказыПоставщикамОстатки.Номенклатура
	|			И МинимальныеДатыЗаказа.ЗаказПоставщикуДата = ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	МинимальныеДатыЗаказа.Номенклатура
	|   
	|ИНДЕКСИРОВАТЬ ПО МинимальныеДатыЗаказа.Номенклатура	
	|;
	|	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ЗаказаноУПоставщиков
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблТоваров.Номенклатура
	|				ИЗ
	|					ПродажиТоваров КАК ТаблТоваров)) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказаноУПоставщиков.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказаноУПоставщиков.ЗаказПоставщику.Контракт
	|				ТОГДА ЗаказаноУПоставщиков.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОстатокКонтракт,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ЗаказаноУПоставщиков.ЗаказПоставщику.Контракт
	|				ТОГДА ЗаказаноУПоставщиков.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОстатокНЕКонтракт,
	|	СУММА(ЗаказаноУПоставщиков.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ЗаказаноУПостащиковИтого
	|ИЗ
	|	ЗаказаноУПоставщиков КАК ЗаказаноУПоставщиков
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноУПоставщиков.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	СУММА(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РазмещеноЗаказов
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			,
	|		ЗаказПокупателя <> &ПустойЗаказПокупателя
	|			И ЗаказПоставщику В
	|				(ВЫБРАТЬ
	|					ТаблЗаказовПоставщику.ЗаказПоставщику
	|				ИЗ
	|					ЗаказаноУПоставщиков КАК ТаблЗаказовПоставщику)
	|			И Номенклатура В
	|				(ВЫБРАТЬ
	|					ПродажиТоваров.Номенклатура
	|				ИЗ
	|					ПродажиТоваров КАК ПродажиТоваров)) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещеноЗаказов.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА РазмещеноЗаказов.ЗаказПоставщику.Контракт
	|				ТОГДА РазмещеноЗаказов.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазмещеноКонтракт,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ РазмещеноЗаказов.ЗаказПоставщику.Контракт
	|				ТОГДА РазмещеноЗаказов.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазмещеноНЕКонтракт,
	|	СУММА(РазмещеноЗаказов.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РазмещеноЗаказовИтого
	|ИЗ
	|	РазмещеноЗаказов КАК РазмещеноЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещеноЗаказов.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////////////////////////	      
	|ВЫБРАТЬ
	|	Календарь.ДатаКалендаря
	|ПОМЕСТИТЬ Календарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Календарь
	|ГДЕ
	|	Календарь.ДатаКалендаря >= &Д1
	|	И Календарь.ДатаКалендаря <= &Д2
	
	|ИНДЕКСИРОВАТЬ ПО
	|	Календарь.ДатаКалендаря
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Календарь.ДатаКалендаря,
	|	Т1.Номенклатура,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА Календарь.ДатаКалендаря <> Т1.Период
	|				ТОГДА 0
	|			ИНАЧЕ Т1.КоличествоРасход
	|		КОНЕЦ) КАК КоличествоРасход,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА Т1.Период = &Д1
	|					ТОГДА Т1.КоличествоНачальныйОстаток
	|			КОНЕЦ), 0) + ЕСТЬNULL(СУММА(Т1.КоличествоОборот), 0) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиНаКаждыйДень
	|ИЗ
	|	Календарь КАК Календарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(&Д1, &Д2, День, , Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ПродажиТоваров.Номенклатура
	|					ИЗ
	|						ПродажиТоваров КАК ПродажиТоваров)) КАК Т1
	|		ПО Календарь.ДатаКалендаря >= Т1.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Календарь.ДатаКалендаря,
	|	Т1.Номенклатура
	|;
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т2.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ЕСТЬNULL(Т2.КоличествоОстаток, 0) > 0
	|					ИЛИ ЕСТЬNULL(Т2.КоличествоОстаток, 0) = 0
	|						И ЕСТЬNULL(Т2.КоличествоРасход, 0) > 0
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоДней
	|ПОМЕСТИТЬ КоличествоДнейВПродаже
	|ИЗ
	|	ОстаткиНаКаждыйДень КАК Т2
	|СГРУППИРОВАТЬ ПО
	|	Т2.Номенклатура
	|ИНДЕКСИРОВАТЬ ПО
	|	Т2.Номенклатура	
	|;   	
	|////////////////////////////////////////////////////////////////////////////////////////////////////	   
	|ВЫБРАТЬ
	|		Номенклатура.Ссылка КАК Номенклатура,
	|		ЕдиницыИзмерения.Коэффициент
	|ПОМЕСТИТЬ УпаковкиНоменклатуры
	|	ИЗ
	|		Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|			ПО ЕдиницыИзмерения.Владелец = Номенклатура.Ссылка
	|ГДЕ
	|		ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код = ""999""
	|		И ЕдиницыИзмерения.Коэффициент > 1
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.Артикул,
	|	ПродажиОбороты.АВС_Москва,
	|	ПродажиОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ПродажиОбороты.ГруппаТоваров,
	|	ПродажиОбороты.КодПроизводителя,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0) КАК УпаковкаОтгрузки,
	|	ПродажиОбороты.Кратность,
	|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоПродано,
	|	МАКСИМУМ(ПродажиОбороты.КоличествоПродажПоКонкретнойНакладной) КАК МаксимумПродаж,
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоРезерв,
	
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) - МАКСИМУМ(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток,
	|	(СУММА(ПродажиОбороты.КоличествоОборот) - СУММА(ПродажиОбороты.КолВозвратШт)) / &СредннейКоличествоДнейВПериоде КАК СреднееКоличествоПродано,
	|   ВЫБОР 
	|        КОГДА МАКСИМУМ(КоличествоДнейВПродаже.КоличествоДней) > 0 ТОГДА
	|   		 ( ( СУММА(ПродажиОбороты.КоличествоОборот) - СУММА(ПродажиОбороты.КолВозвратШт) ) / МАКСИМУМ(КоличествоДнейВПродаже.КоличествоДней) ) 
	|        ИНАЧЕ 0
	|   КОНЕЦ  КАК СреднееКоличествоПроданоВариант2,	
	|	МАКСИМУМ(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаказаноУПостащиковИтого.КоличествоОстаток, 0)) КАК КоличествоЗаказаноВсего,
	|	СУММА(ЕСТЬNULL(РазмещеноЗаказовИтого.КоличествоОстаток, 0)) КАК КоличествоРазмещено,
	|	СУММА(ПродажиОбороты.КоличествоРеализаций) КАК КоличествоРеализаций,
	|	СУММА(ПродажиОбороты.КоличествоВозвратов) КАК КоличествоВозвратов,
	|	СУММА(ПродажиОбороты.КолВозвратШт) КАК КоличествоВозвращенногоТовара,
	|	МАКСИМУМ(ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.Количество, 0)) КАК ОстатокВМоскве,
	|	МАКСИМУМ(ЕСТЬNULL(ЗакупочнаяЦенаСрезПоследних.Цена, 0)) КАК ЗакупочнаяЦена,
	|	МАКСИМУМ(ЕСТЬNULL(Скидка38СрезПоследних.Цена, 0)) КАК Скидка38,
	|	СУММА(ПродажиОбороты.КоличествоКлиентов) КАК КоличествоКлиентов,
	|	ЕСТЬNULL(ЗаказаноУПостащиковИтого.ОстатокНЕКонтракт, 0) - ЕСТЬNULL(РазмещеноЗаказовИтого.РазмещеноНЕКонтракт, 0) КАК УжеЗаказано,
	|	СУММА(ЕСТЬNULL(ЗаказаноУПостащиковИтого.ОстатокКонтракт, 0) - ЕСТЬNULL(РазмещеноЗаказовИтого.РазмещеноКонтракт, 0)) КАК УжеЗаказаноКонтракт,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗаказыПоставщикуСМинимальнойДатой.Дата, ДЕНЬ), ДЕНЬ, ЕСТЬNULL(ЗаказыПоставщикуСМинимальнойДатой.ЗаказПоставщику.СрокВыполненияЗаказа, 0)), ДЕНЬ), 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗаказыПоставщикуСМинимальнойДатой.Дата, ДЕНЬ), ДЕНЬ, ЕСТЬNULL(ЗаказыПоставщикуСМинимальнойДатой.ЗаказПоставщику.СрокВыполненияЗаказа, 0)), ДЕНЬ), 0)
	|	КОНЕЦ КАК ОставшеесяКоличествоДнейДоПоступления,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА СУММА(ПродажиОбороты.КоличествоРеализаций) = 0
	|				ТОГДА 0
	|			ИНАЧЕ СУММА(ПродажиОбороты.КоличествоОборот) / СУММА(ПродажиОбороты.КоличествоРеализаций)
	|		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СредняяГлубинаПродаж  ,
	|   МАКСИМУМ(ЕСТЬNULL(ЕдиницыИзмерения.Негабарит,ЛОЖЬ) ) КАК Негабарит,
	|	ПродажиОбороты.Номенклатура.ГорючиеЖидкости КАК ГорючиеЖидкости,
	|   МАКСИМУМ(ЕстьNULL(ЕдиницыИзмерения.КратностьМашинокомплекта, 0)) КАК КратностьМашинокомплекта,
	|   МАКСИМУМ(КоличествоДнейВПродаже.КоличествоДней) КАК КоличествоДнейВПродаже";
	
	Для сч =1 по КоличествоПериодов Цикл
		Запрос.Текст = Запрос.Текст + "
		|		,СУММА(ЕСТЬNULL(КоличествоОборот" + сч + ", 0)) КАК КоличествоОборот" + сч + "";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "
	|ПОМЕСТИТЬ ВТРезультат   
	|ИЗ	
	|	ПродажиОбороты3 КАК ПродажиОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ПродажиТоваров.Номенклатура
	|					ИЗ
	|						ПродажиТоваров КАК ПродажиТоваров)) КАК ТоварыНаСкладахОстатки
	|		ПО ПродажиОбороты.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Д2, Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ПродажиТоваров.Номенклатура
	|					ИЗ
	|						ПродажиТоваров КАК ПродажиТоваров)) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ПродажиОбороты.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|		ПО ПродажиОбороты.Номенклатура = МосковскиеОстаткиНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакупочнаяЦена КАК ЗакупочнаяЦенаСрезПоследних
	|		ПО ПродажиОбороты.Номенклатура = ЗакупочнаяЦенаСрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38СрезПоследних
	|		ПО ПродажиОбороты.Номенклатура = Скидка38СрезПоследних.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноУПостащиковИтого КАК ЗаказаноУПостащиковИтого
	|		ПО ПродажиОбороты.Номенклатура = ЗаказаноУПостащиковИтого.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РазмещеноЗаказовИтого КАК РазмещеноЗаказовИтого
	|		ПО ПродажиОбороты.Номенклатура = РазмещеноЗаказовИтого.Номенклатура
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|       ПО ПродажиОбороты.Номенклатура = СпрНоменклатура.Ссылка 
	|       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ЕдиницыИзмерения.Владелец = СпрНоменклатура.Ссылка И ЕдиницыИзмерения.Ссылка = СпрНоменклатура.ЕдиницаХраненияОстатков
	|       ЛЕВОЕ СОЕДИНЕНИЕ КоличествоДнейВПродаже КАК КоличествоДнейВПродаже
	|       ПО КоличествоДнейВПродаже.Номенклатура = ПродажиОбороты.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО ПродажиОбороты.Номенклатура = УпаковкиНоменклатуры.Номенклатура";
	
	Для сч = 1 по КоличествоПериодов Цикл
		Запрос.Текст = Запрос.Текст + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПродажиПериод" + сч + " КАК ПродажиПериод" + сч + "
		|		ПО ПродажиОбороты.Номенклатура = ПродажиПериод" + сч + ".Номенклатура ";
	КонецЦикла;
	
	Запрос.Текст = Запрос.Текст + "  	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказыПоставщикуСМинимальнойДатой КАК ЗаказыПоставщикуСМинимальнойДатой
	|		ПО ПродажиОбороты.Номенклатура = ЗаказыПоставщикуСМинимальнойДатой.Номенклатура ";
	
	Запрос.Текст = Запрос.Текст + "
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура,
	|	ПродажиОбороты.Артикул,
	|	ПродажиОбороты.АВС_Москва,
	|	ПродажиОбороты.НоменклатурнаяГруппа,
	|	ПродажиОбороты.ГруппаТоваров,
	|	ПродажиОбороты.КодПроизводителя,
	|	ПродажиОбороты.Кратность,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗаказыПоставщикуСМинимальнойДатой.Дата, ДЕНЬ), ДЕНЬ, ЕСТЬNULL(ЗаказыПоставщикуСМинимальнойДатой.ЗаказПоставщику.СрокВыполненияЗаказа, 0)), ДЕНЬ), 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ЗаказыПоставщикуСМинимальнойДатой.Дата, ДЕНЬ), ДЕНЬ, ЕСТЬNULL(ЗаказыПоставщикуСМинимальнойДатой.ЗаказПоставщику.СрокВыполненияЗаказа, 0)), ДЕНЬ), 0)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ЗаказаноУПостащиковИтого.ОстатокНЕКонтракт, 0) - ЕСТЬNULL(РазмещеноЗаказовИтого.РазмещеноНЕКонтракт, 0),
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0)
	|";
	
	Запрос.Текст = Запрос.Текст + "	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.ГруппаТоваров,
	|   СУММА(Т1.КоличествоПродано) КАК КоличествоПродано
	|	
	|ИЗ 
	|   ВТРезультат КАК Т1
	|СГРУППИРОВАТЬ ПО Т1.ГруппаТоваров
	|   
	|УПОРЯДОЧИТЬ  ПО Т1.ГруппаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т1.*	
	|ИЗ 
	|   ВТРезультат КАК Т1	
	|";	
	
	Если КоличествоПериодов = 0 Тогда 
		
		Сообщить("Слишком маленький временной интервал для аналитики! Увеличьте временной интервал!");
		Возврат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("КоличествоРеализацийБолее", КоличествоРеализацийБолее);
	Запрос.УстановитьПараметр("ЗакупочнаяЦена", Константы.ЗакупочнаяЦена.Получить());
	Запрос.УстановитьПараметр("Скидка38", 		Константы.Скидка38.Получить());
	Запрос.УстановитьПараметр("Контрагент", 	Константы.ОсновнойПоставщик.Получить());	
	
	Запрос.УстановитьПараметр("Д1", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("Д2", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());
	Запрос.УстановитьПараметр("ПустойЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("СредннейКоличествоДнейВПериоде", СредннейКоличествоДнейВПериоде);
	
	МассивРезультатов       = Запрос.ВыполнитьПакет();
	ИтогиПоГруппамТоваровТЗ = МассивРезультатов[ МассивРезультатов.Количество() - 2].Выгрузить();
	ТЗ					    = МассивРезультатов[ МассивРезультатов.Количество() - 1].Выгрузить();	
	
	ТЗ.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10));
	
	ВсегоПродано = ТЗ.Итог("КоличествоПродано");               
	ТЗ.Сортировать("КоличествоПродано Убыв");
	
	ГруппаПроцентов1 = Окр(ВсегоПродано * АКласс / 100, 0,0);
	ГруппаПроцентов2 = Окр(ВсегоПродано * БКласс / 100, 0,0);
	ГруппаПроцентов3 = Окр(ВсегоПродано * СКласс / 100, 0,0);	
	
	РасчитатьABCКоличествоПродажи(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3);
	
	ВсегоРеализаций =   ТЗ.Итог("КоличествоРеализаций");               
	
	ГруппаПроцентов1 = Окр(ВсегоРеализаций * АКласс / 100, 0,0);
	ГруппаПроцентов2 = Окр(ВсегоРеализаций * БКласс / 100, 0,0);           
	ГруппаПроцентов3 = Окр(ВсегоРеализаций * СКласс / 100, 0,0);	
	
	РасчитатьABCКоличествоРеализаций(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3);
	
	ВсегоКлиентов =   ТЗ.Итог("КоличествоКлиентов");               
	
	ГруппаПроцентов1 = Окр(ВсегоКлиентов * АКласс / 100, 0,0);
	ГруппаПроцентов2 = Окр(ВсегоКлиентов * БКласс / 100, 0,0);
	ГруппаПроцентов3 = Окр(ВсегоКлиентов * СКласс / 100, 0,0);	
	
	РасчитатьABCКоличествоКлиентов(ТЗ, ГруппаПроцентов1, ГруппаПроцентов2, ГруппаПроцентов3);
	
	РассчитатьABCВнутриПроизводителя(ТЗ, ИтогиПоГруппамТоваровТЗ);
	РезультатПримененияОтбора = ОбработатьТаблицу();
	Товары.Загрузить(РезультатПримененияОтбора); 

КонецПроцедуры

Процедура ВыполнитьЗапросНеликвид(МассивТоваров = Неопределено) Экспорт   
	
	//+Гавриленков В. 25.06.2025 #UT10-5303 
	Попытка
		ВестиУчетТоваровОрганизацийВРазрезеСкладов = РегистрыСведений.УчетнаяПолитика.СрезПоследних(ТекущаяДата(),)[0].ВестиУчетТоваровОрганизацийВРазрезеСкладов;
	Исключение   
		ВестиУчетТоваровОрганизацийВРазрезеСкладов = Истина;
	КонецПопытки;
	//-Гавриленков В. 25.06.2025 #UT10-5303
	
	Товары.Очистить();
	Запрос = Новый Запрос; 
	
	//+Белов А. 13.10.2025 #UT10-5462
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров); 
	
	Если МассивТоваров = Неопределено Тогда
		//-Белов А. 13.10.2025 #UT10-5462
		
		Если Отсев Тогда 
			ТекстЗапросаОграничениеПоНоменклатуре = " 
			|			 Номенклатура В
			|					(ВЫБРАТЬ
			|						Номенклатура.Ссылка
			|						ИЗ
			|							Справочник.Номенклатура КАК Номенклатура
			|						ГДЕ
			|					НЕ Номенклатура.НеЗаказыватьАвтоматом )";
		Иначе
			ТекстЗапросаОграничениеПоНоменклатуре = "";
		КонецЕсли;
		
		Если БрендыОтборВключить.Количество()> 0 Тогда
			
			МассивБрендов = БрендыОтборВключить.ВыгрузитьКолонку("Бренд");
			Запрос.УстановитьПараметр("МассивБрендов", МассивБрендов);
			
			Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
				ТекстЗапросаОграничениеПоНоменклатуре = " 
				|			Номенклатура.Родитель В (&МассивБрендов) ";
				
			Иначе
				ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
				+ " И Номенклатура.Родитель В (&МассивБрендов) ";
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоменклатурныеГруппыОтборВключить.Количество()> 0 Тогда
			
			МассивНГ = НоменклатурныеГруппыОтборВключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
			Запрос.УстановитьПараметр("МассивНГ", МассивНГ);
			
			Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
				ТекстЗапросаОграничениеПоНоменклатуре = " 
				|			Номенклатура.НоменклатурнаяГруппа В (&МассивНГ) ";
				
			Иначе
				ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
				+ " И Номенклатура.НоменклатурнаяГруппа В (&МассивНГ) ";
			КонецЕсли;
			
		КонецЕсли;
		
		Если БрендыОтборИсключить.Количество()> 0 Тогда
			
			МассивБрендовИсключить = БрендыОтборИсключить.ВыгрузитьКолонку("Бренд");
			Запрос.УстановитьПараметр("МассивБрендовИсключить", МассивБрендовИсключить);
			
			Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
				ТекстЗапросаОграничениеПоНоменклатуре = " 
				|			Номенклатура.Родитель НЕ В (&МассивБрендовИсключить) ";
				
			Иначе
				ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
				+ " И Номенклатура.Родитель НЕ В (&МассивБрендовИсключить) ";
			КонецЕсли;
			
		КонецЕсли;
		
		Если НоменклатурныеГруппыОтборИсключить.Количество()> 0 Тогда
			
			МассивНГИсключить = НоменклатурныеГруппыОтборИсключить.ВыгрузитьКолонку("НоменклатурнаяГруппа");
			Запрос.УстановитьПараметр("МассивНГИсключить", МассивНГИсключить);
			
			Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
				ТекстЗапросаОграничениеПоНоменклатуре = " 
				|			Номенклатура.НоменклатурнаяГруппа НЕ В (&МассивНГИсключить) ";
				
			Иначе
				ТекстЗапросаОграничениеПоНоменклатуре = ТекстЗапросаОграничениеПоНоменклатуре
				+ " И Номенклатура.НоменклатурнаяГруппа НЕ В (&МассивНГИсключить) ";
			КонецЕсли;
			
		КонецЕсли;
		
		
		ТекстЗапросаОграничениеПоНоменклатуре = "Склад = &Склад" + ?(ТекстЗапросаОграничениеПоНоменклатуре = "", "", " И ") + ТекстЗапросаОграничениеПоНоменклатуре;
		ГруппаНоменклатурыУценка = Константы.ГруппаНоменклатурыУценка.Получить(); 
		
		Если Константы.ИспользоватьГруппуНоменклатурыУценка.Получить() и ЗначениеЗаполнено(ГруппаНоменклатурыУценка) Тогда
			
			Если ТекстЗапросаОграничениеПоНоменклатуре = "" Тогда
				ТекстЗапросаУценка = "
				|			НЕ Номенклатура В ИЕРАРХИИ(&Уценка) ";
			Иначе 
				ТекстЗапросаУценка = "
				|			И НЕ Номенклатура В ИЕРАРХИИ(&Уценка) "; 				
			КонецЕсли;
			
			Запрос.УстановитьПараметр("Уценка", ГруппаНоменклатурыУценка);
			
		Иначе
			ТекстЗапросаУценка = "";
		КонецЕсли;
		
		//+Шульман А. 16.12.2024 #UT10-4991    
		ТекстЗапросаОграничениеПоНоменклатуреТОХ = СтрЗаменить(ТекстЗапросаОграничениеПоНоменклатуре, "Склад = &Склад", "");
		ТекстУсловияТОХ = ТекстЗапросаОграничениеПоНоменклатуреТОХ + " " + ТекстЗапросаУценка;
		//-Шульман А. 16.12.2024 #UT10-4991 
		
	Иначе
		                   
		ТекстЗапросаОграничениеПоНоменклатуре = " Номенклатура в (&МассивТоваров)"; 
		ТекстУсловияТОХ = " И Номенклатура в (&МассивТоваров)"; 
		
	КонецЕсли;
	
	Запрос.Текст = 
	//+Шульман А. 16.12.2024 #UT10-4991 
	"ВЫБРАТЬ
	|	ТОХОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТОХОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиКонецТОХ
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(
	|			&ДатаКон,
	|			(Контрагент = &КонтрагентТОХ
	|				ИЛИ &КонтрагентТОХПустой)
	|					И (ДоговорКонтрагента = &ДоговорПоставщикаТОХ
	|						ИЛИ &ДоговорПоставщикаТОХПустой) " + ТекстУсловияТОХ + ") КАК ТОХОстатки
	|
	|ГДЕ
	|	ТОХОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТОХОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;             
	//-Шульман А. 16.12.2024 #UT10-4991 
    //+Пашкин О. 21.05.2025 #UT10-5188 
	|ВЫБРАТЬ
	|	ТОХОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(ТОХОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиКонецТОХПереданные
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(
	|			&ДатаКон,
	|			(Контрагент = &КонтрагентТОХ
	|				ИЛИ &КонтрагентТОХПустой)
	|					И (ДоговорКонтрагента = &ДоговорПоставщикаТОХ
	|						ИЛИ &ДоговорПоставщикаТОХПустой) " + ТекстУсловияТОХ + ") КАК ТОХОстатки
	|
	|ГДЕ
	|	ТОХОстатки.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТОХОстатки.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;             
    //-Пашкин О. 21.05.2025 #UT10-5188 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ ОстаткиКонец
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон, " + ТекстЗапросаОграничениеПоНоменклатуре + " " + ТекстЗапросаУценка + ") КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	ОстаткиКонец.Склад,
	|	ОстаткиКонец.Номенклатура,
	|	ОстаткиКонец.КоличествоОстаток КАК ОстатокКонец,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК ОстатокНачало
	|ПОМЕСТИТЬ ТоварыСОстатками
	|ИЗ
	|	ОстаткиКонец КАК ОстаткиКонец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ДатаНач,
	|				Склад = &Склад
	|					И (Номенклатура, Склад) В
	|						(ВЫБРАТЬ
	|							ОстаткиКонец.Номенклатура КАК Номенклатура,
	|							ОстаткиКонец.Склад КАК Склад
	|						ИЗ
	|							ОстаткиКонец КАК ОстаткиКонец)) КАК ТоварыНаСкладахОстатки
	|		ПО ОстаткиКонец.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И ОстаткиКонец.Склад = ТоварыНаСкладахОстатки.Склад
	|ГДЕ
	|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыСОстатками.Склад КАК Склад,
	|	ТоварыСОстатками.Номенклатура КАК Номенклатура,
	|	ТоварыСОстатками.ОстатокНачало,
	|	ТоварыСОстатками.ОстатокКонец,
	|	ЕСТЬNULL(ТаблПродаж.Продажи, 0) КАК Продажи
	|ПОМЕСТИТЬ ТоварыСОстаткамиБезПродаж
	|ИЗ
	|	ТоварыСОстатками КАК ТоварыСОстатками
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПродажиОбороты.Номенклатура КАК Номенклатура,
	|			СУММА(ВЫБОР
	|					КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ) КАК Регистратор,
	|			СУММА(ЕСТЬNULL(ПродажиОбороты.КоличествоОборот, 0)) КАК Продажи
	|		ИЗ
	|			РегистрНакопления.Продажи.Обороты(
	|					&ДатаНач,
	|					&ДатаКон,
	|					Авто,
	|					Номенклатура В
	|						(ВЫБРАТЬ
	|							ТоварыСОстатками.Номенклатура
	|						ИЗ
	|							ТоварыСОстатками КАК ТоварыСОстатками)) КАК ПродажиОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПродажиОбороты.Номенклатура) КАК ТаблПродаж
	|		ПО ТоварыСОстатками.Номенклатура = ТаблПродаж.Номенклатура
	|ГДЕ
	|	ЕСТЬNULL(ТаблПродаж.Регистратор, 0) = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблПродаж.Номенклатура,
	|	ТоварыСОстатками.Склад,
	|	ТоварыСОстатками.Номенклатура,
	|	ТоварыСОстатками.ОстатокНачало,
	|	ТоварыСОстатками.ОстатокКонец,
	|	ЕСТЬNULL(ТаблПродаж.Продажи, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ПОМЕСТИТЬ Календарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаНач И &ДатаКон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийОстаткиИОбороты.Период,
	|	ТоварыОрганизацийОстаткиИОбороты.Номенклатура,
	|	ТоварыОрганизацийОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТоварыОрганизацийОстаткиИОбороты.КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ ТаблицаОстатковЗаПериод
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.ОстаткиИОбороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			День,
	|			,
	//+Гавриленков В. 25.06.2025 #UT10-5303  Добавлено условие по Складу
	|			" + ?(ВестиУчетТоваровОрганизацийВРазрезеСкладов, "Склад = &Склад
	|				И ", "") + "Номенклатура В
	|					(ВЫБРАТЬ
	|						ТоварыСОстаткамиБезПродаж.Номенклатура
	|					ИЗ
	|						ТоварыСОстаткамиБезПродаж КАК ТоварыСОстаткамиБезПродаж)) КАК ТоварыОрганизацийОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Календарь.ДатаКалендаря,
	|	МАКСИМУМ(ТаблицаОстатковЗаПериод.Период) КАК Период,
	|	ТаблицаОстатковЗаПериод.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаОстатковЗаПериодСДатами
	|ИЗ
	|	Календарь КАК Календарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковЗаПериод КАК ТаблицаОстатковЗаПериод
	|		ПО Календарь.ДатаКалендаря >= ТаблицаОстатковЗаПериод.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	Календарь.ДатаКалендаря,
	|	ТаблицаОстатковЗаПериод.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДниСОстатком.Номенклатура КАК Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ДниСОстатком.Остаток = 0
	|				ТОГДА 0
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК КолДней
	|ПОМЕСТИТЬ КоличествоДнейСОстатком
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаОстатковЗаПериодСДатами.ДатаКалендаря КАК ДатаКалендаря,
	|		ТаблицаОстатковЗаПериод.Номенклатура КАК Номенклатура,
	|		СУММА(ВЫБОР
	|				КОГДА ТаблицаОстатковЗаПериодСДатами.ДатаКалендаря > ТаблицаОстатковЗаПериод.Период
	|					ТОГДА ТаблицаОстатковЗаПериод.КоличествоКонечныйОстаток
	|				ИНАЧЕ ТаблицаОстатковЗаПериод.КоличествоКонечныйОстаток
	|			КОНЕЦ) КАК Остаток
	|	ИЗ
	|		ТаблицаОстатковЗаПериодСДатами КАК ТаблицаОстатковЗаПериодСДатами
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатковЗаПериод КАК ТаблицаОстатковЗаПериод
	|			ПО ТаблицаОстатковЗаПериодСДатами.Период = ТаблицаОстатковЗаПериод.Период
	|				И ТаблицаОстатковЗаПериодСДатами.Номенклатура = ТаблицаОстатковЗаПериод.Номенклатура
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаОстатковЗаПериодСДатами.ДатаКалендаря,
	|		ТаблицаОстатковЗаПериод.Номенклатура) КАК ДниСОстатком
	|
	|СГРУППИРОВАТЬ ПО
	|	ДниСОстатком.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Календарь.ДатаКалендаря) КАК ДатаКалендаря
	|ПОМЕСТИТЬ ДнейВПериоде
	|ИЗ
	|	Календарь КАК Календарь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КоличествоДнейСОстатком.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	КоличествоДнейСОстатком КАК КоличествоДнейСОстатком,
	|	ДнейВПериоде КАК ДнейВПериоде
	|ГДЕ
	|	КоличествоДнейСОстатком.КолДней >= ДнейВПериоде.ДатаКалендаря
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Номенклатура,
	|	ЕдиницыИзмерения.Коэффициент
	|ПОМЕСТИТЬ УпаковкиНоменклатуры
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаТоваров КАК ТаблицаТоваров
	|		ПО ЕдиницыИзмерения.Владелец = ТаблицаТоваров.Номенклатура
	|ГДЕ
	|	ЕдиницыИзмерения.Коэффициент > 1
	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору.Код = ""999""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена
	|ПОМЕСТИТЬ Скидка38
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			ТипЦен = &Скидка38
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаТоваров.Номенклатура
	|					ИЗ
	|						ТаблицаТоваров КАК ТаблицаТоваров)) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПартииТоваровНаСкладахОстатки.Номенклатура,
	|	ПартииТоваровНаСкладахОстатки.СтоимостьОстаток / ВЫБОР
	|		КОГДА ПартииТоваровНаСкладахОстатки.КоличествоОстаток = 0
	|			ТОГДА 1
	|		ИНАЧЕ ПартииТоваровНаСкладахОстатки.КоличествоОстаток
	|	КОНЕЦ КАК Себестоимость
	|ПОМЕСТИТЬ ЗакупочнаяЦена
	|ИЗ
	|	РегистрНакопления.ПартииТоваровНаСкладах.Остатки(
	|			&ДатаКон,
	|			Склад = &Склад
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаТоваров.Номенклатура
	|					ИЗ
	|						ТаблицаТоваров КАК ТаблицаТоваров)) КАК ПартииТоваровНаСкладахОстатки
	|ГДЕ
	//+Пашкин О. 28.05.2025 #UT10-5252 
	//|	НЕ &ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП)
	|	НЕ (&ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП) ИЛИ &ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ВозвратТОХИзГППоставщику))
	//-Пашкин О. 28.05.2025 #UT10-5252 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	|			&ДатаКон,
	|			ТипЦен = &ТипЦенКонтрагента
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаТоваров.Номенклатура
	|					ИЗ
	|						ТаблицаТоваров КАК ТаблицаТоваров)) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	|ГДЕ
	//+Пашкин О. 28.05.2025 #UT10-5252 
	//|	НЕ &ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП)
	|	(&ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП) ИЛИ &ВидПроцесса = ЗНАЧЕНИЕ(Перечисление.ВидыПроцессов.ВозвратТОХИзГППоставщику))
	//-Пашкин О. 28.05.2025 #UT10-5252 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ЗаказаноУПоставщиков
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблицаТоваров.Номенклатура
	|				ИЗ
	|					ТаблицаТоваров КАК ТаблицаТоваров)) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказаноУПоставщиков.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаказаноУПоставщиков.ЗаказПоставщику.Контракт
	|				ТОГДА ЗаказаноУПоставщиков.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОстатокКонтракт,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ЗаказаноУПоставщиков.ЗаказПоставщику.Контракт
	|				ТОГДА ЗаказаноУПоставщиков.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ОстатокНЕКонтракт,
	|	СУММА(ЗаказаноУПоставщиков.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ЗаказаноУПостащиковИтого
	|ИЗ
	|	ЗаказаноУПоставщиков КАК ЗаказаноУПоставщиков
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказаноУПоставщиков.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику,
	|	РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ РазмещеноЗаказов
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблицаТоваров.Номенклатура
	|				ИЗ
	|					ТаблицаТоваров КАК ТаблицаТоваров)) КАК РазмещениеЗаказовПокупателейОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещеноЗаказов.Номенклатура,
	|	СУММА(ВЫБОР
	|			КОГДА РазмещеноЗаказов.ЗаказПоставщику.Контракт
	|				ТОГДА РазмещеноЗаказов.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазмещеноКонтракт,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ РазмещеноЗаказов.ЗаказПоставщику.Контракт
	|				ТОГДА РазмещеноЗаказов.КоличествоОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазмещеноНЕКонтракт,
	|	СУММА(РазмещеноЗаказов.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ РазмещеноЗаказовИтого
	|ИЗ
	|	РазмещеноЗаказов КАК РазмещеноЗаказов
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещеноЗаказов.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.Регистратор ССЫЛКА Документ.ВозвратТоваровОтПокупателя
	|				ИЛИ ПродажиОбороты.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоДокументов,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.КоличествоОборот < 0
	|			ТОГДА ПродажиОбороты.КоличествоОборот * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КоличествоТовара
	|ПОМЕСТИТЬ ТаблВозвраты
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			&ДатаНач,
	|			&ДатаКон,
	|			Авто,
	|			Номенклатура В
	|				(ВЫБРАТЬ
	|					ТаблицаТоваров.Номенклатура
	|				ИЗ
	|					ТаблицаТоваров КАК ТаблицаТоваров)) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.КоличествоОборот < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблВозвраты.Номенклатура,
	|	СУММА(ТаблВозвраты.КоличествоДокументов) КАК КоличествоДокументов,
	|	СУММА(ТаблВозвраты.КоличествоТовара) КАК КоличествоТовара
	|ПОМЕСТИТЬ ТаблВозвратыИтого
	|ИЗ
	|	ТаблВозвраты КАК ТаблВозвраты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблВозвраты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.КодПоБазеМоскоречье КАК Артикул,
	|	ТаблицаТоваров.Номенклатура.ГруппаАВС КАК АВС_Москва,
	|	ТаблицаТоваров.Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаТоваров.Номенклатура.Родитель КАК ГруппаТоваров,
	|	ТаблицаТоваров.Номенклатура.КодПроизводителя КАК КодПроизводителя,
	|	МАКСИМУМ(ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 0)) КАК УпаковкаОтгрузки,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТаблицаТоваров.Номенклатура.Кратность = 0
	|				ТОГДА 1
	|			ИНАЧЕ ТаблицаТоваров.Номенклатура.Кратность
	|		КОНЕЦ) КАК Кратность,
	|	СУММА(0) КАК КоличествоПродано,
	|	СУММА(0) КАК МаксимумПродаж,
	|	СУММА(ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоРезерв,
	|	СУММА(ЕСТЬNULL(СвободныеОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток,
	|	СУММА(0) КАК СреднееКоличествоПродано,
	|	СУММА(0) КАК СреднееКоличествоПроданоВариант2,
	|	СУММА(ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	|	СУММА(ЕСТЬNULL(ЗаказаноУПостащиковИтого.КоличествоОстаток, 0)) КАК КоличествоЗаказаноВсего,
	|	СУММА(ЕСТЬNULL(РазмещеноЗаказовИтого.КоличествоОстаток, 0)) КАК КоличествоРазмещено,
	|	СУММА(0) КАК КоличествоРеализаций,
	|	СУММА(ЕСТЬNULL(ТаблВозвратыИтого.КоличествоДокументов, 0)) КАК КоличествоВозвратов,
	|	СУММА(ЕСТЬNULL(ТаблВозвратыИтого.КоличествоТовара, 0)) КАК КоличествоВозвращенногоТовара,
	|	МАКСИМУМ(МосковскиеОстаткиНоменклатуры.Количество) КАК ОстатокВМоскве,
    //+Пашкин О. 04.06.2025 #UT10-5257 
	|	МАКСИМУМ(ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщика, 0) - ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщикаТОХ, 0)) КАК ОстатокДопПоставщика,
	|	МАКСИМУМ(ЕСТЬNULL(МосковскиеОстаткиНоменклатуры.КоличествоДопПоставщикаТОХ, 0)) КАК ОстатокДопПоставщикаТОХ,
    //-Пашкин О. 04.06.2025 #UT10-5257 
	|	МАКСИМУМ(ЕСТЬNULL(ЗакупочнаяЦена.Себестоимость, 0)) КАК ЗакупочнаяЦена,
	|	МАКСИМУМ(ЕСТЬNULL(Скидка38.Цена, 0)) КАК Скидка38,
	|	СУММА(0) КАК КоличествоКлиентов,
	|	СУММА(ЕСТЬNULL(ЗаказаноУПостащиковИтого.ОстатокНЕКонтракт, 0) - ЕСТЬNULL(РазмещеноЗаказовИтого.РазмещеноНЕКонтракт, 0)) КАК УжеЗаказано,
	|	СУММА(ЕСТЬNULL(ЗаказаноУПостащиковИтого.ОстатокКонтракт, 0) - ЕСТЬNULL(РазмещеноЗаказовИтого.РазмещеноКонтракт, 0)) КАК УжеЗаказаноКонтракт,
	|	СУММА(0) КАК ОставшеесяКоличествоДнейДоПоступления,
	|	СУММА(0) КАК СредняяГлубинаПродаж,
	|	МАКСИМУМ(ЕСТЬNULL(ЕдиницыИзмерения.Негабарит, ЛОЖЬ)) КАК Негабарит,
	|	ТаблицаТоваров.Номенклатура.ГорючиеЖидкости КАК ГорючиеЖидкости,
	|	МАКСИМУМ(ЕСТЬNULL(ЕдиницыИзмерения.КратностьМашинокомплекта, 0)) КАК КратностьМашинокомплекта,
	|	ДнейВПериоде.ДатаКалендаря КАК КоличествоДнейВПродаже,
	|	НЕ МатрицаДляПополнения.МинимальноеКоличество ЕСТЬ NULL КАК ТоварЕстьВМатрицеДляПополнения,    
    //+Пашкин О. 21.05.2025 #UT10-5188 
	|	МАКСИМУМ(ВЫБОР КОГДА (ЕСТЬNULL(ОстаткиКонецТОХ.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиКонецТОХПереданные.КоличествоОстаток, 0)) < 0 ТОГДА 0 ИНАЧЕ ЕСТЬNULL(ОстаткиКонецТОХ.КоличествоОстаток, 0) - ЕСТЬNULL(ОстаткиКонецТОХПереданные.КоличествоОстаток, 0) КОНЕЦ) КАК ОстатокТОХ    
    //-Пашкин О. 21.05.2025 #UT10-5188 
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|		ПО ТаблицаТоваров.Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
	|			И ТаблицаТоваров.Номенклатура.ЕдиницаХраненияОстатков = ЕдиницыИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = УпаковкиНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|				&ДатаКон,
	|				Склад = &Склад
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТаблицаТоваров.Номенклатура
	|						ИЗ
	|							ТаблицаТоваров КАК ТаблицаТоваров)) КАК ТоварыНаСкладахОстатки
	|		ПО ТаблицаТоваров.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	|				&ДатаКон,
	|				Номенклатура В
	|					(ВЫБРАТЬ
	|						ТаблицаТоваров.Номенклатура
	|					ИЗ
	|						ТаблицаТоваров КАК ТаблицаТоваров)) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТаблицаТоваров.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Скидка38 КАК Скидка38
	|		ПО ТаблицаТоваров.Номенклатура = Скидка38.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакупочнаяЦена КАК ЗакупочнаяЦена
	|		ПО ТаблицаТоваров.Номенклатура = ЗакупочнаяЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаказаноУПостащиковИтого КАК ЗаказаноУПостащиковИтого
	|		ПО ТаблицаТоваров.Номенклатура = ЗаказаноУПостащиковИтого.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РазмещеноЗаказовИтого КАК РазмещеноЗаказовИтого
	|		ПО ТаблицаТоваров.Номенклатура = РазмещеноЗаказовИтого.КоличествоОстаток
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПромСвободныеОстатки.Номенклатура КАК Номенклатура,
	|			СУММА(ПромСвободныеОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
	|				СУММА(ТоварыВЯчейкахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|			ИЗ
	|				РегистрНакопления.ТоварыВЯчейках.Остатки(
	|						&ДатаКон,
	|						НЕ Ячейка.НеУчитыватьВОперативномУчете
	|							И Номенклатура В
	|								(ВЫБРАТЬ
	|									ТаблицаТоваров.Номенклатура
	|								ИЗ
	|									ТаблицаТоваров КАК ТаблицаТоваров)) КАК ТоварыВЯчейкахОстатки
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТоварыВЯчейкахОстатки.Номенклатура
	|			
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ
	|				ТоварыГотовыеКСборкеОстатки.Номенклатура,
	|				СУММА(ТоварыГотовыеКСборкеОстатки.КоличествоОстаток * -1)
	|			ИЗ
	|				РегистрНакопления.ТоварыГотовыеКСборке.Остатки(
	|						,
	|						Номенклатура В
	|							(ВЫБРАТЬ
	|								ТаблицаТоваров.Номенклатура
	|							ИЗ
	|								ТаблицаТоваров КАК ТаблицаТоваров)) КАК ТоварыГотовыеКСборкеОстатки
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ТоварыГотовыеКСборкеОстатки.Номенклатура) КАК ПромСвободныеОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ПромСвободныеОстатки.Номенклатура) КАК СвободныеОстатки
	|		ПО ТаблицаТоваров.Номенклатура = СвободныеОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблВозвратыИтого КАК ТаблВозвратыИтого
	|		ПО ТаблицаТоваров.Номенклатура = ТаблВозвратыИтого.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МосковскиеОстаткиНоменклатуры КАК МосковскиеОстаткиНоменклатуры
	|		ПО ТаблицаТоваров.Номенклатура = МосковскиеОстаткиНоменклатуры.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МатрицаДляПополнения КАК МатрицаДляПополнения
	|		ПО ТаблицаТоваров.Номенклатура = МатрицаДляПополнения.Номенклатура    
	//+Шульман А. 16.12.2024 #UT10-4991 	
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиКонецТОХ КАК ОстаткиКонецТОХ
	|		ПО ТаблицаТоваров.Номенклатура = ОстаткиКонецТОХ.Номенклатура,
	//-Шульман А. 16.12.2024 #UT10-4991 	
    //+Пашкин О. 21.05.2025 #UT10-5188 
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиКонецТОХПереданные КАК ОстаткиКонецТОХПереданные
	|		ПО ТаблицаТоваров.Номенклатура = ОстаткиКонецТОХПереданные.Номенклатура,
    //-Пашкин О. 21.05.2025 #UT10-5188 
	|	ДнейВПериоде КАК ДнейВПериоде
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Номенклатура.КодПоБазеМоскоречье,
	|	ТаблицаТоваров.Номенклатура.ГруппаАВС,
	|	ТаблицаТоваров.Номенклатура.НоменклатурнаяГруппа,
	|	ТаблицаТоваров.Номенклатура.Родитель,
	|	ТаблицаТоваров.Номенклатура.КодПроизводителя,
	|	ТаблицаТоваров.Номенклатура.ГорючиеЖидкости,
	|	ДнейВПериоде.ДатаКалендаря,
	|	НЕ МатрицаДляПополнения.МинимальноеКоличество ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.Номенклатура,
	|	ИтоговаяТаблица.Артикул,
	|	ИтоговаяТаблица.АВС_Москва,
	|	ИтоговаяТаблица.НоменклатурнаяГруппа,
	|	ИтоговаяТаблица.ГруппаТоваров,
	|	ИтоговаяТаблица.КодПроизводителя,
	|	ИтоговаяТаблица.УпаковкаОтгрузки,
	|	ИтоговаяТаблица.Кратность,
	|	ИтоговаяТаблица.КоличествоПродано,
	|	ИтоговаяТаблица.МаксимумПродаж,
	|	ИтоговаяТаблица.КоличествоРезерв,
	|	ИтоговаяТаблица.СвободныйОстаток,
	|	ИтоговаяТаблица.СреднееКоличествоПродано,
	|	ИтоговаяТаблица.СреднееКоличествоПроданоВариант2,
	|	ИтоговаяТаблица.КоличествоОстаток,
	|	ИтоговаяТаблица.КоличествоЗаказаноВсего,
	|	ИтоговаяТаблица.КоличествоРазмещено,
	|	ИтоговаяТаблица.КоличествоРеализаций,
	|	ИтоговаяТаблица.КоличествоВозвратов,
	|	ИтоговаяТаблица.КоличествоВозвращенногоТовара,
	|	ИтоговаяТаблица.ОстатокВМоскве,
    //+Пашкин О. 04.06.2025 #UT10-5257 
	|	ИтоговаяТаблица.ОстатокДопПоставщика,
	|	ИтоговаяТаблица.ОстатокДопПоставщикаТОХ,
    //-Пашкин О. 04.06.2025 #UT10-5257 
	|	ИтоговаяТаблица.ЗакупочнаяЦена,
	|	ИтоговаяТаблица.Скидка38,
	|	ИтоговаяТаблица.КоличествоКлиентов,
	|	ИтоговаяТаблица.УжеЗаказано,
	|	ИтоговаяТаблица.УжеЗаказаноКонтракт,
	|	ИтоговаяТаблица.ОставшеесяКоличествоДнейДоПоступления,
	|	ИтоговаяТаблица.СредняяГлубинаПродаж,
	|	ИтоговаяТаблица.Негабарит,
	|	ИтоговаяТаблица.ГорючиеЖидкости,
	|	ИтоговаяТаблица.КратностьМашинокомплекта,
	|	ИтоговаяТаблица.КоличествоДнейВПродаже,
	|	ИтоговаяТаблица.ТоварЕстьВМатрицеДляПополнения,
	//+Шульман А. 16.12.2024 #UT10-4991 	
	|	ИтоговаяТаблица.ОстатокТОХ
	//-Шульман А. 16.12.2024 #UT10-4991 	
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица";
	
	КоличествоПериодов = 1;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("КоличествоРеализацийБолее", КоличествоРеализацийБолее);
	Запрос.УстановитьПараметр("ЗакупочнаяЦена", Константы.ЗакупочнаяЦена.Получить());
	Запрос.УстановитьПараметр("Скидка38", 		Константы.Скидка38.Получить());
	Запрос.УстановитьПараметр("Контрагент", 	Константы.ОсновнойПоставщик.Получить());	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонПериода));
	Запрос.УстановитьПараметр("Склад", Константы.ОсновнойСклад.Получить());  
	//+Гавриленков В. 21.12.2024 #
	Запрос.УстановитьПараметр("ВидПроцесса", ВидПроцесса);
	Запрос.УстановитьПараметр("ТипЦенКонтрагента", ДоговорПоставщикаТОХ.ТипЦен);
	//-Гавриленков В. 21.12.2024 #
	
	//+Шульман А. 16.12.2024 #UT10-4991     
    //+Пашкин О. 21.05.2025 #UT10-5188 
	//Если Не ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП Тогда
	Если Не ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП И НЕ ВидПроцесса = Перечисления.ВидыПроцессов.ВозвратТОХИзГППоставщику Тогда
    //-Пашкин О. 21.05.2025 #UT10-5188 
		
		ПоставщикаТОХ = Справочники.ПоставщикиТОХ.ПустаяСсылка();
		КонтрагентТОХ = Справочники.Контрагенты.ПустаяСсылка();
		ДоговорПоставщикаТОХ  = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();  
		
		Запрос.УстановитьПараметр("КонтрагентТОХ", КонтрагентТОХ); 
		Запрос.УстановитьПараметр("КонтрагентТОХПустой", Истина);
		Запрос.УстановитьПараметр("ДоговорПоставщикаТОХ", ДоговорПоставщикаТОХ);
		Запрос.УстановитьПараметр("ДоговорПоставщикаТОХПустой", Истина);  
		
	Иначе
		
        //+Пашкин О. 21.05.2025 #UT10-5188 
		//Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина Тогда    	
		Если Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина ИЛИ ВидПроцесса = Перечисления.ВидыПроцессов.ВозвратТОХИзГППоставщику Тогда    	
        //-Пашкин О. 21.05.2025 #UT10-5188 
			
			КонтрагентТОХ = ПоставщикТОХ.Контрагент;
			Запрос.УстановитьПараметр("КонтрагентТОХ", КонтрагентТОХ); 
			Запрос.УстановитьПараметр("КонтрагентТОХПустой", КонтрагентТОХ.Пустая());
			Запрос.УстановитьПараметр("ДоговорПоставщикаТОХ", ДоговорПоставщикаТОХ);
			Запрос.УстановитьПараметр("ДоговорПоставщикаТОХПустой", ДоговорПоставщикаТОХ.Пустая());   
			
		Иначе
			
			Запрос.УстановитьПараметр("КонтрагентТОХ", Справочники.Контрагенты.ПустаяСсылка()); 
			Запрос.УстановитьПараметр("КонтрагентТОХПустой", Истина);
			Запрос.УстановитьПараметр("ДоговорПоставщикаТОХ", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
			Запрос.УстановитьПараметр("ДоговорПоставщикаТОХПустой", Истина);   
			
		КонецЕсли;
		
	КонецЕсли;       
	//-Шульман А. 16.12.2024 #UT10-4991    
	
	МассивРезультатов       = Запрос.ВыполнитьПакет();
	ТЗ					    = МассивРезультатов[МассивРезультатов.Количество() - 1].Выгрузить();	
	ТЗ.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(10));
	
	ЗаполнитьТаблицуИзЗапроса(ТЗ);
	РезультатПримененияОтбора = ОбработатьТаблицу();
	Товары.Загрузить(РезультатПримененияОтбора); 	

КонецПроцедуры

Функция ОбработатьТаблицу() 
	
	ПостроительОтчета.ИсточникДанных = новый ОписаниеИсточникаДанных(Товары.Выгрузить());
	
	ПостроительОтчета.Выполнить();
	Рез = ПостроительОтчета.Результат;
	Таб	= Рез.Выгрузить();
	
	Возврат Таб;
	
КонецФункции

Процедура ЗаполнитьКолонкуВЗаказМодуль(ТаблицаТоварыКоличество = Неопределено) Экспорт
	
	Для каждого ТекСтр Из Товары Цикл
		ТекСтр.ВЗаказ = 0;
	КонецЦикла;
	
	//+Шульман А. 16.12.2024 #UT10-4991 
	УчитыватьОстатокТОХ = Ложь;
	
	//+Пашкин О. 21.05.2025 #UT10-5188 
	//Если ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП 
	Если (ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП ИЛИ ВидПроцесса = Перечисления.ВидыПроцессов.ВозвратТОХИзГППоставщику)
	//-Пашкин О. 21.05.2025 #UT10-5188 
	   И Справочники.МТ_ПредопределенныеЗначения.ИспользоватьПроцессПеремещениеНеликвидаТОХвГП.Значение = Истина Тогда
		УчитыватьОстатокТОХ = Истина;
	КонецЕсли;
	//-Шульман А. 16.12.2024 #UT10-4991
	
	Для каждого ТекСтр Из Товары Цикл
		
		Если Отсев и ТекСтр.Номенклатура.НеЗаказыватьАвтоматом Тогда 
			Продолжить;
		КонецЕсли;

		Если ТекСтр.СвободныйОстаток < ТекСтр.Кратность Тогда
			//+Сёмин Р. 20.11.2025 #UT10-5531
			Сообщить("Свободный статок товара '" + ТекСтр.Номенклатура + "'(" + ТекСтр.СвободныйОстаток + ") меньше кратности(" + ТекСтр.Кратность + ").");
			//-Сёмин Р. 20.11.2025 #UT10-5531
			Продолжить;		
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекСтр.ЗакупочнаяЦена) Тогда
			Продолжить;
		КонецЕсли;		
		
		//+Шульман А. 16.12.2024 #UT10-4991 
		Если УчитыватьОстатокТОХ Тогда
			ТекСтр.ВЗаказ = НайтиБлижайщую(МИН(ТекСтр.СвободныйОстаток, ТекСтр.ОстатокТОХ), ТекСтр.Кратность);  
		//-Шульман А. 16.12.2024 #UT10-4991 
		Иначе
			ТекСтр.ВЗаказ = НайтиБлижайщую(ТекСтр.СвободныйОстаток, ТекСтр.Кратность);
		КонецЕсли;
		
		//+Сёмин Р. 19.11.2025 #UT10-5531
		Если ТаблицаТоварыКоличество <> Неопределено Тогда
			
			СтрокаТаблицаТоварыКоличество = ТаблицаТоварыКоличество.Найти(ТекСтр.Номенклатура, "Номенклатура");
			
			Если СтрокаТаблицаТоварыКоличество <> Неопределено Тогда
				
				Если СтрокаТаблицаТоварыКоличество.Количество = 0 Тогда
					Продолжить;
				ИначеЕсли СтрокаТаблицаТоварыКоличество.Количество > ТекСтр.СвободныйОстаток Тогда
					Сообщить("Количество товара '" + ТекСтр.Номенклатура + "' в файле(" + СтрокаТаблицаТоварыКоличество.Количество + ") больше свободного остатка(" + ТекСтр.СвободныйОстаток + "). Он добавлен в количестве " + ТекСтр.ВЗаказ + " шт.");
				ИначеЕсли СтрокаТаблицаТоварыКоличество.Количество < ТекСтр.Кратность Тогда
					
					ТекСтр.ВЗаказ = 0;
					Сообщить("Количество товара '" + ТекСтр.Номенклатура + "' в файле(" + СтрокаТаблицаТоварыКоличество.Количество + ") меньше кратности(" + ТекСтр.Кратность + ").");
					
				Иначе
					ТекСтр.ВЗаказ = НайтиБлижайщую(СтрокаТаблицаТоварыКоличество.Количество, ТекСтр.Кратность);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		//-Сёмин Р. 19.11.2025 #UT10-5531
		
	КонецЦикла;

КонецПроцедуры

Функция ОкруглитьДоКратностиМашиноклмплекта(СВОС, ПЗЗ, МАШ) Экспорт
	
	ВЗаказОкругленный =	ПЗЗ;
	
	Если НЕ МАШ = 0 Тогда
		ВЗаказОкругленный = ?(СВОС=1 И ПЗЗ=0, ПЗЗ + МАШ - СВОС, 
		?((НЕ СВОС = 1) и ПЗЗ = 0, 0 ,
		МАШ * (ЦЕЛ(ПЗЗ + МАШ)/МАШ) + ?( (ПЗЗ + МАШ)%МАШ = 0, 0, МАШ - (ПЗЗ + МАШ)%МАШ)
		)
		);
	КонецЕсли;
	
	Возврат ВЗаказОкругленный

КонецФункции

Функция ПолучитьДоговорКонтрагента(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец,
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 1 Тогда 
		
		ФормаВыбора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора("ФормаВыбора", ,);
		ФормаВыбора.Отбор.Владелец.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.Владелец.Значение = Контрагент;
		ФормаВыбора.Отбор.Владелец.Использование = Истина;
		
		ФормаВыбора.Отбор.ВидДоговора.ВидСравнения = ВидСравнения.Равно;
		ФормаВыбора.Отбор.ВидДоговора.Значение = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
		ФормаВыбора.Отбор.ВидДоговора.Использование = Истина;
		
		Результат = ФормаВыбора.ОткрытьМодально();
		
		Если Результат = Неопределено Тогда
			Результат = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();	
		КонецЕсли; 		

	ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
		
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.Ссылка;
		
	КонецЕсли; 
	
	Возврат Результат;	  
	
КонецФункции

