
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заголовок", Этаформа.Заголовок);
	
	ПустаяСтрока = Новый ФорматированнаяСтрока(" ");
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("000000"), ПолучитьЦвет("000000"), "000000"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("444444"), ПолучитьЦвет("444444"), "444444"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("666666"), ПолучитьЦвет("666666"), "666666"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("999999"), ПолучитьЦвет("999999"), "999999"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("CCCCCC"), ПолучитьЦвет("CCCCCC"), "CCCCCC"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("EEEEEE"), ПолучитьЦвет("EEEEEE"), "EEEEEE"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("F1F1F1"), ПолучитьЦвет("F1F1F1"), "F1F1F1"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("FFFFFF"), ПолучитьЦвет("FFFFFF"), "FFFFFF"));
	СтрокаЦвета1 = Новый ФорматированнаяСтрока(МассивСтрок);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("EB3541"), ПолучитьЦвет("EB3541"), "EB3541"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("EB9635"), ПолучитьЦвет("EB9635"), "EB9635"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("EBDE35"), ПолучитьЦвет("EBDE35"), "EBDE35"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("41EB35"), ПолучитьЦвет("41EB35"), "41EB35"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("35EBDE"), ПолучитьЦвет("35EBDE"), "35EBDE"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("3541EB"), ПолучитьЦвет("3541EB"), "3541EB"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("9635EB"), ПолучитьЦвет("9635EB"), "9635EB"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("DE35EB"), ПолучитьЦвет("DE35EB"), "DE35EB"));
	СтрокаЦвета2 = Новый ФорматированнаяСтрока(МассивСтрок);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("E5717C"), ПолучитьЦвет("E5717C"), "E5717C"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("F9AC75"), ПолучитьЦвет("F9AC75"), "F9AC75"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("FFCE73"), ПолучитьЦвет("FFCE73"), "FFCE73"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("A1CA86"), ПолучитьЦвет("A1CA86"), "A1CA86"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("81B3B7"), ПолучитьЦвет("81B3B7"), "81B3B7"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("79BAE1"), ПолучитьЦвет("79BAE1"), "79BAE1"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("9085C9"), ПолучитьЦвет("9085C9"), "9085C9"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("C884AE"), ПолучитьЦвет("C884AE"), "C884AE"));
	СтрокаЦвета3 = Новый ФорматированнаяСтрока(МассивСтрок);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("D31225"), ПолучитьЦвет("D31225"), "D31225"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("EB8A46"), ПолучитьЦвет("EB8A46"), "EB8A46"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("F5B640"), ПолучитьЦвет("F5B640"), "F5B640"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("7EB15C"), ПолучитьЦвет("7EB15C"), "7EB15C"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("539399"), ПолучитьЦвет("539399"), "539399"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("4B9CCD"), ПолучитьЦвет("4B9CCD"), "4B9CCD"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("6B5BB0"), ПолучитьЦвет("6B5BB0"), "6B5BB0"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("AF5A8D"), ПолучитьЦвет("AF5A8D"), "AF5A8D"));
	СтрокаЦвета4 = Новый ФорматированнаяСтрока(МассивСтрок);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("B10E1E"), ПолучитьЦвет("B10E1E"), "B10E1E"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("CB5B11"), ПолучитьЦвет("CB5B11"), "CB5B11"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("D78F0A"), ПолучитьЦвет("D78F0A"), "D78F0A"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("518B2B"), ПолучитьЦвет("518B2B"), "518B2B"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("246B72"), ПолучитьЦвет("246B72"), "246B72"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("1871AA"), ПолучитьЦвет("1871AA"), "1871AA"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("3B2B8A"), ПолучитьЦвет("3B2B8A"), "3B2B8A"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("892A61"), ПолучитьЦвет("892A61"), "892A61"));
	СтрокаЦвета5 = Новый ФорматированнаяСтрока(МассивСтрок);
	
	МассивСтрок = Новый Массив;
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("680910"), ПолучитьЦвет("680910"), "680910"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("7B310B"), ПолучитьЦвет("7B310B"), "7B310B"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("845008"), ПолучитьЦвет("845008"), "845008"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("2E4D17"), ПолучитьЦвет("2E4D17"), "2E4D17"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("133B3F"), ПолучитьЦвет("133B3F"), "133B3F"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("0E3D63"), ПолучитьЦвет("0E3D63"), "0E3D63"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("1D164C"), ПолучитьЦвет("1D164C"), "1D164C"));
	МассивСтрок.Добавить(ПустаяСтрока);
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока("    ",, ПолучитьЦвет("4B1635"), ПолучитьЦвет("4B1635"), "4B1635"));
	СтрокаЦвета6 = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаЦветаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Закрыть(Строка(НавигационнаяСсылка));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЦвет(Hex)
	
	СоответствиеСистемСчисления = Новый Соответствие;
	СоответствиеСистемСчисления.Вставить("A", 10);
	СоответствиеСистемСчисления.Вставить("B", 11);
	СоответствиеСистемСчисления.Вставить("C", 12);
	СоответствиеСистемСчисления.Вставить("D", 13);
	СоответствиеСистемСчисления.Вставить("E", 14);
	СоответствиеСистемСчисления.Вставить("F", 15);
	
	R = Лев(Hex, 2);
	G = Сред(Hex, 3, 2);
	B = Прав(Hex, 2);
	
	Итог = 0;
	Для Инд = 0 По СтрДлина(R) - 1 Цикл
		Символ = Сред(R, СтрДлина(R) - Инд, 1);
		ДесятичноеЧисло = СоответствиеСистемСчисления.Получить(Символ);
		Если ДесятичноеЧисло = Неопределено Тогда
			ДесятичноеЧисло = Число(Символ);
		КонецЕсли;
		Итог = Итог + ДесятичноеЧисло * Pow(16, Инд);
	КонецЦикла;
	R = Итог;
	
	Итог = 0;
	Для Инд = 0 По СтрДлина(G) - 1 Цикл
		Символ = Сред(G, СтрДлина(G) - Инд, 1);
		ДесятичноеЧисло = СоответствиеСистемСчисления.Получить(Символ);
		Если ДесятичноеЧисло = Неопределено Тогда
			ДесятичноеЧисло = Число(Символ);
		КонецЕсли;
		Итог = Итог + ДесятичноеЧисло * Pow(16, Инд);
	КонецЦикла;
	G = Итог;
	
	Итог = 0;
	Для Инд = 0 По СтрДлина(B) - 1 Цикл
		Символ = Сред(B, СтрДлина(B) - Инд, 1);
		ДесятичноеЧисло = СоответствиеСистемСчисления.Получить(Символ);
		Если ДесятичноеЧисло = Неопределено Тогда
			ДесятичноеЧисло = Число(Символ);
		КонецЕсли;
		Итог = Итог + ДесятичноеЧисло * Pow(16, Инд);
	КонецЦикла;
	B = Итог;
	
	Возврат Новый Цвет(R, G, B);
	
КонецФункции

#КонецОбласти
