		  
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);

	Если СокрЛП(Комментарий) = "" Тогда 
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнен Комментарий в документе", Отказ, Заголовок);
	КонецЕсли;	
	
	Если Экспертиза И ЗначениеЗаполнено(ЗаявкаНаВозврат) Тогда
		
		ЗаявкаНаВозвратОбъект = ЗаявкаНаВозврат.ПолучитьОбъект();
		
		БылиИзмененияЗаявкиНаВозврат = Ложь;
		
		Если Не ЗначениеЗаполнено(ЗаявкаНаВозврат.ДатаИзмененияЭтапаЭкспертизы) Тогда
			
			ЗаявкаНаВозвратОбъект.ДатаИзмененияЭтапаЭкспертизы = ТекущаяДата();
			БылиИзмененияЗаявкиНаВозврат = Истина;
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЗаявкаНаВозврат.ЭтапЭкспертизы) Тогда
			
			ЗаявкаНаВозвратОбъект.ЭтапЭкспертизы = Перечисления.ЭтапыЭкспретизы.Подготовка;
			ЗаявкаНаВозвратОбъект.Статус         = "На экспертизе";
			
			Для Каждого СтрокаТовары Из ЗаявкаНаВозвратОбъект.Товары Цикл
				СтрокаТовары.Статус = "На экспертизе";
			КонецЦикла;
			
			БылиИзмененияЗаявкиНаВозврат = Истина;
			
		КонецЕсли;	
		
		Если Входящая И Погружено Тогда
						
			Если НЕ ЗаявкаНаВозврат.Статус = "Отказ в возврате" И НЕ ЗаявкаНаВозврат.ТребуетсяОтправкаТовараКлиенту Тогда
				
				ЗаявкаНаВозвратОбъект.Статус                         = "Отказ в возврате";
				ЗаявкаНаВозвратОбъект.ТребуетсяОтправкаТовараКлиенту = Истина;
				
				БылиИзмененияЗаявкиНаВозврат = Истина;
				
			КонецЕсли;
			
		КонецЕсли;		
		
		Если ЗаявкаНаВозврат.Реализация.Грузополучатель = Получатель И ЗаявкаНаВозврат.ТребуетсяОтправкаТовараКлиенту Тогда
			
			ЗаявкаНаВозвратОбъект.ТребуетсяОтправкаТовараКлиенту = Ложь;
			БылиИзмененияЗаявкиНаВозврат = Истина;

		КонецЕсли;		
		
		Если БылиИзмененияЗаявкиНаВозврат Тогда
			
			Попытка
				ЗаявкаНаВозвратОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Получатель) И Получатель = Получатель.ГоловнойКонтрагент Тогда		
		
		Отказ = Истина;
		Получатель = Неопределено;
		Сообщить("Выбранный контрагент не является грузополучателем.");
		
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат; 
		
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда 
		
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;       
		
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ИмяМакета = "СлужебнаяЗаписка" Тогда
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьСлужебнаяЗаписка(ЭтотОбъект.Ссылка);
	ИначеЕсли ИмяМакета = "Этикетки" Тогда	
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьЭтикеток(ЭтотОбъект.Ссылка);		
	ИначеЕсли ИмяМакета = "Этикетки60_40" Тогда	
		ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьЭтикеток(ЭтотОбъект.Ссылка,, "Этикетка60_40");
	ИначеЕсли ИмяМакета = "АктПриемаПередачиТоваров" Тогда
		  ТабДокумент = Документы.СлужебнаяЗаписка.ПечатьАктаПриемаПередачи(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект),Ссылка);

КонецПроцедуры // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт

	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("СлужебнаяЗаписка", 	"Служебная записка");
	СтруктураМакетов.Вставить("Этикетки60_40", 		"Этикетки(60*40)");  
	СтруктураМакетов.Вставить("Этикетки", 			"Этикетки(100*60)"); 

	Если ЗначениеЗаполнено(ЗаявкаНаВозврат) Тогда
		СтруктураМакетов.Вставить("АктПриемаПередачиТоваров", "Акт приема передачи товаров");
	КонецЕсли;
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

Процедура ПриКопировании(ОбъектКопирования)
	
	Отправлен 	            = Ложь;  
	НомерИнвойс             = "";
	ЗаявкаНаВозврат         = Документы.ЗаявкаНаВозврат.ПустаяСсылка();
	ЗаданиеНаДоставку       = Документы.ЗаданиеНаДоставку.ПустаяСсылка();
	ИДДокументаВСмежнойБазе = ""; 
	Входящая                = Ложь;
	ТранспортныеЕдиницы.Очистить();
	
	Если ЗначениеЗаполнено(Получатель) И Получатель = Получатель.ГоловнойКонтрагент Тогда
		Получатель 			= Неопределено;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаВозврат") Тогда
		
		Если НЕ ДанныеЗаполнения.Проведен Тогда
			ВызватьИсключение "Документ основание не проведен !"; 			
		КонецЕсли;
		
		СтатусТребуетсяЭкспертиза = Ложь;  
		ПолучательЭкспертизныхТоваров = Константы.ПолучательЭкспертизныхТоваров.Получить();
		
		Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
			
			Если СтрокаТабличнойЧасти.Тип = "Рекламация" И СтрокаТабличнойЧасти.Статус = "Требуется экспертиза" Тогда
				СтатусТребуетсяЭкспертиза = Истина;				
			КонецЕсли;			
			
			Если СтатусТребуетсяЭкспертиза Тогда   
				
				ЗаявкаНаВозврат = ДанныеЗаполнения.Ссылка;
				Экспертиза		= Истина;
				Получатель		= ПолучательЭкспертизныхТоваров;
				Ответственный 	= ПараметрыСеанса.ТекущийПользователь;
				Комментарий     = "Передача на экспертизу поставщику : ";
				
				Для Каждого СтрокаТовары Из ЗаявкаНаВозврат.Товары Цикл
					
					Комментарий = Комментарий + Символы.ПС + СокрЛП(СтрокаТовары.Номенклатура.Артикул) + ", " 
												   		   + "'" + СокрЛП(СтрокаТовары.Номенклатура.Наименование) + "', "
														   + СокрЛП(СтрокаТовары.Номенклатура.Родитель.Наименование) + ", "
														   + СокрЛП(СтрокаТовары.Номенклатура.КодПроизводителя) + ", "
														   + "кол. " + СокрЛП(СтрокаТовары.Количество) + " шт., "
														   + "цена " + СокрЛП(СтрокаТовары.Цена)+ ", "
														   + "сумма " + СокрЛП(СтрокаТовары.Сумма);													   
					
				КонецЦикла;				
				
			Иначе
				ВызватьИсключение "Ввод служебной записки возможен только для документа с типом ""Рекламация"" и статусом ""Требуется экспертиза"" !"; 			
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	

КонецПроцедуры


