
Процедура ПровестиДокументыБезДвижений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыВЯчейкахОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыВЯчейкахОбороты
	|ГДЕ
	|	ТоварыВЯчейкахОбороты.Регистратор ССЫЛКА Документ.РазмещениеПоЯчейкам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкам.Ссылка
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
	|ГДЕ
	|    
	|	РазмещениеПоЯчейкам.Клеверенс = ИСТИНА
	|	И НЕ РазмещениеПоЯчейкам.Ссылка В                                                           
	|				(ВЫБРАТЬ                                                   
	|					ВТ_Регистраторы.Регистратор
	|				ИЗ
	|					ВТ_Регистраторы КАК ВТ_Регистраторы)
	|	И РазмещениеПоЯчейкам.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";                       
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()) );
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 24 * 3600 * 30));
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		РазмПоЯчейкамОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		РазмПоЯчейкамОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла; 
	 
КонецПроцедуры

Функция ЕстьПодчиненныеДокументыРазмещениеПоЯчейкам(ДокОснование) Экспорт
	
	//+Сёмин Р. 11.02.2026 #UT10-5677
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеПоЯчейкам.Ссылка
		|ИЗ
		|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
		|ГДЕ
		|	РазмещениеПоЯчейкам.ДокументОснование = &ДокументОснование
		|	И НЕ РазмещениеПоЯчейкам.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	//-Сёмин Р. 11.02.2026 #UT10-5677
	
КонецФункции
