Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//+Белов А. 21.04.2026 #UT10-5810
	Если СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя Тогда
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособВводаВОборот");		
	Иначе  
		//-Белов А. 21.04.2026 #UT10-5810
		СтруктураОбязательныхПолей = Новый Структура("Организация, ВидПродукции, СпособИзготовления, СпособВводаВОборот");	
	КонецЕсли;    
	
	Заголовок = "Уажите реквизиты шапки документа";
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Заголовок = "Уажите реквизиты табличной части товары документа";
	
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура");
	
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если Товары.Количество() = 0 Тогда
		
		ОбщегоНазначения.СообщитьИнформациюПользователю("Не заполнена табличная часть товары");
		
		Отказ = ИСТИНА;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Обработан Тогда
		
		Если ЗначениеЗаполнено(Основание) Тогда
			
			//+Белов А. 21.04.2026 #UT10-5810
			Если СпособВводаВОборот = Перечисления.СпособВводаВОборот.ВозвратОтПокупателя Тогда
				
				НаборДвижений = Движения.ДвижениеКодовМаркировкиСУЗ;
				НаборДвижений.Записывать = Истина;
				
				мТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
				мТаблицаДвижений.Очистить();
				
				мОсновнойСклад = Константы.ОсновнойСклад.Получить();
				ДокОснование   = Основание;
				
				Для Каждого СтрокаМаркировки Из Товары Цикл
					
					СтрокаДвижений                      = мТаблицаДвижений.Добавить();
					СтрокаДвижений.ШтрихкодНоменклатуры = СтрокаМаркировки.ШтрихКодМаркировки;
					СтрокаДвижений.Количество           = 1;  				
					
				КонецЦикла;	
				
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", мТаблицаДвижений);
				
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
				
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Основание", ДокОснование);
				ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", мОсновнойСклад, "ТаблицаПоТоварам");
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);				
				
			Иначе
			//-Белов А. 21.04.2026 #UT10-5810 
			
				Если ЗначениеЗаполнено(Основание.Основание) Тогда
					
					//+Кабанов А.В. 29.08.2025 # UT10-5361
					НаборДвижений = Движения.ДвижениеКодовМаркировкиСУЗ;
					НаборДвижений.Записывать = Истина;
					
					мТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки(); 
					мТаблицаДвижений.Очистить();
					
					мОсновнойСклад = Константы.ОсновнойСклад.Получить();
					ДокОснование   = Основание.Основание;
					
					Для Каждого СтрокаМаркировки Из Товары Цикл
						
						СтрокаДвижений                      = мТаблицаДвижений.Добавить();
						СтрокаДвижений.ШтрихкодНоменклатуры = СтрокаМаркировки.ШтрихКодМаркировки;
						СтрокаДвижений.Количество           = 1;  				
						
					КонецЦикла;	
					
					СтруктТаблицДокумента = Новый Структура;
					СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", мТаблицаДвижений);
					
					ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
					
					ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Основание", ДокОснование);
					ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", мОсновнойСклад, "ТаблицаПоТоварам");
					ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
					
					//-Кабанов А.В. 29.08.2025 # UT10-5361			
					Если ЗначениеЗаполнено(Основание.Основание.Основание) Тогда
						
						МаркировкаОбъект = Основание.Основание.Основание.ПолучитьОбъект();
						МаркировкаОбъект.Статус = Перечисления.СтатусыМаркировкиТоваров.Завершен;
						МаркировкаОбъект.Записать();
						
					КонецЕсли;
					
				КонецЕсли; 
				
			КонецЕсли;
			
		КонецЕсли; 
		
		//+Кабанов А.В. 29.08.2025 # UT10-5361 					
	Иначе
		
		Если Проведен Тогда 
			
			НаборОстаткиТоваров = РегистрыНакопления.ДвижениеКодовМаркировкиСУЗ.СоздатьНаборЗаписей();
			НаборОстаткиТоваров.Отбор.Регистратор.Установить(Ссылка);
			НаборОстаткиТоваров.Записать(); 
			
		КонецЕсли;
		
		Если Статус = Перечисления.СтатусыОтчетОНанесенииКИЗ.Отправлен Тогда
			
			НаборЗаписей = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
			
			Для Каждого СтрокаТовары Из Товары Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Период = Ссылка.Дата;
				НоваяЗапись.Документ = Ссылка;
				НоваяЗапись.ШтрихКодНоменклатуры = СтрокаТовары.ШтрихКодМаркировки;
				НоваяЗапись.СостояниеКМ = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;    
				НоваяЗапись.Признак = Перечисления.ПризнакКодовМаркировки.СвойКИЗ;  
				
			КонецЦикла;
			
			НаборЗаписей.Записать();     
			
			//Маркировка.СоздатьИсходящееСообщениеОтчетОНанесенииКИЗ(ЭтотОбъект.Ссылка);
			
		КонецЕсли;
		
		//+Кабанов А.В. 29.08.2025 # UT10-5361 		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда Возврат; КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	ЭтотОбъект.Основание = ДанныеЗаполнения.Ссылка;
	ЭтотОбъект.Номер = "";
	ЭтотОбъект.Дата = ТекущаяДата();
	ЭтотОбъект.Статус = "";
	
	Для Каждого СтрокаТовары ИЗ ДанныеЗаполнения.Товары Цикл
		
		НоваяСтрокаТовары = ЭтотОбъект.Товары.Добавить();
		
		Если НЕ СтрокаТовары.ЧужойКИЗ И НЕ СтрокаТовары.ТоварОтсутствует Тогда 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,СтрокаТовары);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
