
Функция ПолучитьТаблицы(ДатаНачала, ДатаОкончания, Водитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	//+Гавриленков В. 08.11.2024 #UT10-4889 Изменение в определении Стороннего склада
	"ВЫБРАТЬ
	|	ЗаданияИРеализации.ЗаданиеНаДоставку КАК ЗаданиеНаДоставку,
	|	ЗаданияИРеализации.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ЗаданияИРеализации.КоличествоМест) КАК КоличествоМест,
	|	ЗаданияИРеализации.Реализация КАК Реализация,
	|	МАКСИМУМ(ЗаданияИРеализации.ОплатаНаличными) КАК ОплатаНаличными,
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Отмена, ЛОЖЬ)) КАК Отмена,
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Деньги, ЛОЖЬ)) КАК Деньги,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек ЕСТЬ NULL
	|					И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|				ТОГДА ОчередьПечатиККМ.ТекСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПринятоДенег,
	|	МАКСИМУМ(ЗаданияИРеализации.НеДоставлен) КАК НеДоставлен,
	|	МАКСИМУМ(ЗаданияИРеализации.Доставляется) КАК Доставляется
	|ПОМЕСТИТЬ ЗаданияНаДоставку
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаданиеНаДоставкуДоставка.Ссылка КАК ЗаданиеНаДоставку,
	|		ЗаданиеНаДоставкуДоставка.Контрагент КАК Контрагент,
	|		МАКСИМУМ(ГМПоРеализации.Количество) КАК КоличествоМест,
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация,
	|		МАКСИМУМ(ЛОЖЬ) КАК ОплатаНаличными,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА НЕ СтатусРеализации.Объект ЕСТЬ NULL
	|					ТОГДА СтатусРеализации.НеДоставлен
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК НеДоставлен,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА НЕ СтатусРеализации.Объект ЕСТЬ NULL
	|					ТОГДА СтатусРеализации.Доставляется
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ) КАК Доставляется
	|	ИЗ
	|		Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВложенныйЗапрос.Объект КАК Объект,
	|					МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.Доставляется, ЛОЖЬ)) КАК Доставляется,
	|					МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.НеДоставлен, ЛОЖЬ)) КАК НеДоставлен
	|				ИЗ
	|					(ВЫБРАТЬ
	|						ЗначенияСвойствОбъектов.Объект КАК Объект,
	|						NULL КАК Доставляется,
	|						ИСТИНА КАК НеДоставлен
	|					ИЗ
	|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|					ГДЕ
	|						(ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварНеДоставлен)
	|								ИЛИ ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ПереносДоставки))
	|						И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)
	|					
	|					ОБЪЕДИНИТЬ ВСЕ
	|					
	|					ВЫБРАТЬ
	|						ЗначенияСвойствОбъектов.Объект,
	|						ИСТИНА,
	|						NULL
	|					ИЗ
	|						РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|					ГДЕ
	|						ЗначенияСвойствОбъектов.Значение = ЗНАЧЕНИЕ(Перечисление.СтатусыДоставки.ТоварДоставляется)
	|						И ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки)) КАК ВложенныйЗапрос
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВложенныйЗапрос.Объект) КАК СтатусРеализации
	|				ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = СтатусРеализации.Объект
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК ДокРеализация,
	|					СУММА(ЗаданиеНаДоставкуДоставка.Количество) КАК Количество
	|				ИЗ
	|					Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|						ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|				ГДЕ
	|					ЗаданиеНаДоставкуДоставка.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|					И ЗаданиеНаДоставкуДоставка.Ссылка.Водитель = &ТекущийВодитель
	|					И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|					И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
	|					И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
	|					И НЕ ЗаданиеНаДоставкуДоставка.Отменено
	|				
	|				СГРУППИРОВАТЬ ПО
	|					РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка) КАК ГМПоРеализации
	|				ПО РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = ГМПоРеализации.ДокРеализация
	|			ПО ЗаданиеНаДоставкуДоставка.ДокументСборки = РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|	ГДЕ
	|		ЗаданиеНаДоставкуДоставка.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И ЗаданиеНаДоставкуДоставка.Ссылка.Водитель = &ТекущийВодитель
	|		И НЕ РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка ЕСТЬ NULL
	|		И ЗаданиеНаДоставкуДоставка.Ссылка.Проведен
	|		И РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка.Проведен
	|		И НЕ ЗаданиеНаДоставкуДоставка.Отменено
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ЗаданиеНаДоставкуДоставка.Ссылка,
	|		ЗаданиеНаДоставкуДоставка.Контрагент,
	|		РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка) КАК ЗаданияИРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданияИРеализации.ЗаданиеНаДоставку = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданияИРеализации.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|			И ЗаданияИРеализации.Реализация = ОчередьПечатиККМ.ТекРеализация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияИРеализации.ЗаданиеНаДоставку,
	|	ЗаданияИРеализации.Контрагент,
	|	ЗаданияИРеализации.Реализация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент,
	|	СУММА(0),
	|	NULL,
	|	МАКСИМУМ(ИСТИНА),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Отмена, ЛОЖЬ)),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Деньги, ЛОЖЬ)),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек ЕСТЬ NULL
	|					И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|				ТОГДА ОчередьПечатиККМ.ТекСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ЛОЖЬ),
	|	МАКСИМУМ(ЛОЖЬ)
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.ДоставкаПоказная КАК ЗаданиеНаДоставкуДоставкаПоказная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Ссылка = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Деньги
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Проведен
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Водитель = &ТекущийВодитель
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент,
	|	СУММА(0),
	|	NULL,
	|	МАКСИМУМ(ИСТИНА),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Отмена, ЛОЖЬ)),
	|	МАКСИМУМ(ЕСТЬNULL(ОчередьПечатиККМ.Деньги, ЛОЖЬ)),
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ОчередьПечатиККМ.ДокументЧек ЕСТЬ NULL
	|					И ОчередьПечатиККМ.ДокументЧек <> ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)
	|				ТОГДА ОчередьПечатиККМ.ТекСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	МАКСИМУМ(ЛОЖЬ),
	|	МАКСИМУМ(ЛОЖЬ)
	|ИЗ
	|	Документ.ЗаданиеНаДоставку.ДоставкаПоказная КАК ЗаданиеНаДоставкуДоставкаПоказная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданиеНаДоставкуДоставкаПоказная.Ссылка = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданиеНаДоставкуДоставкаПоказная.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|ГДЕ
	|	ЗаданиеНаДоставкуДоставкаПоказная.Деньги
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Проведен
	|	И ЗаданиеНаДоставкуДоставкаПоказная.Ссылка.Водитель = &ТекущийВодитель
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаДоставкуДоставкаПоказная.Ссылка,
	|	ЗаданиеНаДоставкуДоставкаПоказная.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.ДоговорКонтрагента.БизнесКарта
	|					ИЛИ РеализацияТоваровУслуг.ДоговорКонтрагента.РозничнаяПродажа
	|					ИЛИ РеализацияТоваровУслуг.ДоговорКонтрагента.ЛицевойСчет
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагента.ОплатаПоДоговоруНаличными, ЛОЖЬ)
	|		КОНЕЦ) КАК ОплатаНаличными,
	|	ЗаданияНаДоставку.Реализация
	|ПОМЕСТИТЬ ОплатыНаличными
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ЗаданияНаДоставку.Реализация = РеализацияТоваровУслуг.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Контрагент,
	|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
	|	РеализацияТоваровУслугТовары.Ссылка.Номер КАК НомерНакладной,
	|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтрокиСч,
	|	РеализацияТоваровУслугТовары.Номенклатура,
	|	РеализацияТоваровУслугТовары.Количество,
	|	РеализацияТоваровУслугТовары.Сумма,
	|	ВЫБОР
	|		КОГДА СторонниеСкладыИдентификаторы.Ссылка ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА СторонниеСкладыIDСклада.Ссылка ЕСТЬ NULL
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоСтороннийСклад,
	|	РеализацияТоваровУслугТовары.Цена
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СторонниеСклады КАК СторонниеСкладыИдентификаторы
	|			ПО РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада = СторонниеСкладыИдентификаторы.Идентификатор
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СторонниеСклады КАК СторонниеСкладыIDСклада
	|			ПО РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада = СторонниеСкладыIDСклада.IDСклада
	|		ПО ЗаданияНаДоставку.Реализация = РеализацияТоваровУслугТовары.Ссылка
	|ГДЕ
	|	НЕ РеализацияТоваровУслугТовары.Ссылка ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.Реализация КАК Реализация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(ОчередьПечатиККМ.ТекРеализация, ЛОЖЬ) <> ЛОЖЬ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ЕстьОплата
	|ПОМЕСТИТЬ Оплаты
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
	|		ПО ЗаданияНаДоставку.ЗаданиеНаДоставку = ОчередьПечатиККМ.ТекЗадание
	|			И ЗаданияНаДоставку.Контрагент = ОчередьПечатиККМ.ТекКонтрагент
	|			И ЗаданияНаДоставку.Реализация = ОчередьПечатиККМ.ТекРеализация
	|ГДЕ
	|	НЕ ОчередьПечатиККМ.Деньги
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка КАК Реализация
	|ПОМЕСТИТЬ Сборки
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|		ПО ЗаданияНаДоставку.Реализация = РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Контрагент <> ЗаданияНаДоставку.Контрагент.ГоловнойКонтрагент
	|			ТОГДА ЗаданияНаДоставку.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ЗаданияНаДоставку.Контрагент
	|	КОНЕЦ КАК КонтрагентВзаиморасчетов
	|ПОМЕСТИТЬ Контрагенты
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Контрагент <> ЗаданияНаДоставку.Контрагент.ГоловнойКонтрагент
	|			ТОГДА ЗаданияНаДоставку.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ЗаданияНаДоставку.Контрагент
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента
	|ПОМЕСТИТЬ Взаиморасчеты
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|			,
	|			Контрагент В
	|				(ВЫБРАТЬ
	|					Кон.КонтрагентВзаиморасчетов
	|				ИЗ
	|					Контрагенты КАК Кон)) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаданияНаДоставку.Контрагент КАК Контрагент,
	|	ЗаданияНаДоставку.Реализация,
	|	ЗаданияНаДоставку.Контрагент.ПриоритетВМаршруте КАК ПриоритетВМаршруте,
	|	СУММА(ЗаданияНаДоставку.КоличествоМест) КАК КоличествоМест,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)) КАК Телефон,
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Реализация.СуммаДокумента КАК Сумма,
	|	ЕСТЬNULL(Оплаты.ЕстьОплата, ЛОЖЬ) КАК ЕстьОплата,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ЗаданияНаДоставку.ОплатаНаличными
	|				ТОГДА ВЫБОР
	|						КОГДА ЗаданияНаДоставку.Реализация.Организация = &ОрганизацияДляПриемаНаличных
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЕСТЬNULL(ОплатыНаличными.ОплатаНаличными, ЛОЖЬ)
	|					КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ) КАК ОплатаНаличными,
	|	МАКСИМУМ(ЗаданияНаДоставку.Отмена) КАК Отмена,
	|	МАКСИМУМ(ЗаданияНаДоставку.Деньги) КАК Деньги,
	|	ЗаданияНаДоставку.Контрагент.ВремяПриемкиТовара КАК ВремяПриемкиТовара,
	|	СУММА(ЗаданияНаДоставку.СуммаПринятоДенег) КАК СуммаПринятоДенег,
	|	СУММА(ВЫБОР
	|			КОГДА ЗаданияНаДоставку.Реализация.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЗаданияНаДоставку.СуммаПринятоДенег
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПринятоДенегОсн,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ЗаданияНаДоставку.Реализация.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|				ТОГДА ЗаданияНаДоставку.СуммаПринятоДенег
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПринятоДенегУпр,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаданияНаДоставку.НеДоставлен, ЛОЖЬ)) КАК НеДоставлен,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999)) КАК АдресДоставки,
	|	ПРЕДСТАВЛЕНИЕ(ЗаданияНаДоставку.ЗаданиеНаДоставку) КАК ЗаданиеНаДоставкуПредставление,
	|	МАКСИМУМ(ЕСТЬNULL(ЗаданияНаДоставку.Доставляется, ЛОЖЬ)) КАК Доставляется,
	|	СУММА(ЕСТЬNULL(Взаиморасчеты.СуммаВзаиморасчетовОстаток, 0)) КАК ДолгПоВзаиморасчетам,
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.БизнесКарта КАК ОплатаБезналичными,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ИспользоватьДоверенности.ИспользоватьДоверенностиКлиентов
	|					И ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|					И НЕ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|					И НЕ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ИспользоватьДоверенности,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|				И НЕ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|			ТОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РаботаетБезПечати
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РаботаетБезПечати,
	|	ЛОЖЬ КАК НетОтветаБиллинга,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
	|			ТОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КодМДМ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КодМДМДоговора,
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.БизнесКарта КАК ЛицевойСчет,
	|	ЗаданияНаДоставку.Реализация.Грузополучатель.ОсновнойМенеджерПокупателя.Наименование КАК ТорговыйПредставитель,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонМенеджера.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонМенеджера.Представление
	|		КОНЕЦ КАК СТРОКА(100)) КАК ТелефонТорговогоПредставителя,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЗаданияНаДоставку.Реализация.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОсновнаяОрганизация
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК АдресДоставки
	|		ПО ЗаданияНаДоставку.Контрагент = АдресДоставки.Объект
	|			И (АдресДоставки.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (АдресДоставки.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонКонтрагента
	|		ПО ЗаданияНаДоставку.Контрагент = ТелефонКонтрагента.Объект
	|			И (ТелефонКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон))
	|			И (ТелефонКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Оплаты КАК Оплаты
	|		ПО ЗаданияНаДоставку.Реализация = Оплаты.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Взаиморасчеты КАК Взаиморасчеты
	|		ПО (ЗаданияНаДоставку.Контрагент = Взаиморасчеты.Контрагент
	|				ИЛИ ЗаданияНаДоставку.Контрагент.ГоловнойКонтрагент = Взаиморасчеты.Контрагент)
	|			И ЗаданияНаДоставку.Реализация.Организация = Взаиморасчеты.Организация
	|			И ЗаданияНаДоставку.Реализация.ДоговорКонтрагента = Взаиморасчеты.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатыНаличными КАК ОплатыНаличными
	|		ПО ЗаданияНаДоставку.Реализация = ОплатыНаличными.Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК ТелефонМенеджера
	|		ПО ЗаданияНаДоставку.Реализация.Грузополучатель.ОсновнойМенеджерПокупателя.ФизЛицо = ТелефонМенеджера.Объект
	|			И (ТелефонМенеджера.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный)),
	|	(ВЫБРАТЬ
	|		Константы.ИспользоватьДоверенностиКлиентов КАК ИспользоватьДоверенностиКлиентов
	|	ИЗ
	|		Константы КАК Константы) КАК ИспользоватьДоверенности,
	|	(ВЫБРАТЬ
	|		Константы.ОсновнаяОрганизация КАК ОсновнаяОрганизация
	|	ИЗ
	|		Константы КАК Константы) КАК КонстантаОрганизация
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияНаДоставку.Контрагент,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонКонтрагента.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонКонтрагента.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	ЗаданияНаДоставку.Контрагент.ПриоритетВМаршруте,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА АдресДоставки.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ПОДСТРОКА(АдресДоставки.Поле4, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле6, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле7, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|							И ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|						ТОГДА АдресДоставки.Представление
	|					ИНАЧЕ АдресДоставки.Поле4 + "" "" + АдресДоставки.Поле6 + "" ул, дом № "" + АдресДоставки.Поле7 + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле8, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" корпус "" + АдресДоставки.Поле8
	|						КОНЕЦ + "" "" + ВЫБОР
	|							КОГДА ПОДСТРОКА(АдресДоставки.Поле9, 1, 100) = """"
	|								ТОГДА """"
	|							ИНАЧЕ "" оф."" + АдресДоставки.Поле9
	|						КОНЕЦ + """"
	|				КОНЕЦ
	|		КОНЕЦ КАК СТРОКА(999)),
	|	ЗаданияНаДоставку.ЗаданиеНаДоставку,
	|	ЗаданияНаДоставку.Реализация.СуммаДокумента,
	|	ЗаданияНаДоставку.Реализация,
	|	ЕСТЬNULL(Оплаты.ЕстьОплата, ЛОЖЬ),
	|	ЗаданияНаДоставку.Контрагент.ВремяПриемкиТовара,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.Организация = КонстантаОрганизация.ОсновнаяОрганизация
	|				И НЕ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|			ТОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РаботаетБезПечати
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
	|			ТОГДА ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КодМДМ
	|		ИНАЧЕ """"
	|	КОНЕЦ,
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.РозничнаяПродажа
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.БизнесКарта,
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.ЛицевойСчет
	|		ИЛИ ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.БизнесКарта,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА ТелефонМенеджера.Объект ЕСТЬ NULL
	|				ТОГДА """"
	|			ИНАЧЕ ТелефонМенеджера.Представление
	|		КОНЕЦ КАК СТРОКА(100)),
	|	ЗаданияНаДоставку.Реализация.Грузополучатель.ОсновнойМенеджерПокупателя.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриоритетВМаршруте,
	|	Контрагент
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.ЗаданиеНаДоставку,
	|	Товары.Контрагент,
	|	Товары.Реализация КАК Реализация,
	|	Товары.НомерНакладной,
	|	Товары.НомерСтрокиСч КАК НомерСтрокиСч,
	|	Товары.Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(Товары.Номенклатура) КАК НоменклатураПредставление,
	|	Товары.Количество,
	|	Товары.Сумма,
	|	Товары.ЭтоСтороннийСклад,
	|	ЕСТЬNULL(Товары.Номенклатура.Родитель.Наименование, """") + "" ("" + Товары.Номенклатура.КодПроизводителя + "")"" КАК Артикул,
	|	Товары.Номенклатура.Кратность КАК Кратность,
	|	Товары.Цена
	|ИЗ
	|	Товары КАК Товары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Реализация,
	|	НомерСтрокиСч
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПРЕДСТАВЛЕНИЕ(ГрузовоеМестоТовары.Ссылка) КАК ГрузовоеМесто,
	|	ПРЕДСТАВЛЕНИЕ(ГрузовоеМестоТовары.Номенклатура) КАК Номенклатура,
	|	ГрузовоеМестоТовары.Количество,
	|	Сборки.Реализация
	|ИЗ
	|	Сборки КАК Сборки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	|		ПО Сборки.ДокументСборки = ГрузовоеМестоТовары.Ссылка.Сборка
	|ГДЕ
	|	ГрузовоеМестоТовары.Ссылка.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДоверенностиГП.Контрагент,
	|	ДоверенностиГП.Реализация,
	|	ВЫБОР
	|		КОГДА ДоверенностиГП.Доверенность ЕСТЬ NULL
	|			ТОГДА ДоверенностиКонтрагентов.Ссылка
	|		ИНАЧЕ ДоверенностиГП.Доверенность
	|	КОНЕЦ КАК Доверенность
	|ПОМЕСТИТЬ ТаблицаДоверенностей
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаданияНаДоставку.Контрагент КАК Контрагент,
	|		ЗаданияНаДоставку.Реализация КАК Реализация,
	|		ДоверенностиКонтрагентов.Ссылка КАК Доверенность
	|	ИЗ
	|		ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоверенностиКонтрагентов КАК ДоверенностиКонтрагентов
	|			ПО ЗаданияНаДоставку.Контрагент = ДоверенностиКонтрагентов.Грузополучатель) КАК ДоверенностиГП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоверенностиКонтрагентов КАК ДоверенностиКонтрагентов
	|		ПО ДоверенностиГП.Контрагент.ГоловнойКонтрагент = ДоверенностиКонтрагентов.Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаДоверенностей.Контрагент,
	|	ТаблицаДоверенностей.Реализация,
	|	ТаблицаДоверенностей.Доверенность,
	|	ТаблицаДоверенностей.Доверенность.Сотрудник КАК Сотрудник,
	|	ТаблицаДоверенностей.Доверенность.Номер КАК Номер,
	|	ТаблицаДоверенностей.Доверенность.ДатаОкончания КАК ДатаОкончанияИсходная,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(15)) КАК ДатаОкончания
	|ИЗ
	|	ТаблицаДоверенностей КАК ТаблицаДоверенностей
	|ГДЕ
	|	НЕ ТаблицаДоверенностей.Доверенность ЕСТЬ NULL
	|	И ТаблицаДоверенностей.Доверенность.ДатаНачала <= &ТекущаяДата
	|	И ТаблицаДоверенностей.Доверенность.ДатаОкончания >= &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КодМДМ КАК КодМДМДоговора
	|ИЗ
	|	ЗаданияНаДоставку КАК ЗаданияНаДоставку
	|ГДЕ
	|	ЗаданияНаДоставку.Реализация.ДоговорКонтрагента.КонтролироватьВзаиморасчетыЧерезСистемуБиллинг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗаявкиНаВозврат.ЗаданиеНаДоставку,
	|	ЗаявкаНаВозвратТовары.Ссылка.Реализация.Грузополучатель КАК Контрагент,
	|	ЗаявкаНаВозвратТовары.Ссылка КАК ЗаявкаНаВозврат,
	|	ЗаявкаНаВозвратТовары.Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ЗаявкаНаВозвратТовары.Номенклатура),
	|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Количество,
	|	СУММА(ЗаявкаНаВозвратТовары.Цена) КАК Цена,
	|	СУММА(ЗаявкаНаВозвратТовары.Сумма) КАК Сумма,
	|	МАКСИМУМ(ЗаявкаНаВозвратТовары.Номенклатура.Родитель.Наименование) КАК Производитель,
	|	МАКСИМУМ(ЗаявкаНаВозвратТовары.Номенклатура.КодПроизводителя) КАК КодПроизводителя
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ЗаданиеНаДоставкуДоставка.Ссылка КАК ЗаданиеНаДоставку,
	|		ЗаданиеНаДоставкуДоставка.ДокументСборки КАК ДокументВозврата
	|	ИЗ
	|		Документ.ЗаданиеНаДоставку.Доставка КАК ЗаданиеНаДоставкуДоставка
	|	ГДЕ
	|		ЗаданиеНаДоставкуДоставка.Ссылка В
	|				(ВЫБРАТЬ
	|					ЗаданияНаДоставку.ЗаданиеНаДоставку
	|				ИЗ
	|					ЗаданияНаДоставку)
	|		И ЗаданиеНаДоставкуДоставка.Возврат) КАК ВТ_ЗаявкиНаВозврат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
	|		ПО ВТ_ЗаявкиНаВозврат.ДокументВозврата = ЗаявкаНаВозвратТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗаявкиНаВозврат.ЗаданиеНаДоставку,
	|	ЗаявкаНаВозвратТовары.Ссылка,
	|	ЗаявкаНаВозвратТовары.Ссылка.Реализация.Грузополучатель,
	|	ЗаявкаНаВозвратТовары.Номенклатура";

	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));	
	Запрос.УстановитьПараметр("ОрганизацияДляПриемаНаличных", Константы.ОсновнаяОрганизацияДляОплатыНаличнымиДляВодителей.Получить());
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("ТекущийВодитель", Водитель);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатЗапроса;
	
КонецФункции

Функция ВернутьСписокЗаданийНаДоставку(Пользователь, ДатаНачала, ДатаОкончания) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ВернутьСписокЗаданийНаДоставку");
	
	СтруктураДанных = Новый Структура;
	
	Водитель = Справочники.Пользователи.НайтиПоРеквизиту("Логин", Пользователь);
	
	Если Не ЗначениеЗаполнено(Водитель) ИЛИ НЕ ЗначениеЗаполнено(Водитель.ФизЛицо) Тогда
		Возврат ДанныеВJSONХранилище(СтруктураДанных);
	КонецЕсли;
	
	Таблицы = ПолучитьТаблицы(ДатаНачала, ДатаОкончания, Водитель.ФизЛицо); 
	
	ТаблЗаданийНаДоставку = Таблицы[7].Выгрузить();
	ТаблДоговоровБиллинг  = Таблицы[12].Выгрузить();
	
	Если НЕ ТаблДоговоровБиллинг.Количество() =  0 Тогда
		
		МассивДоговоров  = ТаблДоговоровБиллинг.ВыгрузитьКолонку("КодМДМДоговора");
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить("document_sum");
		СтруктураРезультатаДанныеКонтрагента = AMQP_РаботаСДокументами.ПолучитьДанныеПоМассивуДоговоров_V2(МассивДоговоров,МассивПараметров); 
		
		Если СтруктураРезультатаДанныеКонтрагента.Результат = 0 Тогда                                                     		
			
			ДанныеМассив = СтруктураРезультатаДанныеКонтрагента.Данные;                                                   			
			ТаблицаДанныхДолговБиллинг = МассивВТаблицу(ДанныеМассив);
			
			Для Каждого СтрокаДанныхБилилнг Из ТаблицаДанныхДолговБиллинг Цикл
				
				ЕстьСтрокиВСпискеЗаданий = ТаблЗаданийНаДоставку.НайтиСтроки(Новый Структура("КодМДМДоговора",СтрокаДанныхБилилнг.agreement_mdm_id));	
				
				Если НЕ ЕстьСтрокиВСпискеЗаданий.Количество() = 0 Тогда
					
					Для Каждого СтрокаИзСпискаЗаданий Из ЕстьСтрокиВСпискеЗаданий Цикл
						СтрокаИзСпискаЗаданий.ДолгПоВзаиморасчетам = -СтрокаДанныхБилилнг.document_sum;
					КонецЦикла;					
					
				КонецЕсли;
				
			КонецЦикла;			
			
		Иначе
			
			Для Каждого СтрокаТаблДоставки Из ТаблЗаданийНаДоставку Цикл
				
				Если ЗначениеЗаполнено(СтрокаТаблДоставки.КодМДМДоговора) Тогда
					
					СтрокаТаблДоставки.НетОтветаБиллинга = Истина;
					СтрокаТаблДоставки.ДолгПоВзаиморасчетам = 0;
					
				КонецЕсли;				
				
			КонецЦикла;			
			
		КонецЕсли;		
		
	КонецЕсли; 
	
	ТаблЗаданийНаДоставку.Колонки.Удалить("КодМДМДоговора");
	СтруктураДанных.Вставить("СписокЗаданий", ТаблицуВМассив(ТаблЗаданийНаДоставку));
	СтруктураДанных.Вставить("СписокТоваров", ТаблицуВМассив(Таблицы[8].Выгрузить()));
	СтруктураДанных.Вставить("СписокГрузовыхМест", ТаблицуВМассив(Таблицы[9].Выгрузить()));

	ТаблДоверенностей = Таблицы[11].Выгрузить();
	
	Для Каждого Строка Из ТаблДоверенностей Цикл
		
		Строка.ДатаОкончания = СокрЛП(Формат(Строка.ДатаОкончанияИсходная,"ДФ=dd.MM.yy"));		
		
	КонецЦикла;	     
	
	СтруктураДанных.Вставить("СписокДоверенностей", ТаблицуВМассив(ТаблДоверенностей));
	СтруктураДанных.Вставить("СписокТоваровНаВозврат", ТаблицуВМассив(Таблицы[13].Выгрузить()));
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураДанных);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	                         "Веб-сервис:Завершение. ВернутьСписокЗаданийНаДоставку " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;

КонецФункции

Функция ТаблицуВМассив(Таблица)
	
	МассивДанных = Новый Массив;
	
	Для каждого ТекСтрока Из Таблица Цикл
		
		СтруктураДанных = Новый Структура;
		
		Для каждого Колонка ИЗ Таблица.Колонки Цикл
			
			Если ЭтоСсылка(ТекСтрока[Колонка.Имя]) Тогда      
				
				Если Колонка.Имя = "Реализация" ИЛИ Колонка.Имя = "ЗаданиеНаДоставку" ИЛИ Колонка.Имя = "Номенклатура"  ИЛИ Колонка.Имя = "Доверенность"
					ИЛИ Колонка.Имя = "ЗаявкаНаВозврат" Тогда
					СтруктураДанных.Вставить(Колонка.Имя, ?(ТекСтрока[Колонка.Имя] = NULL, "", Строка(ТекСтрока[Колонка.Имя].УникальныйИдентификатор())));
				Иначе
					СтруктураДанных.Вставить(Колонка.Имя, Строка(ТекСтрока[Колонка.Имя]));
				КонецЕсли;      
				
			Иначе
				СтруктураДанных.Вставить(Колонка.Имя, ТекСтрока[Колонка.Имя]);
			КонецЕсли;
			
		КонецЦикла;
		
		МассивДанных.Добавить(СтруктураДанных);
		
	КонецЦикла;         
	
	Возврат МассивДанных;
	
КонецФункции

Функция МассивВТаблицу(мсДанные)

	тзДанные = Новый ТаблицаЗначений;
	
	Для Каждого ЭлементМассива Из мсДанные Цикл
		
		Если тзДанные.Колонки.Количество() = 0 Тогда
			
			Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
			КонецЦикла;
			
		КонецЕсли;

		НоваяСтрока = тзДанные.Добавить();
		
		Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
			НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат тзДанные; 

КонецФункции 

Функция АвторизоватьПользователя(Параметры)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. АвторизоватьПользователя");
	
	ПараметрыСтруктура = ХранилищеJSONВСтруктуру(Параметры);
	
	Если ПараметрыСтруктура.Свойство("Пользователь") И ПараметрыСтруктура.Свойство("Пароль") Тогда
		СтруктураВозврата = ПроверитьИмяПользователяИПароль(ПараметрыСтруктура.Пользователь, ПараметрыСтруктура.Пароль);		
	Иначе  
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Результат", Ложь);
		СтруктураВозврата.Вставить("Сообщение", "Переданы не все данные для авторизации");
		СтруктураВозврата.Вставить("ПолноеИмя", "");   	
		
	КонецЕсли;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	                         "Веб-сервис:Завершение. АвторизоватьПользователя " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучениеИсходящегоСообщения(Параметры) Экспорт
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучениеИсходящегоСообщения");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат", Ложь);
	СтруктураВозврата.Вставить("Сообщение", "");
	
	ПараметрыСтруктура = ХранилищеJSONВСтруктуру(Параметры);   
	
	Если ПараметрыСтруктура.Свойство("Действие") Тогда        
		
		Если ПараметрыСтруктура.Действие = "ЗаданиеНаДоставку.Подтверждение" ИЛИ ПараметрыСтруктура.Действие = "ЗаданиеНаДоставку.Отмена" Тогда				
			
			Попытка
				
				Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", ПараметрыСтруктура.Водитель);
				Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.Реализация));
				ЗаданиеНаДоставку = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.ЗаданиеНаДоставку));
				Деньги = ПараметрыСтруктура.Деньги;
				ПКО = ПараметрыСтруктура.ПКО;
				Сумма = ПараметрыСтруктура.Сумма;
				КорректировкаРеализации = ПараметрыСтруктура.КорректировкаРеализации;
				Безнал = ПараметрыСтруктура.Безнал;
				Грузополучатель = Реализация.Грузополучатель;				  
				Отмена = ПараметрыСтруктура.Отмена;       			
				Водитель = Пользователь.ФизЛицо;
				ТаблицаТоваров = Неопределено;
				ПродолжаемОбработку = Истина;   
				
				Если Деньги ИЛИ ПКО Тогда     
					
					ЗапросПКО = Новый Запрос;
					ЗапросПКО.УстановитьПараметр("ТекРеализация",Реализация.Ссылка);
					ЗапросПКО.Текст =
					"ВЫБРАТЬ
					|	ОчередьПечатиККМ.ДатаПостановкиВОчередь,
					|	ОчередьПечатиККМ.ТекРеализация
					|ИЗ
					|	РегистрСведений.ОчередьПечатиККМ КАК ОчередьПечатиККМ
					|ГДЕ
					|	ОчередьПечатиККМ.ТекРеализация = &ТекРеализация
					|	И ОчередьПечатиККМ.Обработано
					|	И НЕ ОчередьПечатиККМ.ДокументЧек = ЗНАЧЕНИЕ(Документ.ПриходныйКассовыйОрдер.ПустаяСсылка)";
					
					РезультатЗапросаПКО = ЗапросПКО.Выполнить();     
					
					Если НЕ РезультатЗапросаПКО.Пустой() Тогда      
						
						ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Ошибка,,, 
						                         "Веб-сервис:Выполнение. ПолучениеИсходящегоСообщения " + "Повторная попытка создания ПКО по документу "+СокрЛП(Реализация)+".");
						СтруктураВозврата.Результат = Истина;
						СтруктураВозврата.Сообщение = "По реализации уже оформлен ПКО"; 
						ПродолжаемОбработку = Ложь;	  
						
					КонецЕсли;	
					
				КонецЕсли;    
				
				Если ПродолжаемОбработку Тогда 
					
					//+Шульман А. 24.09.2025 #UT10-5433
					ДопПараметры = Новый Структура();
					//-Шульман А. 24.09.2025 #UT10-5433
					
					Если ПараметрыСтруктура.Свойство("МассивТоваров") Тогда   
						
						МассивТоваров = ПараметрыСтруктура.МассивТоваров;
						ТаблицаТоваров = Новый ТаблицаЗначений;  
						
						СписокТипов = Новый Массив;
						СписокТипов.Добавить("ДокументСсылка.РеализацияТоваровУслуг");
						ТаблицаТоваров.Колонки.Добавить("Реализация", Новый ОписаниеТипов(СписокТипов));  
						
						СписокТипов = Новый Массив;
						СписокТипов.Добавить("СправочникСсылка.Номенклатура");
						ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов(СписокТипов));
						ТаблицаТоваров.Колонки.Добавить("Количество");
						ТаблицаТоваров.Колонки.Добавить("Сумма");
						ТаблицаТоваров.Колонки.Добавить("ВводимоеКоличество");
						ТаблицаТоваров.Колонки.Добавить("ЭтоСтороннийСклад");
						ТаблицаТоваров.Колонки.Добавить("НомерСтрокиСч"); 
						
						//+Шульман А. 24.09.2025 #UT10-5433
						ТребуетсяМаркировка = Ложь;       
						//-Шульман А. 24.09.2025 #UT10-5433
						
						Для Каждого М Из МассивТоваров Цикл           
							
							НоваяСтрока = ТаблицаТоваров.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, М);
							НоваяСтрока.Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(М.Реализация));
							НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(М.Номенклатура));     
							
							//+Шульман А. 24.09.2025 #UT10-5433
							Если НоваяСтрока.Номенклатура.ТребуетсяМаркировка Тогда
								ТребуетсяМаркировка = Истина;
							КонецЕсли;
							//-Шульман А. 24.09.2025 #UT10-5433
							
						КонецЦикла;     
						
						//+Шульман А. 24.09.2025 #UT10-5433  
						ДопПараметры.Вставить("ТребуетсяМаркировка", ТребуетсяМаркировка);
						
						Если КорректировкаРеализации И ТребуетсяМаркировка Тогда      
							
							Если ПараметрыСтруктура.Свойство("МассивКодов") Тогда
								ДопПараметры.Вставить("МассивКодов", ПараметрыСтруктура.МассивКодов);
							КонецЕсли;
						
						КонецЕсли;
						//-Шульман А. 24.09.2025 #UT10-5433
					
					КонецЕсли;     
					
					МЗ = РегистрыСведений.ОчередьПечатиККМ.СоздатьМенеджерЗаписи();
					МЗ.ДатаПостановкиВОчередь = ТекущаяДата();
					СообщениеОбОшибке = "";  
					
					Если Деньги Тогда
						МЗ.ДокументЧек = ПолныеПрава.СоздатьПриемДенег(Грузополучатель, Сумма,, Пользователь);
					ИначеЕсли КорректировкаРеализации ИЛИ ПКО Тогда
						МЗ.ДокументЧек = ПолныеПрава.СоздатьРКО(Реализация, Сумма, ПКО, КорректировкаРеализации, ТаблицаТоваров, 
						                Грузополучатель, Безнал, Пользователь, СообщениеОбОшибке,
						                //+Шульман А. 24.09.2025 #UT10-5433    
										ДопПараметры);
                                        //-Шульман А. 24.09.2025 #UT10-5433
						                
					ИначеЕсли Отмена Тогда                                                                                          
						//Марков И. 29.10.2025 #UT10-5487 добавлены ДопПараметры
						ПолныеПрава.СоздатьРКО(Реализация, Сумма, ПКО, Истина, ТаблицаТоваров, Грузополучатель, Безнал, Пользователь, СообщениеОбОшибке, ДопПараметры);
					КонецЕсли;                                                                                                      
					
					Если ЗначениеЗаполнено(Реализация) Тогда     
						
						Если Отмена Тогда
							Статус = Перечисления.СтатусыДоставки.ТоварНеДоставлен;
						Иначе
							Статус = Перечисления.СтатусыДоставки.ТоварПередан;
						КонецЕсли; 			
						
						Попытка                                    
							ИзменитьСтатусРеализации(Статус, Реализация);  
						Исключение  
							ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Ошибка,,, 
														"Ошибка при записи статуса документа " + Строка(Реализация) + ". " + ОписаниеОшибки());		
						КонецПопытки
						
					КонецЕсли;
					
					МЗ.ТекДата = ТекущаяДата();
					МЗ.ТекВодитель = Водитель;
					МЗ.ТекЗадание = ЗаданиеНаДоставку;
					МЗ.ТекКонтрагент = Грузополучатель;
					МЗ.ТекРеализация = Реализация;
					МЗ.ТекСумма = Сумма;
					
					Если Деньги ИЛИ ПКО Тогда
						МЗ.Обработано = Истина;	
					КонецЕсли;
					
					МЗ.Отмена = Отмена;
					МЗ.Деньги = Деньги;						
					МЗ.Записать();
					
					СтруктураВозврата.Результат = Истина;  
					
					Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
						СтруктураВозврата.Сообщение = СокрЛП(СообщениеОбОшибке);
					КонецЕсли;
					
					Если Константы.ИспользоватьДоверенностиКлиентов.Получить() Тогда  
						
						Если ПараметрыСтруктура.Свойство("ЕстьАктуальнаяДоверенность") Тогда   
							
							Если НЕ ПараметрыСтруктура.ЕстьАктуальнаяДоверенность Тогда     
								
								НаборЗаписей = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
								НаборЗаписей.Отбор.Объект.Установить(Реализация.Ссылка);
								НаборЗаписей.Отбор.Категория.Установить(Справочники.КатегорииОбъектов.НетАктуальнойДоверенности);
								Запись = НаборЗаписей.Добавить();
								Запись.Объект = Реализация.Ссылка;
								Запись.Категория = Справочники.КатегорииОбъектов.НетАктуальнойДоверенности;  
								
								Попытка        				
									НаборЗаписей.Записать();			
								Исключение
								КонецПопытки;
								
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЕсли;

				КонецЕсли;
				
			Исключение
				
				СтруктураВозврата.Результат = Ложь;
				СтруктураВозврата.Сообщение = ОписаниеОшибки();
				
			КонецПопытки; 
			
		ИначеЕсли ПараметрыСтруктура.Действие = "Реализация.Доставляется" ИЛИ ПараметрыСтруктура.Действие = "Реализация.НеДоставлен" Тогда

			Реализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.Реализация));
			ВводимРазгрузку = Истина;
			
			//+Кабанов А.В. 10.03.2025 # UT10-5127
			//Если ПараметрыСтруктура.Действие = "Реализация.НеДоставлен" Тогда
			Если ПараметрыСтруктура.Действие = "Реализация.НеДоставлен" И НЕ (Реализация.ДоговорКонтрагента.ЛицевойСчет ИЛИ Реализация.ДоговорКонтрагента.РозничнаяПродажа) Тогда
			//-Кабанов А.В. 10.03.2025 # UT10-5127	
				Если ЗначениеЗаполнено(Реализация.НомерЧекаККМ) Тогда
					
					СтруктураВозврата.Результат = Ложь;
					СтруктураВозврата.Сообщение = "По документу есть оплата"; 
					ВводимРазгрузку = Ложь;
					
				КонецЕсли;
				
				Если ВводимРазгрузку Тогда
				
					Попытка
						
						ЗапросОплат = Новый Запрос;
						ЗапросОплат.Текст = 
						"ВЫБРАТЬ
						|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.ДокументРасчетовСКонтрагентом,
						|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор
						|ИЗ
						|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
						|ГДЕ
						|	(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ОплатаОтПокупателяПлатежнойКартой
						|			ИЛИ ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер)";
						
						ЗапросОплат.УстановитьПараметр("Реализация", Реализация.Ссылка);
						
						РезультатЗапросаОплат = ЗапросОплат.Выполнить().Выгрузить(); 
						
						Если НЕ РезультатЗапросаОплат.Количество() = 0 Тогда						
							
							СтруктураВозврата.Результат = Ложь;
							СтруктураВозврата.Сообщение = "По документу есть оплата"; 
							ВводимРазгрузку = Ложь;
							
						КонецЕсли;
						
					Исключение
						
					КонецПопытки;		 
					
				КонецЕсли;
				
			КонецЕсли;		 

			Если ВводимРазгрузку Тогда
				
				Попытка
					
					ЗаданиеНаДоставку = Документы.ЗаданиеНаДоставку.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.ЗаданиеНаДоставку));
					
					Если ПараметрыСтруктура.Действие = "Реализация.Доставляется" Тогда
						Статус = Перечисления.СтатусыДоставки.ТоварДоставляется;
					ИначеЕсли ПараметрыСтруктура.Действие = "Реализация.НеДоставлен" Тогда
						Статус = Перечисления.СтатусыДоставки.ТоварНеДоставлен;
					КонецЕсли;
					
					ИзменитьСтатусРеализации(Статус, Реализация);
					
					Если ПараметрыСтруктура.Действие = "Реализация.НеДоставлен" Тогда
						СоздатьДокументРазгрузкаАвто(ЗаданиеНаДоставку, Реализация, ПараметрыСтруктура.Водитель, ПреобразоватьДату(ПараметрыСтруктура.ДатаПереносаДоставки));	
					КонецЕсли; 
					
					СтруктураВозврата.Результат = Истина;
					
				Исключение
					
					СтруктураВозврата.Результат = Ложь;
					СтруктураВозврата.Сообщение = ОписаниеОшибки();
					
				КонецПопытки;		
				
			КонецЕсли;  
			
		КонецЕсли; 
		
	КонецЕсли;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	"Веб-сервис:Завершение. ПолучениеИсходящегоСообщения " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;
	
КонецФункции

Процедура СоздатьДокументРазгрузкаАвто(ЗаданиеНаДоставку, Реализация, Водитель, ДатаПереносаДоставки)
	
	ПользовательСправочника = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Водитель);	
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	ПользовательСправочника = Выборка.Ссылка; 			
	
	РазгрузкаАвто = Документы.РазгрузкаАвто.СоздатьДокумент();
	
	РазгрузкаАвто.Дата = ТекущаяДата();
	РазгрузкаАвто.Водитель = ПользовательСправочника.ФизЛицо;
	РазгрузкаАвто.ЗаданиеНаДоставку = ЗаданиеНаДоставку;
	РазгрузкаАвто.Контрагент = Реализация.Контрагент;
	РазгрузкаАвто.Грузополучатель = Реализация.Грузополучатель;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка,
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.ДокументСборки
	|ПОМЕСТИТЬ ВТСборки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ДокументыСборкиЗаказов КАК РеализацияТоваровУслугДокументыСборкиЗаказов
	|ГДЕ
	|	РеализацияТоваровУслугДокументыСборкиЗаказов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСборки.Ссылка,
	|	ВТСборки.ДокументСборки,
	|	ГрузовоеМесто.Ссылка КАК ГрузовоеМесто
	|ИЗ
	|	ВТСборки КАК ВТСборки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ГрузовоеМесто КАК ГрузовоеМесто
	|		ПО ВТСборки.ДокументСборки = ГрузовоеМесто.Сборка";
	
	Запрос.УстановитьПараметр("Ссылка", Реализация);				  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаТЧ = РазгрузкаАвто.ГрузовыеМеста.Добавить();
		СтрокаТЧ.ГрузовоеМесто = Выборка.ГрузовоеМесто;
		СтрокаТЧ.РТУ = Реализация;
		СтрокаТЧ.ДатаПереноса = ДатаПереносаДоставки;
		
	КонецЦикла; 
	
	РазгрузкаАвто.Записать();
	РазгрузкаАвто.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

//ДОПОЛНИТЕЛЬНОЕ
Функция ПроверитьИмяПользователяИПароль(Логин, Пароль)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат", Ложь);
	СтруктураВозврата.Вставить("ПолноеИмя", "");
	СтруктураВозврата.Вставить("Сообщение", "");
	
	ПользовательСправочника = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", Логин);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 		
		ПользовательСправочника = Выборка.Ссылка; 		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПользовательСправочника) Тогда
		
		ПользовательПоиска = ПользовательСправочника.Код;
		
		ПользовательИнформационнойБазы = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательПоиска);
		
		Если ПользовательИнформационнойБазы <> Неопределено Тогда
			
			ХэшНастоящегоПароля = ПользовательИнформационнойБазы.СохраняемоеЗначениеПароля;
			
			НачатьТранзакцию();
			
			ПользовательИнформационнойБазы.Пароль = Пароль;
			ПользовательИнформационнойБазы.Записать();
			
			ХешВведенногоПароля = ПользователиИнформационнойБазы.НайтиПоИмени(ПользовательПоиска).СохраняемоеЗначениеПароля;
			
			ОтменитьТранзакцию();
			
			Если ХешВведенногоПароля = ХэшНастоящегоПароля Тогда
				
				ЕстьРольВодитель = ПользовательИнформационнойБазы.Роли.Содержит(Метаданные.Роли.Водитель);
				
				Если ЕстьРольВодитель Тогда
					
					СтруктураВозврата.Сообщение = "Пользователь успешно авторизован";
					СтруктураВозврата.Результат = Истина;
					СтруктураВозврата.ПолноеИмя = СокрЛП(ПользовательПоиска);
					
				Иначе
					СтруктураВозврата.Сообщение = "У пользователя отсутствует доступ к системе АРМ Водитель";
				КонецЕсли;
				
			Иначе
				СтруктураВозврата.Сообщение = "Неправильное имя пользователя или пароль";
			КонецЕсли;
			
		КонецЕсли;	
		
	Иначе
		СтруктураВозврата.Сообщение = "Неправильное имя пользователя или пароль";	
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ПреобразоватьДату(СтроковаяДата) Экспорт
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-",""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
	Возврат Дата(СтроковаяДата);
	
КонецФункции

Функция ЭтоСсылка(Значение)
	
	Если ТипЗнч(Значение) = Тип("Число") ИЛИ ТипЗнч(Значение) = Тип("Строка") ИЛИ ТипЗнч(Значение) = Тип("Дата") ИЛИ ТипЗнч(Значение) = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

Функция ДанныеВJSONХранилище(Данные)
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

Функция ХранилищеJSONВСтруктуру(Данные)
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

Процедура ИзменитьСтатусРеализации(СтатусУстановки , ДокументРеализации)
	
	СтатусДоставки = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	СтатусДоставки.Отбор.Объект.Установить(ДокументРеализации);
	СтатусДоставки.Отбор.Свойство.Установить(ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки);
	
	УстановитьПривилегированныйРежим(Истина);	
	СтатусДоставки.Прочитать(); 
	СтатусДоставки.Очистить();
	УстановитьПривилегированныйРежим(Ложь);	
	
	НовыйСтатусДоставки = СтатусДоставки.Добавить();
	НовыйСтатусДоставки.Объект = ДокументРеализации;
	НовыйСтатусДоставки.Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.СтатусДоставки;
	НовыйСтатусДоставки.Значение = СтатусУстановки;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтатусДоставки.Записать();
	
	Если СтатусУстановки = Перечисления.СтатусыДоставки.ТоварПередан Тогда
		ОтправитьРеализациюНаПечать(ДокументРеализации);		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);		
	
	РаботаСТоварамиНаДоставке.ИзменитьДатуПередачи(ДокументРеализации);
	ЗаписатьДвиженияПоТоварамНаДоставке(ДокументРеализации);	
	
КонецПроцедуры

Процедура ОтправитьРеализациюНаПечать(Реализация)
	
	СтруктураВозврата = Чеки.ПоверитьКорректностьЗаполненияРеализации(Реализация); 
	
	Если Не СтруктураВозврата.Результат Тогда
		Возврат;		
	КонецЕсли; 
	
	Если Реализация.НомерЧекаККМ <> 0 Тогда
		Возврат;
	КонецЕсли;    
	
	СтатусЗаданияНаПечать = Чеки.ПолучитьСтатусЗаданияПечатиПКО(Реализация);
	
	Если ЗначениеЗаполнено(СтатусЗаданияНаПечать) Тогда
		Возврат;
	КонецЕсли;      
	
	Чеки.ОтправитьДокументНаПечать(Реализация); 
	
	//Отправляем все корректировки на печать и отправилась реализация успешно
	СтатусЗаданияНаПечать = Чеки.ПолучитьСтатусЗаданияПечатиПКО(Реализация); 
	
	Если ЗначениеЗаполнено(СтатусЗаданияНаПечать) Тогда
		
		КорректировкиРеализации = ПолучитьКорректировкиПоРеализации(Реализация); 
		
		Для Каждого Корректировка Из КорректировкиРеализации Цикл
			
			Если Корректировка.НомерЧекаККМ <> 0 Тогда
				Продолжить;
			КонецЕсли;    
			
			СтатусЗаданияНаПечать = Чеки.ПолучитьСтатусЗаданияПечатиПКО(Корректировка);
			
			Если ЗначениеЗаполнено(СтатусЗаданияНаПечать) Тогда
				Продолжить;
			КонецЕсли; 
			
			Чеки.ОтправитьДокументНаПечать(Корректировка, Истина);	
			
		КонецЦикла;
		
	КонецЕсли;    		
	
КонецПроцедуры

Функция ПолучитьКорректировкиПоРеализации(Реализация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КорректировкаРеализации.Ссылка
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.ДокументРеализации = &ДокументРеализации";
	
	Запрос.УстановитьПараметр("ДокументРеализации", Реализация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Ссылка");
		
КонецФункции

Процедура ЗаписатьДвиженияПоТоварамНаДоставке(ДокументРеализации)
	
	Флаг_ТоварПередан = РаботаСТоварамиНаДоставке.ТоварПередан(ДокументРеализации);
	
	Если Флаг_ТоварПередан Тогда
		
		ДатаВключенияТоваровНаДоставке = Константы.ДатаВключенияТоваровНаДоставке.Получить();
		
		Если НЕ ((НЕ ЗНачениеЗаполнено(ДатаВключенияТоваровНаДоставке)) ИЛИ (НачалоДня(ДатаВключенияТоваровНаДоставке) > ДокументРеализации.Дата)) Тогда  
			
			ТаблицаТоварыНаДоставке_ДляПроведения = РаботаСТоварамиНаДоставке.ЗаданияРеализацияНоменклатура_ПоРеализации(ДокументРеализации);
			ТаблицаТоварыНаДоставке_ДляПроведения.Колонки.Добавить("Период");
			ТаблицаТоварыНаДоставке_ДляПроведения.ЗаполнитьЗначения(ДокументРеализации.Дата, "Период");
			
			ТоварыНаДоставке = РегистрыНакопления.ТоварыНаДоставке.СоздатьНаборЗаписей();
			ТоварыНаДоставке.Отбор.Регистратор.Установить(ДокументРеализации);
			
			ТоварыНаДоставке.Загрузить(ТаблицаТоварыНаДоставке_ДляПроведения);
			ТоварыНаДоставке.ОбменДанными.Загрузка = Истина;
			
			УстановитьПривилегированныйРежим(Истина);
			ТоварыНаДоставке.Записать(Истина); 
			УстановитьПривилегированныйРежим(Ложь);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВерсиюВебСервиса()
	
	Возврат 1.4;//1.2

КонецФункции

Функция ПолучитьQRКодДляОплаты(Параметры) Экспорт 

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучениеQRКодаДляОплаты"); 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат", Ложь);
	СтруктураВозврата.Вставить("Данные", Неопределено);
	СтруктураВозврата.Вставить("Сообщение", "");
	
	ПараметрыСтруктура = ХранилищеJSONВСтруктуру(Параметры);
	ЭтоЛицевойСчет = ?(ПараметрыСтруктура.Свойство("ЛицевойСчет"),ПараметрыСтруктура.ЛицевойСчет,Ложь); 
	
	Если ПараметрыСтруктура.Свойство("Реализация") Тогда   
		
		ЕстьДокументРеализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.Реализация));
		
		Если НЕ ЕстьДокументРеализация.Пустая() Тогда
			
			Попытка
				
				СтруктураJSON = Новый Структура();
				СтруктураJSON.Вставить("act", "get_qrcodes_im"); 
				СтруктураJSON.Вставить("erp", СокрЛП(Константы.AMQP_ИдентификаторИнформацСистемы.Получить()));
				МассивПозиций = Новый Массив();
				СтруктураПозиции = Новый Структура();	         
								 
				Если ЭтоЛицевойСчет Тогда
					
					СтруктураПозиции.Вставить("mdm_id", СокрЛП(ЕстьДокументРеализация.ДоговорКонтрагента.КодМДМ));
					СтруктураПозиции.Вставить("branch", СокрЛП(ЕстьДокументРеализация.Грузополучатель.Наименование));
					СтруктураПозиции.Вставить("sum"   , Формат(ПараметрыСтруктура.СуммаДокумента,"ЧРД=.; ЧГ=0"));
					
				Иначе
					
					СтруктураПозиции.Вставить("mdm", СокрЛП(ЕстьДокументРеализация.Грузополучатель.КодМДМ)); 
					СтруктураПозиции.Вставить("dmnt_id", СокрЛП(ПараметрыСтруктура.Реализация));
					СчетФактура = УчетНДС.НайтиПодчиненныйДокумент(ЕстьДокументРеализация.Ссылка, "СчетФактураВыданный");
					
					Если ЗначениеЗаполнено(СчетФактура) Тогда
						СтруктураПозиции.Вставить("dmnt_nr", ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура));	
					Иначе					
						СтруктураПозиции.Вставить("dmnt_nr", ОбщегоНазначения.ПолучитьНомерНаПечать(ЕстьДокументРеализация)); 
					КонецЕсли;
					
					СтруктураПозиции.Вставить("dmnt_date", Формат(ЕстьДокументРеализация.Дата,"ДФ='dd.MM.yyyy чч:мм'"));
					СтруктураПозиции.Вставить("dmnt_sum", Формат(ПараметрыСтруктура.СуммаДокумента,"ЧРД=.; ЧГ=0"));					
					
				КонецЕсли;

				МассивПозиций.Добавить(СтруктураПозиции);
				СтруктураJSON.Вставить("data", МассивПозиций);
				
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку();
				ЗаписатьJSON(ЗаписьJSON, СтруктураJSON);
				JsonСтрока = ЗаписьJSON.Закрыть();
				
				Сервер = СокрЛП(Константы.АдресПортала.Получить());
				Ресурс = СокрЛП(Константы.РесурсАПИПортала.Получить());  
				
				Заголовки = Новый Соответствие;
				Заголовки.Вставить("Content-Type", "application/json;charset=utf-8");	 
				
				HTTPЗапрос = Новый HTTPЗапрос(Ресурс, Заголовки);
				HTTPЗапрос.УстановитьТелоИзСтроки(JsonСтрока,КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать); 
				
				Соединение = Новый HTTPСоединение(Сервер,,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
				
				ОтветHTTP = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 
				
				СтрокаОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку(); 
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(СтрокаОтветСервера);
				СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON); 
				
				Если СтруктураОтвета.status Тогда
					
					ПараметрыШтрихкода = ШтрихкодированиеПечатныхФорм.ПараметрыГенерацииШтрихкода();
					ПараметрыШтрихкода.ТипКода = 16;
					ПараметрыШтрихкода.УровеньКоррекцииQR = 0;
					ПараметрыШтрихкода.Ширина = 190;
					ПараметрыШтрихкода.Высота = 190;	
					ПараметрыШтрихкода.ПрозрачныйФон = Истина;
					ПараметрыШтрихкода.ОтображатьТекст = Ложь;			
					ПараметрыШтрихкода.Штрихкод = СокрЛП(СтруктураОтвета.data[0].bnk_qr_lnk);
					КартинкаQRКода = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
					
					СтруктураДанных = Новый Структура;
					СтруктураДанных.Вставить("ИДПлатежа",СокрЛП(СтруктураОтвета.data[0].bnk_pay_id));
					
					ФайлQRКода = ПолучитьИмяВременногоФайла("png");
					КартинкаQRКода.Записать(ФайлQRКода);
					СтруктураДанных.Вставить("КартинкаQRКода",Base64Строка(Новый ДвоичныеДанные(ФайлQRКода)));
					УдалитьФайлы(ФайлQRКода);
					
					СтруктураВозврата.Данные = СтруктураДанных;
					СтруктураВозврата.Результат = Истина;
					
				Иначе
					
					СтруктураВозврата.Результат = Ложь;
					СтруктураВозврата.Сообщение = "Нет ответа банка";	
					
				КонецЕсли;				
				
			Исключение
				
				СтруктураВозврата.Результат = Ложь;
				ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Ошибка,,, "Веб-сервис:Ошибка. ПолучениеQRКодаДляОплаты " + СокрЛП(ОписаниеОшибки()));
				СтруктураВозврата.Сообщение = "Ошибка получение данных в филиальной базе.";	
				
			КонецПопытки;			
			
		КонецЕсли;		
		
	КонецЕсли;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	"Веб-сервис:Завершение. ПолучениеQRКодаДляОплаты " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));	
	
	Возврат РезультатВыполнения; 

КонецФункции

Функция ПолучитьОплатыПоQRКоду(Параметры) Экспорт 

	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьОплатыПоQRКоду");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат", Ложь);
	СтруктураВозврата.Вставить("Оплачено", Ложь);
	СтруктураВозврата.Вставить("Сообщение", "");            
	
	ПараметрыСтруктура = ХранилищеJSONВСтруктуру(Параметры);
	ЭтоЛицевойСчет = ?(ПараметрыСтруктура.Свойство("ЛицевойСчет"),ПараметрыСтруктура.ЛицевойСчет,Ложь); 

	Если ПараметрыСтруктура.Свойство("Реализация") Тогда
		
		ЕстьДокументРеализация = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ПараметрыСтруктура.Реализация));
		
		Если НЕ ЕстьДокументРеализация.Пустая() Тогда
			
			Попытка				
				
				ЗапросОплат = Новый Запрос;
				ЗапросОплат.УстановитьПараметр("СуммаОплаты", ПараметрыСтруктура.СуммаДокумента);
				
				Если ЭтоЛицевойСчет Тогда
					
					ЗапросОплат.УстановитьПараметр("ДатаДокумента", ЕстьДокументРеализация.Дата);
					ЗапросОплат.УстановитьПараметр("ДоговорКонтрагента", ЕстьДокументРеализация.ДоговорКонтрагента);
					ЗапросОплат.Текст =
					"ВЫБРАТЬ
					|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.СуммаВзаиморасчетовРасход = &СуммаОплаты КАК ЕстьОплата
					|ИЗ
					|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(&ДатаДокумента, , Регистратор, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
					|ГДЕ
					|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ОплатаОтПокупателяПлатежнойКартой";	
					
				Иначе					
					
					ЗапросОплат.УстановитьПараметр("Реализация",ЕстьДокументРеализация);
					ЗапросОплат.Текст =
					"ВЫБРАТЬ
					|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.СуммаВзаиморасчетовРасход >= &СуммаОплаты КАК ЕстьОплата
					|ИЗ
					|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Обороты(, , Регистратор, ДокументРасчетовСКонтрагентом = &Реализация) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты
					|ГДЕ
					|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОбороты.Регистратор ССЫЛКА Документ.ОплатаОтПокупателяПлатежнойКартой";
					
				КонецЕсли;
				
				РезультатЗапросаОплат = ЗапросОплат.Выполнить().Выгрузить(); 
				СтруктураВозврата.Результат = Истина;
				
				Если НЕ РезультатЗапросаОплат.Количество() = 0 Тогда
					СтруктураВозврата.Оплачено = РезультатЗапросаОплат[0].ЕстьОплата;
				КонецЕсли;				
				
			Исключение
				
				СтруктураВозврата.Результат = Ложь;
				СтруктураВозврата.Сообщение = ОписаниеОшибки();	
				
			КонецПопытки;			
			
		КонецЕсли;
		
	КонецЕсли;	
	
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	"Веб-сервис:Завершение. ПолучитьОплатыПоQRКоду " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения;  

КонецФункции

Функция ПолучитьОстатокДенегПоКассам(Пользователь)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. ПолучитьОстатокДенегПоКассам");
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Результат"    , Ложь);
	СтруктураВозврата.Вставить("Сообщение"    , "");
	СтруктураВозврата.Вставить("ОстатокИтого" , 0);
	СтруктураВозврата.Вставить("ОстатокОсн"   , 0);
	СтруктураВозврата.Вставить("ОстатокУпр"   , 0);

	
	Водитель = Справочники.Пользователи.НайтиПоРеквизиту("Логин", Пользователь);
	
	Если Не ЗначениеЗаполнено(Водитель) ИЛИ НЕ ЗначениеЗаполнено(Водитель.ФизЛицо) Тогда
		Возврат ДанныеВJSONХранилище(СтруктураВозврата);
	КонецЕсли;
	
	ЗапросОстаткаПоКассам = Новый Запрос;
	ЗапросОстаткаПоКассам.Текст = 
	"ВЫБРАТЬ
	|	Константы.ОсновнаяОрганизация
	|ПОМЕСТИТЬ ВТ_КонстантаОсновнаяОрганизация
	|ИЗ
	|	Константы КАК Константы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛицаСрезПоследних.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_КассыВодителя
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаСрезПоследних.ФизическоеЛицо = &Водитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДенежныеСредстваОстатки.Организация КАК Организация,
	|	СУММА(ДенежныеСредстваОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиПоКассам
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(
	|			,
	|			БанковскийСчетКасса В
	|				(ВЫБРАТЬ
	|					ВТ_КассыВодителя.СтруктурнаяЕдиница
	|				ИЗ
	|					ВТ_КассыВодителя)) КАК ДенежныеСредстваОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ДенежныеСредстваОстатки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОстаткиПоКассам.СуммаОстаток, 0) КАК ОстатокИтого,
	|	0 КАК ОстатокОсн,
	|	0 КАК ОстатокУпр
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_ОстаткиПоКассам КАК ВТ_ОстаткиПоКассам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	ВЫБОР
	|		КОГДА ВТ_ОстаткиПоКассам.Организация = ВТ_КонстантаОсновнаяОрганизация.ОсновнаяОрганизация
	|			ТОГДА ЕСТЬNULL(ВТ_ОстаткиПоКассам.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	0
	|ИЗ
	|	ВТ_ОстаткиПоКассам КАК ВТ_ОстаткиПоКассам,
	|	ВТ_КонстантаОсновнаяОрганизация КАК ВТ_КонстантаОсновнаяОрганизация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_ОстаткиПоКассам.Организация = ВТ_КонстантаОсновнаяОрганизация.ОсновнаяОрганизация
	|			ТОГДА ЕСТЬNULL(ВТ_ОстаткиПоКассам.СуммаОстаток, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	ВТ_ОстаткиПоКассам КАК ВТ_ОстаткиПоКассам,
	|	ВТ_КонстантаОсновнаяОрганизация КАК ВТ_КонстантаОсновнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(СУММА(ВТ_Итог.ОстатокИтого), 0) КАК ОстатокИтого,
	|	ЕСТЬNULL(СУММА(ВТ_Итог.ОстатокОсн), 0) КАК ОстатокОсн,
	|	ЕСТЬNULL(СУММА(ВТ_Итог.ОстатокУпр), 0) КАК ОстатокУпр
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог";
	
	ЗапросОстаткаПоКассам.УстановитьПараметр("Водитель",Водитель.ФизЛицо);
	
	РезультатЗапросаОстаткаПоКассам = ЗапросОстаткаПоКассам.Выполнить();
	
	Если НЕ РезультатЗапросаОстаткаПоКассам.Пустой() Тогда
		
		ВыборкаЗапросаОстаткаПоКассам = РезультатЗапросаОстаткаПоКассам.Выбрать();
		ВыборкаЗапросаОстаткаПоКассам.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,ВыборкаЗапросаОстаткаПоКассам);
		
	КонецЕсли;
	
	СтруктураВозврата.Результат = Истина;
	
	РезультатВыполнения = ДанныеВJSONХранилище(СтруктураВозврата);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис ARMDriver", УровеньЖурналаРегистрации.Информация,,, 
	"Веб-сервис:Завершение. ПолучитьОстатокДенегПоКассам " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат РезультатВыполнения; 
	
КонецФункции



