
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Элемент", ПараметрКоманды); 
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", Новый УникальныйИдентификатор);
	
	ОткрытьФорму("Справочник.Р_ВходящиеСообщения.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры
