Функция IDСоответстуетОбособленнойОтгрузке(IDСклада) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ СобственныеСклады.ВэбСервисУТ11 
	|	И НЕ СобственныеСклады.НеИспользуетОбособленнуюОтгрузку";

	Запрос.УстановитьПараметр("Идентификатор", IDСклада);  
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;				
	КонецЕсли;         
	
	Возврат Ложь;
	
КонецФункции  

Функция IDСоответстуетИсключительномуСкладу(IDСклада) Экспорт
//+Гавриленков В. 23.11.2024 #UT10-4934
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСклады.Ссылка
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ СобственныеСклады.ВэбСервисУТ11";
	
	Запрос.УстановитьПараметр("Идентификатор", IDСклада);  
	
	Выборка = Запрос.Выполнить().Выбрать();   
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;				
	КонецЕсли;         
	
	Возврат Ложь;
	
//-Гавриленков В. 23.11.2024 #UT10-4934
КонецФункции

Функция ПолучитьМассивГрузоместПоЗаказу(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|ПОМЕСТИТЬ ВТ_ГМПоступлений
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Заказ = &Заказ
	|	И ПоступлениеТоваровУслугТовары.ГМ <> """"
	|	И ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.ГМ,
	|	ПоступлениеТоваровУслугТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкамТовары.ГМ
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГМПоступлений КАК ВТ_ГМПоступлений
	|		ПО РазмещениеПоЯчейкамТовары.Ссылка.ДокументОснование = ВТ_ГМПоступлений.Ссылка
	|			И РазмещениеПоЯчейкамТовары.ГМ = ВТ_ГМПоступлений.ГМ
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеПоЯчейкамТовары.ГМ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);  
	
	МассивВозврата = Новый Массив;	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивВозврата.Добавить(Выборка.ГМ);
	КонецЦикла;  
	
	Возврат МассивВозврата;
	
КонецФункции

Функция ПолучитьСобственныйСкладПоИдентификатору(ИдентификаторСклада) Экспорт
	
	//+Макрушин Е. 12.02.2026 #UT10-5665
	РезультатСклад = Справочники.СобственныеСклады.ПустаяСсылка();
	
	Если ИдентификаторСклада = 0 Тогда 
		Возврат РезультатСклад;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобственныеСклады.Ссылка КАК Ссылка,
	|	СобственныеСклады.Идентификатор
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.Идентификатор = &Идентификатор
	|	И НЕ СобственныеСклады.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", ИдентификаторСклада);	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Следующий()  Тогда
		РезультатСклад = Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат РезультатСклад;
	//-Макрушин Е. 12.02.2026 #UT10-5665
	
КонецФункции