// SH_62788240 SH_62565851
Перем ОсновнойСклад;
Перем ЕстьНачалоПериода;

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	ОсновнойСклад = Константы.ОсновнойСклад.Получить();
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОсновнойСклад", ОсновнойСклад);
	
	ПараметрНачалоПериода = Новый ПараметрКомпоновкиДанных("НачалоПериода");  
	ПараметрКонецПериода = Новый ПараметрКомпоновкиДанных("КонецПериода");  
	
	ДанныеДатаНач = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрНачалоПериода);  
	ДанныеДатаКон = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКонецПериода);
	
	ДатаНач = ДанныеДатаНач.Значение;
	ДатаКон = ДанныеДатаКон.Значение;   
	
	ЕстьНачалоПериода = Истина;
	
	Если ДатаНач = Дата(1,1,1) Или Не ДанныеДатаНач.Использование Тогда
		
		ЕстьНачалоПериода = Ложь;
		ДатаНач = Дата(2010, 1, 1);    
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрНачалоПериода, ДатаНач);
		
	КонецЕсли;
	
	Если ДатаКон = Дата(1,1,1) Или Не ДанныеДатаКон.Использование Тогда
		
		ДатаКон = КонецДня(ТекущаяДата()) + 86400*30;    
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(ПараметрКонецПериода, ДатаКон);
		
	КонецЕсли;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериодаВыкупа"), НачалоДня(ДатаКон) - 86400*30);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"), ДатаНач);
	
	АктивныеСтруктуры = Новый Массив;   
	
	// Анализ выбранной пользователем структуры для вывода 
	ВыводитьСерии = Ложь;
	НаправлениеВывода = ПроверкаНаправленияВывода(Настройки, АктивныеСтруктуры, ВыводитьСерии);
	
	Если ВыводитьСерии Тогда
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных2.Элементы[0].Запрос = ТекстЗапросаССериями();
	Иначе                
		// Серии заменены пустыми значениями
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанных2.Элементы[0].Запрос = ТекстЗапросаБезСерий();
	КонецЕсли;
		
	// Выводим основную СКД и возврат
	Если НаправлениеВывода = "Основная СКД" Тогда
	
		КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,,);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровки, Истина);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);  
		
		АдресРезультата = ПоместитьВоВременноеХранилище(ДокументРезультат);    
		АдресДанныеРасшифровкиСКД = ПоместитьВоВременноеХранилище(ДанныеРасшифровки);
		
		Возврат; 
	
	КонецЕсли;
	
	
	////////////////////////////////////////////////////////////////////////
	// Выводим основную СКД через группировку ДетальныеЗаписи в ДЗ      
	// Нужно восстановить настройку на случай, если пользователь изменил
	РасположениеИтогов = Настройки.Структура[4].ПараметрыВывода.Элементы.Найти("РасположениеИтогов");
	РасположениеИтогов.Использование = Истина;
	РасположениеИтогов.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	
	// Включить отключенные группы.
	ИсключенныеГруппыПолей = ПолучитьИсключенныеГруппыПолей(Настройки);
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,, ДанныеРасшифровки, Истина);
	
	тзРезультат = Новый ДеревоЗначений; //ТаблицаЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(тзРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);   
	
	///////////////////////////////////////////////////////////////////
	// Основная функция обработки данных
	тзРезультатНов = ЗаполнениеНачальныхОстатковПоРегистраторам(тзРезультат, ДатаНач, ДатаКон, ВыводитьСерии);
	
	// В таб.док. из внешнего набора
	СКД = ПолучитьМакет("СКДРезультат");   
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);   
	
	// Отлючить отключенные группы.
	ПроверитьИсключенныеГруппыПолей(Настройки, ИсключенныеГруппыПолей); 
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы); 
	
	КомпоновщикНастроекСКД = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекСКД.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроекСКД.ЗагрузитьНастройки(Настройки);   
	
	НастройкиСКД = КомпоновщикНастроекСКД.Настройки;   
	
	НастройкиСКД.Отбор.Элементы.Очистить();   // отборы не нужны, т.к. у нас есть готовая ТЗ для вывода
	
	// Восстановление выбранной в основной СКД группировки       
	Для каждого ЭлементСтруктуры Из НастройкиСКД.Структура Цикл

		ЭлементСтруктуры.Использование = Ложь;    
		
		Если Не АктивныеСтруктуры.Найти(ЭлементСтруктуры.Имя) = Неопределено Тогда
			ЭлементСтруктуры.Использование = Истина;     
		КонецЕсли;
		
	КонецЦикла;
	
	
	ДанныеРасшифровкиСКД = Неопределено;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СКД, НастройкиСКД, ДанныеРасшифровкиСКД,,);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;         
	
	ВнешниеДанные = Новый Структура("тзРезультат", тзРезультатНов);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ВнешниеДанные, ДанныеРасшифровкиСКД, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);  
	
	АдресРезультата = ПоместитьВоВременноеХранилище(ДокументРезультат);    
	АдресДанныеРасшифровкиСКД = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиСКД);
	
КонецПроцедуры        

Функция ЗаполнениеНачальныхОстатковПоРегистраторам(тзРезультат, ДатаНач, ДатаКон, ВыводитьСерии)
	
	ПустойСклад = Справочники.Склады.ПустаяСсылка();
	
	ОписаниеТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Любой));
	
	тзРезультатНовОбщий = Новый ТаблицаЗначений;
	тзРезультатНовОбщий.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	
	Для каждого Колонка Из тзРезультат.Колонки Цикл       
		
		Если Найти(Колонка.Имя, "Скл1") = 1 Тогда             
			тзРезультатНовОбщий.Колонки.Добавить(Колонка.Имя, ОписаниеТипЧисло);
		Иначе
			тзРезультатНовОбщий.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);   
		КонецЕсли;   
		
	КонецЦикла;
	
	тзРезультатНов = тзРезультатНовОбщий.Скопировать();  
	тзРезультатНов.Колонки.Добавить("КодСтроки", ОписаниеТипЧисло);
	
	тзРезультатНов1 = тзРезультатНов.Скопировать(); 
	
	
	МассивРесурсы = Новый Массив;
	МассивРесурсы.Добавить("ТовСкл");
	МассивРесурсы.Добавить("ТОХПост");
	МассивРесурсы.Добавить("ТОХ");
	МассивРесурсы.Добавить("ТОХПер");
	МассивРесурсы.Добавить("ОснСкл");
	МассивРесурсы.Добавить("МТ");
	
	тзПред = Новый ТаблицаЗначений;
	тзПред.Колонки.Добавить("Склад");  
	тзПред.Колонки.Добавить("ПорядокСклада");  
	тзПред.Колонки.Добавить("Раздел");  
	тзПред.Колонки.Добавить("ИндексТЗ");  
	
	Для каждого Ресурс Из МассивРесурсы Цикл
		
		тзПред.Колонки.Добавить(Ресурс + "НачОст", Новый ОписаниеТипов("Число")); 
		тзПред.Колонки.Добавить(Ресурс + "КонОст", Новый ОписаниеТипов("Число"));
		
	КонецЦикла;
	
	// Строка ресурсов для свертки таблиц
	СтрРесурсы = "";    
	СтрРесурсыКонОст = ""; 
	
	Разделитель = "";
	
	Для каждого Ресурс Из МассивРесурсы Цикл
		
		СтрРесурсы = СтрРесурсы + Разделитель + Ресурс + "НачОст";  
		Разделитель = ", ";
		СтрРесурсы = СтрРесурсы + Разделитель + Ресурс + "КонОст";  
		СтрРесурсы = СтрРесурсы + Разделитель + Ресурс + "Приход";  
		СтрРесурсы = СтрРесурсы + Разделитель + Ресурс + "Расход";  

		СтрРесурсыКонОст = СтрРесурсыКонОст + Разделитель + Ресурс + "КонОст";  
		
	КонецЦикла;
	
	РесурсыНачКон = 
	"ТовСклНачПервый, МТНачПервый, ТОХПостНачПервый, ТОХНачПервый, 
	|ТОХПерНачПервый, ОснСклНачПервый, ТовСклМинусТОХНачПервый, ТОХМинусПерНачПервый,
	|ТовСклКонПоследний, МТКонПоследний, ТОХПостКонПоследний, ТОХКонПоследний,   
	|ТОХПерКонПоследний, ОснСклКонПоследний, ТовСклМинусТОХКонПоследний, ТОХМинусПерКонПоследний";

	СтрРесурсы = СтрРесурсы + Разделитель + РесурсыНачКон;
	
	РесурсыВычисляемые = 
	"ТОХМинусПерНачОст, ТОХМинусПерКонОст, ТОХМинусПерПриход, ТОХМинусПерРасход,
	|ТовСклМинусТОХНачОст, ТовСклМинусТОХКонОст, ТовСклМинусТОХПриход, ТовСклМинусТОХРасход,
	|Скл1МТКонОст, Скл1ТовСклМтТОХПостТОХПерКонОст, Скл1ТОХПостТОХКонОст,
	|Скл1МТКонПоследний, Скл1ТовСклМтТОХПостТОХПерКонПоследний, Скл1ТОХПостТОХКонПоследний";
	
	СтрРесурсыВсе = СтрРесурсы + ", " + РесурсыВычисляемые;        
	
	МассивРесурсыВыч = Новый Массив;      
	МассивРесурсыВыч.Добавить("ТОХМинусПер");
	МассивРесурсыВыч.Добавить("ТовСклМинусТОХ");
	
	КодСтроки = 1;
	
	Для каждого тзСтрокаНоменклатура Из тзРезультат.Строки Цикл
		
		Если КоличествоПозиций > 0 И тзРезультат.Строки.Индекс(тзСтрокаНоменклатура) = КоличествоПозиций Тогда
			Прервать;
		КонецЕсли;   
		
		тзРезультатНов = тзРезультатНов1.Скопировать();
		тзРезультатНов.Очистить();
		тзВыкупыПриходМТ = тзРезультатНов.Скопировать();
		
		тзДокументы = тзСтрокаНоменклатура.Строки;  
		ЕстьДвижения = тзДокументы.Количество() > 0;   
		
		МассивСклады = Новый Массив;     
		тзПред.Очистить(); 
		
		// 1. Первоначальное заполнение тзРезультатНов
		Для каждого тзСтрокаДокумент Из тзДокументы Цикл
			
			тзСтрокаДокумент.ОснСклПриход = тзСтрокаДокумент.Строки.Итог("ОснСклПриход");
			тзСтрокаДокумент.ОснСклРасход = тзСтрокаДокумент.Строки.Итог("ОснСклРасход");
			
			Для каждого тзСтрокаЭтогоДокумента Из тзСтрокаДокумент.Строки Цикл      
				
				Если ТипЗнч(тзСтрокаЭтогоДокумента.Регистратор) = Тип("ДокументСсылка.ВыкупСОтветственногоХранения")
				   И тзСтрокаЭтогоДокумента.МТПриход > 0 Тогда
				   
					// Добавление выкупов с приходом по регистру МТ в отдельную таблицу, потому что у них другой период
					ДобСтрока = тзВыкупыПриходМТ.Добавить();
					ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрокаЭтогоДокумента); 
					
				Иначе
				
					// Добавление в тзРезультатНов
					ДобСтрока = тзРезультатНов.Добавить();
					ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрокаЭтогоДокумента);   
					ДобСтрока.КодСтроки = КодСтроки;
					КодСтроки = КодСтроки + 1;
					
				КонецЕсли;
				
				Если МассивСклады.Найти(ДобСтрока.Склад) = Неопределено Тогда
					МассивСклады.Добавить(ДобСтрока.Склад);
				КонецЕсли;    
				
			КонецЦикла;
			
		КонецЦикла;       
		
		тзРезультатНов.Свернуть("Номенклатура, Регистратор, ПериодСекунда, Склад, ПорядокСклада, Раздел, Обработано, КодСтроки", СтрРесурсыВсе);  
		тзРезультатНов.Сортировать("ПериодСекунда, Регистратор, ПорядокСклада");
		
		// Подстановка нач.остатков в первую строку
		тзОстатки = Неопределено;    
		тзСтрокаДокумент = Неопределено;
		
		Если ЕстьНачалоПериода Тогда
		
			Если ЕстьДвижения Тогда
			
				тзСтрокаДокумент = тзРезультатНов[0];     
				тзОстатки = ПолучитьОстаткиНаНачало(тзСтрокаДокумент, тзСтрокаНоменклатура.Номенклатура, МассивСклады);
				
			Иначе
				тзОстатки = ПолучитьОстаткиНаНачало(Неопределено, тзСтрокаНоменклатура.Номенклатура, МассивСклады);
				
			КонецЕсли;
			
			Для каждого тзСтрокаОстаток Из тзОстатки Цикл
				
				Если ЕстьДвижения Тогда
				
					МассивСтрок = тзРезультатНов.НайтиСтроки(Новый Структура("Регистратор, Склад, Раздел", тзСтрокаДокумент.Регистратор, тзСтрокаОстаток.Склад, тзСтрокаОстаток.Раздел));
					
					Если МассивСтрок.Количество() Тогда
						
						// В первой строке заполняется нач.остаток по складу
						тзСтрока = МассивСтрок[0];
						ЗаполнитьЗначенияСвойств(тзСтрока, тзСтрокаОстаток,
						"МТНачОст, ТовСклНачОст, ТОХПостНачОст,
						|ТОХНачОст, ТОХПерНачОст, ОснСклНачОст");
						
						
					Иначе
						
						// Добавляется нулевая строка по складу, разделу и регистратору
						тзСтрока = тзРезультатНов.Вставить(0);
						ЗаполнитьЗначенияСвойств(тзСтрока, тзСтрокаОстаток);    
						ЗаполнитьЗначенияСвойств(тзСтрока, тзСтрокаДокумент, "Регистратор, ПериодСекунда");
						
						тзСтрока.КодСтроки = КодСтроки;  
						КодСтроки = КодСтроки + 1;

						Для каждого Ресурс Из МассивРесурсы Цикл
							
							тзСтрока[Ресурс + "КонОст"] = 0;
							тзСтрока[Ресурс + "Приход"] = 0;
							тзСтрока[Ресурс + "Расход"] = 0;
							тзСтрока[Ресурс + "КонПоследний"] = 0;
							тзСтрока[Ресурс + "НачПервый"] = 0;
							
						КонецЦикла;    
						
					КонецЕсли;   
					
				Иначе
					
					тзСтрока = тзРезультатНов.Добавить();
					ЗаполнитьЗначенияСвойств(тзСтрока, тзСтрокаОстаток);    
					
					тзСтрока.КодСтроки = КодСтроки;  
					КодСтроки = КодСтроки + 1;

					Для каждого Ресурс Из МассивРесурсы Цикл
						
						тзСтрока[Ресурс + "КонОст"] = 0;
						тзСтрока[Ресурс + "Приход"] = 0;
						тзСтрока[Ресурс + "Расход"] = 0;
						тзСтрока[Ресурс + "КонПоследний"] = тзСтрока[Ресурс + "КонОст"];
						тзСтрока[Ресурс + "НачПервый"] = тзСтрока[Ресурс + "НачОст"];
						
					КонецЦикла;    
					
				КонецЕсли;
				
				Для каждого Ресурс Из МассивРесурсы Цикл
					тзСтрока[Ресурс + "КонОст"]  = тзСтрока[Ресурс + "НачОст"] + тзСтрока[Ресурс + "Приход"] - тзСтрока[Ресурс + "Расход"];
				КонецЦикла;    
				
				Если НЕ тзСтрока.Раздел = "ТОХ" Тогда
				
					тзСтрока.ТовСклНачПервый = тзСтрокаОстаток.ТовСклНачОст;   
					тзСтрока.МТНачПервый     = тзСтрокаОстаток.МТНачОст;           
					
				Иначе
					
					тзСтрока.ТОХПостНачПервый = тзСтрокаОстаток.ТОХПостНачОст;
					тзСтрока.ТОХНачПервый     = тзСтрокаОстаток.ТОХНачОст;
					тзСтрока.ТОХПерНачПервый  = тзСтрокаОстаток.ТОХПерНачОст;  
					тзСтрока.ОснСклНачПервый  = тзСтрокаОстаток.ОснСклНачОст;
				
					тзСтрока.ТОХМинусПерНачПервый    = тзСтрока.ТОХНачПервый - тзСтрока.ТОХПерНачПервый;
					тзСтрока.ТовСклМинусТОХНачПервый = тзСтрока.ОснСклНачПервый - тзСтрока.ТОХМинусПерНачПервый;        

				КонецЕсли; 
				
				Если Не тзСтрокаДокумент = Неопределено И Не тзСтрокаДокумент = тзСтрока Тогда
					
					// Строка была добавлена, но в существующей строке нужно вычислить НачПервый
					Если НЕ тзСтрокаДокумент.Раздел = "ТОХ" Тогда
					
						тзСтрокаДокумент.ТовСклНачПервый = тзСтрокаДокумент.ТовСклНачОст;   
						тзСтрокаДокумент.МТНачПервый     = тзСтрокаДокумент.МТНачОст;           
						
					Иначе
						
						тзСтрокаДокумент.ТОХПостНачПервый = тзСтрокаДокумент.ТОХПостНачОст;
						тзСтрокаДокумент.ТОХНачПервый     = тзСтрокаДокумент.ТОХНачОст;
						тзСтрокаДокумент.ТОХПерНачПервый  = тзСтрокаДокумент.ТОХПерНачОст;  
						тзСтрокаДокумент.ОснСклНачПервый  = тзСтрокаОстаток.ОснСклНачОст;
					
						тзСтрокаДокумент.ТОХМинусПерНачПервый    = тзСтрокаДокумент.ТОХНачПервый - тзСтрокаДокумент.ТОХПерНачПервый;
						тзСтрокаДокумент.ТовСклМинусТОХНачПервый = тзСтрокаДокумент.ОснСклНачПервый - тзСтрокаДокумент.ТОХМинусПерНачПервый;        

					КонецЕсли; 
				
				КонецЕсли;
				
			КонецЦикла;    
			
		КонецЕсли;    // ЕстьНачалоПериода

		// Добавление Выкупов с приходом по регистру МТ из таблицы тзВыкупыПриходМТ в строки основной таблицы   
		Для каждого тзСтрокаВыкуп Из тзВыкупыПриходМТ Цикл
			
			МассивСтрок = тзРезультатНов.НайтиСтроки(Новый Структура("Регистратор, Склад, Раздел", тзСтрокаВыкуп.Регистратор, тзСтрокаВыкуп.Склад, тзСтрокаВыкуп.Раздел));   
			
			Если МассивСтрок.Количество() Тогда
				
				// В существующую строку внести Приход
				тзСтрока = МассивСтрок[0];
                тзСтрока.МТПриход = тзСтрокаВыкуп.МТПриход;
				тзСтрока.МТКонОст  = тзСтрока.МТНачОст + тзСтрока.МТПриход - тзСтрока.МТРасход;
				
			Иначе
				
				// Добавить новую строку, и добавить в нее нач.остаток
				ДобСтрока = тзРезультатНов.Добавить();
				ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрокаВыкуп);      
				ДобСтрока.ПериодСекунда = тзСтрокаВыкуп.ПериодСекунда; 
				
				ДобСтрока.КодСтроки = КодСтроки;  
				КодСтроки = КодСтроки + 1;
				
				Если ЕстьНачалоПериода Тогда
					ЗаполнитьОстаткиНаНачалоВыкуп(ДобСтрока, тзСтрокаНоменклатура.Номенклатура, тзСтрокаВыкуп.Склад);
				КонецЕсли;  
				
				ДобСтрока.МТКонОст = ДобСтрока.МТНачОст + ДобСтрока.МТПриход - ДобСтрока.МТРасход;

			КонецЕсли;
		
		КонецЦикла;
		
		// На этом этапе нужна сортировка, чтобы раздел ТОХ был последним
		тзРезультатНов.Сортировать("ПериодСекунда, Регистратор, Раздел");   
		
		тзСкладыРазделы = тзРезультатНов.Скопировать(, "Склад, Раздел, ПорядокСклада"); 
		тзСкладыРазделы.Свернуть("Склад, Раздел, ПорядокСклада");
		тзСкладыРазделы.Сортировать("Раздел, ПорядокСклада");   
		
		// Заполнить тзПред по первым 20 строкам по всем комбинациям - Склад, Раздел
		КолСтрок = МИН(20, тзРезультатНов.Количество() - 1);
		
		Для А = 0 По КолСтрок Цикл
			
			ДобСтрока = тзРезультатНов[А];
			
			Если тзПред.НайтиСтроки(Новый Структура("Склад, Раздел", ДобСтрока.Склад, ДобСтрока.Раздел)).Количество() = 0 Тогда
				
				ДобСтрокаПред = тзПред.Добавить();
				ЗаполнитьЗначенияСвойств(ДобСтрокаПред, ДобСтрока);
				
			КонецЕсли;
				
			А = А + 1;
				
		КонецЦикла;
		
		тзПред.Сортировать("Раздел");
		
		// 2. Обработка тзРезультатНов и добавление к общей таблице
		
		// Добавить к каждому документу строки с теми складами, которые есть у предыдущего регистратора     
		// Таблица пройденных последних строк в разрезе склада   
		тзРезультатНов1.Очистить();
		СкладыРегистратора = Новый Массив;
		ПоследнийИндекс = тзРезультатНов.Количество() - 1;  
		ДопМетрики = Новый Структура("Скл1МТКонОст, Скл1ТовСклМтТОХПостТОХПерКонОст, Скл1ТОХПостТОХКонОст, ИндексСтрокиТЗ", 0,0,0, -1);
		
		// Для всех регистраторов нужно добавить в тзРезультатНов1 недостающие склады и разделы из тзСкладыРазделы  
		А = 0;
		КолСтрок = тзРезультатНов.Количество() - 1;
		
		Пока А <= КолСтрок Цикл
		
			тзСтрока = тзРезультатНов[А];
			А = А + 1;
			
			Для каждого тзСтрокаПред Из тзСкладыРазделы Цикл
				
				Если тзСтрокаПред.Склад = тзСтрока.Склад И тзСтрокаПред.Раздел = тзСтрока.Раздел Тогда
					Продолжить;
				КонецЕсли;     
				
				СтрокиРегистратора = тзРезультатНов.НайтиСтроки(Новый Структура("Регистратор, Склад, Раздел", тзСтрока.Регистратор, тзСтрокаПред.Склад, тзСтрокаПред.Раздел));
				
				Если СтрокиРегистратора.Количество() = 0 
					Или СтрокиРегистратора.Количество() = 1 И Не СтрокиРегистратора[0].ПериодСекунда = тзСтрока.ПериодСекунда Тогда
					
					ДобСтрока = тзРезультатНов.Добавить();
					ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока, "Регистратор, Номенклатура, ПериодСекунда, Обработано", "КодСтроки");
					ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрокаПред, "Склад, Раздел, ПорядокСклада");  
					
					Для каждого Ресурс Из МассивРесурсы Цикл
						
						ДобСтрока[Ресурс + "НачОст"] = 0;
						ДобСтрока[Ресурс + "КонОст"] = 0;  
						ДобСтрока[Ресурс + "Приход"] = 0;
						ДобСтрока[Ресурс + "Расход"] = 0;

					КонецЦикла;  
					
					Для каждого Ресурс Из МассивРесурсыВыч Цикл
						
						ДобСтрока[Ресурс + "Приход"] = 0;
						ДобСтрока[Ресурс + "Расход"] = 0;
						ДобСтрока[Ресурс + "КонПоследний"] = 0;
						ДобСтрока[Ресурс + "НачПервый"] = 0;
						
					КонецЦикла;  
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		тзРезультатНов.Сортировать("ПериодСекунда, Регистратор, Раздел");   
		
		Для каждого тзСтрока Из тзРезультатНов Цикл   
			
			// Получение начальных остатков из предыдущих строк по текущему складу и разделу  
			МассивСтрокиПред = тзПред.НайтиСтроки(Новый Структура("Склад, Раздел", тзСтрока.Склад, тзСтрока.Раздел)); 
			тзСтрокаПредТек = Неопределено;
			
			Если МассивСтрокиПред.Количество() Тогда
			
				тзСтрокаПредТек = МассивСтрокиПред[0];
			
				Для каждого Ресурс Из МассивРесурсы Цикл       
					
					Если тзСтрока[Ресурс + "НачОст"] = 0 Тогда
						тзСтрока[Ресурс + "НачОст"] = тзСтрокаПредТек[Ресурс + "НачОст"];
					КонецЕсли;

				КонецЦикла;  
				
			Иначе
				
				тзСтрокаПредТек = тзПред.Добавить();   
				ЗаполнитьЗначенияСвойств(тзСтрокаПредТек, тзСтрока, "Склад, Раздел, ПорядокСклада");
					
			КонецЕсли;
			
			Для каждого Ресурс Из МассивРесурсы Цикл
				тзСтрока[Ресурс + "КонОст"]  = тзСтрока[Ресурс + "НачОст"] + тзСтрока[Ресурс + "Приход"] - тзСтрока[Ресурс + "Расход"];
			КонецЦикла;
			
			// Занести текущий кон.остаток по складу для следующего документа   
			Для каждого Ресурс Из МассивРесурсы Цикл   
				тзСтрокаПредТек[Ресурс + "НачОст"] = тзСтрока[Ресурс + "КонОст"];   
			КонецЦикла;   
			
			Если тзСтрока.Раздел = "ТОХ" ТОгда
				
				// Для удобства вычисления метрик, нужно взять в раздел ТОХ значения из раздела МТ
				МассивСтрокПред = тзПред.НайтиСтроки(Новый Структура("Склад, Раздел", ОсновнойСклад, "МТ")); 
				
				Если МассивСтрокПред.Количество() Тогда
				
					тзСтрокаПредМТ = МассивСтрокПред[0];
					тзСтрока.Скл1МТКонОст = тзСтрокаПредМТ.МТНачОст;
					
				КонецЕсли;  
				
				МассивСтрокПред = тзПред.НайтиСтроки(Новый Структура("Склад, Раздел", ОсновнойСклад, "Склад")); 
				
				Если МассивСтрокПред.Количество() Тогда
				
					тзСтрокаПредМТ = МассивСтрокПред[0];
					тзСтрока.ОснСклКонОст = тзСтрокаПредМТ.ТовСклНачОст;
					
				КонецЕсли;  
				
				тзСтрока.Скл1ТовСклМтТОХПостТОХПерКонОст = тзСтрока.ОснСклКонОст - тзСтрока.Скл1МТКонОст - тзСтрока.ТОХПостКонОст + тзСтрока.ТОХПерКонОст;     // М2
				тзСтрока.Скл1ТОХПостТОХКонОст = тзСтрока.ТОХПостКонОст - тзСтрока.ТОХКонОст;                                                                   // М3
				
			КонецЕсли;
				
			РасчетВычисляемыхПолей(тзСтрока, Ложь);
			
			тзСтрока.Обработано = Истина;     
			
		КонецЦикла;   // тзРезультатНов     
		
		тзРезультатНов.Свернуть("Номенклатура, Регистратор, ПериодСекунда, Склад, ПорядокСклада", СтрРесурсыВсе);  
		
		тзРезультатНов.Сортировать("ПериодСекунда, Регистратор, ПорядокСклада");        
		
		// Расчет рнсурсов КонПоследний для вывода в СКД в итогах кон.остатка
		ПоследнийИндекс = тзРезультатНов.Количество() - 1;
		
		Если тзРезультатНов.Количество() > 0 Тогда
			
			ПоследнийИндекс = тзРезультатНов.Количество() - 1; 
			
			// Заполнить в последних строках данные по кон.остатку   
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(тзРезультатНов[ПоследнийИндекс]);   
			
			Если ПоследнийИндекс > 0 И тзРезультатНов[ПоследнийИндекс].Регистратор = тзРезультатНов[ПоследнийИндекс - 1].Регистратор Тогда
				МассивСтрок.Добавить(тзРезультатНов[ПоследнийИндекс - 1]);   
			КонецЕсли;
			
			тзСтрокаПустойСклад = Неопределено;
			ДопМетрики = Новый Структура("Скл1ТОХПостТОХКонПоследний, Скл1ТовСклМтТОХПостТОХПерКонПоследний, Скл1МТКонПоследний", 0, 0, 0);
			
			Для каждого тзСтрока Из МассивСтрок Цикл
				
				Если ЗначениеЗаполнено(тзСтрока.Склад) Тогда

					тзСтрока.ТовСклКонПоследний = тзСтрока.ТовСклКонОст;
					тзСтрока.МТКонПоследний = тзСтрока.МТКонОст; 
					
					ДопМетрики.Скл1МТКонПоследний = тзСтрока.МТКонОст;   
					ДопМетрики.Скл1ТовСклМтТОХПостТОХПерКонПоследний = ДопМетрики.Скл1ТовСклМтТОХПостТОХПерКонПоследний + тзСтрока.ТовСклКонПоследний - тзСтрока.МТКонПоследний;    
					
					Если тзСтрокаПустойСклад = Неопределено Тогда
						тзСтрокаПустойСклад = тзСтрока;
					КонецЕсли;
					
				Иначе
					
					тзСтрока.ТОХПостКонПоследний = тзСтрока.ТОХПостКонОст;
					тзСтрока.ТОХКонПоследний = тзСтрока.ТОХКонОст;
					тзСтрока.ТОХПерКонПоследний = тзСтрока.ТОХПерКонОст;  
					тзСтрока.ОснСклКонПоследний = тзСтрока.ОснСклКонОст;
			
					тзСтрока.ТОХМинусПерКонПоследний = тзСтрока.ТОХКонПоследний - тзСтрока.ТОХПерКонПоследний;
					тзСтрока.ТовСклМинусТОХКонПоследний = тзСтрока.ОснСклКонПоследний - тзСтрока.ТОХМинусПерКонПоследний;
					
					ДопМетрики.Скл1ТОХПостТОХКонПоследний = тзСтрока.ТОХПостКонПоследний - тзСтрока.ТОХКонПоследний;
					ДопМетрики.Скл1ТовСклМтТОХПостТОХПерКонПоследний = ДопМетрики.Скл1ТовСклМтТОХПостТОХПерКонПоследний - тзСтрока.ТОХПостКонПоследний + тзСтрока.ТОХПерКонПоследний;    
					
					тзСтрокаПустойСклад = тзСтрока;
					
				КонецЕсли;
				
			КонецЦикла;    
			
			тзСтрокаПустойСклад.Скл1МТКонПоследний = ДопМетрики.Скл1МТКонПоследний;
			тзСтрокаПустойСклад.Скл1ТОХПостТОХКонПоследний = ДопМетрики.Скл1ТОХПостТОХКонПоследний;
			тзСтрокаПустойСклад.Скл1ТовСклМтТОХПостТОХПерКонПоследний = ДопМетрики.Скл1ТовСклМтТОХПостТОХПерКонПоследний;
			
		КонецЕсли;
			
		Для каждого тзСтрока Из тзРезультатНов Цикл
		
			// Добавить строку к общей таблице
			ДобСтрока = тзРезультатНовОбщий.Добавить();
			ЗаполнитьЗначенияСвойств(ДобСтрока, тзСтрока);
			
		КонецЦикла;
		
	КонецЦикла;   // тзНоменклатура
	
	тзРезультатНовОбщий.Колонки.Удалить("Обработано");
	
	Возврат тзРезультатНовОбщий;
	
КонецФункции

Функция ПроверкаНаправленияВывода(Настройки, АктивныеСтруктуры, ВыводитьСерии) 
	
	// В тз                   
	// Оставить только группировки ДетЗаписи, сохранить имена активных группировок
	
	ВыводитьСерии = Ложь;
	
	Для каждого ЭлементСтруктуры Из Настройки.Структура Цикл
		
		Если ЭлементСтруктуры.Использование И Не ПустаяСтрока(ЭлементСтруктуры.Имя) Тогда   
			
			АктивныеСтруктуры.Добавить(ЭлементСтруктуры.Имя);    
			
			Если Найти(ЭлементСтруктуры.Имя, "ССериями") > 0 Тогда
				ВыводитьСерии = Истина;
			КонецЕсли;
			
		КонецЕсли;  
		
		Если ЭлементСтруктуры.Имя = "ДетЗаписи" Тогда       
			ЭлементСтруктуры.Использование = Истина;
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			ЭлементСтруктуры.Использование = Ложь;
		КонецЕсли;
	
	КонецЦикла;    
	
	Если АктивныеСтруктуры.Количество() = 0 Тогда
		АктивныеСтруктуры.Добавить("ТаблицаБезСерий");
	КонецЕсли;
	
	// Если нет вывода регистраторов по таблицам, то просто выводим основную СКД
	ЕстьРегистраторы = Ложь;
	
	Для каждого ЭлементСтруктуры Из Настройки.Структура Цикл
		
		Если Не АктивныеСтруктуры.Найти(ЭлементСтруктуры.Имя) = Неопределено И ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда
			
			ЭлементСтруктуры.Использование = Истина;    // Временно, на время поиска группировки по регистратору
			
			Для каждого Строка1 Из ЭлементСтруктуры.Строки Цикл
				
				Если ПроверитьИспользованиеГруппировки(Строка1.Структура, "Регистратор") Тогда
					
					ЕстьРегистраторы = Истина;  
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;   
			
			Если ЕстьРегистраторы Тогда   
				
				ЭлементСтруктуры.Использование = Ложь;    // устанавливается, чтобы можно было сделать вывод в ТЗ      
				Прервать;
				
			КонецЕсли;
			
		КонецЕсли;   
		
		Если ЭлементСтруктуры.Имя = "ДетЗаписи" И Не ЕстьРегистраторы Тогда   
			// Если вывод без регистраторов, то не нужно выводить в ТЗ
			ЭлементСтруктуры.Использование = Ложь;
		КонецЕсли;
			
	КонецЦикла;    

    Если Не ЕстьРегистраторы Тогда
		Возврат "Основная СКД";
	Иначе	
	    Возврат "ТЗ";
	КонецЕсли;
	

КонецФункции // ()

Функция ПроверитьИспользованиеГруппировки(Структура, ИмяГруппировки)   
	
	ПолеПоиска = Новый ПолеКомпоновкиДанных(ИмяГруппировки);
	
	Для каждого ЭлементСтруктуры1 Из Структура Цикл
		
		Если ЭлементСтруктуры1.Использование Тогда
		
			ЕстьГруппировка = Ложь;
		
			Для каждого Поле Из ЭлементСтруктуры1.ПоляГруппировки.Элементы Цикл      
				
				Если Поле.Поле = ПолеПоиска И Поле.Использование Тогда
					
					ЕстьГруппировка = Истина;  
					Прервать;
					
				КонецЕсли;
			
			КонецЦикла;  
			
			Если ЕстьГруппировка Тогда
				Возврат Истина;  
			Иначе
				ЕстьГруппировка = ПроверитьИспользованиеГруппировки(ЭлементСтруктуры1.Структура, ИмяГруппировки);
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЦикла;      
	
	Возврат Ложь;

КонецФункции // ()

Функция ПолучитьИсключенныеГруппыПолей(Настройки)
	
	ИсключенныеГруппыПолей = Новый Массив;
	
	Для каждого ВыбПоле Из Настройки.Выбор.Элементы Цикл
		
		Если ТипЗнч(ВыбПоле) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") И Не ВыбПоле.Использование Тогда
			
			ВыбПоле.Использование = Истина;   
			ИсключенныеГруппыПолей.Добавить(ВыбПоле);
			
		КонецЕсли;
	
	КонецЦикла;

	Возврат ИсключенныеГруппыПолей;

КонецФункции     

Процедура ПроверитьИсключенныеГруппыПолей(Настройки, ИсключенныеГруппыПолей)
	
	Если Не ЗначениеЗаполнено(ИсключенныеГруппыПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ВыбПоле Из Настройки.Выбор.Элементы Цикл
		
		Если Не ИсключенныеГруппыПолей.Найти(ВыбПоле) = Неопределено Тогда
			ВыбПоле.Использование = Ложь;   
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры


Функция ТекстЗапросаССериями()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ КАК ПериодСекунда,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоРасход,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_ОсновнойСкладТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(, , Авто, ДвиженияИГраницыПериода, Склад = &ОсновнойСклад) КАК ТоварыНаСкладахОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийМТОстаткиИОбороты.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ КАК ПериодСекунда,
	|	ВЫБОР
	|		КОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыОрганизацийМТОстаткиИОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	|	0 КАК ТоварыНаСкладахКоличествоНачальныйОстаток,
	|	0 КАК ТоварыНаСкладахКоличествоПриход,
	|	0 КАК ТоварыНаСкладахКоличествоРасход,
	|	0 КАК ТоварыНаСкладахКоличествоКонечныйОстаток,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоНачальныйОстаток,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоПриход,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоРасход,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоКонечныйОстаток,
	|	0 КАК ТоварыОХКоличествоНачальныйОстаток,
	|	0 КАК ТоварыОХКоличествоПриход,
	|	0 КАК ТоварыОХКоличествоРасход,
	|	0 КАК ТоварыОХКоличествоКонечныйОстаток,
	|	0 КАК ТОХПереданныеКоличествоНачальныйОстаток,
	|	0 КАК ТОХПереданныеКоличествоПриход,
	|	0 КАК ТОХПереданныеКоличествоРасход,
	|	0 КАК ТОХПереданныеКоличествоКонечныйОстаток,
	|	0 КАК ОсновнойСкладКоличествоНачальныйОстаток,
	|	0 КАК ОсновнойСкладКоличествоПриход,
	|	0 КАК ОсновнойСкладКоличествоРасход,
	|	0 КАК ОсновнойСкладКоличествоКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийМТ.ОстаткиИОбороты(&НачалоПериодаВыкупа, , Авто, ДвиженияИГраницыПериода, ) КАК ТоварыОрганизацийМТОстаткиИОбороты
	|ГДЕ
	|	ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.КонецПериода МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ТоварыНаСкладахОстаткиИОбороты.СерияНоменклатуры,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоРасход,
	|	ТоварыНаСкладахОстаткиИОбороты.КоличествоКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.ОстаткиИОбороты(, , Авто, ДвиженияИГраницыПериода, ) КАК ТоварыНаСкладахОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоПриход,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоРасход,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.ОстаткиИОбороты(, , Авто, ДвиженияИГраницыПериода, ) КАК ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.СерияНоменклатуры,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоПриход,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.ОстаткиИОбороты(, , Авто, ДвиженияИГраницыПериода, ) КАК ТоварыОтветственногоХраненияОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТОХПереданныеОстаткиИОбороты.Номенклатура,
	|	ТОХПереданныеОстаткиИОбороты.СерияНоменклатуры,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТОХПереданныеОстаткиИОбороты.КоличествоНачальныйОстаток,
	|	ТОХПереданныеОстаткиИОбороты.КоличествоПриход,
	|	ТОХПереданныеОстаткиИОбороты.КоличествоРасход,
	|	ТОХПереданныеОстаткиИОбороты.КоличествоКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.ОстаткиИОбороты(, , Авто, ДвиженияИГраницыПериода, ) КАК ТОХПереданныеОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВТ_ОсновнойСкладТоварыНаСкладах.ПериодСекунда,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.Регистратор,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.Номенклатура,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.СерияНоменклатуры,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоНачальныйОстаток,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоПриход,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоРасход,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоКонечныйОстаток
	|ИЗ
	|	ВТ_ОсновнойСкладТоварыНаСкладах КАК ВТ_ОсновнойСкладТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Общая.Склад,
	|	ВТ_Общая.ПериодСекунда,
	|	ВТ_Общая.Регистратор,
	|	ВТ_Общая.Номенклатура,
	|	ВТ_Общая.СерияНоменклатуры,
	|	СУММА(ВТ_Общая.КоличествоНачальныйОстаток) КАК КоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ВТ_Общая.КоличествоРасход) КАК КоличествоРасход,
	|	СУММА(ВТ_Общая.КоличествоКонечныйОстаток) КАК КоличествоКонечныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоНачальныйОстаток) КАК ТоварыНаСкладахКоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоПриход) КАК ТоварыНаСкладахКоличествоПриход,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоРасход) КАК ТоварыНаСкладахКоличествоРасход,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоКонечныйОстаток) КАК ТоварыНаСкладахКоличествоКонечныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоНачальныйОстаток) КАК ТоварыТОХпоДаннымПоставщиковКоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоПриход) КАК ТоварыТОХпоДаннымПоставщиковКоличествоПриход,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоРасход) КАК ТоварыТОХпоДаннымПоставщиковКоличествоРасход,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоКонечныйОстаток) КАК ТоварыТОХпоДаннымПоставщиковКоличествоКонечныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоНачальныйОстаток) КАК ТоварыОХКоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоПриход) КАК ТоварыОХКоличествоПриход,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоРасход) КАК ТоварыОХКоличествоРасход,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоКонечныйОстаток) КАК ТоварыОХКоличествоКонечныйОстаток,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоНачальныйОстаток) КАК ТОХПереданныеКоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоПриход) КАК ТОХПереданныеКоличествоПриход,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоРасход) КАК ТОХПереданныеКоличествоРасход,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоКонечныйОстаток) КАК ТОХПереданныеКоличествоКонечныйОстаток,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоНачальныйОстаток) КАК ОсновнойСкладКоличествоНачальныйОстаток,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоПриход) КАК ОсновнойСкладКоличествоПриход,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоРасход) КАК ОсновнойСкладКоличествоРасход,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоКонечныйОстаток) КАК ОсновнойСкладКоличествоКонечныйОстаток,
	|	0 КАК ТоварыНаСкладахНачПервый,
	|	0 КАК КоличествоНачПервый,
	|	0 КАК ТОХпоДаннымПоставщиковНачПервый,
	|	0 КАК ТОХНачПервый,
	|	0 КАК ТОХПереданныеНачПервый,
	|	0 КАК ОсновнойСкладНачПервый,
	|	0 КАК ТоварыНаСкладахМинусТОХНачПервый,
	|	0 КАК ТОХМинусПереданныеНачПервый,
	|	0 КАК ТоварыНаСкладахКонПоследний,
	|	0 КАК КоличествоКонПоследний,
	|	0 КАК ТОХпоДаннымПоставщиковКонПоследний,
	|	0 КАК ТОХКонПоследний,
	|	0 КАК ТОХПереданныеКонПоследний,
	|	0 КАК ОсновнойСкладКонПоследний,
	|	0 КАК ТоварыНаСкладахМинусТОХКонПоследний,
	|	0 КАК ТОХМинусПереданныеКонПоследний,
	|	ВЫБОР
	|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
	|			ТОГДА 1
	|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
	|	КОНЕЦ КАК ПорядокСклада
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Общая.Склад,
	|	ВТ_Общая.ПериодСекунда,
	|	ВТ_Общая.Регистратор,
	|	ВТ_Общая.Номенклатура,
	|	ВТ_Общая.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА 0
	|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
	|			ТОГДА 1
	|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
	|	КОНЕЦ";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ()

Функция ТекстЗапросаБезСерий()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ КАК ПериодСекунда,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	0 КАК КоличествоНачальныйОстаток,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоРасход) КАК КоличествоРасход,
	|	0 КАК КоличествоКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_ОсновнойСкладТоварыНаСкладах
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Авто, Склад = &ОсновнойСклад) КАК ТоварыНаСкладахОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыОрганизацийМТОстаткиИОбороты.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		КОГДА ТоварыОрганизацийМТОстаткиИОбороты.КоличествоПриход > 0
	|				И ТоварыОрганизацийМТОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВыкупСОтветственногоХранения
	|			ТОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.НачалоПериода
	|		ИНАЧЕ ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ КАК ПериодСекунда,
	|	ВЫБОР
	|		КОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыОрганизацийМТОстаткиИОбороты.Регистратор
	|	КОНЕЦ КАК Регистратор,
	|	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияНоменклатуры,
	|	0 КАК КоличествоНачальныйОстаток,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход,
	|	0 КАК КоличествоКонечныйОстаток,
	|	0 КАК ТоварыНаСкладахКоличествоНачальныйОстаток,
	|	0 КАК ТоварыНаСкладахКоличествоПриход,
	|	0 КАК ТоварыНаСкладахКоличествоРасход,
	|	0 КАК ТоварыНаСкладахКоличествоКонечныйОстаток,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоНачальныйОстаток,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоПриход,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоРасход,
	|	0 КАК ТоварыТОХпоДаннымПоставщиковКоличествоКонечныйОстаток,
	|	0 КАК ТоварыОХКоличествоНачальныйОстаток,
	|	0 КАК ТоварыОХКоличествоПриход,
	|	0 КАК ТоварыОХКоличествоРасход,
	|	0 КАК ТоварыОХКоличествоКонечныйОстаток,
	|	0 КАК ТОХПереданныеКоличествоНачальныйОстаток,
	|	0 КАК ТОХПереданныеКоличествоПриход,
	|	0 КАК ТОХПереданныеКоличествоРасход,
	|	0 КАК ТОХПереданныеКоличествоКонечныйОстаток,
	|	0 КАК ОсновнойСкладКоличествоНачальныйОстаток,
	|	0 КАК ОсновнойСкладКоличествоПриход,
	|	0 КАК ОсновнойСкладКоличествоРасход,
	|	0 КАК ОсновнойСкладКоличествоКонечныйОстаток,
	|	""МТ"" КАК Раздел
	|ПОМЕСТИТЬ ВТ_Общая
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизацийМТ.Обороты(&НачалоПериодаВыкупа, , Авто, ) КАК ТоварыОрганизацийМТОстаткиИОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор ССЫЛКА Документ.ВыкупСОтветственногоХранения
	|				ТОГДА ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.КонецПериода МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИНАЧЕ ТоварыОрганизацийМТОстаткиИОбороты.Регистратор.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоПриход),
	|	СУММА(ТоварыНаСкладахОстаткиИОбороты.КоличествоРасход),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""Склад""
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(, , Авто, ) КАК ТоварыНаСкладахОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыНаСкладахОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыНаСкладахОстаткиИОбороты.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоПриход,
	|	ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты.КоличествоРасход,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""ТОХ""
	|ИЗ
	|	РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Обороты(, , Авто, ) КАК ТоварыТОХпоДаннымПоставщиковОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоПриход),
	|	СУММА(ТоварыОтветственногоХраненияОстаткиИОбороты.КоличествоРасход),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""ТОХ""
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХранения.Обороты(, , Авто, ) КАК ТоварыОтветственногоХраненияОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТоварыОтветственногоХраненияОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТоварыОтветственногоХраненияОстаткиИОбороты.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТОХПереданныеОстаткиИОбороты.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	СУММА(ТОХПереданныеОстаткиИОбороты.КоличествоПриход),
	|	СУММА(ТОХПереданныеОстаткиИОбороты.КоличествоРасход),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	""ТОХ""
	|ИЗ
	|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Обороты(, , Авто, ) КАК ТОХПереданныеОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА &НачалоПериода
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор.Дата
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТОХПереданныеОстаткиИОбороты.Регистратор = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		ИНАЧЕ ТОХПереданныеОстаткиИОбороты.Регистратор
	|	КОНЕЦ,
	|	ТОХПереданныеОстаткиИОбороты.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ВТ_ОсновнойСкладТоварыНаСкладах.ПериодСекунда,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.Регистратор,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.Номенклатура,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоНачальныйОстаток,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоПриход,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоРасход,
	|	ВТ_ОсновнойСкладТоварыНаСкладах.КоличествоКонечныйОстаток,
	|	""ТОХ""
	|ИЗ
	|	ВТ_ОсновнойСкладТоварыНаСкладах КАК ВТ_ОсновнойСкладТоварыНаСкладах
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Общая.Склад,
	|	ВТ_Общая.ПериодСекунда,
	|	ВТ_Общая.Регистратор,
	|	ВТ_Общая.Номенклатура,
	|	ВТ_Общая.СерияНоменклатуры,
	|	ВТ_Общая.Раздел,
	|	СУММА(ВТ_Общая.КоличествоНачальныйОстаток) КАК МТНачОст,
	|	СУММА(ВТ_Общая.КоличествоПриход) КАК МТПриход,
	|	СУММА(ВТ_Общая.КоличествоРасход) КАК МТРасход,
	|	СУММА(ВТ_Общая.КоличествоКонечныйОстаток) КАК МТКонОст,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоНачальныйОстаток) КАК ТовСклНачОст,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоПриход) КАК ТовСклПриход,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоРасход) КАК ТовСклРасход,
	|	СУММА(ВТ_Общая.ТоварыНаСкладахКоличествоКонечныйОстаток) КАК ТовСклКонОст,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоНачальныйОстаток) КАК ТОХПостНачОст,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоПриход) КАК ТОХПостПриход,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоРасход) КАК ТОХПостРасход,
	|	СУММА(ВТ_Общая.ТоварыТОХпоДаннымПоставщиковКоличествоКонечныйОстаток) КАК ТОХПостКонОст,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоНачальныйОстаток) КАК ТОХНачОст,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоПриход) КАК ТОХПриход,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоРасход) КАК ТОХРасход,
	|	СУММА(ВТ_Общая.ТоварыОХКоличествоКонечныйОстаток) КАК ТОХКонОст,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоНачальныйОстаток) КАК ТОХПерНачОст,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоПриход) КАК ТОХПерПриход,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоРасход) КАК ТОХПерРасход,
	|	СУММА(ВТ_Общая.ТОХПереданныеКоличествоКонечныйОстаток) КАК ТОХПерКонОст,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоНачальныйОстаток) КАК ОснСклНачОст,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоПриход) КАК ОснСклПриход,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоРасход) КАК ОснСклРасход,
	|	СУММА(ВТ_Общая.ОсновнойСкладКоличествоКонечныйОстаток) КАК ОснСклКонОст,
	|	0 КАК ТовСклНачПервый,
	|	0 КАК МТНачПервый,
	|	0 КАК ТОХПостНачПервый,
	|	0 КАК ТОХНачПервый,
	|	0 КАК ТОХПерНачПервый,
	|	0 КАК ОснСклНачПервый,
	|	0 КАК ТовСклМинусТОХНачПервый,
	|	0 КАК ТОХМинусПерНачПервый,
	|	0 КАК ТовСклКонПоследний,
	|	0 КАК МТКонПоследний,
	|	0 КАК ТОХПостКонПоследний,
	|	0 КАК ТОХКонПоследний,
	|	0 КАК ТОХПерКонПоследний,
	|	0 КАК ОснСклКонПоследний,
	|	0 КАК ТовСклМинусТОХКонПоследний,
	|	0 КАК ТОХМинусПерКонПоследний,
	|	0 КАК ТОХМинусПерПриход,
	|	0 КАК ТОХМинусПерРасход,
	|	0 КАК ТОХМинусПерНачОст,
	|	0 КАК ТОХМинусПерКонОст,
	|	0 КАК ТовСклМинусТОХНачОст,
	|	0 КАК ТовСклМинусТОХПриход,
	|	0 КАК ТовСклМинусТОХРасход,
	|	0 КАК ТовСклМинусТОХКонОст,
	|	ВЫБОР
	|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА 10
	|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
	|			ТОГДА 11
	|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
	|	КОНЕЦ КАК ПорядокСклада
	|ИЗ
	|	ВТ_Общая КАК ВТ_Общая
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Общая.Склад,
	|	ВТ_Общая.ПериодСекунда,
	|	ВТ_Общая.Регистратор,
	|	ВТ_Общая.Номенклатура,
	|	ВТ_Общая.СерияНоменклатуры,
	|	ВЫБОР
	|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ТОГДА 10
	|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
	|			ТОГДА 11
	|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
	|	КОНЕЦ,
	|	ВТ_Общая.Раздел";
	
	Возврат ТекстЗапроса;
	
КонецФункции // ()


Процедура ЗаполнениеТаблицыССериями(дзДокументы, тзРезультатНов)
	
	тзДокумент    = тзРезультатНов.Скопировать();
	тзПустыеСерии = тзРезультатНов.Скопировать();
	
	Для каждого СтрокаДокумент Из дзДокументы Цикл        // СтрокаДокумент
		
		тзДокумент.Очистить();  
		тзПустыеСерии.Очистить();

		Для каждого СтрокаСерия Из СтрокаДокумент.Строки Цикл         // СтрокаСерия
		
			Для каждого СтрокаСклад Из СтрокаСерия.Строки Цикл         // СтрокаСклад
			
				ДобСтрока = тзДокумент.Добавить();
				ЗаполнитьЗначенияСвойств(ДобСтрока, СтрокаСклад);        
				
				Если СтрокаСклад.СерияНоменклатуры.Пустая() Тогда
					
					ДобСтрока = тзПустыеСерии.Добавить();
					ЗаполнитьЗначенияСвойств(ДобСтрока, СтрокаСклад);        
					
				КонецЕсли;
					
			КонецЦикла;

		КонецЦикла;
			
		//Для каждого СтрокаДокумент Из тзСтрокаДокумент.Строки Цикл      
		//	
		//	ДобСтрока = тзРезультатНов.Добавить();
		//	ЗаполнитьЗначенияСвойств(ДобСтрока, СтрокаДокумент);
		//	
		//КонецЦикла;
		
	КонецЦикла;   // дзДокументы    
	

КонецПроцедуры

Функция ПолучитьОстаткиНаНачало(тзСтрокаДокумент, Номенклатура, МассивСклады)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТовСклОстаткиИОбороты.Склад,
		|	ТовСклОстаткиИОбороты.Номенклатура,
		|	ТовСклОстаткиИОбороты.КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОсновнойТовСкл
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Момент,
		|			Склад = &ОсновнойСклад
		|				И Номенклатура = &Номенклатура) КАК ТовСклОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыОрганизацийМТОстатки.Склад КАК Склад,
		|	ТоварыОрганизацийМТОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийМТОстатки.КоличествоОстаток КАК МТНачОст,
		|	0 КАК ТовСклНачОст,
		|	0 КАК ТОХПостНачОст,
		|	0 КАК ТОХНачОст,
		|	0 КАК ТОХПерНачОст,
		|	0 КАК ОснСклНачОст,
		|	""МТ"" КАК Раздел
		|ПОМЕСТИТЬ ВТ_Общая
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийМТ.Остатки(
		|			&Момент,
		|			Склад В (&Склады)
		|				И Номенклатура = &Номенклатура) КАК ТоварыОрганизацийМТОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТовСклОстатки.Склад,
		|	ТовСклОстатки.Номенклатура,
		|	0,
		|	ТовСклОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0,
		|	0,
		|	""Склад""
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Момент,
		|			Склад В (&Склады)
		|				И Номенклатура = &Номенклатура) КАК ТовСклОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|	ТОХПостОстатки.Номенклатура,
		|	0,
		|	0,
		|	ТОХПостОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	0,
		|	""ТОХ""
		|ИЗ
		|	РегистрНакопления.ТоварыТОХпоДаннымПоставщиков.Остатки(&Момент, Номенклатура = &Номенклатура) КАК ТОХПостОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|	ТоварыОтветственногоХраненияОстатки.Номенклатура,
		|	0,
		|	0,
		|	0,
		|	ТоварыОтветственногоХраненияОстатки.КоличествоОстаток,
		|	0,
		|	0,
		|	""ТОХ""
		|ИЗ
		|	РегистрНакопления.ТоварыОтветственногоХранения.Остатки(&Момент, Номенклатура = &Номенклатура) КАК ТоварыОтветственногоХраненияОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|	ТОХПерОстатки.Номенклатура,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ТОХПерОстатки.КоличествоОстаток,
		|	0,
		|	""ТОХ""
		|ИЗ
		|	РегистрНакопления.ТоварыОтветственногоХраненияПереданные.Остатки(&Момент, Номенклатура = &Номенклатура) КАК ТОХПерОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
		|	ВТ_ОсновнойТовСкл.Номенклатура,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ВТ_ОсновнойТовСкл.КоличествоОстаток,
		|	""ТОХ""
		|ИЗ
		|	ВТ_ОсновнойТовСкл КАК ВТ_ОсновнойТовСкл
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Общая.Склад,
		|	ВТ_Общая.Номенклатура,
		|	СУММА(ВТ_Общая.МТНачОст) КАК МТНачОст,
		|	СУММА(ВТ_Общая.ТовСклНачОст) КАК ТовСклНачОст,
		|	СУММА(ВТ_Общая.ТОХПостНачОст) КАК ТОХПостНачОст,
		|	СУММА(ВТ_Общая.ТОХНачОст) КАК ТОХНачОст,
		|	СУММА(ВТ_Общая.ТОХПерНачОст) КАК ТОХПерНачОст,
		|	СУММА(ВТ_Общая.ОснСклНачОст) КАК ОснСклНачОст,
		|	0 КАК МТКонПоследний,
		|	0 КАК ТовСклКонПоследний,
		|	0 КАК ТОХПостКонПоследний,
		|	0 КАК ТОХКонПоследний,
		|	0 КАК ТОХПерКонПоследний,
		|	0 КАК ОскСклКонПоследний,
		|	ВЫБОР
		|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА 10
		|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
		|			ТОГДА 11
		|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
		|	КОНЕЦ КАК ПорядокСклада,
		|	ВТ_Общая.Раздел
		|ИЗ
		|	ВТ_Общая КАК ВТ_Общая
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Общая.Склад,
		|	ВТ_Общая.Номенклатура,
		|	ВЫБОР
		|		КОГДА ВТ_Общая.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА 10
		|		КОГДА ВТ_Общая.Склад = &ОсновнойСклад
		|			ТОГДА 11
		|		ИНАЧЕ ПОДСТРОКА(ВТ_Общая.Склад.Наименование, 1, 10)
		|	КОНЕЦ,
		|	ВТ_Общая.Раздел";
	
	Запрос.УстановитьПараметр("ОсновнойСклад", ОсновнойСклад);  
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Если тзСтрокаДокумент = Неопределено Тогда
		
		Запрос.УстановитьПараметр("Момент", Неопределено);
		Запрос.УстановитьПараметр("НачалоПериодаВыкупа", Неопределено);
		
	Иначе
		Запрос.УстановитьПараметр("Момент", тзСтрокаДокумент.Регистратор.МоментВремени()); 
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Склады", МассивСклады);
	
	РезультатЗапроса = Запрос.Выполнить();      
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // ()

Процедура ЗаполнитьОстаткиНаНачалоВыкуп(тзСтрокаДокумент, Номенклатура, Склад)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыОрганизацийМТОстаткиИОбороты.Склад КАК Склад,
		|	ТоварыОрганизацийМТОстаткиИОбороты.Номенклатура КАК Номенклатура,
		|	ТоварыОрганизацийМТОстаткиИОбороты.КоличествоОстаток КАК МТНачОст
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизацийМТ.Остатки(&НачалоПериодаВыкупа, Склад = &Склад И Номенклатура = &Номенклатура) КАК ТоварыОрганизацийМТОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НачалоПериодаВыкупа", тзСтрокаДокумент.Регистратор.НачалоПериода);
	
	РезультатЗапроса = Запрос.Выполнить();      
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();  
		
		Выборка.Следующий();
		тзСтрокаДокумент.МТНачОст = Выборка.МТНачОст;
	
	КонецЕсли;
	
КонецПроцедуры

Процедура РасчетВычисляемыхПолей(тзСтрока, ТолькоОстатки)  
	
	Если тзСтрока.Раздел = "ТОХ" Тогда
		
		тзСтрока.ТОХМинусПерНачОст = тзСтрока.ТОХНачОст - тзСтрока.ТОХПерНачОст;
		тзСтрока.ТОХМинусПерКонОст = тзСтрока.ТОХКонОст - тзСтрока.ТОХПерКонОст;
		
		тзСтрока.ТовСклМинусТОХНачОст = тзСтрока.ОснСклНачОст - тзСтрока.ТОХМинусПерНачОст;
		тзСтрока.ТовСклМинусТОХКонОст = тзСтрока.ОснСклКонОст - тзСтрока.ТОХМинусПерКонОст;
		
		// Вычисление доп.метрик по ТОХ и основному складу
		//тзСтрока.Скл1ТОХПостТОХКонОст = тзСтрока.ТОХПостКонОст - тзСтрока.ТОХКонОст;     // М3
		//тзСтрока.Скл1ТовСклМтТОХПостТОХПерКонОст = тзСтрока.Скл1ТовСклМтТОХПостТОХПерКонОст - тзСтрока.МТКонОст - тзСтрока.ТОХПостКонОст + тзСтрока.ТОХПерКонОст;   // М2 
		
		Если Не ТолькоОстатки Тогда
			
			тзСтрока.ТОХМинусПерПриход    = тзСтрока.ТОХПриход - тзСтрока.ТОХПерПриход;
			тзСтрока.ТОХМинусПерРасход    = тзСтрока.ТОХРасход - тзСтрока.ТОХПерРасход;
			тзСтрока.ТовСклМинусТОХПриход = тзСтрока.ОснСклПриход - тзСтрока.ТОХМинусПерПриход;
			тзСтрока.ТовСклМинусТОХРасход = тзСтрока.ОснСклРасход - тзСтрока.ТОХМинусПерРасход;  
		
		КонецЕсли;             
		
	ИначеЕсли тзСтрока.Склад = ОсновнойСклад Тогда
		
		Если тзСтрока.Раздел = "Склад" Тогда
		
			// Вычисление доп.метрик по ТОХ и основному складу     
			//тзСтрока.Скл1ТовСклМтТОХПостТОХПерКонОст = тзСтрока.ТовСклКонОст;    // М2
		
		ИначеЕсли тзСтрока.Раздел = "МТ" Тогда
		
			// Вычисление доп.метрик по ТОХ и основному складу     
			//тзСтрока.Скл1ТовСклМтТОХПостТОХПерКонОст = -тзСтрока.МТКонОст;
			//тзСтрока.Скл1МТКонОст = тзСтрока.МТКонОст;       // М1 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

