Перем Подключение,RS;
Перем ОписаниеТиповСтрока, ОписаниеТиповДата, ОписаниеТиповЧисло, ОписаниеТиповЧислоСРазрядами; 

Процедура ВыполнитьРаботу(НомерЗаказаАварды = Неопределено) Экспорт
	
	ЗапросИсключаемыхИзЭкспрессаСкладов = Новый Запрос;
	ЗапросИсключаемыхИзЭкспрессаСкладов.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СобственныеСклады.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СобственныеСклады КАК СобственныеСклады
	|ГДЕ
	|	СобственныеСклады.ИсключитьИзОбщегоЭкспресса
	|	И НЕ (ВЫРАЗИТЬ(СобственныеСклады.АдресВебСервиса КАК СТРОКА(256))) = """"
	|	И НЕ СобственныеСклады.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СобственныеСклады.Идентификатор";
	
	РезультатЗапросаИсключаемыхИзЭкспрессаСкладов = ЗапросИсключаемыхИзЭкспрессаСкладов.Выполнить();
	
	Если НЕ РезультатЗапросаИсключаемыхИзЭкспрессаСкладов.Пустой() Тогда
		
		ВыборкаСкладов = РезультатЗапросаИсключаемыхИзЭкспрессаСкладов.Выбрать();
		
		Пока ВыборкаСкладов.Следующий() Цикл
			
			Если ВыборкаСкладов.Склад.ВэбСервисУТ11 Тогда
				
				//+Белов А. 14.04.2026 #UT10-5816 - добавил условие СоздаватьПоступленияЧерезЭДО
				Если Не ВыборкаСкладов.Склад.СоздаватьПоступленияЧерезЭДО Тогда
					ЗагрузкаПоступленийПоДаннымИзСтороннейУТ11(, НомерЗаказаАварды,ВыборкаСкладов.Склад);	
				КонецЕсли;
				
			Иначе				
				ЗагрузкаПоступленийПоДаннымИзСтороннейБазы(,ВыборкаСкладов.Склад);
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
	Если Константы.ОтправлятьЗаказыВСтророннююУТ.Получить() Тогда
		ЗагрузкаПоступленийПоДаннымИзСтороннейБазы();
	КонецЕсли;	
	
	Если Константы.ОтправлятьЗаказыВСтророннююУТ11.Получить() Тогда
		ЗагрузкаПоступленийПоДаннымИзСтороннейУТ11(, НомерЗаказаАварды);
	КонецЕсли;
	
	Если Константы.ГорючиеЖидкостиВОтдельныйЗаказ.Получить() Тогда
		ЗагрузкаПоступленийПоДаннымИзСтороннейУТ11("ГорючиеЖидкости", НомерЗаказаАварды);                                                        
	КонецЕсли;
	
	Если Константы.ОтправлятьЭкспрессыВ.Получить() Тогда
		
		Если Константы.ПриоритетОтправкиЭкспрессов.Получить() = Перечисления.ПриоритетыОтправкиЭкспрессов.УТ10 Тогда
			ЗагрузкаПоступленийПоДаннымИзСтороннейБазы("Экспрессы");
		ИначеЕсли Константы.ПриоритетОтправкиЭкспрессов.Получить() = Перечисления.ПриоритетыОтправкиЭкспрессов.УТ11 Тогда
			ЗагрузкаПоступленийПоДаннымИзСтороннейУТ11("Экспрессы", НомерЗаказаАварды); 
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьТаблицуАварды(НомерЗаказаАварды = Неопределено)
	
	Подключение = Неопределено;
	RS = Неопределено;
	Подключение = Новый COMObject("ADODB.Connection");	
	
	Если НЕ РаботаСАвардой.Соединение(Подключение) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДатаНТ = ПолучитьДату(ТекущаяДата() - 100 * 24 * 60 * 60);
	ДатаКТ = ПолучитьДату(ТекущаяДата() + 10 * 24 * 60 * 60);
	
	Если ЗначениеЗаполнено(НомерЗаказаАварды) Тогда
		
		ТекстЗапроса = "SELECT did, did7, dconcept, dcode, dstate, ddate1, dnum1, did1, did10, dnum3, did5, did4,
		|dname, dtext1, datainvoice, did6, did3, datascheta, ddate, dogid, kpp_1c
		| FROM az_get_6051_6001(null, '" + ДатаНТ + "', '" + ДатаКТ + "',6051, null, 2401, null, null, null)  
		| WHERE dogid in " + ПолучитьСписокДоговоров() + "
		|       and dcode = " + НомерЗаказаАварды + "";
		
	Иначе	
		
		ТекстЗапроса = "SELECT did, did7, dconcept, dcode, dstate, ddate1, dnum1, did1, did10, dnum3, did5, did4,
		|dname, dtext1, datainvoice, did6, did3, datascheta, ddate, dogid, kpp_1c
		| FROM az_get_6051_6001(null, '" + ДатаНТ + "', '" + ДатаКТ + "',6051, 163100002, 2401, null, null, null)  
		| WHERE dogid in " + ПолучитьСписокДоговоров();
		
	КонецЕсли;
	
	RS = РаботаСАвардой.СформироватьЗапрос(ТекстЗапроса, Подключение);
	
	ТаблицаАварды = Новый ТаблицаЗначений;
	
	Если RS <> Неопределено Тогда
		
		Для Счетчик = 1 По RS.Fields.Count Цикл
			
			Поле = RS.Fields.Item(Счетчик - 1);
			ИмяПоля = НРег(СокрЛП(Поле.Name));
			
			Если ИмяПоля = "did" ИЛИ ИмяПоля = "did7" ИЛИ ИмяПоля = "dconcept" ИЛИ ИмяПоля = "dstate" ИЛИ ИмяПоля = "did1" 
				ИЛИ ИмяПоля = "did10" ИЛИ ИмяПоля = "did5" ИЛИ ИмяПоля = "did4" ИЛИ ИмяПоля = "did6" ИЛИ ИмяПоля = "did3" ИЛИ ИмяПоля = "dogid" Тогда
				Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповЧисло, ИмяПоля); 					
			ИначеЕсли ИмяПоля = "dnum1" ИЛИ ИмяПоля = "dnum3" Тогда
				Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповДата, ИмяПоля); 					
			ИначеЕсли ИмяПоля = "ddate1" ИЛИ ИмяПоля = "datascheta" ИЛИ ИмяПоля = "datainvoice" ИЛИ ИмяПоля = "ddate"Тогда
				Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля,ОписаниеТиповДата, Поле.Name); 					
			Иначе					
				Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповСтрока, ИмяПоля);
			КонецЕсли;
			
		КонецЦикла;
		
		Пока RS.EOF() = 0 Цикл		
			
			НоваяСтрока = ТаблицаАварды.Добавить();           		
			
			Для Счетчик = 1 По RS.Fields.Count Цикл 
				
				Поле = RS.Fields.Item(Счетчик - 1);
				НоваяСтрока[Поле.Name] = Поле.Value;			
				
			КонецЦикла;    		
			
			RS.MoveNext(); 		
			
		КонецЦикла;
		
		RS.Close(); 
		RS = Неопределено;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерЗаказаАварды) Тогда
		
		ТекстЗапроса = "SELECT did, did7, dconcept, dcode, dstate, ddate1, dnum1, did1, did10, dnum3, did5, did4,
		|dname, dtext1, datainvoice, did6, did3, datascheta, ddate, dogid, kpp_1c
		| FROM az_get_6051_6001(null, '" + ДатаНТ + "', '" + ДатаКТ + "',6051, 20163, 2401, null, null, null) 
		| WHERE dogid in " + ПолучитьСписокДоговоров();
		
		RS = РаботаСАвардой.СформироватьЗапрос(ТекстЗапроса, Подключение);
		
		Если RS <> Неопределено Тогда
			
			Если ТаблицаАварды.Колонки.Количество() = 0 тогда
				
				Для Счетчик = 1 По RS.Fields.Count Цикл
					
					Поле = RS.Fields.Item(Счетчик - 1);
					ИмяПоля = НРег(СокрЛП(Поле.Name));
					
					Если ИмяПоля = "did" ИЛИ ИмяПоля = "did7" ИЛИ ИмяПоля = "dconcept" ИЛИ ИмяПоля = "dstate" ИЛИ ИмяПоля = "did1" 
						ИЛИ ИмяПоля = "did10" ИЛИ ИмяПоля = "did5" ИЛИ ИмяПоля = "did4" ИЛИ ИмяПоля = "did6" ИЛИ ИмяПоля = "did3" ИЛИ ИмяПоля = "dogid" Тогда
						Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповЧисло, ИмяПоля); 					
					ИначеЕсли ИмяПоля = "dnum1" ИЛИ ИмяПоля = "dnum3" Тогда
						Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповДата, ИмяПоля); 					
					ИначеЕсли ИмяПоля = "ddate1" ИЛИ ИмяПоля = "datascheta" ИЛИ ИмяПоля = "datainvoice" ИЛИ ИмяПоля = "ddate"Тогда
						Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля,ОписаниеТиповДата, Поле.Name); 					
					Иначе					
						Колонка = ТаблицаАварды.Колонки.Добавить(ИмяПоля, ОписаниеТиповСтрока, ИмяПоля);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Пока RS.EOF() = 0 Цикл		
				
				НоваяСтрока = ТаблицаАварды.Добавить();           		
				
				Для Счетчик = 1 По RS.Fields.Count Цикл 
					
					Поле = RS.Fields.Item(Счетчик - 1);
					НоваяСтрока[Поле.Name] = Поле.Value;			
					
				КонецЦикла;    		
				
				RS.MoveNext(); 		
				
			КонецЦикла;
			
			RS.Close(); 
			RS = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТаблицаАварды.Количество() > 0 И НомерЗаказаАварды = Неопределено Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("did4", 62375063);
		Рез = ТаблицаАварды.НайтиСтроки(ПараметрыОтбора);
		
		Для Каждого СтрРез Из Рез Цикл
			ТаблицаАварды.Удалить(СтрРез);
		КонецЦикла;		
		
	КонецЕсли;
	
	Возврат ?(ТаблицаАварды.Количество(), ТаблицаАварды, Неопределено);
	
КонецФункции

Функция ПолучитьТаблицуГТД(ТаблицаДокументов)
	
	ТаблицаГТД = Новый ТаблицаЗначений;
	
	Попытка	                                                                                                    
		
		Прокси = WSСсылки.GetGTD.СоздатьWSПрокси("http://1c-ut.moskvorechie.ru/ut11","GetGTD", "GetGTDSoap", ,300);
		ХЗ = Прокси.ПолучитьТаблицуГТД(ЗначениеВХранилище(ТаблицаДокументов)); 	
		ТаблицаГТД = ЗначениеИзХранилища(ХЗ);
		
	Исключение
		ОшибкаЗагрузки("Ошибка подключения к веб-сервису", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ?(ТаблицаГТД.Количество(), ТаблицаГТД, Неопределено);
	
КонецФункции

Функция ПолучитьТаблицуСтрок(ТаблицаДокументов)
	
	ТаблицаСтрок = Новый ТаблицаЗначений;
	ТаблицаСтрок.Колонки.Добавить("dcode", ОписаниеТиповСтрока, "dcode");
	ТаблицаСтрок.Колонки.Добавить("ddate", ОписаниеТиповДата, "ddate");
	ТаблицаСтрок.Колонки.Добавить("НомерЗаказа", ОписаниеТиповСтрока);
	ТаблицаСтрок.Колонки.Добавить("ДатаЗаказа", ОписаниеТиповДата);
	ТаблицаСтрок.Колонки.Добавить("НомерСтрокиЗаказа", ОписаниеТиповЧисло);
	
	Для Каждого Стр Из ТаблицаДокументов Цикл
		ВыбратьСтрокиДокумента(Стр, ТаблицаСтрок);
	КонецЦикла;
	
	Возврат ?(ТаблицаСтрок.Количество(), ТаблицаСтрок, Неопределено);
	
КонецФункции

Процедура ВыбратьСтрокиДокумента(Выборка, ТаблицаСтрок)   
	
	НПП = 1;
	
	Запрос = "SELECT L.etext1 AS UID, LB.ltext2 AS InvNum, LB.LCODE AS CODE, LB.LID AS LID , LB.ltext1 AS ART ,(L.ENUM1*L.ENUM2) AS Q, (L.ENUM11*L.ENUM2) AS Q2, L.ENUM4 AS PRICE, L.ENUM14 AS Summa, RS.VAL AS SUMMNDS, L.ECODE AS ECODE, LB.LID3 AS LID3, L.EID AS EID, L.ENUM7 AS NDS, lb1.lname as name FROM LIN L LEFT JOIN LIB LB ON (LB.LID = L.EID1) LEFT JOIN xecnum RS ON RS.owner = L.eid AND RS.concept = 75001800 AND RS.node = 75001805 AND RS.parent = 75001801 LEFT JOIN xecint x on x.owner = l.eid and x.CONCEPT = 75001800 AND x.NODE = 75001804 left join lib lb1 on lb1.lid = x.val WHERE L.EIDDOC ="+ФорматироватьСтроку(Выборка.did);
	
	РСТС = Неопределено;
	РСТС = РаботаСАвардой.СформироватьЗапрос(Запрос,Подключение);
	
	Если РСТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Счетчик = 1 По РСТС.Fields.Count Цикл
		
		Поле = РСТС.Fields.Item(Счетчик - 1);
		ИмяПоля = НРег(СокрЛП(Поле.Name));
		
		Если ТаблицаСтрок.Колонки.Найти(ИмяПоля) = Неопределено Тогда
			
			Если ИмяПоля = "ddate1" ИЛИ ИмяПоля = "datascheta" ИЛИ ИмяПоля = "datainvoice" ИЛИ ИмяПоля = "ddate"Тогда
				Колонка = ТаблицаСтрок.Колонки.Добавить(ИмяПоля, ОписаниеТиповДата, ИмяПоля);
			ИначеЕсли ИмяПоля = "q" ИЛИ ИмяПоля = "price" ИЛИ ИмяПоля = "summa" Тогда
				Колонка = ТаблицаСтрок.Колонки.Добавить(ИмяПоля, ОписаниеТиповЧислоСРазрядами, ИмяПоля);
			Иначе					
				Колонка = ТаблицаСтрок.Колонки.Добавить(ИмяПоля, ОписаниеТиповСтрока, ИмяПоля);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Пока РСТС.EOF() = 0 Цикл		
		
		НоваяСтрока = ТаблицаСтрок.Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Для Счетчик = 1 По РСТС.Fields.Count Цикл 
			
			Поле = РСТС.Fields.Item(Счетчик - 1);
			НоваяСтрока[Поле.Name] = Поле.Value;
			
			Если Поле.Name = "UID" Тогда
				
				ДанныеЗаказа = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(Поле.Value, "/");
				
				Если НЕ ДанныеЗаказа = Неопределено Тогда
					
					Если ДанныеЗаказа.Количество() = 3 Тогда
						
						НоваяСтрока.НомерЗаказа = ДанныеЗаказа[0];
						ДатаЗаказа = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ДанныеЗаказа[1], ".");
						НоваяСтрока.НомерСтрокиЗаказа = Число(ДанныеЗаказа[2]);
						
						Если НЕ ДатаЗаказа = Неопределено Тогда
							
							Если ДатаЗаказа.Количество() = 3 Тогда
								НоваяСтрока.ДатаЗаказа = Дата(ДатаЗаказа[2], ДатаЗаказа[1], ДатаЗаказа[0]);
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;  
		
		РСТС.MoveNext(); 		
		
	КонецЦикла;
	
	РСТС.Close(); 			
	РСТС = Неопределено;
	
КонецПроцедуры

Функция НайтиНоменклатуру(НаименованиеНоменклатуры, КодНоменклатурыВМоскве, ЕдИзм)
	
	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодПоБазеМоскоречье", КодНоменклатурыВМоскве);
	
	Возврат Номенклатура;
	
	Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
		
	Иначе 
		Возврат Номенклатура;
	КонецЕсли;     
	
КонецФункции

Функция СоздатьСерию(Номенклатура, НомерГТД, Страна, НомерГТДСсылка)
	
	Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НомерГТД, Истина,, Номенклатура);
	
	Если ЗначениеЗаполнено(Серия) тогда
		Возврат Серия
	КонецЕсли;
	
	СерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	СерияНоменклатуры.Владелец = Номенклатура;
	СерияНоменклатуры.Наименование = НомерГТД;
	СерияНоменклатуры.СтранаПроисхождения = Страна;
	СерияНоменклатуры.Комментарий = "Создан регламентным заданием загрузки из аварды " + ТекущаяДата();
	
	Если ЗначениеЗаполнено(НомерГТДСсылка) Тогда
		СерияНоменклатуры.НомерГТД = НомерГТДСсылка;
	Иначе
		
		Номер = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
		
		Если Не ЗначениеЗаполнено(Номер) тогда
			
			НомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент();
			НомерГТДОбъект.Код = НомерГТД;
			НомерГТДОбъект.Комментарий = "Создан регламентным заданием загрузки из аварды " + ТекущаяДата();
			НомерГТДОбъект.Записать();
			СерияНоменклатуры.НомерГТД = НомерГТДОбъект.Ссылка;
			
		Иначе
			СерияНоменклатуры.НомерГТД = Номер;
		КонецЕсли;
		
	КонецЕсли;
	
	СерияНоменклатуры.Записать(); 
	
	Возврат СерияНоменклатуры.Ссылка; 
	
КонецФункции

Процедура ОшибкаЗагрузки(ТекстОшибки , ОписаниеОшибки)
	
	ЗаписьЖурналаРегистрации("Загрузка данных из аварды", УровеньЖурналаРегистрации.Ошибка, , ,
	ТекстОшибки + ":" + ОписаниеОшибки); 		
	
	МЗ = РегистрыСведений.ОшибкиЗагрузкиДанныхИзАварды.СоздатьМенеджерЗаписи();
	МЗ.МоментОшибки = ТекущаяДата();
	МЗ.ТекстОшибки = ТекстОшибки;
	МЗ.ОписаниеОшибки = ОписаниеОшибки;
	МЗ.Записать();
	
КонецПроцедуры

Функция ЗначениеИзХранилища(ХранилищеЗначений)
	
	Возврат ХранилищеЗначений.Получить();
	
КонецФункции

Функция ЗначениеВХранилище(Значение)
	
	Хранилище = Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(9));
	
	Возврат Хранилище;
	
КонецФункции

Функция ПолучитьДату(Дата)
	
	Возврат Формат(Дата, "ДЛФ=Д");
	
КонецФункции

Функция ФорматироватьСтроку(КодАварда)
	
	Возврат СтрЗаменить(Строка(КодАварда), " ", "");   
	
КонецФункции

Функция ПолучитьОстатокПоЗаказу(Номенклатура, ЗаказПоставщику, ЗаказПокупателя)
	
	ТекДата = ТекущаяДата();
	ДатаКон = КонецДня(КонецДня(ТекДата) + 2);
	//+Гавриленков В. 22.08.2025 #UT10-5394  
	КоличествоДней = Справочники.МТ_ПредопределенныеЗначения.ПолучитьЗначениеПоСвойству(Справочники.МТ_ПредопределенныеЗначения.НастройкиКоличестваДней, "Количество дней для получения поступлений по заказам");
	ДатаНач = НачалоДня(ТекДата) - (?(ЗначениеЗаполнено(КоличествоДней), КоличествоДней, 5) * 24 * 60 * 60);
	//ДатаНач = НачалоДня(ТекДата) - (5*24*60*60);
	//-Гавриленков В. 22.08.2025 #UT10-5394
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	СУММА(РазмещениеЗаказовПокупателейОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
	|ПОМЕСТИТЬ ОстатокРегистр
	|ИЗ
	|	РегистрНакопления.РазмещениеЗаказовПокупателей.Остатки(
	|			&ДатаКон,
	|			ЗаказПоставщику = &ЗаказПоставщику
	|				И ЗаказПокупателя = &ЗаказПокупателя
	|				И Номенклатура = &Номенклатура) КАК РазмещениеЗаказовПокупателейОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	РазмещениеЗаказовПокупателейОстатки.Номенклатура,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПокупателя,
	|	РазмещениеЗаказовПокупателейОстатки.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстатокРегистр.Номенклатура,
	|	СУММА(ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0)) КАК ПоступилоПоЗакПок,
	|	ОстатокРегистр.ЗаказПокупателя,
	|	ОстатокРегистр.ЗаказПоставщику,
	|	МАКСИМУМ(ОстатокРегистр.КоличествоОстаток) КАК ОстатокПоЗакПок
	|ПОМЕСТИТЬ ПоступилоПоЗаказуПокупателя
	|ИЗ
	|	ОстатокРегистр КАК ОстатокРегистр
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ОстатокРегистр.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ОстатокРегистр.ЗаказПоставщику = ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|			И ОстатокРегистр.ЗаказПокупателя = ПоступлениеТоваровУслугТовары.Заказ
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ЛОЖЬ)
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстатокРегистр.Номенклатура,
	|	ОстатокРегистр.ЗаказПокупателя,
	|	ОстатокРегистр.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	СУММА(ЗаказыПоставщикамОстатки.КоличествоОстаток) КАК КоличествоОстаток
	|ПОМЕСТИТЬ ОстатокПоЗаказуПоставщику
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(
	|			&ДатаКон,
	|			ЗаказПоставщику = &ЗаказПоставщику
	|				И Номенклатура = &Номенклатура) КАК ЗаказыПоставщикамОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстатокПоЗаказуПоставщику.Номенклатура,
	|	СУММА(ЕСТЬNULL(ПоступлениеТоваровУслугТовары.Количество, 0)) КАК ПоступилоПоЗакПост,
	|	ОстатокПоЗаказуПоставщику.ЗаказПоставщику,
	|	МАКСИМУМ(ОстатокПоЗаказуПоставщику.КоличествоОстаток) КАК ОстатокПоЗакПост
	|ПОМЕСТИТЬ ПоступилоПоЗаказуПоставщику
	|ИЗ
	|	ОстатокПоЗаказуПоставщику КАК ОстатокПоЗаказуПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|		ПО ОстатокПоЗаказуПоставщику.Номенклатура = ПоступлениеТоваровУслугТовары.Номенклатура
	|			И ОстатокПоЗаказуПоставщику.ЗаказПоставщику = ПоступлениеТоваровУслугТовары.ЗаказПоставщику
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.ПометкаУдаления = ЛОЖЬ)
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.Проведен = ЛОЖЬ)
	|			И (ПоступлениеТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстатокПоЗаказуПоставщику.Номенклатура,
	|	ОстатокПоЗаказуПоставщику.ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоступилоПоЗаказуПоставщику.Номенклатура,
	|	ПоступилоПоЗаказуПоставщику.ОстатокПоЗакПост,
	|	ПоступилоПоЗаказуПоставщику.ПоступилоПоЗакПост,
	|	МАКСИМУМ(ПоступилоПоЗаказуПоставщику.ОстатокПоЗакПост - ПоступилоПоЗаказуПоставщику.ПоступилоПоЗакПост) КАК ОстатокПоЗакПоставщику,
	|	ПоступилоПоЗаказуПокупателя.ОстатокПоЗакПок,
	|	ПоступилоПоЗаказуПокупателя.ПоступилоПоЗакПок,
	|	МАКСИМУМ(ЕСТЬNULL(ПоступилоПоЗаказуПокупателя.ОстатокПоЗакПок - ПоступилоПоЗаказуПокупателя.ПоступилоПоЗакПок, 0)) КАК ОстатокПоЗакПокупателя
	|ИЗ
	|	ПоступилоПоЗаказуПоставщику КАК ПоступилоПоЗаказуПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоступилоПоЗаказуПокупателя КАК ПоступилоПоЗаказуПокупателя
	|		ПО ПоступилоПоЗаказуПоставщику.Номенклатура = ПоступилоПоЗаказуПокупателя.Номенклатура
	|			И ПоступилоПоЗаказуПоставщику.ЗаказПоставщику = ПоступилоПоЗаказуПокупателя.ЗаказПоставщику
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступилоПоЗаказуПоставщику.Номенклатура,
	|	ПоступилоПоЗаказуПокупателя.ПоступилоПоЗакПок,
	|	ПоступилоПоЗаказуПокупателя.ОстатокПоЗакПок,
	|	ПоступилоПоЗаказуПоставщику.ПоступилоПоЗакПост,
	|	ПоступилоПоЗаказуПоставщику.ОстатокПоЗакПост");
	
	Запрос.Параметры.Вставить("ДатаНач", ДатаНач);
	Запрос.Параметры.Вставить("ДатаКон", ДатаКон);
	Запрос.Параметры.Вставить("ЗаказПоставщику", ЗаказПоставщику);
	Запрос.Параметры.Вставить("ЗаказПокупателя", ЗаказПокупателя);
	Запрос.Параметры.Вставить("Номенклатура", Номенклатура);
	
	РезЗапроса = Запрос.Выполнить();
	
	Выборка = РезЗапроса.Выбрать();
	
	Ответ = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		
		Ответ.Вставить("ОстатокПоЗакПоставщику", Выборка.ОстатокПоЗакПоставщику);
		Ответ.Вставить("ОстатокПоЗакПокупателя", Выборка.ОстатокПоЗакПокупателя);
		Возврат Ответ;
		
	Иначе
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

Функция НайтиПоступлениеПоНомеруВходящегоДокумента(НомерВходящегоДокумента, ДатаВходящегоДокумента, ПроверятьНомерБезпробелов = Ложь)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И (ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|     ИЛИ ПоступлениеТоваровУслуг.НомерВходящегоДокумента = &НомерВходящегоДокументаБезПробелов) 
	|	И ПоступлениеТоваровУслуг.ДатаВходящегоДокумента = &ДатаВходящегоДокумента");
	
	Запрос.Параметры.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
	Запрос.Параметры.Вставить("ДатаВходящегоДокумента", НачалоДня(ДатаВходящегоДокумента));
	Запрос.Параметры.Вставить("НомерВходящегоДокументаБезПробелов", ?(ПроверятьНомерБезпробелов, СокрЛП(НомерВходящегоДокумента), НомерВходящегоДокумента));
    
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Функция НайтиПоступлениеТОХПоНомеруВходящегоДокумента(НомерВходящегоДокумента, ДатаВходящегоДокумента, ПроверятьНомерБезпробелов = Ложь)
	
	Запрос = Новый Запрос("ВЫБРАТЬ	
	|	ПоступлениеТоваровНаОтветственноеХранение.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровНаОтветственноеХранение КАК ПоступлениеТоваровНаОтветственноеХранение
	|ГДЕ
	|	ПоступлениеТоваровНаОтветственноеХранение.ПометкаУдаления = ЛОЖЬ
	|	И (ПоступлениеТоваровНаОтветственноеХранение.НомерВходящегоДокумента = &НомерВходящегоДокумента
	|     ИЛИ ПоступлениеТоваровНаОтветственноеХранение.НомерВходящегоДокумента = &НомерВходящегоДокументаБезПробелов) 
	|	И ПоступлениеТоваровНаОтветственноеХранение.ДатаВходящегоДокумента = &ДатаВходящегоДокумента");
	
	Запрос.Параметры.Вставить("НомерВходящегоДокумента", НомерВходящегоДокумента);
	Запрос.Параметры.Вставить("ДатаВходящегоДокумента", НачалоДня(ДатаВходящегоДокумента));
	Запрос.Параметры.Вставить("НомерВходящегоДокументаБезПробелов", ?(ПроверятьНомерБезпробелов, СокрЛП(НомерВходящегоДокумента), НомерВходящегоДокумента));

	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Процедура ЗагрузкаПоступленийПоДаннымИзСтороннейБазы(ВидОперации = "", Склад = Неопределено) 
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("НомерДокумента");
	ТЗНоменклатуры.Колонки.Добавить("ДатаДокумента");
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура");
	ТЗНоменклатуры.Колонки.Добавить("Артикул"); //НормализованныйКод				
	ТЗНоменклатуры.Колонки.Добавить("Количество");
	ТЗНоменклатуры.Колонки.Добавить("Комментарий");
	ТЗНоменклатуры.Колонки.Добавить("Цена");
	ТЗНоменклатуры.Колонки.Добавить("НомерГТДКод");
	ТЗНоменклатуры.Колонки.Добавить("СтранаПроисхожденияКод");
	ТЗНоменклатуры.Колонки.Добавить("СФНомер");
	ТЗНоменклатуры.Колонки.Добавить("СФДата");
	ТЗНоменклатуры.Колонки.Добавить("ЗаказПоставщика");
	ТЗНоменклатуры.Колонки.Добавить("ИДДокументаВСмежнойБазе");
	ТЗНоменклатуры.Колонки.Добавить("Сумма");
	ТЗНоменклатуры.Колонки.Добавить("СуммаНДС");
	ТЗНоменклатуры.Колонки.Добавить("НазначениеСтруктура");
	ТЗНоменклатуры.Колонки.Добавить("Назначение");
	ТЗНоменклатуры.Колонки.Добавить("ГМСтруктура");
	ТЗНоменклатуры.Колонки.Добавить("ГМ");
	ТЗНоменклатуры.Колонки.Добавить("ДоговорПоставщикаТОХКодМДМ");
	ТЗНоменклатуры.Колонки.Добавить("НомерСкладскогоДокумента");
	
	//+Шульман А. 16.12.2024 #UT10-4995 
	ТЗНоменклатуры.Колонки.Добавить("ВидПроцесса", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПроцессов"));
	ТЗНоменклатуры.Колонки.Добавить("Филиал");
	
	//+Кабанов А.В. 23.06.2025 # UT10-5295
	ТЗНоменклатуры.Колонки.Добавить("ВозвратПоставщикуБезРазбораВГП");
	//-Кабанов А.В. 23.06.2025 # UT10-5295
	
	//+Белов А. 11.01.2025 #UT10-5006
	ТЗНоменклатуры.Колонки.Добавить("МассивТЕ");
	//-Белов А. 11.01.2025 #UT10-5006
	
	СоотвВидПроцесса = Новый Соответствие;
	СоотвВидПроцесса.Вставить("Возврат неликвида ТОХ через WMS", Перечисления.ВидыПроцессов.ВозвратНеликвидаТОХчерезWMS);
	СоотвВидПроцесса.Вставить("Перемещение неликвида ТОХ в ГП", Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП);
	//-Шульман А. 16.12.2024 #UT10-4995 
	
	Результат = МСКWEB.ПолучитьРеализацииВСтороннейБазе(Ложь, ВидОперации,Склад);
	
	//Обработка таблицы с ответом
	Если Результат.Загружен Тогда
		
		СписокДанных = Результат.СписокДанных;    
		
		Для Каждого Элем Из СписокДанных Цикл
			
			НовСтрока = ТЗНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Элем);
			НовСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Элем.Артикул); //НормализованныйКод 
			
			Если ЗначениеЗаполнено(Элем.ЗаказПокупателя) Тогда
				НовСтрока.ЗаказПоставщика = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ГУИДЗаказаПокупателя",Элем.ЗаказПокупателя);
			КонецЕсли;
			
			//+Шульман А. 16.12.2024 #UT10-4995  
			НовСтрока.ВидПроцесса = СоотвВидПроцесса.Получить(Элем.ВидПроцесса);       
			
			Если Не ПустаяСтрока(Элем.КодМДМФилиала) Тогда
				//И НовСтрока.ВидПроцесса = Перечисления.ВидыПроцессов.ПеремещениеНеликвидаТОХвГП Тогда
				НовСтрока.Филиал = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", Элем.КодМДМФилиала);
			КонецЕсли;
			//-Шульман А. 16.12.2024 #UT10-4995 
			
			//+Кабанов А.В. 23.06.2025 # UT10-5295
			Если Элем.Свойство("ВозвратПоставщикуБезРазбораВГП") Тогда
				НовСтрока.ВозвратПоставщикуБезРазбораВГП = Элем.ВозвратПоставщикуБезРазбораВГП;
			КонецЕсли;
			//-Кабанов А.В. 23.06.2025 # UT10-5295
			
		КонецЦикла;		
		
	КонецЕсли;
	
	Если ТЗНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+Макрушин Е. 24.09.2025 #UT10-5441
	Если Результат.Свойство("ДополнительныеДанные") И Результат.ДополнительныеДанные.Свойство("КодыМаркировки") Тогда
		тзКодыМаркировки = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(Результат.ДополнительныеДанные.КодыМаркировки);
	Иначе
		тзКодыМаркировки = Неопределено;
	КонецЕсли;
	//-Макрушин Е. 24.09.2025 #UT10-5441
	
	НомерДокумента = "";
	ДокПоступление = Неопределено;
	//+Гавриленков В. 05.02.2026 #UT10-5682
	//ДокЗаказ = Неопределено;      
	//-Гавриленков В. 05.02.2026 #UT10-5682
	ЗаказОбъект = Неопределено;
	ЕстьДокумент = Ложь;
	ЗаказПоставщикуЕстьЭкспресс = Ложь;
	ДоговорПоставщикаТОХКодМДМ = "";  
	ЭтоПополнениеТОХ = Ложь; 
	ДокПоступлениеТОХ = Неопределено;
	НомерСкладскогоДокументаТОХ = "";
	
	Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(СтрТЗ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;		
		
		Если НомерДокумента <> СтрТЗ.НомерДокумента Тогда 
			
			//+Гавриленков В. 05.02.2026 #UT10-5682
			ДокЗаказ = Неопределено;      
			//-Гавриленков В. 05.02.2026 #UT10-5682
			
			НомерДокумента = СтрТЗ.НомерДокумента;
			ДатаДокумента  = Дата(СтрТЗ.ДатаДокумента);    
			
			//+Шульман А. 16.12.2024 #UT10-4995 
			Филиал = СтрТЗ.Филиал;
			ВидПроцесса = СтрТЗ.ВидПроцесса;
			//-Шульман А. 16.12.2024 #UT10-4995
			
			//+Кабанов А.В. 23.06.2025 # UT10-5295
			мВозвратПоставщикуБезРазбораВГП = СтрТЗ.ВозвратПоставщикуБезРазбораВГП;
			//-Кабанов А.В. 23.06.2025 # UT10-5295
			
			Если НЕ ТЗНоменклатуры.Колонки.Найти("НомерСкладскогоДокумента") = Неопределено Тогда				
				НомерСкладскогоДокументаТОХ  = СтрТЗ.НомерСкладскогоДокумента;
			Иначе
				НомерСкладскогоДокументаТОХ = "";
			КонецЕсли;

			Если НЕ ДокПоступление = Неопределено Тогда
				
				ДокПоступление.Экспресс = ЗаказПоставщикуЕстьЭкспресс;
				ПроверитьСуммуСНДСУТ10(ТЗНоменклатуры, ДокПоступление.Товары, ДокПоступление.ИДДокументаВСмежнойБазе); 
				
				ТранзитнаяПоставкаЧерезСкладWMS = Ложь;
				
				Если ДокПоступление.Товары.Количество() > 0 Тогда
					
					Для Каждого Строка Из ДокПоступление.Товары Цикл
						
						Если ЗначениеЗаполнено(Строка.ЗаказПоставщику) и Строка.ЗаказПоставщику.ТранзитнаяПоставкаЧерезСкладWMS Тогда
							
							ТранзитнаяПоставкаЧерезСкладWMS = Истина;
							Прервать;
							
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					Если ЗначениеЗаполнено(ДокПоступление.Сделка) и ДокПоступление.Сделка.ТранзитнаяПоставкаЧерезСкладWMS Тогда
						ТранзитнаяПоставкаЧерезСкладWMS = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
				УстановитьПривилегированныйРежим(Истина);
				
				ДокПоступление.Записать(РежимЗаписиДокумента.Запись); 
				
				//+Кабанов А.В. 12.11.2024 #UT10-4872	
				Попытка			
					ДокПоступление.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				Исключение
				КонецПопытки;
				//-Кабанов А.В. 12.11.2024 #UT10-4872
				
				//+Сёмин Р.И. 25.06.2026 #UT10-5899
				ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление);
				//-Сёмин Р.И. 25.06.2026 #UT10-5899
				
				УстановитьПривилегированныйРежим(Ложь);
				
				Если ТранзитнаяПоставкаЧерезСкладWMS Тогда
					
					Попытка
						Результат = МСКWEB.ОтправитьПТУВУТ11(ДокПоступление.Ссылка);
					Исключение
						ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьИнвойсПо4Транзиту", УровеньЖурналаРегистрации.Ошибка,,,
						"Ошибка получения ответа после отправки ПТУ в стороннюю УТ11: " + ОписаниеОшибки());
					КонецПопытки;
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Если НЕ ДокПоступлениеТОХ = Неопределено Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				ДокПоступлениеТОХ.Записать(РежимЗаписиДокумента.Запись); 
				
				//+Кабанов А.В. 12.11.2024 #UT10-4872	
				Попытка			
					ДокПоступлениеТОХ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
				КонецПопытки;
				//-Кабанов А.В. 12.11.2024 #UT10-4872

				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;  
			
			Если НЕ ТЗНоменклатуры.Колонки.Найти("ДоговорПоставщикаТОХКодМДМ") = Неопределено Тогда				
				ДоговорПоставщикаТОХКодМДМ = СтрТЗ.ДоговорПоставщикаТОХКодМДМ;
			Иначе
				ДоговорПоставщикаТОХКодМДМ = "";
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДоговорПоставщикаТОХКодМДМ) Тогда
				
				ЕстьДоговорПоставщикаТОХ = Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("КодМДМ", ДоговорПоставщикаТОХКодМДМ);
				
				Если Не ЕстьДоговорПоставщикаТОХ.Пустая() Тогда
					
					ПоставщикТОХ = Справочники.ПоставщикиТОХ.НайтиПоРеквизиту("ДоговорКонтрагента", ЕстьДоговорПоставщикаТОХ);
					
					Если НЕ ПоставщикТОХ.Пустая() Тогда
						ЭтоПополнениеТОХ = Истина; 
					Иначе
						
						ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьПополнениеТОХ", УровеньЖурналаРегистрации.Ошибка,,, "Не найден поставщик ТОХ с договором "
						+ СокрЛП(ЕстьДоговорПоставщикаТОХ.Наименование));
						Возврат;
						
					КонецЕсли;
					
				Иначе
					
					ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьПополнениеТОХ", УровеньЖурналаРегистрации.Ошибка,,, "Не найден договор поставщика ТОХ с кодом МДМ "
					+ СокрЛП(ДоговорПоставщикаТОХКодМДМ));
					Возврат;
					
				КонецЕсли;  
				
			Иначе
				ЭтоПополнениеТОХ = Ложь;					
			КонецЕсли; 

			Если ЭтоПополнениеТОХ Тогда  
						
					ЕстьДокумент = НайтиПоступлениеТОХПоНомеруВходящегоДокумента(НомерДокумента, ДатаДокумента, Истина);
					
					Если ЕстьДокумент Тогда
						Продолжить;
					КонецЕсли;
					
					ДокПоступлениеТОХ = Документы.ПоступлениеТоваровНаОтветственноеХранение.СоздатьДокумент(); 
					ДокПоступлениеТОХ.Ответственный	           = ПараметрыСеанса.ТекущийПользователь;
					ДокПоступлениеТОХ.Дата			           = ТекущаяДата();
					ДокПоступлениеТОХ.ВалютаДокумента          = Справочники.Валюты.НайтиПоКоду("643");
					ДокПоступлениеТОХ.Контрагент               = ПоставщикТОХ.Контрагент;
					ДокПоступлениеТОХ.ДоговорКонтрагента       = ПоставщикТОХ.ДоговорКонтрагента;
					ДокПоступлениеТОХ.КратностьВзаиморасчетов  = 1;
					ДокПоступлениеТОХ.КурсВзаиморасчетов       = 1;
					ДокПоступлениеТОХ.Организация              = ПоставщикТОХ.ДоговорКонтрагента.Организация;
					ДокПоступлениеТОХ.Склад                    = Константы.ОсновнойСклад.Получить();
					ДокПоступлениеТОХ.ДатаВходящегоДокумента   = ДатаДокумента; 
					ДокПоступлениеТОХ.НомерВходящегоДокумента  = СокрЛП(НомерДокумента);
					ДокПоступлениеТОХ.НомерСкладскогоДокумента = ?(ЗначениеЗаполнено(НомерСкладскогоДокументаТОХ), НомерСкладскогоДокументаТОХ, СокрЛП(НомерДокумента));  
					
					//+Шульман А. 16.12.2024 #UT10-4995 
					//ДокПоступлениеТОХ.Комментарий 			   = "Создан авт. по реализации в стор.базе " + ТекущаяДата();
					ДокПоступлениеТОХ.Филиал = Филиал;
					ДокПоступлениеТОХ.ВидПроцесса = ВидПроцесса; 
					
					//+Кабанов А.В. 23.06.2025 # UT10-5295
					ДокПоступлениеТОХ.ВозвратПоставщикуБезРазбораВГП = мВозвратПоставщикуБезРазбораВГП;
					//-Кабанов А.В. 23.06.2025 # UT10-5295
					
					ДокПоступлениеТОХ.Комментарий 	   = "Создан авт. по реализации в стор.базе " + Строка(Филиал) + " " + ТекущаяДата();
					//-Шульман А. 16.12.2024 #UT10-4995 
					
			Иначе
				
				Если ЗаказОбъект <> Неопределено И ТипЗнч(ЗаказОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
					ЗаказПоставщикуЕстьЭкспресс = ЗаказОбъект.Экспресс;	 
				Иначе
					ЗаказПоставщикуЕстьЭкспресс = Ложь;
				КонецЕсли; 
				
				ЕстьДокумент = НайтиПоступлениеПоИДДокументаВСмежнойБазе(СтрТЗ.ИДДокументаВСмежнойБазе);
				
				Если ЕстьДокумент Тогда
					
					ЕстьДокументПТУ = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", СтрТЗ.ИДДокументаВСмежнойБазе);
					
					Если НЕ ЕстьДокументПТУ.НомерВходящегоДокумента = СокрЛП(НомерДокумента) 
						ИЛИ НЕ ЕстьДокументПТУ.НомерСкладскогоДокумента = ?(СтрТЗ.СФНомер = "", СокрЛП(НомерДокумента), СтрТЗ.СФНомер) Тогда
						
						ДокПоступлениеОбъект = ЕстьДокументПТУ.ПолучитьОбъект();						
						ДокПоступлениеОбъект.НомерВходящегоДокумента  = СокрЛП(НомерДокумента);
						ДокПоступлениеОбъект.НомерСкладскогоДокумента = ?(СтрТЗ.СФНомер = "", СокрЛП(НомерДокумента), СтрТЗ.СФНомер);  
						
						УстановитьПривилегированныйРежим(Истина);
						ДокПоступлениеОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						//+Кабанов А.В. 12.11.2024 #UT10-4872	
						Попытка			
							ДокПоступлениеОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
						Исключение
						КонецПопытки;
						//-Кабанов А.В. 12.11.2024 #UT10-4872
						
						УстановитьПривилегированныйРежим(Ложь);
						
						//+Сёмин Р.И. 05.06.2026 #UT10-5899
						ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление);
						//-Сёмин Р.И. 05.06.2026 #UT10-5899
						
					КонецЕсли;
					
					Продолжить; 
					
				КонецЕсли;
				
				ЕстьДокумент = НайтиПоступлениеПоНомеруВходящегоДокумента(НомерДокумента, ДатаДокумента, Истина);
				
				Если ЕстьДокумент Тогда
					Продолжить;
				КонецЕсли;
				
				ДокПоступление = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
				ДокПоступление.Организация = Константы.ОсновнаяОрганизация.Получить();
				ДокПоступление.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
				ДокПоступление.СкладОрдер = Константы.ОсновнойСклад.Получить();
				
				Если НЕ Склад = Неопределено Тогда
					
					ДокПоступление.Контрагент = Склад.Поставщик;
					
					Если ЗначениеЗаполнено(Склад.ДоговорКонтрагента) Тогда
						ДокПоступление.ДоговорКонтрагента =	Склад.ДоговорКонтрагента;
					КонецЕсли;
					
				Иначе				
					ДокПоступление.Контрагент = Константы.ДопПоставщик.Получить();
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ДокПоступление.ДоговорКонтрагента) Тогда 
					ДокПоступление.ДоговорКонтрагента = ДокПоступление.Контрагент.ОсновнойДоговорКонтрагента;
				КонецЕсли; 
				
				Если НЕ ДокПоступление.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
					
					СтруктураПараметровДляПолученияДоговора = Новый Структура();
					СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
					СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
					СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
					ДокПоступление.ДоговорКонтрагента = ЗаполнениеДокументов.ПолучитьДоговорПоОрганизацииИКонтрагенту(ДокПоступление.Организация, 
					                       ДокПоступление.Контрагент, СтруктураПараметровДляПолученияДоговора);
					
					Если ДокПоступление.ДоговорКонтрагента.Пустая() Тогда
						ДокПоступление.ДоговорКонтрагента = ДокПоступление.Контрагент.ОсновнойДоговорКонтрагента; 
					КонецЕсли;				
					
				КонецЕсли;
				
				ДокПоступление.ВалютаДокумента = ДокПоступление.ДоговорКонтрагента.ВалютаВзаиморасчетов;
				//+Кабанов А.В. 13.11.2024 #UT10-4872	
				//ДокПоступление.Дата = НачалоДня(ТекущаяДата() + 60 * 60 * 24);
				ДокПоступление.Дата = ТекущаяДата();				
				//+Кабанов А.В. 13.11.2024 #UT10-4872	
				ДокПоступление.КратностьВзаиморасчетов = 1;
				ДокПоступление.КурсВзаиморасчетов  = 1;	
				ДокПоступление.ОтражатьВУправленческомУчете = Истина;
				ДокПоступление.ОтражатьВБухгалтерскомУчете = Истина;
				ДокПоступление.ОтражатьВНалоговомУчете = Истина;
				ДокПоступление.УчитыватьНДС = Истина;
				ДокПоступление.СуммаВключаетНДС = Истина;
				ДокПоступление.Комментарий = ?(НЕ Склад = Неопределено, СокрЛП(Склад.Наименование) + " ", "") + "Создан авт. по реализации в стор.базе " + ТекущаяДата(); 
				ДокПоступление.НомерВходящегоДокумента  = СокрЛП(НомерДокумента);
				ДокПоступление.НомерСкладскогоДокумента = ?(СтрТЗ.СФНомер = "", СокрЛП(НомерДокумента), СтрТЗ.СФНомер);  
				ДокПоступление.ДатаВходящегоДокумента = ДатаДокумента;
				ДокПоступление.Ответственный = глЗначениеПеременной("глТекущийПользователь");
				ДокПоступление.ИДДокументаВСмежнойБазе = СтрТЗ.ИДДокументаВСмежнойБазе;
				
				//+Марков И. 09.06.2026 #UT10-5916
				Если ТипЗнч(СтрТЗ.МассивТЕ) = Тип("Массив") Тогда
					
					ТаблицаТЕ = Новый ТаблицаЗначений();
					ТаблицаТЕ.Колонки.Добавить("ТранспортнаяЕдиница", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(50)));
					ТаблицаТЕ.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3,ДопустимыйЗнак.Любой)));
					
					Для Каждого ЭлементМассива Из СтрТЗ.МассивТЕ Цикл
						
						НоваяСтрокаТЕ = ТаблицаТЕ.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаТЕ, ЭлементМассива);
						
					КонецЦикла;	
					
					Запрос = Новый Запрос();
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВТ_МассивТЕ.ТранспортнаяЕдиница КАК ТранспортнаяЕдиница,
					|	ВТ_МассивТЕ.Вес КАК Вес
					|ПОМЕСТИТЬ ВТ_МассивТЕ
					|ИЗ
					|	&ТаблицаТЕ КАК ВТ_МассивТЕ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ВТ_МассивТЕ.ТранспортнаяЕдиница,
					|	ВТ_МассивТЕ.Вес
					|ИЗ
					|	ВТ_МассивТЕ КАК ВТ_МассивТЕ
					|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.УпаковочныеЛисты КАК ПоступлениеТоваровУслугУпаковочныеЛисты
					|		ПО ВТ_МассивТЕ.ТранспортнаяЕдиница = ПоступлениеТоваровУслугУпаковочныеЛисты.НомерWMS
					|			И (ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Дата >= НАЧАЛОПЕРИОДА(&Дата, ГОД))
					|			И (ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка.Проведен)
					|ГДЕ
					|	ПоступлениеТоваровУслугУпаковочныеЛисты.Ссылка ЕСТЬ NULL";
					
					Запрос.УстановитьПараметр("Дата", ТекущаяДата());
					Запрос.УстановитьПараметр("ТаблицаТЕ", ТаблицаТЕ);
					
					Выборка = Запрос.Выполнить().Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						НСтр = ДокПоступление.УпаковочныеЛисты.Добавить();
						НСтр.НомерWMS = Выборка.ТранспортнаяЕдиница;
						НСтр.Вес = Выборка.Вес;
						
					КонецЦикла;
										
				КонецЕсли;
				//-Марков И. 09.06.2026 #UT10-5916
				
				//+Макрушин Е. 24.09.2025 #UT10-5430
				ДополнитьДокументКодамиМаркировки(ДокПоступление, ДокПоступление.ИДДокументаВСмежнойБазе, тзКодыМаркировки);
				//-Макрушин Е. 24.09.2025 #UT10-5430
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если  ЕстьДокумент Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПополнениеТОХ Тогда  
			
			//+Кабанов А.В. 15.07.2025 # UT10-5323
			Если ЗначениеЗаполнено(СтрТЗ.ЗаказПоставщика) И (ДокЗаказ = Неопределено Или ДокЗаказ <> СтрТЗ.ЗаказПоставщика) Тогда 
				
				Если ЗаказОбъект <> Неопределено Тогда
					
					УстановитьПривилегированныйРежим(Истина);
					ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
					УстановитьПривилегированныйРежим(Ложь);
					
				КонецЕсли;			
				
				ДокЗаказ = СтрТЗ.ЗаказПоставщика;
				ЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.ЗагруженоПоступление = Истина;
				НомСклДок = ДокПоступлениеТОХ.НомерСкладскогоДокумента; 
				
				Если ЗначениеЗаполнено(НомСклДок) И Найти(ЗаказОбъект.Комментарий, НомСклДок) = 0 Тогда 
					ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + ", " + НомСклДок;
				КонецЕсли;
				
			КонецЕсли;
			//-Кабанов А.В. 15.07.2025 # UT10-5323
			
			СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СтрТЗ.НомерГТДКод, Истина,, СтрТЗ.Номенклатура);
			
			Если СерияНоменклатуры.Пустая() Тогда
				
				НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СтрТЗ.НомерГТДКод);
				Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрТЗ.СтранаПроисхожденияКод);
				СерияНоменклатуры = СоздатьСерию(СтрТЗ.Номенклатура, СтрТЗ.НомерГТДКод, Страна, НомерГТДСсылка);
				
			КонецЕсли;  
			
			НовСтрока                   = ДокПоступлениеТОХ.Товары.Добавить(); 			
			НовСтрока.Номенклатура      = СтрТЗ.Номенклатура;
			НовСтрока.ЕдиницаИзмерения  = НовСтрока.Номенклатура.ЕдиницаХраненияОстатков; 
			НовСтрока.Коэффициент		= НовСтрока.ЕдиницаИзмерения.Коэффициент;
			НовСтрока.СерияНоменклатуры = СерияНоменклатуры ;				
			НовСтрока.Количество        = СтрТЗ.Количество;
			НовСтрока.Цена              = СтрТЗ.Цена;
			//+Гавриленков В. 25.07.2025 #UT10-5355
			Если Не ДокЗаказ = Неопределено Тогда
				//+Кабанов А.В. 15.07.2025 # UT10-5323
				НовСтрока.ЗаказПоставщику   = ДокЗаказ.Ссылка;
				//+Кабанов А.В. 15.07.2025 # UT10-5323  
			КонецЕсли;
			//-Гавриленков В. 25.07.2025 #UT10-5355
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ЭтотОбъект); 
			
		Иначе

			Если ЗначениеЗаполнено(СтрТЗ.ЗаказПоставщика) И (ДокЗаказ = Неопределено Или ДокЗаказ <> СтрТЗ.ЗаказПоставщика) Тогда 
				
				Если ЗаказОбъект <> Неопределено Тогда
					
					УстановитьПривилегированныйРежим(Истина);
					ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
					УстановитьПривилегированныйРежим(Ложь);
					
				КонецЕсли;			
				
				ДокЗаказ = СтрТЗ.ЗаказПоставщика;
				ЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
				ЗаказОбъект.ОбменДанными.Загрузка = Истина;
				ЗаказОбъект.ЗагруженоПоступление = Истина;
				НомСклДок = ДокПоступление.НомерСкладскогоДокумента; 
				
				Если ЗначениеЗаполнено(НомСклДок) И Найти(ЗаказОбъект.Комментарий, НомСклДок) = 0 Тогда 
					ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + ", " + НомСклДок;
				КонецЕсли;
				
				Если Не ЗаказПоставщикуЕстьЭкспресс Тогда
					ЗаказПоставщикуЕстьЭкспресс = ЗаказОбъект.Экспресс;		
				КонецЕсли; 
				
			КонецЕсли;
			
			СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СтрТЗ.НомерГТДКод, Истина,, СтрТЗ.Номенклатура);
			
			Если СерияНоменклатуры.Пустая() Тогда
				
				НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СтрТЗ.НомерГТДКод);
				Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрТЗ.СтранаПроисхожденияКод);
				СерияНоменклатуры = СоздатьСерию(СтрТЗ.Номенклатура, СтрТЗ.НомерГТДКод, Страна, НомерГТДСсылка);
				
			КонецЕсли;   
			
			ГМ = "";
			
			Если ЗначениеЗаполнено(СтрТЗ.ГМСтруктура) И ТипЗнч(СтрТЗ.ГМСтруктура) = Тип("Структура") Тогда
				
				ДатаГМ = СтрТЗ.ГМСтруктура.Дата;    
				
				Если ТипЗнч(ДатаГМ) = Тип("Строка") Тогда
					ДатаГМ = ARMStoreKeeper.ПреобразоватьДату(ДатаГМ);		
				КонецЕсли; 
				
				ГМ = Формат(ДатаГМ,"ДФ=ddMMyyyyЧЧммсс") + "1" + Формат(Число(СтрТЗ.ГМСтруктура.Номер),"ЧЦ=10; ЧВН=; ЧГ=0"); 
				
			КонецЕсли; 				
			
			//ЗаполнениеТЧ
			НужноОприходовать = СтрТЗ.Количество; 
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура",СтрТЗ.Номенклатура);  
			
			Если ДокЗаказ <> Неопределено Тогда 			
				Рез = ДокЗаказ.Товары.НайтиСтроки(Отбор);						
			Иначе			
				Рез = Новый Массив;			
			КонецЕсли;
			
			КолвоСтрок = Рез.Количество();
			ТекСтрока = 0;
			
			Если Рез.Количество() = 0 Тогда
				
				//Излишек
				НовСтрока = ДокПоступление.Товары.Добавить();
				НовСтрока.Номенклатура = СтрТЗ.Номенклатура; 
				НовСтрока.СерияНоменклатуры = СерияНоменклатуры; 
				НовСтрока.Количество = НужноОприходовать;
				НовСтрока.Цена = СтрТЗ.Цена;
				НовСтрока.ЕдиницаИзмерения = НовСтрока.Номенклатура.ЕдиницаХраненияОстатков; 
				НовСтрока.Коэффициент = НовСтрока.ЕдиницаИзмерения.Коэффициент;
				//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
				//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
				НовСтрока.СтавкаНДС =  УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
				//-Гавриленков В. 18.12.2025 #UT10-5598
				НовСтрока.ГМ = ГМ;
				ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
				ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
				ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);
				НужноОприходовать = 0;          
				
			Иначе		
				
				Для Каждого СтрРез Из Рез Цикл  
					
					ТекСтрока = ТекСтрока + 1;
					
					Если ЗначениеЗаполнено(СтрТЗ.НазначениеСтруктура) И ТипЗнч(СтрТЗ.НазначениеСтруктура) = Тип("Структура") И ЗначениеЗаполнено(СтрРез.Заказ) Тогда 
						
						Если (СтрРез.Заказ.Номер <> СтрТЗ.НазначениеСтруктура.НомерЗаказа) Тогда
							Продолжить;
						КонецЕсли;     
						
					Иначе 
						
						Если ЗначениеЗаполнено(СтрРез.Заказ) И СтрРез.Заказ.ОбособленнаяОтгрузкаГМИзСтороннегоФилиала Тогда
							Продолжить;	
						КонецЕсли;
						
					КонецЕсли; 				
					
					//Получение остатка по заказам
					Ответ = ПолучитьОстатокПоЗаказу(СтрТЗ.Номенклатура, ДокЗаказ, СтрРез.Заказ);
					
					Если Ответ = 0 Тогда
						
						ОстатокПоЗакПоставщику = 0;
						ОстатокПоЗакПокупателя = 0;
						
					Иначе
						
						ОстатокПоЗакПоставщику = Ответ.ОстатокПоЗакПоставщику;
						ОстатокПоЗакПокупателя = Ответ.ОстатокПоЗакПокупателя;
						
					КонецЕсли;				
					
					//Минусуем уже распределенное колво по заказам в рамках документа
					ОтборДок = Новый Структура();
					ОтборДок.Вставить("Номенклатура", СтрРез.Номенклатура);
					СтрокиДок = ДокПоступление.Товары.НайтиСтроки(ОтборДок);
					
					Для Каждого СтрДок Из СтрокиДок Цикл
						
						Если СтрДок.Заказ = СтрРез.Заказ Тогда
							ОстатокПоЗакПокупателя = ОстатокПоЗакПокупателя - СтрДок.Количество;
						КонецЕсли;
						
						Если СтрДок.ЗаказПоставщику = ДокЗаказ.Ссылка Тогда 
							ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - СтрДок.Количество;
						КонецЕсли;					
						
					КонецЦикла;
					
					Если ТекСтрока = КолвоСтрок Тогда
						
						//Распределяем весь приход в цикле на последнюю строку
						Пока НужноОприходовать > 0 Цикл						
							
							НовСтрока = ДокПоступление.Товары.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтрока, СтрРез);
							НовСтрока.Цена = СтрТЗ.Цена; 
							//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
							//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
							НовСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
							//-Гавриленков В. 18.12.2025 #UT10-5598
							НовСтрока.СерияНоменклатуры = СерияНоменклатуры;
							
							Если ОстатокПоЗакПокупателя > 0 Тогда 
								
								НовСтрока.Заказ = СтрРез.Заказ;
								НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка; 
								НовСтрока.Количество = Мин(ОстатокПоЗакПокупателя, НужноОприходовать);
								ОстатокПоЗакПокупателя = ОстатокПоЗакПокупателя - НовСтрока.Количество;
								ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - НовСтрока.Количество;
								
							ИначеЕсли ОстатокПоЗакПоставщику > 0 Тогда
								
								НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
								НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка;
								НовСтрока.Количество = Мин(ОстатокПоЗакПоставщику, НужноОприходовать);
								ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - НовСтрока.Количество;
								
							Иначе
								
								НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
								НовСтрока.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
								НовСтрока.Количество = НужноОприходовать;					
								
							КонецЕсли;   
							
							НовСтрока.ГМ = ГМ;
							ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
							ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);					
							
							НужноОприходовать = НужноОприходовать - НовСтрока.Количество;
							
						КонецЦикла;
						
					ИначеЕсли НужноОприходовать > 0 Тогда
						
						//Один проход распределения
						НовСтрока = ДокПоступление.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрока, СтрРез);
						НовСтрока.Цена = СтрТЗ.Цена;
						//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
						//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
						НовСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
						//-Гавриленков В. 18.12.2025 #UT10-5598
						НовСтрока.СерияНоменклатуры = СерияНоменклатуры;
						
						Если ОстатокПоЗакПокупателя > 0 Тогда 
							
							НовСтрока.Заказ = СтрРез.Заказ;
							НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка; 
							НовСтрока.Количество = Мин(ОстатокПоЗакПокупателя, НужноОприходовать);
							
						ИначеЕсли ОстатокПоЗакПоставщику > 0 Тогда
							
							НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
							НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка;
							НовСтрока.Количество = Мин(ОстатокПоЗакПоставщику, НужноОприходовать);
							
						Иначе
							
							НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
							НовСтрока.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
							НовСтрока.Количество = НужноОприходовать;					
							
						КонецЕсли;  
						
						НовСтрока.ГМ = ГМ;
						
						ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
						
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);					
						НужноОприходовать = НужноОприходовать - НовСтрока.Количество;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;                      
	
	//Запишем документы для последней строки таблицы
	Если ДокПоступление <> Неопределено Тогда		
		
		ДокПоступление.Экспресс = ЗаказПоставщикуЕстьЭкспресс;
		ПроверитьСуммуСНДСУТ10(ТЗНоменклатуры, ДокПоступление.Товары, ДокПоступление.ИДДокументаВСмежнойБазе); 
		
		ТранзитнаяПоставкаЧерезСкладWMS = Ложь;
		
		Если ДокПоступление.Товары.Количество() > 0 Тогда
			
			Для Каждого Строка Из ДокПоступление.Товары Цикл
				
				Если ЗначениеЗаполнено(Строка.ЗаказПоставщику) и Строка.ЗаказПоставщику.ТранзитнаяПоставкаЧерезСкладWMS Тогда
					
					ТранзитнаяПоставкаЧерезСкладWMS = Истина;
					Прервать;
					
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Если ЗначениеЗаполнено(ДокПоступление.Сделка) и ДокПоступление.Сделка.ТранзитнаяПоставкаЧерезСкладWMS Тогда
				ТранзитнаяПоставкаЧерезСкладWMS	= Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
		ДокПоступление.Записать(РежимЗаписиДокумента.Запись); 
		
		//+Кабанов А.В. 12.11.2024 #UT10-4872	
		Попытка			
			ДокПоступление.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
		//-Кабанов А.В. 12.11.2024 #UT10-4872
		
		УстановитьПривилегированныйРежим(Ложь);
		
		//+Сёмин Р.И. 05.06.2026 #UT10-5899
		ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление);
		//-Сёмин Р.И. 05.06.2026 #UT10-5899
		
		Если ТранзитнаяПоставкаЧерезСкладWMS Тогда
			
			Попытка
				Результат = МСКWEB.ОтправитьПТУВУТ11(ДокПоступление.Ссылка);
			Исключение
				ЗаписьЖурналаРегистрации("GoodsReserve.СоздатьИнвойсПо4Транзиту", УровеньЖурналаРегистрации.Ошибка,,,
				"Ошибка получения ответа после отправки ПТУ в стороннюю УТ11: " + ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаказОбъект <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если НЕ ДокПоступлениеТОХ = Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ДокПоступлениеТОХ.Записать(РежимЗаписиДокумента.Запись);
		
		//+Кабанов А.В. 12.11.2024 #UT10-4872	
		Попытка			
			ДокПоступлениеТОХ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
		//-Кабанов А.В. 12.11.2024 #UT10-4872
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиПоступлениеПоИДДокументаВСмежнойБазе(ИДДокументаВСмежнойБазе)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|ГДЕ
	|	ПоступлениеТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеТоваровУслуг.ИДДокументаВСмежнойБазе = &ИДДокументаВСмежнойБазе");
	
	Запрос.Параметры.Вставить("ИДДокументаВСмежнойБазе", ИДДокументаВСмежнойБазе);	
	
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

Процедура ПроверитьСуммуСНДС(ТЗНоменклатуры , ТоварыПоступления , ИДДокументаВСмежнойБазе);
	
	ВремТаблица = ТЗНоменклатуры.Скопировать();
	ВремТаблица.Свернуть("ИДДокументаВСмежнойБазе, Номенклатура, КодСтрокиУТ11, СуммаСНДС, СуммаНДС");
	
	Отбор = Новый Структура("ИДДокументаВСмежнойБазе", ИДДокументаВСмежнойБазе);	
	ВремТаблица = ВремТаблица.НайтиСтроки(Отбор);
	
	ТоварыПоступления.Сортировать("КодСтрокиУТ11 Возр, Сумма Убыв");
	
	Для Каждого СтрВрем Из ВремТаблица Цикл
		
		Отбор = Новый Структура("Номенклатура", СтрВрем.Номенклатура);
		Отбор.Вставить("КодСтрокиУТ11", СтрВрем.КодСтрокиУТ11);		
		СтрокиДок = ТоварыПоступления.НайтиСтроки(Отбор);
		
		Если СтрокиДок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПервСтрока = СтрокиДок[0];		
		СуммаПоКодуСтроки = 0;
		СуммаНДСПоКодуСтроки = 0;
		
		Для Каждого СтрДок Из СтрокиДок Цикл
			
			СуммаПоКодуСтроки = СуммаПоКодуСтроки + СтрДок.Сумма;
			СуммаНДСПоКодуСтроки = СуммаНДСПоКодуСтроки + СтрДок.СуммаНДС;
			
		КонецЦикла;
		
		РасхождСумма = СтрВрем.СуммаСНДС - СуммаПоКодуСтроки;
		РасхождСуммаНДС = СтрВрем.СуммаНДС - СуммаНДСПоКодуСтроки;
		
		ПервСтрока.Сумма = ПервСтрока.Сумма + РасхождСумма;
		ПервСтрока.СуммаНДС = ПервСтрока.СуммаНДС + РасхождСуммаНДС;		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСуммуСНДСУТ10(ТЗНоменклатуры, ТоварыПоступления, ИДДокументаВСмежнойБазе);  
	
	ВремТаблица = ТЗНоменклатуры.Скопировать();
	ВремТаблица.Свернуть("ИДДокументаВСмежнойБазе, Номенклатура, Назначение, ГМ", "Сумма, СуммаНДС");
	
	СуммаРаспределения = 0;
	СуммаНДСРаспределения = 0;
	
	Для Каждого СтрВрем из ВремТаблица Цикл
		
		СуммаРаспределения = СуммаРаспределения + СтрВрем.Сумма;
		СуммаНДСРаспределения = СуммаНДСРаспределения + СтрВрем.СуммаНДС;  
		
	КонецЦикла;
	
	МассивНоменклатуры = ТоварыПоступления.ВыгрузитьКолонку("Номенклатура"); 
	ОбщегоНазначения.УдалитьПовторяющиесяЭлементыМассива(МассивНоменклатуры); 
	
	Для Каждого ТекНоменклатура Из МассивНоменклатуры Цикл  
		
		Отбор = Новый Структура("Номенклатура, ИДДокументаВСмежнойБазе", ТекНоменклатура, ИДДокументаВСмежнойБазе);
		МассивТоварыВрем = ВремТаблица.НайтиСтроки(Отбор); 
		
		СуммаРаспределения = 0;
		СуммаНДСРаспределения = 0;
		
		Для Каждого Эл Из МассивТоварыВрем Цикл
			
			СуммаРаспределения = СуммаРаспределения + Эл.Сумма;
			СуммаНДСРаспределения = СуммаНДСРаспределения + Эл.СуммаНДС;  
			
		КонецЦикла;	 
		
		ОтборТовары = Новый Структура("Номенклатура", ТекНоменклатура);
		МассивТовары = ТоварыПоступления.НайтиСтроки(ОтборТовары);
		
		МассивКоэф = Новый Массив;
		
		Для Каждого ТекТовар Из МассивТовары Цикл
			МассивКоэф.Добавить(ТекТовар.Количество);
		КонецЦикла;
		
		МассивСумм = ОбщегоНазначения.РаспределитьПропорционально(СуммаРаспределения, МассивКоэф, 2);
		МассивСуммНДС = ОбщегоНазначения.РаспределитьПропорционально(СуммаНДСРаспределения, МассивКоэф, 2);	 
		
		Для сч = 0 По МассивТовары.ВГраница() Цикл
			
			МассивТовары[сч].Сумма = МассивСумм[сч];
			МассивТовары[сч].СуммаНДС = МассивСуммНДС[сч];
			
		КонецЦикла;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗагрузкаПоступленийПоДаннымИзСтороннейУТ11(ВидОперации = "", НомерЗаказаАварды = Неопределено, Склад = Неопределено)
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("НомерДокумента");
	ТЗНоменклатуры.Колонки.Добавить("ДатаДокумента");
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура");
	ТЗНоменклатуры.Колонки.Добавить("Артикул");				
	ТЗНоменклатуры.Колонки.Добавить("Количество");
	ТЗНоменклатуры.Колонки.Добавить("Комментарий");
	ТЗНоменклатуры.Колонки.Добавить("Цена");	
	ТЗНоменклатуры.Колонки.Добавить("НомерГТДКод");
	ТЗНоменклатуры.Колонки.Добавить("СтранаПроисхожденияКод");
	ТЗНоменклатуры.Колонки.Добавить("НомерWMS"); 
	ТЗНоменклатуры.Колонки.Добавить("ЗаказПоставщика");
	ТЗНоменклатуры.Колонки.Добавить("Экспресс");
	ТЗНоменклатуры.Колонки.Добавить("РасходныйОрдер");
	ТЗНоменклатуры.Колонки.Добавить("УпакЛистНомерWMS");
	ТЗНоменклатуры.Колонки.Добавить("КроссДокинг");
	ТЗНоменклатуры.Колонки.Добавить("ГУИДЗаказа");
	ТЗНоменклатуры.Колонки.Добавить("ТранзитнаяПоставка",Новый ОписаниеТипов("Булево"));
	ТЗНоменклатуры.Колонки.Добавить("ИДДокументаВСмежнойБазе",Новый ОписаниеТипов("Строка"));
	ТЗНоменклатуры.Колонки.Добавить("КодСтрокиУТ11",Новый ОписаниеТипов("Число"));
	ТЗНоменклатуры.Колонки.Добавить("СуммаСНДС");
	ТЗНоменклатуры.Колонки.Добавить("СуммаНДС");
	ТЗНоменклатуры.Колонки.Добавить("ПрямаяПоставка");
	ТЗНоменклатуры.Колонки.Добавить("КодМДМОрганизацииВСмежнойБазе",Новый ОписаниеТипов("Строка"));	 
	//+Шульман А. 23.04.2025 #UT10-5210  
	ТЗНоменклатуры.Колонки.Добавить("ПремиальнаяПерекупка",Новый ОписаниеТипов("Булево"));
	//-Шульман А. 23.04.2025 #UT10-5210 
	
	Результат = МСКWEB.ПолучитьРеализацииВСтороннейБазе(Истина, ВидОперации, Склад); 
	
	//Обработка таблицы с ответом
	Если Результат.Загружен Тогда
		
		СписокДанных = Результат.СписокДанных;
		
		Для Каждого Элем Из СписокДанных Цикл
			
			Если ЗначениеЗаполнено(НомерЗаказаАварды) И СокрЛП(НомерЗаказаАварды) <> СокрЛП(Элем.НомерWMS) Тогда
				Продолжить;
			КонецЕсли;			
			
			НовСтрока = ТЗНоменклатуры.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,Элем);			
			НовСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Элем.Артикул);
			
			Если НЕ ЗначениеЗаполнено(НовСтрока.Номенклатура) И Прав(Элем.Артикул,3) = "DMG" Тогда 				
				
				НовСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Сред(Элем.Артикул, 1, СтрДлина(Элем.Артикул) - 3));
				НовСтрока.СтранаПроисхожденияКод = "";
				НовСтрока.НомерГТДКод = "--";
				
			КонецЕсли;
			
			Если Элем.КроссДокинг Тогда 
				
				Если ЗначениеЗаполнено(Элем.ГУИДЗаказа) Тогда 				
					НовСтрока.ЗаказПоставщика = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ГУИДЗаказаПокупателя", Элем.ГУИДЗаказа);
				КонецЕсли;
				
			Иначе 
				
				Если ЗначениеЗаполнено(Элем.ЗаказПокупателя) Тогда
					НовСтрока.ЗаказПоставщика = Документы.ЗаказПоставщику.НайтиПоРеквизиту("ГУИДЗаказаПокупателя", Элем.ЗаказПокупателя); 
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЦикла;		
		
	КонецЕсли;
	
	Если ТЗНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//+Макрушин Е. 24.09.2025 #UT10-5430
	Если Результат.Свойство("ДополнительныеДанные") И Результат.ДополнительныеДанные.Свойство("КодыМаркировки") Тогда
		тзКодыМаркировки = ОбщегоНазначения.ПреобразоватьМассивВТаблицуЗначений(Результат.ДополнительныеДанные.КодыМаркировки);
	Иначе
		тзКодыМаркировки = Неопределено;
	КонецЕсли;
	//-Макрушин Е. 24.09.2025 #UT10-5430
	
	НомерДокумента = "";
	ДокПоступление = Неопределено;	
	ДокЗаказ = Неопределено;
	ЗаказОбъект = Неопределено;
	ЕстьДокумент = Ложь;
	УпакЛистНомерWMS = "";
	ПрямаяПоставка = Ложь;
	
	Для Каждого СтрТЗ Из ТЗНоменклатуры Цикл
		
		Если Не ЗначениеЗаполнено(СтрТЗ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если НомерДокумента <> СтрТЗ.НомерДокумента Тогда
			
			НомерДокумента = СтрТЗ.НомерДокумента;
			ДатаДокумента = Дата(СтрТЗ.ДатаДокумента);
			ИДДокументаВСмежнойБазе = СокрЛП(СтрТЗ.ИДДокументаВСмежнойБазе); 
			ПрямаяПоставка = СтрТЗ.ПрямаяПоставка; 
			
			Если ДокПоступление <> Неопределено Тогда
				
				ДокПоступление.УпаковочныеЛисты.Свернуть("НомерWMS");
				
				Если ПрямаяПоставка Тогда
					ПроверитьСуммуСНДС(ТЗНоменклатуры, ДокПоступление.Товары, ДокПоступление.ИДДокументаВСмежнойБазе);	
				КонецЕсли;
				
				УстановитьПривилегированныйРежим(Истина);				
				ДокПоступление.Записать(РежимЗаписиДокумента.Запись);
				
				//+Кабанов А.В. 12.11.2024 #UT10-4872	
				Попытка			
					ДокПоступление.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
				КонецПопытки;
				//-Кабанов А.В. 12.11.2024 #UT10-4872
				
				УстановитьПривилегированныйРежим(Ложь);
				
				//+Сёмин Р.И. 05.06.2026 #UT10-5899
				ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление);
				//-Сёмин Р.И. 05.06.2026 #UT10-5899
				
			КонецЕсли;			
			
			ЕстьДокумент = НайтиПоступлениеПоИДДокументаВСмежнойБазе(ИДДокументаВСмежнойБазе);
			
			Если ЕстьДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьДокумент = НайтиПоступлениеПоНомеруВходящегоДокумента(НомерДокумента, ДатаДокумента);
			
			Если ЕстьДокумент Тогда
				Продолжить;
			КонецЕсли;
			
			ДокПоступление = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
			ДокПоступление.Организация = Константы.ОсновнаяОрганизация.Получить();
			ДокПоступление.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
			ДокПоступление.СкладОрдер = Константы.ОсновнойСклад.Получить(); 
			
			Если НЕ Склад = Неопределено Тогда
				ДокПоступление.Контрагент = Склад.Поставщик; 
			Иначе				
				ДокПоступление.Контрагент = Константы.ОсновнойПоставщик.Получить();
			КонецЕсли; 
			
			Если Не Склад = Неопределено И ЗначениеЗаполнено(Склад.ДоговорКонтрагента) Тогда
				ДокПоступление.ДоговорКонтрагента =	Склад.ДоговорКонтрагента; 
			Иначе
				ДокПоступление.ДоговорКонтрагента = ДокПоступление.Контрагент.ОсновнойДоговорКонтрагента;
			КонецЕсли;
			
			ДокПоступление.ВалютаДокумента = ДокПоступление.ДоговорКонтрагента.ВалютаВзаиморасчетов; 
			//+Кабанов А.В. 13.11.2024 #UT10-4872	
			//ДокПоступление.Дата = НачалоДня(ТекущаяДата() + 60 * 60 * 24);
			ДокПоступление.Дата = ТекущаяДата();				
			//+Кабанов А.В. 13.11.2024 #UT10-4872
			ДокПоступление.КратностьВзаиморасчетов = 1;
			ДокПоступление.КурсВзаиморасчетов  = 1;	
			ДокПоступление.ОтражатьВУправленческомУчете = Истина;
			ДокПоступление.ОтражатьВБухгалтерскомУчете = Истина;
			ДокПоступление.ОтражатьВНалоговомУчете = Истина;
			ДокПоступление.УчитыватьНДС = Истина;
			ДокПоступление.СуммаВключаетНДС = Истина;
			ДокПоступление.НомерВходящегоДокумента = НомерДокумента;
			ДокПоступление.ДатаВходящегоДокумента = ДатаДокумента;
			ДокПоступление.ИДДокументаВСмежнойБазе = ИДДокументаВСмежнойБазе; 
			ДокПоступление.КодМДМОрганизацииВСмежнойБазе = СтрТЗ.КодМДМОрганизацииВСмежнойБазе;	
			
			Если СтрТЗ.КроссДокинг Тогда
				ДокПоступление.НомерСкладскогоДокумента = ?(ЗначениеЗаполнено(СтрТЗ.УпакЛистНомерWMS), Лев(Прав(СтрТЗ.УпакЛистНомерWMS, 10), 9), СокрЛП(СтрТЗ.НомерWMS));
			Иначе
				ДокПоступление.НомерСкладскогоДокумента = ?(ЗначениеЗаполнено(СтрТЗ.НомерWMS), СтрТЗ.НомерWMS, НомерДокумента); 
			КонецЕсли;			
			
			ДокПоступление.Ответственный = глЗначениеПеременной("глТекущийПользователь");
			ДокПоступление.Экспресс = СтрТЗ.Экспресс;    
			//+Шульман А. 23.04.2025 #UT10-5210  
			ДокПоступление.ПремиальнаяПерекупка = СтрТЗ.ПремиальнаяПерекупка;    
			//-Шульман А. 23.04.2025 #UT10-5210 
			ДокПоступление.Комментарий = СокрЛП(СтрТЗ.Комментарий) + " Создан автоматически на основе документа в сторонней базе " + ТекущаяДата();			
			
			Если СтрТЗ.ТранзитнаяПоставка  Тогда
				
				ДокПоступление.Статус = Перечисления.СтатусыПТУ.КПоступлению;
				ДокПоступление.ТранзитнаяПоставка = Истина;				
				
			КонецЕсли;
			
			Если УпакЛистНомерWMS <> СтрТЗ.УпакЛистНомерWMS Тогда
				
				УпакЛистНомерWMS = СтрТЗ.УпакЛистНомерWMS;
				МассивСтрок = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(УпакЛистНомерWMS, ";");
				
				Для Сч = 0 По МассивСтрок.Количество()-1 Цикл 
					
					ТекСтрока = МассивСтрок[Сч];
					
					Если ЗначениеЗаполнено(ТекСтрока) Тогда
						СтрУпакЛист = ДокПоступление.УпаковочныеЛисты.Добавить();
						СтрУпакЛист.НомерWMS = СокрЛП(ТекСтрока);
					КонецЕсли;					
					
				КонецЦикла;
				
			КонецЕсли;			
			
			//+Макрушин Е. 24.09.2025 #UT10-5430
			ДополнитьДокументКодамиМаркировки(ДокПоступление, ИДДокументаВСмежнойБазе, тзКодыМаркировки);
			//-Макрушин Е. 24.09.2025 #UT10-5430
			
		КонецЕсли;				
		
		Если ЕстьДокумент Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрТЗ.ЗаказПоставщика) И (ДокЗаказ = Неопределено Или ДокЗаказ <> СтрТЗ.ЗаказПоставщика) Тогда 
			
			Если ЗаказОбъект <> Неопределено Тогда
				
				УстановитьПривилегированныйРежим(Истина);
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
				УстановитьПривилегированныйРежим(Ложь);
				
			КонецЕсли;			
			
			ДокЗаказ = СтрТЗ.ЗаказПоставщика;
			ЗаказОбъект = ДокЗаказ.ПолучитьОбъект();
			ЗаказОбъект.ОбменДанными.Загрузка = Истина;
			ЗаказОбъект.ЗагруженоПоступление = Истина;
			НомСклДок = ДокПоступление.НомерСкладскогоДокумента; 
			
			Если ЗначениеЗаполнено(НомСклДок) И Найти(ЗаказОбъект.Комментарий, НомСклДок) = 0 Тогда 
				ЗаказОбъект.Комментарий = ЗаказОбъект.Комментарий + ", "+НомСклДок;
			КонецЕсли;			
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрТЗ.НомерГТДКод) Тогда
			СтрТЗ.НомерГТДКод = "--";
		КонецЕсли;		
		
		СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СтрТЗ.НомерГТДКод,Истина,,СтрТЗ.Номенклатура);
		
		Если СерияНоменклатуры.Пустая() Тогда
			
			НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(СтрТЗ.НомерГТДКод);
			Страна = Справочники.КлассификаторСтранМира.НайтиПоКоду(СтрТЗ.СтранаПроисхожденияКод);
			СерияНоменклатуры = СоздатьСерию(СтрТЗ.Номенклатура, СтрТЗ.НомерГТДКод, Страна, НомерГТДСсылка);
			
		КонецЕсли;
		
		//ЗаполнениеТЧ
		НужноОприходовать = СтрТЗ.Количество; 
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура",СтрТЗ.Номенклатура);
		Рез = ?(ДокЗаказ = Неопределено, Новый Массив, ДокЗаказ.Товары.НайтиСтроки(Отбор)); 
		КолвоСтрок = Рез.Количество();
		ТекСтрока = 0;
		
		Если Рез.Количество() = 0 Тогда			
			
			//Излишек
			НовСтрока = ДокПоступление.Товары.Добавить();
			НовСтрока.Номенклатура = СтрТЗ.Номенклатура; 
			НовСтрока.СерияНоменклатуры = СерияНоменклатуры; 
			НовСтрока.Количество = НужноОприходовать;
			НовСтрока.Цена = СтрТЗ.Цена;
			НовСтрока.ЕдиницаИзмерения = НовСтрока.Номенклатура.ЕдиницаХраненияОстатков;  
			НовСтрока.Коэффициент = НовСтрока.ЕдиницаИзмерения.Коэффициент; 
			//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
			//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
			НовСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
			//-Гавриленков В. 18.12.2025 #UT10-5598
			НовСтрока.КодСтрокиУТ11 = СтрТЗ.КодСтрокиУТ11;
			ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
			ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
			ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);			
			НужноОприходовать = 0;
			
		Иначе		
			
			Для Каждого СтрРез Из Рез Цикл				
				
				Если НужноОприходовать <= 0 Тогда
					Продолжить;
				КонецЕсли;				
				
				ТекСтрока = ТекСтрока+1;				
				//Получение остатка по заказам
				Ответ = ПолучитьОстатокПоЗаказу(СтрТЗ.Номенклатура, ДокЗаказ, СтрРез.Заказ);
				
				Если Ответ = 0 Тогда
					
					ОстатокПоЗакПоставщику = 0;
					ОстатокПоЗакПокупателя = 0;
					
				Иначе
					
					ОстатокПоЗакПоставщику = Ответ.ОстатокПоЗакПоставщику;
					ОстатокПоЗакПокупателя = Ответ.ОстатокПоЗакПокупателя;
					
				КонецЕсли;				
				
				//Минусуем уже распределенное колво по заказам в рамках документа
				ОтборДок = Новый Структура();
				ОтборДок.Вставить("Номенклатура",СтрРез.Номенклатура);
				СтрокиДок = ДокПоступление.Товары.НайтиСтроки(ОтборДок);
				
				Для Каждого СтрДок Из СтрокиДок Цикл
					
					Если СтрДок.Заказ = СтрРез.Заказ Тогда
						ОстатокПоЗакПокупателя = ОстатокПоЗакПокупателя - СтрДок.Количество;
					КонецЕсли;
					
					Если СтрДок.ЗаказПоставщику = ДокЗаказ.Ссылка Тогда 
						ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - СтрДок.Количество;
					КонецЕсли;					
					
				КонецЦикла;
				
				Если ТекСтрока = КолвоСтрок Тогда
					
					//Распределяем весь приход в цикле на последнюю строку
					Пока НужноОприходовать > 0 Цикл						
						
						НовСтрока = ДокПоступление.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрока,СтрРез);
						НовСтрока.Цена = СтрТЗ.Цена; 
						//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
						//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
						НовСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
						//-Гавриленков В. 18.12.2025 #UT10-5598
						//+Сёмин Р.И. 29.06.2026 #UT10-5931
						НовСтрока.КодСтрокиУТ11 = СтрТЗ.КодСтрокиУТ11;
						//-Сёмин Р.И. 29.06.2026 #UT10-5931
						НовСтрока.СерияНоменклатуры = СерияНоменклатуры;
						
						Если ОстатокПоЗакПокупателя > 0 Тогда 
							
							НовСтрока.Заказ = СтрРез.Заказ;
							НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка; 
							НовСтрока.Количество = Мин(ОстатокПоЗакПокупателя,НужноОприходовать);
							ОстатокПоЗакПокупателя = ОстатокПоЗакПокупателя - НовСтрока.Количество;
							ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - НовСтрока.Количество;
							
						ИначеЕсли ОстатокПоЗакПоставщику > 0 Тогда
							
							НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
							НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка;
							НовСтрока.Количество = Мин(ОстатокПоЗакПоставщику, НужноОприходовать);
							ОстатокПоЗакПоставщику = ОстатокПоЗакПоставщику - НовСтрока.Количество;
							
						Иначе
							
							НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
							НовСтрока.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
							НовСтрока.Количество = НужноОприходовать;					
							
						КонецЕсли;
						
						ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(НовСтрока, ДокПоступление);
						ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);					
						НужноОприходовать = НужноОприходовать - НовСтрока.Количество;
						
					КонецЦикла;
					
				ИначеЕсли НужноОприходовать > 0 Тогда
					
					Если ОстатокПоЗакПокупателя = 0 И ТекСтрока < КолвоСтрок Тогда
						Продолжить;
					КонецЕсли;
					
					//Один проход распределения
					НовСтрока = ДокПоступление.Товары.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, СтрРез);
					НовСтрока.Цена = СтрТЗ.Цена; 
					//+Гавриленков В. 18.12.2025 #UT10-5598 Временное решение
					//НовСтрока.СтавкаНДС =  НовСтрока.Номенклатура.СтавкаНДС;
					НовСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(НовСтрока.Номенклатура, ДокПоступление.Дата);
					//-Гавриленков В. 18.12.2025 #UT10-5598
					//+Сёмин Р.И. 29.06.2026 #UT10-5931
					НовСтрока.КодСтрокиУТ11 = СтрТЗ.КодСтрокиУТ11;
					//-Сёмин Р.И. 29.06.2026 #UT10-5931
					НовСтрока.СерияНоменклатуры = СерияНоменклатуры;
					
					Если ОстатокПоЗакПокупателя > 0 Тогда 
						
						НовСтрока.Заказ = СтрРез.Заказ;
						НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка; 
						НовСтрока.Количество = Мин(ОстатокПоЗакПокупателя, НужноОприходовать);
						
					ИначеЕсли ОстатокПоЗакПоставщику > 0 Тогда						
						
						НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
						НовСтрока.ЗаказПоставщику = ДокЗаказ.Ссылка;
						НовСтрока.Количество = Мин(ОстатокПоЗакПоставщику, НужноОприходовать);
						
					Иначе
						
						НовСтрока.Заказ = Документы.ЗаказПокупателя.ПустаяСсылка();
						НовСтрока.ЗаказПоставщику = Документы.ЗаказПоставщику.ПустаяСсылка();
						НовСтрока.Количество = НужноОприходовать;					
						
					КонецЕсли;
					
					ОбработкаТабличныхЧастей.ПриИзмененииЕдиницыТабЧасти(НовСтрока, ДокПоступление); 
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(НовСтрока, ДокПоступление);
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСтрока, ДокПоступление);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСтрока, ДокПоступление);					
					НужноОприходовать = НужноОприходовать - НовСтрока.Количество;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;		
		
	КонецЦикла;
	
	//Запишем документы для последней строки таблицы
	Если ДокПоступление <> Неопределено Тогда
		
		ДокПоступление.УпаковочныеЛисты.Свернуть("НомерWMS");
		
		Если ПрямаяПоставка Тогда
			ПроверитьСуммуСНДС(ТЗНоменклатуры, ДокПоступление.Товары, ДокПоступление.ИДДокументаВСмежнойБазе);
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);		
		ДокПоступление.Записать(РежимЗаписиДокумента.Запись); 
		
		//+Кабанов А.В. 12.11.2024 #UT10-4872	
		Попытка			
			ДокПоступление.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
		//-Кабанов А.В. 12.11.2024 #UT10-4872
		
		УстановитьПривилегированныйРежим(Ложь);
		
		//+Сёмин Р.И. 05.06.2026 #UT10-5899
		ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление);
		//-Сёмин Р.И. 05.06.2026 #UT10-5899
		
	КонецЕсли;
	
	Если ЗаказОбъект <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;	
	
КонецПроцедуры

Функция СоздатьНовуюСтрочкуВДокументе(СтруктураСтроки)
	
	НоваяСтрокаДокумента =  СтруктураСтроки.Документ.Товары.Добавить();
	НоваяСтрокаДокумента.Номенклатура 		= СтруктураСтроки.Номенклатура ;
	НоваяСтрокаДокумента.ЕдиницаИзмерения  	= НоваяСтрокаДокумента.Номенклатура.ЕдиницаХраненияОстатков;
	НоваяСтрокаДокумента.Коэффициент 		= НоваяСтрокаДокумента.ЕдиницаИзмерения.Коэффициент;
	НоваяСтрокаДокумента.Склад              = СтруктураСтроки.Документ.СкладОрдер;
	
	Если СтруктураСтроки.ЗаказПокупателяУказан И СтруктураСтроки.ТекСтрока <> Неопределено Тогда 
		НоваяСтрокаДокумента.Заказ = СтруктураСтроки.ТекСтрока.ЗаказПокупателя;
	КонецЕсли;
	
	Если СтруктураСтроки.БратьУказанноеКоличество Тогда 
		НоваяСтрокаДокумента.Количество = СтруктураСтроки.КоличествоЭксель;
	Иначе
		НоваяСтрокаДокумента.Количество = Мин(СтруктураСтроки.ТекСтрока.КоличествоЗаказаноПокупателем, СтруктураСтроки.КоличествоЭксель);
	КонецЕсли;
	
	Если СтруктураСтроки.ЗаказПоставщикуУказан Тогда 
		НоваяСтрокаДокумента.ЗаказПоставщику = СтруктураСтроки.ЗаказПоставщику;
	КонецЕсли;
	
	НоваяСтрокаДокумента.СерияНоменклатуры 	= СтруктураСтроки.СерияНоменклатуры;
	//+Гавриленков В. 19.12.2025 #UT10-5598
	//НоваяСтрокаДокумента.СтавкаНДС 			= СтруктураСтроки.Номенклатура.СтавкаНДС;
	НоваяСтрокаДокумента.СтавкаНДС 			= УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(СтруктураСтроки.Номенклатура, СтруктураСтроки.Документ.Дата);
	//-Гавриленков В. 19.12.2025 #UT10-5598
	
	//+Гавриленков В. 21.01.2026 #UT10-5645
	ЗначениеСтавки = УчетНДС.ПолучитьСтавкуНДС(НоваяСтрокаДокумента.СтавкаНДС);
	ЗначениеДляРасчета = ЗначениеСтавки / (100 + ЗначениеСтавки);
	//-Гавриленков В. 21.01.2026 #UT10-5645
	
	НоваяСтрокаДокумента.Цена 			= СтруктураСтроки.ЦенаБезНДС;
	НоваяСтрокаДокумента.Сумма 			= НоваяСтрокаДокумента.Цена * НоваяСтрокаДокумента.Количество;
	//+Гавриленков В. 21.01.2026 #UT10-5645
	//НоваяСтрокаДокумента.СуммаНДС 		= ?(ТекущаяДата() >= Дата("20190101000000"), НоваяСтрокаДокумента.Сумма * 20/120, НоваяСтрокаДокумента.Сумма * 18/118); 
	НоваяСтрокаДокумента.СуммаНДС 		= НоваяСтрокаДокумента.Сумма * ЗначениеДляРасчета;
	//-Гавриленков В. 21.01.2026 #UT10-5645
	
	Возврат НоваяСтрокаДокумента; 
	
КонецФункции	

Функция ПолучитьСписокДоговоров()
	
	Рез = "(";
	СторСклад = Константы.КодДоговораСторонниеСклады.Получить();
	ЭкспрессДост = Константы.КодДоговораЭкспрессДоставка.Получить();
	ЭкспрессСам = Константы.КодДоговораЭкспрессСамовывоз.Получить();
	ПопДост = Константы.КодДоговораПополнениеДоставка.Получить();
	ПопСам = Константы.КодДоговораПополнениеСамовывоз.Получить();
	
	Если ЗначениеЗаполнено(СторСклад) тогда
		Рез = Рез+СторСклад+",";
	КонецЕсли;
	
	Если Константы.ЗагружатьЭкспрессИПополнение.Получить() тогда
		
		Если ЗначениеЗаполнено(ЭкспрессДост) тогда
			Рез = Рез + ЭкспрессДост + ",";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭкспрессСам) тогда
			Рез = Рез + ЭкспрессСам + ",";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПопДост) тогда
			Рез = Рез + ПопДост + ",";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПопСам) тогда
			Рез = Рез + ПопСам + ",";
		КонецЕсли;
		
	КонецЕсли;
	
	Если Прав(Рез,1) = "," тогда
		Рез = Лев(Рез,СтрДлина(Рез) - 1);
	КонецЕсли;
	
	Рез = Рез + ")";
	Возврат Рез;    
	
КонецФункции

Процедура ДополнитьДокументКодамиМаркировки(ДокументДляОбработки, ИДДокументаВСмежнойБазе, тзКодыМаркировки)
	
	//+Макрушин Е. 24.09.2025 #UT10-5430
	Если НЕ ЗначениеЗаполнено(тзКодыМаркировки) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЕстьТабЧастьДокумента("КодыМаркировки", ДокументДляОбработки.Метаданные()) Тогда
		Возврат;
	КонецЕсли;
	
	ДокументДляОбработки.КодыМаркировки.Очистить();
	
	СтруктураПоиска = Новый Структура("ИДДокумента", ИДДокументаВСмежнойБазе);
	мСтрокиПоДокументу = тзКодыМаркировки.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицыКодыМаркировки Из мСтрокиПоДокументу Цикл
		
		ПодходящийКодМаркировки = Справочники.ШтрихкодыНоменклатуры.НайтиПоРеквизиту("КодМаркировки", СтрокаТаблицыКодыМаркировки.КодМаркировки);
		ПодходящаяНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", СтрокаТаблицыКодыМаркировки.КодМДМНоменклатуры);	
				
		Если ЗначениеЗаполнено(ПодходящаяНоменклатура) И НЕ ЗначениеЗаполнено(ПодходящийКодМаркировки) Тогда
			
			ПодходящийКодМаркировки = Справочники.ШтрихкодыНоменклатуры.СоздатьЭлемент();
			ПодходящийКодМаркировки.КодМаркировки = СтрокаТаблицыКодыМаркировки.КодМаркировки;
			ПодходящийКодМаркировки.Номенклатура = ПодходящаяНоменклатура;
			ПодходящийКодМаркировки.ТипПоступления = СтрокаТаблицыКодыМаркировки.ТипПоступления;
			
			//+Марков И. 06.04.2026 #UT10-5805
			Если ЗначениеЗаполнено(СтрокаТаблицыКодыМаркировки.ПолныйКодМаркировки) Тогда
				
				ПолныйКодМаркировкиСоЗнаками = СтрЗаменить(СтрокаТаблицыКодыМаркировки.ПолныйКодМаркировки , "<GS>" , Символ(29));
				ПодходящийКодМаркировки.ПолныйКодМаркировки = Новый ХранилищеЗначения(ПолныйКодМаркировкиСоЗнаками);
				
			КонецЕсли;
			//-Марков И. 06.04.2026 #UT10-5805
			
			Если ЗначениеЗаполнено(СтрокаТаблицыКодыМаркировки.ТипУпаковки) Тогда
				ПодходящийКодМаркировки.ТипУпаковки = Перечисления.ТипУпаковкиМаркировки[СтрокаТаблицыКодыМаркировки.ТипУпаковки];
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(СтрокаТаблицыКодыМаркировки.ДатаПроизводства) Тогда
				ПодходящийКодМаркировки.ДатаПроизводства = СтрокаВДату(СтрокаТаблицыКодыМаркировки.ДатаПроизводства);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицыКодыМаркировки.СрокГодности) Тогда
				ПодходящийКодМаркировки.СрокГодности = СтрокаВДату(СтрокаТаблицыКодыМаркировки.СрокГодности);
			КонецЕсли;
			
			ПодходящийКодМаркировки.Записать();
			
		КонецЕсли;	
		
		СтрокаДокументаКодыМаркировки = ДокументДляОбработки.КодыМаркировки.Добавить();
		СтрокаДокументаКодыМаркировки.КодМаркировки = ПодходящийКодМаркировки.Ссылка;
		
	КонецЦикла;
	//-Макрушин Е. 24.09.2025 #UT10-5430
	
КонецПроцедуры

Процедура ПроверитьУстановитьСтатусПТУОжидаетПодтвержденияЭДО(ДокПоступление)
	
	//+Сёмин Р.И. 05.06.2026 #UT10-5899
	Если ДокПоступление.Контрагент.ИНН <> Константы.ОсновнаяОрганизация.Получить().ИНН Тогда
		
		Если МСКWEB.ЗначениеДопСвойства(ДокПоступление.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПодтвержденияЭДОПТУ) <> Перечисления.СтатусыПодтвержденияЭДОПТУ.Подтверждено Тогда
			МСКWEB.УстановитьЗначениеДопСвойства(ДокПоступление.Ссылка, ПланыВидовХарактеристик.СвойстваОбъектов.СтатусПодтвержденияЭДОПТУ, Перечисления.СтатусыПодтвержденияЭДОПТУ.ОжидаетПодтверждения);
		КонецЕсли;
		
	КонецЕсли;
	//-Сёмин Р.И. 05.06.2026 #UT10-5899
	
КонецПроцедуры

Функция СтрокаВДату(Знач ДатаСтрока) Экспорт
	
	//+Макрушин Е. 24.09.2025 #UT10-5430
	ДатаСтрока = Лев(СОКРЛП(ДатаСтрока), 10);
	
	СначалаГод = Найти("0123456789", Сред(ДатаСтрока, 3, 1)) > 0;
	
	ДатаСтрока = СокрЛП(СтрЗаменить(ДатаСтрока, ".", "")); 
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "-", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "/", "");
	ДатаСтрока = СтрЗаменить(ДатаСтрока, "\", "");
	
	Если СначалаГод Тогда 
		ДатаСтрока = Лев(ДатаСтрока, 4) + Сред(ДатаСтрока, 5, 2) + Прав(ДатаСтрока, 2);  
	Иначе
		
		ДатаСтрока = Сред(ДатаСтрока, 5) + Сред(ДатаСтрока, 3, 2) + Лев(ДатаСтрока, 2);  
	
		Если СтрДлина(ДатаСтрока) = 6 Тогда
			ДатаСтрока = "20" + ДатаСтрока;
		КонецЕсли;    
		
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Дата");
	Результат    = ОписаниеТипа.ПривестиЗначение(ДатаСтрока);
	
	Возврат Результат;
	//-Макрушин Е. 24.09.2025 #UT10-5430
	
КонецФункции 

ОписаниеТиповСтрока			 = Новый ОписаниеТипов("Строка", Новый Квалификаторыстроки(80, ДопустимаяДлина.Переменная));
ОписаниеТиповДата			 = Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя));
ОписаниеТиповЧисло			 = Новый ОписаниеТипов("Число", Новый Квалификаторычисла(12));
ОписаниеТиповЧислоСРазрядами = Новый ОписаниеТипов("Число", Новый квалификаторычисла(10,3));
