
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтруктураВерсии = Константы.ПЛ_НастройкиУведомлений.СоздатьМенеджерЗначения().ПолучитьНастройку("Версия");
	Версия = СтруктураВерсии.НомерВерсии;
	
	Если ПроверитьДоступноеОбновление() Тогда
		Элементы.СкачатьОбновление.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ДекорацияСайтНажатие(Элемент)
	
	ЗапуститьПриложение("http://program-line.ru");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПочтаНажатие(Элемент)
	
	ЗапуститьПриложение("mailto:support@program-line.ru");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура СкачатьОбновление(Команда)
	
	// Заглушка
	а = 1;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ПроверитьДоступноеОбновление()
	
	ДоступноОбновление = Ложь;
	
	
	Если 1 = 2 Тогда
		ДоступноОбновление = Истина;
	КонецЕсли;
	
	Возврат ДоступноОбновление;
	
КонецФункции
