
Функция КатегорияОбъектаУстановлена(ПромОбъект,ПромКатегория) Экспорт 
	//+Кабанов А.В. 18.11.2024 #UT10-4904 
	
	ЗапросКатегории = Новый Запрос;
	ЗапросКатегории.Текст = 
	"ВЫБРАТЬ
	|	КатегорииОбъектов.Объект,
	|	КатегорииОбъектов.Категория
	|ИЗ
	|	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|ГДЕ
	|	КатегорииОбъектов.Объект = &Объект
	|	И КатегорииОбъектов.Категория = &Категория";
	
	ЗапросКатегории.УстановитьПараметр("Объект",ПромОбъект);
	ЗапросКатегории.УстановитьПараметр("Категория",ПромКатегория);
	
	Возврат НЕ ЗапросКатегории.Выполнить().Пустой();
	
	//-Кабанов А.В. 18.11.2024 #UT10-4904
КонецФункции

Функция УстановитьКатегориюОбъекта(СсылкаНаОбъект, КатегорияДляУстановки, ЗначениеПоКатегории = Истина) Экспорт
	
	//+Макрушин Е. 26.02.2026 #UT10-5657
	СтруктураВозврата = Новый Структура;
	
	Если ТипЗнч(КатегорияДляУстановки) = Тип("СправочникСсылка.КатегорииОбъектов") Тогда
		ТекКатегория = КатегорияДляУстановки;
	ИначеЕсли ТипЗнч(КатегорияДляУстановки) = Тип("Строка") Тогда
		
		ТекКатегория = Справочники.КатегорииОбъектов.НайтиПоНаименованию(КатегорияДляУстановки);
		
		Если Не ЗначениеЗаполнено(ТекКатегория) Тогда
			
			СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
			СтруктураВозврата.Вставить("ОписаниеОшибки", "Не найдена категория " + КатегорияДляУстановки);
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	Иначе	
		
		СтруктураВозврата.Вставить("ВыполненоУспешно", Ложь);
		СтруктураВозврата.Вставить("ОписаниеОшибки", "Передана некорректная категория " + КатегорияДляУстановки);
		
		Возврат СтруктураВозврата;
		
	КонецЕсли;
				  
	Набор = РегистрыСведений.КатегорииОбъектов.СоздатьНаборЗаписей();
	Набор.Отбор.Объект.Установить(СсылкаНаОбъект);
	Набор.Отбор.Категория.Установить(ТекКатегория);
	Набор.Прочитать();
	
	Если Набор.Количество() > 0 И Не ЗначениеПоКатегории Тогда// Категория Установлена, надо удалить
		
		Набор.Очистить();
		Набор.Записать();
		
	ИначеЕсли Набор.Количество() = 0 И ЗначениеПоКатегории Тогда // Категория отсутствует, надо создать
		
		НовЗапись = Набор.Добавить();
		НовЗапись.Объект = СсылкаНаОбъект;
		НовЗапись.Категория = ТекКатегория;
		Набор.Записать();
		
	Иначе
		// Категория актуальна,  ничего не меняем
	КонецЕсли;
	
	СтруктураВозврата.Вставить("ВыполненоУспешно", Истина);
	
	Возврат СтруктураВозврата;
	//-Макрушин Е. 26.02.2026 #UT10-5657
	
КонецФункции
