
Функция ЭтоТранзитнаяПоставкаЧерезСкладWMS(ЗаказПоставщику) Экспорт
	
	ТранзитнаяПоставкаЧерезСкладWMS = Ложь;

	Если ЗаказПоставщику.IDСкладаСобственныйСклад.ИсключитьИзОбщегоЭкспресса и ЗначениеЗаполнено(ЗаказПоставщику.IDСкладаСобственныйСклад.ДоговорКонтрагента) 
		И ЗаказПоставщику.IDСкладаСобственныйСклад.ДоговорКонтрагента.ДоставкаЧерезСкладТомилино 
		И ЗаказПоставщику.IDСкладаСобственныйСклад.ДоставкаЧерезСкладТомилино Тогда 
		
			ТранзитнаяПоставкаЧерезСкладWMS = Истина;
			
	КонецЕсли;
	
	Возврат ТранзитнаяПоставкаЧерезСкладWMS;
	
КонецФункции

Функция ОтправитьвSI(ЗаказСсылка) Экспорт
	
	Результат = Новый Структура;	
	Результат.Вставить("Статус","OK");
	Результат.Вставить("Сообщение","");
	
	Если ЗаказСсылка.IDСклада.НеОтправлятьЗаказыВSI Тогда 
		
		Результат.Статус = "NO_COMMAND"; 
		Результат.Сообщение = "В стороннем складе установлен признак 'Не отправлять заказы в SI'";
		Возврат Результат;
		
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Константы.АдресSI.Получить(),,,,,, Новый ЗащищенноеСоединениеOpenSSL());
	Заголовки = Новый Соответствие;	
	
	Заголовки.Вставить("Accept", "*/*");
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");	
	Заголовки.Вставить("Cache-Control", "no-cache");
	Заголовки.Вставить("Cookie", "token=3fa4d6b8a0b33e090ecbf67e414794b2");		
	
	url = "/api/v1/send/order/"; 
	order_num = "order_num=" + СокрЛП(ЗаказСсылка.Номер);
	order_date = "&order_date=" + Формат(ЗаказСсылка.Дата,"ДФ=yyyy-MM-dd");
	order_uid = "&order_uid=" + ЗаказСсылка.УникальныйИдентификатор();
	kontragent_mdm_id = "&kontragent_mdm_id=" + СокрЛП(ЗаказСсылка.Контрагент.КодМДМ);
	warehouse_mdm_id = "&warehouse_mdm_id=" + СокрЛП(ЗаказСсылка.IDСклада.КодМДМ);
	repurchase = "&repurchase=false"; 
	source_name = "&source_name=" + СокрЛП(Константы.AMQP_ИдентификаторИнформацСистемы.Получить());  
	
	Если Константы.ТестоваяОтправкаВSI.Получить() Или ЗаказСсылка.ТестоваяОтправкаВSI Тогда  
		test = "&test=1";
	Иначе
		test = "";
	КонецЕсли;
		
	Запрос = Новый HTTPЗапрос(); 
	Запрос.АдресРесурса = url;
	Запрос.Заголовки = Заголовки;
	ТелоЗапроса = order_num + order_date + order_uid + kontragent_mdm_id + warehouse_mdm_id + repurchase + source_name + test;	
	
	ТоварыЗаказа = ЗаказСсылка.Товары.Выгрузить(); 
	ТоварыЗаказа.Свернуть("Номенклатура, ПроизводительПоставщика", "Количество, Цена, УИД"); 
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	Отбор.Вставить("ПроизводительПоставщика", "");	
	
	Для Каждого СтрТовЗак Из ТоварыЗаказа Цикл
		
		Отбор.Номенклатура = СтрТовЗак.Номенклатура;
		Отбор.ПроизводительПоставщика = СтрТовЗак.ПроизводительПоставщика; 
		Рез = ЗаказСсылка.Товары.НайтиСтроки(Отбор);
		
		Если Рез.Количество() > 1 Тогда
			
			МинЦена = Рез[0].Цена;

			Для Каждого СтрРез Из Рез Цикл
				МинЦена = Мин(МинЦена, СтрРез.Цена); 	
			КонецЦикла;
			
			СтрТовЗак.Цена = МинЦена; 
			СтрТовЗак.УИД = 0;
			
		КонецЕсли;		
		
	КонецЦикла;
		
	НомерСтроки = 0;
	
	Для Каждого СтрТовары Из ТоварыЗаказа Цикл
		
		СтрПозиции = "";
		НомерПозиции = "&positions[" + Формат((НомерСтроки), "ЧН=0; ЧГ=0") + "]";
		articul = "[articul]=" + СокрЛП(СтрТовары.Номенклатура.КодПроизводителя);
		articul_mdm_id = "[articul_mdm_id]=" + СокрЛП(СтрТовары.Номенклатура.КодМДМ);
		brand = "[brand]=" + КодироватьСтроку(СокрЛП(СтрТовары.ПроизводительПоставщика), СпособКодированияСтроки.КодировкаURL); 
		quantity = "[quantity]=" + Формат(СтрТовары.Количество, "ЧРД=.; ЧН=0; ЧГ=0");
		price = "[price]=" + Формат(СтрТовары.Цена, "ЧРД=.; ЧН=0; ЧГ=0");		
		pos_id = "[pos_id]=" + Формат(СтрТовары.УИД, "ЧН=0; ЧГ=0");
		max_price = "[max_price]=" + Формат(0, "ЧРД=.; ЧН=0; ЧГ=0"); 
		
		СтрПозиции = НомерПозиции + articul + НомерПозиции + articul_mdm_id + НомерПозиции + brand + НомерПозиции + quantity 
		           + НомерПозиции + price + НомерПозиции + pos_id + НомерПозиции + max_price;
				   
		ТелоЗапроса = ТелоЗапроса + СтрПозиции;
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Исключение
			
			Результат.Статус = "ERROR"; 
			Результат.Сообщение = "Ошибка соединения, код состояния: " + Ответ.КодСостояния; 
			Возврат Результат;
			
		КонецПопытки;		
		
	КонецПопытки;
	
	СтрОтвет = Ответ.ПолучитьТелоКакСтроку();	
	
	Если Ответ.КодСостояния = 200 Тогда	
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрОтвет);
		ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
		Результат.Статус = ДанныеСтруктура.status; 
		Результат.Сообщение = ДанныеСтруктура.message;
		
	Иначе
		
		Результат.Статус = "ERROR";
		Результат.Сообщение = СтрОтвет;
		
	КонецЕсли;
	
	Возврат Результат;	
		
КонецФункции

Процедура Р_ЗагрузитьДокумент(Знач _СтруктураДокумента, Настройка, Отказ) Экспорт
	
	Структура = Р_ЗагрузкаДокументов.ПолучитьДанныеДокумента(_СтруктураДокумента, Настройка);
	СтруктураДокумента = Структура.СтруктураДокумента;
	
	Если Не Структура.ТребуетсяОбновление Тогда
		Возврат;
	КонецЕсли;                            
	
	Если СтруктураДокумента.ТестоваяОтправка = 1 Тогда
		Возврат;
	КонецЕсли;

	Карта = Новый Соответствие;
	Карта.Вставить("Дата", "ДатаДокумента");
	Карта.Вставить("Номер", "НомерДокумента");
	Карта.Вставить("Склад", "КодСкладаМДМ");        
	Карта.Вставить("КодМДМ", "УникальныйИдентификатор"); 
	Карта.Вставить("Проведен", "Статус");
	Карта.Вставить("ПометкаУдаления", "ПометкаУдаления");
	Карта.Вставить("ШтампВерсии", "ШтампВерсии");
	Карта.Вставить("ВалютаДокумента", "КодВалютаМДМ");  
	
	Если Не СтруктураДокумента.ПремиальнаяПерекупка = 1 Тогда
	
		Карта.Вставить("Контрагент", "КодКонтрагентаМДМ");
		Карта.Вставить("ДоговорКонтрагента", "КодДоговораМДМ");   

	КонецЕсли;   
	
	Карта.Вставить("Комментарий", "Комментарий"); 
	Карта.Вставить("ДатаПоступления", "ДатаПоставки"); 
	Карта.Вставить("ПополнениеЗапасов", "ПополнениеЗапасов"); 
	Карта.Вставить("ПремиальнаяПерекупка", "ПремиальнаяПерекупка");  
	
	Если Не СтруктураДокумента.ПополнениеЗапасов = 1 Тогда  
		Карта.Вставить("IDСклада", "КодСторонегоскладаМДМ");  
	КонецЕсли;
	
	Карта.Вставить("Товары.Номенклатура", "Товары.КодНоменклатурыМДМ"); 
	Карта.Вставить("Товары.Количество", "Товары.Количество");
	Карта.Вставить("Товары.КоличествоМест", "Товары.КоличествоУпаковок");   
	Карта.Вставить("Товары.Цена", "Товары.Цена");   
	Карта.Вставить("Товары.Сумма", "Товары.Сумма");  
	Карта.Вставить("Товары.СуммаНДС", "Товары.Сумма"); 
	Карта.Вставить("Товары.ПроизводительПоставщика", "Товары.ПроизводительПоставщика"); 
	

	Р_ЗагрузкаДокументов.ПолучитьДанныеСсылочногоТипа(Структура, Карта);
	
	Р_ЗагрузкаДокументов.ОбработатьДокументПоКарте(Структура, Карта);
	
	мОбъект = Структура.Объект;  
	
	мОбъект.Организация = Константы.ОсновнаяОрганизация.Получить();
	
	Если мОбъект.ПремиальнаяПерекупка Тогда
		
		мОбъект.Контрагент = Константы.ОсновнойПоставщик.Получить();
		мОбъект.ДоговорКонтрагента = мОбъект.Контрагент.ОсновнойДоговорКонтрагента;	
	
	КонецЕсли;    
	
	мСклад = мОбъект.Склад;
	
	мОбъект.Подразделение = мСклад.Подразделение; 
	мПодразделение = мОбъект.Подразделение; 

	мОбъект.СуммаВключаетНДС = Истина;  
	мОбъект.УчитыватьНДС = Истина;                                   
	мОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Создан;    
	мОбъект.КратностьВзаиморасчетов = 1;    
	мОбъект.КурсВзаиморасчетов = 1;
	
	мОбъект.Ответственный = ПолучитьПользователяПоФизЛицу(СтруктураДокумента.КодМенеджераМДМ);   
	
	ТекДата = '00010101';	
	
	Попытка
		ТекДата = мОбъект.Дата;
	Исключение
	КонецПопытки;
	
	ДатаНДС = ?(ЗначениеЗаполнено(ТекДата), ТекДата, ТекущаяДата());
	
	Для каждого тзСтрока Из мОбъект.Товары Цикл
		
		тзСтрока.ЕдиницаИзмерения = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков;    
		тзСтрока.ЕдиницаИзмеренияМест = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		//+Гавриленков В. 01.04.2026 #UT10-5799
		//тзСтрока.Коэффициент = 1;
		тзСтрока.Коэффициент = ?(ЗначениеЗаполнено(тзСтрока.ЕдиницаИзмерения.Коэффициент), тзСтрока.ЕдиницаИзмерения.Коэффициент, 1);
		//-Гавриленков В. 01.04.2026 #UT10-5799
		
		тзСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(тзСтрока.Номенклатура, ДатаНДС);
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(тзСтрока, мОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(тзСтрока, мОбъект);
		
	КонецЦикла;  
	
	Р_ЗагрузкаДокументов.ЗаписатьДокумент(Структура, Отказ); 
	
КонецПроцедуры    

Процедура Р_ЗагрузитьДокументПеремещение(Знач _СтруктураДокумента, Настройка, Отказ) Экспорт
	
	Структура = Р_ЗагрузкаДокументов.ПолучитьДанныеДокумента(_СтруктураДокумента, Настройка);
	СтруктураДокумента = Структура.СтруктураДокумента;
	
	Если Не Структура.ТребуетсяОбновление Тогда
		Возврат;
	КонецЕсли;                            
	
	Контрагент = ПолучитьКонтрагента(СтруктураДокумента.Контрагент);   
	
	Если Контрагент.Пустая() Тогда    
		
		Отказ = Истина;
		ВызватьИсключение "Не найден контрагент";  
		
	КонецЕсли;
	
	Карта = Новый Соответствие;
	Карта.Вставить("Дата",  "ДатаДокумента");
	Карта.Вставить("Номер", "НомерДокумента");
	Карта.Вставить("Склад", "КодСкладаМДМ");        
	Карта.Вставить("КодМДМ", "УникальныйИдентификатор"); 
	Карта.Вставить("Проведен", "Статус");
	Карта.Вставить("ПометкаУдаления", "ПометкаУдаления");
	Карта.Вставить("ШтампВерсии", "ШтампВерсии");
	Карта.Вставить("ДоговорКонтрагента", "КодДоговораМДМ");   
	Карта.Вставить("Товары.Номенклатура", "Товары.КодНоменклатурыМДМ"); 
	Карта.Вставить("Товары.Количество", "Товары.Количество");
	
	Р_ЗагрузкаДокументов.ПолучитьДанныеСсылочногоТипа(Структура, Карта);   
	Структура.Объект.Контрагент = Контрагент;
	
	Р_ЗагрузкаДокументов.ОбработатьДокументПоКарте(Структура, Карта);
	
	мОбъект = Структура.Объект;  
	
	мОбъект.Организация = Константы.ОсновнаяОрганизация.Получить();
	
	мСклад = мОбъект.Склад;
	
	мОбъект.Подразделение = мСклад.Подразделение; 
	мПодразделение = мОбъект.Подразделение; 

	мОбъект.СуммаВключаетНДС = мОбъект.ДоговорКонтрагента.ТипЦен.ЦенаВключаетНДС;  
	мОбъект.УчитыватьНДС = Истина;                                   
	мОбъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.Создан;  
	мОбъект.ВалютаДокумента 	= мОбъект.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	мОбъект.КратностьВзаиморасчетов = 1;    
	мОбъект.КурсВзаиморасчетов = 1;
	
	мОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;   
	мОбъект.Комментарий = "Загружен из Раббит по сообщению " + _СтруктураДокумента.КодСообщения;
	
	ТекДата = '00010101';	
	
	Попытка
		ТекДата = мОбъект.Дата;
	Исключение
	КонецПопытки;
	
	ДатаНДС = ?(ЗначениеЗаполнено(ТекДата), ТекДата, ТекущаяДата());
	
	Для каждого тзСтрока Из мОбъект.Товары Цикл
		
		тзСтрока.ЕдиницаИзмерения     = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков;    
		тзСтрока.ЕдиницаИзмеренияМест = тзСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		тзСтрока.Коэффициент          = ?(ЗначениеЗаполнено(тзСтрока.ЕдиницаИзмерения.Коэффициент), тзСтрока.ЕдиницаИзмерения.Коэффициент, 1);
		
		тзСтрока.СтавкаНДС = УчетНДС.ПолучитьСтавкуНДСПоНоменклатуре(тзСтрока.Номенклатура, ДатаНДС);
		
	КонецЦикла;
	
	// применим цену "Закупочная Москворечье " ко всему документу. Взято из обработки СоздатьЗаказПоставщику 
	СтруктураЗначений = Новый Структура();
	СтруктураЗначений.Вставить("ТекущийТипЦен"                 , Справочники.ТипыЦенНоменклатурыКонтрагентов.ПустаяСсылка());
	СтруктураЗначений.Вставить("ТекущийВалютаДокумента"        , мОбъект.ВалютаДокумента);
	СтруктураЗначений.Вставить("ТекущийВалютаВзаиморасчетов"   , мОбъект.ВалютаДокумента);
	СтруктураЗначений.Вставить("ТекущийКурсДокумента"          , 1);
	СтруктураЗначений.Вставить("ТекущийКурсВзаиморасчетов"     , 1);      
	СтруктураЗначений.Вставить("ТекущийКратностьДокумента"     , 1);
	СтруктураЗначений.Вставить("ТекущийУчитыватьНДС"           , Истина);
	СтруктураЗначений.Вставить("ТекущийСуммаВключаетНДС"       , Истина);
	СтруктураЗначений.Вставить("ПерезаполнитьЦеныПоТипу"       , Истина);
	СтруктураЗначений.Вставить("НовыйТипЦен"                   , 
	?(ЗначениеЗаполнено(мОбъект.ТипЦен), мОбъект.ТипЦен, Справочники.ТипыЦенНоменклатурыКонтрагентов.НайтиПоКоду("000000001")));     
	СтруктураЗначений.Вставить("ПересчитатьЦеныПоВалюте"       , Истина);  
	СтруктураЗначений.Вставить("НовыйВалютаДокумента"          , мОбъект.ВалютаДокумента);
	СтруктураЗначений.Вставить("НовыйКурсДокумента"            , 1);
	СтруктураЗначений.Вставить("НовыйКурсВзаиморасчетов"       , 1);   
	СтруктураЗначений.Вставить("НовыйКратностьДокумента"       , 1);
	СтруктураЗначений.Вставить("НовыйКратностьВзаиморасчетов"  , 1);
	СтруктураЗначений.Вставить("НовыйУчитыватьНДС"             , СтруктураЗначений.НовыйТипЦен.ЦенаВключаетНДС);
	СтруктураЗначений.Вставить("НовыйСуммаВключаетНДС"         , Истина);          
	СтруктураЗначений.Вставить("ЕстьСтавкаНДСВТабличнойЧасти"  , Истина);
	
	СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатурыКонтрагентов;
	СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(мОбъект);
	ЗаполнениеДокументов.ИзменитьЦеныВалюту(мОбъект, СпособЗаполненияЦен, СтруктураРеквизитовДокумента, , "Товары", 
	                        Константы.ВалютаРегламентированногоУчета.Получить(), , СтруктураЗначений);
	
	Для каждого тзСтрока Из мОбъект.Товары Цикл
		
		Если тзСтрока.Цена = 0 Тогда
			тзСтрока.Цена = 1;  
		КонецЕсли;
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(тзСтрока, мОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(тзСтрока, мОбъект);
		
	КонецЦикла;  
	
	Р_ЗагрузкаДокументов.ЗаписатьДокумент(Структура, Отказ);  
	
	Если Константы.ОтправлятьЗаказыВАварду.Получить() тогда
		РаботаСАвардой.ОтправитьЗаказВЦСВАварду(Структура.Объект.Ссылка); 
	КонецЕсли;
	
КонецПроцедуры    

Функция ПолучитьПользователяПоФизЛицу(КодМДМ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ФизЛицо.КодМДМ = &КодМДМ
		|	И НЕ Пользователи.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("КодМДМ", КодМДМ);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();  
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции // ()

Функция ПолучитьКонтрагента(ДанныеКонтрагента)
	
	Контрагент = Справочники.Контрагенты.ПустаяСсылка();
	
	Если Не ПустаяСтрока(ДанныеКонтрагента.КодМДМКонтрагента) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	НЕ Контрагенты.ПометкаУдаления
			|	И Контрагенты.КодМДМ = &КодМДМ";
		
		Запрос.УстановитьПараметр("КодМДМ", ДанныеКонтрагента.КодМДМКонтрагента);    
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	НЕ Контрагенты.ПометкаУдаления
			|	И Контрагенты.ИНН = &ИНН
			|	И Контрагенты.КПП = &КПП";
		
		Запрос.УстановитьПараметр("ИНН", ДанныеКонтрагента.ИНН);    
		Запрос.УстановитьПараметр("КПП", ДанныеКонтрагента.КПП);  
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий(); 
		Контрагент = Выборка.Ссылка;
	
	КонецЕсли;                      
	
	Возврат Контрагент;
	

КонецФункции // ()


